{
    "mn104:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sakkesu viharati sāmagāme.",
    "mn104:2": "Atha kho cundo samaṇuddeso pāvāyaṁvassaṁvuṭṭhoyena sāmagāmo yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṁ ānandaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho cundo samaṇuddeso āyasmantaṁ ānandaṁ etadavoca: \"nigaṇṭho, bhante, nāṭaputto pāvāyaṁ adhunākālaṅkato. Tassa kālaṁkiriyāya bhinnā nigaṇṭhā dvedhikajātā … pe … bhinnathūpe appaṭisaraṇe\"ti.",
    "mn104:3": "Atha kho āyasmā ca ānando cundo ca samaṇuddeso yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca: \"Ayaṁ, bhante, cundo samaṇuddeso evamāha: ‘nigaṇṭho, bhante, nāṭaputto pāvāyaṁ adhunākālaṅkato. Tassa kālaṁkiriyāya bhinnā nigaṇṭhā dvedhikajātā … pe … bhinnathūpe appaṭisaraṇe’ti. Tassa mayhaṁ, bhante, evaṁ hoti: ‘mā heva bhagavato accayena saṁghe vivādo uppajji;svāssavivādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānan’\"ti.",
    "mn104:4": "\"Taṁ kiṁ maññasi, ānanda, ye vo mayā dhammā abhiññā desitā, seyyathidaṁ — cattāro satipaṭṭhānā cattāro sammappadhānā cattāro iddhipādā pañcindriyāni pañca balāni satta bojjhaṅgā ariyo aṭṭhaṅgiko maggo, passasi no tvaṁ, ānanda, imesu dhammesu dvepi bhikkhū nānāvāde\"ti?",
    "mn104:5": "\"Appamattako so, ānanda, vivādo yadidaṁ — ajjhājīve vā adhipātimokkhe vā. Magge vā hi, ānanda, paṭipadāya vā saṅghe vivādo uppajjamāno uppajjeyya; svāssa vivādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṁ.",
    "mn104:6": "Chayimāni, ānanda, vivādamūlāni. Katamāni cha? Idhānanda, bhikkhu kodhano hoti upanāhī. Yo so, ānanda, bhikkhu kodhano hoti upanāhī so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṁghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, ānanda, bhikkhu satthari agāravo viharati appatisso, dhamme … saṁghe agāravo viharati appatisso, sikkhāya na paripūrakārī hoti, so saṁghe vivādaṁ janeti; yo hoti vivādo bahujanāhitāya bahujanāsukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṁ. Evarūpañce tumhe, ānanda, vivādamūlaṁ ajjhattaṁ vā bahiddhā vā samanupasseyyātha, tatra tumhe, ānanda, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, ānanda, vivādamūlaṁ ajjhattaṁ vā bahiddhā vā na samanupasseyyātha. Tatra tumhe, ānanda, tasseva pāpakassa vivādamūlassa āyatiṁ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṁ hoti, evametassa pāpakassa vivādamūlassa āyatiṁ anavassavo hoti.",
    "mn104:7": "Puna caparaṁ, ānanda, bhikkhu makkhī hoti paḷāsī … pe … issukī hoti maccharī … pe … saṭho hoti māyāvī … pe … pāpiccho hotimicchādiṭṭhi… pe … sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī. Yo so, ānanda, bhikkhu sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṁghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, ānanda, bhikkhu satthari agāravo viharati appatisso, dhamme … saṁghe … sikkhāya na paripūrakārī hoti so saṁghe vivādaṁ janeti; yo hoti vivādo bahujanāhitāya bahujanāsukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṁ. Evarūpañce tumhe, ānanda, vivādamūlaṁ ajjhattaṁ vā bahiddhā vā samanupasseyyātha. Tatra tumhe, ānanda, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, ānanda, vivādamūlaṁ ajjhattaṁ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, ānanda, tasseva pāpakassa vivādamūlassa āyatiṁ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṁ hoti, evametassa pāpakassa vivādamūlassa āyatiṁ anavassavo hoti. Imāni kho, ānanda, cha vivādamūlāni.",
    "mn104:8": "Cattārimāni, ānanda, adhikaraṇāni. Katamāni cattāri? Vivādādhikaraṇaṁ, anuvādādhikaraṇaṁ, āpattādhikaraṇaṁ, kiccādhikaraṇaṁ — imāni kho, ānanda, cattāri adhikaraṇāni.",
    "mn104:9": "Kathañcānanda, sammukhāvinayo hoti? Idhānanda, bhikkhū vivadanti dhammoti vā adhammoti vā vinayoti vā avinayoti vā. Tehānanda, bhikkhūhi sabbeheva samaggehi sannipatitabbaṁ. Sannipatitvā dhammanetti samanumajjitabbā. Dhammanettiṁ samanumajjitvā yathā tattha sameti tathā taṁ adhikaraṇaṁ vūpasametabbaṁ. Evaṁ kho, ānanda, sammukhāvinayo hoti; evañca panidhekaccānaṁ adhikaraṇānaṁ vūpasamo hoti yadidaṁ — sammukhāvinayena.(1)",
    "mn104:10": "Kathañcānanda, yebhuyyasikā hoti? Te ce, ānanda, bhikkhū na sakkonti taṁ adhikaraṇaṁ tasmiṁ āvāse vūpasametuṁ. Tehānanda, bhikkhūhi yasmiṁ āvāse bahutarā bhikkhū so āvāso gantabbo. Tattha sabbeheva samaggehi sannipatitabbaṁ. Sannipatitvā dhammanetti samanumajjitabbā. Dhammanettiṁ samanumajjitvā yathā tattha sameti tathā taṁ adhikaraṇaṁ vūpasametabbaṁ. Evaṁ kho, ānanda, yebhuyyasikā hoti, evañca panidhekaccānaṁ adhikaraṇānaṁ vūpasamo hoti yadidaṁ — yebhuyyasikāya.(2)",
    "mn104:11": "Kathañcānanda, sativinayo hoti? Idhānanda, bhikkhū bhikkhuṁ evarūpāya garukāya āpattiyā codenti pārājikena vā pārājikasāmantena vā: ‘saratāyasmāevarūpiṁgarukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti? So evamāha: ‘Na kho ahaṁ, āvuso, sarāmi evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti.Tassa kho, ānanda, bhikkhuno sativinayo dātabbo. Evaṁ kho, ānanda, sativinayo hoti, evañca panidhekaccānaṁ adhikaraṇānaṁ vūpasamo hoti yadidaṁ — sativinayena.(3)",
    "mn104:12": "Kathañcānanda, amūḷhavinayo hoti? Idhānanda, bhikkhū bhikkhuṁ evarūpāya garukāya āpattiyā codenti pārājikena vā pārājikasāmantena vā: ‘saratāyasmā evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti?So evamāha: ‘Na kho ahaṁ, āvuso, sarāmi evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti. Tamenaṁ so nibbeṭhentaṁ ativeṭheti: ‘iṅghāyasmā sādhukameva jānāhi yadi sarasi evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti. So evamāha: ‘Ahaṁ kho, āvuso, ummādaṁ pāpuṇiṁ cetaso vipariyāsaṁ. Tena me ummattakena bahuṁ assāmaṇakaṁ ajjhāciṇṇaṁbhāsitaparikkantaṁ. Nāhaṁ taṁ sarāmi. Mūḷhena me etaṁ katan’ti.Tassa kho, ānanda, bhikkhuno amūḷhavinayo dātabbo. Evaṁ kho, ānanda, amūḷhavinayo hoti, evañca panidhekaccānaṁ adhikaraṇānaṁ vūpasamo hoti yadidaṁ — amūḷhavinayena.(4)",
    "mn104:13": "Kathañcānanda, paṭiññātakaraṇaṁ hoti? Idhānanda, bhikkhu codito vā acodito vā āpattiṁ sarati, vivaratiuttānīkaroti. Tena, ānanda, bhikkhunāvuḍḍhataraṁ bhikkhuṁupasaṅkamitvā ekaṁsaṁ cīvaraṁ katvā pāde vanditvā ukkuṭikaṁ nisīditvā añjaliṁ paggahetvā evamassa vacanīyo: ‘Ahaṁ, bhante, itthannāmaṁ āpattiṁ āpanno, taṁ paṭidesemī’ti. So evamāha: ‘passasī’ti? ‘Āma passāmī’ti. ‘Āyatiṁsaṁvareyyāsī’ti. ‘Saṁvarissāmī’ti. Evaṁ kho, ānanda, paṭiññātakaraṇaṁ hoti, evañca panidhekaccānaṁ adhikaraṇānaṁ vūpasamo hoti yadidaṁ — paṭiññātakaraṇena.(5)",
    "mn104:14": "Kathañcānanda, tassapāpiyasikā hoti? Idhānanda, bhikkhu bhikkhuṁ evarūpāya garukāya āpattiyā codeti pārājikena vā pārājikasāmantena vā: ‘saratāyasmā evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti? So evamāha: ‘Na kho ahaṁ, āvuso, sarāmi evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti. Tamenaṁ so nibbeṭhentaṁ ativeṭheti: ‘iṅghāyasmā sādhukameva jānāhi yadi sarasi evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti. So evamāha: ‘Na kho ahaṁ, āvuso, sarāmi evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā; sarāmi ca kho ahaṁ, āvuso, evarūpiṁ appamattikaṁ āpattiṁ āpajjitā’ti. Tamenaṁ so nibbeṭhentaṁ ativeṭheti: ‘iṅghāyasmā sādhukameva jānāhi yadi sarasi evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti? So evamāha: ‘imañhi nāmāhaṁ, āvuso, appamattikaṁ āpattiṁ āpajjitvā apuṭṭho paṭijānissāmi. Kiṁ panāhaṁ evarūpiṁ garukaṁ āpattiṁ āpajjitvā pārājikaṁ vā pārājikasāmantaṁ vā puṭṭho na paṭijānissāmī’ti? So evamāha: ‘imañhi nāma tvaṁ, āvuso, appamattikaṁ āpattiṁ āpajjitvā apuṭṭho na paṭijānissasi, kiṁ pana tvaṁ evarūpiṁ garukaṁ āpattiṁ āpajjitvā pārājikaṁ vā pārājikasāmantaṁ vāpuṭṭhopaṭijānissasi? Iṅghāyasmā sādhukameva jānāhi yadi sarasi evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti. So evamāha: ‘sarāmi kho ahaṁ, āvuso, evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā. Davā me etaṁ vuttaṁ, ravā me etaṁ vuttaṁ — nāhaṁ taṁ sarāmi evarūpiṁ garukaṁ āpattiṁ āpajjitā pārājikaṁ vā pārājikasāmantaṁ vā’ti. Evaṁ kho, ānanda, tassapāpiyasikā hoti, evañca panidhekaccānaṁ adhikaraṇānaṁ vūpasamo hoti yadidaṁ — tassapāpiyasikāya.(6)",
    "mn104:15": "Kathañcānanda, tiṇavatthārako hoti? Idhānanda, bhikkhūnaṁ bhaṇḍanajātānaṁ kalahajātānaṁ vivādāpannānaṁ viharataṁ bahuṁ assāmaṇakaṁ ajjhāciṇṇaṁ hoti bhāsitaparikkantaṁ. Tehānanda, bhikkhūhi sabbeheva samaggehi sannipatitabbaṁ. Sannipatitvā ekatopakkhikānaṁ bhikkhūnaṁbyattenabhikkhunā uṭṭhāyāsanā ekaṁsaṁ cīvaraṁ katvā añjaliṁ paṇāmetvā saṁgho ñāpetabbo –",
    "mn104:16": "Suṇātu me, bhante, saṅgho. Idaṁ amhākaṁ bhaṇḍanajātānaṁ kalahajātānaṁ vivādāpannānaṁ viharataṁ bahuṁ assāmaṇakaṁ ajjhāciṇṇaṁ bhāsitaparikkantaṁ. Yadi saṅghassa pattakallaṁ, ahaṁ yā ceva imesaṁ āyasmantānaṁ āpatti yā ca attano āpatti, imesañceva āyasmantānaṁ atthāya attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṁ, ṭhapetvā thullavajjaṁ ṭhapetvā gihipaṭisaṁyuttan’ti.",
    "mn104:17": "Athāparesaṁ ekatopakkhikānaṁ bhikkhūnaṁ byattena bhikkhunā uṭṭhāyāsanā ekaṁsaṁ cīvaraṁ katvā añjaliṁ paṇāmetvā saṅgho ñāpetabbo:",
    "mn104:18": "‘Suṇātu me, bhante, saṅgho. Idaṁ amhākaṁ bhaṇḍanajātānaṁ kalahajātānaṁ vivādāpannānaṁ viharataṁ bahuṁ assāmaṇakaṁ ajjhāciṇṇaṁ bhāsitaparikkantaṁ. Yadi saṅghassa pattakallaṁ, ahaṁ yā ceva imesaṁ āyasmantānaṁ āpatti yā ca attano āpatti, imesañceva āyasmantānaṁ atthāya attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṁ, ṭhapetvā thullavajjaṁ ṭhapetvā gihipaṭisaṁyuttan’ti.",
    "mn104:19": "Evaṁ kho, ānanda, tiṇavatthārako hoti, evañca panidhekaccānaṁ adhikaraṇānaṁ vūpasamo hoti yadidaṁ — tiṇavatthārakena.(7)",
    "mn104:20": "Chayime, ānanda, dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattanti. Katame cha?",
    "mn104:21": "Puna caparaṁ, ānanda, bhikkhuno mettaṁ vacīkammaṁ paccupaṭṭhitaṁ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(2)",
    "mn104:22": "Puna caparaṁ, ānanda, bhikkhuno mettaṁ manokammaṁ paccupaṭṭhitaṁ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(3)",
    "mn104:23": "Puna caparaṁ, ānanda, bhikkhu — ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi tathārūpehi lābhehi — apaṭivibhattabhogī hoti, sīlavantehi sabrahmacārīhi sādhāraṇabhogī. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(4)",
    "mn104:24": "Puna caparaṁ, ānanda, bhikkhu — yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṁvattanikāni tathārūpesu sīlesu — sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(5)",
    "mn104:25": "Puna caparaṁ, ānanda, bhikkhu — yāyaṁ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya tathārūpāya diṭṭhiyā — diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(6)",
    "mn104:26": "Ime kho, ānanda, cha sāraṇīyā dhammā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattanti.",
    "mn104:27": "Ime ce tumhe, ānanda, cha sāraṇīye dhamme samādāya vatteyyātha, passatha no tumhe, ānanda, taṁ vacanapathaṁ aṇuṁ vā thūlaṁ vā yaṁ tumhe nādhivāseyyāthā\"ti? \"No hetaṁ, bhante\". \"Tasmātihānanda, ime cha sāraṇīye dhamme samādāya vattatha. Taṁ vo bhavissati dīgharattaṁ hitāya sukhāyā\"ti.",
    "mn104:28": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}