{
    "mn106:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā kurūsu viharati kammāsadhammaṁ nāma kurūnaṁ nigamo. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn106:2": "\"Aniccā, bhikkhave, kāmā tucchā musā mosadhammā. Māyākatametaṁ, bhikkhave, bālalāpanaṁ. Ye ca diṭṭhadhammikā kāmā, ye ca samparāyikā kāmā; yā ca diṭṭhadhammikā kāmasaññā, yā ca samparāyikā kāmasaññā — ubhayametaṁ māradheyyaṁ,mārassesavisayo, mārassesa nivāpo, mārassesa gocaro. Etthete pāpakā akusalā mānasā abhijjhāpi byāpādāpi sārambhāpi saṁvattanti. Teva ariyasāvakassa idhamanusikkhato antarāyāya sambhavanti.",
    "mn106:3": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘ye ca diṭṭhadhammikā kāmā, ye ca samparāyikā kāmā; yā ca diṭṭhadhammikā kāmasaññā, yā ca samparāyikā kāmasaññā; yaṁ kiñcirūpaṁ sabbaṁ rūpaṁ cattārica mahābhūtāni, catunnañca mahābhūtānaṁ upādāyarūpan’ti. Tassa evaṁpaṭipannassa tabbahulavihārino āyatane cittaṁ pasīdati. Sampasāde sati etarahi vā āneñjaṁ samāpajjati paññāya vā adhimuccati kāyassa bhedā paraṁ maraṇā. Ṭhānametaṁ vijjati yaṁ taṁsaṁvattanikaṁ viññāṇaṁ assa āneñjūpagaṁ. Ayaṁ, bhikkhave, dutiyā āneñjasappāyā paṭipadā akkhāyati.",
    "mn106:4": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘ye ca diṭṭhadhammikā kāmā, ye ca samparāyikā kāmā; yā ca diṭṭhadhammikā kāmasaññā, yā ca samparāyikā kāmasaññā; ye ca diṭṭhadhammikā rūpā, ye ca samparāyikā rūpā; yā ca diṭṭhadhammikā rūpasaññā, yā ca samparāyikā rūpasaññā — ubhayametaṁ aniccaṁ. Yadaniccaṁ taṁ nālaṁ abhinandituṁ, nālaṁ abhivadituṁ, nālaṁ ajjhositun’ti. Tassa evaṁpaṭipannassa tabbahulavihārino āyatane cittaṁ pasīdati. Sampasāde sati etarahi vā āneñjaṁ samāpajjati paññāya vā adhimuccati kāyassa bhedā paraṁ maraṇā. Ṭhānametaṁ vijjati yaṁ taṁsaṁvattanikaṁ viññāṇaṁ assa āneñjūpagaṁ. Ayaṁ, bhikkhave, tatiyā āneñjasappāyā paṭipadā akkhāyati.",
    "mn106:5": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘ye ca diṭṭhadhammikā kāmā, ye ca samparāyikā kāmā; yā ca diṭṭhadhammikā kāmasaññā, yā ca samparāyikā kāmasaññā; ye ca diṭṭhadhammikā rūpā, ye ca samparāyikā rūpā; yā ca diṭṭhadhammikā rūpasaññā, yā ca samparāyikā rūpasaññā; yā ca āneñjasaññā –  sabbā saññā. Yatthetā aparisesā nirujjhanti etaṁ santaṁ etaṁ paṇītaṁ — yadidaṁ ākiñcaññāyatanan’ti. Tassa evaṁpaṭipannassa tabbahulavihārino āyatane cittaṁ pasīdati. Sampasāde sati etarahi vā ākiñcaññāyatanaṁ samāpajjati paññāya vā adhimuccati kāyassa bhedā paraṁ maraṇā. Ṭhānametaṁ vijjati yaṁ taṁsaṁvattanikaṁ viññāṇaṁ assa ākiñcaññāyatanūpagaṁ. Ayaṁ, bhikkhave, paṭhamā ākiñcaññāyatanasappāyā paṭipadā akkhāyati.",
    "mn106:6": "Puna caparaṁ, bhikkhave, ariyasāvako araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati: ‘suññamidaṁ attena vā attaniyena vā’ti. Tassa evaṁpaṭipannassa tabbahulavihārino āyatane cittaṁ pasīdati. Sampasāde sati etarahi vā ākiñcaññāyatanaṁ samāpajjati paññāya vā adhimuccati kāyassa bhedā paraṁ maraṇā. Ṭhānametaṁ vijjati yaṁ taṁsaṁvattanikaṁ viññāṇaṁ assa ākiñcaññāyatanūpagaṁ. Ayaṁ, bhikkhave, dutiyā ākiñcaññāyatanasappāyā paṭipadā akkhāyati.",
    "mn106:7": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘nāhaṁkvacanikassacikiñcanatasmiṁ, na ca mama kvacani kismiñci kiñcanaṁ natthī’ti. Tassa evaṁpaṭipannassa tabbahulavihārino āyatane cittaṁ pasīdati. Sampasāde sati etarahi vā ākiñcaññāyatanaṁ samāpajjati paññāya vā adhimuccati kāyassa bhedā paraṁ maraṇā. Ṭhānametaṁ vijjati yaṁ taṁsaṁvattanikaṁ viññāṇaṁ assa ākiñcaññāyatanūpagaṁ. Ayaṁ, bhikkhave, tatiyā ākiñcaññāyatanasappāyā paṭipadā akkhāyati.",
    "mn106:8": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘ye ca diṭṭhadhammikā kāmā, ye ca samparāyikā kāmā; yā ca diṭṭhadhammikā kāmasaññā, yā ca samparāyikā kāmasaññā; ye ca diṭṭhadhammikā rūpā, ye ca samparāyikā rūpā; yā ca diṭṭhadhammikā rūpasaññā, yā ca samparāyikā rūpasaññā; yā ca āneñjasaññā, yā ca ākiñcaññāyatanasaññā — sabbā saññā. Yatthetā aparisesā nirujjhanti etaṁ santaṁ etaṁ paṇītaṁ — yadidaṁ nevasaññānāsaññāyatanan’ti. Tassa evaṁpaṭipannassa tabbahulavihārino āyatane cittaṁ pasīdati. Sampasāde sati etarahi vā nevasaññānāsaññāyatanaṁ samāpajjati paññāya vā adhimuccati kāyassa bhedā paraṁ maraṇā. Ṭhānametaṁ vijjati yaṁ taṁsaṁvattanikaṁ viññāṇaṁ assa nevasaññānāsaññāyatanūpagaṁ. Ayaṁ, bhikkhave, nevasaññānāsaññāyatanasappāyā paṭipadā akkhāyatī\"ti.",
    "mn106:9": "Evaṁ vutte, āyasmā ānando bhagavantaṁ etadavoca: \"idha, bhante, bhikkhu evaṁ paṭipanno hoti: ‘no cassa, no ca me siyā; na bhavissati, na me bhavissati; yadatthi yaṁ, bhūtaṁ — taṁ pajahāmī’ti. Evaṁ upekkhaṁ paṭilabhati. Parinibbāyeyya nu kho so, bhante, bhikkhu na vā parinibbāyeyyā\"ti?",
    "mn106:10": "Idhānanda, bhikkhu evaṁ paṭipanno hoti: ‘no cassa, no ca me siyā; na bhavissati, na me bhavissati; yadatthi, yaṁ bhūtaṁ — taṁ pajahāmī’ti. Evaṁ upekkhaṁ paṭilabhati. So taṁ upekkhaṁ nābhinandati, nābhivadati, na ajjhosāya tiṭṭhati. Tassa taṁ upekkhaṁ anabhinandato anabhivadato anajjhosāya tiṭṭhato na tannissitaṁ hoti viññāṇaṁ na tadupādānaṁ. Anupādāno, ānanda, bhikkhu parinibbāyatī\"ti.",
    "mn106:11": "\"Acchariyaṁ, bhante, abbhutaṁ, bhante. Nissāya nissāya kira no, bhante, bhagavatā oghassa nittharaṇā akkhātā. Katamo pana, bhante, ariyo vimokkho\"ti?",
    "mn106:12": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}