{
    "mn109:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati pubbārāme migāramātupāsāde.",
    "mn109:2": "\"Puccheyyāhaṁ, bhante, bhagavantaṁ kiñcideva desaṁ, sace me bhagavā okāsaṁ karoti pañhassa veyyākaraṇāyā\"ti. \"Tena hi tvaṁ, bhikkhu, sake āsane nisīditvā puccha yadākaṅkhasī\"ti.",
    "mn109:3": "Atha kho so bhikkhu sake āsane nisīditvā bhagavantaṁ etadavoca:",
    "mn109:4": "\"Sādhu, bhante\"ti kho so bhikkhu bhagavato bhāsitaṁ abhinanditvā anumoditvā bhagavantaṁ uttariṁ pañhaṁ pucchi:",
    "mn109:5": "\"Siyā pana, bhante, pañcasu upādānakkhandhesu chandarāgavemattatā\"ti?",
    "mn109:6": "\"Kittāvatā pana, bhante, khandhānaṁ khandhādhivacanaṁ hotī\"ti?",
    "mn109:7": "\"Ko nu kho, bhante, hetu ko paccayo rūpakkhandhassa paññāpanāya? Ko hetu ko paccayo vedanākkhandhassa paññāpanāya? Ko hetu ko paccayo saññākkhandhassa paññāpanāya? Ko hetu ko paccayo saṅkhārakkhandhassa paññāpanāya? Ko hetu ko paccayo viññāṇakkhandhassa paññāpanāyā\"ti?",
    "mn109:8": "\"Cattāro kho, bhikkhu, mahābhūtā hetu, cattāro mahābhūtā paccayo rūpakkhandhassa paññāpanāya. Phasso hetu, phasso paccayo vedanākkhandhassa paññāpanāya. Phasso hetu, phasso paccayo saññākkhandhassa paññāpanāya. Phasso hetu, phasso paccayo saṅkhārakkhandhassa paññāpanāya. Nāmarūpaṁ kho, bhikkhu, hetu, nāmarūpaṁ paccayo viññāṇakkhandhassa paññāpanāyā\"ti.",
    "mn109:9": "\"Kathaṁ pana, bhante, sakkāyadiṭṭhi hotī\"ti?",
    "mn109:10": "\"Kathaṁ pana, bhante, sakkāyadiṭṭhi na hotī\"ti?",
    "mn109:11": "\"Ko nu kho, bhante, rūpe assādo, ko ādīnavo, kiṁ nissaraṇaṁ? Ko vedanāya assādo, ko ādīnavo, kiṁ nissaraṇaṁ? Ko saññāya assādo, ko ādīnavo, kiṁ nissaraṇaṁ? Ko saṅkhāresu assādo, ko ādīnavo, kiṁ nissaraṇaṁ? Ko viññāṇe assādo, ko ādīnavo, kiṁ nissaraṇan\"ti?",
    "mn109:12": "\"Kathaṁ pana, bhante, jānato kathaṁ passato imasmiñca saviññāṇake kāye bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānānusayā na hontī\"ti?",
    "mn109:13": "Atha kho aññatarassa bhikkhuno evaṁ cetaso parivitakko udapādi: \"iti kira, bho, rūpaṁ anattā, vedanā anattā, saññā anattā, saṅkhārā anattā, viññāṇaṁ anattā; anattakatānikammāni kamattānaṁphusissantī\"ti?",
    "mn109:14": "Taṁ kiṁ maññatha, bhikkhave, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti? \"Dukkhaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti? \"No hetaṁ, bhante\".",
    "mn109:15": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti. Imasmiñca pana veyyākaraṇasmiṁ bhaññamāne saṭṭhimattānaṁ bhikkhūnaṁ anupādāya āsavehi cittāni vimucciṁsūti."
}