{
    "mn100:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā kosalesu cārikaṁ carati mahatā bhikkhusaṁghena saddhiṁ.",
    "mn100:2": "\"Namo tassa bhagavato arahato sammāsambuddhassa.",
    "mn100:3": "Namo tassa bhagavato arahato sammāsambuddhassa.",
    "mn100:4": "Namo tassa bhagavato arahato sammāsambuddhassā\"ti.",
    "mn100:5": "Tena kho pana samayena saṅgāravo nāma māṇavo cañcalikappe paṭivasati tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ, padako, veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayo. Assosi kho saṅgāravo māṇavo dhanañjāniyā brāhmaṇiyā evaṁ vācaṁ bhāsamānāya. Sutvā dhanañjāniṁ brāhmaṇiṁ etadavoca: \"avabhūtāva ayaṁdhanañjānī brāhmaṇī,parabhūtāva ayaṁdhanañjānī brāhmaṇī, vijjamānānaṁtevijjānaṁbrāhmaṇānaṁ, atha ca pana tassa muṇḍakassa samaṇakassa vaṇṇaṁbhāsissatī\"ti.",
    "mn100:6": "Atha kho bhagavā kosalesu anupubbena cārikaṁ caramāno yena cañcalikappaṁ tadavasari. Tatra sudaṁ bhagavā cañcalikappe viharati todeyyānaṁ brāhmaṇānaṁ ambavane.",
    "mn100:7": "\"Evaṁ, bho\"ti kho saṅgāravo māṇavo dhanañjāniyā brāhmaṇiyā paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho saṅgāravo māṇavo bhagavantaṁ etadavoca:",
    "mn100:8": "\"Santi kho, bho gotama, eke samaṇabrāhmaṇā diṭṭhadhammābhiññāvosānapāramippattā, ādibrahmacariyaṁ paṭijānanti. Tatra, bho gotama, ye te samaṇabrāhmaṇā diṭṭhadhammābhiññāvosānapāramippattā, ādibrahmacariyaṁ paṭijānanti, tesaṁ bhavaṁ gotamo katamo\"ti?",
    "mn100:9": "\"diṭṭhadhammābhiññāvosānapāramippattānaṁ, ādibrahmacariyaṁ paṭijānantānampi kho ahaṁ, bhāradvāja, vemattaṁ vadāmi. Santi, bhāradvāja, eke samaṇabrāhmaṇā anussavikā. Te anussavena diṭṭhadhammābhiññāvosānapāramippattā, ādibrahmacariyaṁ paṭijānanti; seyyathāpi brāhmaṇā tevijjā. Santi pana, bhāradvāja, eke samaṇabrāhmaṇā kevalaṁ saddhāmattakena diṭṭhadhammābhiññāvosānapāramippattā, ādibrahmacariyaṁ paṭijānanti; seyyathāpi takkī vīmaṁsī. Santi, bhāradvāja, eke samaṇabrāhmaṇā pubbe ananussutesu dhammesu sāmaṁyeva dhammaṁ abhiññāya diṭṭhadhammābhiññāvosānapāramippattā, ādibrahmacariyaṁ paṭijānanti.",
    "mn100:10": "Idha me, bhāradvāja, pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi: ‘sambādho gharāvāso rajāpatho, abbhokāso pabbajjā. Nayidaṁ sukaraṁ agāraṁ ajjhāvasatā ekantaparipuṇṇaṁ ekantaparisuddhaṁ saṅkhalikhitaṁ brahmacariyaṁ carituṁ. Yannūnāhaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajeyyan’ti. So kho ahaṁ, bhāradvāja, aparena samayena daharova samāno susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā akāmakānaṁ mātāpitūnaṁ assumukhānaṁ rudantānaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajiṁ.",
    "mn100:11": "Atha khvāhaṁ, bhāradvāja, yena āḷāro kālāmo tenupasaṅkamiṁ; upasaṅkamitvā āḷāraṁ kālāmaṁ etadavocaṁ: ‘kittāvatā no, āvuso kālāma, imaṁ dhammaṁ sayaṁ abhiññā sacchikatvā upasampajja viharāmīti pavedesī’ti? Evaṁ vutte, bhāradvāja, āḷāro kālāmo ākiñcaññāyatanaṁ pavedesi.",
    "mn100:12": "So kho ahaṁ, bhāradvāja, kiṁkusalagavesī anuttaraṁ santivarapadaṁ pariyesamāno yena udako rāmaputto tenupasaṅkamiṁ; upasaṅkamitvā udakaṁ rāmaputtaṁ etadavocaṁ: ‘icchāmahaṁ, āvuso, imasmiṁ dhammavinaye brahmacariyaṁ caritun’ti. Evaṁ vutte, bhāradvāja, udako rāmaputto maṁ etadavoca: ‘viharatāyasmā. Tādiso ayaṁ dhammo yattha viññū puriso nacirasseva sakaṁ ācariyakaṁ sayaṁ abhiññā sacchikatvā upasampajja vihareyyā’ti. So kho ahaṁ, bhāradvāja, nacirasseva khippameva taṁ dhammaṁ pariyāpuṇiṁ. So kho ahaṁ, bhāradvāja, tāvatakeneva oṭṭhapahatamattena lapitalāpanamattena ‘ñāṇavādañca vadāmi, theravādañca jānāmi, passāmī’ti ca paṭijānāmi, ahañceva aññe ca. Tassa mayhaṁ, bhāradvāja, etadahosi: ‘Na kho rāmo imaṁ dhammaṁ kevalaṁ saddhāmattakena sayaṁ abhiññā sacchikatvā upasampajja viharāmīti pavedesi; addhā rāmo imaṁ dhammaṁ jānaṁ passaṁ vihāsī’ti.",
    "mn100:13": "Atha khvāhaṁ, bhāradvāja, yena udako rāmaputto tenupasaṅkamiṁ; upasaṅkamitvā udakaṁ rāmaputtaṁ etadavocaṁ: ‘ettāvatā no, āvuso, rāmo imaṁ dhammaṁ sayaṁ abhiññā sacchikatvā upasampajja pavedesī’ti?",
    "mn100:14": "So kho ahaṁ, bhāradvāja, kiṅkusalagavesī anuttaraṁ santivarapadaṁ pariyesamāno magadhesu anupubbena cārikaṁ caramāno yena uruvelā senānigamo tadavasariṁ. Tatthaddasaṁ ramaṇīyaṁ bhūmibhāgaṁ, pāsādikañca vanasaṇḍaṁ, nadiñca sandantiṁ setakaṁ supatitthaṁ ramaṇīyaṁ, samantā ca gocaragāmaṁ. Tassa mayhaṁ, bhāradvāja, etadahosi: ‘ramaṇīyo vata bho bhūmibhāgo, pāsādiko ca vanasaṇḍo, nadī ca sandati setakā supatitthā ramaṇīyā, samantā ca gocaragāmo. Alaṁ vatidaṁ kulaputtassa padhānatthikassa padhānāyā’ti. So kho ahaṁ, bhāradvāja, tattheva nisīdiṁ: ‘alamidaṁ padhānāyā’ti.",
    "mn100:15": "Seyyathāpi, bhāradvāja, allaṁ kaṭṭhaṁ sasnehaṁ udake nikkhittaṁ. Atha puriso āgaccheyya uttarāraṇiṁ ādāya: ‘aggiṁ abhinibbattessāmi, tejo pātukarissāmī’ti. Taṁ kiṁ maññasi, bhāradvāja, api nu so puriso amuṁ allaṁ kaṭṭhaṁ sasnehaṁ udake nikkhittaṁ uttarāraṇiṁ ādāya abhimanthento aggiṁ abhinibbatteyya, tejo pātukareyyā\"ti?",
    "mn100:16": "Aparāpi kho maṁ, bhāradvāja, dutiyā upamā paṭibhāsi anacchariyā pubbe assutapubbā. Seyyathāpi, bhāradvāja, allaṁ kaṭṭhaṁ sasnehaṁ ārakā udakā thale nikkhittaṁ. Atha puriso āgaccheyya uttarāraṇiṁ ādāya: ‘aggiṁ abhinibbattessāmi, tejo pātukarissāmī’ti. Taṁ kiṁ maññasi, bhāradvāja, api nu so puriso amuṁ allaṁ kaṭṭhaṁ sasnehaṁ ārakā udakā thale nikkhittaṁ uttarāraṇiṁ ādāya abhimanthento aggiṁ abhinibbatteyya tejo pātukareyyā\"ti?",
    "mn100:17": "Aparāpi kho maṁ, bhāradvāja, tatiyā upamā paṭibhāsi anacchariyā pubbe assutapubbā. Seyyathāpi, bhāradvāja, sukkhaṁ kaṭṭhaṁ koḷāpaṁ ārakā udakā thale nikkhittaṁ. Atha puriso āgaccheyya uttarāraṇiṁ ādāya: ‘aggiṁ abhinibbattessāmi, tejo pātukarissāmī’ti. Taṁ kiṁ maññasi, bhāradvāja, api nu so puriso amuṁ sukkhaṁ kaṭṭhaṁ koḷāpaṁ ārakā udakā thale nikkhittaṁ uttarāraṇiṁ ādāya abhimanthento aggiṁ abhinibbatteyya, tejo pātukareyyā\"ti?",
    "mn100:18": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘yannūnāhaṁ dantebhidantamādhāya, jivhāya tāluṁ āhacca, cetasā cittaṁ abhiniggaṇheyyaṁ abhinippīḷeyyaṁ abhisantāpeyyan’ti. So kho ahaṁ, bhāradvāja, dantebhidantamādhāya, jivhāya tāluṁ āhacca, cetasā cittaṁ abhiniggaṇhāmi abhinippīḷemi abhisantāpemi. Tassa mayhaṁ, bhāradvāja, dantebhidantamādhāya, jivhāya tāluṁ āhacca, cetasā cittaṁ abhiniggaṇhato abhinippīḷayato abhisantāpayato kacchehi sedā muccanti. Seyyathāpi, bhāradvāja, balavā puriso dubbalataraṁ purisaṁ sīse vā gahetvā khandhe vā gahetvā abhiniggaṇheyya abhinippīḷeyya abhisantāpeyya; evameva kho me, bhāradvāja, dantebhidantamādhāya, jivhāya tāluṁ āhacca, cetasā cittaṁ abhiniggaṇhato abhinippīḷayato abhisantāpayato kacchehi sedā muccanti. Āraddhaṁ kho pana me, bhāradvāja, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā; sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn100:19": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, bhāradvāja, mukhato ca nāsato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, bhāradvāja, mukhato ca nāsato ca assāsapassāsesu uparuddhesu kaṇṇasotehi vātānaṁ nikkhamantānaṁ adhimatto saddo hoti. Seyyathāpi nāma kammāragaggariyā dhamamānāya adhimatto saddo hoti; evameva kho me, bhāradvāja, mukhato ca nāsato ca assāsapassāsesu uparuddhesu kaṇṇasotehi vātānaṁ nikkhamantānaṁ adhimatto saddo hoti. Āraddhaṁ kho pana me, bhāradvāja, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā; sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn100:20": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā vātā muddhani ūhananti. Seyyathāpi, bhāradvāja, balavā puriso, tiṇhena sikharena muddhani abhimattheyya; evameva kho me, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā vātā muddhani ūhananti. Āraddhaṁ kho pana me, bhāradvāja, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā; sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn100:21": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā sīse sīsavedanā honti. Seyyathāpi, bhāradvāja, balavā puriso daḷhena varattakkhaṇḍena sīse sīsaveṭhaṁ dadeyya; evameva kho, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā sīse sīsavedanā honti. Āraddhaṁ kho pana me, bhāradvāja, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā; sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn100:22": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā vātā kucchiṁ parikantanti. Seyyathāpi, bhāradvāja, dakkho goghātako vā goghātakantevāsī vā tiṇhena govikantanena kucchiṁ parikanteyya; evameva kho me, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā vātā kucchiṁ parikantanti. Āraddhaṁ kho pana me, bhāradvāja, vīriyaṁ hoti asallīnaṁ upaṭṭhitā sati asammuṭṭhā; sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn100:23": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimatto kāyasmiṁ ḍāho hoti. Seyyathāpi, bhāradvāja, dve balavanto purisā dubbalataraṁ purisaṁ nānābāhāsu gahetvā aṅgārakāsuyā santāpeyyuṁ samparitāpeyyuṁ; evameva kho me, bhāradvāja, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimatto kāyasmiṁ ḍāho hoti. Āraddhaṁ kho pana me, bhāradvāja, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā, sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn100:24": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘yannūnāhaṁ sabbaso āhārupacchedāya paṭipajjeyyan’ti. Atha kho maṁ, bhāradvāja, devatā upasaṅkamitvā etadavocuṁ: ‘mā kho tvaṁ, mārisa, sabbaso āhārupacchedāya paṭipajji. Sace kho tvaṁ, mārisa, sabbaso āhārupacchedāya paṭipajjissasi, tassa te mayaṁ dibbaṁ ojaṁ lomakūpehi ajjhohāressāma. Tāya tvaṁ yāpessasī’ti. Tassa mayhaṁ, bhāradvāja, etadahosi: ‘ahañceva kho pana sabbaso ajajjitaṁ paṭijāneyyaṁ, imā ca me devatā dibbaṁ ojaṁ lomakūpehi ajjhohāreyyuṁ, tāya cāhaṁ yāpeyyaṁ. Taṁ mamassa musā’ti. So kho ahaṁ, bhāradvāja, tā devatā paccācikkhāmi, ‘halan’ti vadāmi.",
    "mn100:25": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘yannūnāhaṁ thokaṁ thokaṁ āhāraṁ āhāreyyaṁ pasataṁ pasataṁ, yadi vā muggayūsaṁ, yadi vā kulatthayūsaṁ, yadi vā kaḷāyayūsaṁ, yadi vā hareṇukayūsan’ti. So kho ahaṁ, bhāradvāja, thokaṁ thokaṁ āhāraṁ āhāresiṁ pasataṁ pasataṁ, yadi vā muggayūsaṁ, yadi vā kulatthayūsaṁ, yadi vā kaḷāyayūsaṁ, yadi vā hareṇukayūsaṁ. Tassa mayhaṁ, bhāradvāja, thokaṁ thokaṁ āhāraṁ āhārayato pasataṁ pasataṁ, yadi vā muggayūsaṁ, yadi vā kulatthayūsaṁ, yadi vā kaḷāyayūsaṁ, yadi vā hareṇukayūsaṁ, adhimattakasimānaṁ patto kāyo hoti. Seyyathāpi nāma āsītikapabbāni vā kāḷapabbāni vā; evamevassu me aṅgapaccaṅgāni bhavanti tāyevappāhāratāya. Seyyathāpi nāma oṭṭhapadaṁ; evamevassu me ānisadaṁ hoti tāyevappāhāratāya; seyyathāpi nāma vaṭṭanāvaḷī; evamevassu me piṭṭhikaṇṭako uṇṇatāvanato hoti tāyevappāhāratāya. Seyyathāpi nāma jarasālāya gopānasiyo oluggaviluggā bhavanti; evamevassu me phāsuḷiyo oluggaviluggā bhavanti tāyevappāhāratāya. Seyyathāpi nāma gambhīre udapāne udakatārakā gambhīragatā okkhāyikā dissanti; evamevassu me akkhikūpesu akkhitārakā gambhīragatā okkhāyikā dissanti tāyevappāhāratāya. Seyyathāpi nāma tittakālābu āmakacchinno vātātapena samphuṭito hoti sammilāto; evamevassu me sīsacchavi samphuṭitā hoti sammilātā tāyevappāhāratāya. So kho ahaṁ, bhāradvāja, ‘udaracchaviṁ parimasissāmī’ti piṭṭhikaṇṭakaṁyeva pariggaṇhāmi, ‘piṭṭhikaṇṭakaṁ parimasissāmī’ti udaracchaviṁyeva pariggaṇhāmi; yāvassu me, bhāradvāja, udaracchavi piṭṭhikaṇṭakaṁ allīnā hoti tāyevappāhāratāya. So kho ahaṁ, bhāradvāja, ‘vaccaṁ vā muttaṁ vā karissāmī’ti tattheva avakujjo papatāmi tāyevappāhāratāya. So kho ahaṁ, bhāradvāja, imameva kāyaṁ assāsento pāṇinā gattāni anumajjāmi. Tassa mayhaṁ, bhāradvāja, pāṇinā gattāni anumajjato pūtimūlāni lomāni kāyasmā papatanti tāyevappāhāratāya.",
    "mn100:26": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘ye kho keci atītamaddhānaṁ samaṇā vā brāhmaṇā vā opakkamikā dukkhā tibbā kharā kaṭukā vedanā vedayiṁsu, etāvaparamaṁ, nayito bhiyyo; yepi hi keci anāgatamaddhānaṁ samaṇā vā brāhmaṇā vā opakkamikā dukkhā tibbā kharā kaṭukā vedanā vedayissanti, etāvaparamaṁ, nayito bhiyyo; yepi hi keci etarahi samaṇā vā brāhmaṇā vā opakkamikā dukkhā tibbā kharā kaṭukā vedanā vedayanti, etāvaparamaṁ, nayito bhiyyo. Na kho panāhaṁ imāya kaṭukāya dukkarakārikāya adhigacchāmi uttari manussadhammā alamariyañāṇadassanavisesaṁ. Siyā nu kho añño maggo bodhāyā’ti?",
    "mn100:27": "Tassa mayhaṁ, bhāradvāja, etadahosi: ‘Na kho taṁ sukaraṁ sukhaṁ adhigantuṁ evaṁ adhimattakasimānaṁ pattakāyena. Yannūnāhaṁ oḷārikaṁ āhāraṁ āhāreyyaṁ odanakummāsan’ti. So kho ahaṁ, bhāradvāja, oḷārikaṁ āhāraṁ āhāresiṁ odanakummāsaṁ. Tena kho pana maṁ, bhāradvāja, samayena pañcavaggiyā bhikkhū paccupaṭṭhitā honti: ‘Yaṁ kho samaṇo gotamo dhammaṁ adhigamissati taṁ no ārocessatī’ti. Yato kho ahaṁ, bhāradvāja, oḷārikaṁ āhāraṁ āhāresiṁ odanakummāsaṁ, atha me te pañcavaggiyā bhikkhū nibbijja pakkamiṁsu: ‘bāhulliko samaṇo gotamo padhānavibbhanto āvatto bāhullāyā’ti.",
    "mn100:28": "So kho ahaṁ, bhāradvāja, oḷārikaṁ āhāraṁ āhāretvā balaṁ gahetvā vivicceva kāmehi … pe … paṭhamaṁ jhānaṁ upasampajja vihāsiṁ. Vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ … tatiyaṁ jhānaṁ … catutthaṁ jhānaṁ upasampajja vihāsiṁ.",
    "mn100:29": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhininnāmesiṁ. So anekavihitaṁ pubbenivāsaṁ anussarāmi, seyyathidaṁ — ekampi jātiṁ dvepi jātiyo … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarāmi.",
    "mn100:30": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhininnāmesiṁ.",
    "mn100:31": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmesiṁ. So ‘idaṁ dukkhan’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ abbhaññāsiṁ; ‘ime āsavā’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ āsavasamudayo’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ āsavanirodho’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ āsavanirodhagāminī paṭipadā’ti yathābhūtaṁ abbhaññāsiṁ.",
    "mn100:32": "Evaṁ vutte, saṅgāravo māṇavo bhagavantaṁ etadavoca: \"aṭṭhitavataṁbhoto gotamassa padhānaṁ ahosi,sappurisavataṁbhoto gotamassa padhānaṁ ahosi; yathā taṁ arahato sammāsambuddhassa. Kiṁ nu kho, bho gotama,atthi devā\"ti?",
    "mn100:33": "Evaṁ vutte, saṅgāravo māṇavo bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti.",
    "mn100:34": "Brahmāyu selassalāyano,ghoṭamukho ca brāhmaṇo;Caṅkī esu dhanañjāni,vāseṭṭho subhagāravoti.",
    "mn100:35": "Vaggo gahapati bhikkhu,paribbājakanāmako;Rājavaggo brāhmaṇoti,pañca majjhimaāgame."
}