{
    "mn101:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sakkesu viharati devadahaṁ nāma sakyānaṁ nigamo. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn101:2": "Evaṁvādāhaṁ, bhikkhave, nigaṇṭhe upasaṅkamitvā evaṁ vadāmi: ‘saccaṁ kira tumhe, āvuso nigaṇṭhā, evaṁvādino evaṁdiṭṭhino — yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, sabbaṁ taṁ pubbekatahetu. Iti purāṇānaṁ kammānaṁ tapasā byantībhāvā, navānaṁ kammānaṁ akaraṇā, āyatiṁ anavassavo; āyatiṁ anavassavā kammakkhayo; kammakkhayā dukkhakkhayo; dukkhakkhayā vedanākkhayo; vedanākkhayā sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī’ti? Te ca me, bhikkhave, nigaṇṭhā evaṁ puṭṭhā ‘āmā’ti paṭijānanti.",
    "mn101:3": "Tyāhaṁ evaṁ vadāmi: ‘kiṁ pana tumhe, āvuso nigaṇṭhā, jānātha — ahuvamheva mayaṁ pubbe, na nāhuvamhā’ti?",
    "mn101:4": "‘Kiṁ pana tumhe, āvuso nigaṇṭhā, jānātha — akaramheva mayaṁ pubbe pāpakammaṁ, na nākaramhā’ti?",
    "mn101:5": "‘Kiṁ pana tumhe, āvuso nigaṇṭhā, jānātha — evarūpaṁ vā evarūpaṁ vā pāpakammaṁ akaramhā’ti?",
    "mn101:6": "‘Kiṁ pana tumhe, āvuso nigaṇṭhā, jānātha — ettakaṁ vā dukkhaṁ nijjiṇṇaṁ, ettakaṁ vā dukkhaṁ nijjīretabbaṁ, ettakamhi vā dukkhe nijjiṇṇe sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī’ti?",
    "mn101:7": "‘Kiṁ pana tumhe, āvuso nigaṇṭhā, jānātha — diṭṭheva dhamme akusalānaṁ dhammānaṁ pahānaṁ, kusalānaṁ dhammānaṁ upasampadan’ti?",
    "mn101:8": "‘Iti kira tumhe, āvuso nigaṇṭhā, na jānātha — ahuvamheva mayaṁ pubbe, na nāhuvamhāti, na jānātha — akaramheva mayaṁ pubbe pāpakammaṁ, na nākaramhāti, na jānātha — evarūpaṁ vā evarūpaṁ vā pāpakammaṁ akaramhāti, na jānātha — ettakaṁ vā dukkhaṁ nijjiṇṇaṁ, ettakaṁ vā dukkhaṁ nijjīretabbaṁ, ettakamhi vā dukkhe nijjiṇṇe sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatīti, na jānātha — diṭṭheva dhamme akusalānaṁ dhammānaṁ pahānaṁ, kusalānaṁ dhammānaṁ upasampadaṁ; evaṁ sante āyasmantānaṁ nigaṇṭhānaṁ na kallamassa veyyākaraṇāya: \"yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, sabbaṁ taṁ pubbekatahetu. Iti purāṇānaṁ kammānaṁ tapasā byantībhāvā, navānaṁ kammānaṁ akaraṇā, āyatiṁ anavassavo; āyatiṁ anavassavā kammakkhayo; kammakkhayā dukkhakkhayo; dukkhakkhayā vedanākkhayo; vedanākkhayā sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī\"ti.",
    "mn101:9": "Sace pana tumhe, āvuso nigaṇṭhā, jāneyyātha — ahuvamheva mayaṁ pubbe, na nāhuvamhāti, jāneyyātha — akaramheva mayaṁ pubbe pāpakammaṁ, na nākaramhāti, jāneyyātha — evarūpaṁ vā evarūpaṁ vā pāpakammaṁ akaramhāti, jāneyyātha –  ettakaṁ vā dukkhaṁ nijjiṇṇaṁ, ettakaṁ vā dukkhaṁ nijjīretabbaṁ, ettakamhi vā dukkhe nijjiṇṇe sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatīti, jāneyyātha — diṭṭheva dhamme akusalānaṁ dhammānaṁ pahānaṁ, kusalānaṁ dhammānaṁ upasampadaṁ; evaṁ sante āyasmantānaṁ nigaṇṭhānaṁ kallamassa veyyākaraṇāya: \"yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, sabbaṁ taṁ pubbekatahetu. Iti purāṇānaṁ kammānaṁ tapasā byantībhāvā, navānaṁ kammānaṁ akaraṇā, āyatiṁ anavassavo; āyatiṁ anavassavā kammakkhayo; kammakkhayā dukkhakkhayo; dukkhakkhayā vedanākkhayo; vedanākkhayā sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī\"ti.",
    "mn101:10": "Seyyathāpi, āvuso nigaṇṭhā, puriso sallena viddho assa savisenagāḷhūpalepanena; so sallassapivedhanahetudukkhātibbākaṭukā vedanā vediyeyya. Tassa mittāmaccā ñātisālohitā bhisakkaṁ sallakattaṁ upaṭṭhāpeyyuṁ. Tassa so bhisakko sallakatto satthena vaṇamukhaṁ parikanteyya; so satthenapi vaṇamukhassa parikantanahetu dukkhā tibbā kaṭukā vedanā vediyeyya. Tassa so bhisakko sallakatto esaniyā sallaṁ eseyya; so esaniyāpi sallassa esanāhetu dukkhā tibbā kaṭukā vedanā vediyeyya. Tassa so bhisakko sallakatto sallaṁabbuheyya; so sallassapiabbuhanahetudukkhā tibbā kaṭukā vedanā vediyeyya. Tassa so bhisakko sallakatto agadaṅgāraṁ vaṇamukhe odaheyya; so agadaṅgārassapi vaṇamukhe odahanahetu dukkhā tibbā kaṭukā vedanā vediyeyya. So aparena samayena rūḷhena vaṇena sañchavinā arogo assa sukhī serī sayaṁvasī yena kāmaṅgamo. Tassa evamassa: \"ahaṁ kho pubbe sallena viddho ahosiṁ savisena gāḷhūpalepanena. Sohaṁ sallassapi vedhanahetu dukkhā tibbā kaṭukā vedanā vediyiṁ. Tassa me mittāmaccā ñātisālohitā bhisakkaṁ sallakattaṁ upaṭṭhapesuṁ. Tassa me so bhisakko sallakatto satthena vaṇamukhaṁ parikanti; sohaṁ satthenapi vaṇamukhassa parikantanahetu dukkhā tibbā kaṭukā vedanā vediyiṁ. Tassa me so bhisakko sallakatto esaniyā sallaṁ esi; so ahaṁ esaniyāpi sallassa esanāhetu dukkhā tibbā kaṭukā vedanā vediyiṁ. Tassa me so bhisakko sallakatto sallaṁabbuhi; sohaṁ sallassapi abbuhanahetu dukkhā tibbā kaṭukā vedanā vediyiṁ. Tassa me so bhisakko sallakatto agadaṅgāraṁ vaṇamukhe odahi; sohaṁ agadaṅgārassapi vaṇamukhe odahanahetu dukkhā tibbā kaṭukā vedanā vediyiṁ. Somhi etarahi rūḷhena vaṇena sañchavinā arogo sukhī serī sayaṁvasī yena kāmaṅgamo\"ti.",
    "mn101:11": "Evameva kho, āvuso nigaṇṭhā, sace tumhe jāneyyātha — ahuvamheva mayaṁ pubbe, na nāhuvamhāti, jāneyyātha — akaramheva mayaṁ pubbe pāpakammaṁ, na nākaramhāti, jāneyyātha — evarūpaṁ vā evarūpaṁ vā pāpakammaṁ akaramhāti, jāneyyātha –  ettakaṁ vā dukkhaṁ nijjiṇṇaṁ, ettakaṁ vā dukkhaṁ nijjīretabbaṁ, ettakamhi vā dukkhe nijjiṇṇe sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatīti, jāneyyātha — diṭṭheva dhamme akusalānaṁ dhammānaṁ pahānaṁ, kusalānaṁ dhammānaṁ upasampadaṁ; evaṁ sante āyasmantānaṁ nigaṇṭhānaṁ kallamassa veyyākaraṇāya: \"yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, sabbaṁ taṁ pubbekatahetu. Iti purāṇānaṁ kammānaṁ tapasā byantībhāvā, navānaṁ kammānaṁ akaraṇā, āyatiṁ anavassavo; āyatiṁ anavassavā kammakkhayo; kammakkhayā dukkhakkhayo; dukkhakkhayā vedanākkhayo; vedanākkhayā sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī\"ti.",
    "mn101:12": "Yasmā ca kho tumhe, āvuso nigaṇṭhā, na jānātha — ahuvamheva mayaṁ pubbe, na nāhuvamhāti, na jānātha — akaramheva mayaṁ pubbe pāpakammaṁ, na nākaramhāti, na jānātha — evarūpaṁ vā evarūpaṁ vā pāpakammaṁ akaramhāti, na jānātha — ettakaṁ vā dukkhaṁ nijjiṇṇaṁ, ettakaṁ vā dukkhaṁ nijjīretabbaṁ, ettakamhi vā dukkhe nijjiṇṇe sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatīti, na jānātha — diṭṭheva dhamme akusalānaṁ dhammānaṁ pahānaṁ, kusalānaṁ dhammānaṁ upasampadaṁ; tasmā āyasmantānaṁ nigaṇṭhānaṁ na kallamassa veyyākaraṇāya: \"yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, sabbaṁ taṁ pubbekatahetu. Iti purāṇānaṁ kammānaṁ tapasā byantībhāvā, navānaṁ kammānaṁ akaraṇā, āyatiṁ anavassavo; āyatiṁ anavassavā kammakkhayo; kammakkhayā dukkhakkhayo; dukkhakkhayā vedanākkhayo; vedanākkhayā sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī\"’ti.",
    "mn101:13": "Evaṁ vutte, bhikkhave, te nigaṇṭhā maṁ etadavocuṁ: ‘nigaṇṭho, āvuso,nāṭaputtosabbaññū sabbadassāvī, aparisesaṁ ñāṇadassanaṁ paṭijānāti. \"Carato ca me tiṭṭhato ca suttassa ca jāgarassa ca satataṁ samitaṁ ñāṇadassanaṁ paccupaṭṭhitan\"ti. So evamāha: \"atthi kho vo, āvuso nigaṇṭhā, pubbeva pāpakammaṁ kataṁ, taṁ imāya kaṭukāya dukkarakārikāya nijjīretha, yaṁ panettha etarahi kāyena saṁvutā vācāya saṁvutā manasā saṁvutā taṁ āyatiṁ pāpakammassa akaraṇaṁ. Iti purāṇānaṁ kammānaṁ tapasā byantībhāvā, navānaṁ kammānaṁ akaraṇā, āyatiṁ anavassavo; āyatiṁ anavassavā kammakkhayo; kammakkhayā dukkhakkhayo; dukkhakkhayā vedanākkhayo; vedanākkhayā sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī\"ti. Tañca panamhākaṁ ruccati ceva khamati ca, tena camhā attamanā’ti.",
    "mn101:14": "Evaṁ vutte, ahaṁ, bhikkhave, te nigaṇṭhe etadavocaṁ: ‘pañca kho ime, āvuso nigaṇṭhā, dhammā diṭṭheva dhamme dvidhāvipākā. Katame pañca? Saddhā, ruci, anussavo, ākāraparivitakko, diṭṭhinijjhānakkhanti — ime kho, āvuso nigaṇṭhā, pañca dhammā diṭṭheva dhamme dvidhāvipākā. Tatrāyasmantānaṁ nigaṇṭhānaṁ kā atītaṁse satthari saddhā, kā ruci, ko anussavo, ko ākāraparivitakko, kā diṭṭhinijjhānakkhantī’ti.Evaṁvādīkho ahaṁ, bhikkhave, nigaṇṭhesu nakañcisahadhammikaṁ vādapaṭihāraṁ samanupassāmi.",
    "mn101:15": "Puna caparāhaṁ, bhikkhave, te nigaṇṭhe evaṁ vadāmi: ‘taṁ kiṁ maññatha, āvuso nigaṇṭhā. Yasmiṁ vo samayetibboupakkamo hoti tibbaṁ padhānaṁ, tibbā tasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyetha; yasmiṁ pana vo samaye na tibbo upakkamo hoti na tibbaṁ padhānaṁ, na tibbā tasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyethā’ti? ‘Yasmiṁ no, āvuso gotama, samaye tibbo upakkamo hoti tibbaṁ padhānaṁ, tibbā tasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyāma; yasmiṁ pana no samaye na tibbo upakkamo hoti na tibbaṁ padhānaṁ, na tibbā tasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyāmā’ti.",
    "mn101:16": "‘Iti kira, āvuso nigaṇṭhā, yasmiṁ vo samaye tibbo upakkamo hoti tibbaṁ padhānaṁ, tibbā tasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyetha; yasmiṁ pana vo samaye na tibbo upakkamo hoti na tibbaṁ padhānaṁ, na tibbā tasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyetha. Evaṁ sante āyasmantānaṁ nigaṇṭhānaṁ na kallamassa veyyākaraṇāya: \"yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, sabbaṁ taṁ pubbekatahetu. Iti purāṇānaṁ kammānaṁ tapasā byantībhāvā, navānaṁ kammānaṁ akaraṇā, āyatiṁ anavassavo; āyatiṁ anavassavā kammakkhayo; kammakkhayā dukkhakkhayo; dukkhakkhayā vedanākkhayo; vedanākkhayā sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī\"ti.",
    "mn101:17": "Sace, āvuso nigaṇṭhā, yasmiṁ vo samaye tibbo upakkamo hoti tibbaṁ padhānaṁ, na tibbā tasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyetha; yasmiṁ pana vo samaye na tibbo upakkamo hoti na tibbaṁ padhānaṁ, tibbātasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyetha; evaṁ sante āyasmantānaṁ nigaṇṭhānaṁ kallamassa veyyākaraṇāya: \"yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, sabbaṁ taṁ pubbekatahetu. Iti purāṇānaṁ kammānaṁ tapasā byantībhāvā, navānaṁ kammānaṁ akaraṇā, āyatiṁ anavassavo; āyatiṁ anavassavā kammakkhayo; kammakkhayā dukkhakkhayo; dukkhakkhayā vedanākkhayo; vedanākkhayā sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī\"ti.",
    "mn101:18": "Yasmā ca kho, āvuso nigaṇṭhā, yasmiṁ vo samaye tibbo upakkamo hoti tibbaṁ padhānaṁ, tibbā tasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyetha; yasmiṁ pana vo samaye na tibbo upakkamo hoti na tibbaṁ padhānaṁ, na tibbā tasmiṁ samaye opakkamikā dukkhā tibbā kaṭukā vedanā vediyetha; te tumhe sāmaṁyeva opakkamikā dukkhā tibbā kaṭukā vedanā vedayamānā avijjā aññāṇā sammohā vipaccetha: \"yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, sabbaṁ taṁ pubbekatahetu. Iti purāṇānaṁ kammānaṁ tapasā byantībhāvā, navānaṁ kammānaṁ akaraṇā, āyatiṁ anavassavo; āyatiṁ anavassavā kammakkhayo; kammakkhayā dukkhakkhayo; dukkhakkhayā vedanākkhayo; vedanākkhayā sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissatī\"’ti.Evaṁvādīpikho ahaṁ, bhikkhave, nigaṇṭhesu na kañci sahadhammikaṁ vādapaṭihāraṁ samanupassāmi.",
    "mn101:19": "Puna caparāhaṁ, bhikkhave, te nigaṇṭhe evaṁ vadāmi: ‘taṁ kiṁ maññathāvuso nigaṇṭhā, yamidaṁ kammaṁ diṭṭhadhammavedanīyaṁ taṁ upakkamena vā padhānena vā samparāyavedanīyaṁ hotūti labbhametan’ti?",
    "mn101:20": "‘Yaṁ panidaṁ kammaṁ samparāyavedanīyaṁ taṁ upakkamena vā padhānena vā diṭṭhadhammavedanīyaṁ hotūti labbhametan’ti? ‘No hidaṁ, āvuso’.",
    "mn101:21": "‘Taṁ kiṁ maññathāvuso nigaṇṭhā, yamidaṁ kammaṁ sukhavedanīyaṁ taṁ upakkamena vā padhānena vā dukkhavedanīyaṁ hotūti labbhametan’ti?",
    "mn101:22": "‘Yaṁ panidaṁ kammaṁ dukkhavedanīyaṁ taṁ upakkamena vā padhānena vā sukhavedanīyaṁ hotūti labbhametan’ti?",
    "mn101:23": "‘Taṁ kiṁ maññathāvuso nigaṇṭhā, yamidaṁ kammaṁ paripakkavedanīyaṁ taṁ upakkamena vā padhānena vā aparipakkavedanīyaṁ hotūti labbhametan’ti?",
    "mn101:24": "‘Yaṁ panidaṁ kammaṁ aparipakkavedanīyaṁ taṁ upakkamena vā padhānena vā paripakkavedanīyaṁ hotūti labbhametan’ti?",
    "mn101:25": "‘Taṁ kiṁ maññathāvuso nigaṇṭhā, yamidaṁ kammaṁ bahuvedanīyaṁ taṁ upakkamena vā padhānena vā appavedanīyaṁ hotūti labbhametan’ti?",
    "mn101:26": "‘Yaṁ panidaṁ kammaṁ appavedanīyaṁ taṁ upakkamena vā padhānena vā bahuvedanīyaṁ hotūti labbhametan’ti?",
    "mn101:27": "‘Taṁ kiṁ maññathāvuso nigaṇṭhā, yamidaṁ kammaṁ savedanīyaṁ taṁ upakkamena vā padhānena vā avedanīyaṁ hotūti labbhametan’ti?",
    "mn101:28": "‘Yaṁ panidaṁ kammaṁ avedanīyaṁ taṁ upakkamena vā padhānena vā savedanīyaṁ hotūti labbhametan’ti?",
    "mn101:29": "‘Iti kira, āvuso nigaṇṭhā, yamidaṁ kammaṁ diṭṭhadhammavedanīyaṁ taṁ upakkamena vā padhānena vā samparāyavedanīyaṁ hotūti alabbhametaṁ, yaṁ panidaṁ kammaṁ samparāyavedanīyaṁ taṁ upakkamena vā padhānena vā diṭṭhadhammavedanīyaṁ hotūti alabbhametaṁ, yamidaṁ kammaṁ sukhavedanīyaṁ taṁ upakkamena vā padhānena vā dukkhavedanīyaṁ hotūti alabbhametaṁ, yamidaṁ kammaṁ dukkhavedanīyaṁ taṁ upakkamena vā padhānena vā sukhavedanīyaṁ hotūti alabbhametaṁ, yamidaṁ kammaṁ paripakkavedanīyaṁ taṁ upakkamena vā padhānena vā aparipakkavedanīyaṁ hotūti alabbhametaṁ, yamidaṁ kammaṁ aparipakkavedanīyaṁ taṁ upakkamena vā padhānena vā paripakkavedanīyaṁ hotūti alabbhametaṁ, yamidaṁ kammaṁ bahuvedanīyaṁ taṁ upakkamena vā padhānena vā appavedanīyaṁ hotūti alabbhametaṁ, yamidaṁ kammaṁ appavedanīyaṁ taṁ upakkamena vā padhānena vā bahuvedanīyaṁ hotūti alabbhametaṁ, yamidaṁ kammaṁ savedanīyaṁ taṁ upakkamena vā padhānena vā avedanīyaṁ hotūti alabbhametaṁ, yamidaṁ kammaṁ avedanīyaṁ taṁ upakkamena vā padhānena vā savedanīyaṁ hotūti alabbhametaṁ; evaṁ sante āyasmantānaṁ nigaṇṭhānaṁ aphalo upakkamo hoti, aphalaṁ padhānaṁ’.",
    "mn101:30": "Evaṁvādī, bhikkhave, nigaṇṭhā. Evaṁvādīnaṁ, bhikkhave, nigaṇṭhānaṁ dasa sahadhammikā vādānuvādā gārayhaṁ ṭhānaṁ āgacchanti.",
    "mn101:31": "Sace, bhikkhave, sattā pubbekatahetu sukhadukkhaṁ paṭisaṁvedenti; addhā, bhikkhave, nigaṇṭhā pubbe dukkaṭakammakārino yaṁ etarahi evarūpā dukkhā tibbā kaṭukā vedanā vediyanti.",
    "mn101:32": "Sace, bhikkhave, sattā pubbekatahetu sukhadukkhaṁ paṭisaṁvedenti, gārayhā nigaṇṭhā; no ce sattā pubbekatahetu sukhadukkhaṁ paṭisaṁvedenti, gārayhā nigaṇṭhā.",
    "mn101:33": "Kathañca, bhikkhave, saphalo upakkamo hoti, saphalaṁ padhānaṁ? Idha, bhikkhave, bhikkhu na heva anaddhabhūtaṁ attānaṁ dukkhena addhabhāveti, dhammikañca sukhaṁ na pariccajati, tasmiñca sukhe anadhimucchito hoti. So evaṁ pajānāti: ‘imassa kho me dukkhanidānassa saṅkhāraṁ padahato saṅkhārappadhānā virāgo hoti, imassa pana me dukkhanidānassa ajjhupekkhato upekkhaṁ bhāvayato virāgo hotī’ti. Soyassa hi khvāssadukkhanidānassa saṅkhāraṁ padahato saṅkhārappadhānā virāgo hoti, saṅkhāraṁ tattha padahati. Yassa panassa dukkhanidānassa ajjhupekkhato upekkhaṁ bhāvayato virāgo hoti, upekkhaṁ tattha bhāveti. Tassa tassa dukkhanidānassa saṅkhāraṁ padahato saṅkhārappadhānā virāgo hoti — evampissa taṁ dukkhaṁ nijjiṇṇaṁ hoti. Tassa tassa dukkhanidānassa ajjhupekkhato upekkhaṁ bhāvayato virāgo hoti — evampissa taṁ dukkhaṁ nijjiṇṇaṁ hoti.",
    "mn101:34": "Seyyathāpi, bhikkhave, puriso itthiyā sāratto paṭibaddhacitto tibbacchando tibbāpekkho. So taṁ itthiṁ passeyya aññena purisena saddhiṁ santiṭṭhantiṁ sallapantiṁ sañjagghantiṁ saṁhasantiṁ. Taṁ kiṁ maññatha, bhikkhave, api nu tassa purisassa amuṁ itthiṁ disvā aññena purisena saddhiṁ santiṭṭhantiṁ sallapantiṁ sañjagghantiṁ saṁhasantiṁ uppajjeyyuṁ sokaparidevadukkhadomanassūpāyāsā\"ti?",
    "mn101:35": "\"Evameva kho, bhikkhave, bhikkhu na heva anaddhabhūtaṁ attānaṁ dukkhena addhabhāveti, dhammikañca sukhaṁ na pariccajati, tasmiñca sukhe anadhimucchito hoti. So evaṁ pajānāti: ‘imassa kho me dukkhanidānassa saṅkhāraṁ padahato saṅkhārappadhānā virāgo hoti, imassa pana me dukkhanidānassa ajjhupekkhato upekkhaṁ bhāvayato virāgo hotī’ti. So yassa hi khvāssa dukkhanidānassa saṅkhāraṁ padahato saṅkhārappadhānā virāgo hoti, saṅkhāraṁ tattha padahati; yassa panassa dukkhanidānassa ajjhupekkhato upekkhaṁ bhāvayato virāgo hoti, upekkhaṁ tattha bhāveti. Tassa tassa dukkhanidānassa saṅkhāraṁ padahato saṅkhārappadhānā virāgo hoti — evampissa taṁ dukkhaṁ nijjiṇṇaṁ hoti. Tassa tassa dukkhanidānassa ajjhupekkhato upekkhaṁ bhāvayato virāgo hoti — evampissa taṁ dukkhaṁ nijjiṇṇaṁ hoti. Evampi, bhikkhave, saphalo upakkamo hoti, saphalaṁ padhānaṁ.",
    "mn101:36": "Puna caparaṁ, bhikkhave, bhikkhu iti paṭisañcikkhati: ‘yathāsukhaṁ kho me viharato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti; dukkhāya pana me attānaṁ padahato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti. Yannūnāhaṁ dukkhāya attānaṁ padaheyyan’ti. So dukkhāya attānaṁ padahati. Tassa dukkhāya attānaṁ padahato akusalā dhammā parihāyanti kusalā dhammā abhivaḍḍhanti. So na aparena samayena dukkhāya attānaṁ padahati. Taṁ kissa hetu? Yassa hi so, bhikkhave, bhikkhu atthāya dukkhāya attānaṁ padaheyya svāssa attho abhinipphanno hoti. Tasmā na aparena samayena dukkhāya attānaṁ padahati.",
    "mn101:37": "Seyyathāpi, bhikkhave, usukāro tejanaṁ dvīsu alātesu ātāpeti paritāpeti ujuṁ karoti kammaniyaṁ. Yato kho, bhikkhave, usukārassa tejanaṁ dvīsu alātesu ātāpitaṁ hoti paritāpitaṁ ujuṁkataṁkammaniyaṁ, na so taṁ aparena samayena usukāro tejanaṁ dvīsu alātesu ātāpeti paritāpeti ujuṁ karoti kammaniyaṁ. Taṁ kissa hetu? Yassa hi so, bhikkhave, atthāya usukāro tejanaṁ dvīsu alātesu ātāpeyya paritāpeyya ujuṁ kareyya kammaniyaṁ svāssa attho abhinipphanno hoti. Tasmā na aparena samayena usukāro tejanaṁ dvīsu alātesu ātāpeti paritāpeti ujuṁ karoti kammaniyaṁ.",
    "mn101:38": "Puna caparaṁ, bhikkhave, idha tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti.",
    "mn101:39": "So evaṁ pabbajito samāno bhikkhūnaṁ sikkhāsājīvasamāpanno pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho, lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. Adinnādānaṁ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. Abrahmacariyaṁ pahāya brahmacārī hoti ārācārī virato methunā gāmadhammā.",
    "mn101:40": "So santuṭṭho hoti kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati samādāyeva pakkamati. Seyyathāpi nāma pakkhī sakuṇo yena yeneva ḍeti sapattabhārova ḍeti; evameva bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena; so yena yeneva pakkamati samādāyeva pakkamati. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṁ anavajjasukhaṁ paṭisaṁvedeti.",
    "mn101:41": "So cakkhunā rūpaṁ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ tassa saṁvarāya paṭipajjati, rakkhati cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjati. Sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … pe … jivhāya rasaṁ sāyitvā … pe … kāyena phoṭṭhabbaṁ phusitvā … pe … manasā dhammaṁ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ tassa saṁvarāya paṭipajjati, rakkhati manindriyaṁ, manindriye saṁvaraṁ āpajjati. So iminā ariyena indriyasaṁvarena samannāgato ajjhattaṁ abyāsekasukhaṁ paṭisaṁvedeti.",
    "mn101:42": "So abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti,samiñjitepasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti.",
    "mn101:43": "So iminā ca ariyena sīlakkhandhena samannāgato, imāya ca ariyāya santuṭṭhiyā samannāgato, iminā ca ariyena indriyasaṁvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ.",
    "mn101:44": "So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. Evampi, bhikkhave, saphalo upakkamo hoti, saphalaṁ padhānaṁ.",
    "mn101:45": "Puna caparaṁ, bhikkhave, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. Evampi, bhikkhave, saphalo upakkamo hoti, saphalaṁ padhānaṁ.",
    "mn101:46": "Puna caparaṁ, bhikkhave, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṁvedeti. Yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti tatiyaṁ jhānaṁ upasampajja viharati. Evampi, bhikkhave, saphalo upakkamo hoti, saphalaṁ padhānaṁ.",
    "mn101:47": "Puna caparaṁ, bhikkhave, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṁ atthaṅgamā, adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. Evampi, bhikkhave, saphalo upakkamo hoti, saphalaṁ padhānaṁ.",
    "mn101:48": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhininnāmeti. So anekavihitaṁ pubbenivāsaṁ anussarati,seyyathidaṁ— ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe: ‘amutrāsiṁ evaṁnāmo evaṁgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṁgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. Evampi, bhikkhave, saphalo upakkamo hoti, saphalaṁ padhānaṁ.",
    "mn101:49": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. Evampi, bhikkhave, saphalo upakkamo hoti, saphalaṁ padhānaṁ.",
    "mn101:50": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmeti. So ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti; ‘ime āsavā’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti.",
    "mn101:51": "Sace, bhikkhave, sattā pubbekatahetu sukhadukkhaṁ paṭisaṁvedenti; addhā, bhikkhave, tathāgato pubbe sukatakammakārī yaṁ etarahi evarūpā anāsavā sukhā vedanā vedeti.",
    "mn101:52": "Sace, bhikkhave, sattā pubbekatahetu sukhadukkhaṁ paṭisaṁvedenti, pāsaṁso tathāgato; no ce sattā pubbekatahetu sukhadukkhaṁ paṭisaṁvedenti, pāsaṁso tathāgato.",
    "mn101:53": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}