{
    "mn112:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn112:2": "\"Idha, bhikkhave, bhikkhu aññaṁ byākaroti: ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti.",
    "mn112:3": "Khīṇāsavassa, bhikkhave, bhikkhuno vusitavato katakaraṇīyassa ohitabhārassa anuppattasadatthassa parikkhīṇabhavasaṁyojanassa sammadaññāvimuttassa ayamanudhammo hoti veyyākaraṇāya:",
    "mn112:4": "‘Pañcime, āvuso, upādānakkhandhā tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātā. Katame pañca? Seyyathidaṁ — rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho — ime kho, āvuso, pañcupādānakkhandhā tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātā. Kathaṁ jānato panāyasmato, kathaṁ passato imesu pañcasu upādānakkhandhesu anupādāya āsavehi cittaṁ vimuttan’ti?",
    "mn112:5": "Khīṇāsavassa, bhikkhave, bhikkhuno vusitavato katakaraṇīyassa ohitabhārassa anuppattasadatthassa parikkhīṇabhavasaṁyojanassa sammadaññāvimuttassa ayamanudhammo hoti veyyākaraṇāya: ‘rūpaṁ kho ahaṁ, āvuso, abalaṁvirāgunaṁanassāsikanti viditvā ye rūpeupāyūpādānācetaso adhiṭṭhānābhinivesānusayā tesaṁ khayā virāgā nirodhā cāgā paṭinissaggā vimuttaṁ me cittanti pajānāmi. Vedanaṁ kho ahaṁ, āvuso … pe … saññaṁ kho ahaṁ, āvuso … saṅkhāre kho ahaṁ, āvuso … viññāṇaṁ kho ahaṁ, āvuso, abalaṁ virāgunaṁ anassāsikanti viditvā ye viññāṇe upāyūpādānā cetaso adhiṭṭhānābhinivesānusayā tesaṁ khayā virāgā nirodhā cāgā paṭinissaggā vimuttaṁ me cittanti pajānāmi. Evaṁ kho me, āvuso, jānato evaṁ passato imesu pañcasu upādānakkhandhesu anupādāya āsavehi cittaṁ vimuttan’ti. Tassa, bhikkhave, bhikkhuno ‘sādhū’ti bhāsitaṁ abhinanditabbaṁ, anumoditabbaṁ.",
    "mn112:6": "‘Chayimā, āvuso, dhātuyo tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātā. Katamā cha? Pathavīdhātu, āpodhātu, tejodhātu, vāyodhātu, ākāsadhātu, viññāṇadhātu — imā kho, āvuso, cha dhātuyo tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātā. Kathaṁ jānato panāyasmato, kathaṁ passato imāsu chasu dhātūsu anupādāya āsavehi cittaṁ vimuttan’ti?",
    "mn112:7": "Khīṇāsavassa, bhikkhave, bhikkhuno vusitavato katakaraṇīyassa ohitabhārassa anuppattasadatthassa parikkhīṇabhavasaṁyojanassa sammadaññāvimuttassa ayamanudhammo hoti veyyākaraṇāya:",
    "mn112:8": "‘Cha kho panimāni, āvuso,ajjhattikabāhirāniāyatanāni tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātāni. Katamāni cha? Cakkhu ceva rūpā ca, sotañca saddā ca, ghānañca gandhā ca, jivhā ca rasā ca, kāyo ca phoṭṭhabbā ca, mano ca dhammā ca — imāni kho, āvuso, cha ajjhattikabāhirāni āyatanāni tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātāni. Kathaṁ jānato panāyasmato, kathaṁ passato imesu chasu ajjhattikabāhiresu āyatanesu anupādāya āsavehi cittaṁ vimuttan’ti?",
    "mn112:9": "Khīṇāsavassa, bhikkhave, bhikkhuno vusitavato katakaraṇīyassa ohitabhārassa anuppattasadatthassa parikkhīṇabhavasaṁyojanassa sammadaññāvimuttassa ayamanudhammo hoti veyyākaraṇāya:",
    "mn112:10": "‘Kathaṁ jānato panāyasmato, kathaṁ passato imasmiñca saviññāṇake kāye bahiddhā ca sabbanimittesu ahaṁkāramamaṁkāramānānusayāsamūhatā’ti?",
    "mn112:11": "Khīṇāsavassa, bhikkhave, bhikkhuno vusitavato katakaraṇīyassa ohitabhārassa anuppattasadatthassa parikkhīṇabhavasaṁyojanassa sammadaññāvimuttassa ayamanudhammo hoti veyyākaraṇāya:",
    "mn112:12": "So kho ahaṁ, āvuso, aparena samayena appaṁ vā bhogakkhandhaṁ pahāya mahantaṁ vā bhogakkhandhaṁ pahāya, appaṁ vā ñātiparivaṭṭaṁ pahāya mahantaṁ vā ñātiparivaṭṭaṁ pahāya kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajiṁ.",
    "mn112:13": "So bījagāmabhūtagāmasamārambhā paṭivirato ahosiṁ, ekabhattiko ahosiṁ rattūparato virato vikālabhojanā. Naccagītavāditavisūkadassanā paṭivirato ahosiṁ. mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato ahosiṁ. Uccāsayanamahāsayanā paṭivirato ahosiṁ. Jātarūparajatapaṭiggahaṇā paṭivirato ahosiṁ, āmakadhaññapaṭiggahaṇā paṭivirato ahosiṁ, āmakamaṁsapaṭiggahaṇā paṭivirato ahosiṁ; itthikumārikapaṭiggahaṇā paṭivirato ahosiṁ, dāsidāsapaṭiggahaṇā paṭivirato ahosiṁ, ajeḷakapaṭiggahaṇā paṭivirato ahosiṁ, kukkuṭasūkarapaṭiggahaṇā paṭivirato ahosiṁ, hatthigavassavaḷavapaṭiggahaṇā paṭivirato ahosiṁ, khettavatthupaṭiggahaṇā paṭivirato ahosiṁ. Dūteyyapahiṇagamanānuyogā paṭivirato ahosiṁ, kayavikkayā paṭivirato ahosiṁ, tulākūṭakaṁsakūṭamānakūṭā paṭivirato ahosiṁ, ukkoṭanavañcananikatisāciyogā paṭivirato ahosiṁ, chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato ahosiṁ.",
    "mn112:14": "So santuṭṭho ahosiṁ kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. Soyena yenevapakkamiṁ samādāyeva pakkamiṁ. Seyyathāpi nāma pakkhī sakuṇo yena yeneva ḍeti sapattabhārova ḍeti; evameva kho ahaṁ, āvuso; santuṭṭho ahosiṁ kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. So yena yeneva pakkamiṁ samādāyeva pakkamiṁ. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṁ anavajjasukhaṁ paṭisaṁvedesiṁ.",
    "mn112:15": "So cakkhunā rūpaṁ disvā na nimittaggāhī ahosiṁ nānubyañjanaggāhī; yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjiṁ; rakkhiṁ cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjiṁ. Sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … pe … jivhāya rasaṁ sāyitvā … pe … kāyena phoṭṭhabbaṁ phusitvā … pe … manasā dhammaṁ viññāya na nimittaggāhī ahosiṁ nānubyañjanaggāhī; yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjiṁ; rakkhiṁ manindriyaṁ, manindriye saṁvaraṁ āpajjiṁ. So iminā ariyena indriyasaṁvarena samannāgato ajjhattaṁ abyāsekasukhaṁ paṭisaṁvedesiṁ.",
    "mn112:16": "So abhikkante paṭikkante sampajānakārī ahosiṁ, ālokite vilokite sampajānakārī ahosiṁ, samiñjite pasārite sampajānakārī ahosiṁ, saṅghāṭipattacīvaradhāraṇe sampajānakārī ahosiṁ, asite pīte khāyite sāyite sampajānakārī ahosiṁ, uccārapassāvakamme sampajānakārī ahosiṁ, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī ahosiṁ.",
    "mn112:17": "So iminā ca ariyena sīlakkhandhena samannāgato,imāya ca ariyāya santuṭṭhiyā samannāgato, iminā ca ariyena indriyasaṁvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato vivittaṁ senāsanaṁ bhajiṁ araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. So pacchābhattaṁ piṇḍapātapaṭikkanto nisīdiṁ pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā.",
    "mn112:18": "So abhijjhaṁ loke pahāya vigatābhijjhena cetasā vihāsiṁ, abhijjhāya cittaṁ parisodhesiṁ. Byāpādapadosaṁ pahāya abyāpannacitto vihāsiṁ sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṁ parisodhesiṁ. Thinamiddhaṁ pahāya vigatathinamiddho vihāsiṁ ālokasaññī sato sampajāno, thinamiddhā cittaṁ parisodhesiṁ. Uddhaccakukkuccaṁ pahāya anuddhato vihāsiṁ ajjhattaṁ, vūpasantacitto, uddhaccakukkuccā cittaṁ parisodhesiṁ. Vicikicchaṁ pahāya tiṇṇavicikiccho vihāsiṁ akathaṅkathī kusalesu dhammesu, vicikicchāya cittaṁ parisodhesiṁ.",
    "mn112:19": "So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja vihāsiṁ. Vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ … pe … tatiyaṁ jhānaṁ … catutthaṁ jhānaṁ upasampajja vihāsiṁ.",
    "mn112:20": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmesiṁ. So idaṁ dukkhanti yathābhūtaṁ abbhaññāsiṁ, ayaṁ dukkhasamudayoti yathābhūtaṁ abbhaññāsiṁ, ayaṁ dukkhanirodhoti yathābhūtaṁ abbhaññāsiṁ, ayaṁ dukkhanirodhagāminī paṭipadāti yathābhūtaṁ abbhaññāsiṁ; ime āsavāti yathābhūtaṁ abbhaññāsiṁ, ayaṁ āsavasamudayoti yathābhūtaṁ abbhaññāsiṁ, ayaṁ āsavanirodhoti yathābhūtaṁ abbhaññāsiṁ, ayaṁ āsavanirodhagāminī paṭipadāti yathābhūtaṁ abbhaññāsiṁ.",
    "mn112:21": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}