{
    "mn11:1": "Evaṁ me sutaṁ — ​ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn11:2": "\"Idheva, bhikkhave, samaṇo, idha dutiyo samaṇo, idha tatiyo samaṇo, idha catuttho samaṇo; suññā parappavādāsamaṇebhi aññehīti.Evametaṁ, bhikkhave, sammā sīhanādaṁ nadatha.",
    "mn11:3": "Ṭhānaṁ kho panetaṁ, bhikkhave, vijjati yaṁ aññatitthiyā paribbājakā evaṁ vadeyyuṁ: ‘ko panāyasmantānaṁ assāso, kiṁ balaṁ, yena tumhe āyasmanto evaṁ vadetha — idheva samaṇo, idha dutiyo samaṇo, idha tatiyo samaṇo, idha catuttho samaṇo; suññā parappavādā samaṇebhi aññehī’ti? Evaṁvādino, bhikkhave, aññatitthiyā paribbājakā evamassu vacanīyā: ‘atthi kho no, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena cattāro dhammā akkhātā ye mayaṁ attani sampassamānā evaṁ vadema — idheva samaṇo, idha dutiyo samaṇo, idha tatiyo samaṇo, idha catuttho samaṇo; suññā parappavādā samaṇebhi aññehīti. Katame cattāro? Atthi kho no, āvuso, satthari pasādo, atthi dhamme pasādo, atthi sīlesu paripūrakāritā; sahadhammikā kho pana piyā manāpā — gahaṭṭhā ceva pabbajitā ca. Ime kho no, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena cattāro dhammā akkhātā ye mayaṁ attani sampassamānā evaṁ vadema — idheva samaṇo, idha dutiyo samaṇo, idha tatiyo samaṇo, idha catuttho samaṇo; suññā parappavādā samaṇebhi aññehī’ti.",
    "mn11:4": "Ṭhānaṁ kho panetaṁ, bhikkhave, vijjati yaṁ aññatitthiyā paribbājakā evaṁ vadeyyuṁ: ‘amhākampi kho, āvuso, atthi satthari pasādo yo amhākaṁ satthā, amhākampi atthi dhamme pasādo yo amhākaṁ dhammo, mayampi sīlesu paripūrakārino yāni amhākaṁ sīlāni, amhākampi sahadhammikā piyā manāpā — gahaṭṭhā ceva pabbajitā ca. Idha no, āvuso, ko viseso koadhippayāsokiṁ nānākaraṇaṁ yadidaṁ tumhākañceva amhākañcā’ti?",
    "mn11:5": "Evaṁvādino, bhikkhave, aññatitthiyā paribbājakā evamassu vacanīyā: ‘kiṁ panāvuso, ekā niṭṭhā, udāhu puthu niṭṭhā’ti? Sammā byākaramānā, bhikkhave, aññatitthiyā paribbājakā evaṁ byākareyyuṁ: ‘ekāvuso, niṭṭhā, na puthu niṭṭhā’ti.",
    "mn11:6": "‘Sā panāvuso, niṭṭhā sarāgassa udāhu vītarāgassā’ti? Sammā byākaramānā, bhikkhave, aññatitthiyā paribbājakā evaṁ byākareyyuṁ: ‘vītarāgassāvuso, sā niṭṭhā, na sā niṭṭhā sarāgassā’ti.",
    "mn11:7": "‘Sā panāvuso, niṭṭhā sadosassa udāhu vītadosassā’ti? Sammā byākaramānā, bhikkhave, aññatitthiyā paribbājakā evaṁ byākareyyuṁ: ‘vītadosassāvuso, sā niṭṭhā, na sā niṭṭhā sadosassā’ti.",
    "mn11:8": "‘Sā panāvuso, niṭṭhā samohassa udāhu vītamohassā’ti? Sammā byākaramānā, bhikkhave, aññatitthiyā paribbājakā evaṁ byākareyyuṁ: ‘vītamohassāvuso, sā niṭṭhā, na sā niṭṭhā samohassā’ti.",
    "mn11:9": "‘Sā panāvuso, niṭṭhā sataṇhassa udāhu vītataṇhassā’ti? Sammā byākaramānā, bhikkhave, aññatitthiyā paribbājakā evaṁ byākareyyuṁ: ‘vītataṇhassāvuso, sā niṭṭhā, na sā niṭṭhā sataṇhassā’ti.",
    "mn11:10": "‘Sā panāvuso, niṭṭhā saupādānassa udāhu anupādānassā’ti? Sammā byākaramānā, bhikkhave, aññatitthiyā paribbājakā evaṁ byākareyyuṁ: ‘anupādānassāvuso, sā niṭṭhā, na sā niṭṭhā saupādānassā’ti.",
    "mn11:11": "‘Sā panāvuso, niṭṭhā viddasuno udāhu aviddasuno’ti? Sammā byākaramānā, bhikkhave, aññatitthiyā paribbājakā evaṁ byākareyyuṁ: ‘viddasuno, āvuso, sā niṭṭhā, na sā niṭṭhā aviddasuno’ti.",
    "mn11:12": "‘Sā panāvuso, niṭṭhā anuruddhappaṭiviruddhassa udāhu ananuruddhaappaṭiviruddhassā’ti? Sammā byākaramānā, bhikkhave, aññatitthiyā paribbājakā evaṁ byākareyyuṁ: ‘ananuruddhaappaṭiviruddhassāvuso, sā niṭṭhā, na sā niṭṭhā anuruddhappaṭiviruddhassā’ti.",
    "mn11:13": "‘Sā panāvuso, niṭṭhā papañcārāmassa papañcaratino udāhu nippapañcārāmassa nippapañcaratino’ti? Sammā byākaramānā, bhikkhave, aññatitthiyā paribbājakā evaṁ byākareyyuṁ: ‘nippapañcārāmassāvuso, sā niṭṭhā nippapañcaratino, na sā niṭṭhā papañcārāmassa papañcaratino’ti.",
    "mn11:14": "Dvemā, bhikkhave, diṭṭhiyo — bhavadiṭṭhi ca vibhavadiṭṭhi ca. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā bhavadiṭṭhiṁ allīnā bhavadiṭṭhiṁ upagatā bhavadiṭṭhiṁ ajjhositā, vibhavadiṭṭhiyā te paṭiviruddhā. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā vibhavadiṭṭhiṁ allīnā vibhavadiṭṭhiṁ upagatā vibhavadiṭṭhiṁ ajjhositā, bhavadiṭṭhiyā te paṭiviruddhā.",
    "mn11:15": "Cattārimāni, bhikkhave, upādānāni. Katamāni cattāri? Kāmupādānaṁ, diṭṭhupādānaṁ, sīlabbatupādānaṁ, attavādupādānaṁ.",
    "mn11:16": "Santi, bhikkhave, eke samaṇabrāhmaṇā sabbupādānapariññāvādā paṭijānamānā. Te na sammā sabbupādānapariññaṁ paññapenti — kāmupādānassa pariññaṁ paññapenti, diṭṭhupādānassa pariññaṁ paññapenti, na sīlabbatupādānassa pariññaṁ paññapenti, na attavādupādānassa pariññaṁ paññapenti. Taṁ kissa hetu? Imāni hi te bhonto samaṇabrāhmaṇā dve ṭhānāni yathābhūtaṁ nappajānanti. Tasmā te bhonto samaṇabrāhmaṇā sabbupādānapariññāvādā paṭijānamānā; te na sammā sabbupādānapariññaṁ paññapenti — kāmupādānassa pariññaṁ paññapenti, diṭṭhupādānassa pariññaṁ paññapenti, na sīlabbatupādānassa pariññaṁ paññapenti, na attavādupādānassa pariññaṁ paññapenti.",
    "mn11:17": "Santi, bhikkhave, eke samaṇabrāhmaṇā sabbupādānapariññāvādā paṭijānamānā. Te na sammā sabbupādānapariññaṁ paññapenti — kāmupādānassa pariññaṁ paññapenti, diṭṭhupādānassa pariññaṁ paññapenti, sīlabbatupādānassa pariññaṁ paññapenti, na attavādupādānassa pariññaṁ paññapenti. Taṁ kissa hetu? Imañhi te bhonto samaṇabrāhmaṇā ekaṁ ṭhānaṁ yathābhūtaṁ nappajānanti. Tasmā te bhonto samaṇabrāhmaṇā sabbupādānapariññāvādāpaṭijānamānā; te na sammāsabbupādānapariññaṁ paññapenti — kāmupādānassa pariññaṁ paññapenti, diṭṭhupādānassa pariññaṁ paññapenti, sīlabbatupādānassa pariññaṁ paññapenti, na attavādupādānassa pariññaṁ paññapenti.",
    "mn11:18": "Evarūpe kho, bhikkhave, dhammavinaye yo satthari pasādo so na sammaggato akkhāyati; yo dhamme pasādo so na sammaggato akkhāyati; yā sīlesu paripūrakāritā sā na sammaggatā akkhāyati; yā sahadhammikesu piyamanāpatā sā na sammaggatā akkhāyati. Taṁ kissa hetu? Evañhetaṁ, bhikkhave, hoti yathā taṁ durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṁvattanike asammāsambuddhappavedite.",
    "mn11:19": "Tathāgato ca kho, bhikkhave, arahaṁ sammāsambuddho sabbupādānapariññāvādo paṭijānamāno sammā sabbupādānapariññaṁ paññapeti — kāmupādānassa pariññaṁ paññapeti, diṭṭhupādānassa pariññaṁ paññapeti, sīlabbatupādānassa pariññaṁ paññapeti, attavādupādānassa pariññaṁ paññapeti.",
    "mn11:20": "Ime ca, bhikkhave, cattāro upādānā. Kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā? Ime cattāro upādānā taṇhānidānā taṇhāsamudayā taṇhājātikā taṇhāpabhavā. Taṇhā cāyaṁ, bhikkhave, kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā? Taṇhā vedanānidānā vedanāsamudayā vedanājātikā vedanāpabhavā. Vedanā cāyaṁ, bhikkhave, kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā? Vedanā phassanidānā phassasamudayā phassajātikā phassapabhavā. Phasso cāyaṁ, bhikkhave, kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo? Phasso saḷāyatananidāno saḷāyatanasamudayo saḷāyatanajātiko saḷāyatanapabhavo. Saḷāyatanañcidaṁ, bhikkhave, kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ? Saḷāyatanaṁ nāmarūpanidānaṁ nāmarūpasamudayaṁ nāmarūpajātikaṁ nāmarūpapabhavaṁ. Nāmarūpañcidaṁ, bhikkhave, kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ? Nāmarūpaṁ viññāṇanidānaṁ viññāṇasamudayaṁ viññāṇajātikaṁ viññāṇapabhavaṁ. Viññāṇañcidaṁ, bhikkhave, kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ? Viññāṇaṁ saṅkhāranidānaṁ saṅkhārasamudayaṁ saṅkhārajātikaṁ saṅkhārapabhavaṁ. Saṅkhārā cime, bhikkhave, kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā? Saṅkhārā avijjānidānā avijjāsamudayā avijjājātikā avijjāpabhavā.",
    "mn11:21": "Yato ca kho, bhikkhave, bhikkhuno avijjā pahīnā hoti vijjā uppannā, so avijjāvirāgā vijjuppādā neva kāmupādānaṁ upādiyati, na diṭṭhupādānaṁ upādiyati, na sīlabbatupādānaṁ upādiyati, na attavādupādānaṁ upādiyati. Anupādiyaṁ na paritassati, aparitassaṁ paccattaññeva parinibbāyati. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānātī\"ti.",
    "mn11:22": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}