{
    "mn115:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn115:2": "\"Yāni kānici, bhikkhave, bhayāni uppajjanti sabbāni tāni bālato uppajjanti, no paṇḍitato; ye keci upaddavā uppajjanti sabbe te bālato uppajjanti, no paṇḍitato; ye keci upasaggā uppajjanti sabbe te bālato uppajjanti, no paṇḍitato. Seyyathāpi, bhikkhave, naḷāgārā vā tiṇāgārā vāaggi muttokūṭāgārānipi dahati ullittāvalittāni nivātāni phusitaggaḷāni pihitavātapānāni; evameva kho, bhikkhave, yāni kānici bhayāni uppajjanti sabbāni tāni bālato uppajjanti, no paṇḍitato; ye keci upaddavā uppajjanti sabbe te bālato uppajjanti, no paṇḍitato; ye keci upasaggā uppajjanti sabbe te bālato uppajjanti, no paṇḍitato. Iti kho, bhikkhave, sappaṭibhayo bālo, appaṭibhayo paṇḍito; saupaddavo bālo, anupaddavo paṇḍito; saupasaggo bālo, anupasaggo paṇḍito. Natthi, bhikkhave, paṇḍitato bhayaṁ, natthi paṇḍitato upaddavo, natthi paṇḍitato upasaggo. Tasmātiha, bhikkhave, ‘paṇḍitā bhavissāma vīmaṁsakā’ti –  evañhi vo, bhikkhave, sikkhitabban\"ti.",
    "mn115:3": "Evaṁ vutte, āyasmā ānando bhagavantaṁ etadavoca: \"kittāvatā nu kho, bhante, paṇḍito bhikkhu ‘vīmaṁsako’ti alaṁvacanāyā\"ti?",
    "mn115:4": "\"Kittāvatā pana, bhante, ‘dhātukusalo bhikkhū’ti alaṁvacanāyā\"ti?",
    "mn115:5": "\"Siyā pana, bhante, aññopi pariyāyo, yathā ‘dhātukusalo bhikkhū’ti alaṁvacanāyā\"ti?",
    "mn115:6": "\"Siyā pana, bhante, aññopi pariyāyo, yathā ‘dhātukusalo bhikkhū’ti alaṁvacanāyā\"ti?",
    "mn115:7": "\"Siyā pana, bhante, aññopi pariyāyo, yathā ‘dhātukusalo bhikkhū’ti alaṁvacanāyā\"ti?",
    "mn115:8": "\"Siyā pana, bhante, aññopi pariyāyo, yathā ‘dhātukusalo bhikkhū’ti alaṁvacanāyā\"ti?",
    "mn115:9": "\"Siyā pana, bhante, aññopi pariyāyo, yathā ‘dhātukusalo bhikkhū’ti alaṁvacanāyā\"ti?",
    "mn115:10": "\"Kittāvatā pana, bhante, ‘āyatanakusalo bhikkhū’ti alaṁvacanāyā\"ti?",
    "mn115:11": "\"Kittāvatā pana, bhante, ‘paṭiccasamuppādakusalo bhikkhū’ti alaṁvacanāyā\"ti?",
    "mn115:12": "\"Kittāvatā pana, bhante, ‘ṭhānāṭhānakusalo bhikkhū’ti alaṁvacanāyā\"ti?",
    "mn115:13": "‘Aṭṭhānametaṁ anavakāso yaṁ diṭṭhisampanno puggalo mātaraṁ jīvitā voropeyya, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ puthujjano mātaraṁ jīvitā voropeyya, ṭhānametaṁ vijjatī’ti pajānāti. ‘Aṭṭhānametaṁ anavakāso yaṁ diṭṭhisampanno puggalo pitaraṁ jīvitā voropeyya … pe … arahantaṁ jīvitā voropeyya, ṭhānametaṁ vijjatī’ti pajānāti; ‘aṭṭhānametaṁ anavakāso yaṁ diṭṭhisampanno puggalo duṭṭhacitto tathāgatassa lohitaṁ uppādeyya, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ puthujjano duṭṭhacitto tathāgatassa lohitaṁ uppādeyya, ṭhānametaṁ vijjatī’ti pajānāti. ‘Aṭṭhānametaṁ anavakāso yaṁ diṭṭhisampanno puggalo saṅghaṁ bhindeyya, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ puthujjano saṅghaṁ bhindeyya, ṭhānametaṁ vijjatī’ti pajānāti. ‘Aṭṭhānametaṁ anavakāso yaṁ diṭṭhisampanno puggalo aññaṁ satthāraṁ uddiseyya, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ puthujjano aññaṁ satthāraṁ uddiseyya, ṭhānametaṁ vijjatī’ti pajānāti.",
    "mn115:14": "‘Aṭṭhānametaṁ anavakāso yaṁ ekissā lokadhātuyā dve arahanto sammāsambuddhā apubbaṁ acarimaṁ uppajjeyyuṁ, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ ekissā lokadhātuyā eko arahaṁ sammāsambuddho uppajjeyya, ṭhānametaṁ vijjatī’ti pajānāti. ‘Aṭṭhānametaṁ anavakāso yaṁ ekissā lokadhātuyā dve rājāno cakkavattino apubbaṁ acarimaṁ uppajjeyyuṁ, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ ekissā lokadhātuyā eko rājā cakkavattī uppajjeyya, ṭhānametaṁ vijjatī’ti pajānāti.",
    "mn115:15": "‘Aṭṭhānametaṁ anavakāso yaṁ itthī arahaṁ assa sammāsambuddho, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ puriso arahaṁ assa sammāsambuddho, ṭhānametaṁ vijjatī’ti pajānāti. ‘Aṭṭhānametaṁ anavakāso yaṁ itthī rājā assa cakkavattī, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ puriso rājā assa cakkavattī, ṭhānametaṁ vijjatī’ti pajānāti. ‘Aṭṭhānametaṁ anavakāso yaṁ itthī sakkattaṁ kareyya … mārattaṁ kareyya … brahmattaṁ kareyya, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ puriso sakkattaṁ kareyya … mārattaṁ kareyya … brahmattaṁ kareyya, ṭhānametaṁ vijjatī’ti pajānāti.",
    "mn115:16": "‘Aṭṭhānametaṁ anavakāso yaṁ kāyaduccaritassa iṭṭho kanto manāpo vipāko nibbatteyya, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ kāyaduccaritassa aniṭṭho akanto amanāpo vipāko nibbatteyya, ṭhānametaṁ vijjatī’ti pajānāti. ‘Aṭṭhānametaṁ anavakāso yaṁ vacīduccaritassa … pe … yaṁ manoduccaritassa iṭṭho kanto manāpo vipāko nibbatteyya, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ṭhānañca kho etaṁ vijjati yaṁ vacīduccaritassa … pe … yaṁ manoduccaritassa aniṭṭho akanto amanāpo vipāko nibbatteyya, ṭhānametaṁ vijjatīti pajānāti.",
    "mn115:17": "‘Aṭṭhānametaṁ anavakāso yaṁ kāyaduccaritasamaṅgī taṁnidānā tappaccayā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjeyya, netaṁ ṭhānaṁ vijjatī’ti pajānāti; ‘ṭhānañca kho etaṁ vijjati yaṁ kāyaduccaritasamaṅgī taṁnidānā tappaccayā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyya, ṭhānametaṁ vijjatī’ti pajānāti.",
    "mn115:18": "Evaṁ vutte, āyasmā ānando bhagavantaṁ etadavoca: \"acchariyaṁ, bhante, abbhutaṁ, bhante. Konāmo ayaṁ, bhante, dhammapariyāyo\"ti?",
    "mn115:19": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}