{
    "mn117:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn117:2": "\"Katamo ca, bhikkhave, ariyo sammāsamādhi saupaniso saparikkhāro? Seyyathidaṁ — sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati; yā kho, bhikkhave, imehi sattahaṅgehi cittassa ekaggatā parikkhatā –  ayaṁ vuccati, bhikkhave, ariyo sammāsamādhi saupaniso itipi, saparikkhāro itipi.",
    "mn117:3": "Katamā ca, bhikkhave, micchādiṭṭhi? ‘Natthi dinnaṁ, natthi yiṭṭhaṁ, natthi hutaṁ, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko, natthi ayaṁ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṁ parañca lokaṁ sayaṁ abhiññā sacchikatvā pavedentī’ti — ayaṁ, bhikkhave, micchādiṭṭhi.",
    "mn117:4": "Katamā ca, bhikkhave, sammādiṭṭhi?Sammādiṭṭhimpahaṁ, bhikkhave,dvāyaṁvadāmi — atthi, bhikkhave, sammādiṭṭhi sāsavā puññabhāgiyā upadhivepakkā; atthi, bhikkhave, sammādiṭṭhi ariyā anāsavā lokuttarā maggaṅgā.",
    "mn117:5": "Katamā ca, bhikkhave, sammādiṭṭhi ariyā anāsavā lokuttarā maggaṅgā? Yā kho, bhikkhave, ariyacittassa anāsavacittassa ariyamaggasamaṅgino ariyamaggaṁ bhāvayato paññā paññindriyaṁ paññābalaṁ dhammavicayasambojjhaṅgo sammādiṭṭhimaggaṅgaṁ— ayaṁ vuccati, bhikkhave, sammādiṭṭhi ariyā anāsavā lokuttarā maggaṅgā. So micchādiṭṭhiyā pahānāya vāyamati, sammādiṭṭhiyā, upasampadāya,svāssahoti sammāvāyāmo.",
    "mn117:6": "Tatra, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti. Kathañca, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti? Micchāsaṅkappaṁ ‘micchāsaṅkappo’ti pajānāti, sammāsaṅkappaṁ ‘sammāsaṅkappo’ti pajānāti, sāssa hoti sammādiṭṭhi.",
    "mn117:7": "Katamo ca, bhikkhave, micchāsaṅkappo? Kāmasaṅkappo, byāpādasaṅkappo, vihiṁsāsaṅkappo — ayaṁ, bhikkhave, micchāsaṅkappo.",
    "mn117:8": "Katamo ca, bhikkhave, sammāsaṅkappo? Sammāsaṅkappampahaṁ, bhikkhave, dvāyaṁ vadāmi — atthi, bhikkhave, sammāsaṅkappo sāsavo puññabhāgiyo upadhivepakko; atthi, bhikkhave, sammāsaṅkappo ariyo anāsavo lokuttaro maggaṅgo.",
    "mn117:9": "Katamo ca, bhikkhave, sammāsaṅkappo ariyo anāsavo lokuttaro maggaṅgo? Yo kho, bhikkhave, ariyacittassa anāsavacittassa ariyamaggasamaṅgino ariyamaggaṁ bhāvayato takko vitakko saṅkappo appanā byappanā cetaso abhiniropanā vacīsaṅkhāro — ayaṁ, bhikkhave, sammāsaṅkappo ariyo anāsavo lokuttaro maggaṅgo. So micchāsaṅkappassa pahānāya vāyamati, sammāsaṅkappassa upasampadāya, svāssa hoti sammāvāyāmo.",
    "mn117:10": "Tatra, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti. Kathañca, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti? Micchāvācaṁ ‘micchāvācā’ti pajānāti, sammāvācaṁ ‘sammāvācā’ti pajānāti; sāssa hoti sammādiṭṭhi.",
    "mn117:11": "Tatra, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti. Kathañca, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti? Micchākammantaṁ ‘micchākammanto’ti pajānāti, sammākammantaṁ ‘sammākammanto’ti pajānāti; sāssa hoti sammādiṭṭhi.",
    "mn117:12": "Tatra, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti. Kathañca, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti? Micchāājīvaṁ ‘micchāājīvo’ti pajānāti, sammāājīvaṁ ‘sammāājīvo’ti pajānāti; sāssa hoti sammādiṭṭhi.",
    "mn117:13": "Tatra, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti. Kathañca, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti? Sammādiṭṭhissa, bhikkhave, sammāsaṅkappo pahoti, sammāsaṅkappassa sammāvācā pahoti, sammāvācassa sammākammanto pahoti, sammākammantassa sammāājīvo pahoti, sammāājīvassa sammāvāyāmo pahoti, sammāvāyāmassa sammāsati pahoti, sammāsatissa sammāsamādhi pahoti, sammāsamādhissa sammāñāṇaṁ pahoti, sammāñāṇassa sammāvimutti pahoti. Iti kho, bhikkhave, aṭṭhaṅgasamannāgatosekkho, dasaṅgasamannāgato arahā hoti. Tatrapi sammāñāṇena aneke pāpakā akusalā dhammā vigatā bhāvanāpāripūriṁ gacchanti.",
    "mn117:14": "Tatra, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti. Kathañca, bhikkhave, sammādiṭṭhi pubbaṅgamā hoti? Sammādiṭṭhissa, bhikkhave, micchādiṭṭhi nijjiṇṇā hoti. Ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti. Sammādiṭṭhipaccayā aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti.",
    "mn117:15": "Iti kho, bhikkhave, vīsati kusalapakkhā, vīsati akusalapakkhā — mahācattārīsako dhammapariyāyo pavattito appaṭivattiyo samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṁ.",
    "mn117:16": "Yo hi koci, bhikkhave, samaṇo vā brāhmaṇo vā imaṁ mahācattārīsakaṁ dhammapariyāyaṁ garahitabbaṁ paṭikkositabbaṁ maññeyya tassa diṭṭheva dhamme dasasahadhammikā vādānuvādā gārayhaṁ ṭhānaṁ āgacchanti — sammādiṭṭhiñce bhavaṁ garahati, ye ca micchādiṭṭhī samaṇabrāhmaṇā te bhoto pujjā, te bhoto pāsaṁsā; sammāsaṅkappañce bhavaṁ garahati, ye ca micchāsaṅkappā samaṇabrāhmaṇā te bhoto pujjā, te bhoto pāsaṁsā; sammāvācañce bhavaṁ garahati … pe … sammākammantañce bhavaṁ garahati … sammāājīvañce bhavaṁ garahati … sammāvāyāmañce bhavaṁ garahati … sammāsatiñce bhavaṁ garahati … sammāsamādhiñce bhavaṁ garahati … sammāñāṇañce bhavaṁ garahati … sammāvimuttiñce bhavaṁ garahati, ye ca micchāvimuttī samaṇabrāhmaṇā te bhoto pujjā, te bhoto pāsaṁsā. Yo koci, bhikkhave, samaṇo vā brāhmaṇo vā imaṁ mahācattārīsakaṁ dhammapariyāyaṁ garahitabbaṁ paṭikkositabbaṁ maññeyya tassa diṭṭheva dhamme ime dasasahadhammikā vādānuvādā gārayhaṁ ṭhānaṁ āgacchanti.",
    "mn117:17": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}