{
    "mn111:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn111:2": "\"Paṇḍito, bhikkhave, sāriputto; mahāpañño, bhikkhave, sāriputto; puthupañño, bhikkhave, sāriputto;hāsapañño, bhikkhave, sāriputto; javanapañño, bhikkhave, sāriputto; tikkhapañño, bhikkhave, sāriputto; nibbedhikapañño, bhikkhave, sāriputto; sāriputto, bhikkhave, aḍḍhamāsaṁ anupadadhammavipassanaṁ vipassati. Tatridaṁ, bhikkhave, sāriputtassa anupadadhammavipassanāya hoti.",
    "mn111:3": "Idha, bhikkhave, sāriputto vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati.",
    "mn111:4": "Puna caparaṁ, bhikkhave, sāriputto vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati.",
    "mn111:5": "Puna caparaṁ, bhikkhave, sāriputto pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṁvedeti. Yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti tatiyaṁ jhānaṁ upasampajja viharati.",
    "mn111:6": "Puna caparaṁ, bhikkhave, sāriputto sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati.",
    "mn111:7": "Puna caparaṁ, bhikkhave, sāriputto sabbaso rūpasaññānaṁ samatikkamā paṭighasaññānaṁ atthaṅgamā nānattasaññānaṁ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṁ upasampajja viharati.",
    "mn111:8": "Puna caparaṁ, bhikkhave, sāriputto sabbaso ākāsānañcāyatanaṁ samatikkamma ‘anantaṁ viññāṇan’ti viññāṇañcāyatanaṁ upasampajja viharati.",
    "mn111:9": "Puna caparaṁ, bhikkhave, sāriputto sabbaso viññāṇañcāyatanaṁ samatikkamma ‘Natthi kiñcī’ti ākiñcaññāyatanaṁ upasampajja viharati.",
    "mn111:10": "Puna caparaṁ, bhikkhave, sāriputto sabbaso ākiñcaññāyatanaṁ samatikkamma nevasaññānāsaññāyatanaṁ upasampajja viharati.",
    "mn111:11": "Puna caparaṁ, bhikkhave, sāriputto sabbaso nevasaññānāsaññāyatanaṁ samatikkamma saññāvedayitanirodhaṁ upasampajja viharati. Paññāya cassa disvā āsavā parikkhīṇā honti.",
    "mn111:12": "Yaṁ kho taṁ, bhikkhave, sammā vadamāno vadeyya: ‘vasippatto pāramippatto ariyasmiṁ sīlasmiṁ, vasippatto pāramippatto ariyasmiṁ samādhismiṁ, vasippatto pāramippatto ariyāya paññāya, vasippatto pāramippatto ariyāya vimuttiyā’ti, sāriputtameva taṁ sammā vadamāno vadeyya: ‘vasippatto pāramippatto ariyasmiṁ sīlasmiṁ, vasippatto pāramippatto ariyasmiṁ samādhismiṁ, vasippatto pāramippatto ariyāya paññāya, vasippatto pāramippatto ariyāya vimuttiyā’ti.",
    "mn111:13": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}