{
    "mn124:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ āyasmābākulorājagahe viharati veḷuvane kalandakanivāpe.",
    "mn124:2": "\"Kīvaciraṁ pabbajitosi, āvuso bākulā\"ti?",
    "mn124:3": "\"Yampāyasmā bākulo asītiyā vassehi nābhijānāti kāmasaññaṁ uppannapubbaṁ idampi mayaṁ āyasmato bākulassa acchariyaṁ abbhutadhammaṁ dhārema\".(1)",
    "mn124:4": "\"Asīti me, āvuso, vassāni pabbajitassa nābhijānāmi byāpādasaññaṁ … pe … vihiṁsāsaññaṁ uppannapubbaṁ\".",
    "mn124:5": "\"Asīti me, āvuso, vassāni pabbajitassa nābhijānāmi kāmavitakkaṁ uppannapubbaṁ\".",
    "mn124:6": "\"Asīti me, āvuso, vassāni pabbajitassa nābhijānāmi byāpādavitakkaṁ … pe … vihiṁsāvitakkaṁ uppannapubbaṁ\".",
    "mn124:7": "\"Asīti me, āvuso, vassāni pabbajitassa nābhijānāmi gahapaticīvaraṁ sāditā\".",
    "mn124:8": "\"Asīti me, āvuso, vassāni pabbajitassa nābhijānāmi satthena cīvaraṁ chinditā\".",
    "mn124:9": "\"Asīti me, āvuso, vassāni pabbajitassa nābhijānāmi sūciyā cīvaraṁ sibbitā … pe … nābhijānāmi rajanena cīvaraṁ rajitā … nābhijānāmikathinecīvaraṁ sibbitā … nābhijānāmisabrahmacārīnaṁ cīvarakamme vicāritā… nābhijānāmi nimantanaṁ sāditā … nābhijānāmi evarūpaṁ cittaṁ uppannapubbaṁ: ‘aho vata maṁ koci nimanteyyā’ti … nābhijānāmi antaraghare nisīditā … nābhijānāmi antaraghare bhuñjitā … nābhijānāmi mātugāmassa anubyañjanaso nimittaṁ gahetā … nābhijānāmi mātugāmassa dhammaṁ desitā antamaso catuppadampi gāthaṁ … nābhijānāmi bhikkhunupassayaṁ upasaṅkamitā … nābhijānāmi bhikkhuniyā dhammaṁ desitā … nābhijānāmi sikkhamānāya dhammaṁ desitā … nābhijānāmi sāmaṇeriyā dhammaṁ desitā … nābhijānāmi pabbājetā … nābhijānāmi upasampādetā … nābhijānāmi nissayaṁ dātā … nābhijānāmi sāmaṇeraṁ upaṭṭhāpetā … nābhijānāmi jantāghare nhāyitā … nābhijānāmi cuṇṇena nhāyitā … nābhijānāmi sabrahmacārīgattaparikammevicāritā… nābhijānāmi ābādhaṁ uppannapubbaṁ, antamaso gaddūhanamattampi … nābhijānāmi bhesajjaṁ upaharitā, antamaso haritakikhaṇḍampi … nābhijānāmi apassenakaṁ apassayitā … nābhijānāmi seyyaṁ kappetā\".",
    "mn124:10": "\"Asīti me, āvuso, vassāni pabbajitassa nābhijānāmi gāmantasenāsane vassaṁ upagantā\".",
    "mn124:11": "\"Sattāhameva kho ahaṁ, āvuso, saraṇo raṭṭhapiṇḍaṁ bhuñjiṁ; atha aṭṭhamiyaṁ aññā udapādi.",
    "mn124:12": "Labheyyāhaṁ, āvuso bākula, imasmiṁ dhammavinaye pabbajjaṁ, labheyyaṁ upasampadan\"ti. Alattha kho acelakassapo imasmiṁ dhammavinaye pabbajjaṁ, alattha upasampadaṁ. Acirūpasampanno panāyasmā kassapo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva — yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ — brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāsi. \"Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā\"ti abbhaññāsi. Aññataro kho panāyasmā kassapo arahataṁ ahosi.",
    "mn124:13": "Atha kho āyasmā bākulo aparena samayenaavāpuraṇaṁādāya vihārena vihāraṁ upasaṅkamitvā evamāha: \"abhikkamathāyasmanto, abhikkamathāyasmanto. Ajja me parinibbānaṁ bhavissatī\"ti.",
    "mn124:14": "Āyasmā bākulo majjhe bhikkhusaṅghassa nisinnakova parinibbāyi."
}