{
    "mn122:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sakkesu viharati kapilavatthusmiṁ nigrodhārāme.",
    "mn122:2": "Tena kho pana samayena āyasmā ānando sambahulehi bhikkhūhi saddhiṁ ghaṭāya sakkassa vihāre cīvarakammaṁ karoti. Atha kho bhagavā sāyanhasamayaṁ paṭisallānā vuṭṭhito yena ghaṭāya sakkassa vihāro tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṁ ānandaṁ āmantesi:",
    "mn122:3": "\"Na kho, ānanda, bhikkhu sobhati saṅgaṇikārāmo saṅgaṇikarato saṅgaṇikārāmataṁ anuyutto gaṇārāmo gaṇarato gaṇasammudito. So vatānanda, bhikkhu saṅgaṇikārāmo saṅgaṇikarato saṅgaṇikārāmataṁ anuyutto gaṇārāmo gaṇarato gaṇasammudito yaṁ taṁ nekkhammasukhaṁ pavivekasukhaṁ upasamasukhaṁsambodhisukhaṁtassa sukhassa nikāmalābhī bhavissati akicchalābhī akasiralābhīti — netaṁ ṭhānaṁ vijjati. Yo ca kho so, ānanda, bhikkhu eko gaṇasmā vūpakaṭṭho viharati tassetaṁ bhikkhuno pāṭikaṅkhaṁ yaṁ taṁ nekkhammasukhaṁ pavivekasukhaṁ upasamasukhaṁ sambodhisukhaṁ tassa sukhassa nikāmalābhī bhavissati akicchalābhī akasiralābhīti — ṭhānametaṁ vijjati.",
    "mn122:4": "So vatānanda, bhikkhu saṅgaṇikārāmo saṅgaṇikarato saṅgaṇikārāmataṁ anuyutto gaṇārāmo gaṇarato gaṇasammudito sāmāyikaṁ vā kantaṁ cetovimuttiṁ upasampajja viharissati asāmāyikaṁ vā akuppanti — netaṁ ṭhānaṁ vijjati. Yo ca kho so, ānanda, bhikkhu eko gaṇasmā vūpakaṭṭho viharati tassetaṁ bhikkhuno pāṭikaṅkhaṁ sāmāyikaṁ vā kantaṁ cetovimuttiṁ upasampajja viharissati asāmāyikaṁ vā akuppanti — ṭhānametaṁ vijjati.",
    "mn122:5": "Nāhaṁ, ānanda,ekaṁ rūpampisamanupassāmi yattha rattassa yathābhiratassa rūpassa vipariṇāmaññathābhāvā na uppajjeyyuṁ sokaparidevadukkhadomanassūpāyāsā.",
    "mn122:6": "Ayaṁ kho panānanda, vihāro tathāgatena abhisambuddho yadidaṁ — sabbanimittānaṁ amanasikārā ajjhattaṁ suññataṁ upasampajjaviharituṁ. Tatra ce, ānanda, tathāgataṁ iminā vihārena viharantaṁbhavantiupasaṅkamitāro bhikkhū bhikkhuniyo upāsakā upāsikāyo rājāno rājamahāmattā titthiyā titthiyasāvakā. Tatrānanda, tathāgato vivekaninneneva cittena vivekapoṇena vivekapabbhārena vūpakaṭṭhena nekkhammābhiratena byantībhūtena sabbaso āsavaṭṭhānīyehi dhammehi aññadatthu uyyojanikapaṭisaṁyuttaṁyeva kathaṁ kattā hoti.",
    "mn122:7": "Kathañcānanda, bhikkhu ajjhattameva cittaṁ saṇṭhapetisannisādeti ekodiṁ karotisamādahati?",
    "mn122:8": "Tenānanda, bhikkhunā tasmiṁyeva purimasmiṁ samādhinimitte ajjhattameva cittaṁ saṇṭhapetabbaṁ sannisādetabbaṁ ekodi kātabbaṁ samādahātabbaṁ. So ajjhattaṁ suññataṁ manasi karoti. Tassa ajjhattaṁ suññataṁ manasikaroto ajjhattaṁ suññatāya cittaṁ pakkhandati pasīdati santiṭṭhati vimuccati. Evaṁ santametaṁ, ānanda, bhikkhu evaṁ pajānāti: ‘ajjhattaṁ suññataṁ kho me manasikaroto ajjhattaṁ suññatāya cittaṁ pakkhandati pasīdati santiṭṭhati vimuccatī’ti. Itiha tattha sampajāno hoti.",
    "mn122:9": "Tassa ce, ānanda, bhikkhuno iminā vihārena viharato caṅkamāya cittaṁ namati, so caṅkamati: ‘evaṁ maṁ caṅkamantaṁ nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti. Tassa ce, ānanda, bhikkhuno iminā vihārena viharato ṭhānāya cittaṁ namati, so tiṭṭhati: ‘evaṁ maṁ ṭhitaṁ nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti. Tassa ce, ānanda, bhikkhuno iminā vihārena viharato nisajjāya cittaṁ namati, so nisīdati: ‘evaṁ maṁ nisinnaṁ nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti. Tassa ce, ānanda, bhikkhuno iminā vihārena viharato sayanāya cittaṁ namati, so sayati: ‘evaṁ maṁ sayantaṁ nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti.",
    "mn122:10": "Tassa ce, ānanda, bhikkhuno iminā vihārena viharatokathāyacittaṁ namati, so: ‘yāyaṁ kathā hīnā gammā pothujjanikā anariyā anatthasaṁhitā na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṁvattati, seyyathidaṁ — rājakathā corakathā mahāmattakathā senākathā bhayakathā yuddhakathā annakathā pānakathā vatthakathā sayanakathā mālākathā gandhakathā ñātikathā yānakathā gāmakathā nigamakathā nagarakathā janapadakathā itthikathā surākathā visikhākathā kumbhaṭṭhānakathā pubbapetakathā nānattakathā lokakkhāyikā samuddakkhāyikā itibhavābhavakathā iti vā iti — evarūpiṁ kathaṁ na kathessāmī’ti. Itiha tattha sampajāno hoti.",
    "mn122:11": "Tassa ce, ānanda, bhikkhuno iminā vihārena viharato vitakkāya cittaṁ namati, so: ‘ye te vitakkā hīnā gammā pothujjanikā anariyā anatthasaṁhitā na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṁvattanti, seyyathidaṁ — kāmavitakko byāpādavitakko vihiṁsāvitakko itievarūpe vitakkena vitakkessāmī’ti. Itiha tattha sampajāno hoti.",
    "mn122:12": "Pañca kho ime, ānanda, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā, sotaviññeyyā saddā … ghānaviññeyyā gandhā … jivhāviññeyyā rasā … kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā — ime kho, ānanda, pañca kāmaguṇā.",
    "mn122:": "12Pañca kho ime, ānanda, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā, sotaviññeyyā saddā … ghānaviññeyyā gandhā … jivhāviññeyyā rasā … kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā — ime kho, ānanda, pañca kāmaguṇā.",
    "mn122:13": "Pañca kho ime, ānanda, upādānakkhandhā yattha bhikkhunā udayabbayānupassinā vihātabbaṁ: ‘iti rūpaṁ iti rūpassa samudayo iti rūpassa atthaṅgamo, iti vedanā … iti saññā … iti saṅkhārā … iti viññāṇaṁ iti viññāṇassa samudayo iti viññāṇassa atthaṅgamo’ti.",
    "mn122:14": "\"Na kho, ānanda, arahati sāvako satthāraṁ anubandhituṁ, yadidaṁ suttaṁ geyyaṁveyyākaraṇaṁ tassa hetu. Taṁ kissa hetu?Dīgharattassahi te, ānanda, dhammā sutā dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Yā ca kho ayaṁ, ānanda, kathā abhisallekhikā cetovinīvaraṇasappāyā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati, seyyathidaṁ — appicchakathā santuṭṭhikathā pavivekakathā asaṁsaggakathā vīriyārambhakathā sīlakathā samādhikathā paññākathā vimuttikathā vimuttiñāṇadassanakathā — evarūpiyā kho, ānanda, kathāya hetu arahati sāvako satthāraṁ anubandhituṁ api paṇujjamāno.",
    "mn122:15": "Evaṁ sante kho, ānanda, ācariyūpaddavo hoti, evaṁ sante antevāsūpaddavo hoti, evaṁ sante brahmacārūpaddavo hoti.",
    "mn122:16": "Kathañcānanda, ācariyūpaddavo hoti? Idhānanda, ekacco satthā vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. Tassa tathāvūpakaṭṭhassa viharatoanvāvattantibrāhmaṇagahapatikā negamā ceva jānapadā ca. So anvāvattantesu brāhmaṇagahapatikesu negamesu ceva jānapadesu camucchaṁ nikāmayati, gedhaṁ āpajjati, āvattati bāhullāya. Ayaṁ vuccatānanda,upaddavoācariyo. Ācariyūpaddavena avadhiṁsu naṁ pāpakā akusalā dhammā saṁkilesikāponobbhavikāsadarā dukkhavipākā āyatiṁ jātijarāmaraṇiyā. Evaṁ kho, ānanda, ācariyūpaddavo hoti.",
    "mn122:17": "Kathañcānanda, antevāsūpaddavo hoti? Tasseva kho panānanda, satthu sāvako tassa satthu vivekamanubrūhayamāno vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. Tassa tathāvūpakaṭṭhassa viharato anvāvattanti brāhmaṇagahapatikā negamā ceva jānapadā ca. So anvāvattantesu brāhmaṇagahapatikesu negamesu ceva jānapadesu ca mucchaṁ nikāmayati, gedhaṁ āpajjati, āvattati bāhullāya. Ayaṁ vuccatānanda, upaddavo antevāsī. Antevāsūpaddavena avadhiṁsu naṁ pāpakā akusalā dhammā saṅkilesikā ponobbhavikā sadarā dukkhavipākā āyatiṁ jātijarāmaraṇiyā. Evaṁ kho, ānanda, antevāsūpaddavo hoti.",
    "mn122:18": "Kathañcānanda, brahmacārūpaddavo hoti? Idhānanda, tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. So vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. Tassa tathāvūpakaṭṭhassa viharato anvāvattanti brāhmaṇagahapatikā negamā ceva jānapadā ca. So anvāvattantesu brāhmaṇagahapatikesu negamesu ceva jānapadesu ca na mucchaṁ nikāmayati, na gedhaṁ āpajjati, na āvattati bāhullāya. Tasseva kho panānanda, satthu sāvako tassa satthu vivekamanubrūhayamāno vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. Tassa tathāvūpakaṭṭhassa viharato anvāvattanti brāhmaṇagahapatikā negamā ceva jānapadā ca. So anvāvattantesu brāhmaṇagahapatikesu negamesu ceva jānapadesu ca mucchaṁ nikāmayati, gedhaṁ āpajjati, āvattati bāhullāya. Ayaṁ vuccatānanda, upaddavo brahmacārī. Brahmacārūpaddavena avadhiṁsu naṁ pāpakā akusalā dhammā saṅkilesikā ponobbhavikā sadarā dukkhavipākā āyatiṁ jātijarāmaraṇiyā. Evaṁ kho, ānanda, brahmacārūpaddavo hoti.",
    "mn122:19": "Tatrānanda, yo cevāyaṁ ācariyūpaddavo, yo ca antevāsūpaddavo ayaṁ tehi brahmacārūpaddavo dukkhavipākataro ceva kaṭukavipākataro ca, api ca vinipātāya saṁvattati.",
    "mn122:20": "Tasmātiha maṁ, ānanda, mittavatāya samudācaratha, mā sapattavatāya. Taṁ vo bhavissati dīgharattaṁ hitāya sukhāya.",
    "mn122:21": "Kathañcānanda, satthāraṁ sāvakā sapattavatāya samudācaranti, no mittavatāya? Idhānanda, satthā sāvakānaṁ dhammaṁ deseti anukampako hitesī anukampaṁ upādāya: ‘idaṁ vo hitāya, idaṁ vo sukhāyā’ti. Tassa sāvakā na sussūsanti, na sotaṁ odahanti, na aññā cittaṁ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti. Evaṁ kho, ānanda, satthāraṁ sāvakā sapattavatāya samudācaranti, no mittavatāya.",
    "mn122:22": "Kathañcānanda, satthāraṁ sāvakā mittavatāya samudācaranti, no sapattavatāya? Idhānanda, satthā sāvakānaṁ dhammaṁ deseti anukampako hitesī anukampaṁ upādāya: ‘idaṁ vo hitāya, idaṁ vo sukhāyā’ti. Tassa sāvakā sussūsanti, sotaṁ odahanti, aññā cittaṁ upaṭṭhapenti, na ca vokkamma satthusāsanā vattanti. Evaṁ kho, ānanda, satthāraṁ sāvakā mittavatāya samudācaranti, no sapattavatāya.",
    "mn122:23": "Tasmātiha maṁ, ānanda, mittavatāya samudācaratha, mā sapattavatāya. Taṁ vo bhavissati dīgharattaṁ hitāya sukhāya.",
    "mn122:24": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}