{
    "mn127:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn127:2": "Atha kho āyasmā anuruddho tassā rattiyā accayena pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena pañcakaṅgassa thapatissa nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho pañcakaṅgo thapati āyasmantaṁ anuruddhaṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho pañcakaṅgo thapati āyasmantaṁ anuruddhaṁ bhuttāviṁ onītapattapāṇiṁ aññataraṁ nīcaṁ āsanaṁ gahetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho pañcakaṅgo thapati āyasmantaṁ anuruddhaṁ etadavoca:",
    "mn127:3": "\"Idha maṁ, bhante, therā bhikkhū upasaṅkamitvā evamāhaṁsu: ‘appamāṇaṁ, gahapati, cetovimuttiṁ bhāvehī’ti. Ekacce therā evamāhaṁsu: ‘mahaggataṁ, gahapati, cetovimuttiṁ bhāvehī’ti. Yā cāyaṁ, bhante, appamāṇā cetovimutti yā ca mahaggatā cetovimutti — ime dhammā nānatthā ceva nānābyañjanā ca, udāhu ekatthā byañjanameva nānan\"ti?",
    "mn127:4": "Katamā ca, gahapati, appamāṇā cetovimutti? Idha, gahapati, bhikkhu mettāsahagatena cetasā ekaṁ disaṁ pharitvā viharati, tathā dutiyaṁ tathā tatiyaṁ tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Karuṇāsahagatena cetasā … muditāsahagatena cetasā … upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā viharati, tathā dutiyaṁ tathā tatiyaṁ tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Ayaṁ vuccati, gahapati, appamāṇā cetovimutti.",
    "mn127:5": "Katamā ca, gahapati, mahaggatā cetovimutti? Idha, gahapati, bhikkhu yāvatā ekaṁ rukkhamūlaṁ mahaggatanti pharitvā adhimuccitvā viharati. Ayaṁ vuccati, gahapati, mahaggatā cetovimutti. Idha pana, gahapati, bhikkhu yāvatā dve vā tīṇi vā rukkhamūlāni mahaggatanti pharitvā adhimuccitvā viharati.Ayampivuccati, gahapati, mahaggatā cetovimutti. Idha pana, gahapati, bhikkhu yāvatā ekaṁ gāmakkhettaṁ mahaggatanti pharitvā adhimuccitvā viharati. Ayampi vuccati, gahapati, mahaggatā cetovimutti. Idha pana, gahapati, bhikkhu yāvatā dve vā tīṇi vā gāmakkhettāni mahaggatanti pharitvā adhimuccitvā viharati. Ayampi vuccati, gahapati, mahaggatā cetovimutti. Idha pana, gahapati, bhikkhu yāvatā ekaṁ mahārajjaṁ mahaggatanti pharitvā adhimuccitvā viharati. Ayampi vuccati, gahapati, mahaggatā cetovimutti. Idha pana, gahapati, bhikkhu yāvatā dve vā tīṇi vā mahārajjāni mahaggatanti pharitvā adhimuccitvā viharati. Ayampi vuccati, gahapati, mahaggatā cetovimutti. Idha pana, gahapati, bhikkhu yāvatā samuddapariyantaṁ pathaviṁ mahaggatanti pharitvā adhimuccitvā viharati. Ayampi vuccati, gahapati, mahaggatā cetovimutti. Iminā kho etaṁ, gahapati, pariyāyena veditabbaṁ yathā ime dhammā nānatthā ceva nānābyañjanā ca.",
    "mn127:6": "Catasso kho imā gahapati, bhavūpapattiyo. Katamā catasso? Idha, gahapati, ekacco ‘parittābhā’ti pharitvā adhimuccitvā viharati. So kāyassa bhedā paraṁ maraṇā parittābhānaṁ devānaṁ sahabyataṁ upapajjati. Idha pana, gahapati, ekacco ‘appamāṇābhā’ti pharitvā adhimuccitvā viharati. So kāyassa bhedā paraṁ maraṇā appamāṇābhānaṁ devānaṁ sahabyataṁ upapajjati. Idha pana, gahapati, ekacco ‘saṅkiliṭṭhābhā’ti pharitvā adhimuccitvā viharati. So kāyassa bhedā paraṁ maraṇā saṅkiliṭṭhābhānaṁ devānaṁ sahabyataṁ upapajjati. Idha pana, gahapati, ekacco ‘parisuddhābhā’ti pharitvā adhimuccitvā viharati. So kāyassa bhedā paraṁ maraṇā parisuddhābhānaṁ devānaṁ sahabyataṁ upapajjati. Imā kho, gahapati, catasso bhavūpapattiyo.",
    "mn127:7": "Hoti kho so, gahapati, samayo, yā tā devatā ekajjhaṁ sannipatanti, tāsaṁ ekajjhaṁ sannipatitānaṁ vaṇṇanānattañhi kho paññāyati no ca ābhānānattaṁ. Seyyathāpi, gahapati, puriso sambahulāni telappadīpāni ekaṁ gharaṁ paveseyya. Tesaṁ ekaṁ gharaṁ pavesitānaṁ accinānattañhi kho paññāyetha, no ca ābhānānattaṁ; evameva kho, gahapati, hoti kho so samayo, yā tā devatā ekajjhaṁ sannipatanti tāsaṁ ekajjhaṁ sannipatitānaṁ vaṇṇanānattañhi kho paññāyati, no ca ābhānānattaṁ.",
    "mn127:8": "Hoti kho so, gahapati, samayo, yā tā devatā tato vipakkamanti, tāsaṁ tato vipakkamantīnaṁ vaṇṇanānattañceva paññāyati ābhānānattañca. Seyyathāpi, gahapati, puriso tāni sambahulāni telappadīpāni tamhā gharā nīhareyya. Tesaṁ tatonīhatānaṁaccinānattañceva paññāyetha ābhānānattañca; evameva kho, gahapati, hoti kho so samayo, yā tā devatā tato vipakkamanti, tāsaṁ tato vipakkamantīnaṁ vaṇṇanānattañceva paññāyati ābhānānattañca.",
    "mn127:9": "Na kho, gahapati, tāsaṁ devatānaṁ evaṁ hoti: ‘idaṁ amhākaṁ niccanti vā dhuvanti vā sassatanti vā’, api ca yattha yatthevatādevatā abhinivisanti tattha tattheva tā devatā abhiramanti. Seyyathāpi, gahapati, makkhikānaṁ kājena vā piṭakena vā harīyamānānaṁ na evaṁ hoti: ‘idaṁ amhākaṁ niccanti vā dhuvanti vā sassatanti vā’, api ca yattha yatthevatāmakkhikā abhinivisanti tattha tattheva tā makkhikā abhiramanti; evameva kho, gahapati, tāsaṁ devatānaṁ na evaṁ hoti: ‘idaṁ amhākaṁ niccanti vā dhuvanti vā sassatanti vā’, api ca yattha yattheva tā devatā abhinivisanti tattha tattheva tā devatā abhiramantī\"ti.",
    "mn127:10": "Evaṁ vutte, āyasmāsabhiyo kaccānoāyasmantaṁ anuruddhaṁ etadavoca: \"Sādhu, bhante anuruddha. Atthi ca me ettha uttariṁ paṭipucchitabbaṁ. Yā tā, bhante, devatā ābhā sabbā tā parittābhā udāhu santettha ekaccā devatā appamāṇābhā\"ti?",
    "mn127:11": "\"Tena hāvuso kaccāna, taṁyevettha paṭipucchissāmi. Yathā te khameyya tathā naṁ byākareyyāsi. Taṁ kiṁ maññasi, āvuso kaccāna, yvāyaṁ bhikkhu yāvatā ekaṁ rukkhamūlaṁ ‘mahaggatan’ti pharitvā adhimuccitvā viharati, yocāyaṁbhikkhu yāvatā dve vā tīṇi vā rukkhamūlāni ‘mahaggatan’ti pharitvā adhimuccitvā viharati — imāsaṁ ubhinnaṁ cittabhāvanānaṁ katamā cittabhāvanā mahaggatatarā\"ti? \"Yvāyaṁ, bhante, bhikkhu yāvatā dve vā tīṇi vā rukkhamūlāni ‘mahaggatan’ti pharitvā adhimuccitvā viharati — ayaṁ imāsaṁ ubhinnaṁ cittabhāvanānaṁ mahaggatatarā\"ti.",
    "mn127:12": "\"Taṁ kiṁ maññasi, āvuso kaccāna, yvāyaṁ bhikkhu yāvatā dve vā tīṇi vā rukkhamūlāni ‘mahaggatan’ti pharitvā adhimuccitvā viharati, yo cāyaṁ bhikkhu yāvatā ekaṁ gāmakkhettaṁ ‘mahaggatan’ti pharitvā adhimuccitvā viharati — imāsaṁ ubhinnaṁ cittabhāvanānaṁ katamā cittabhāvanā mahaggatatarā\"ti? \"Yvāyaṁ, bhante, bhikkhu yāvatā ekaṁ gāmakkhettaṁ ‘mahaggatan’ti pharitvā adhimuccitvā viharati — ayaṁ imāsaṁ ubhinnaṁ cittabhāvanānaṁ mahaggatatarā\"ti.",
    "mn127:13": "\"Taṁ kiṁ maññasi, āvuso kaccāna, yvāyaṁ bhikkhu yāvatā ekaṁ gāmakkhettaṁ ‘mahaggatan’ti pharitvā adhimuccitvā viharati, yo cāyaṁ bhikkhu yāvatā dve vā tīṇi vā gāmakkhettāni ‘mahaggatan’ti pharitvā adhimuccitvā viharati — imāsaṁ ubhinnaṁ cittabhāvanānaṁ katamā cittabhāvanā mahaggatatarā\"ti? \"Yvāyaṁ, bhante, bhikkhu yāvatā dve vā tīṇi vā gāmakkhettāni ‘mahaggatan’ti pharitvā adhimuccitvā viharati — ayaṁ imāsaṁ ubhinnaṁ cittabhāvanānaṁ mahaggatatarā\"ti.",
    "mn127:14": "\"Taṁ kiṁ maññasi, āvuso kaccāna, yvāyaṁ bhikkhu yāvatā dve vā tīṇi vā gāmakkhettāni ‘mahaggatan’ti pharitvā adhimuccitvā viharati, yo cāyaṁ bhikkhu yāvatā ekaṁ mahārajjaṁ ‘mahaggatan’ti pharitvā adhimuccitvā viharati — imāsaṁ ubhinnaṁ cittabhāvanānaṁ katamā cittabhāvanā mahaggatatarā\"ti? \"Yvāyaṁ, bhante, bhikkhu yāvatā ekaṁ mahārajjaṁ ‘mahaggatan’ti pharitvā adhimuccitvā viharati –  ayaṁ imāsaṁ ubhinnaṁ cittabhāvanānaṁ mahaggatatarā\"ti.",
    "mn127:15": "\"Taṁ kiṁ maññasi, āvuso kaccāna, yvāyaṁ bhikkhu yāvatā ekaṁ mahārajjaṁ ‘mahaggatan’ti pharitvā adhimuccitvā viharati, yo cāyaṁ bhikkhu yāvatā dve vā tīṇi vā mahārajjāni ‘mahaggatan’ti pharitvā adhimuccitvā viharati — imāsaṁ ubhinnaṁ cittabhāvanānaṁ katamā cittabhāvanā mahaggatatarā\"ti? \"Yvāyaṁ, bhante, bhikkhu yāvatā dve vā tīṇi vā mahārajjāni ‘mahaggatan’ti pharitvā adhimuccitvā viharati — ayaṁ imāsaṁ ubhinnaṁ cittabhāvanānaṁ mahaggatatarā\"ti.",
    "mn127:16": "\"Taṁ kiṁ maññasi, āvuso kaccāna, yvāyaṁ bhikkhu yāvatā dve vā tīṇi vā mahārajjāni ‘mahaggatan’ti pharitvā adhimuccitvā viharati, yo cāyaṁ bhikkhu yāvatā samuddapariyantaṁ pathaviṁ ‘mahaggatan’ti pharitvā adhimuccitvā viharati — imāsaṁ ubhinnaṁ cittabhāvanānaṁ katamā cittabhāvanā mahaggatatarā\"ti?",
    "mn127:17": "\"Sādhu, bhante anuruddha. Atthi ca me ettha uttariṁ paṭipucchitabbaṁ.Yāvatā, bhante, devatā ābhā sabbā tā saṁkiliṭṭhābhā udāhu santettha ekaccā devatā parisuddhābhā\"ti?",
    "mn127:18": "\"Tena hāvuso kaccāna, upamaṁ te karissāmi.Upamāyapidhekacceviññū purisā bhāsitassa atthaṁ ājānanti. Seyyathāpi, āvuso kaccāna, telappadīpassa jhāyato telampi aparisuddhaṁ vaṭṭipi aparisuddhā. So telassapi aparisuddhattā vaṭṭiyāpi aparisuddhattā andhandhaṁ viya jhāyati; evameva kho, āvuso kaccāna, idhekacco bhikkhu ‘saṁkiliṭṭhābhā’ti pharitvā adhimuccitvā viharati, tassa kāyaduṭṭhullampi na suppaṭippassaddhaṁ hoti, thinamiddhampi na susamūhataṁ hoti, uddhaccakukkuccampi na suppaṭivinītaṁ hoti. So kāyaduṭṭhullassapi na suppaṭippassaddhattā thinamiddhassapi na susamūhatattā uddhaccakukkuccassapi na suppaṭivinītattā andhandhaṁ viya jhāyati. So kāyassa bhedā paraṁ maraṇā saṁkiliṭṭhābhānaṁ devānaṁ sahabyataṁ upapajjati.",
    "mn127:19": "Evaṁ vutte, āyasmā sabhiyo kaccāno āyasmantaṁ anuruddhaṁ etadavoca: \"Sādhu, bhante anuruddha. Na, bhante, āyasmā anuruddho evamāha: ‘evaṁ me sutan’ti vā ‘evaṁ arahati bhavitun’ti vā; atha ca pana, bhante, āyasmā anuruddho ‘evampi tā devatā, itipi tā devatā’tveva bhāsati. Tassa mayhaṁ, bhante, evaṁ hoti: ‘addhā āyasmatā anuruddhena tāhi devatāhi saddhiṁ sannivutthapubbañceva sallapitapubbañca sākacchā ca samāpajjitapubbā’\"ti.",
    "mn127:20": "Evaṁ vutte, āyasmā sabhiyo kaccāno pañcakaṅgaṁ thapatiṁ etadavoca: \"lābhā te, gahapati, suladdhaṁ te, gahapati, yaṁ tvañceva taṁ kaṅkhādhammaṁpahāsi,mayañcimaṁdhammapariyāyaṁ alatthamhā savanāyā\"ti."
}