{
    "mn139:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn139:2": "\"Na kāmasukhamanuyuñjeyya hīnaṁ gammaṁ pothujjanikaṁ anariyaṁ anatthasaṁhitaṁ, na ca attakilamathānuyogamanuyuñjeyya dukkhaṁ anariyaṁ anatthasaṁhitaṁ. Ete kho, bhikkhave, ubho ante anupagamma majjhimā paṭipadā tathāgatena abhisambuddhā, cakkhukaraṇī ñāṇakaraṇī upasamāya abhiññāya sambodhāya nibbānāya saṁvattati. Ussādanañca jaññā, apasādanañca jaññā; ussādanañca ñatvā apasādanañca ñatvā nevussādeyya, naapasādeyya, dhammameva deseyya. Sukhavinicchayaṁ jaññā; sukhavinicchayaṁ ñatvā ajjhattaṁ sukhamanuyuñjeyya. Rahovādaṁ na bhāseyya, sammukhāna khīṇaṁbhaṇe. Ataramānova bhāseyya, no taramāno. Janapadaniruttiṁ nābhiniveseyya, samaññaṁ nātidhāveyyāti — ayamuddeso araṇavibhaṅgassa.",
    "mn139:3": "‘Na kāmasukhamanuyuñjeyya hīnaṁ gammaṁ pothujjanikaṁ anariyaṁ anatthasaṁhitaṁ, na ca attakilamathānuyogamanuyuñjeyya dukkhaṁ anariyaṁ anatthasaṁhitan’ti — iti kho panetaṁ vuttaṁ; kiñcetaṁ paṭicca vuttaṁ?",
    "mn139:4": "‘Ete kho ubho ante anupagamma majjhimā paṭipadā tathāgatena abhisambuddhā, cakkhukaraṇī ñāṇakaraṇī upasamāya abhiññāya sambodhāya nibbānāya saṁvattatī’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṁ — sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi. ‘Ete kho ubho ante anupagamma majjhimā paṭipadā tathāgatena abhisambuddhā, cakkhukaraṇī ñāṇakaraṇī upasamāya abhiññāya sambodhāya nibbānāya saṁvattatī’ti — iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "mn139:5": "‘Ussādanañca jaññā, apasādanañca jaññā; ussādanañca ñatvā apasādanañca ñatvā nevussādeyya, na apasādeyya, dhammameva deseyyā’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ?",
    "mn139:6": "‘Ye kāmapaṭisandhisukhino somanassānuyogaṁ ananuyuttā hīnaṁ gammaṁ pothujjanikaṁ anariyaṁ anatthasaṁhitaṁ, sabbe te adukkhā anupaghātā anupāyāsā apariḷāhā sammāpaṭipannā’ti — iti vadaṁ ittheke ussādeti.",
    "mn139:7": "‘Ye attakilamathānuyogaṁ anuyuttā dukkhaṁ anariyaṁ anatthasaṁhitaṁ, sabbe te sadukkhā saupaghātā saupāyāsā sapariḷāhā micchāpaṭipannā’ti — iti vadaṁ ittheke apasādeti.",
    "mn139:8": "‘Ye attakilamathānuyogaṁ ananuyuttā dukkhaṁ anariyaṁ anatthasaṁhitaṁ, sabbe te adukkhā anupaghātā anupāyāsā apariḷāhā sammāpaṭipannā’ti — iti vadaṁ ittheke ussādeti.",
    "mn139:9": "‘Yesaṁ kesañci bhavasaṁyojanaṁ appahīnaṁ, sabbe te sadukkhā saupaghātā saupāyāsā sapariḷāhā micchāpaṭipannā’ti — iti vadaṁ ittheke apasādeti.",
    "mn139:10": "‘Yesaṁ kesañci bhavasaṁyojanaṁ pahīnaṁ, sabbe te adukkhā anupaghātā anupāyāsā apariḷāhā sammāpaṭipannā’ti — iti vadaṁ ittheke ussādeti. Evaṁ kho, bhikkhave, ussādanā ca hoti apasādanā ca, no ca dhammadesanā.",
    "mn139:11": "Kathañca, bhikkhave, nevussādanā hoti na apasādanā,dhammadesanā ca? ‘Ye kāmapaṭisandhisukhino somanassānuyogaṁ anuyuttā hīnaṁ gammaṁ pothujjanikaṁ anariyaṁ anatthasaṁhitaṁ, sabbe te sadukkhā saupaghātā saupāyāsā sapariḷāhā micchāpaṭipannā’ti — na evamāha. ‘Anuyogo ca kho sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā’ti — iti vadaṁ dhammameva deseti.",
    "mn139:12": "‘Ye kāmapaṭisandhisukhino somanassānuyogaṁ ananuyuttā hīnaṁ gammaṁ pothujjanikaṁ anariyaṁ anatthasaṁhitaṁ, sabbe te adukkhā anupaghātā anupāyāsā apariḷāhā sammāpaṭipannā’ti — na evamāha. ‘Ananuyogo ca kho adukkho eso dhammo anupaghāto anupāyāso apariḷāho; sammāpaṭipadā’ti — iti vadaṁ dhammameva deseti.",
    "mn139:13": "‘Ye attakilamathānuyogaṁ anuyuttā dukkhaṁ anariyaṁ anatthasaṁhitaṁ, sabbe te sadukkhā saupaghātā saupāyāsā sapariḷāhā micchāpaṭipannā’ti — na evamāha. ‘Anuyogo ca kho sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā’ti — iti vadaṁ dhammameva deseti.",
    "mn139:14": "‘Ye attakilamathānuyogaṁ ananuyuttā dukkhaṁ anariyaṁ anatthasaṁhitaṁ, sabbe te adukkhā anupaghātā anupāyāsā apariḷāhā sammāpaṭipannā’ti — na evamāha. ‘Ananuyogo ca kho adukkho eso dhammo anupaghāto anupāyāso apariḷāho; sammāpaṭipadā’ti — iti vadaṁ dhammameva deseti.",
    "mn139:15": "‘Yesaṁ kesañci bhavasaṁyojanaṁ appahīnaṁ, sabbe te sadukkhā saupaghātā saupāyāsā sapariḷāhā micchāpaṭipannā’ti — na evamāha. ‘Bhavasaṁyojane ca kho appahīne bhavopi appahīno hotī’ti — iti vadaṁ dhammameva deseti.",
    "mn139:16": "‘Yesaṁ kesañci bhavasaṁyojanaṁ pahīnaṁ, sabbe te adukkhā anupaghātā anupāyāsā apariḷāhā sammāpaṭipannā’ti — na evamāha. ‘Bhavasaṁyojane ca kho pahīne bhavopi pahīno hotī’ti — iti vadaṁ dhammameva deseti.",
    "mn139:17": "‘Sukhavinicchayaṁ jaññā; sukhavinicchayaṁ ñatvā ajjhattaṁ sukhamanuyuñjeyyā’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ?",
    "mn139:18": "‘Rahovādaṁ na bhāseyya, sammukhā na khīṇaṁ bhaṇe’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ?",
    "mn139:19": "‘Ataramānova bhāseyya no taramāno’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ?",
    "mn139:20": "‘Janapadaniruttiṁ nābhiniveseyya, samaññaṁ nātidhāveyyā’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ?",
    "mn139:21": "Kathañca, bhikkhave, janapadaniruttiyā ca anabhiniveso hoti samaññāya ca anatisāro? Idha, bhikkhave, tadevekaccesu janapadesu ‘pātī’ti sañjānanti, ‘pattan’ti sañjānanti, ‘vittan’ti sañjānanti, ‘sarāvan’ti sañjānanti, ‘dhāropan’ti sañjānanti, ‘poṇan’ti sañjānanti, ‘pisīlavan’ti sañjānanti. Iti yathā yathā naṁ tesu tesu janapadesu sañjānanti ‘idaṁ kira meāyasmanto sandhāya voharantī’ti tathā tathā voharati aparāmasaṁ. Evaṁ kho, bhikkhave, janapadaniruttiyā ca anabhiniveso hoti, samaññāya ca anatisāro.",
    "mn139:22": "Tatra, bhikkhave, yo kāmapaṭisandhisukhino somanassānuyogo hīno gammo pothujjaniko anariyo anatthasaṁhito, sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā. Tasmā eso dhammo saraṇo.",
    "mn139:23": "Tatra, bhikkhave, yo attakilamathānuyogo dukkho anariyo anatthasaṁhito, sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā. Tasmā eso dhammo saraṇo.",
    "mn139:24": "Tatra, bhikkhave, yāyaṁ majjhimā paṭipadā tathāgatena abhisambuddhā, cakkhukaraṇī ñāṇakaraṇī upasamāya abhiññāya sambodhāya nibbānāya saṁvattati, adukkho eso dhammo anupaghāto anupāyāso apariḷāho; sammāpaṭipadā. Tasmā eso dhammo araṇo.",
    "mn139:25": "Tatra, bhikkhave, yāyaṁ ussādanā ca apasādanā ca no ca dhammadesanā, sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā. Tasmā eso dhammo saraṇo.",
    "mn139:26": "Tatra, bhikkhave, yamidaṁ kāmasukhaṁ mīḷhasukhaṁ pothujjanasukhaṁ anariyasukhaṁ, sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā.",
    "mn139:27": "Tatra, bhikkhave, yvāyaṁ rahovādo abhūto ataccho anatthasaṁhito, sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā. Tasmā eso dhammo saraṇo.",
    "mn139:28": "Tatra, bhikkhave, yvāyaṁ sammukhā khīṇavādo abhūto ataccho anatthasaṁhito, sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā. Tasmā eso dhammo saraṇo.",
    "mn139:29": "Tatra, bhikkhave, yamidaṁ taramānassa bhāsitaṁ, sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā.",
    "mn139:30": "Tatra, bhikkhave, yvāyaṁ janapadaniruttiyā ca abhiniveso samaññāya ca atisāro, sadukkho eso dhammo saupaghāto saupāyāso sapariḷāho; micchāpaṭipadā. Tasmā eso dhammo saraṇo.",
    "mn139:31": "Tasmātiha, bhikkhave, ‘saraṇañca dhammaṁ jānissāma, araṇañca dhammaṁ jānissāma; saraṇañca dhammaṁ ñatvā araṇañca dhammaṁ ñatvā araṇapaṭipadaṁ paṭipajjissāmā’ti evañhi vo, bhikkhave, sikkhitabbaṁ. Subhūti ca pana, bhikkhave, kulaputto araṇapaṭipadaṁ paṭipanno\"ti.",
    "mn139:32": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}