{
    "mn136:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā rājagahe viharati veḷuvane kalandakanivāpe.",
    "mn136:2": "Atha kho āyasmā samiddhi acirapakkante potaliputte paribbājake yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā samiddhi yāvatako ahosi potaliputtena paribbājakena saddhiṁ kathāsallāpo taṁ sabbaṁ āyasmato ānandassa ārocesi.",
    "mn136:3": "Evaṁ vutte, āyasmā ānando āyasmantaṁ samiddhiṁ etadavoca: \"atthi kho idaṁ, āvuso samiddhi, kathāpābhataṁ bhagavantaṁ dassanāya. Āyāmāvuso samiddhi, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā etamatthaṁ bhagavato ārocessāma. Yathā no bhagavā byākarissati tathā naṁ dhāressāmā\"ti. \"Evamāvuso\"ti kho āyasmā samiddhi āyasmato ānandassa paccassosi.",
    "mn136:4": "Atha kho āyasmā ca ānando āyasmā ca samiddhi yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinno kho āyasmā ānando yāvatako ahosi āyasmato samiddhissa potaliputtena paribbājakena saddhiṁ kathāsallāpo taṁ sabbaṁ bhagavato ārocesi.",
    "mn136:5": "Atha khobhagavā āyasmantaṁ ānandaṁ āmantesi: \"passasi no tvaṁ, ānanda, imassa udāyissa moghapurisassaummaṅgaṁ? Aññāsiṁ kho ahaṁ, ānanda: ‘idānevāyaṁ udāyī moghapuriso ummujjamāno ayoniso ummujjissatī’ti.Ādiṁyeva, ānanda, potaliputtena paribbājakena tisso vedanā pucchitā. Sacāyaṁ, ānanda, samiddhi moghapuriso potaliputtassa paribbājakassa evaṁ puṭṭho evaṁ byākareyya: ‘sañcetanikaṁ, āvuso potaliputta, kammaṁ katvā kāyena vācāya manasā sukhavedanīyaṁ sukhaṁ so vedayati; sañcetanikaṁ, āvuso potaliputta, kammaṁ katvā kāyena vācāya manasā dukkhavedanīyaṁ dukkhaṁ so vedayati; sañcetanikaṁ, āvuso potaliputta, kammaṁ katvā kāyena vācāya manasā adukkhamasukhavedanīyaṁ adukkhamasukhaṁ so vedayatī’ti. Evaṁ byākaramāno kho, ānanda, samiddhi moghapuriso potaliputtassa paribbājakassa sammābyākaramānobyākareyya. Api ca, ānanda, kecaaññatitthiyā paribbājakā bālā abyattā kecatathāgatassa mahākammavibhaṅgaṁ jānissanti? Sace tumhe, ānanda, suṇeyyātha tathāgatassa mahākammavibhaṅgaṁ vibhajantassā\"ti.",
    "mn136:6": "\"Etassa, bhagavā, kālo, etassa, sugata, kālo yaṁ bhagavā mahākammavibhaṅgaṁ vibhajeyya. Bhagavato sutvā bhikkhū dhāressantī\"ti.",
    "mn136:7": "\"Cattārome, ānanda, puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro? Idhānanda, ekacco puggalo idha pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti, abhijjhālu hoti, byāpannacitto hoti, micchādiṭṭhi hoti. So kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati.(1)",
    "mn136:8": "Idha panānanda, ekacco puggalo idha pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti, abhijjhālu hoti, byāpannacitto hoti, micchādiṭṭhi hoti. So kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati.(2)",
    "mn136:9": "Idhānanda, ekacco puggalo idha pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhi hoti. So kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati.(3)",
    "mn136:10": "Idha panānanda, ekacco puggalo idha pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhi hoti. So kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati.(4)",
    "mn136:11": "Idhānanda, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṁ cetosamādhiṁ phusati yathāsamāhite citte dibbena cakkhunā visuddhena atikkantamānusakena amuṁ puggalaṁ passati — idha pāṇātipātiṁ adinnādāyiṁ kāmesumicchācāriṁ musāvādiṁ pisuṇavācaṁ pharusavācaṁ samphappalāpiṁ abhijjhāluṁ byāpannacittaṁ micchādiṭṭhiṁ kāyassa bhedā paraṁ maraṇā passati apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannaṁ. So evamāha: ‘atthi kira, bho, pāpakāni kammāni, atthi duccaritassa vipāko.Amāhaṁpuggalaṁ addasaṁ idha pāṇātipātiṁ adinnādāyiṁ … pe … micchādiṭṭhiṁ kāyassa bhedā paraṁ maraṇā passāmi apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannan’ti. So evamāha: ‘yo kira, bho, pāṇātipātī adinnādāyī … pe … micchādiṭṭhi, sabbo so kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Ye evaṁ jānanti, te sammā jānanti; ye aññathā jānanti,micchā tesaṁ ñāṇan’ti. Iti so yadeva tassa sāmaṁ ñātaṁ sāmaṁ diṭṭhaṁ sāmaṁ viditaṁ tadeva tattha thāmasāparāmāsāabhinivissa voharati: ‘idameva saccaṁ, moghamaññan’ti.(1)",
    "mn136:12": "Idha panānanda, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṁ cetosamādhiṁ phusati yathāsamāhite citte dibbena cakkhunā visuddhena atikkantamānusakena amuṁ puggalaṁ passati — idha pāṇātipātiṁ adinnādāyiṁ … pe … micchādiṭṭhiṁ, kāyassa bhedā paraṁ maraṇā passati sugatiṁ saggaṁ lokaṁ upapannaṁ. So evamāha: ‘Natthi kira, bho, pāpakāni kammāni, natthi duccaritassa vipāko. Amāhaṁ puggalaṁ addasaṁ — idha pāṇātipātiṁ adinnādāyiṁ … pe … micchādiṭṭhiṁ, kāyassa bhedā paraṁ maraṇā passāmi sugatiṁ saggaṁ lokaṁ upapannan’ti. So evamāha: ‘yo kira, bho, pāṇātipātī adinnādāyī … pe … micchādiṭṭhi, sabbo so kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati. Ye evaṁ jānanti te sammā jānanti; ye aññathā jānanti, micchā tesaṁ ñāṇan’ti. Iti so yadeva tassa sāmaṁ ñātaṁ sāmaṁ diṭṭhaṁ sāmaṁ viditaṁ tadeva tattha thāmasā parāmāsā abhinivissa voharati: ‘idameva saccaṁ, moghamaññan’ti.(2)",
    "mn136:13": "Idhānanda, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṁ cetosamādhiṁ phusati yathāsamāhite citte dibbena cakkhunā visuddhena atikkantamānusakena amuṁ puggalaṁ passati — idha pāṇātipātā paṭivirataṁ adinnādānā paṭivirataṁ kāmesumicchācārā paṭivirataṁ musāvādā paṭivirataṁ pisuṇāya vācāya paṭivirataṁ pharusāya vācāya paṭivirataṁ samphappalāpā paṭivirataṁ anabhijjhāluṁ abyāpannacittaṁ sammādiṭṭhiṁ, kāyassa bhedā paraṁ maraṇā passati sugatiṁ saggaṁ lokaṁ upapannaṁ. So evamāha: ‘atthi kira, bho, kalyāṇāni kammāni, atthi sucaritassa vipāko. Amāhaṁ puggalaṁ addasaṁ — idha pāṇātipātā paṭivirataṁ adinnādānā paṭivirataṁ … pe … sammādiṭṭhiṁ, kāyassa bhedā paraṁ maraṇā passāmi sugatiṁ saggaṁ lokaṁ upapannan’ti. So evamāha: ‘yo kira, bho, pāṇātipātā paṭivirato adinnādānā paṭivirato … pe … sammādiṭṭhi sabbo so kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati. Ye evaṁ jānanti te sammā jānanti; ye aññathā jānanti, micchā tesaṁ ñāṇan’ti. Iti so yadeva tassa sāmaṁ ñātaṁ sāmaṁ diṭṭhaṁ sāmaṁ viditaṁ tadeva tattha thāmasā parāmāsā abhinivissa voharati: ‘idameva saccaṁ, moghamaññan’ti.(3)",
    "mn136:14": "Idha panānanda, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṁ cetosamādhiṁ phusati yathāsamāhite citte dibbena cakkhunā visuddhena atikkantamānusakena amuṁ puggalaṁ passati — idha pāṇātipātā paṭivirataṁ … pe … sammādiṭṭhiṁ, kāyassa bhedā paraṁ maraṇā passati apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannaṁ. So evamāha: ‘Natthi kira, bho, kalyāṇāni kammāni, natthi sucaritassa vipāko. Amāhaṁ puggalaṁ addasaṁ — idha pāṇātipātā paṭivirataṁ adinnādānā paṭivirataṁ … pe … sammādiṭṭhiṁ, kāyassa bhedā paraṁ maraṇā passāmi apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannan’ti. So evamāha: ‘yo kira, bho, pāṇātipātā paṭivirato adinnādānā paṭivirato … pe … sammādiṭṭhi, sabbo so kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Ye evaṁ jānanti te sammā jānanti; ye aññathā jānanti, micchā tesaṁ ñāṇan’ti. Iti so yadeva tassa sāmaṁ ñātaṁ sāmaṁ diṭṭhaṁ sāmaṁ viditaṁ tadeva tattha thāmasā parāmāsā abhinivissa voharati: ‘idameva saccaṁ, moghamaññan’ti.(4)",
    "mn136:15": "Tatrānanda, yvāyaṁ samaṇo vā brāhmaṇo vā evamāha: ‘atthi kira, bho, pāpakāni kammāni, atthi duccaritassa vipāko’ti idamassa anujānāmi; yampi so evamāha: ‘amāhaṁ puggalaṁ addasaṁ — idha pāṇātipātiṁ adinnādāyiṁ … pe … micchādiṭṭhiṁ, kāyassa bhedā paraṁ maraṇā passāmi apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannan’ti idampissa anujānāmi; yañca kho so evamāha: ‘yo kira, bho, pāṇātipātī adinnādāyī … pe … micchādiṭṭhi, sabbo so kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjatī’ti idamassa nānujānāmi; yampi so evamāha: ‘ye evaṁ jānanti te sammā jānanti; ye aññathā jānanti, micchā tesaṁ ñāṇan’ti idampissa nānujānāmi; yampi so yadeva tassa sāmaṁ ñātaṁ sāmaṁ diṭṭhaṁ sāmaṁ viditaṁ tadeva tattha thāmasā parāmāsā abhinivissa voharati: ‘idameva saccaṁ, moghamaññan’ti idampissa nānujānāmi. Taṁ kissa hetu? Aññathā hi, ānanda, tathāgatassa mahākammavibhaṅge ñāṇaṁ hoti.(1)",
    "mn136:16": "Tatrānanda, yvāyaṁ samaṇo vā brāhmaṇo vā evamāha: ‘Natthi kira, bho, pāpakāni kammāni, natthi duccaritassa vipāko’ti idamassa nānujānāmi; yañca kho so evamāha: ‘amāhaṁ puggalaṁ addasaṁ — idha pāṇātipātiṁ adinnādāyiṁ … pe … micchādiṭṭhiṁ kāyassa bhedā paraṁ maraṇā passāmi sugatiṁ saggaṁ lokaṁ upapannan’ti idamassa anujānāmi; yañca kho so evamāha: ‘yo kira, bho, pāṇātipātī adinnādāyī … pe … micchādiṭṭhi, sabbo so kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjatī’ti idamassa nānujānāmi; yampi so evamāha: ‘ye evaṁ jānanti te sammā jānanti; ye aññathā jānanti, micchā tesaṁ ñāṇan’ti idampissa nānujānāmi; yampi so yadeva tassa sāmaṁ ñātaṁ sāmaṁ diṭṭhaṁ sāmaṁ viditaṁ tadeva tattha thāmasā parāmāsā abhinivissa voharati: ‘idameva saccaṁ, moghamaññan’ti idampissa nānujānāmi. Taṁ kissa hetu? Aññathā hi, ānanda, tathāgatassa mahākammavibhaṅge ñāṇaṁ hoti.(2)",
    "mn136:17": "Tatrānanda, yvāyaṁ samaṇo vā brāhmaṇo vā evamāha: ‘atthi kira, bho, kalyāṇāni kammāni, atthi sucaritassa vipāko’ti idamassa anujānāmi; yampi so evamāha: ‘amāhaṁ puggalaṁ addasaṁ — idha pāṇātipātā paṭivirataṁ adinnādānā paṭivirataṁ … pe … sammādiṭṭhiṁ, kāyassa bhedā paraṁ maraṇā passāmi sugatiṁ saggaṁ lokaṁ upapannan’ti idampissa anujānāmi; yañca kho so evamāha: ‘yo kira, bho, pāṇātipātā paṭivirato adinnādānā paṭivirato … pe … sammādiṭṭhi, sabbo so kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjatī’ti idamassa nānujānāmi; yampi so evamāha: ‘ye evaṁ jānanti te sammā jānanti; ye aññathā jānanti, micchā tesaṁ ñāṇan’ti idampissa nānujānāmi; yampi so yadeva tassa sāmaṁ ñātaṁ sāmaṁ diṭṭhaṁ sāmaṁ viditaṁ tadeva tattha thāmasā parāmāsā abhinivissa voharati: ‘idameva saccaṁ, moghamaññan’ti idampissa nānujānāmi. Taṁ kissa hetu? Aññathā hi, ānanda, tathāgatassa mahākammavibhaṅge ñāṇaṁ hoti.(3)",
    "mn136:18": "Tatrānanda, yvāyaṁ samaṇo vā brāhmaṇo vā evamāha: ‘Natthi kira, bho, kalyāṇāni kammāni, natthi sucaritassa vipāko’ti idamassa nānujānāmi; yañca kho so evamāha: ‘amāhaṁ puggalaṁ addasaṁ — idha pāṇātipātā paṭivirataṁ adinnādānā paṭivirataṁ … pe … sammādiṭṭhiṁ, kāyassa bhedā paraṁ maraṇā passāmi apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannan’ti idamassa anujānāmi; yañca kho so evamāha: ‘yo kira, bho, pāṇātipātā paṭivirato adinnādānā paṭivirato … pe … sammādiṭṭhi, sabbo so kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjatī’ti idamassa nānujānāmi; yañca kho so evamāha: ‘ye evaṁ jānanti te sammā jānanti; ye aññathā jānanti, micchā tesaṁ ñāṇan’ti idampissa nānujānāmi; yampi so yadeva tassa sāmaṁ ñātaṁ sāmaṁ diṭṭhaṁ sāmaṁ viditaṁ tadeva tattha thāmasā parāmāsā abhinivissa voharati: ‘idameva saccaṁ, moghamaññan’ti idampissa nānujānāmi. Taṁ kissa hetu? Aññathā hi, ānanda, tathāgatassa mahākammavibhaṅge ñāṇaṁ hoti.(4)",
    "mn136:19": "Tatrānanda, yvāyaṁ puggalo idha pāṇātipātī adinnādāyī … pe … micchādiṭṭhi, kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, pubbe vāssa taṁ kataṁ hoti pāpakammaṁ dukkhavedanīyaṁ, pacchā vāssa taṁ kataṁ hoti pāpakammaṁ dukkhavedanīyaṁ, maraṇakāle vāssa hoti micchādiṭṭhi samattā samādinnā. Tena so kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Yañca kho so idha pāṇātipātī hoti adinnādāyī hoti … pe … micchādiṭṭhi hoti tassa diṭṭheva dhamme vipākaṁ paṭisaṁvedetiupapajja vāapare vā pariyāye.(1)",
    "mn136:20": "Tatrānanda, yvāyaṁ puggalo idha pāṇātipātī adinnādāyī … pe … micchādiṭṭhi kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati, pubbe vāssa taṁ kataṁ hoti kalyāṇakammaṁ sukhavedanīyaṁ, pacchā vāssa taṁ kataṁ hoti kalyāṇakammaṁ sukhavedanīyaṁ, maraṇakāle vāssa hoti sammādiṭṭhi samattā samādinnā. Tena so kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati. Yañca kho so idha pāṇātipātī hoti adinnādāyī hoti … pe … micchādiṭṭhi hoti tassa diṭṭheva dhamme vipākaṁ paṭisaṁvedeti upapajja vā apare vā pariyāye.(2)",
    "mn136:21": "Tatrānanda, yvāyaṁ puggalo idha pāṇātipātā paṭivirato adinnādānā paṭivirato … pe … sammādiṭṭhi, kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati, pubbe vāssa taṁ kataṁ hoti kalyāṇakammaṁ sukhavedanīyaṁ, pacchā vāssa taṁ kataṁ hoti kalyāṇakammaṁ sukhavedanīyaṁ, maraṇakāle vāssa hoti sammādiṭṭhi samattā samādinnā. Tena so kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati. Yañca kho so idha pāṇātipātā paṭivirato hoti adinnādānā paṭivirato hoti … pe … sammādiṭṭhi hoti, tassa diṭṭheva dhamme vipākaṁ paṭisaṁvedeti upapajja vā apare vā pariyāye.(3)",
    "mn136:22": "Tatrānanda, yvāyaṁ puggalo idha pāṇātipātā paṭivirato adinnādānā paṭivirato … pe … sammādiṭṭhi, kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, pubbe vāssa taṁ kataṁ hoti pāpakammaṁ dukkhavedanīyaṁ, pacchā vāssa taṁ kataṁ hoti pāpakammaṁ dukkhavedanīyaṁ, maraṇakāle vāssa hoti micchādiṭṭhi samattā samādinnā. Tena so kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Yañca kho so idha pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti … pe … sammādiṭṭhi hoti, tassa diṭṭheva dhamme vipākaṁ paṭisaṁvedeti upapajja vā apare vā pariyāye.(4)",
    "mn136:23": "Iti kho, ānanda, atthi kammaṁ abhabbaṁ abhabbābhāsaṁ, atthi kammaṁ abhabbaṁ bhabbābhāsaṁ, atthi kammaṁ bhabbañceva bhabbābhāsañca, atthi kammaṁ bhabbaṁ abhabbābhāsan\"ti.",
    "mn136:24": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}