{
    "mn137:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn137:2": "\"‘Cha ajjhattikāni āyatanāni veditabbāni, cha bāhirāni āyatanāni veditabbāni, cha viññāṇakāyā veditabbā, cha phassakāyā veditabbā, aṭṭhārasa manopavicārā veditabbā, chattiṁsa sattapadā veditabbā, tatra idaṁ nissāya idaṁ pajahatha, tayo satipaṭṭhānā yadariyo sevati yadariyo sevamāno satthā gaṇamanusāsitumarahati, so vuccatiyoggācariyānaṁanuttaro purisadammasārathī’ti — ayamuddeso saḷāyatanavibhaṅgassa.",
    "mn137:3": "‘Cha ajjhattikāni āyatanāni veditabbānī’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? ‘Cakkhāyatanaṁ sotāyatanaṁ ghānāyatanaṁ jivhāyatanaṁ kāyāyatanaṁ manāyatanaṁ — cha ajjhattikāni āyatanāni veditabbānī’ti — iti yaṁ taṁ vuttaṁ idametaṁ paṭicca vuttaṁ.(1)",
    "mn137:4": "‘Cha bāhirāni āyatanāni veditabbānī’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? ‘Rūpāyatanaṁ saddāyatanaṁ gandhāyatanaṁ rasāyatanaṁ phoṭṭhabbāyatanaṁ dhammāyatanaṁ — cha bāhirāni āyatanāni veditabbānī’ti — iti yaṁ taṁ vuttaṁ idametaṁ paṭicca vuttaṁ.(2)",
    "mn137:5": "‘Cha viññāṇakāyā veditabbā’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? ‘Cakkhuviññāṇaṁ sotaviññāṇaṁ ghānaviññāṇaṁ jivhāviññāṇaṁ kāyaviññāṇaṁ manoviññāṇaṁ — cha viññāṇakāyā veditabbā’ti — iti yaṁ taṁ vuttaṁ idametaṁ paṭicca vuttaṁ.(3)",
    "mn137:6": "‘Cha phassakāyā veditabbā’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? ‘Cakkhusamphasso sotasamphasso ghānasamphasso jivhāsamphasso kāyasamphasso manosamphasso — cha phassakāyā veditabbā’ti — iti yaṁ taṁ vuttaṁ idametaṁ paṭicca vuttaṁ.(4)",
    "mn137:7": "‘Aṭṭhārasa manopavicārā veditabbā’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ?",
    "mn137:8": "‘Chattiṁsa sattapadā veditabbā’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? Chagehasitānisomanassāni, chanekkhammasitānisomanassāni, cha gehasitāni domanassāni, cha nekkhammasitāni domanassāni, cha gehasitā upekkhā, cha nekkhammasitā upekkhā.",
    "mn137:9": "Tattha katamāni cha nekkhammasitāni somanassāni? Rūpānaṁ tveva aniccataṁ viditvāvipariṇāmavirāganirodhaṁ, ‘pubbe ceva rūpā etarahi ca sabbe te rūpā aniccā dukkhā vipariṇāmadhammā’ti evametaṁ yathābhūtaṁ sammappaññāya passato uppajjati somanassaṁ. Yaṁ evarūpaṁ somanassaṁ idaṁ vuccati nekkhammasitaṁ somanassaṁ.",
    "mn137:10": "Tattha katamāni cha gehasitāni domanassāni? Cakkhuviññeyyānaṁ rūpānaṁ … pe …",
    "mn137:11": "\"Tattha katamāni cha nekkhammasitāni domanassāni? Rūpānaṁ tveva aniccataṁ viditvā vipariṇāmavirāganirodhaṁ, ‘pubbe ceva rūpā etarahi ca sabbe te rūpā aniccā dukkhā vipariṇāmadhammā’ti evametaṁ yathābhūtaṁ sammappaññāya disvā anuttaresu vimokkhesu pihaṁ upaṭṭhāpeti: ‘kudāssunāmāhaṁ tadāyatanaṁ upasampajja viharissāmi yadariyā etarahi āyatanaṁ upasampajja viharantī’ti iti anuttaresu vimokkhesu pihaṁ upaṭṭhāpayato uppajjati pihapaccayā domanassaṁ. Yaṁ evarūpaṁ domanassaṁ idaṁ vuccati nekkhammasitaṁ domanassaṁ.",
    "mn137:12": "Tattha katamā cha gehasitā upekkhā? Cakkhunā rūpaṁ disvā uppajjati upekkhābālassa mūḷhassaputhujjanassa anodhijinassa avipākajinassa anādīnavadassāvino assutavato puthujjanassa. Yā evarūpā upekkhā, rūpaṁ sā nātivattati. Tasmāsāupekkhā ‘gehasitā’ti vuccati.",
    "mn137:13": "Tattha katamā cha nekkhammasitā upekkhā? Rūpānaṁ tveva aniccataṁ viditvā vipariṇāmavirāganirodhaṁ, ‘pubbe ceva rūpā etarahi ca sabbe te rūpā aniccā dukkhā vipariṇāmadhammā’ti evametaṁ yathābhūtaṁ sammappaññāya passato uppajjati upekkhā. Yā evarūpā upekkhā, rūpaṁ sā ativattati. Tasmā sā upekkhā ‘nekkhammasitā’ti vuccati.",
    "mn137:14": "‘Tatra idaṁ nissāya idaṁ pajahathā’ti — iti kho panetaṁ vuttaṁ; kiñcetaṁ paṭicca vuttaṁ?",
    "mn137:15": "Tatra, bhikkhave, yāni cha nekkhammasitāni domanassāni tāni nissāya tāni āgamma yāni cha gehasitāni domanassāni tāni pajahatha, tāni samatikkamatha. Evametesaṁ pahānaṁ hoti, evametesaṁ samatikkamo hoti.",
    "mn137:16": "Tatra, bhikkhave, yā cha nekkhammasitā upekkhā tā nissāya tā āgamma, yā cha gehasitā upekkhā tā pajahatha tā samatikkamatha. Evametāsaṁ pahānaṁ hoti, evametāsaṁ samatikkamo hoti.",
    "mn137:17": "Tatra, bhikkhave, yāni cha nekkhammasitāni somanassāni tāni nissāya tāni āgamma yāni cha nekkhammasitāni domanassāni tāni pajahatha, tāni samatikkamatha. Evametesaṁ pahānaṁ hoti, evametesaṁ samatikkamo hoti.",
    "mn137:18": "Tatra, bhikkhave, yā cha nekkhammasitā upekkhā tā nissāya tā āgamma yāni cha nekkhammasitāni somanassāni tāni pajahatha, tāni samatikkamatha. Evametesaṁ pahānaṁ hoti, evametesaṁ samatikkamo hoti.",
    "mn137:19": "Atthi, bhikkhave, upekkhā nānattā nānattasitā, atthi upekkhā ekattā ekattasitā.",
    "mn137:20": "Tatra, bhikkhave, yāyaṁ upekkhā ekattā ekattasitā taṁ nissāya taṁ āgamma yāyaṁ upekkhā nānattā nānattasitā taṁ pajahatha, taṁ samatikkamatha. Evametissā pahānaṁ hoti, evametissā samatikkamo hoti.",
    "mn137:21": "Atammayataṁ, bhikkhave, nissāya atammayataṁ āgamma yāyaṁ upekkhā ekattā ekattasitā taṁ pajahatha, taṁ samatikkamatha. Evametissā pahānaṁ hoti, evametissā samatikkamo hoti.",
    "mn137:22": "‘Tayo satipaṭṭhānā yadariyo sevati, yadariyo sevamāno satthā gaṇamanusāsitumarahatī’ti — iti kho panetaṁ vuttaṁ; kiñcetaṁ paṭicca vuttaṁ?",
    "mn137:23": "Puna caparaṁ, bhikkhave, satthā sāvakānaṁ dhammaṁ deseti anukampako hitesī anukampaṁ upādāya: ‘idaṁ vo hitāya, idaṁ vo sukhāyā’ti. Tassa ekacce sāvakā na sussūsanti, na sotaṁ odahanti, na aññā cittaṁ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti; ekacce sāvakā sussūsanti, sotaṁ odahanti, aññā cittaṁ upaṭṭhapenti, na ca vokkamma satthusāsanā vattanti. Tatra, bhikkhave, tathāgato na ceva anattamano hoti, na ca anattamanataṁ paṭisaṁvedeti; na ca attamano hoti, na ca attamanataṁ paṭisaṁvedeti. Anattamanatā ca attamanatā ca –  tadubhayaṁ abhinivajjetvā upekkhako viharati sato sampajāno. Idaṁ vuccati, bhikkhave, dutiyaṁ satipaṭṭhānaṁ yadariyo sevati, yadariyo sevamāno satthā gaṇamanusāsitumarahati.",
    "mn137:24": "Puna caparaṁ, bhikkhave, satthā sāvakānaṁ dhammaṁ deseti anukampako hitesī anukampaṁ upādāya: ‘idaṁ vo hitāya, idaṁ vo sukhāyā’ti. Tassa sāvakā sussūsanti, sotaṁ odahanti, aññācittaṁ upaṭṭhapenti, na ca vokkamma satthusāsanā vattanti. Tatra, bhikkhave, tathāgato attamano ceva hoti, attamanatañca paṭisaṁvedeti, anavassuto ca viharati sato sampajāno. Idaṁ vuccati, bhikkhave, tatiyaṁ satipaṭṭhānaṁ yadariyo sevati, yadariyo sevamāno satthā gaṇamanusāsitumarahati.",
    "mn137:25": "‘So vuccati yoggācariyānaṁ anuttaro purisadammasārathī’ti — iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ?",
    "mn137:26": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}