{
    "mn133:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā rājagahe viharati tapodārāme. Atha kho āyasmā samiddhi rattiyā paccūsasamayaṁ paccuṭṭhāya yenatapodotenupasaṅkami gattāni parisiñcituṁ. Tapode gattāni parisiñcitvā paccuttaritvā ekacīvaro aṭṭhāsi gattānipubbāpayamāno. Atha kho aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṁ tapodaṁ obhāsetvā yenāyasmā samiddhi tenupasaṅkami; upasaṅkamitvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitā kho sā devatā āyasmantaṁ samiddhiṁ etadavoca:",
    "mn133:2": "Atha kho āyasmā samiddhi tassā rattiyā accayena yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā samiddhi bhagavantaṁ etadavoca:",
    "mn133:3": "\"Idhāhaṁ, bhante, rattiyā paccūsasamayaṁ paccuṭṭhāya yena tapodo tenupasaṅkamiṁ gattāni parisiñcituṁ. Tapode gattāni parisiñcitvā paccuttaritvā ekacīvaro aṭṭhāsiṁ gattāni pubbāpayamāno. Atha kho bhante, aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṁ tapodaṁ obhāsetvā yenāhaṁ tenupasaṅkami; upasaṅkamitvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitā kho sā devatā maṁ etadavoca: ‘dhāresi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañcā’ti?",
    "mn133:4": "Evaṁ vutte, ahaṁ, bhante, taṁ devataṁ etadavocaṁ: ‘Na kho ahaṁ, āvuso, dhāremi bhaddekarattassa uddesañca vibhaṅgañca. Tvaṁ panāvuso, dhāresi bhaddekarattassa uddesañca vibhaṅgañcā’ti? ‘Ahampi kho, bhikkhu, na dhāremi bhaddekarattassa uddesañca vibhaṅgañca. Dhāresi pana tvaṁ, bhikkhu, bhaddekarattiyo gāthā’ti? ‘Na kho ahaṁ, āvuso, dhāremi bhaddekarattiyo gāthāti. Tvaṁ panāvuso, dhāresi bhaddekarattiyo gāthā’ti? ‘Ahampi kho, bhikkhu, na dhāremi bhaddekarattiyo gāthāti. Uggaṇhāhi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañca; pariyāpuṇāhi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañca; dhārehi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañca. Atthasaṁhito, bhikkhu, bhaddekarattassa uddeso ca vibhaṅgo ca ādibrahmacariyako’ti. Idamavoca, bhante, sā devatā. Idaṁ vatvā tatthevantaradhāyi. Sādhu me, bhante, bhagavā bhaddekarattassa uddesañca vibhaṅgañca desetū\"ti. \"Tena hi, bhikkhu, suṇāhi, sādhukaṁ manasi karohi; bhāsissāmī\"ti. \"Evaṁ, bhante\"ti kho āyasmā samiddhi bhagavato paccassosi. Bhagavā etadavoca:",
    "mn133:5": "\"Atītaṁ nānvāgameyya,nappaṭikaṅkhe anāgataṁ;Yadatītaṁ pahīnaṁ taṁ,appattañca anāgataṁ.",
    "mn133:6": "Paccuppannañca yo dhammaṁ,tattha tattha vipassati;Asaṁhīraṁ asaṅkuppaṁ,taṁ vidvā manubrūhaye.",
    "mn133:7": "Ajjeva kiccamātappaṁ,ko jaññā maraṇaṁ suve;Na hi no saṅgaraṁ tena,mahāsenena maccunā.",
    "mn133:8": "Evaṁvihāriṁ ātāpiṁ,ahorattamatanditaṁ;Taṁ ve bhaddekarattoti,santo ācikkhate munī\"ti.",
    "mn133:9": "Idamavoca bhagavā; idaṁ vatvāna sugato uṭṭhāyāsanā vihāraṁ pāvisi.",
    "mn133:10": "‘Atītaṁ nānvāgameyya,nappaṭikaṅkhe anāgataṁ;Yadatītaṁ pahīnaṁ taṁ,appattañca anāgataṁ.",
    "mn133:11": "Paccuppannañca yo dhammaṁ,tattha tattha vipassati;Asaṁhīraṁ asaṅkuppaṁ,taṁ vidvā manubrūhaye.",
    "mn133:12": "Ajjeva kiccamātappaṁ,ko jaññā maraṇaṁ suve;Na hi no saṅgaraṁ tena,mahāsenena maccunā.",
    "mn133:13": "Evaṁvihāriṁ ātāpiṁ,ahorattamatanditaṁ;Taṁ ve bhaddekarattoti,santo ācikkhate munī’ti.",
    "mn133:14": "Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā\"ti?",
    "mn133:15": "Atha kho tesaṁ bhikkhūnaṁ etadahosi: \"Ayaṁ kho āyasmā mahākaccāno satthu ceva saṁvaṇṇito sambhāvito ca viññūnaṁ sabrahmacārīnaṁ; pahoti cāyasmā mahākaccāno imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā mahākaccāno tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ etamatthaṁ paṭipuccheyyāmā\"ti.",
    "mn133:16": "Atha kho te bhikkhū yenāyasmā mahākaccāno tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā mahākaccānena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū āyasmantaṁ mahākaccānaṁ etadavocuṁ: \"Idaṁ kho no, āvuso kaccāna, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho:",
    "mn133:17": "‘Atītaṁ nānvāgameyya,… pe …Taṁ ve bhaddekarattoti,santo ācikkhate munī’ti.",
    "mn133:18": "Tesaṁ no, āvuso kaccāna, amhākaṁ, acirapakkantassa bhagavato, etadahosi — idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho:",
    "mn133:19": "‘Atītaṁ nānvāgameyya,… pe …Taṁ ve bhaddekarattoti,santo ācikkhate munī’ti.",
    "mn133:20": "Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyāti? Tesaṁ no, āvuso kaccāna, amhākaṁ etadahosi: ‘Ayaṁ kho āyasmā mahākaccāno satthu ceva saṁvaṇṇito sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā mahākaccāno imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā mahākaccāno tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ etamatthaṁ paṭipuccheyyāmā’ti. Vibhajatāyasmā mahākaccāno\"ti.",
    "mn133:21": "\"Seyyathāpi, āvuso, puriso sāratthiko sāragavesī sārapariyesanaṁ caramāno mahato rukkhassa tiṭṭhato sāravato atikkammeva mūlaṁ atikkamma khandhaṁ sākhāpalāse sāraṁ pariyesitabbaṁ maññeyya; evaṁsampadamidaṁ āyasmantānaṁ satthari sammukhībhūte taṁ bhagavantaṁ atisitvā amhe etamatthaṁ paṭipucchitabbaṁ maññatha. So hāvuso, bhagavā jānaṁ jānāti, passaṁ passati, cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. So ceva panetassa kālo ahosi yaṁ bhagavantaṁyeva etamatthaṁ paṭipuccheyyātha, yathā vo bhagavā byākareyya tathā naṁ dhāreyyāthā\"ti.",
    "mn133:22": "\"Addhāvuso kaccāna, bhagavā jānaṁ jānāti, passaṁ passati, cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. So ceva panetassa kālo ahosi yaṁ bhagavantaṁyeva etamatthaṁ paṭipuccheyyāma; yathā no bhagavā byākareyya tathā naṁ dhāreyyāma. Api cāyasmā mahākaccāno satthu ceva saṁvaṇṇito sambhāvito ca viññūnaṁ sabrahmacārīnaṁ; pahoti cāyasmā mahākaccāno imassa bhagavatā saṁkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Vibhajatāyasmā mahākaccānoagaruṁ karitvā\"ti.",
    "mn133:23": "\"Tena hāvuso, suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti. \"Evamāvuso\"ti kho te bhikkhū āyasmato mahākaccānassa paccassosuṁ. Āyasmā mahākaccāno etadavoca:",
    "mn133:24": "\"Yaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho:",
    "mn133:25": "‘Atītaṁ nānvāgameyya,… pe …Taṁ ve bhaddekarattoti,santo ācikkhate munī’ti.",
    "mn133:26": "Imassa kho ahaṁ, āvuso, bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa evaṁ vitthārena atthaṁ ājānāmi –",
    "mn133:27": "Kathañca, āvuso, atītaṁ anvāgameti? Iti me cakkhu ahosi atītamaddhānaṁ iti rūpāti — tatthachandarāgappaṭibaddhaṁhoti viññāṇaṁ, chandarāgappaṭibaddhattā viññāṇassa tadabhinandati, tadabhinandanto atītaṁ anvāgameti.",
    "mn133:28": "Kathañca, āvuso, atītaṁ nānvāgameti? Iti me cakkhu ahosi atītamaddhānaṁ iti rūpāti — tattha na chandarāgappaṭibaddhaṁ hoti viññāṇaṁ, na chandarāgappaṭibaddhattā viññāṇassa na tadabhinandati, na tadabhinandanto atītaṁ nānvāgameti.",
    "mn133:29": "Kathañca, āvuso, anāgataṁ paṭikaṅkhati? Iti me cakkhu siyā anāgatamaddhānaṁ iti rūpāti — appaṭiladdhassa paṭilābhāya cittaṁ paṇidahati, cetaso paṇidhānapaccayā tadabhinandati, tadabhinandanto anāgataṁ paṭikaṅkhati.",
    "mn133:30": "Kathañca, āvuso, anāgataṁ nappaṭikaṅkhati? Iti me cakkhu siyā anāgatamaddhānaṁ iti rūpāti — appaṭiladdhassa paṭilābhāya cittaṁ nappaṇidahati, cetaso appaṇidhānapaccayā na tadabhinandati, na tadabhinandanto anāgataṁ nappaṭikaṅkhati.",
    "mn133:31": "Kathañca, āvuso, paccuppannesu dhammesu saṁhīrati? Yañcāvuso, cakkhu ye ca rūpā — ubhayametaṁ paccuppannaṁ. Tasmiñce paccuppanne chandarāgappaṭibaddhaṁ hoti viññāṇaṁ, chandarāgappaṭibaddhattā viññāṇassa tadabhinandati, tadabhinandanto paccuppannesu dhammesu saṁhīrati.[[%ask:ParaNo:]]",
    "mn133:[[%ask:ParaNo:]]": "31Kathañca, āvuso, paccuppannesu dhammesu saṁhīrati? Yañcāvuso, cakkhu ye ca rūpā — ubhayametaṁ paccuppannaṁ. Tasmiñce paccuppanne chandarāgappaṭibaddhaṁ hoti viññāṇaṁ, chandarāgappaṭibaddhattā viññāṇassa tadabhinandati, tadabhinandanto paccuppannesu dhammesu saṁhīrati.",
    "mn133:32": "Kathañca, āvuso, paccuppannesu dhammesu na saṁhīrati? Yañcāvuso, cakkhu ye ca rūpā — ubhayametaṁ paccuppannaṁ. Tasmiñce paccuppanne na chandarāgappaṭibaddhaṁ hoti viññāṇaṁ, na chandarāgappaṭibaddhattā viññāṇassa na tadabhinandati, na tadabhinandanto paccuppannesu dhammesu na saṁhīrati.",
    "mn133:33": "Yaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho:",
    "mn133:34": "‘Atītaṁ nānvāgameyya,… pe …Taṁ ve bhaddekarattoti,santo ācikkhate munī’ti.",
    "mn133:35": "Imassa kho ahaṁ, āvuso, bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa evaṁ vitthārena atthaṁ ājānāmi. Ākaṅkhamānā ca pana tumhe āyasmanto bhagavantaṁyeva upasaṅkamitvā etamatthaṁ paṭipuccheyyātha, yathā vo bhagavā byākaroti tathā naṁ dhāreyyāthā\"ti.",
    "mn133:36": "Atha kho te bhikkhū āyasmato mahākaccānassa bhāsitaṁ abhinanditvā anumoditvā uṭṭhāyāsanā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ: \"yaṁ kho no, bhante, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho:",
    "mn133:37": "‘Atītaṁ nānvāgameyya,… pe …Taṁ ve bhaddekarattoti,santo ācikkhate munī’ti.",
    "mn133:38": "Tesaṁ no, bhante, amhākaṁ, acirapakkantassa bhagavato, etadahosi: ‘idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho:",
    "mn133:39": "\"Atītaṁ nānvāgameyya,nappaṭikaṅkhe anāgataṁ;Yadatītaṁ pahīnaṁ taṁ,appattañca anāgataṁ.",
    "mn133:40": "Paccuppannañca yo dhammaṁ,tattha tattha vipassati;Asaṁhīraṁ asaṅkuppaṁ,taṁ vidvā manubrūhaye.",
    "mn133:41": "Ajjeva kiccamātappaṁ,ko jaññā maraṇaṁ suve;Na hi no saṅgaraṁ tena,mahāsenena maccunā.",
    "mn133:42": "Evaṁvihāriṁ ātāpiṁ,ahorattamatanditaṁ;Taṁ ve bhaddekarattoti,santo ācikkhate munī\"ti.",
    "mn133:43": "Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā’ti? Tesaṁ no, bhante, amhākaṁ etadahosi: ‘Ayaṁ kho āyasmā mahākaccāno satthu ceva saṁvaṇṇito sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā mahākaccāno imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā mahākaccāno tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ etamatthaṁ paṭipuccheyyāmā’ti. Atha kho mayaṁ, bhante, yenāyasmā mahākaccāno tenupasaṅkamimha; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ etamatthaṁ paṭipucchimha. Tesaṁ no, bhante, āyasmatā mahākaccānena imehi ākārehi imehi padehi imehi byañjanehi attho vibhatto\"ti.",
    "mn133:44": "\"Paṇḍito, bhikkhave, mahākaccāno; mahāpañño, bhikkhave mahākaccāno. Mañcepi tumhe, bhikkhave, etamatthaṁ paṭipuccheyyātha, ahampi taṁ evamevaṁ byākareyyaṁ yathā taṁ mahākaccānena byākataṁ. Eso cevetassa attho. Evañca naṁ dhārethā\"ti.",
    "mn133:45": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}