{
    "mn134:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmālomasakaṅgiyosakkesu viharati kapilavatthusmiṁ nigrodhārāme.",
    "mn134:2": "‘Atītaṁ nānvāgameyya,nappaṭikaṅkhe anāgataṁ;Yadatītaṁ pahīnaṁ taṁ,appattañca anāgataṁ.",
    "mn134:3": "Paccuppannañca yo dhammaṁ,tattha tattha vipassati;Asaṁhīraṁ asaṅkuppaṁ,taṁ vidvā manubrūhaye.",
    "mn134:4": "Ajjeva kiccamātappaṁ,ko jaññā maraṇaṁ suve;Na hi no saṅgaraṁ tena,mahāsenena maccunā.",
    "mn134:5": "Evaṁvihāriṁ ātāpiṁ,ahorattamatanditaṁ;Taṁ ve bhaddekarattoti,santo ācikkhate munī’ti.",
    "mn134:6": "Evaṁ kho ahaṁ, bhikkhu, dhāremi bhaddekarattiyo gāthā. Uggaṇhāhi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañca; pariyāpuṇāhi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañca; dhārehi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañca. Atthasaṁhito, bhikkhu, bhaddekarattassa uddeso ca vibhaṅgo ca ādibrahmacariyako\"ti.",
    "mn134:7": "Atha kho āyasmā lomasakaṅgiyo tassā rattiyā accayena senāsanaṁ saṁsāmetvā pattacīvaramādāya yena sāvatthi tena cārikaṁ pakkāmi. Anupubbena cārikaṁ caramāno yena sāvatthi jetavanaṁ anāthapiṇḍikassa ārāmo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā lomasakaṅgiyo bhagavantaṁ etadavoca:",
    "mn134:8": "\"Ekamidāhaṁ, bhante, samayaṁ sakkesu viharāmi kapilavatthusmiṁ nigrodhārāme. Atha kho, bhante, aññataro devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṁ nigrodhārāmaṁ obhāsetvā yenāhaṁ tenupasaṅkami; upasaṅkamitvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho, bhante, so devaputto maṁ etadavoca: ‘dhāresi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañcā’ti? Evaṁ vutte, ahaṁ, bhante, taṁ devaputtaṁ etadavocaṁ: ‘Na kho ahaṁ, āvuso, dhāremi bhaddekarattassa uddesañca vibhaṅgañca. Tvaṁ panāvuso, dhāresi bhaddekarattassa uddesañca vibhaṅgañcā’ti? ‘Ahampi kho, bhikkhu, na dhāremi bhaddekarattassa uddesañca vibhaṅgañca. Dhāresi pana tvaṁ, bhikkhu, bhaddekarattiyo gāthā’ti? ‘Na kho ahaṁ, āvuso, dhāremi bhaddekarattiyo gāthā. Tvaṁ panāvuso, dhāresi bhaddekarattiyo gāthā’ti? ‘Dhāremi kho ahaṁ, bhikkhu, bhaddekarattiyo gāthā’ti. ‘Yathā kathaṁ pana tvaṁ, āvuso, dhāresi bhaddekarattiyo gāthā’ti? ‘Ekamidaṁ, bhikkhu, samayaṁ bhagavā devesu tāvatiṁsesu viharati pāricchattakamūle paṇḍukambalasilāyaṁ. Tatra kho bhagavā devānaṁ tāvatiṁsānaṁ bhaddekarattassa uddesañca vibhaṅgañca abhāsi:",
    "mn134:9": "\"Atītaṁ nānvāgameyya,… pe …Taṁ ve bhaddekarattoti,santo ācikkhate munī\"ti.",
    "mn134:10": "Evaṁ kho ahaṁ, bhikkhu, dhāremi bhaddekarattiyo gāthā. Uggaṇhāhi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañca; pariyāpuṇāhi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañca; dhārehi tvaṁ, bhikkhu, bhaddekarattassa uddesañca vibhaṅgañca. Atthasaṁhito, bhikkhu, bhaddekarattassa uddeso ca vibhaṅgo ca ādibrahmacariyako’ti. Idamavoca, bhante, so devaputto. Idaṁ vatvā tatthevantaradhāyi. Sādhu me, bhante, bhagavā bhaddekarattassa uddesañca vibhaṅgañca desetū\"ti.",
    "mn134:11": "\"Jānāsi pana tvaṁ, bhikkhu, taṁ devaputtan\"ti?",
    "mn134:12": "\"Atītaṁ nānvāgameyya,nappaṭikaṅkhe anāgataṁ;Yadatītaṁ pahīnaṁ taṁ,appattañca anāgataṁ.",
    "mn134:13": "Paccuppannañca yo dhammaṁ,tattha tattha vipassati;Asaṁhīraṁ asaṅkuppaṁ,taṁ vidvā manubrūhaye.",
    "mn134:14": "Ajjeva kiccamātappaṁ,ko jaññā maraṇaṁ suve;Na hi no saṅgaraṁ tena,mahāsenena maccunā.",
    "mn134:15": "Evaṁvihāriṁ ātāpiṁ,ahorattamatanditaṁ;Taṁ ve bhaddekarattoti,santo ācikkhate muni.",
    "mn134:16": "Kathañca, bhikkhu, atītaṁ anvāgameti … pe … evaṁ kho, bhikkhu, atītaṁ anvāgameti. Kathañca, bhikkhu, atītaṁ nānvāgameti … pe … evaṁ kho, bhikkhu, atītaṁ nānvāgameti. Kathañca, bhikkhu, anāgataṁ paṭikaṅkhati … pe … evaṁ kho, bhikkhu, anāgataṁ paṭikaṅkhati. Kathañca, bhikkhu, anāgataṁ nappaṭikaṅkhati … pe … evaṁ kho, bhikkhu, anāgataṁ nappaṭikaṅkhati. Kathañca, bhikkhu, paccuppannesu dhammesu saṁhīrati … pe … evaṁ kho, bhikkhu, paccuppannesu dhammesu saṁhīrati. Kathañca, bhikkhu, paccuppannesu dhammesu na saṁhīrati … pe … evaṁ kho, bhikkhu, paccuppannesu dhammesu na saṁhīrati.",
    "mn134:17": "Atītaṁ nānvāgameyya,nappaṭikaṅkhe anāgataṁ;Yadatītaṁ pahīnaṁ taṁ,appattañca anāgataṁ.",
    "mn134:18": "Paccuppannañca yo dhammaṁ,tattha tattha vipassati;Asaṁhīraṁ asaṅkuppaṁ,taṁ vidvā manubrūhaye.",
    "mn134:19": "Ajjeva kiccamātappaṁ,ko jaññā maraṇaṁ suve;Na hi no saṅgaraṁ tena,mahāsenena maccunā.",
    "mn134:20": "Evaṁvihāriṁ ātāpiṁ,ahorattamatanditaṁ;Taṁ ve bhaddekarattoti,santo ācikkhate munī\"ti.",
    "mn134:21": "Idamavoca bhagavā. Attamano āyasmā lomasakaṅgiyo bhagavato bhāsitaṁ abhinandīti."
}