{
    "mn138:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn138:2": "\"Tathā tathā, bhikkhave, bhikkhu upaparikkheyyayathā yathāupaparikkhato bahiddhā cassa viññāṇaṁ avikkhittaṁ avisaṭaṁ, ajjhattaṁ asaṇṭhitaṁ anupādāya na paritasseyya. Bahiddhā, bhikkhave, viññāṇe avikkhitte avisaṭe sati ajjhattaṁ asaṇṭhite anupādāya aparitassato āyatiṁ jātijarāmaraṇadukkhasamudayasambhavo na hotī\"ti.",
    "mn138:3": "Atha kho tesaṁ bhikkhūnaṁ, acirapakkantassa bhagavato, etadahosi: \"Idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘tathā tathā, bhikkhave, bhikkhu upaparikkheyya yathā yathā upaparikkhato bahiddhā cassa viññāṇaṁ avikkhittaṁ avisaṭaṁ, ajjhattaṁ asaṇṭhitaṁ anupādāya na paritasseyya. Bahiddhā, bhikkhave, viññāṇe avikkhitte avisaṭe sati ajjhattaṁ asaṇṭhite anupādāya aparitassato āyatiṁ jātijarāmaraṇadukkhasamudayasambhavo na hotī’ti. Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā\"ti? Atha kho tesaṁ bhikkhūnaṁ etadahosi: \"Ayaṁ kho āyasmā mahākaccāno satthu ceva saṁvaṇṇito sambhāvito ca viññūnaṁ sabrahmacārīnaṁ; pahoti cāyasmā mahākaccāno imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā mahākaccāno tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ etamatthaṁ paṭipuccheyyāmā\"ti.",
    "mn138:4": "Atha kho te bhikkhū yenāyasmā mahākaccāno tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā mahākaccānena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū āyasmantaṁ mahākaccānaṁ etadavocuṁ:",
    "mn138:5": "\"Idaṁ kho no, āvuso kaccāna, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘tathā tathā, bhikkhave, bhikkhu upaparikkheyya yathā yathā upaparikkhato bahiddhā cassa viññāṇaṁ avikkhittaṁ avisaṭaṁ, ajjhattaṁ asaṇṭhitaṁ anupādāya na paritasseyya. Bahiddhā, bhikkhave, viññāṇe avikkhitte avisaṭe sati ajjhattaṁ asaṇṭhite anupādāya aparitassato āyatiṁ jātijarāmaraṇadukkhasamudayasambhavo na hotī’ti. Tesaṁ no, āvuso kaccāna, amhākaṁ, acirapakkantassa bhagavato, etadahosi: ‘idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: \"tathā tathā, bhikkhave, bhikkhu upaparikkheyya, yathā yathā upaparikkhato bahiddhā cassa viññāṇaṁ avikkhittaṁ avisaṭaṁ ajjhattaṁ asaṇṭhitaṁ anupādāya na paritasseyya. Bahiddhā, bhikkhave, viññāṇe avikkhitte avisaṭe sati ajjhattaṁ asaṇṭhite anupādāya aparitassato āyatiṁ jātijarāmaraṇadukkhasamudayasambhavo na hotī\"ti. Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā’ti. Tesaṁ no, āvuso kaccāna, amhākaṁ etadahosi: ‘Ayaṁ kho āyasmā mahākaccāno satthu ceva saṁvaṇṇito, sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā mahākaccāno imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā mahākaccāno tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ etamatthaṁ paṭipuccheyyāmā’ti –  vibhajatāyasmā mahākaccāno\"ti.",
    "mn138:6": "\"Seyyathāpi, āvuso, puriso sāratthiko sāragavesī sārapariyesanaṁ caramāno mahato rukkhassa tiṭṭhato sāravato atikkammeva mūlaṁ atikkamma khandhaṁ sākhāpalāse sāraṁ pariyesitabbaṁ maññeyya, evaṁ sampadamidaṁ āyasmantānaṁ satthari sammukhībhūte taṁ bhagavantaṁ atisitvā amhe etamatthaṁ paṭipucchitabbaṁ maññatha. So hāvuso, bhagavā jānaṁ jānāti, passaṁ passati, cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. So ceva panetassa kālo ahosi yaṁ bhagavantaṁyeva etamatthaṁ paṭipuccheyyātha; yathā vo bhagavā byākareyya tathā naṁ dhāreyyāthā\"ti.",
    "mn138:7": "\"Yaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘tathā tathā, bhikkhave, bhikkhu upaparikkheyya, yathā yathā upaparikkhato bahiddhā cassa viññāṇaṁ avikkhittaṁ avisaṭaṁ ajjhattaṁ asaṇṭhitaṁ anupādāya na paritasseyya, bahiddhā, bhikkhave, viññāṇe avikkhitte avisaṭe sati ajjhattaṁ asaṇṭhite anupādāya aparitassato āyatiṁ jātijarāmaraṇadukkhasamudayasambhavo na hotī’ti. Imassa kho ahaṁ, āvuso, bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa evaṁ vitthārena atthaṁ ājānāmi.",
    "mn138:8": "Kathañcāvuso, bahiddhā viññāṇaṁ vikkhittaṁ visaṭanti vuccati? Idhāvuso, bhikkhuno cakkhunā rūpaṁ disvā rūpanimittānusāri viññāṇaṁ hotirūpanimittassādagadhitaṁrūpanimittassādavinibandhaṁrūpanimittassādasaṁyojanasaṁyuttaṁ bahiddhā viññāṇaṁ vikkhittaṁ visaṭanti vuccati.",
    "mn138:9": "Kathañcāvuso, bahiddhā viññāṇaṁ avikkhittaṁ avisaṭanti vuccati? Idhāvuso, bhikkhuno cakkhunā rūpaṁ disvā na rūpanimittānusāri viññāṇaṁ hoti, na rūpanimittassādagadhitaṁ na rūpanimittassādavinibandhaṁ na rūpanimittassādasaṁyojanasaṁyuttaṁ bahiddhā viññāṇaṁ avikkhittaṁ avisaṭanti vuccati.",
    "mn138:10": "Kathañcāvuso,ajjhattaṁsaṇṭhitanti vuccati? Idhāvuso, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. Tassa vivekajapītisukhānusāri viññāṇaṁ hoti vivekajapītisukhassādagadhitaṁ vivekajapītisukhassādavinibandhaṁ vivekajapītisukhassādasaṁyojanasaṁyuttaṁ ajjhattaṁ cittaṁ saṇṭhitanti vuccati.",
    "mn138:11": "Puna caparaṁ, āvuso, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. Tassa samādhijapītisukhānusāri viññāṇaṁ hoti samādhijapītisukhassādagadhitaṁ samādhijapītisukhassādavinibandhaṁ samādhijapītisukhassādasaṁyojanasaṁyuttaṁ ajjhattaṁ cittaṁ saṇṭhitanti vuccati.",
    "mn138:12": "Puna caparaṁ, āvuso, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti tatiyaṁ jhānaṁ upasampajja viharati. Tassa upekkhānusāri viññāṇaṁ hoti upekkhāsukhassādagadhitaṁ upekkhāsukhassādavinibandhaṁ upekkhāsukhassādasaṁyojanasaṁyuttaṁ ajjhattaṁ cittaṁ saṇṭhitanti vuccati.",
    "mn138:13": "Puna caparaṁ, āvuso, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. Tassa adukkhamasukhānusāri viññāṇaṁ hoti adukkhamasukhassādagadhitaṁ adukkhamasukhassādavinibandhaṁ adukkhamasukhassādasaṁyojanasaṁyuttaṁ ajjhattaṁ cittaṁ asaṇṭhitanti vuccati. Evaṁ kho, āvuso,ajjhattaṁsaṇṭhitanti vuccati.",
    "mn138:14": "Kathañcāvuso,ajjhattaṁasaṇṭhitanti vuccati? Idhāvuso, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi … pe … paṭhamaṁ jhānaṁ upasampajja viharati. Tassa na vivekajapītisukhānusāri viññāṇaṁ hoti na vivekajapītisukhassādagadhitaṁ na vivekajapītisukhassādavinibandhaṁ na vivekajapītisukhassādasaṁyojanasaṁyuttaṁ ajjhattaṁ cittaṁ asaṇṭhitanti vuccati.",
    "mn138:15": "Puna caparaṁ, āvuso, bhikkhu vitakkavicārānaṁ vūpasamā … pe … dutiyaṁ jhānaṁ upasampajja viharati. Tassa na samādhijapītisukhānusāri viññāṇaṁ hoti na samādhijapītisukhassādagadhitaṁ na samādhijapītisukhassādavinibandhaṁ na samādhijapītisukhassādasaṁyojanasaṁyuttaṁ ajjhattaṁ cittaṁ asaṇṭhitanti vuccati.",
    "mn138:16": "Puna caparaṁ, āvuso, bhikkhu pītiyā ca virāgā … pe … tatiyaṁ jhānaṁ upasampajja viharati. Tassa na upekkhānusāri viññāṇaṁ hoti na upekkhāsukhassādagadhitaṁ na upekkhāsukhassādavinibandhaṁ na upekkhāsukhassādasaṁyojanasaṁyuttaṁ ajjhattaṁ cittaṁ asaṇṭhitanti vuccati.",
    "mn138:17": "Puna caparaṁ, āvuso, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. Tassa na adukkhamasukhānusāri viññāṇaṁ hoti na adukkhamasukhassādagadhitaṁ na adukkhamasukhassādavinibandhaṁ na adukkhamasukhassādasaṁyojanasaṁyuttaṁ ajjhattaṁ cittaṁ asaṇṭhitanti vuccati. Evaṁ kho, āvuso,ajjhattaṁasaṇṭhitanti vuccati.",
    "mn138:18": "Kathañcāvuso, anupādā paritassanā hoti? Idhāvuso, assutavā puthujjano ariyānaṁ adassāvī ariyadhammassa akovido ariyadhamme avinīto sappurisānaṁ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto rūpaṁ attato samanupassati rūpavantaṁ vā attānaṁ attani vā rūpaṁ rūpasmiṁ vā attānaṁ. Tassa taṁ rūpaṁ vipariṇamati, aññathā hoti. Tassa rūpavipariṇāmaññathābhāvā rūpavipariṇāmānuparivatti viññāṇaṁ hoti. Tassa rūpavipariṇāmānuparivattajā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso pariyādānā uttāsavā ca hoti vighātavā ca apekkhavā ca anupādāya ca paritassati. Vedanaṁ … pe … saññaṁ … saṅkhāre … viññāṇaṁ attato samanupassati viññāṇavantaṁ vā attānaṁ attani vā viññāṇaṁ viññāṇasmiṁ vā attānaṁ. Tassa taṁ viññāṇaṁ vipariṇamati, aññathā hoti. Tassa viññāṇavipariṇāmaññathābhāvā viññāṇavipariṇāmānuparivatti viññāṇaṁ hoti. Tassa viññāṇavipariṇāmānuparivattajā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso pariyādānā uttāsavā ca hoti vighātavā ca apekkhavā ca anupādāya ca paritassati. Evaṁ kho, āvuso, anupādā paritassanā hoti.",
    "mn138:19": "Kathañcāvuso, anupādānā aparitassanā hoti? Idhāvuso, sutavā ariyasāvako ariyānaṁ dassāvī ariyadhammassa kovido ariyadhamme suvinīto sappurisānaṁ dassāvī sappurisadhammassa kovido sappurisadhamme suvinīto na rūpaṁ attato samanupassati na rūpavantaṁ vā attānaṁ na attani vā rūpaṁ na rūpasmiṁ vā attānaṁ. Tassa taṁ rūpaṁ vipariṇamati, aññathā hoti. Tassa rūpavipariṇāmaññathābhāvā na ca rūpavipariṇāmānuparivatti viññāṇaṁ hoti. Tassa na rūpavipariṇāmānuparivattajā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso pariyādānāna cevuttāsavāhoti na ca vighātavā na ca apekkhavā anupādāya ca na paritassati.",
    "mn138:20": "Yaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘tathā tathā, bhikkhave, bhikkhu upaparikkheyya yathā yathā upaparikkhato bahiddhā cassa viññāṇaṁ avikkhittaṁ avisaṭaṁ, ajjhattaṁ asaṇṭhitaṁ anupādāya na paritasseyya. Bahiddhā, bhikkhave, viññāṇe avikkhitte avisaṭe sati ajjhattaṁ asaṇṭhite anupādāya aparitassato āyatiṁ jātijarāmaraṇadukkhasamudayasambhavo na hotī’ti. Imassa kho ahaṁ, āvuso, bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa evaṁ vitthārena atthaṁ ājānāmi. Ākaṅkhamānā ca pana tumhe āyasmanto bhagavantaṁyeva upasaṅkamitvā etamatthaṁ paṭipuccheyyātha; yathā vo bhagavā byākaroti tathā naṁ dhāreyyāthā\"ti.",
    "mn138:21": "Atha kho te bhikkhū āyasmato mahākaccānassa bhāsitaṁ abhinanditvā anumoditvā uṭṭhāyāsanā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ:",
    "mn138:22": "\"Yaṁ kho no, bhante, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘tathā tathā, bhikkhave, bhikkhu upaparikkheyya yathā yathā upaparikkhato bahiddhā cassa viññāṇaṁ avikkhittaṁ avisaṭaṁ, ajjhattaṁ asaṇṭhitaṁ anupādāya na paritasseyya. Bahiddhā, bhikkhave, viññāṇe avikkhitte avisaṭe sati ajjhattaṁ asaṇṭhite anupādāya aparitassato āyatiṁ jātijarāmaraṇadukkhasamudayasambhavo na hotī’ti.",
    "mn138:23": "Tesaṁ no, bhante, amhākaṁ, acirapakkantassa bhagavato, etadahosi: ‘idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho — tathā tathā, bhikkhave, bhikkhu upaparikkheyya, yathā yathā upaparikkhato bahiddhā cassa viññāṇaṁ avikkhittaṁ avisaṭaṁ, ajjhattaṁ asaṇṭhitaṁ anupādāya na paritasseyya. Bahiddhā, bhikkhave, viññāṇe avikkhitte avisaṭe sati ajjhattaṁ asaṇṭhite anupādāya aparitassato āyatiṁ jātijarāmaraṇadukkhasamudayasambhavo na hotīti. Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā’ti? Tesaṁ no, bhante, amhākaṁ etadahosi: ‘Ayaṁ kho āyasmā mahākaccāno satthu ceva saṁvaṇṇito sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā mahākaccāno imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā mahākaccāno tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ etamatthaṁ paṭipuccheyyāmā’ti.",
    "mn138:24": "Atha kho mayaṁ, bhante, yenāyasmā mahākaccāno tenupasaṅkamimha; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ etamatthaṁ paṭipucchimha. Tesaṁ no, bhante, āyasmatā mahākaccānena imehi ākārehi imehi padehi imehi byañjanehi attho vibhatto\"ti.",
    "mn138:25": "\"Paṇḍito, bhikkhave, mahākaccāno; mahāpañño, bhikkhave, mahākaccāno. Mañcepi tumhe, bhikkhave, etamatthaṁ paṭipuccheyyātha, ahampi evamevaṁ byākareyyaṁ yathā taṁ mahākaccānena byākataṁ. Esocevetassaattho. Evañca naṁ dhāreyyāthā\"ti.",
    "mn138:26": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}