{
    "mn145:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā puṇṇo sāyanhasamayaṁ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā puṇṇo bhagavantaṁ etadavoca:",
    "mn145:2": "\"Santi kho, puṇṇa, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. Tañce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa taṁ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjatinandī. ‘Nandīsamudayā dukkhasamudayo, puṇṇā’ti vadāmi.",
    "mn145:3": "Santi kho, puṇṇa, sotaviññeyyā saddā … ghānaviññeyyā gandhā … jivhāviññeyyā rasā … kāyaviññeyyā phoṭṭhabbā … manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. Tañce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa taṁ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjati nandī. ‘Nandīsamudayā dukkhasamudayo, puṇṇā’ti vadāmi.",
    "mn145:4": "Santi ca kho, puṇṇa, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. Tañce bhikkhu nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa taṁ anabhinandato anabhivadato anajjhosāya tiṭṭhato nandī nirujjhati. ‘Nandīnirodhā dukkhanirodho, puṇṇā’ti vadāmi.",
    "mn145:5": "Santi ca kho, puṇṇa, sotaviññeyyā saddā … ghānaviññeyyā gandhā … jivhāviññeyyā rasā … kāyaviññeyyā phoṭṭhabbā … manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. Tañce bhikkhu nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa taṁ anabhinandato anabhivadato anajjhosāya tiṭṭhato nandī nirujjhati. ‘Nandīnirodhā dukkhanirodho, puṇṇā’ti vadāmi.",
    "mn145:6": "Iminā ca tvaṁ, puṇṇa, mayā saṅkhittena ovādena ovadito katarasmiṁ janapade viharissasī\"ti?",
    "mn145:7": "\"Caṇḍā kho, puṇṇa, sunāparantakā manussā; pharusā kho, puṇṇa, sunāparantakā manussā. Sace taṁ, puṇṇa, sunāparantakā manussā akkosissanti paribhāsissanti, tattha te, puṇṇa, kinti bhavissatī\"ti?",
    "mn145:8": "\"Sace pana te, puṇṇa, sunāparantakā manussā pāṇinā pahāraṁ dassanti, tattha pana te, puṇṇa, kinti bhavissatī\"ti?",
    "mn145:9": "\"Sace pana te, puṇṇa, sunāparantakā manussā leḍḍunā pahāraṁ dassanti, tattha pana te, puṇṇa, kinti bhavissatī\"ti? \"Sace me, bhante, sunāparantakā manussā leḍḍunā pahāraṁ dassanti, tattha me evaṁ bhavissati: ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṁ me nayime daṇḍena pahāraṁ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī\"ti.",
    "mn145:10": "\"Sace pana te, puṇṇa, sunāparantakā manussā daṇḍena pahāraṁ dassanti, tattha pana te, puṇṇa, kinti bhavissatī\"ti?",
    "mn145:11": "\"Sace pana te, puṇṇa, sunāparantakā manussā satthena pahāraṁ dassanti, tattha pana te, puṇṇa, kinti bhavissatī\"ti?",
    "mn145:12": "\"Sace pana taṁ, puṇṇa, sunāparantakā manussā tiṇhena satthena jīvitā voropessanti, tattha pana te, puṇṇa, kinti bhavissatī\"ti?",
    "mn145:13": "Atha kho āyasmā puṇṇo bhagavato bhāsitaṁ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā senāsanaṁ saṁsāmetvā pattacīvaramādāya yena sunāparanto janapado tena cārikaṁ pakkāmi. Anupubbena cārikaṁ caramāno yena sunāparanto janapado tadavasari. Tatra sudaṁ āyasmā puṇṇo sunāparantasmiṁ janapade viharati. Atha kho āyasmā puṇṇo tenevantaravassena pañcamattāni upāsakasatānipaṭivedesi, tenevantaravassena pañcamattāni upāsikasatāni paṭivedesi, tenevantaravassena tisso vijjā sacchākāsi. Atha kho āyasmā puṇṇo aparena samayena parinibbāyi.",
    "mn145:14": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ: \"yo so, bhante, puṇṇo nāma kulaputto bhagavatā saṁkhittena ovādena ovadito so kālaṅkato. Tassa kā gati, ko abhisamparāyo\"ti?",
    "mn145:15": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}