{
    "mn142:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sakkesu viharati kapila­vatthus­miṁ nigrodhārāme.",
    "mn142:2": "Dutiyampi kho mahāpajāpati gotamī bhagavantaṁ etadavoca: \"Idaṁ me, bhante, navaṁ dussayugaṁ bhagavantaṁ uddissa sāmaṁ kantaṁ sāmaṁ vāyitaṁ. Taṁ me, bhante, bhagavā paṭiggaṇhātu anukampaṁ upādāyā\"ti. Dutiyampi kho bhagavā mahāpajāpatiṁ gotamiṁ etadavoca: \"saṅghe, gotami, dehi. Saṅghe te dinne ahañceva pūjito bhavissāmi saṅgho cā\"ti.",
    "mn142:3": "Tatiyampi kho mahāpajāpati gotamī bhagavantaṁ etadavoca: \"Idaṁ me, bhante, navaṁ dussayugaṁ bhagavantaṁ uddissa sāmaṁ kantaṁ sāmaṁ vāyitaṁ. Taṁ me, bhante, bhagavā paṭiggaṇhātu anukampaṁ upādāyā\"ti. Tatiyampi kho bhagavā mahāpajāpatiṁ gotamiṁ etadavoca: \"saṅghe, gotami, dehi. Saṅghe te dinne ahañceva pūjito bhavissāmi saṅgho cā\"ti.",
    "mn142:4": "Evaṁ vutte, āyasmā ānando bhagavantaṁ etadavoca: \"paṭiggaṇhātu, bhante, bhagavā mahāpajāpatiyā gotamiyā navaṁ dussayugaṁ.Bahūpakārā, bhante, mahāpajāpati gotamī bhagavato mātucchā āpādikā posikā khīrassa dāyikā; bhagavantaṁ janettiyā kālaṅkatāya thaññaṁ pāyesi. Bhagavāpi, bhante, bahūpakāro mahāpajāpatiyā gotamiyā. Bhagavantaṁ, bhante, āgamma mahāpajāpati gotamī buddhaṁ saraṇaṁ gatā, dhammaṁ saraṇaṁ gatā, saṁghaṁ saraṇaṁ gatā. Bhagavantaṁ, bhante, āgamma mahāpajāpati gotamī pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesu­micchā­cārā paṭiviratā musāvādā paṭiviratā surā­meraya­majja­pa­mā­daṭṭhānā paṭiviratā. Bhagavantaṁ, bhante, āgamma mahāpajāpati gotamī buddhe aveccap­pasā­dena samannāgatā, dhamme aveccap­pasā­dena samannāgatā, saṁghe aveccap­pasā­dena samannāgatā ariyakantehi sīlehi samannāgatā. Bhagavantaṁ, bhante, āgamma mahāpajāpati gotamī dukkhe nikkaṅkhā, dukkhasamudaye nikkaṅkhā, dukkhanirodhe nikkaṅkhā, duk­kha­nirodha­gāminiyā paṭipadāya nikkaṅkhā. Bhagavāpi, bhante, bahūpakāro mahāpajāpatiyā gotamiyā\"ti.",
    "mn142:5": "\"Evametaṁ, ānanda. Yaṁ hānanda, puggalo puggalaṁ āgamma buddhaṁ saraṇaṁ gato hoti, dhammaṁ saraṇaṁ gato hoti, saṅghaṁ saraṇaṁ gato hoti, imassānanda, puggalassa iminā puggalena na suppatikāraṁ vadāmi, yadidaṁ — abhi­vāda­na­pac­cuṭ­ṭhā­na­añjali­kamma­sāmīci­kamma­cīvara­piṇḍa­pāta­se­nāsa­na­gilā­nappac­caya­bhesaj­ja­parik­khā­rā­nuppadā­nena.",
    "mn142:6": "Yaṁ hānanda, puggalo puggalaṁ āgamma pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesu­micchā­cārā paṭivirato hoti, musāvādā paṭivirato hoti, surā­meraya­majja­pa­mā­daṭṭhānā paṭivirato hoti, imassānanda, puggalassa iminā puggalena na suppatikāraṁ vadāmi, yadidaṁ — abhi­vāda­na­pac­cuṭ­ṭhā­na­añjali­kamma­sāmīci­kamma­cīvara­piṇḍa­pāta­se­nāsa­na­gilā­nappac­caya­bhesaj­ja­parik­khā­rā­nuppadā­nena.",
    "mn142:7": "Yaṁ hānanda, puggalo puggalaṁ āgamma buddhe aveccap­pasā­dena samannāgato hoti, dhamme … saṅghe … ariyakantehi sīlehi samannāgato hoti, imassānanda, puggalassa iminā puggalena na suppatikāraṁ vadāmi, yadidaṁ — abhi­vāda­na­pac­cuṭ­ṭhā­na­añjali­kamma­sāmīci­kamma­cīvara­piṇḍa­pāta­se­nāsa­na­gilā­nappac­caya­bhesaj­ja­parik­khā­rā­nuppadā­nena.",
    "mn142:8": "Yaṁ hānanda, puggalo puggalaṁ āgamma dukkhe nikkaṅkho hoti, dukkhasamudaye nikkaṅkho hoti, dukkhanirodhe nikkaṅkho hoti, duk­kha­nirodha­gāminiyā paṭipadāya nikkaṅkho hoti, imassānanda, puggalassa iminā puggalena na suppatikāraṁ vadāmi, yadidaṁ — abhi­vāda­na­pac­cuṭ­ṭhā­na­añjali­kamma­sāmīci­kamma­cīvara­piṇḍa­pāta­se­nāsa­na­gilā­nappac­caya­bhesaj­ja­parik­khā­rā­nuppadā­nena.",
    "mn142:9": "Cuddasa kho panimānanda, pāṭipuggalikā dakkhiṇā. Katamā cuddasa? Tathāgate arahante sammāsambuddhe dānaṁ deti — ayaṁ paṭhamā pāṭipuggalikā dakkhiṇā.Pac­ce­ka­sambud­dhedānaṁ deti — ayaṁ dutiyā pāṭipuggalikā dakkhiṇā. Tathā­gata­sāvake arahante dānaṁ deti — ayaṁ tatiyā pāṭipuggalikā dakkhiṇā. Arahat­ta­phala­sacchi­kiriyāya paṭipanne dānaṁ deti — ayaṁ catutthī pāṭipuggalikā dakkhiṇā. Anāgāmissa dānaṁ deti — ayaṁ pañcamī pāṭipuggalikā dakkhiṇā. Anāgā­mi­phala­sacchi­kiriyāya paṭipanne dānaṁ deti — ayaṁ chaṭṭhī pāṭipuggalikā dakkhiṇā. Sakadāgāmissa dānaṁ deti — ayaṁ sattamī pāṭipuggalikā dakkhiṇā. Sakadā­gāmi­phala­sacchi­kiriyāya paṭipanne dānaṁ deti — ayaṁ aṭṭhamī pāṭipuggalikā dakkhiṇā. Sotāpanne dānaṁ deti — ayaṁ navamī pāṭipuggalikā dakkhiṇā. Sotā­patti­phala­sacchi­kiriyāya paṭipanne dānaṁ deti –  ayaṁ dasamī pāṭipuggalikā dakkhiṇā. Bāhirake kāmesu vītarāge dānaṁ deti — ayaṁ ekādasamī pāṭipuggalikā dakkhiṇā. Puthuj­jana­sīla­vante dānaṁ deti — ayaṁ dvādasamī pāṭipuggalikā dakkhiṇā. Puthuj­jana­dussīle dānaṁ deti — ayaṁ terasamī pāṭipuggalikā dakkhiṇā. Tiracchānagate dānaṁ deti — ayaṁ cuddasamī pāṭipuggalikā dakkhiṇāti.",
    "mn142:10": "Tatrānanda, tiracchānagate dānaṁ datvā sataguṇā dakkhiṇā pāṭikan­khi­tabbā, puthuj­jana­dussīle dānaṁ datvā sahassaguṇā dakkhiṇā pāṭikan­khi­tabbā, puthuj­jana­sīla­vante dānaṁ datvā sata­sahas­sa­guṇā dakkhiṇā pāṭikan­khi­tabbā, bāhirake kāmesu vītarāge dānaṁ datvā koṭi­sata­sahas­sa­guṇā dakkhiṇā pāṭikan­khi­tabbā, sotā­patti­phala­sacchi­kiriyāya paṭipanne dānaṁ datvā asaṅkheyyā appameyyā dakkhiṇā pāṭikan­khi­tabbā, ko pana vādo sotāpanne, ko pana vādo sakadā­gāmi­phala­sacchi­kiriyāya paṭipanne, ko pana vādo sakadāgāmissa, ko pana vādo anāgā­mi­phala­sacchi­kiriyāya paṭipanne, ko pana vādo anāgāmissa, ko pana vādo arahat­ta­phala­sacchi­kiriyāya paṭipanne, ko pana vādo arahante, ko pana vādo pac­ce­ka­sambud­dhe, ko pana vādo tathāgate arahante sammāsambuddhe.",
    "mn142:11": "Satta kho panimānanda, saṅghagatā dakkhiṇā. Katamā satta? Buddhappamukhe ubhatosaṅghe dānaṁ deti — ayaṁ paṭhamā saṅghagatā dakkhiṇā. Tathāgate parinibbute ubhatosaṅghe dānaṁ deti — ayaṁ dutiyā saṅghagatā dakkhiṇā. Bhikkhusaṅghe dānaṁ deti — ayaṁ tatiyā saṅghagatā dakkhiṇā. Bhik­khu­ni­saṅghe dānaṁ deti — ayaṁ catutthī saṅghagatā dakkhiṇā. ‘Ettakā me bhikkhū ca bhikkhuniyo ca saṅghato uddissathā’ti dānaṁ deti — ayaṁ pañcamī saṅghagatā dakkhiṇā. ‘Ettakā me bhikkhū saṅghato uddissathā’ti dānaṁ deti — ayaṁ chaṭṭhī saṅghagatā dakkhiṇā. ‘Ettakā me bhikkhuniyo saṅghato uddissathā’ti dānaṁ deti –  ayaṁ sattamī saṅghagatā dakkhiṇā.",
    "mn142:12": "Bhavissanti kho panānanda, anāga­ta­maddhā­naṁ gotrabhuno kāsāvakaṇṭhā dussīlā pāpadhammā. Tesu dussīlesu saṅghaṁ uddissa dānaṁ dassanti. Tadāpāhaṁ, ānanda, saṅghagataṁ dakkhiṇaṁ asaṅkheyyaṁ appameyyaṁ vadāmi. Na tvevāhaṁ, ānanda, kenaci pariyāyena saṅghagatāya dakkhiṇāya pāṭipuggalikaṁ dānaṁ mahap­phala­taraṁ vadāmi.",
    "mn142:13": "Catasso kho imā, ānanda, dakkhiṇā visuddhiyo. Katamā catasso? Atthānanda, dakkhiṇā dāyakato visujjhati no paṭiggāhakato. Atthānanda, dakkhiṇā paṭiggāhakato visujjhati no dāyakato. Atthānanda, dakkhiṇā neva dāyakato visujjhati no paṭiggāhakato. Atthānanda, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca.",
    "mn142:14": "Kathañcānanda, dakkhiṇā dāyakato visujjhati no paṭiggāhakato? Idhānanda, dāyako hoti sīlavā kalyāṇadhammo, paṭiggāhakā honti dussīlā pāpadhammā — evaṁ kho, ānanda, dakkhiṇā dāyakato visujjhati no paṭiggāhakato.",
    "mn142:15": "Kathañcānanda, dakkhiṇā paṭiggāhakato visujjhati no dāyakato? Idhānanda, dāyako hoti dussīlo pāpadhammo, paṭiggāhakā hontisīlavantokalyāṇadhammā — evaṁ kho, ānanda, dakkhiṇā paṭiggāhakato visujjhati no dāyakato.",
    "mn142:16": "Kathañcānanda, dakkhiṇā neva dāyakato visujjhati no paṭiggāhakato? Idhānanda, dāyako ca hoti dussīlo pāpadhammo, paṭiggāhakā ca honti dussīlā pāpadhammā –  evaṁ kho, ānanda, dakkhiṇā neva dāyakato visujjhati no paṭiggāhakato.",
    "mn142:17": "Kathañcānanda, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca? Idhānanda, dāyako ca hoti sīlavā kalyāṇadhammo, paṭiggāhakā ca honti sīlavanto kalyāṇadhammā — evaṁ kho, ānanda, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca. Imā kho, ānanda, catasso dakkhiṇā visuddhiyo\"ti.",
    "mn142:18": "Idamavoca bhagavā. Idaṁ vatvāna sugato athāparaṁ etadavoca satthā:",
    "mn142:19": "\"Yo sīlavā dussīlesu dadāti dānaṁ,Dhammenaladdhaṁsupasannacitto;Abhisaddahaṁ kammaphalaṁ uḷāraṁ,Sā dakkhiṇā dāyakato visujjhati.",
    "mn142:20": "Yo dussīlo sīlavantesu dadāti dānaṁ,Adhammena laddhaṁ appasannacitto;Anabhisaddahaṁ kammaphalaṁ uḷāraṁ,Sā dakkhiṇā paṭiggāhakato visujjhati.",
    "mn142:21": "Yo dussīlo dussīlesu dadāti dānaṁ,Adhammena laddhaṁ appasannacitto;Anabhisaddahaṁ kammaphalaṁ uḷāraṁ,Na taṁ dānaṁ vipulap­phalanti brūmi.",
    "mn142:22": "Yo sīlavā sīlavantesu dadāti dānaṁ,Dhammena laddhaṁ supasannacitto;Abhisaddahaṁ kammaphalaṁ uḷāraṁ,Taṁ ve dānaṁ vipulap­phalanti brūmi.",
    "mn142:23": "Yo vītarāgo vītarāgesu dadāti dānaṁ,Dhammena laddhaṁ supasannacitto;Abhisaddahaṁ kammaphalaṁ uḷāraṁ,Taṁ ve dānaṁ āmisa­dānā­na­maggan\"ti.",
    "mn142:24": "Bhad­dekā­nanda­kac­cāna,Lomasakan­gi­yāsu­bho;Mahā­kamma­saḷāya­tana­vibhaṅgā,Uddesaaraṇā dhātu saccaṁ."
}