{
    "mn144:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā rājagahe viharati veḷuvane kalandakanivāpe.",
    "mn144:2": "Atha kho āyasmā ca sāriputto āyasmā ca mahācundo yenāyasmā channo tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā channena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinno kho āyasmā sāriputto āyasmantaṁ channaṁ etadavoca: \"Kacci te, āvuso channa, khamanīyaṁ, kacci yāpanīyaṁ? Kacci te dukkhā vedanā paṭikkamanti, no abhikkamanti; paṭikkamosānaṁ paññāyati, no abhikkamo\"ti?",
    "mn144:3": "\"Na me, āvuso sāriputta, khamanīyaṁ na yāpanīyaṁ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṁ paññāyati, no paṭikkamo. Seyyathāpi, āvuso sāriputta, balavā puriso tiṇhena sikharena muddhani abhimattheyya; evameva kho me, āvuso sāriputta, adhimattā vātā muddhani ūhananti. Na me, āvuso sāriputta, khamanīyaṁ na yāpanīyaṁ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṁ paññāyati no paṭikkamo. Seyyathāpi, āvuso sāriputta, balavā puriso daḷhena varattakkhaṇḍena sīse sīsaveṭhaṁ dadeyya; evameva kho me, āvuso sāriputta, adhimattā sīse sīsavedanā. Na me, āvuso sāriputta, khamanīyaṁ na yāpanīyaṁ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṁ paññāyati, no paṭikkamo. Seyyathāpi, āvuso sāriputta, dakkho goghātako vā goghātakantevāsī vā tiṇhena govikantanena kucchiṁ parikanteyya; evameva kho me, āvuso sāriputta, adhimattā vātā kucchiṁ parikantanti. Na me, āvuso sāriputta, khamanīyaṁ na yāpanīyaṁ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṁ paññāyati, no paṭikkamo. Seyyathāpi, āvuso sāriputta, dve balavanto purisā dubbalataraṁ purisaṁ nānābāhāsu gahetvā aṅgārakāsuyā santāpeyyuṁ samparitāpeyyuṁ; evameva kho me, āvuso sāriputta, adhimatto kāyasmiṁ ḍāho. Na me, āvuso sāriputta, khamanīyaṁ na yāpanīyaṁ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṁ paññāyati, no paṭikkamo. Satthaṁ, āvuso sāriputta, āharissāmi, nāvakaṅkhāmi jīvitan\"ti.",
    "mn144:4": "\"Māyasmā channo satthaṁ āharesi. Yāpetāyasmā channo. Yāpentaṁ mayaṁ āyasmantaṁ channaṁ icchāma. Sace āyasmato channassa natthi sappāyāni bhojanāni, ahaṁ āyasmato channassa sappāyāni bhojanāni pariyesissāmi. Sace āyasmato channassa natthi sappāyāni bhesajjāni, ahaṁ āyasmato channassa sappāyāni bhesajjāni pariyesissāmi. Sace āyasmato channassa natthi patirūpā upaṭṭhākā, ahaṁ āyasmantaṁ channaṁ upaṭṭhahissāmi. Māyasmā channo satthaṁ āharesi. Yāpetāyasmā channo. Yāpentaṁ mayaṁ āyasmantaṁ channaṁ icchāmā\"ti.",
    "mn144:5": "\"Napi me, āvuso sāriputta, natthi sappāyāni bhojanāni; napi me natthi sappāyāni bhesajjāni; napi me natthi patirūpā upaṭṭhākā; api cāvuso sāriputta, pariciṇṇo me satthā dīgharattaṁ manāpeneva no amanāpena. Etañhi, āvuso sāriputta, sāvakassa patirūpaṁ yaṁ satthāraṁ paricareyya manāpeneva no amanāpena. ‘Anupavajjaṁ channo bhikkhu satthaṁ āharissatī’tievametaṁ, āvuso sāriputta, dhārehī\"ti.",
    "mn144:6": "\"Cakkhuṁ, āvuso channa, cakkhuviññāṇaṁ cakkhuviññāṇaviññātabbe dhamme ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassasi? Sotaṁ, āvuso channa, sotaviññāṇaṁ … pe … ghānaṁ, āvuso channa, ghānaviññāṇaṁ … jivhaṁ, āvuso channa, jivhāviññāṇaṁ … kāyaṁ, āvuso channa, kāyaviññāṇaṁ … manaṁ, āvuso channa, manoviññāṇaṁ manoviññāṇaviññātabbe dhamme ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassasī\"ti?",
    "mn144:7": "\"Cakkhuṁ, āvuso sāriputta, cakkhuviññāṇaṁ cakkhuviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmi. Sotaṁ, āvuso sāriputta … pe … ghānaṁ, āvuso sāriputta … jivhaṁ, āvuso sāriputta … kāyaṁ, āvuso sāriputta … manaṁ, āvuso sāriputta, manoviññāṇaṁ manoviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmī\"ti.",
    "mn144:8": "\"Cakkhusmiṁ, āvuso channa, cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesu kiṁ disvā kiṁ abhiññāya cakkhuṁ cakkhuviññāṇaṁ cakkhuviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassasi? Sotasmiṁ, āvuso channa, sotaviññāṇe … ghānasmiṁ, āvuso channa, ghānaviññāṇe … jivhāya, āvuso channa, jivhāviññāṇe … kāyasmiṁ, āvuso channa, kāyaviññāṇe … manasmiṁ, āvuso channa, manoviññāṇe manoviññāṇaviññātabbesu dhammesu kiṁ disvā kiṁ abhiññāya manaṁ manoviññāṇaṁ manoviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassasī\"ti?",
    "mn144:9": "\"Cakkhusmiṁ, āvuso sāriputta, cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesu nirodhaṁ disvā nirodhaṁ abhiññāya cakkhuṁ cakkhuviññāṇaṁ cakkhuviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmi. Sotasmiṁ, āvuso sāriputta, sotaviññāṇe … ghānasmiṁ, āvuso sāriputta, ghānaviññāṇe … jivhāya, āvuso sāriputta, jivhāviññāṇe … kāyasmiṁ, āvuso sāriputta, kāyaviññāṇe … manasmiṁ, āvuso sāriputta, manoviññāṇe manoviññāṇaviññātabbesu dhammesu nirodhaṁ disvā nirodhaṁ abhiññāya manaṁ manoviññāṇaṁ manoviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmī\"ti.",
    "mn144:10": "Evaṁ vutte, āyasmā mahācundo āyasmantaṁ channaṁ etadavoca: \"tasmātiha, āvuso channa, idampi tassa bhagavato sāsanaṁ, niccakappaṁ manasi kātabbaṁ: ‘nissitassa calitaṁ, anissitassa calitaṁ natthi. Calite asati passaddhi, passaddhiyā sati nati na hoti. Natiyā asati āgatigati na hoti. Āgatigatiyā asati cutūpapāto na hoti. Cutūpapāte asati nevidha na huraṁ na ubhayamantarena. Esevanto dukkhassā’\"ti. Atha kho āyasmā ca sāriputto āyasmā ca mahācundo āyasmantaṁ channaṁ iminā ovādena ovaditvā uṭṭhāyāsanā pakkamiṁsu.",
    "mn144:11": "Atha kho āyasmā channo acirapakkante āyasmante ca sāriputte āyasmante ca mahācunde satthaṁ āharesi.",
    "mn144:12": "Idamavoca bhagavā. Attamano āyasmā sāriputto bhagavato bhāsitaṁ abhinandīti."
}