{
    "mn141:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā bārāṇasiyaṁ viharati isipatane migadāye. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn141:2": "\"Tathāgatena, bhikkhave, arahatā sammāsambuddhena bārāṇasiyaṁ isipatane migadāye anuttaraṁ dhammacakkaṁ pavattitaṁ appaṭivattiyaṁ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṁ, yadidaṁ — catunnaṁ ariyasaccānaṁ ācikkhanā desanā paññāpanā paṭṭhapanā vivaraṇā vibhajanā uttānīkammaṁ. Katamesaṁ catunnaṁ?",
    "mn141:3": "Sevatha, bhikkhave, sāriputtamoggallāne; bhajatha, bhikkhave, sāriputtamoggallāne. Paṇḍitā bhikkhū anuggāhakā sabrahmacārīnaṁ. Seyyathāpi, bhikkhave,janetā, evaṁ sāriputto; seyyathāpi jātassa āpādetā, evaṁ moggallāno. Sāriputto, bhikkhave, sotāpattiphale vineti, moggallāno uttamatthe. Sāriputto, bhikkhave, pahoti cattāri ariyasaccāni vitthārena ācikkhituṁ desetuṁ paññāpetuṁ paṭṭhapetuṁ vivarituṁ vibhajituṁ uttānīkātun\"ti.",
    "mn141:4": "Tatra kho āyasmā sāriputto acirapakkantassa bhagavato bhikkhū āmantesi: \"āvuso bhikkhave\"ti. \"Āvuso\"ti kho te bhikkhū āyasmato sāriputtassa paccassosuṁ. Āyasmā sāriputto etadavoca:",
    "mn141:5": "\"Tathāgatena, āvuso, arahatā sammāsambuddhena bārāṇasiyaṁ isipatane migadāye anuttaraṁ dhammacakkaṁ pavattitaṁ appaṭivattiyaṁ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṁ, yadidaṁ — catunnaṁ ariyasaccānaṁ ācikkhanā desanā paññāpanā paṭṭhapanā vivaraṇā vibhajanā uttānīkammaṁ. Katamesaṁ catunnaṁ?",
    "mn141:6": "Katamañcāvuso, dukkhaṁ ariyasaccaṁ? Jātipi dukkhā, jarāpi dukkhā, maraṇampi dukkhaṁ, sokaparidevadukkhadomanassupāyāsāpi dukkhā, yampicchaṁ na labhati tampi dukkhaṁ; saṅkhittena pañcupādānakkhandhā dukkhā.",
    "mn141:7": "Katamā cāvuso, jāti? Yā tesaṁ tesaṁ sattānaṁ tamhi tamhi sattanikāye jāti sañjāti okkanti abhinibbatti khandhānaṁ pātubhāvo āyatanānaṁ paṭilābho, ayaṁ vuccatāvuso: ‘jāti’.",
    "mn141:8": "Katamā cāvuso, jarā? Yā tesaṁ tesaṁ sattānaṁ tamhi tamhi sattanikāye jarā jīraṇatā khaṇḍiccaṁ pāliccaṁ valittacatā āyuno saṁhāni indriyānaṁ paripāko, ayaṁ vuccatāvuso: ‘jarā’.",
    "mn141:9": "Katamañcāvuso, maraṇaṁ? Yā tesaṁ tesaṁ sattānaṁ tamhā tamhā sattanikāyā cuti cavanatā bhedo antaradhānaṁ maccu maraṇaṁ kālaṅkiriyā khandhānaṁ bhedo kaḷevarassa nikkhepo jīvitindriyassupacchedo, idaṁ vuccatāvuso: ‘maraṇaṁ’.",
    "mn141:10": "Katamo cāvuso, soko? Yo kho, āvuso, aññataraññatarena byasanena samannāgatassa aññataraññatarena dukkhadhammena phuṭṭhassa soko socanā socitattaṁ antosoko antoparisoko, ayaṁ vuccatāvuso: ‘soko’.",
    "mn141:11": "Katamo cāvuso, paridevo? Yo kho, āvuso, aññataraññatarena byasanena samannāgatassa aññataraññatarena dukkhadhammena phuṭṭhassa ādevo paridevo ādevanā paridevanā ādevitattaṁ paridevitattaṁ, ayaṁ vuccatāvuso: ‘paridevo’.",
    "mn141:12": "Katamañcāvuso, dukkhaṁ? Yaṁ kho, āvuso, kāyikaṁ dukkhaṁ kāyikaṁ asātaṁ kāyasamphassajaṁ dukkhaṁ asātaṁ vedayitaṁ, idaṁ vuccatāvuso: ‘dukkhaṁ’.",
    "mn141:13": "Katamañcāvuso, domanassaṁ? Yaṁ kho, āvuso, cetasikaṁ dukkhaṁ cetasikaṁ asātaṁ manosamphassajaṁ dukkhaṁ asātaṁ vedayitaṁ, idaṁ vuccatāvuso: ‘domanassaṁ’.",
    "mn141:14": "Katamo cāvuso, upāyāso? Yo kho, āvuso, aññataraññatarena byasanena samannāgatassa aññataraññatarena dukkhadhammena phuṭṭhassa āyāso upāyāso āyāsitattaṁ upāyāsitattaṁ, ayaṁ vuccatāvuso: ‘upāyāso’.",
    "mn141:15": "Katamañcāvuso, yampicchaṁ na labhati tampi dukkhaṁ? Jātidhammānaṁ, āvuso, sattānaṁ evaṁ icchā uppajjati: ‘aho vata mayaṁ na jātidhammā assāma; na ca vata no jāti āgaccheyyā’ti. Na kho panetaṁ icchāya pattabbaṁ. Idampi: ‘yampicchaṁ na labhati tampi dukkhaṁ’. Jarādhammānaṁ, āvuso, sattānaṁ … pe … byādhidhammānaṁ, āvuso, sattānaṁ … maraṇadhammānaṁ, āvuso, sattānaṁ … sokaparidevadukkhadomanassupāyāsadhammānaṁ, āvuso, sattānaṁ evaṁ icchā uppajjati: ‘aho vata mayaṁ na sokaparidevadukkhadomanassupāyāsadhammā assāma; na ca vata no sokaparidevadukkhadomanassupāyāsā āgaccheyyun’ti. Na kho panetaṁ icchāya pattabbaṁ. Idampi: ‘yampicchaṁ na labhati tampi dukkhaṁ’.",
    "mn141:16": "Katame cāvuso, saṅkhittena pañcupādānakkhandhā dukkhā? Seyyathidaṁ — rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Ime vuccantāvuso: ‘saṅkhittena pañcupādānakkhandhā dukkhā’. Idaṁ vuccatāvuso: ‘dukkhaṁ ariyasaccaṁ’.",
    "mn141:17": "Katamañcāvuso,dukkhasamudayaṁariyasaccaṁ? Yāyaṁ taṇhāponobbhavikānandīrāgasahagatātatratatrābhinandinī, seyyathidaṁ — kāmataṇhā bhavataṇhā vibhavataṇhā, idaṁ vuccatāvuso: ‘dukkhasamudayaṁariyasaccaṁ’.",
    "mn141:18": "Katamañcāvuso,dukkhanirodhaṁariyasaccaṁ? Yo tassāyeva taṇhāya asesavirāganirodho cāgo paṭinissaggo mutti anālayo, idaṁ vuccatāvuso: ‘dukkhanirodhaṁariyasaccaṁ’.",
    "mn141:19": "Katamañcāvuso, dukkhanirodhagāminī paṭipadā ariyasaccaṁ? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṁ — sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi.",
    "mn141:20": "Katamā cāvuso, sammādiṭṭhi? Yaṁ kho, āvuso, dukkhe ñāṇaṁ, dukkhasamudaye ñāṇaṁ, dukkhanirodhe ñāṇaṁ, dukkhanirodhagāminiyā paṭipadāya ñāṇaṁ, ayaṁ vuccatāvuso: ‘sammādiṭṭhi’.",
    "mn141:21": "Katamo cāvuso, sammāsaṅkappo? Nekkhammasaṅkappo, abyāpādasaṅkappo, avihiṁsāsaṅkappo, ayaṁ vuccatāvuso: ‘sammāsaṅkappo’.",
    "mn141:22": "Katamā cāvuso, sammāvācā? Musāvādā veramaṇī, pisuṇāya vācāya veramaṇī, pharusāya vācāya veramaṇī, samphappalāpā veramaṇī, ayaṁ vuccatāvuso: ‘sammāvācā’.",
    "mn141:23": "Katamo cāvuso, sammākammanto? Pāṇātipātā veramaṇī, adinnādānā veramaṇī, kāmesumicchācārā veramaṇī, ayaṁ vuccatāvuso: ‘sammākammanto’.",
    "mn141:24": "Katamo cāvuso, sammāājīvo? Idhāvuso, ariyasāvako micchāājīvaṁ pahāya sammāājīvena jīvikaṁ kappeti, ayaṁ vuccatāvuso: ‘sammāājīvo’.",
    "mn141:25": "Katamo cāvuso, sammāvāyāmo? Idhāvuso, bhikkhu anuppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ anuppādāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati, uppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati, anuppannānaṁ kusalānaṁ dhammānaṁ uppādāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati, uppannānaṁ kusalānaṁ dhammānaṁ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati, ayaṁ vuccatāvuso: ‘sammāvāyāmo’.",
    "mn141:26": "Katamā cāvuso, sammāsati? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṁ. Vedanāsu vedanānupassī viharati … pe … citte cittānupassī viharati … dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṁ, ayaṁ vuccatāvuso: ‘sammāsati’.",
    "mn141:27": "Katamo cāvuso, sammāsamādhi? Idhāvuso, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati, vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati, pītiyā ca virāgā upekkhako ca viharati … pe … tatiyaṁ jhānaṁ … pe … catutthaṁ jhānaṁ upasampajja viharati, ayaṁ vuccatāvuso: ‘sammāsamādhi’.",
    "mn141:28": "Tathāgatenāvuso, arahatā sammāsambuddhena bārāṇasiyaṁ isipatane migadāye anuttaraṁ dhammacakkaṁ pavattitaṁ appaṭivattiyaṁ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṁ, yadidaṁ — imesaṁ catunnaṁ ariyasaccānaṁ ācikkhanā desanā paññāpanā paṭṭhapanā vivaraṇā vibhajanā uttānīkamman\"ti.",
    "mn141:29": "Idamavoca āyasmā sāriputto. Attamanā te bhikkhū āyasmato sāriputtassa bhāsitaṁ abhinandunti."
}