{
    "mn152:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavāgajaṅgalāyaṁviharatisuveḷuvane.",
    "mn152:2": "Atha kho bhagavā uttaraṁ māṇavaṁ pārāsiviyantevāsiṁ tuṇhībhūtaṁ maṅkubhūtaṁ pattakkhandhaṁ adhomukhaṁ pajjhāyantaṁ appaṭibhānaṁ viditvā āyasmantaṁ ānandaṁ āmantesi: \"aññathā kho, ānanda, deseti pārāsiviyo brāhmaṇo sāvakānaṁ indriyabhāvanaṁ, aññathā ca panānanda, ariyassa vinaye anuttarā indriyabhāvanā hotī\"ti.",
    "mn152:3": "\"Kathañcānanda, ariyassa vinaye anuttarā indriyabhāvanā hoti? Idhānanda, bhikkhuno cakkhunā rūpaṁ disvā uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ manāpaṁ, uppannaṁ amanāpaṁ, uppannaṁ manāpāmanāpaṁ. Tañca kho saṅkhataṁ oḷārikaṁ paṭiccasamuppannaṁ. Etaṁ santaṁ etaṁ paṇītaṁ yadidaṁ — upekkhā’ti. Tassa taṁ uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, cakkhumā puriso ummīletvā vā nimīleyya, nimīletvā vā ummīleyya; evameva kho, ānanda, yassa kassaci evaṁsīghaṁ evaṁtuvaṭaṁ evaṁappakasirena uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati, upekkhā saṇṭhāti — ayaṁ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā cakkhuviññeyyesu rūpesu.",
    "mn152:4": "Puna caparaṁ, ānanda, bhikkhuno sotena saddaṁ sutvā uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ manāpaṁ, uppannaṁ amanāpaṁ, uppannaṁ manāpāmanāpaṁ. Tañca kho saṅkhataṁ oḷārikaṁ paṭiccasamuppannaṁ. Etaṁ santaṁ etaṁ paṇītaṁ yadidaṁ — upekkhā’ti. Tassa taṁ uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā puriso appakasirenevaaccharaṁpahareyya; evameva kho, ānanda, yassa kassaci evaṁsīghaṁ evaṁtuvaṭaṁ evaṁappakasirena uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati, upekkhā saṇṭhāti — ayaṁ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā sotaviññeyyesu saddesu.",
    "mn152:5": "Puna caparaṁ, ānanda, bhikkhuno ghānena gandhaṁ ghāyitvā uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ manāpaṁ, uppannaṁ amanāpaṁ, uppannaṁ manāpāmanāpaṁ. Tañca kho saṅkhataṁ oḷārikaṁ paṭiccasamuppannaṁ. Etaṁ santaṁ etaṁ paṇītaṁ yadidaṁ — upekkhā’ti. Tassa taṁ uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda,īsakampoṇepadumapalāseudakaphusitāni pavattanti, na saṇṭhanti; evameva kho, ānanda, yassa kassaci evaṁsīghaṁ evaṁtuvaṭaṁ evaṁappakasirena uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati, upekkhā saṇṭhāti — ayaṁ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā ghānaviññeyyesu gandhesu.",
    "mn152:6": "Puna caparaṁ, ānanda, bhikkhuno jivhāya rasaṁ sāyitvā uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ manāpaṁ, uppannaṁ amanāpaṁ, uppannaṁ manāpāmanāpaṁ. Tañca kho saṅkhataṁ oḷārikaṁ paṭiccasamuppannaṁ. Etaṁ santaṁ etaṁ paṇītaṁ yadidaṁ — upekkhā’ti. Tassa taṁ uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā puriso jivhagge kheḷapiṇḍaṁ saṁyūhitvā appakasirenavameyya; evameva kho, ānanda, yassa kassaci evaṁsīghaṁ evaṁtuvaṭaṁ evaṁappakasirena uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati, upekkhā saṇṭhāti — ayaṁ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā jivhāviññeyyesu rasesu.",
    "mn152:7": "Puna caparaṁ, ānanda, bhikkhuno kāyena phoṭṭhabbaṁ phusitvā uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ manāpaṁ, uppannaṁ amanāpaṁ, uppannaṁ manāpāmanāpaṁ. Tañca kho saṅkhataṁ oḷārikaṁ paṭiccasamuppannaṁ. Etaṁ santaṁ etaṁ paṇītaṁ yadidaṁ — upekkhā’ti. Tassa taṁ uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evameva kho, ānanda, yassa kassaci evaṁsīghaṁ evaṁtuvaṭaṁ evaṁappakasirena uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati, upekkhā saṇṭhāti — ayaṁ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā kāyaviññeyyesu phoṭṭhabbesu.",
    "mn152:8": "Puna caparaṁ, ānanda, bhikkhuno manasā dhammaṁ viññāya uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ manāpaṁ, uppannaṁ amanāpaṁ, uppannaṁ manāpāmanāpaṁ. Tañca kho saṅkhataṁ oḷārikaṁ paṭiccasamuppannaṁ. Etaṁ santaṁ etaṁ paṇītaṁ yadidaṁ — upekkhā’ti. Tassa taṁ uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā purisodivasaṁsantatteayokaṭāhe dve vā tīṇi vā udakaphusitāni nipāteyya. Dandho, ānanda, udakaphusitānaṁ nipāto, atha kho naṁ khippameva parikkhayaṁ pariyādānaṁ gaccheyya; evameva kho, ānanda, yassa kassaci evaṁsīghaṁ evaṁtuvaṭaṁ evaṁappakasirena uppannaṁ manāpaṁ uppannaṁ amanāpaṁ uppannaṁ manāpāmanāpaṁ nirujjhati, upekkhā saṇṭhāti — ayaṁ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā manoviññeyyesu dhammesu.",
    "mn152:9": "Kathañcānanda, sekho hoti pāṭipado? Idhānanda, bhikkhuno cakkhunā rūpaṁ disvā uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So tena uppannena manāpena uppannena amanāpena uppannena manāpāmanāpena aṭṭīyati harāyati jigucchati. Sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … jivhāya rasaṁ sāyitvā … kāyena phoṭṭhabbaṁ phusitvā … manasā dhammaṁ viññāya uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So tena uppannena manāpena uppannena amanāpena uppannena manāpāmanāpena aṭṭīyati harāyati jigucchati. Evaṁ kho, ānanda, sekho hoti pāṭipado.",
    "mn152:10": "Kathañcānanda, ariyo hoti bhāvitindriyo? Idhānanda, bhikkhuno cakkhunā rūpaṁ disvā uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So sace ākaṅkhati: ‘paṭikūleappaṭikūlasaññī vihareyyan’ti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati: ‘appaṭikūle paṭikūlasaññī vihareyyan’ti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati: ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyyan’ti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati: ‘appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyyan’ti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati: ‘paṭikūlañca appaṭikūlañca tadubhayaṁ abhinivajjetvā upekkhako vihareyyaṁ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno.",
    "mn152:11": "Puna caparaṁ, ānanda, bhikkhuno sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … jivhāya rasaṁ sāyitvā … kāyena phoṭṭhabbaṁ phusitvā … manasā dhammaṁ viññāya uppajjati manāpaṁ, uppajjati amanāpaṁ, uppajjati manāpāmanāpaṁ. So sace ākaṅkhati: ‘paṭikūle appaṭikūlasaññī vihareyyan’ti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati: ‘appaṭikūle paṭikūlasaññī vihareyyan’ti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati: ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyyan’ti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati: ‘appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyyan’ti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati: ‘paṭikūlañca appaṭikūlañca tadubhayampi abhinivajjetvā upekkhako vihareyyaṁ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno. Evaṁ kho, ānanda, ariyo hoti bhāvitindriyo.",
    "mn152:12": "Iti kho, ānanda, desitā mayā ariyassa vinaye anuttarā indriyabhāvanā, desito sekho pāṭipado, desito ariyo bhāvitindriyo.",
    "mn152:13": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti.",
    "mn152:14": "Anāthapiṇḍiko channo,puṇṇo nandakarāhulā;Chachakkaṁ saḷāyatanikaṁ,nagaravindeyyasuddhikā;Indriyabhāvanā cāpi,vaggo ovādapañcamoti.",
    "mn152:15": "Devadahonupado ca,Suññato ca vibhaṅgako;Saḷāyatanoti vaggā,Uparipaṇṇāsake ṭhitāti."
}