{
    "mn17:1": "Evaṁ me sutaṁ — ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn17:2": "\"Idha, bhikkhave, bhikkhu aññataraṁ vanapatthaṁ upanissāya viharati. Tassa taṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti, asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāti. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te kasirena samudāgacchanti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṁ: ‘Ahaṁ kho imaṁ vanapatthaṁ upanissāya viharāmi, tassa me imaṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti, asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāmi. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te kasirena samudāgacchantī’ti. Tena, bhikkhave, bhikkhunā rattibhāgaṁ vā divasabhāgaṁ vā tamhā vanapatthā pakkamitabbaṁ, na vatthabbaṁ.",
    "mn17:3": "Idha pana, bhikkhave, bhikkhu aññataraṁ vanapatthaṁ upanissāya viharati. Tassa taṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti, asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāti. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te appakasirena samudāgacchanti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṁ: ‘Ahaṁ kho imaṁ vanapatthaṁ upanissāya viharāmi. Tassa me imaṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāmi. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te appakasirena samudāgacchanti. Na kho panāhaṁ cīvarahetu agārasmā anagāriyaṁ pabbajito na piṇḍapātahetu … pe … na senāsanahetu … pe … na gilānappaccayabhesajjaparikkhārahetu agārasmā anagāriyaṁ pabbajito. Atha ca pana me imaṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti, asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāmī’ti. Tena, bhikkhave, bhikkhunā saṅkhāpi tamhā vanapatthā pakkamitabbaṁ, na vatthabbaṁ.",
    "mn17:4": "Idha pana, bhikkhave, bhikkhu aññataraṁ vanapatthaṁ upanissāya viharati. Tassa taṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti, asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāti. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā, te kasirena samudāgacchanti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṁ: ‘Ahaṁ kho imaṁ vanapatthaṁ upanissāya viharāmi. Tassa me imaṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāmi. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te kasirena samudāgacchanti. Na kho panāhaṁ cīvarahetu agārasmā anagāriyaṁ pabbajito, na piṇḍapātahetu … pe … na senāsanahetu … pe … na gilānappaccayabhesajjaparikkhārahetu agārasmā anagāriyaṁ pabbajito. Atha ca pana me imaṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti, asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāmī’ti. Tena, bhikkhave, bhikkhunā saṅkhāpi tasmiṁ vanapatthe vatthabbaṁ, na pakkamitabbaṁ.",
    "mn17:5": "Idha pana, bhikkhave, bhikkhu aññataraṁ vanapatthaṁ upanissāya viharati. Tassa taṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti, asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāti. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te appakasirena samudāgacchanti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṁ: ‘Ahaṁ kho imaṁ vanapatthaṁ upanissāya viharāmi. Tassa me imaṁ vanapatthaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāmi. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te appakasirena samudāgacchantī’ti. Tena, bhikkhave, bhikkhunā yāvajīvampi tasmiṁ vanapatthe vatthabbaṁ, na pakkamitabbaṁ.",
    "mn17:6": "Idha, bhikkhave, bhikkhu aññataraṁ gāmaṁ upanissāya viharati … pe … aññataraṁ nigamaṁ upanissāya viharati … pe … aññataraṁ nagaraṁ upanissāya viharati … pe … aññataraṁ janapadaṁ upanissāya viharati … pe … aññataraṁ puggalaṁ upanissāya viharati. Tassa taṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti, asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāti. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te kasirena samudāgacchanti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṁ: ‘Ahaṁ kho imaṁ puggalaṁ upanissāya viharāmi. Tassa me imaṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti, asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāmi. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te kasirena samudāgacchantī’ti. Tena, bhikkhave, bhikkhunā rattibhāgaṁ vā divasabhāgaṁ vā so puggalo anāpucchā pakkamitabbaṁ, nānubandhitabbo.",
    "mn17:7": "Idha pana, bhikkhave, bhikkhu aññataraṁ puggalaṁ upanissāya viharati. Tassa taṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti, asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāti. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā, te appakasirena samudāgacchanti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṁ: ‘Ahaṁ kho imaṁ puggalaṁ upanissāya viharāmi. Tassa me imaṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti, asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāmi. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te appakasirena samudāgacchanti. Na kho panāhaṁ cīvarahetu agārasmā anagāriyaṁ pabbajito, na piṇḍapātahetu … pe … na senāsanahetu … pe … na gilānappaccayabhesajjaparikkhārahetu agārasmā anagāriyaṁ pabbajito. Atha ca pana me imaṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati na upaṭṭhāti, asamāhitañca cittaṁ na samādhiyati, aparikkhīṇā ca āsavā na parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ nānupāpuṇāmī’ti. Tena, bhikkhave, bhikkhunā saṅkhāpi so puggalo āpucchā pakkamitabbaṁ, nānubandhitabbo.",
    "mn17:8": "Idha pana, bhikkhave, bhikkhu aññataraṁ puggalaṁ upanissāya viharati. Tassa taṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti, asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāti. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te kasirena samudāgacchanti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṁ: ‘Ahaṁ kho imaṁ puggalaṁ upanissāya viharāmi. Tassa me imaṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti, asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāmi. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te kasirena samudāgacchanti. Na kho panāhaṁ cīvarahetu agārasmā anagāriyaṁ pabbajito, na piṇḍapātahetu … pe … na senāsanahetu … pe … na gilānappaccayabhesajjaparikkhārahetu agārasmā anagāriyaṁ pabbajito. Atha ca pana me imaṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti, asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāmī’ti. Tena, bhikkhave, bhikkhunā saṅkhāpi so puggalo anubandhitabbo, na pakkamitabbaṁ.",
    "mn17:9": "Idha pana, bhikkhave, bhikkhu aññataraṁ puggalaṁ upanissāya viharati. Tassa taṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti, asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāti. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te appakasirena samudāgacchanti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṁ: ‘Ahaṁ kho imaṁ puggalaṁ upanissāya viharāmi. Tassa me imaṁ puggalaṁ upanissāya viharato anupaṭṭhitā ceva sati upaṭṭhāti, asamāhitañca cittaṁ samādhiyati, aparikkhīṇā ca āsavā parikkhayaṁ gacchanti, ananuppattañca anuttaraṁ yogakkhemaṁ anupāpuṇāmi. Ye ca kho ime pabbajitena jīvitaparikkhārā samudānetabbā — cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārā — te appakasirena samudāgacchantī’ti. Tena, bhikkhave, bhikkhunā yāvajīvampi so puggalo anubandhitabbo, na pakkamitabbaṁ,api panujjamānenapī\"ti.",
    "mn17:10": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}