{
    "mn19:1": "Evaṁ me sutaṁ — ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn19:2": "\"Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi: ‘yannūnāhaṁ dvidhā katvā dvidhā katvā vitakke vihareyyan’ti. So kho ahaṁ, bhikkhave, yo cāyaṁ kāmavitakko yo ca byāpādavitakko yo ca vihiṁsāvitakko — imaṁ ekaṁ bhāgamakāsiṁ; yo cāyaṁ nekkhammavitakko yo ca abyāpādavitakko yo ca avihiṁsāvitakko — imaṁ dutiyaṁ bhāgamakāsiṁ.",
    "mn19:3": "Tassa mayhaṁ, bhikkhave, evaṁ appamattassa ātāpino pahitattassa viharato uppajjati kāmavitakko. So evaṁ pajānāmi: ‘uppanno kho me ayaṁ kāmavitakko. So ca kho attabyābādhāyapi saṁvattati, parabyābādhāyapi saṁvattati, ubhayabyābādhāyapi saṁvattati, paññānirodhiko vighātapakkhikoanibbānasaṁvattaniko’. ‘Attabyābādhāya saṁvattatī’tipi me, bhikkhave, paṭisañcikkhato abbhatthaṁ gacchati; ‘parabyābādhāya saṁvattatī’tipi me, bhikkhave, paṭisañcikkhato abbhatthaṁ gacchati; ‘ubhayabyābādhāya saṁvattatī’tipi me, bhikkhave, paṭisañcikkhato abbhatthaṁ gacchati; ‘paññānirodhiko vighātapakkhiko anibbānasaṁvattaniko’tipi me, bhikkhave, paṭisañcikkhato abbhatthaṁ gacchati. So kho ahaṁ, bhikkhave, uppannuppannaṁ kāmavitakkaṁpajahamevavinodamevabyantamevanaṁ akāsiṁ.",
    "mn19:4": "Tassa mayhaṁ, bhikkhave, evaṁ appamattassa ātāpino pahitattassa viharato uppajjati byāpādavitakko … pe … uppajjati vihiṁsāvitakko. So evaṁ pajānāmi: ‘uppanno kho me ayaṁ vihiṁsāvitakko. So ca kho attabyābādhāyapi saṁvattati, parabyābādhāyapi saṁvattati, ubhayabyābādhāyapi saṁvattati, paññānirodhiko vighātapakkhiko anibbānasaṁvattaniko’. ‘Attabyābādhāya saṁvattatī’tipi me, bhikkhave, paṭisañcikkhato abbhatthaṁ gacchati; ‘parabyābādhāya saṁvattatī’tipi me, bhikkhave, paṭisañcikkhato abbhatthaṁ gacchati; ‘ubhayabyābādhāya saṁvattatī’tipi me, bhikkhave, paṭisañcikkhato abbhatthaṁ gacchati; ‘paññānirodhiko vighātapakkhiko anibbānasaṁvattaniko’tipi me, bhikkhave, paṭisañcikkhato abbhatthaṁ gacchati. So kho ahaṁ, bhikkhave, uppannuppannaṁ vihiṁsāvitakkaṁ pajahameva vinodameva byantameva naṁ akāsiṁ.",
    "mn19:5": "Yaññadeva, bhikkhave, bhikkhu bahulamanuvitakketi anuvicāreti, tathā tathā nati hoti cetaso. Kāmavitakkañce, bhikkhave, bhikkhu bahulamanuvitakketi anuvicāreti, pahāsi nekkhammavitakkaṁ, kāmavitakkaṁ bahulamakāsi, tassa taṁ kāmavitakkāya cittaṁ namati. Byāpādavitakkañce, bhikkhave … pe … vihiṁsāvitakkañce, bhikkhave, bhikkhu bahulamanuvitakketi anuvicāreti, pahāsi avihiṁsāvitakkaṁ, vihiṁsāvitakkaṁ bahulamakāsi, tassa taṁ vihiṁsāvitakkāya cittaṁ namati.",
    "mn19:6": "Tassa mayhaṁ, bhikkhave, evaṁ appamattassa ātāpino pahitattassa viharato uppajjati nekkhammavitakko. So evaṁ pajānāmi: ‘uppanno kho me ayaṁ nekkhammavitakko. So ca kho nevattabyābādhāya saṁvattati, na parabyābādhāya saṁvattati, na ubhayabyābādhāya saṁvattati, paññāvuddhiko avighātapakkhiko nibbānasaṁvattaniko’. Rattiñcepi naṁ, bhikkhave, anuvitakkeyyaṁ anuvicāreyyaṁ, neva tatonidānaṁ bhayaṁ samanupassāmi. Divasañcepi naṁ, bhikkhave, anuvitakkeyyaṁ anuvicāreyyaṁ, neva tatonidānaṁ bhayaṁ samanupassāmi. Rattindivañcepi naṁ, bhikkhave, anuvitakkeyyaṁ anuvicāreyyaṁ, neva tatonidānaṁ bhayaṁ samanupassāmi. Api ca kho me aticiraṁ anuvitakkayato anuvicārayato kāyo kilameyya. Kāyekilantecittaṁ ūhaññeyya. Ūhate citte ārā cittaṁ samādhimhāti. So kho ahaṁ, bhikkhave, ajjhattameva cittaṁ saṇṭhapemisannisādemi ekodiṁ karomisamādahāmi. Taṁ kissa hetu? ‘Mā me cittaṁūhaññī’ti.",
    "mn19:7": "Tassa mayhaṁ, bhikkhave, evaṁ appamattassa ātāpino pahitattassa viharato uppajjati abyāpādavitakko … pe … uppajjati avihiṁsāvitakko. So evaṁ pajānāmi: ‘uppanno kho me ayaṁ avihiṁsāvitakko. So ca kho nevattabyābādhāya saṁvattati, na parabyābādhāya saṁvattati, na ubhayabyābādhāya saṁvattati, paññāvuddhiko avighātapakkhiko nibbānasaṁvattaniko’. Rattiñcepi naṁ, bhikkhave, anuvitakkeyyaṁ anuvicāreyyaṁ, neva tatonidānaṁ bhayaṁ samanupassāmi. Divasañcepi naṁ, bhikkhave, anuvitakkeyyaṁ anuvicāreyyaṁ, neva tatonidānaṁ bhayaṁ samanupassāmi. Rattindivañcepi naṁ, bhikkhave, anuvitakkeyyaṁ anuvicāreyyaṁ, neva tatonidānaṁ bhayaṁ samanupassāmi. Api ca kho me aticiraṁ anuvitakkayato anuvicārayato kāyo kilameyya. Kāye kilante cittaṁ ūhaññeyya. Ūhate citte ārā cittaṁ samādhimhāti. So kho ahaṁ, bhikkhave, ajjhattameva cittaṁ saṇṭhapemi, sannisādemi, ekodiṁ karomi samādahāmi. Taṁ kissa hetu? ‘Mā me cittaṁ ūhaññī’ti.",
    "mn19:8": "Yaññadeva, bhikkhave, bhikkhu bahulamanuvitakketi anuvicāreti, tathā tathā nati hoti cetaso. Nekkhammavitakkañce, bhikkhave, bhikkhu bahulamanuvitakketi anuvicāreti, pahāsi kāmavitakkaṁ, nekkhammavitakkaṁ bahulamakāsi, tassaṁ taṁ nekkhammavitakkāya cittaṁ namati. Abyāpādavitakkañce, bhikkhave … pe … avihiṁsāvitakkañce, bhikkhave, bhikkhu bahulamanuvitakketi anuvicāreti, pahāsi vihiṁsāvitakkaṁ, avihiṁsāvitakkaṁ bahulamakāsi, tassa taṁ avihiṁsāvitakkāya cittaṁ namati.",
    "mn19:9": "Āraddhaṁ kho pana me, bhikkhave, vīriyaṁ ahosi asallīnaṁ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṁ cittaṁ ekaggaṁ.",
    "mn19:10": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhininnāmesiṁ. So anekavihitaṁ pubbenivāsaṁ anussarāmi. Seyyathidaṁ — ekampi jātiṁ … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarāmi.",
    "mn19:11": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhininnāmesiṁ. So dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne … pe … ime vata bhonto sattā kāyaduccaritena samannāgatā … pe … iti dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāmi.",
    "mn19:12": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmesiṁ. So ‘idaṁ dukkhan’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ abbhaññāsiṁ. ‘Ime āsavā’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ āsavasamudayo’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ āsavanirodho’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ āsavanirodhagāminī paṭipadā’ti yathābhūtaṁ abbhaññāsiṁ.",
    "mn19:13": "Seyyathāpi, bhikkhave, araññe pavane mahantaṁ ninnaṁ pallalaṁ. Tamenaṁ mahāmigasaṅgho upanissāya vihareyya. Tassa kocideva puriso uppajjeyya anatthakāmo ahitakāmo ayogakkhemakāmo. So yvāssa maggo khemo sovatthiko pītigamanīyo taṁ maggaṁ pidaheyya, vivareyya kummaggaṁ, odaheyya okacaraṁ, ṭhapeyya okacārikaṁ. Evañhi so, bhikkhave, mahāmigasaṅgho aparena samayenaanayabyasanaṁāpajjeyya. Tasseva kho pana, bhikkhave, mahato migasaṅghassa kocideva puriso uppajjeyya atthakāmo hitakāmo yogakkhemakāmo. So yvāssa maggo khemo sovatthiko pītigamanīyo taṁ maggaṁ vivareyya, pidaheyya kummaggaṁ, ūhaneyya okacaraṁ, nāseyya okacārikaṁ. Evañhi so, bhikkhave, mahāmigasaṅgho aparena samayena vuddhiṁ virūḷhiṁ vepullaṁ āpajjeyya.",
    "mn19:14": "Upamā kho me ayaṁ, bhikkhave, katā atthassa viññāpanāya. Ayaṁ cevettha attho –  mahantaṁ ninnaṁ pallalanti kho, bhikkhave, kāmānametaṁ adhivacanaṁ. Mahāmigasaṅghoti kho, bhikkhave, sattānametaṁ adhivacanaṁ. Puriso anatthakāmo ahitakāmo ayogakkhemakāmoti kho, bhikkhave, mārassetaṁ pāpimato adhivacanaṁ. Kummaggoti kho, bhikkhave, aṭṭhaṅgikassetaṁ micchāmaggassa adhivacanaṁ, seyyathidaṁ — micchādiṭṭhiyā micchāsaṅkappassa micchāvācāya micchākammantassa micchāājīvassa micchāvāyāmassa micchāsatiyā micchāsamādhissa. Okacaroti kho, bhikkhave, nandīrāgassetaṁ adhivacanaṁ. Okacārikāti kho, bhikkhave, avijjāyetaṁ adhivacanaṁ. Puriso atthakāmo hitakāmo yogakkhemakāmoti kho, bhikkhave, tathāgatassetaṁ adhivacanaṁ arahato sammāsambuddhassa. Khemo maggo sovatthiko pītigamanīyoti kho, bhikkhave, ariyassetaṁ aṭṭhaṅgikassa maggassa adhivacanaṁ, seyyathidaṁ — sammādiṭṭhiyā sammāsaṅkappassa sammāvācāya sammākammantassa sammāājīvassa sammāvāyāmassa sammāsatiyā sammāsamādhissa.",
    "mn19:15": "Iti kho, bhikkhave, vivaṭo mayā khemo maggo sovatthiko pītigamanīyo, pihito kummaggo, ūhato okacaro, nāsitā okacārikā.",
    "mn19:16": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}