{
    "mn1:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā ukkaṭṭhāyaṁ viharati subhagavane sālarājamūle. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn1:2": "\"Idha, bhikkhave, assutavā puthujjano ariyānaṁ adassāvī ariyadhammassa akovido ariyadhamme avinīto, sappurisānaṁ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto —pathaviṁpathavito sañjānāti; pathaviṁ pathavito saññatvā pathaviṁ maññati, pathaviyā maññati, pathavito maññati, pathaviṁ meti maññati, pathaviṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(1)",
    "mn1:3": "Āpaṁ āpato sañjānāti; āpaṁ āpato saññatvā āpaṁ maññati, āpasmiṁ maññati, āpato maññati, āpaṁ meti maññati, āpaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(2)",
    "mn1:4": "Tejaṁ tejato sañjānāti; tejaṁ tejato saññatvā tejaṁ maññati, tejasmiṁ maññati, tejato maññati, tejaṁ meti maññati, tejaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(3)",
    "mn1:5": "Vāyaṁ vāyato sañjānāti; vāyaṁ vāyato saññatvā vāyaṁ maññati, vāyasmiṁ maññati, vāyato maññati, vāyaṁ meti maññati, vāyaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(4)",
    "mn1:6": "Bhūte bhūtato sañjānāti; bhūte bhūtato saññatvā bhūte maññati, bhūtesu maññati, bhūtato maññati, bhūte meti maññati, bhūte abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(5)",
    "mn1:7": "Deve devato sañjānāti; deve devato saññatvā deve maññati, devesu maññati, devato maññati, deve meti maññati, deve abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(6)",
    "mn1:8": "Pajāpatiṁ pajāpatito sañjānāti; pajāpatiṁ pajāpatito saññatvā pajāpatiṁ maññati, pajāpatismiṁ maññati, pajāpatito maññati, pajāpatiṁ meti maññati, pajāpatiṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(7)",
    "mn1:9": "Brahmaṁ brahmato sañjānāti; brahmaṁ brahmato saññatvā brahmaṁ maññati, brahmasmiṁ maññati, brahmato maññati, brahmaṁ meti maññati, brahmaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(8)",
    "mn1:10": "Ābhassare ābhassarato sañjānāti; ābhassare ābhassarato saññatvā ābhassare maññati, ābhassaresu maññati, ābhassarato maññati, ābhassare meti maññati, ābhassare abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(9)",
    "mn1:11": "Subhakiṇhe subhakiṇhato sañjānāti; subhakiṇhe subhakiṇhato saññatvā subhakiṇhe maññati, subhakiṇhesu maññati, subhakiṇhato maññati, subhakiṇhe meti maññati, subhakiṇhe abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(10)",
    "mn1:12": "Vehapphale vehapphalato sañjānāti; vehapphale vehapphalato saññatvā vehapphale maññati, vehapphalesu maññati, vehapphalato maññati, vehapphale meti maññati, vehapphale abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(11)",
    "mn1:13": "Abhibhuṁ abhibhuto sañjānāti; abhibhuṁ abhibhuto saññatvā abhibhuṁ maññati, abhibhusmiṁ maññati, abhibhuto maññati, abhibhuṁ meti maññati, abhibhuṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(12)",
    "mn1:14": "Ākāsānañcāyatanaṁ ākāsānañcāyatanato sañjānāti; ākāsānañcāyatanaṁ ākāsānañcāyatanato saññatvā ākāsānañcāyatanaṁ maññati, ākāsānañcāyatanasmiṁ maññati, ākāsānañcāyatanato maññati, ākāsānañcāyatanaṁ meti maññati, ākāsānañcāyatanaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(13)",
    "mn1:15": "Viññāṇañcāyatanaṁ viññāṇañcāyatanato sañjānāti; viññāṇañcāyatanaṁ viññāṇañcāyatanato saññatvā viññāṇañcāyatanaṁ maññati, viññāṇañcāyatanasmiṁ maññati, viññāṇañcāyatanato maññati, viññāṇañcāyatanaṁ meti maññati, viññāṇañcāyatanaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(14)",
    "mn1:16": "Ākiñcaññāyatanaṁ ākiñcaññāyatanato sañjānāti; ākiñcaññāyatanaṁ ākiñcaññāyatanato saññatvā ākiñcaññāyatanaṁ maññati, ākiñcaññāyatanasmiṁ maññati, ākiñcaññāyatanato maññati, ākiñcaññāyatanaṁ meti maññati, ākiñcaññāyatanaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(15)",
    "mn1:17": "Nevasaññānāsaññāyatanaṁ nevasaññānāsaññāyatanato sañjānāti; nevasaññānāsaññāyatanaṁ nevasaññānāsaññāyatanato saññatvā nevasaññānāsaññāyatanaṁ maññati, nevasaññānāsaññāyatanasmiṁ maññati, nevasaññānāsaññāyatanato maññati, nevasaññānāsaññāyatanaṁ meti maññati, nevasaññānāsaññāyatanaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(16)",
    "mn1:18": "Diṭṭhaṁ diṭṭhato sañjānāti; diṭṭhaṁ diṭṭhato saññatvā diṭṭhaṁ maññati, diṭṭhasmiṁ maññati, diṭṭhato maññati, diṭṭhaṁ meti maññati, diṭṭhaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(17)",
    "mn1:19": "Sutaṁ sutato sañjānāti; sutaṁ sutato saññatvā sutaṁ maññati, sutasmiṁ maññati, sutato maññati, sutaṁ meti maññati, sutaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(18)",
    "mn1:20": "Mutaṁ mutato sañjānāti; mutaṁ mutato saññatvā mutaṁ maññati, mutasmiṁ maññati, mutato maññati, mutaṁ meti maññati, mutaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(19)",
    "mn1:21": "Viññātaṁ viññātato sañjānāti; viññātaṁ viññātato saññatvā viññātaṁ maññati, viññātasmiṁ maññati, viññātato maññati, viññātaṁ meti maññati, viññātaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(20)",
    "mn1:22": "Ekattaṁ ekattato sañjānāti; ekattaṁ ekattato saññatvā ekattaṁ maññati, ekattasmiṁ maññati, ekattato maññati, ekattaṁ meti maññati, ekattaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(21)",
    "mn1:23": "Nānattaṁ nānattato sañjānāti; nānattaṁ nānattato saññatvā nānattaṁ maññati, nānattasmiṁ maññati, nānattato maññati, nānattaṁ meti maññati, nānattaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(22)",
    "mn1:24": "Sabbaṁ sabbato sañjānāti; sabbaṁ sabbato saññatvā sabbaṁ maññati, sabbasmiṁ maññati, sabbato maññati, sabbaṁ meti maññati, sabbaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(23)",
    "mn1:25": "Nibbānaṁ nibbānato sañjānāti; nibbānaṁ nibbānato saññatvā nibbānaṁ maññati, nibbānasmiṁ maññati, nibbānato maññati, nibbānaṁ meti maññati, nibbānaṁ abhinandati. Taṁ kissa hetu? ‘Apariññātaṁ tassā’ti vadāmi.(24)",
    "mn1:26": "Yopi so, bhikkhave, bhikkhusekkhoappattamānaso anuttaraṁ yogakkhemaṁ patthayamāno viharati, sopi pathaviṁ pathavito abhijānāti; pathaviṁ pathavitoabhiññāyapathaviṁ māmaññi, pathaviyā mā maññi, pathavito mā maññi, pathaviṁ meti mā maññi, pathaviṁmābhinandi. Taṁ kissa hetu? ‘Pariññeyyaṁ tassā’ti vadāmi.",
    "mn1:27": "Āpaṁ … pe … tejaṁ … vāyaṁ … bhūte … deve … pajāpatiṁ … brahmaṁ … ābhassare … subhakiṇhe … vehapphale … abhibhuṁ … ākāsānañcāyatanaṁ … viññāṇañcāyatanaṁ … ākiñcaññāyatanaṁ … nevasaññānāsaññāyatanaṁ … diṭṭhaṁ … sutaṁ … mutaṁ … viññātaṁ … ekattaṁ … nānattaṁ … sabbaṁ … nibbānaṁ nibbānato abhijānāti; nibbānaṁ nibbānato abhiññāya nibbānaṁ mā maññi, nibbānasmiṁ mā maññi, nibbānato mā maññi, nibbānaṁ meti mā maññi, nibbānaṁ mābhinandi. Taṁ kissa hetu? ‘Pariññeyyaṁ tassā’ti vadāmi.",
    "mn1:28": "Yopi so, bhikkhave, bhikkhu arahaṁ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṁyojano sammadaññāvimutto, sopi pathaviṁ pathavito abhijānāti; pathaviṁ pathavito abhiññāya pathaviṁ na maññati, pathaviyā na maññati, pathavito na maññati, pathaviṁ meti na maññati, pathaviṁ nābhinandati. Taṁ kissa hetu? ‘Pariññātaṁ tassā’ti vadāmi.",
    "mn1:29": "Āpaṁ … pe … tejaṁ … vāyaṁ … bhūte … deve … pajāpatiṁ … brahmaṁ … ābhassare … subhakiṇhe … vehapphale … abhibhuṁ … ākāsānañcāyatanaṁ … viññāṇañcāyatanaṁ … ākiñcaññāyatanaṁ … nevasaññānāsaññāyatanaṁ … diṭṭhaṁ … sutaṁ … mutaṁ … viññātaṁ … ekattaṁ … nānattaṁ … sabbaṁ … nibbānaṁ nibbānato abhijānāti; nibbānaṁ nibbānato abhiññāya nibbānaṁ na maññati, nibbānasmiṁ na maññati, nibbānato na maññati, nibbānaṁ meti na maññati, nibbānaṁ nābhinandati. Taṁ kissa hetu? ‘Pariññātaṁ tassā’ti vadāmi.",
    "mn1:30": "Yopi so, bhikkhave, bhikkhu arahaṁ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṁyojano sammadaññā vimutto, sopi pathaviṁ pathavito abhijānāti; pathaviṁ pathavito abhiññāya pathaviṁ na maññati, pathaviyā na maññati, pathavito na maññati, pathaviṁ meti na maññati, pathaviṁ nābhinandati. Taṁ kissa hetu? Khayā rāgassa, vītarāgattā.",
    "mn1:31": "Āpaṁ … pe … tejaṁ … vāyaṁ … bhūte … deve … pajāpatiṁ … brahmaṁ … ābhassare … subhakiṇhe … vehapphale … abhibhuṁ … ākāsānañcāyatanaṁ … viññāṇañcāyatanaṁ … ākiñcaññāyatanaṁ … nevasaññānāsaññāyatanaṁ … diṭṭhaṁ … sutaṁ … mutaṁ … viññātaṁ … ekattaṁ … nānattaṁ … sabbaṁ … nibbānaṁ nibbānato abhijānāti; nibbānaṁ nibbānato abhiññāya nibbānaṁ na maññati, nibbānasmiṁ na maññati, nibbānato na maññati, nibbānaṁ meti na maññati, nibbānaṁ nābhinandati. Taṁ kissa hetu? Khayā rāgassa, vītarāgattā.",
    "mn1:32": "Yopi so, bhikkhave, bhikkhu arahaṁ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṁyojano sammadaññāvimutto, sopi pathaviṁ pathavito abhijānāti; pathaviṁ pathavito abhiññāya pathaviṁ na maññati, pathaviyā na maññati, pathavito na maññati, pathaviṁ meti na maññati, pathaviṁ nābhinandati. Taṁ kissa hetu? Khayā dosassa, vītadosattā.",
    "mn1:33": "Āpaṁ … pe … tejaṁ … vāyaṁ … bhūte … deve … pajāpatiṁ … brahmaṁ … ābhassare … subhakiṇhe … vehapphale … abhibhuṁ … ākāsānañcāyatanaṁ … viññāṇañcāyatanaṁ … ākiñcaññāyatanaṁ … nevasaññānāsaññāyatanaṁ … diṭṭhaṁ … sutaṁ … mutaṁ … viññātaṁ … ekattaṁ … nānattaṁ … sabbaṁ … nibbānaṁ nibbānato abhijānāti; nibbānaṁ nibbānato abhiññāya nibbānaṁ na maññati, nibbānasmiṁ na maññati, nibbānato na maññati, nibbānaṁ meti na maññati, nibbānaṁ nābhinandati. Taṁ kissa hetu? Khayā dosassa, vītadosattā.",
    "mn1:34": "Yopi so, bhikkhave, bhikkhu arahaṁ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṁyojano sammadaññāvimutto, sopi pathaviṁ pathavito abhijānāti; pathaviṁ pathavito abhiññāya pathaviṁ na maññati, pathaviyā na maññati, pathavito na maññati, pathaviṁ meti na maññati, pathaviṁ nābhinandati. Taṁ kissa hetu? Khayā mohassa, vītamohattā.",
    "mn1:35": "Āpaṁ … pe … tejaṁ … vāyaṁ … bhūte … deve … pajāpatiṁ … brahmaṁ … ābhassare … subhakiṇhe … vehapphale … abhibhuṁ … ākāsānañcāyatanaṁ … viññāṇañcāyatanaṁ … ākiñcaññāyatanaṁ … nevasaññānāsaññāyatanaṁ … diṭṭhaṁ … sutaṁ … mutaṁ … viññātaṁ … ekattaṁ … nānattaṁ … sabbaṁ … nibbānaṁ nibbānato abhijānāti; nibbānaṁ nibbānato abhiññāya nibbānaṁ na maññati, nibbānasmiṁ na maññati, nibbānato na maññati, nibbānaṁ meti na maññati, nibbānaṁ nābhinandati. Taṁ kissa hetu? Khayā mohassa, vītamohattā.",
    "mn1:36": "Tathāgatopi, bhikkhave, arahaṁ sammāsambuddho pathaviṁ pathavito abhijānāti; pathaviṁ pathavito abhiññāya pathaviṁ na maññati, pathaviyā na maññati, pathavito na maññati, pathaviṁ meti na maññati, pathaviṁ nābhinandati. Taṁ kissa hetu? ‘Pariññātantaṁ tathāgatassā’ti vadāmi.",
    "mn1:37": "Āpaṁ … pe … tejaṁ … vāyaṁ … bhūte … deve … pajāpatiṁ … brahmaṁ … ābhassare … subhakiṇhe … vehapphale … abhibhuṁ … ākāsānañcāyatanaṁ … viññāṇañcāyatanaṁ … ākiñcaññāyatanaṁ … nevasaññānāsaññāyatanaṁ … diṭṭhaṁ … sutaṁ … mutaṁ … viññātaṁ … ekattaṁ … nānattaṁ … sabbaṁ … nibbānaṁ nibbānato abhijānāti; nibbānaṁ nibbānato abhiññāya nibbānaṁ na maññati, nibbānasmiṁ na maññati, nibbānato na maññati, nibbānaṁ meti na maññati, nibbānaṁ nābhinandati. Taṁ kissa hetu? ‘Pariññātantaṁ tathāgatassā’ti vadāmi.",
    "mn1:38": "Tathāgatopi, bhikkhave, arahaṁ sammāsambuddho pathaviṁ pathavito abhijānāti; pathaviṁ pathavito abhiññāya pathaviṁ na maññati, pathaviyā na maññati, pathavito na maññati, pathaviṁ meti na maññati, pathaviṁ nābhinandati. Taṁ kissa hetu? ‘Nandīdukkhassa mūlan’ti — iti viditvā ‘bhavā jāti bhūtassa jarāmaraṇan’ti. Tasmātiha, bhikkhave, ‘tathāgato sabbaso taṇhānaṁ khayā virāgā nirodhā cāgā paṭinissaggā anuttaraṁ sammāsambodhiṁ abhisambuddho’ti vadāmi.",
    "mn1:39": "Āpaṁ … pe … tejaṁ … vāyaṁ … bhūte … deve … pajāpatiṁ … brahmaṁ … ābhassare … subhakiṇhe … vehapphale … abhibhuṁ … ākāsānañcāyatanaṁ … viññāṇañcāyatanaṁ … ākiñcaññāyatanaṁ … nevasaññānāsaññāyatanaṁ … diṭṭhaṁ … sutaṁ … mutaṁ … viññātaṁ … ekattaṁ … nānattaṁ … sabbaṁ … nibbānaṁ nibbānato abhijānāti; nibbānaṁ nibbānato abhiññāya nibbānaṁ na maññati, nibbānasmiṁ na maññati, nibbānato na maññati, nibbānaṁ meti na maññati, nibbānaṁ nābhinandati. Taṁ kissa hetu? ‘Nandī dukkhassa mūlan’ti — iti viditvā ‘bhavā jāti bhūtassa jarāmaraṇan’ti. Tasmātiha, bhikkhave, ‘tathāgato sabbaso taṇhānaṁ khayā virāgā nirodhā cāgā paṭinissaggā anuttaraṁ sammāsambodhiṁ abhisambuddho’ti vadāmī\"ti.",
    "mn1:40": "Idamavoca bhagavā. Na te bhikkhūbhagavato bhāsitaṁ abhinandunti."
}