{
    "mn23:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā kumārakassapo andhavane viharati.",
    "mn23:2": "\"Bhikkhu bhikkhu, ayaṁvammikorattiṁ dhūmāyati, divā pajjalati.",
    "mn23:3": "Ime kho tvaṁ, bhikkhu, pañhe bhagavantaṁ upasaṅkamitvā puccheyyāsi, yathā ca te bhagavā byākaroti tathā naṁ dhāreyyāsi. Nāhaṁ taṁ, bhikkhu, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya, yo imesaṁ pañhānaṁ veyyākaraṇena cittaṁ ārādheyya aññatra tathāgatena vā, tathāgatasāvakena vā, ito vā pana sutvā\"ti —",
    "mn23:4": "Atha kho āyasmā kumārakassapo tassā rattiyā accayena yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā kumārakassapo bhagavantaṁ etadavoca: \"imaṁ, bhante, rattiṁ aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṁ andhavanaṁ obhāsetvā yenāhaṁ tenupasaṅkami; upasaṅkamitvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitā kho, bhante, sā devatā maṁ etadavoca: ‘bhikkhu bhikkhu, ayaṁ vammiko rattiṁ dhūmāyati, divā pajjalati. Brāhmaṇo evamāha: \"abhikkhaṇa, sumedha, satthaṁ ādāyā\"ti. Abhikkhaṇanto sumedho satthaṁ ādāya … pe … ito vā pana sutvā’ti. Idamavoca, bhante, sā devatā. Idaṁ vatvā tatthevantaradhāyi. Ko nu kho, bhante, vammiko, kā rattiṁ dhūmāyanā, kā divā pajjalanā, ko brāhmaṇo, ko sumedho, kiṁ satthaṁ, kiṁ abhikkhaṇaṁ, kā laṅgī, kā uddhumāyikā, ko dvidhāpatho, kiṁ caṅgavāraṁ, ko kummo, kā asisūnā, kā maṁsapesi, ko nāgo\"ti?",
    "mn23:5": "\"‘Vammiko’ti kho, bhikkhu, imassetaṁcātumahābhūtikassakāyassa adhivacanaṁ, mātāpettikasambhavassa odanakummāsūpacayassa aniccucchādanaparimaddanabhedanaviddhaṁsanadhammassa.(1)",
    "mn23:6": "Yaṁ kho, bhikkhu, divākammanteārabbha rattiṁ anuvitakketi anuvicāreti — ayaṁ rattiṁ dhūmāyanā.",
    "mn23:7": "‘Brāhmaṇo’ti kho, bhikkhu, tathāgatassetaṁ adhivacanaṁ arahato sammāsambuddhassa. ‘Sumedho’ti kho, bhikkhu, sekkhassetaṁ bhikkhuno adhivacanaṁ. (4–5.)",
    "mn23:8": "‘Satthan’ti kho, bhikkhu, ariyāyetaṁ paññāya adhivacanaṁ. ‘Abhikkhaṇan’ti kho, bhikkhu, vīriyārambhassetaṁ adhivacanaṁ. (6–7.)",
    "mn23:9": "‘Laṅgī’ti kho, bhikkhu, avijjāyetaṁ adhivacanaṁ. Ukkhipa laṅgiṁ, pajaha avijjaṁ; abhikkhaṇa, sumedha, satthaṁ ādāyāti ayametassa attho.(8)",
    "mn23:10": "‘Uddhumāyikā’ti kho, bhikkhu, kodhūpāyāsassetaṁ adhivacanaṁ. Ukkhipa uddhumāyikaṁ, pajaha kodhūpāyāsaṁ; abhikkhaṇa, sumedha, satthaṁ ādāyāti ayametassa attho.(9)",
    "mn23:11": "‘Dvidhāpatho’ti kho, bhikkhu, vicikicchāyetaṁ adhivacanaṁ. Ukkhipa dvidhāpathaṁ, pajaha vicikicchaṁ; abhikkhaṇa, sumedha, satthaṁ ādāyāti ayametassa attho.(10)",
    "mn23:12": "‘Caṅgavāran’ti kho, bhikkhu, pañcannetaṁ nīvaraṇānaṁ adhivacanaṁ, seyyathidaṁ — kāmacchandanīvaraṇassa, byāpādanīvaraṇassa, thinamiddhanīvaraṇassa, uddhaccakukkuccanīvaraṇassa, vicikicchānīvaraṇassa. Ukkhipa caṅgavāraṁ, pajaha pañca nīvaraṇe; abhikkhaṇa, sumedha, satthaṁ ādāyāti ayametassa attho.(11)",
    "mn23:13": "‘Kummo’ti kho, bhikkhu, pañcannetaṁ upādānakkhandhānaṁ adhivacanaṁ, seyyathidaṁ — rūpupādānakkhandhassa, vedanupādānakkhandhassa, saññupādānakkhandhassa, saṅkhārupādānakkhandhassa, viññāṇupādānakkhandhassa. Ukkhipa kummaṁ, pajaha pañcupādānakkhandhe; abhikkhaṇa, sumedha, satthaṁ ādāyāti ayametassa attho.(12)",
    "mn23:14": "‘Asisūnā’ti kho, bhikkhu, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ — cakkhuviññeyyānaṁ rūpānaṁ iṭṭhānaṁ kantānaṁ manāpānaṁ piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, sotaviññeyyānaṁ saddānaṁ … pe … ghānaviññeyyānaṁ gandhānaṁ … pe … jivhāviññeyyānaṁ rasānaṁ … pe … kāyaviññeyyānaṁ phoṭṭhabbānaṁ iṭṭhānaṁ kantānaṁ manāpānaṁ piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. Ukkhipa asisūnaṁ, pajaha pañca kāmaguṇe; abhikkhaṇa, sumedha, satthaṁ ādāyāti ayametassa attho.(13)",
    "mn23:15": "‘Maṁsapesī’ti kho, bhikkhu, nandīrāgassetaṁ adhivacanaṁ. Ukkhipa maṁsapesiṁ, pajaha nandīrāgaṁ; abhikkhaṇa, sumedha, satthaṁ ādāyāti ayametassa attho.(14)",
    "mn23:16": "‘Nāgo’ti kho, bhikkhu, khīṇāsavassetaṁ bhikkhuno adhivacanaṁ. Tiṭṭhatu nāgo, mā nāgaṁ ghaṭṭesi; namo karohi nāgassāti ayametassa attho\"ti.(15)",
    "mn23:17": "Idamavoca bhagavā. Attamano āyasmā kumārakassapo bhagavato bhāsitaṁ abhinandīti."
}