{
    "mn27:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn27:2": "\"Handa kuto nu bhavaṁ vacchāyano āgacchati divādivassā\"ti?",
    "mn27:3": "\"Ito hi kho ahaṁ, bho, āgacchāmi samaṇassa gotamassa santikā\"ti.",
    "mn27:4": "\"Taṁ kiṁ maññati bhavaṁ vacchāyano samaṇassa gotamassa paññāveyyattiyaṁ paṇḍito maññe\"ti.",
    "mn27:5": "\"Ko cāhaṁ, bho, ko ca samaṇassa gotamassa paññāveyyattiyaṁ jānissāmi. Sopi nūnassa tādisova yo samaṇassa gotamassa paññāveyyattiyaṁ jāneyyā\"ti.",
    "mn27:6": "\"Uḷārāya khalu bhavaṁ vacchāyano samaṇaṁ gotamaṁ pasaṁsāya pasaṁsatī\"ti.",
    "mn27:7": "\"Ko cāhaṁ, bho, ko ca samaṇaṁ gotamaṁ pasaṁsissāmi, pasatthapasatthova so bhavaṁ gotamo seṭṭho devamanussānan\"ti.",
    "mn27:8": "\"Kaṁ pana bhavaṁ vacchāyano atthavasaṁ sampassamāno samaṇe gotame evaṁabhippasanno\"ti?",
    "mn27:9": "\"Seyyathāpi, bho, kusalo nāgavaniko nāgavanaṁ paviseyya. So passeyya nāgavane mahantaṁ hatthipadaṁ, dīghato ca āyataṁ, tiriyañca vitthataṁ. So niṭṭhaṁ gaccheyya: ‘mahā vata bho nāgo’ti. Evameva kho ahaṁ, bho, yato addasaṁ samaṇe gotame cattāri padāni athāhaṁ niṭṭhamagamaṁ: ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno bhagavato sāvakasaṅgho’ti.",
    "mn27:10": "Katamāni cattāri? Idhāhaṁ, bho, passāmi ekacce khattiyapaṇḍite nipuṇe kataparappavāde vālavedhirūpe, tebhindantāmaññe caranti paññāgatena diṭṭhigatāni. Te suṇanti: ‘samaṇo khalu, bho, gotamo amukaṁ nāma gāmaṁ vā nigamaṁ vā osarissatī’ti. Te pañhaṁ abhisaṅkharonti: ‘imaṁ mayaṁ pañhaṁ samaṇaṁ gotamaṁ upasaṅkamitvā pucchissāma. Evañce no puṭṭho evaṁ byākarissati, evamassa mayaṁ vādaṁ āropessāma. Evañcepi no puṭṭho evaṁ byākarissati, evampissa mayaṁ vādaṁ āropessāmā’ti.",
    "mn27:11": "Puna caparāhaṁ, bho, passāmi idhekacce brāhmaṇapaṇḍite … pe …",
    "mn27:12": "Yato kho ahaṁ, bho, samaṇe gotame imāni cattāri padāni addasaṁ athāhaṁ niṭṭhamagamaṁ: ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno bhagavato sāvakasaṅgho’\"ti.",
    "mn27:13": "Evaṁ vutte, jāṇussoṇi brāhmaṇo sabbasetā vaḷavābhirathā orohitvā ekaṁsaṁ uttarāsaṅgaṁ karitvā yena bhagavā tenañjaliṁ paṇāmetvā tikkhattuṁ udānaṁ udānesi:",
    "mn27:14": "\"Namo tassa bhagavato arahato sammāsambuddhassa;",
    "mn27:15": "namo tassa bhagavato arahato sammāsambuddhassa;",
    "mn27:16": "namo tassa bhagavato arahato sammāsambuddhassāti.",
    "mn27:17": "Appeva nāma mayampi kadāci karahaci tena bhotā gotamena saddhiṁ samāgaccheyyāma, appeva nāma siyā kocideva kathāsallāpo\"ti.",
    "mn27:18": "Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho jāṇussoṇi brāhmaṇo yāvatako ahosi pilotikena paribbājakena saddhiṁ kathāsallāpo taṁ sabbaṁ bhagavato ārocesi. Evaṁ vutte, bhagavā jāṇussoṇiṁ brāhmaṇaṁ etadavoca: \"na kho, brāhmaṇa, ettāvatā hatthipadopamo vitthārena paripūro hoti. Api ca, brāhmaṇa, yathā hatthipadopamo vitthārena paripūro hoti taṁ suṇāhi, sādhukaṁ manasi karohi, bhāsissāmī\"ti. \"Evaṁ, bho\"ti kho jāṇussoṇi brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca:",
    "mn27:19": "\"Seyyathāpi, brāhmaṇa, nāgavaniko nāgavanaṁ paviseyya. So passeyya nāgavane mahantaṁ hatthipadaṁ, dīghato ca āyataṁ, tiriyañca vitthataṁ. Yo hoti kusalo nāgavaniko neva tāva niṭṭhaṁ gacchati: ‘mahā vata bho nāgo’ti. Taṁ kissa hetu? Santi hi, brāhmaṇa, nāgavane vāmanikā nāma hatthiniyo mahāpadā, tāsaṁ petaṁ padaṁ assāti.",
    "mn27:20": "So tamanugacchati. Tamanugacchanto passati nāgavane mahantaṁ hatthipadaṁ, dīghato ca āyataṁ, tiriyañca vitthataṁ, uccā ca nisevitaṁ. Yo hoti kusalo nāgavaniko neva tāva niṭṭhaṁ gacchati: ‘mahā vata bho nāgo’ti. Taṁ kissa hetu? Santi hi, brāhmaṇa, nāgavane uccā kāḷārikā nāma hatthiniyo mahāpadā, tāsaṁ petaṁ padaṁ assāti.",
    "mn27:21": "So tamanugacchati. Tamanugacchanto passati nāgavane mahantaṁ hatthipadaṁ, dīghato ca āyataṁ, tiriyañca vitthataṁ, uccā ca nisevitaṁ, uccā ca dantehi ārañjitāni. Yo hoti kusalo nāgavaniko neva tāva niṭṭhaṁ gacchati: ‘mahā vata bho nāgo’ti. Taṁ kissa hetu? Santi hi, brāhmaṇa, nāgavane uccā kaṇerukā nāma hatthiniyo mahāpadā, tāsaṁ petaṁ padaṁ assāti.",
    "mn27:22": "So tamanugacchati. Tamanugacchanto passati nāgavane mahantaṁ hatthipadaṁ, dīghato ca āyataṁ, tiriyañca vitthataṁ, uccā ca nisevitaṁ, uccā ca dantehi ārañjitāni, uccā ca sākhābhaṅgaṁ. Tañca nāgaṁ passati rukkhamūlagataṁ vā abbhokāsagataṁ vā gacchantaṁ vā tiṭṭhantaṁ vā nisinnaṁ vā nipannaṁ vā. So niṭṭhaṁ gacchati: ‘ayameva so mahānāgo’ti.",
    "mn27:23": "Evameva kho, brāhmaṇa, idha tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ; kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. Taṁ dhammaṁ suṇāti gahapati vā gahapatiputto vā aññatarasmiṁ vā kule paccājāto.",
    "mn27:24": "So evaṁ pabbajito samāno bhikkhūnaṁ sikkhāsājīvasamāpanno pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti, nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati.",
    "mn27:25": "Adinnādānaṁ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī. Athenena sucibhūtena attanā viharati.",
    "mn27:26": "Abrahmacariyaṁ pahāya brahmacārī hoti ārācārī virato methunā gāmadhammā.",
    "mn27:27": "Musāvādaṁ pahāya musāvādā paṭivirato hoti saccavādī saccasandhothetopaccayiko avisaṁvādako lokassa.",
    "mn27:28": "Pisuṇaṁ vācaṁpahāya pisuṇāya vācāya paṭivirato hoti, ito sutvā na amutra akkhātā imesaṁ bhedāya, amutra vā sutvā na imesaṁ akkhātā amūsaṁ bhedāya. Iti bhinnānaṁ vā sandhātā sahitānaṁ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṁ vācaṁ bhāsitā hoti.",
    "mn27:29": "Pharusaṁ vācaṁ pahāyapharusāya vācāyapaṭivirato hoti. Yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṁ vācaṁ bhāsitā hoti.",
    "mn27:30": "Samphappalāpaṁ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṁ vācaṁ bhāsitā kālena sāpadesaṁ pariyantavatiṁ atthasaṁhitaṁ.",
    "mn27:31": "So bījagāmabhūtagāmasamārambhā paṭivirato hoti, ekabhattiko hoti rattūparato, virato vikālabhojanā, naccagītavāditavisūkadassanā paṭivirato hoti, mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti, uccāsayanamahāsayanā paṭivirato hoti, jātarūparajatapaṭiggahaṇā paṭivirato hoti, āmakadhaññapaṭiggahaṇā paṭivirato hoti, āmakamaṁsapaṭiggahaṇā paṭivirato hoti, itthikumārikapaṭiggahaṇā paṭivirato hoti, dāsidāsapaṭiggahaṇā paṭivirato hoti, ajeḷakapaṭiggahaṇā paṭivirato hoti, kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti, hatthigavāssavaḷavapaṭiggahaṇā paṭivirato hoti, khettavatthupaṭiggahaṇā paṭivirato hoti, dūteyyapahiṇagamanānuyogā paṭivirato hoti, kayavikkayā paṭivirato hoti, tulākūṭakaṁsakūṭamānakūṭā paṭivirato hoti, ukkoṭanavañcananikatisāciyogā paṭivirato hoti,chedanavadhbandhanaviparāmosaālopasahasākārāpaṭiviratohoti.",
    "mn27:32": "So santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati samādāyeva pakkamati. Seyyathāpi nāma pakkhī sakuṇo yena yeneva ḍeti sapattabhārova ḍeti; evameva bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati samādāyeva pakkamati. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṁ anavajjasukhaṁ paṭisaṁvedeti.",
    "mn27:33": "So cakkhunā rūpaṁ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ tassa saṁvarāya paṭipajjati, rakkhati cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjati. Sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … jivhāya rasaṁ sāyitvā … kāyena phoṭṭhabbaṁ phusitvā … manasā dhammaṁ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ tassa saṁvarāya paṭipajjati, rakkhati manindriyaṁ, manindriye saṁvaraṁ āpajjati. So iminā ariyena indriyasaṁvarena samannāgato ajjhattaṁ abyāsekasukhaṁ paṭisaṁvedeti.",
    "mn27:34": "So abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti.",
    "mn27:35": "So iminā ca ariyena sīlakkhandhena samannāgato,imāya ca ariyāya santuṭṭhiyā samannāgatoiminā ca ariyena indriyasaṁvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ.",
    "mn27:36": "So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. Idampi vuccati, brāhmaṇa, tathāgatapadaṁ itipi, tathāgatanisevitaṁ itipi, tathāgatārañjitaṁ itipi. Na tveva tāva ariyasāvako niṭṭhaṁ gacchati: ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno bhagavato sāvakasaṅgho’ti.",
    "mn27:37": "Puna caparaṁ, brāhmaṇa, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. Idampi vuccati, brāhmaṇa … pe … suppaṭipanno bhagavato sāvakasaṅgho’ti.",
    "mn27:38": "Puna caparaṁ, brāhmaṇa, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti ‘upekkhako satimā sukhavihārī’ti tatiyaṁ jhānaṁ upasampajja viharati. Idampi vuccati, brāhmaṇa … pe … suppaṭipanno bhagavato sāvakasaṅgho’ti.",
    "mn27:39": "Puna caparaṁ, brāhmaṇa, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṁ atthaṅgamā, adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. Idampi vuccati, brāhmaṇa, tathāgatapadaṁ itipi, tathāgatanisevitaṁ itipi, tathāgatārañjitaṁ itipi. Na tveva tāva ariyasāvako niṭṭhaṁ gacchati: ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno bhagavato sāvakasaṅgho’ti.",
    "mn27:40": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhininnāmeti. So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ — ekampi jātiṁ, dvepi jātiyo … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. Idampi vuccati, brāhmaṇa, tathāgatapadaṁ itipi, tathāgatanisevitaṁ itipi, tathāgatārañjitaṁ itipi. Na tveva tāva ariyasāvako niṭṭhaṁ gacchati: ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno bhagavato sāvakasaṅgho’ti.",
    "mn27:41": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena … pe … yathākammūpage satte pajānāti. Idampi vuccati, brāhmaṇa, tathāgatapadaṁ itipi, tathāgatanisevitaṁ itipi, tathāgatārañjitaṁ itipi. Na tveva tāva ariyasāvako niṭṭhaṁ gacchati: ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno bhagavato sāvakasaṅgho’ti.",
    "mn27:42": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmeti. So ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti. ‘Ime āsavā’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti.",
    "mn27:43": "Tassa evaṁ jānato evaṁ passato kāmāsavāpi cittaṁ vimuccati, bhavāsavāpi cittaṁ vimuccati, avijjāsavāpi cittaṁ vimuccati. Vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti.",
    "mn27:44": "Evaṁ vutte, jāṇussoṇi brāhmaṇo bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi, dhammañca, bhikkhusaṅghañca. Upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}