{
    "mn32:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā gosiṅgasālavanadāye viharati sambahulehi abhiññātehi abhiññātehi therehi sāvakehi saddhiṁ — āyasmatā ca sāriputtena āyasmatā ca mahāmoggallānena āyasmatā ca mahākassapena āyasmatā ca anuruddhena āyasmatā ca revatena āyasmatā ca ānandena, aññehi ca abhiññātehi abhiññātehi therehi sāvakehi saddhiṁ.",
    "mn32:2": "Addasā kho āyasmā sāriputto āyasmantañca revataṁ āyasmantañca ānandaṁ dūratova āgacchante. Disvāna āyasmantaṁ ānandaṁ etadavoca: \"etu kho āyasmā ānando. Svāgataṁ āyasmato ānandassa bhagavato upaṭṭhākassa bhagavato santikāvacarassa. Ramaṇīyaṁ, āvuso ānanda, gosiṅgasālavanaṁ, dosinā ratti,sabbaphāliphullāsālā, dibbā, maññe, gandhā sampavanti; kathaṁrūpena, āvuso ānanda, bhikkhunā gosiṅgasālavanaṁ sobheyyā\"ti?",
    "mn32:3": "Evaṁ vutte, āyasmā sāriputto āyasmantaṁ revataṁ etadavoca: \"byākataṁ kho, āvuso revata, āyasmatā ānandena yathāsakaṁ paṭibhānaṁ. Tattha dāni mayaṁ āyasmantaṁ revataṁ pucchāma: ‘ramaṇīyaṁ, āvuso revata, gosiṅgasālavanaṁ, dosinā ratti, sabbaphāliphullā sālā, dibbā, maññe, gandhā sampavanti; kathaṁrūpena, āvuso revata, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti?",
    "mn32:4": "Evaṁ vutte, āyasmā sāriputto āyasmantaṁ anuruddhaṁ etadavoca: \"byākataṁ kho, āvuso anuruddha, āyasmatā revatena yathāsakaṁ paṭibhānaṁ. Tattha dāni mayaṁ āyasmantaṁ anuruddhaṁ pucchāma: ‘ramaṇīyaṁ, āvuso anuruddha, gosiṅgasālavanaṁ, dosinā ratti, sabbaphāliphullā sālā, dibbā, maññe, gandhā sampavanti; kathaṁrūpena, āvuso anuruddha, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti?",
    "mn32:5": "Evaṁ vutte, āyasmā sāriputto āyasmantaṁ mahākassapaṁ etadavoca: \"byākataṁ kho, āvuso kassapa, āyasmatā anuruddhena yathāsakaṁ paṭibhānaṁ. Tattha dāni mayaṁ āyasmantaṁ mahākassapaṁ pucchāma: ‘ramaṇīyaṁ, āvuso kassapa, gosiṅgasālavanaṁ, dosinā ratti, sabbaphāliphullā sālā, dibbā, maññe, gandhā sampavanti; kathaṁrūpena, āvuso kassapa, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti?",
    "mn32:6": "Evaṁ vutte, āyasmā sāriputto āyasmantaṁ mahāmoggallānaṁ etadavoca: \"byākataṁ kho, āvuso moggallāna, āyasmatā mahākassapena yathāsakaṁ paṭibhānaṁ. Tattha dāni mayaṁ āyasmantaṁ mahāmoggallānaṁ pucchāma: ‘ramaṇīyaṁ, āvuso moggallāna, gosiṅgasālavanaṁ, dosinā ratti, sabbaphāliphullā sālā, dibbā, maññe, gandhā sampavanti; kathaṁrūpena, āvuso moggallāna, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti?",
    "mn32:7": "Atha kho āyasmā mahāmoggallāno āyasmantaṁ sāriputtaṁ etadavoca: \"byākataṁ kho, āvuso sāriputta, amhehi sabbeheva yathāsakaṁ paṭibhānaṁ. Tattha dāni mayaṁ āyasmantaṁ sāriputtaṁ pucchāma: ‘ramaṇīyaṁ, āvuso sāriputta, gosiṅgasālavanaṁ, dosinā ratti, sabbaphāliphullā sālā, dibbā, maññe, gandhā sampavanti; kathaṁrūpena, āvuso sāriputta, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti?",
    "mn32:8": "Atha kho āyasmā sāriputto te āyasmante etadavoca: \"byākataṁ kho, āvuso, amhehi sabbeheva yathāsakaṁ paṭibhānaṁ. Āyāmāvuso, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā etamatthaṁ bhagavato ārocessāma. Yathā no bhagavā byākarissati tathā naṁ dhāressāmā\"ti. \"Evamāvuso\"ti kho te āyasmanto āyasmato sāriputtassa paccassosuṁ. Atha kho te āyasmanto yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinno kho āyasmā sāriputto bhagavantaṁ etadavoca:",
    "mn32:9": "\"Evaṁ vutte, ahaṁ, bhante, āyasmantaṁ revataṁ etadavocaṁ: ‘byākataṁ kho, āvuso revata, āyasmatā ānandena yathāsakaṁ paṭibhānaṁ. Tattha dāni mayaṁ āyasmantaṁ revataṁ pucchāma — ramaṇīyaṁ, āvuso revata, gosiṅgasālavanaṁ, dosinā ratti, sabbaphāliphullā sālā, dibbā maññe gandhā sampavanti. Kathaṁrūpena, āvuso revata, bhikkhunā gosiṅgasālavanaṁ sobheyyā’ti? Evaṁ vutte, bhante, āyasmā revato maṁ etadavoca: ‘idhāvuso sāriputta, bhikkhu paṭisallānārāmo hoti paṭisallānarato, ajjhattaṁ cetosamathamanuyutto, anirākatajjhāno, vipassanāya samannāgato, brūhetā suññāgārānaṁ. Evarūpena kho, āvuso sāriputta, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti.",
    "mn32:10": "\"Evaṁ vutte, ahaṁ, bhante, āyasmantaṁ anuruddhaṁ etadavocaṁ: ‘byākataṁ kho, āvuso anuruddha, āyasmatā revatena … pe … kathaṁrūpena, āvuso anuruddha, bhikkhunā gosiṅgasālavanaṁ sobheyyā’ti. Evaṁ vutte, bhante, āyasmā anuruddho maṁ etadavoca: ‘idhāvuso sāriputta, bhikkhu dibbena cakkhunā visuddhena atikkantamānusakena sahassaṁ lokānaṁ voloketi. Seyyathāpi, āvuso sāriputta, cakkhumā puriso … pe … evarūpena kho, āvuso sāriputta, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti.",
    "mn32:11": "\"Evaṁ vutte, ahaṁ, bhante, āyasmantaṁ mahākassapaṁ etadavocaṁ: ‘byākataṁ kho, āvuso kassapa, āyasmatā anuruddhena yathāsakaṁ paṭibhānaṁ. Tattha dāni mayaṁ āyasmantaṁ mahākassapaṁ pucchāma … pe … kathaṁrūpena kho, āvuso kassapa, bhikkhunā gosiṅgasālavanaṁ sobheyyā’ti? Evaṁ vutte, bhante, āyasmā mahākassapo maṁ etadavoca: ‘idhāvuso sāriputta, bhikkhu attanā ca āraññiko hoti āraññikattassa ca vaṇṇavādī, attanā ca piṇḍapātiko hoti … pe … attanā ca paṁsukūliko hoti … pe … attanā ca tecīvariko hoti … pe … attanā ca appiccho hoti … pe … attanā ca santuṭṭho hoti … pe … attanā ca pavivitto hoti … pe … attanā ca asaṁsaṭṭho hoti … pe … attanā ca āraddhavīriyo hoti … pe … attanā ca sīlasampanno hoti … pe … attanā ca samādhisampanno hoti … pe … attanā ca paññāsampanno hoti … attanā ca vimuttisampanno hoti … attanā ca vimuttiñāṇadassanasampanno hoti vimuttiñāṇadassanasampadāya ca vaṇṇavādī. Evarūpena kho, āvuso sāriputta, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti.",
    "mn32:12": "\"Evaṁ vutte, ahaṁ bhante āyasmantaṁ mahāmoggallānaṁ etadavocaṁ: ‘byākataṁ kho, āvuso moggallāna, āyasmatā mahākassapena yathāsakaṁ paṭibhānaṁ. Tattha dāni mayaṁ āyasmantaṁ mahāmoggallānaṁ pucchāma … pe … kathaṁrūpena, āvuso moggallāna, bhikkhunā gosiṅgasālavanaṁ sobheyyā’ti? Evaṁ vutte, bhante, āyasmā mahāmoggallāno maṁ etadavoca: ‘idhāvuso sāriputta, dve bhikkhū abhidhammakathaṁ kathenti. Te aññamaññaṁ pañhaṁ pucchanti, aññamaññassa pañhaṁ puṭṭhā vissajjenti, no ca saṁsādenti, dhammī ca nesaṁ kathā pavattinī hoti. Evarūpena kho, āvuso sāriputta, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti.",
    "mn32:13": "Evaṁ vutte, āyasmā mahāmoggallāno bhagavantaṁ etadavoca: \"atha khvāhaṁ, bhante, āyasmantaṁ sāriputtaṁ etadavocaṁ: ‘byākataṁ kho, āvuso sāriputta, amhehi sabbeheva yathāsakaṁ paṭibhānaṁ. Tattha dāni mayaṁ āyasmantaṁ sāriputtaṁ pucchāma — ramaṇīyaṁ, āvuso sāriputta, gosiṅgasālavanaṁ, dosinā ratti, sabbaphāliphullā sālā, dibbā, maññe, gandhā sampavanti. Kathaṁrūpena, āvuso sāriputta, bhikkhunā gosiṅgasālavanaṁ sobheyyā’ti? Evaṁ vutte, bhante, āyasmā sāriputto maṁ etadavoca: ‘idhāvuso moggallāna, bhikkhu cittaṁ vasaṁ vatteti no ca bhikkhu cittassa vasena vattati. So yāya vihārasamāpattiyā ākaṅkhati pubbaṇhasamayaṁ viharituṁ, tāya vihārasamāpattiyā pubbaṇhasamayaṁ viharati; yāya vihārasamāpattiyā ākaṅkhati majjhanhikasamayaṁ viharituṁ, tāya vihārasamāpattiyā majjhanhikasamayaṁ viharati; yāya vihārasamāpattiyā ākaṅkhati sāyanhasamayaṁ viharituṁ, tāya vihārasamāpattiyā sāyanhasamayaṁ viharati. Seyyathāpi, āvuso moggallāna, rañño vā rājamahāmattassa vā nānārattānaṁ dussānaṁ dussakaraṇḍako pūro assa. So yaññadeva dussayugaṁ ākaṅkheyya pubbaṇhasamayaṁ pārupituṁ, taṁ tadeva dussayugaṁ pubbaṇhasamayaṁ pārupeyya; yaññadeva dussayugaṁ ākaṅkheyya majjhanhikasamayaṁ pārupituṁ, taṁ tadeva dussayugaṁ majjhanhikasamayaṁ pārupeyya; yaññadeva dussayugaṁ ākaṅkheyya sāyanhasamayaṁ pārupituṁ, taṁ tadeva dussayugaṁ sāyanhasamayaṁ pārupeyya. Evameva kho, āvuso moggallāna, bhikkhu cittaṁ vasaṁ vatteti, no ca bhikkhu cittassa vasena vattati. So yāya vihārasamāpattiyā ākaṅkhati pubbaṇhasamayaṁ viharituṁ, tāya vihārasamāpattiyā pubbaṇhasamayaṁ viharati; yāya vihārasamāpattiyā ākaṅkhati majjhanhikasamayaṁ viharituṁ, tāya vihārasamāpattiyā majjhanhikasamayaṁ viharati; yāya vihārasamāpattiyā ākaṅkhati sāyanhasamayaṁ viharituṁ, tāya vihārasamāpattiyā sāyanhasamayaṁ viharati. Evarūpena kho, āvuso moggallāna, bhikkhunā gosiṅgasālavanaṁ sobheyyā’\"ti.",
    "mn32:14": "Evaṁ vutte, āyasmā sāriputto bhagavantaṁ etadavoca: \"kassa nu kho, bhante, subhāsitan\"ti? \"Sabbesaṁ vo, sāriputta, subhāsitaṁ pariyāyena. Api ca mamapi suṇātha yathārūpena bhikkhunā gosiṅgasālavanaṁ sobheyya. Idha, sāriputta, bhikkhu pacchābhattaṁ piṇḍapātapaṭikkanto nisīdati pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā: ‘Na tāvāhaṁ imaṁ pallaṅkaṁ bhindissāmi yāva me nānupādāya āsavehi cittaṁ vimuccissatī’ti. Evarūpena kho, sāriputta, bhikkhunā gosiṅgasālavanaṁ sobheyyā\"ti."
}