{
    "mn35:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā vesāliyaṁ viharati mahāvane kūṭāgārasālāyaṁ.",
    "mn35:2": "Atha kho āyasmā assaji pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya vesāliṁ piṇḍāya pāvisi. Addasā kho saccako nigaṇṭhaputto vesāliyaṁ jaṅghāvihāraṁ anucaṅkamamāno anuvicaramāno āyasmantaṁ assajiṁ dūratova āgacchantaṁ. Disvāna yenāyasmā assaji tenupasaṅkami; upasaṅkamitvā āyasmatā assajinā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho saccako nigaṇṭhaputto āyasmantaṁ assajiṁ etadavoca:",
    "mn35:3": "Tena kho pana samayena pañcamattāni licchavisatānisanthāgāresannipatitāni honti kenacideva karaṇīyena. Atha kho saccako nigaṇṭhaputto yena te licchavī tenupasaṅkami; upasaṅkamitvā te licchavī etadavoca: \"abhikkamantu bhonto licchavī, abhikkamantu bhonto licchavī, ajja me samaṇena gotamena saddhiṁ kathāsallāpo bhavissati. Sace me samaṇo gotamo tathā patiṭṭhissatiyathā ca meñātaññatarena sāvakena assajinā nāma bhikkhunā patiṭṭhitaṁ, seyyathāpi nāma balavā puriso dīghalomikaṁ eḷakaṁ lomesu gahetvā ākaḍḍheyya parikaḍḍheyya samparikaḍḍheyya; evamevāhaṁ samaṇaṁ gotamaṁ vādena vādaṁ ākaḍḍhissāmi parikaḍḍhissāmi samparikaḍḍhissāmi. Seyyathāpi nāma balavā soṇḍikākammakāro mahantaṁ soṇḍikākiḷañjaṁ gambhīre udakarahade pakkhipitvā kaṇṇe gahetvā ākaḍḍheyya parikaḍḍheyya samparikaḍḍheyya; evamevāhaṁ samaṇaṁ gotamaṁ vādena vādaṁ ākaḍḍhissāmi parikaḍḍhissāmi samparikaḍḍhissāmi. Seyyathāpi nāma balavā soṇḍikādhuttovālaṁkaṇṇe gahetvā odhuneyya niddhuneyyanipphoṭeyya; evamevāhaṁ samaṇaṁ gotamaṁ vādena vādaṁ odhunissāmi niddhunissāmi nipphoṭessāmi. Seyyathāpi nāma kuñjaro saṭṭhihāyano gambhīraṁ pokkharaṇiṁ ogāhetvā sāṇadhovikaṁ nāma kīḷitajātaṁ kīḷati; evamevāhaṁ samaṇaṁ gotamaṁ sāṇadhovikaṁ maññe kīḷitajātaṁ kīḷissāmi. Abhikkamantu bhonto licchavī, abhikkamantu bhonto licchavī, ajja me samaṇena gotamena saddhiṁ kathāsallāpo bhavissatī\"ti.",
    "mn35:4": "Tena kho pana samayena sambahulā bhikkhū abbhokāse caṅkamanti. Atha kho saccako nigaṇṭhaputto yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca: \"kahaṁ nu kho, bho, etarahi so bhavaṁ gotamo viharati? Dassanakāmā hi mayaṁ taṁ bhavantaṁ gotaman\"ti.",
    "mn35:5": "Ekamantaṁ nisinno kho saccako nigaṇṭhaputto bhagavantaṁ etadavoca: \"puccheyyāhaṁ bhavantaṁ gotamaṁ kiñcideva desaṁ, sace me bhavaṁ gotamo okāsaṁ karoti pañhassa veyyākaraṇāyā\"ti.",
    "mn35:6": "\"Upamā maṁ, bho gotama, paṭibhātī\"ti.",
    "mn35:7": "\"Seyyathāpi, bho gotama, ye kecime bījagāmabhūtagāmā vuddhiṁ virūḷhiṁ vepullaṁ āpajjanti, sabbe te pathaviṁ nissāya pathaviyaṁ patiṭṭhāya. Evamete bījagāmabhūtagāmā vuddhiṁ virūḷhiṁ vepullaṁ āpajjanti. Seyyathāpi vā pana, bho gotama, ye kecime balakaraṇīyā kammantā karīyanti, sabbe te pathaviṁ nissāya pathaviyaṁ patiṭṭhāya. Evamete balakaraṇīyā kammantā karīyanti. Evameva kho, bho gotama, rūpattāyaṁ purisapuggalo rūpe patiṭṭhāya puññaṁ vā apuññaṁ vā pasavati, vedanattāyaṁ purisapuggalo vedanāyaṁ patiṭṭhāya puññaṁ vā apuññaṁ vā pasavati, saññattāyaṁ purisapuggalo saññāyaṁ patiṭṭhāya puññaṁ vā apuññaṁ vā pasavati, saṅkhārattāyaṁ purisapuggalo saṅkhāresu patiṭṭhāya puññaṁ vā apuññaṁ vā pasavati, viññāṇattāyaṁ purisapuggalo viññāṇe patiṭṭhāya puññaṁ vā apuññaṁ vā pasavatī\"ti.",
    "mn35:8": "\"Nanu tvaṁ, aggivessana, evaṁ vadesi: ‘rūpaṁ me attā, vedanā me attā, saññā me attā, saṅkhārā me attā, viññāṇaṁ me attā’\"ti?",
    "mn35:9": "\"Kiñhi te, aggivessana, mahatī janatā karissati?",
    "mn35:10": "\"Tena hi, aggivessana, taññevettha paṭipucchissāmi, yathā te khameyyatathā naṁbyākareyyāsi. Taṁ kiṁ maññasi, aggivessana, vatteyya rañño khattiyassa muddhāvasittassa sakasmiṁ vijite vaso — ghātetāyaṁ vā ghātetuṁ, jāpetāyaṁ vā jāpetuṁ, pabbājetāyaṁ vā pabbājetuṁ, seyyathāpi rañño pasenadissa kosalassa, seyyathāpi vā pana rañño māgadhassa ajātasattussa vedehiputtassā\"ti?",
    "mn35:11": "\"Taṁ kiṁ maññasi, aggivessana, yaṁ tvaṁ evaṁ vadesi: ‘rūpaṁ me attā’ti, vattati te tasmiṁ rūpe vaso — evaṁ me rūpaṁ hotu, evaṁ me rūpaṁ mā ahosī\"ti? Evaṁ vutte, saccako nigaṇṭhaputto tuṇhī ahosi.",
    "mn35:12": "Tena kho pana samayena vajirapāṇi yakkho āyasaṁ vajiraṁ ādāya ādittaṁ sampajjalitaṁ sajotibhūtaṁ saccakassa nigaṇṭhaputtassa uparivehāsaṁ ṭhito hoti: \"sacāyaṁ saccako nigaṇṭhaputto bhagavatā yāvatatiyaṁ sahadhammikaṁ pañhaṁ puṭṭho na byākarissati etthevassa sattadhā muddhaṁ phālessāmī\"ti. Taṁ kho pana vajirapāṇiṁ yakkhaṁ bhagavā ceva passati saccako ca nigaṇṭhaputto. Atha kho saccako nigaṇṭhaputto bhīto saṁviggo lomahaṭṭhajāto bhagavantaṁyeva tāṇaṁ gavesī bhagavantaṁyeva leṇaṁ gavesī bhagavantaṁyeva saraṇaṁ gavesī bhagavantaṁ etadavoca: \"pucchatu maṁ bhavaṁ gotamo, byākarissāmī\"ti.",
    "mn35:13": "\"Taṁ kiṁ maññasi, aggivessana, yaṁ tvaṁ evaṁ vadesi: ‘rūpaṁ me attā’ti, vattati te tasmiṁ rūpe vaso — evaṁ me rūpaṁ hotu, evaṁ me rūpaṁ mā ahosī\"ti? \"No hidaṁ, bho gotama\".",
    "mn35:14": "\"Manasi karohi, aggivessana; manasi karitvā kho, aggivessana, byākarohi. Na kho te sandhiyati purimena vā pacchimaṁ pacchimena vā purimaṁ. Taṁ kiṁ maññasi, aggivessana, yaṁ tvaṁ evaṁ vadesi: ‘vedanā me attā’ti, vattati tetissaṁ vedanāyaṁvaso — evaṁ me vedanā hotu, evaṁ me vedanā mā ahosī\"ti? \"No hidaṁ, bho gotama\".",
    "mn35:15": "\"Manasi karohi, aggivessana; manasi karitvā kho, aggivessana, byākarohi. Na kho te sandhiyati purimena vā pacchimaṁ, pacchimena vā purimaṁ. Taṁ kiṁ maññasi, aggivessana, yaṁ tvaṁ evaṁ vadesi: ‘saññā me attā’ti, vattati te tissaṁ saññāyaṁ vaso — evaṁ me saññā hotu, evaṁ me saññā mā ahosī\"ti? \"No hidaṁ, bho gotama\".",
    "mn35:16": "\"Manasi karohi, aggivessana; manasi karitvā kho, aggivessana, byākarohi. Na kho te sandhiyati purimena vā pacchimaṁ, pacchimena vā purimaṁ. Taṁ kiṁ maññasi, aggivessana, yaṁ tvaṁ evaṁ vadesi: ‘saṅkhārā me attā’ti, vattati te tesu saṅkhāresu vaso — evaṁ me saṅkhārā hontu, evaṁ me saṅkhārā mā ahesun\"ti? \"No hidaṁ, bho gotama\".",
    "mn35:17": "\"Manasi karohi, aggivessana; manasi karitvā kho, aggivessana, byākarohi. Na kho te sandhiyati purimena vā pacchimaṁ, pacchimena vā purimaṁ. Taṁ kiṁ maññasi, aggivessana, yaṁ tvaṁ evaṁ vadesi: ‘viññāṇaṁ me attā’ti, vattati te tasmiṁ viññāṇe vaso — evaṁ me viññāṇaṁ hotu, evaṁ me viññāṇaṁ mā ahosī\"ti? \"No hidaṁ, bho gotama\".",
    "mn35:18": "\"Manasi karohi, aggivessana; manasi karitvā kho, aggivessana, byākarohi. Na kho te sandhiyati purimena vā pacchimaṁ, pacchimena vā purimaṁ. Taṁ kiṁ maññasi, aggivessana, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bho gotama\". \"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti? \"Dukkhaṁ, bho gotama\". \"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti? \"No hidaṁ, bho gotama\".",
    "mn35:19": "\"Taṁ kiṁ maññasi, aggivessana, vedanā … pe … saññā … pe … saṅkhārā … pe … taṁ kiṁ maññasi, aggivessana, viññāṇaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bho gotama\". \"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti? \"Dukkhaṁ, bho gotama\". \"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti? \"No hidaṁ, bho gotama\".",
    "mn35:20": "\"Taṁ kiṁ maññasi, aggivessana, yo nu kho dukkhaṁ allīno dukkhaṁ upagato dukkhaṁ ajjhosito, dukkhaṁ ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassati, api nu kho so sāmaṁ vā dukkhaṁ parijāneyya, dukkhaṁ vā parikkhepetvā vihareyyā\"ti?",
    "mn35:21": "\"Taṁ kiṁ maññasi, aggivessana, nanu tvaṁ evaṁ sante dukkhaṁ allīno dukkhaṁ upagato dukkhaṁ ajjhosito, dukkhaṁ: ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassasī\"ti?",
    "mn35:22": "\"Seyyathāpi, aggivessana, puriso sāratthiko sāragavesī sārapariyesanaṁ caramāno tiṇhaṁkuṭhāriṁādāya vanaṁ paviseyya. So tattha passeyya mahantaṁ kadalikkhandhaṁ ujuṁ navaṁakukkukajātaṁ. Tamenaṁ mūle chindeyya, mūle chetvā agge chindeyya, agge chetvā pattavaṭṭiṁvinibbhujeyya. So tattha pattavaṭṭiṁ vinibbhujanto pheggumpi nādhigaccheyya, kuto sāraṁ? Evameva kho tvaṁ, aggivessana, mayā sakasmiṁ vāde samanuyuñjiyamāno samanugāhiyamāno samanubhāsiyamāno ritto tuccho aparaddho. Bhāsitā kho pana te esā, aggivessana, vesāliyaṁ parisati vācā: ‘nāhaṁ taṁ passāmi samaṇaṁ vā brāhmaṇaṁ vā, saṁghiṁ gaṇiṁ gaṇācariyaṁ, api arahantaṁ sammāsambuddhaṁ paṭijānamānaṁ, yo mayā vādena vādaṁ samāraddho na saṅkampeyya na sampakampeyya na sampavedheyya, yassa na kacchehi sedā mucceyyuṁ. Thūṇaṁ cepāhaṁ acetanaṁ vādena vādaṁ samārabheyyaṁ sāpi mayā vādena vādaṁ samāraddhā saṅkampeyya sampakampeyya sampavedheyya. Ko pana vādo manussabhūtassā’ti? Tuyhaṁ kho pana, aggivessana, appekaccāni sedaphusitāni nalāṭā muttāni, uttarāsaṅgaṁ vinibhinditvā bhūmiyaṁ patiṭṭhitāni. Mayhaṁ kho pana, aggivessana, natthi etarahi kāyasmiṁ sedo\"ti. Iti bhagavātasmiṁparisati suvaṇṇavaṇṇaṁ kāyaṁ vivari. Evaṁ vutte, saccako nigaṇṭhaputto tuṇhībhūto maṅkubhūto pattakkhandho adhomukho pajjhāyanto appaṭibhāno nisīdi.",
    "mn35:23": "Atha kho dummukho licchaviputto saccakaṁ nigaṇṭhaputtaṁ tuṇhībhūtaṁ maṅkubhūtaṁ pattakkhandhaṁ adhomukhaṁ pajjhāyantaṁ appaṭibhānaṁ viditvā bhagavantaṁ etadavoca: \"upamā maṁ, bhagavā, paṭibhātī\"ti.",
    "mn35:24": "Tiṭṭhatesā, bho gotama, amhākañceva aññesañca puthusamaṇabrāhmaṇānaṁ vācā. Vilāpaṁ vilapitaṁ maññe. Kittāvatā ca nu kho bhoto gotamassa sāvako sāsanakaro hoti ovādapatikaro tiṇṇavicikiccho vigatakathaṅkatho vesārajjappatto aparappaccayo satthusāsane viharatī\"ti?",
    "mn35:25": "\"Kittāvatā pana, bho gotama, bhikkhu arahaṁ hoti khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṁyojano sammadaññāvimutto\"ti?",
    "mn35:26": "Evaṁ vutte, saccako nigaṇṭhaputto bhagavantaṁ etadavoca: \"mayameva, bho gotama, dhaṁsī, mayaṁ pagabbā, ye mayaṁ bhavantaṁ gotamaṁ vādena vādaṁ āsādetabbaṁ amaññimha. Siyā hi, bho gotama, hatthiṁ pabhinnaṁ āsajja purisassa sotthibhāvo, na tveva bhavantaṁ gotamaṁ āsajja siyā purisassa sotthibhāvo. Siyā hi, bho gotama, pajjalitaṁ aggikkhandhaṁ āsajja purisassa sotthibhāvo, na tveva bhavantaṁ gotamaṁ āsajja siyā purisassa sotthibhāvo. Siyā hi, bho gotama, āsīvisaṁ ghoravisaṁ āsajja purisassa sotthibhāvo, na tveva bhavantaṁ gotamaṁ āsajja siyā purisassa sotthibhāvo. Mayameva, bho gotama, dhaṁsī, mayaṁ pagabbā, ye mayaṁ bhavantaṁ gotamaṁ vādena vādaṁ āsādetabbaṁ amaññimha.",
    "mn35:27": "Atha kho saccako nigaṇṭhaputto bhagavato adhivāsanaṁ viditvā te licchavī āmantesi: \"suṇantu me bhonto licchavī, samaṇo me gotamo nimantito svātanāya saddhiṁ bhikkhusaṅghena. Tena me abhihareyyātha yamassa patirūpaṁ maññeyyāthā\"ti."
}