{
    "mn38:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn38:2": "Yato kho te bhikkhū nāsakkhiṁsu sātiṁ bhikkhuṁ kevaṭṭaputtaṁ etasmā pāpakā diṭṭhigatā vivecetuṁ, atha kho te bhikkhū yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ: \"sātissa nāma, bhante, bhikkhuno kevaṭṭaputtassa evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ: ‘tathāhaṁ bhagavatā dhammaṁ desitaṁ ājānāmi yathā tadevidaṁ viññāṇaṁ sandhāvati saṁsarati, anaññan’ti. Assumha kho mayaṁ, bhante, sātissa kira nāma bhikkhuno kevaṭṭaputtassa evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ: ‘tathāhaṁ bhagavatā dhammaṁ desitaṁ ājānāmi yathā tadevidaṁ viññāṇaṁ sandhāvati saṁsarati, anaññan’ti. Atha kho mayaṁ, bhante, yena sāti bhikkhu kevaṭṭaputto tenupasaṅkamimha; upasaṅkamitvā sātiṁ bhikkhuṁ kevaṭṭaputtaṁ etadavocumha: ‘saccaṁ kira te, āvuso sāti, evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ: \"Tathāhaṁ bhagavatā dhammaṁ desitaṁ ājānāmi yathā tadevidaṁ viññāṇaṁ sandhāvati saṁsarati, anaññan\"’ti? Evaṁ vutte, bhante, sāti bhikkhu kevaṭṭaputto amhe etadavoca: ‘evaṁ byā kho ahaṁ, āvuso, bhagavatā dhammaṁ desitaṁ ājānāmi yathā tadevidaṁ viññāṇaṁ sandhāvati saṁsarati, anaññan’ti. Atha kho mayaṁ, bhante, sātiṁ bhikkhuṁ kevaṭṭaputtaṁ etasmā pāpakā diṭṭhigatā vivecetukāmā samanuyuñjimha samanugāhimha samanubhāsimha: ‘mā evaṁ, āvuso sāti, avaca, mā bhagavantaṁ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṁ, na hi bhagavā evaṁ vadeyya. Anekapariyāyenāvuso sāti, paṭiccasamuppannaṁ viññāṇaṁ vuttaṁ bhagavatā, aññatra paccayā natthi viññāṇassa sambhavo’ti. Evampi kho, bhante, sāti bhikkhu kevaṭṭaputto amhehi samanuyuñjiyamāno samanugāhiyamāno samanubhāsiyamāno tadeva pāpakaṁ diṭṭhigataṁ thāmasā parāmasā abhinivissa voharati: ‘evaṁ byā kho ahaṁ, āvuso, bhagavatā dhammaṁ desitaṁ ājānāmi yathā tadevidaṁ viññāṇaṁ sandhāvati saṁsarati, anaññan’ti. Yato kho mayaṁ, bhante, nāsakkhimha sātiṁ bhikkhuṁ kevaṭṭaputtaṁ etasmā pāpakā diṭṭhigatā vivecetuṁ, atha mayaṁ etamatthaṁ bhagavato ārocemā\"ti.",
    "mn38:3": "Atha kho bhagavā aññataraṁ bhikkhuṁ āmantesi: \"ehi tvaṁ bhikkhu, mama vacanena sātiṁ bhikkhuṁ kevaṭṭaputtaṁ āmantehi: ‘satthā taṁ, āvuso sāti, āmantetī’\"ti. \"Evaṁ, bhante\"ti kho so bhikkhu bhagavato paṭissutvā yena sāti bhikkhu kevaṭṭaputto tenupasaṅkami; upasaṅkamitvā sātiṁ bhikkhuṁ kevaṭṭaputtaṁ etadavoca: \"satthā taṁ, āvuso sāti, āmantetī\"ti.",
    "mn38:4": "Atha kho bhagavā bhikkhū āmantesi: \"taṁ kiṁ maññatha, bhikkhave, api nāyaṁ sāti bhikkhu kevaṭṭaputto usmīkatopi imasmiṁ dhammavinaye\"ti?",
    "mn38:5": "\"Yaṁ yadeva, bhikkhave, paccayaṁ paṭicca uppajjati viññāṇaṁ, tena teneva viññāṇantvevasaṅkhyaṁ gacchati. Cakkhuñca paṭicca rūpe ca uppajjati viññāṇaṁ, cakkhuviññāṇantveva saṅkhyaṁ gacchati; sotañca paṭicca sadde ca uppajjati viññāṇaṁ, sotaviññāṇantveva saṅkhyaṁ gacchati; ghānañca paṭicca gandhe ca uppajjati viññāṇaṁ, ghānaviññāṇantveva saṅkhyaṁ gacchati; jivhañca paṭicca rase ca uppajjati viññāṇaṁ, jivhāviññāṇantveva saṅkhyaṁ gacchati; kāyañca paṭicca phoṭṭhabbe ca uppajjati viññāṇaṁ, kāyaviññāṇantveva saṅkhyaṁ gacchati; manañca paṭicca dhamme ca uppajjati viññāṇaṁ, manoviññāṇantveva saṅkhyaṁ gacchati.",
    "mn38:6": "Seyyathāpi, bhikkhave, yaṁ yadeva paccayaṁ paṭicca aggi jalati tena teneva saṅkhyaṁ gacchati. Kaṭṭhañca paṭicca aggi jalati, kaṭṭhaggitveva saṅkhyaṁ gacchati; sakalikañca paṭicca aggi jalati, sakalikaggitveva saṅkhyaṁ gacchati; tiṇañca paṭicca aggi jalati, tiṇaggitveva saṅkhyaṁ gacchati; gomayañca paṭicca aggi jalati, gomayaggitveva saṅkhyaṁ gacchati; thusañca paṭicca aggi jalati, thusaggitveva saṅkhyaṁ gacchati; saṅkārañca paṭicca aggi jalati, saṅkāraggitveva saṅkhyaṁ gacchati. Evameva kho, bhikkhave, yaṁ yadeva paccayaṁ paṭicca uppajjati viññāṇaṁ, tena teneva saṅkhyaṁ gacchati. Cakkhuñca paṭicca rūpe ca uppajjati viññāṇaṁ, cakkhuviññāṇantveva saṅkhyaṁ gacchati; sotañca paṭicca sadde ca uppajjati viññāṇaṁ, sotaviññāṇantveva saṅkhyaṁ gacchati, ghānañca paṭicca gandhe ca uppajjati viññāṇaṁ, ghānaviññāṇantveva saṅkhyaṁ gacchati, jivhañca paṭicca rase ca uppajjati viññāṇaṁ, jivhāviññāṇantveva saṅkhyaṁ gacchati. Kāyañca paṭicca phoṭṭhabbe ca uppajjati viññāṇaṁ, kāyaviññāṇantveva saṅkhyaṁ gacchati. Manañca paṭicca dhamme ca uppajjati viññāṇaṁ, manoviññāṇantveva saṅkhyaṁ gacchati.",
    "mn38:7": "Bhūtamidanti, bhikkhave, passathā\"ti?",
    "mn38:8": "\"Evaṁ, bhante\".",
    "mn38:9": "\"Tadāhārasambhavanti, bhikkhave, passathā\"ti?",
    "mn38:10": "\"Evaṁ, bhante\".",
    "mn38:11": "\"Tadāhāranirodhā yaṁ bhūtaṁ, taṁ nirodhadhammanti, bhikkhave, passathā\"ti?",
    "mn38:12": "\"Evaṁ, bhante\".",
    "mn38:13": "\"Bhūtamidaṁ nossūti, bhikkhave, kaṅkhato uppajjati vicikicchā\"ti?",
    "mn38:14": "\"Evaṁ, bhante\".",
    "mn38:15": "\"Tadāhārasambhavaṁ nossūti, bhikkhave, kaṅkhato uppajjati vicikicchā\"ti?",
    "mn38:16": "\"Evaṁ, bhante\".",
    "mn38:17": "\"Tadāhāranirodhā yaṁ bhūtaṁ, taṁ nirodhadhammaṁ nossūti, bhikkhave, kaṅkhato uppajjati vicikicchā\"ti?",
    "mn38:18": "\"Evaṁ, bhante\".",
    "mn38:19": "\"Bhūtamidanti, bhikkhave, yathābhūtaṁ sammappaññāya passato yā vicikicchā sā pahīyatī\"ti?",
    "mn38:20": "\"Evaṁ, bhante\".",
    "mn38:21": "\"Tadāhārasambhavanti, bhikkhave, yathābhūtaṁ sammappaññāya passato yā vicikicchā sā pahīyatī\"ti?",
    "mn38:22": "\"Evaṁ, bhante\".",
    "mn38:23": "\"Tadāhāranirodhā yaṁ bhūtaṁ, taṁ nirodhadhammanti, bhikkhave, yathābhūtaṁ sammappaññāya passato yā vicikicchā sā pahīyatī\"ti?",
    "mn38:24": "\"Evaṁ, bhante\".",
    "mn38:25": "\"Bhūtamidanti, bhikkhave, itipi vo ettha nibbicikicchā\"ti?",
    "mn38:26": "\"Evaṁ, bhante\".",
    "mn38:27": "\"Tadāhārasambhavanti, bhikkhave, itipi vo ettha nibbicikicchā\"ti?",
    "mn38:28": "\"Evaṁ, bhante\".",
    "mn38:29": "\"Tadāhāranirodhā yaṁ bhūtaṁ taṁ nirodhadhammanti, bhikkhave, itipi vo ettha nibbicikicchā\"ti?",
    "mn38:30": "\"Evaṁ, bhante\".",
    "mn38:31": "\"Bhūtamidanti, bhikkhave, yathābhūtaṁ sammappaññāya sudiṭṭhan\"ti?",
    "mn38:32": "\"Evaṁ, bhante\".",
    "mn38:33": "\"Tadāhārasambhavanti, bhikkhave, yathābhūtaṁ sammappaññāya sudiṭṭhan\"ti?",
    "mn38:34": "\"Evaṁ, bhante\".",
    "mn38:35": "\"Tadāhāranirodhā yaṁ bhūtaṁ taṁ nirodhadhammanti, bhikkhave, yathābhūtaṁ sammappaññāya sudiṭṭhan\"ti?",
    "mn38:36": "\"Evaṁ, bhante\".",
    "mn38:37": "\"Imañce tumhe, bhikkhave, diṭṭhiṁ evaṁ parisuddhaṁ evaṁ pariyodātaṁ allīyetha kelāyetha dhanāyetha mamāyetha, api nu me tumhe, bhikkhave, kullūpamaṁ dhammaṁ desitaṁ ājāneyyātha nittharaṇatthāya no gahaṇatthāyā\"ti?",
    "mn38:38": "\"No hetaṁ, bhante\".",
    "mn38:39": "\"Imañce tumhe, bhikkhave, diṭṭhiṁ evaṁ parisuddhaṁ evaṁ pariyodātaṁ na allīyetha na kelāyetha na dhanāyetha na mamāyetha, api nu me tumhe, bhikkhave, kullūpamaṁ dhammaṁ desitaṁ ājāneyyātha nittharaṇatthāya no gahaṇatthāyā\"ti?",
    "mn38:40": "\"Evaṁ, bhante\".",
    "mn38:41": "\"Cattārome, bhikkhave, āhārā bhūtānaṁ vā sattānaṁ ṭhitiyā, sambhavesīnaṁ vā anuggahāya. Katame cattāro? Kabaḷīkāro āhāro oḷāriko vā sukhumo vā, phasso dutiyo, manosañcetanā tatiyā, viññāṇaṁ catutthaṁ.",
    "mn38:42": "Ime ca, bhikkhave, cattāro āhārā kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā? Ime cattāro āhārā taṇhānidānā taṇhāsamudayā taṇhājātikā taṇhāpabhavā. Taṇhā cāyaṁ, bhikkhave, kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā?",
    "mn38:43": "Taṇhā vedanānidānā vedanāsamudayā vedanājātikā vedanāpabhavā.",
    "mn38:44": "Vedanā cāyaṁ, bhikkhave, kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā? Vedanā phassanidānā phassasamudayā phassajātikā phassapabhavā.",
    "mn38:45": "Phasso cāyaṁ, bhikkhave, kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo? Phasso saḷāyatananidāno saḷāyatanasamudayo saḷāyatanajātiko saḷāyatanapabhavo.",
    "mn38:46": "Saḷāyatanañcidaṁ, bhikkhave, kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ? Saḷāyatanaṁ nāmarūpanidānaṁ nāmarūpasamudayaṁ nāmarūpajātikaṁ nāmarūpapabhavaṁ.",
    "mn38:47": "Nāmarūpañcidaṁ, bhikkhave, kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ? Nāmarūpaṁ viññāṇanidānaṁ viññāṇasamudayaṁ viññāṇajātikaṁ viññāṇapabhavaṁ.",
    "mn38:48": "Viññāṇañcidaṁ, bhikkhave, kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ? Viññāṇaṁ saṅkhāranidānaṁ saṅkhārasamudayaṁ saṅkhārajātikaṁ saṅkhārapabhavaṁ.",
    "mn38:49": "Saṅkhārā cime, bhikkhave, kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā? Saṅkhārā avijjānidānā avijjāsamudayā avijjājātikā avijjāpabhavā.",
    "mn38:50": "Iti kho, bhikkhave, avijjāpaccayā saṅkhārā, saṅkhārapaccayā viññāṇaṁ, viññāṇapaccayā nāmarūpaṁ, nāmarūpapaccayā saḷāyatanaṁ, saḷāyatanapaccayā phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṁ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "mn38:51": "Jātipaccayā jarāmaraṇanti iti kho panetaṁ vuttaṁ; jātipaccayā nu kho, bhikkhave, jarāmaraṇaṁ, no vā,kathaṁ vā etthahotī\"ti?",
    "mn38:52": "\"Bhavapaccayā jātīti iti kho panetaṁ vuttaṁ; bhavapaccayā nu kho, bhikkhave, jāti, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:53": "\"Upādānapaccayā bhavoti iti kho panetaṁ vuttaṁ; upādānapaccayā nu kho, bhikkhave, bhavo, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:54": "\"Taṇhāpaccayā upādānanti iti kho panetaṁ vuttaṁ, taṇhāpaccayā nu kho, bhikkhave, upādānaṁ, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:55": "\"Vedanāpaccayā taṇhāti iti kho panetaṁ vuttaṁ; vedanāpaccayā nu kho, bhikkhave, taṇhā, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:56": "\"Phassapaccayā vedanāti iti kho panetaṁ vuttaṁ; phassapaccayā nu kho, bhikkhave, vedanā, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:57": "\"Saḷāyatanapaccayā phassoti iti kho panetaṁ vuttaṁ; saḷāyatanapaccayā nu kho, bhikkhave, phasso, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:58": "\"Nāmarūpapaccayā saḷāyatananti iti kho panetaṁ vuttaṁ; nāmarūpapaccayā nu kho, bhikkhave, saḷāyatanaṁ, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:59": "\"Viññāṇapaccayā nāmarūpanti iti kho panetaṁ vuttaṁ; viññāṇapaccayā nu kho, bhikkhave, nāmarūpaṁ, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:60": "\"Saṅkhārapaccayā viññāṇanti iti kho panetaṁ vuttaṁ; saṅkhārapaccayā nu kho, bhikkhave, viññāṇaṁ, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:61": "\"Avijjāpaccayā saṅkhārāti iti kho panetaṁ vuttaṁ; avijjāpaccayā nu kho, bhikkhave, saṅkhārā, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:62": "\"Sādhu, bhikkhave. Iti kho, bhikkhave, tumhepi evaṁ vadetha, ahampi evaṁ vadāmi — imasmiṁ sati idaṁ hoti, imassuppādā idaṁ uppajjati, yadidaṁ — avijjāpaccayā saṅkhārā, saṅkhārapaccayā viññāṇaṁ, viññāṇapaccayā nāmarūpaṁ, nāmarūpapaccayā saḷāyatanaṁ, saḷāyatanapaccayā phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṁ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "mn38:63": "Avijjāya tveva asesavirāganirodhā saṅkhāranirodho, saṅkhāranirodhā viññāṇanirodho, viññāṇanirodhā nāmarūpanirodho, nāmarūpanirodhā saḷāyatananirodho, saḷāyatananirodhā phassanirodho, phassanirodhā vedanānirodho, vedanānirodhā taṇhānirodho, taṇhānirodhā upādānanirodho, upādānanirodhā bhavanirodho, bhavanirodhā jātinirodho, jātinirodhā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā nirujjhanti. Evametassa kevalassa dukkhakkhandhassa nirodho hoti.",
    "mn38:64": "Jātinirodhā jarāmaraṇanirodhoti iti kho panetaṁ vuttaṁ; jātinirodhā nu kho, bhikkhave, jarāmaraṇanirodho, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:65": "\"Bhavanirodhā jātinirodhoti iti kho panetaṁ vuttaṁ; bhavanirodhā nu kho, bhikkhave, jātinirodho, no vā, kathaṁ vā ettha hotī\"ti? \"Bhavanirodhā, bhante, jātinirodho; evaṁ no ettha hoti — bhavanirodhā jātinirodho\"ti.",
    "mn38:66": "\"Upādānanirodhā bhavanirodhoti iti kho panetaṁ vuttaṁ; upādānanirodhā nu kho, bhikkhave, bhavanirodho, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:67": "\"Taṇhānirodhā upādānanirodhoti iti kho panetaṁ vuttaṁ; taṇhānirodhā nu kho, bhikkhave, upādānanirodho, no vā, kathaṁ vā ettha hotī\"ti? \"Taṇhānirodhā, bhante, upādānanirodho; evaṁ no ettha hoti — taṇhānirodhā upādānanirodho\"ti.",
    "mn38:68": "\"Vedanānirodhā taṇhānirodhoti iti kho panetaṁ vuttaṁ; vedanānirodhā nu kho, bhikkhave, taṇhānirodho, no vā, kathaṁ vā ettha hotī\"ti? \"Vedanānirodhā, bhante, taṇhānirodho; evaṁ no ettha hoti — vedanānirodhā taṇhānirodho\"ti.",
    "mn38:69": "\"Phassanirodhā vedanānirodhoti iti kho panetaṁ vuttaṁ; phassanirodhā nu kho, bhikkhave, vedanānirodho, no vā, kathaṁ vā ettha hotī\"ti? \"Phassanirodhā, bhante, vedanānirodho; evaṁ no ettha hoti — phassanirodhā vedanānirodho\"ti.",
    "mn38:70": "\"Saḷāyatananirodhā phassanirodhoti iti kho panetaṁ vuttaṁ; saḷāyatananirodhā nu kho, bhikkhave, phassanirodho, no vā, kathaṁ vā ettha hotīti? Saḷāyatananirodhā, bhante, phassanirodho; evaṁ no ettha hoti –  saḷāyatananirodhā phassanirodho\"ti.",
    "mn38:71": "\"Nāmarūpanirodhā saḷāyatananirodhoti iti kho panetaṁ vuttaṁ; nāmarūpanirodhā nu kho, bhikkhave, saḷāyatananirodho, no vā, kathaṁ vā ettha hotī\"ti? \"Nāmarūpanirodhā, bhante, saḷāyatananirodho; evaṁ no ettha hoti –  nāmarūpanirodhā saḷāyatananirodho\"ti. \"Viññāṇanirodhā nāmarūpanirodhoti iti kho panetaṁ vuttaṁ; viññāṇanirodhā nu kho, bhikkhave, nāmarūpanirodho, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:72": "\"Viññāṇanirodhā, bhante, nāmarūpanirodho; evaṁ no ettha hoti — viññāṇanirodhā nāmarūpanirodho\"ti. \"Saṅkhāranirodhā viññāṇanirodhoti iti kho panetaṁ vuttaṁ; saṅkhāranirodhā nu kho, bhikkhave, viññāṇanirodho, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:73": "\"Avijjānirodhā saṅkhāranirodhoti iti kho panetaṁ vuttaṁ; avijjānirodhā nu kho, bhikkhave, saṅkhāranirodho, no vā, kathaṁ vā ettha hotī\"ti?",
    "mn38:74": "\"Sādhu, bhikkhave. Iti kho, bhikkhave, tumhepi evaṁ vadetha, ahampi evaṁ vadāmi — imasmiṁ asati idaṁ na hoti, imassa nirodhā idaṁ nirujjhati, yadidaṁ — avijjānirodhā saṅkhāranirodho, saṅkhāranirodhā viññāṇanirodho, viññāṇanirodhā nāmarūpanirodho, nāmarūpanirodhā saḷāyatananirodho, saḷāyatananirodhā phassanirodho, phassanirodhā vedanānirodho, vedanānirodhā taṇhānirodho, taṇhānirodhā upādānanirodho, upādānanirodhā bhavanirodho, bhavanirodhā jātinirodho, jātinirodhā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā nirujjhanti. Evametassa kevalassa dukkhakkhandhassa nirodho hoti.",
    "mn38:75": "Api nu tumhe, bhikkhave, evaṁ jānantā evaṁ passantā pubbantaṁ vā paṭidhāveyyātha: ‘ahesumha nu kho mayaṁ atītamaddhānaṁ, nanu kho ahesumha atītamaddhānaṁ, kiṁ nu kho ahesumha atītamaddhānaṁ, kathaṁ nu kho ahesumha atītamaddhānaṁ, kiṁ hutvā kiṁ ahesumha nu kho mayaṁ atītamaddhānan’\"ti?",
    "mn38:76": "\"No hetaṁ, bhante\".",
    "mn38:77": "\"Api nu tumhe, bhikkhave, evaṁ jānantā evaṁ passantā aparantaṁ vā paṭidhāveyyātha — bhavissāma nu kho mayaṁ anāgatamaddhānaṁ, nanu kho bhavissāma anāgatamaddhānaṁ, kiṁ nu kho bhavissāma anāgatamaddhānaṁ, kathaṁ nu kho bhavissāma anāgatamaddhānaṁ, kiṁ hutvā kiṁ bhavissāma nu kho mayaṁ anāgatamaddhānan\"ti?",
    "mn38:78": "\"No hetaṁ, bhante\".",
    "mn38:79": "\"Api nu tumhe, bhikkhave, evaṁ jānantā evaṁ passantā etarahi vā paccuppannamaddhānaṁ ajjhattaṁ kathaṅkathī assatha — ahaṁ nu khosmi, no nu khosmi, kiṁ nu khosmi, kathaṁ nu khosmi, ayaṁ nu kho satto kuto āgato, so kuhiṁ gāmī bhavissatī\"ti?",
    "mn38:80": "\"No hetaṁ, bhante\".",
    "mn38:81": "\"Api nu tumhe, bhikkhave, evaṁ jānantā evaṁ passantā evaṁ vadeyyātha — satthā no garu, satthugāravena ca mayaṁ evaṁ vademā\"ti?",
    "mn38:82": "\"No hetaṁ, bhante\".",
    "mn38:83": "\"Api nu tumhe, bhikkhave, evaṁ jānantā evaṁ passantā evaṁ vadeyyātha — samaṇo evamāha, samaṇā ca nāma mayaṁ evaṁ vademā\"ti?",
    "mn38:84": "\"No hetaṁ, bhante\".",
    "mn38:85": "\"Api nu tumhe, bhikkhave, evaṁ jānantā evaṁ passantā aññaṁ satthāraṁ uddiseyyāthā\"ti?",
    "mn38:86": "\"No hetaṁ, bhante\".",
    "mn38:87": "\"Api nu tumhe, bhikkhave, evaṁ jānantā evaṁ passantā yāni tāni puthusamaṇabrāhmaṇānaṁ vata kotūhalamaṅgalāni tāni sārato paccāgaccheyyāthā\"ti?",
    "mn38:88": "\"No hetaṁ, bhante\".",
    "mn38:89": "\"Nanu, bhikkhave, yadeva tumhākaṁ sāmaṁ ñātaṁ sāmaṁ diṭṭhaṁ sāmaṁ viditaṁ, tadeva tumhe vadethā\"ti.",
    "mn38:90": "\"Evaṁ, bhante\".",
    "mn38:91": "\"Sādhu, bhikkhave, upanītā kho me tumhe, bhikkhave, iminā sandiṭṭhikena dhammena akālikena ehipassikena opaneyyikena paccattaṁ veditabbena viññūhi. Sandiṭṭhiko ayaṁ, bhikkhave, dhammo akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhi — iti yantaṁ vuttaṁ, idametaṁ paṭicca vuttanti.",
    "mn38:92": "Tiṇṇaṁ kho pana, bhikkhave, sannipātāgabbhassāvakkantihoti. Idha mātāpitaro ca sannipatitā honti, mātā ca na utunī hoti, gandhabbo ca na paccupaṭṭhito hoti, neva tāva gabbhassāvakkanti hoti. Idha mātāpitaro ca sannipatitā honti, mātā ca utunī hoti, gandhabbo ca na paccupaṭṭhito hoti, neva tāva gabbhassāvakkanti hoti. ato ca kho, bhikkhave, mātāpitaro ca sannipatitā honti, mātā ca utunī hoti, gandhabbo ca paccupaṭṭhito hoti — evaṁ tiṇṇaṁ sannipātā gabbhassāvakkanti hoti.",
    "mn38:93": "Sa kho so, bhikkhave, kumāro vuddhimanvāya indriyānaṁ paripākamanvāya pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti — cakkhuviññeyyehi rūpehi iṭṭhehi kantehi manāpehi piyarūpehi kāmūpasaṁhitehi rajanīyehi, sotaviññeyyehi saddehi … ghānaviññeyyehi gandhehi … jivhāviññeyyehi rasehi … kāyaviññeyyehi phoṭṭhabbehi iṭṭhehi kantehi manāpehi piyarūpehi kāmūpasaṁhitehi rajanīyehi.",
    "mn38:94": "So cakkhunā rūpaṁ disvā piyarūpe rūpe sārajjati, appiyarūpe rūpe byāpajjati, anupaṭṭhitakāyasati ca viharati parittacetaso. Tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ nappajānāti — yatthassa te pāpakā akusalā dhammā aparisesā nirujjhanti. So evaṁ anurodhavirodhaṁ samāpanno yaṁ kiñci vedanaṁ vedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, so taṁ vedanaṁ abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa taṁ vedanaṁ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjati nandī. Yā vedanāsu nandī tadupādānaṁ, tassupādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "mn38:95": "Idha, bhikkhave, tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ; kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti.",
    "mn38:96": "So evaṁ pabbajito samāno bhikkhūnaṁ sikkhāsājīvasamāpanno pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti, nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati.",
    "mn38:97": "Adinnādānaṁ pahāya adinnādānā paṭivirato hoti, dinnādāyī dinnapāṭikaṅkhī athenena sucibhūtena attanā viharati.",
    "mn38:98": "Abrahmacariyaṁ pahāya brahmacārī hoti, ārācārī virato methunā gāmadhammā.",
    "mn38:99": "Musāvādaṁ pahāya musāvādā paṭivirato hoti, saccavādī saccasandho theto paccayiko avisaṁvādako lokassa.",
    "mn38:100": "Pisuṇaṁ vācaṁ pahāya pisuṇāya vācāya paṭivirato hoti — ito sutvā na amutra akkhātā imesaṁ bhedāya, amutra vā sutvā na imesaṁ akkhātā amūsaṁ bhedāya. Iti bhinnānaṁ vā sandhātā, sahitānaṁ vā anuppadātā samaggārāmo samaggarato samagganandī, samaggakaraṇiṁ vācaṁ bhāsitā hoti.",
    "mn38:101": "Pharusaṁ vācaṁ pahāya pharusāya vācāya paṭivirato hoti — yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṁ vācaṁ bhāsitā hoti.",
    "mn38:102": "Samphappalāpaṁ pahāya samphappalāpā paṭivirato hoti, kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṁ vācaṁ bhāsitā kālena, sāpadesaṁ pariyantavatiṁ atthasaṁhitaṁ.",
    "mn38:103": "So bījagāmabhūtagāmasamārambhā paṭivirato hoti, ekabhattiko hoti rattūparato, virato vikālabhojanā. Naccagītavāditavisūkadassanā paṭivirato hoti, mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti, uccāsayanamahāsayanā paṭivirato hoti, jātarūparajatapaṭiggahaṇā paṭivirato hoti, āmakadhaññapaṭiggahaṇā paṭivirato hoti, āmakamaṁsapaṭiggahaṇā paṭivirato hoti, itthikumārikapaṭiggahaṇā paṭivirato hoti, dāsidāsapaṭiggahaṇā paṭivirato hoti, ajeḷakapaṭiggahaṇā paṭivirato hoti, kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti, hatthigavāssavaḷavapaṭiggahaṇā paṭivirato hoti, khettavatthupaṭiggahaṇā paṭivirato hoti, dūteyyapahiṇagamanānuyogā paṭivirato hoti, kayavikkayā paṭivirato hoti, tulākūṭakaṁsakūṭamānakūṭā paṭivirato hoti, ukkoṭanavañcananikatisāciyogā paṭivirato hoti, chedanavadhabandhanaviparāmosaālopasahasākārā paṭiviratohoti.",
    "mn38:104": "So santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati samādāyeva pakkamati. Seyyathāpi nāma pakkhī sakuṇo yena yeneva ḍeti sapattabhārova ḍeti; evameva bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati samādāyeva pakkamati. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṁ anavajjasukhaṁ paṭisaṁvedeti.",
    "mn38:105": "So cakkhunā rūpaṁ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ tassa saṁvarāya paṭipajjati, rakkhati cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjati. Sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … pe … jivhāya rasaṁ sāyitvā … pe … kāyena phoṭṭhabbaṁ phusitvā … pe … manasā dhammaṁ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ tassa saṁvarāya paṭipajjati, rakkhati manindriyaṁ manindriye saṁvaraṁ āpajjati. So iminā ariyena indriyasaṁvarena samannāgato ajjhattaṁ abyāsekasukhaṁ paṭisaṁvedeti.",
    "mn38:106": "So abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti.",
    "mn38:107": "So iminā ca ariyena sīlakkhandhena samannāgato,imāya ca ariyāya santuṭṭhiyā samannāgato, iminā ca ariyena indriyasaṁvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato, vivittaṁ senāsanaṁ bhajati — araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ.",
    "mn38:108": "So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. Puna caparaṁ, bhikkhave, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ … pe … tatiyaṁ jhānaṁ … pe … catutthaṁ jhānaṁ upasampajja viharati.",
    "mn38:109": "So cakkhunā rūpaṁ disvā piyarūpe rūpe na sārajjati, appiyarūpe rūpe na byāpajjati, upaṭṭhitakāyasati ca viharati appamāṇacetaso. Tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ pajānāti — yatthassa te pāpakā akusalā dhammā aparisesā nirujjhanti. So evaṁ anurodhavirodhavippahīno yaṁ kiñci vedanaṁ vedeti, sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, so taṁ vedanaṁ nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa taṁ vedanaṁ anabhinandato anabhivadato anajjhosāya tiṭṭhato yā vedanāsu nandī sā nirujjhati. Tassa nandīnirodhā upādānanirodho, upādānanirodhā bhavanirodho, bhavanirodhā jātinirodho, jātinirodhā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā nirujjhanti.",
    "mn38:110": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}