{
    "mn39:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā aṅgesu viharati assapuraṁ nāma aṅgānaṁ nigamo. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn39:2": "\"Samaṇā samaṇāti vo, bhikkhave, jano sañjānāti. Tumhe ca pana ‘ke tumhe’ti puṭṭhā samānā ‘samaṇāmhā’ti paṭijānātha; tesaṁ vo, bhikkhave, evaṁsamaññānaṁ sataṁ evaṁpaṭiññānaṁ sataṁ ‘ye dhammā samaṇakaraṇā ca brāhmaṇakaraṇā ca te dhamme samādāya vattissāma, evaṁ no ayaṁ amhākaṁ samaññā ca saccā bhavissati paṭiññā ca bhūtā. Yesañca mayaṁ cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṁ paribhuñjāma, tesaṁ te kārā amhesu mahapphalā bhavissanti mahānisaṁsā, amhākañcevāyaṁ pabbajjā avañjhā bhavissati saphalā saudrayā’ti. Evañhi vo, bhikkhave, sikkhitabbaṁ.",
    "mn39:3": "Katame ca, bhikkhave, dhammā samaṇakaraṇā ca brāhmaṇakaraṇā ca? ‘Hirottappena samannāgatā bhavissāmā’ti evañhi vo, bhikkhave, sikkhitabbaṁ. Siyā kho pana, bhikkhave, tumhākaṁ evamassa: ‘hirottappenamha samannāgatā, alamettāvatā katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttariṁ karaṇīyan’ti tāvatakeneva tuṭṭhiṁ āpajjeyyātha. Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave: ‘mā vo sāmaññatthikānaṁ sataṁ sāmaññattho parihāyi, sati uttariṁ karaṇīye’.",
    "mn39:4": "Kiñca, bhikkhave, uttariṁ karaṇīyaṁ? ‘Parisuddho no kāyasamācāro bhavissati uttāno vivaṭo na ca chiddavā saṁvuto ca. Tāya ca pana parisuddhakāyasamācāratāyanevattānukkaṁsessāma na paraṁ vambhessāmā’tievañhi vo, bhikkhave, sikkhitabbaṁ. Siyā kho pana, bhikkhave, tumhākaṁ evamassa: ‘hirottappenamha samannāgatā, parisuddho no kāyasamācāro; alamettāvatā katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttariṁ karaṇīyan’ti tāvatakeneva tuṭṭhiṁ āpajjeyyātha. Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave: ‘mā vo sāmaññatthikānaṁ sataṁ sāmaññattho parihāyi, sati uttariṁ karaṇīye’.",
    "mn39:5": "Kiñca, bhikkhave, uttariṁ karaṇīyaṁ? ‘Parisuddho no vacīsamācāro bhavissati uttāno vivaṭo na ca chiddavā saṁvuto ca. Tāya ca pana parisuddhavacīsamācāratāya nevattānukkaṁsessāma na paraṁ vambhessāmā’ti evañhi vo, bhikkhave, sikkhitabbaṁ. Siyā kho pana, bhikkhave, tumhākaṁ evamassa: ‘hirottappenamha samannāgatā, parisuddho no kāyasamācāro, parisuddho vacīsamācāro; alamettāvatā katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttariṁ karaṇīyan’ti tāvatakeneva tuṭṭhiṁ āpajjeyyātha. Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave: ‘mā vo sāmaññatthikānaṁ sataṁ sāmaññattho parihāyi, sati uttariṁ karaṇīye’.",
    "mn39:6": "Kiñca, bhikkhave, uttariṁ karaṇīyaṁ? ‘Parisuddho no manosamācāro bhavissati uttāno vivaṭo na ca chiddavā saṁvuto ca. Tāya ca pana parisuddhamanosamācāratāya nevattānukkaṁsessāma na paraṁ vambhessāmā’ti evañhi vo, bhikkhave, sikkhitabbaṁ. Siyā kho pana, bhikkhave, tumhākaṁ evamassa: ‘hirottappenamha samannāgatā, parisuddho no kāyasamācāro, parisuddho vacīsamācāro, parisuddho manosamācāro; alamettāvatā katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttariṁ karaṇīyan’ti tāvatakeneva tuṭṭhiṁ āpajjeyyātha. Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave: ‘mā vo sāmaññatthikānaṁ sataṁ sāmaññattho parihāyi, sati uttariṁ karaṇīye’.",
    "mn39:7": "Kiñca, bhikkhave, uttariṁ karaṇīyaṁ? ‘Parisuddho no ājīvo bhavissati uttāno vivaṭo na ca chiddavā saṁvuto ca. Tāya ca pana parisuddhājīvatāya nevattānukkaṁsessāma na paraṁ vambhessāmā’ti evañhi vo, bhikkhave, sikkhitabbaṁ. Siyā kho pana, bhikkhave, tumhākaṁ evamassa: ‘hirottappenamha samannāgatā, parisuddho no kāyasamācāro, parisuddho vacīsamācāro, parisuddho manosamācāro, parisuddho ājīvo; alamettāvatā katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttariṁ karaṇīyan’ti tāvatakeneva tuṭṭhiṁ āpajjeyyātha. Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave: ‘mā vo sāmaññatthikānaṁ sataṁ sāmaññattho parihāyi, sati uttariṁ karaṇīye’.",
    "mn39:8": "Kiñca, bhikkhave, uttariṁ karaṇīyaṁ? ‘Indriyesu guttadvārā bhavissāma; cakkhunā rūpaṁ disvā na nimittaggāhī nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjissāma, rakkhissāma cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjissāma. Sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … pe … jivhāya rasaṁ sāyitvā … pe … kāyena phoṭṭhabbaṁ phusitvā … pe … manasā dhammaṁ viññāya na nimittaggāhī nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjissāma, rakkhissāma manindriyaṁ, manindriye saṁvaraṁ āpajjissāmā’ti evañhi vo, bhikkhave, sikkhitabbaṁ. Siyā kho pana, bhikkhave, tumhākaṁ evamassa: ‘hirottappenamha samannāgatā, parisuddho no kāyasamācāro, parisuddho vacīsamācāro, parisuddho manosamācāro, parisuddho ājīvo, indriyesumha guttadvārā; alamettāvatā katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttariṁ karaṇīyan’ti tāvatakeneva tuṭṭhiṁ āpajjeyyātha. Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave: ‘mā vo sāmaññatthikānaṁ sataṁ sāmaññattho parihāyi, sati uttariṁ karaṇīye’.",
    "mn39:9": "Kiñca, bhikkhave, uttariṁ karaṇīyaṁ? ‘Bhojane mattaññuno bhavissāma, paṭisaṅkhā yoniso āhāraṁ āharissāma, neva davāya na madāya na maṇḍanāya na vibhūsanāya yāvadeva imassa kāyassa ṭhitiyā yāpanāya, vihiṁsūparatiyā, brahmacariyānuggahāya, iti purāṇañca vedanaṁ paṭihaṅkhāma navañca vedanaṁ na uppādessāma, yātrā ca no bhavissati, anavajjatā ca, phāsu vihāro cā’ti evañhi vo, bhikkhave, sikkhitabbaṁ. Siyā kho pana, bhikkhave, tumhākaṁ evamassa: ‘hirottappenamha samannāgatā, parisuddho no kāyasamācāro, parisuddho vacīsamācāro, parisuddho manosamācāro, parisuddho ājīvo, indriyesumha guttadvārā, bhojane mattaññuno; alamettāvatā katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttariṁ karaṇīyan’ti tāvatakeneva tuṭṭhiṁ āpajjeyyātha. Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave: ‘mā vo, sāmaññatthikānaṁ sataṁ sāmaññattho parihāyi sati uttariṁ karaṇīye’.",
    "mn39:10": "Kiñca, bhikkhave, uttariṁ karaṇīyaṁ? ‘Jāgariyaṁ anuyuttā bhavissāma, divasaṁ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṁ parisodhessāma. Rattiyā paṭhamaṁ yāmaṁ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṁ parisodhessāma. Rattiyā majjhimaṁ yāmaṁ dakkhiṇena passena sīhaseyyaṁ kappessāma pāde pādaṁ accādhāya, sato sampajāno uṭṭhānasaññaṁ manasi karitvā. Rattiyā pacchimaṁ yāmaṁ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṁ parisodhessāmā’ti, evañhi vo, bhikkhave, sikkhitabbaṁ. Siyā kho pana, bhikkhave, tumhākaṁ evamassa: ‘hirottappenamha samannāgatā, parisuddho no kāyasamācāro, parisuddho vacīsamācāro, parisuddho manosamācāro, parisuddho ājīvo, indriyesumha guttadvārā, bhojane mattaññuno, jāgariyaṁ anuyuttā; alamettāvatā katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttariṁ karaṇīyan’ti, tāvatakeneva tuṭṭhiṁ āpajjeyyātha. Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave: ‘mā vo, sāmaññatthikānaṁ sataṁ sāmaññattho parihāyi sati uttariṁ karaṇīye’.",
    "mn39:11": "Kiñca, bhikkhave, uttariṁ karaṇīyaṁ? ‘Satisampajaññena samannāgatā bhavissāma, abhikkante paṭikkante sampajānakārī, ālokite vilokite sampajānakārī, samiñjite pasārite sampajānakārī, saṅghāṭipattacīvaradhāraṇe sampajānakārī, asite pīte khāyite sāyite sampajānakārī, uccārapassāvakamme sampajānakārī, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī’ti, evañhi vo, bhikkhave, sikkhitabbaṁ. Siyā kho pana, bhikkhave, tumhākaṁ evamassa: ‘hirottappenamha samannāgatā, parisuddho no kāyasamācāro, parisuddho vacīsamācāro, parisuddho manosamācāro, parisuddho ājīvo, indriyesumha guttadvārā, bhojane mattaññuno, jāgariyaṁ anuyuttā, satisampajaññena samannāgatā; alamettāvatā katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttariṁ karaṇīyan’ti tāvatakeneva tuṭṭhiṁ āpajjeyyātha. Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave: ‘mā vo, sāmaññatthikānaṁ sataṁ sāmaññattho parihāyi sati uttariṁ karaṇīye’.",
    "mn39:12": "Kiñca, bhikkhave, uttariṁ karaṇīyaṁ? Idha, bhikkhave, bhikkhu vivittaṁ senāsanaṁ bhajati — araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanappatthaṁ abbhokāsaṁ palālapuñjaṁ.",
    "mn39:13": "Seyyathāpi, bhikkhave, puriso iṇaṁ ādāya kammante payojeyya. Tassa te kammantāsamijjheyyuṁ. So yāni ca porāṇāni iṇamūlāni tāni cabyantīkareyya, siyā cassa uttariṁ avasiṭṭhaṁ dārabharaṇāya. Tassa evamassa: ‘Ahaṁ kho pubbe iṇaṁ ādāya kammante payojesiṁ, tassa me te kammantā samijjhiṁsu. Sohaṁ yāni ca porāṇāni iṇamūlāni tāni ca byantī akāsiṁ, atthi ca me uttariṁ avasiṭṭhaṁ dārabharaṇāyā’ti. So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ.",
    "mn39:14": "Seyyathāpi, bhikkhave, puriso ābādhiko assa dukkhito bāḷhagilāno, bhattañcassa nacchādeyya, na cassa kāye balamattā. So aparena samayena tamhā ābādhā mucceyya, bhattañcassa chādeyya, siyā cassa kāye balamattā. Tassa evamassa: ‘Ahaṁ kho pubbe ābādhiko ahosiṁ dukkhito bāḷhagilāno, bhattañca me nacchādesi, na ca me āsi kāye balamattā, somhi etarahi tamhā ābādhā mutto, bhattañca me chādeti, atthi ca me kāye balamattā’ti. So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ.",
    "mn39:15": "Seyyathāpi, bhikkhave, puriso bandhanāgāre baddho assa. So aparena samayena tamhā bandhanā mucceyya sotthināabbhayena, na cassa kiñci bhogānaṁ vayo. Tassa evamassa: ‘Ahaṁ kho pubbe bandhanāgāre baddho ahosiṁ, somhi etarahi tamhā bandhanā mutto, sotthinā abbhayena, natthi ca me kiñci bhogānaṁ vayo’ti. So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ.",
    "mn39:16": "Seyyathāpi, bhikkhave, puriso dāso assa anattādhīno parādhīno na yenakāmaṅgamo. So aparena samayena tamhā dāsabyā mucceyya attādhīno aparādhīno bhujisso yenakāmaṅgamo. Tassa evamassa: ‘Ahaṁ kho pubbe dāso ahosiṁ anattādhīno parādhīno na yenakāmaṅgamo, somhi etarahi tamhā dāsabyā mutto attādhīno aparādhīno bhujisso yenakāmaṅgamo’ti. So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ.",
    "mn39:17": "Seyyathāpi, bhikkhave, puriso sadhano sabhogo kantāraddhānamaggaṁpaṭipajjeyya. So aparena samayena tamhā kantārā nitthareyya sotthinā abbhayena, na cassa kiñci bhogānaṁ vayo. Tassa evamassa: ‘Ahaṁ kho pubbe sadhano sabhogo kantāraddhānamaggaṁ paṭipajjiṁ. Somhi etarahi tamhā kantārā nitthiṇṇo sotthinā abbhayena, natthi ca me kiñci bhogānaṁ vayo’ti. So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ.",
    "mn39:18": "Evameva kho, bhikkhave, bhikkhu yathā iṇaṁ yathā rogaṁ yathā bandhanāgāraṁ yathā dāsabyaṁ yathā kantāraddhānamaggaṁ, ime pañca nīvaraṇe appahīne attani samanupassati. Seyyathāpi, bhikkhave, āṇaṇyaṁ yathā ārogyaṁ yathā bandhanāmokkhaṁ yathā bhujissaṁ yathā khemantabhūmiṁ; evameva bhikkhu ime pañca nīvaraṇe pahīne attani samanupassati.",
    "mn39:19": "So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, vivicceva kāmehi vivicca akusalehi dhammehi, savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. So imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti. Seyyathāpi, bhikkhave, dakkhonhāpakovā nhāpakantevāsī vā kaṁsathālenhānīyacuṇṇāniākiritvā udakena paripphosakaṁ paripphosakaṁ sanneyya. Sāyaṁ nhānīyapiṇḍi snehānugatā snehaparetā santarabāhirā, phuṭā snehena na ca pagghariṇī. Evameva kho, bhikkhave, bhikkhu imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti.",
    "mn39:20": "Puna caparaṁ, bhikkhave, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. So imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti. Seyyathāpi, bhikkhave, udakarahadoubbhidodako. Tassa nevassa puratthimāya disāya udakassa āyamukhaṁ, na pacchimāya disāya udakassa āyamukhaṁ, na uttarāya disāya udakassa āyamukhaṁ, na dakkhiṇāya disāya udakassa āyamukhaṁ, devo ca na kālena kālaṁ sammādhāraṁ anuppaveccheyya. Atha kho tamhāva udakarahadā sītā vāridhārā ubbhijjitvā tameva udakarahadaṁ sītena vārinā abhisandeyya parisandeyya paripūreyya paripphareyya, nāssa kiñci sabbāvato udakarahadassa sītena vārinā apphuṭaṁ assa. Evameva kho, bhikkhave, bhikkhu imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti.",
    "mn39:21": "Puna caparaṁ, bhikkhave, bhikkhu pītiyā ca virāgā upekkhako ca viharati, sato ca sampajāno, sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti tatiyaṁ jhānaṁ upasampajja viharati. So imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti. Seyyathāpi, bhikkhave, uppaliniyaṁ vā paduminiyaṁ vā puṇḍarīkiniyaṁ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṁvaḍḍhāni udakānuggatāni antonimuggaposīni, tāni yāva caggā yāva ca mūlā sītena vārinā abhisannāni parisannāni paripūrāni paripphuṭāni,nāssakiñci sabbāvataṁ uppalānaṁ vā padumānaṁ vā puṇḍarīkānaṁ vā sītena vārinā apphuṭaṁ assa. Evameva kho, bhikkhave, bhikkhu imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti.",
    "mn39:22": "Puna caparaṁ, bhikkhave, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṁ atthaṅgamā, adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. So imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti. Seyyathāpi, bhikkhave, puriso odātena vatthena sasīsaṁ pārupetvā nisinno assa, nāssa kiñci sabbāvato kāyassa odātena vatthena apphuṭaṁ assa. Evameva kho, bhikkhave, bhikkhu imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti.",
    "mn39:23": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhininnāmeti. So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ — ekampi jātiṁ, dvepi jātiyo … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. Seyyathāpi, bhikkhave, puriso sakamhā gāmā aññaṁ gāmaṁ gaccheyya, tamhāpi gāmā aññaṁ gāmaṁ gaccheyya, so tamhā gāmā sakaṁyeva gāmaṁ paccāgaccheyya. Tassa evamassa: ‘Ahaṁ kho sakamhā gāmā amuṁ gāmaṁagacchiṁ, tatrapi evaṁ aṭṭhāsiṁ evaṁ nisīdiṁ evaṁ abhāsiṁ evaṁ tuṇhī ahosiṁ; tamhāpi gāmā amuṁ gāmaṁ agacchiṁ, tatrapi evaṁ aṭṭhāsiṁ evaṁ nisīdiṁ evaṁ abhāsiṁ evaṁ tuṇhī ahosiṁ; somhi tamhā gāmā sakaṁyeva gāmaṁ paccāgato’ti. Evameva kho, bhikkhave, bhikkhu anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ — ekampi jātiṁ dvepi jātiyo … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati.",
    "mn39:24": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate, yathākammūpage satte pajānāti … pe … seyyathāpi, bhikkhave, dveagārā sadvārā. Tattha cakkhumā puriso majjhe ṭhito passeyya manusse gehaṁ pavisantepi nikkhamantepi, anucaṅkamantepi anuvicarantepi. Evameva kho, bhikkhave, bhikkhu dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti … pe … .",
    "mn39:25": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmeti. So ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti. ‘Ime āsavā’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti.",
    "mn39:26": "Seyyathāpi, bhikkhave, pabbatasaṅkhepe udakarahado accho vippasanno anāvilo. Tattha cakkhumā puriso tīre ṭhito passeyyasippisambukampisakkharakathalampi macchagumbampi, carantampi tiṭṭhantampi. Tassa evamassa: ‘Ayaṁ kho udakarahado accho vippasanno anāvilo. Tatrime sippisambukāpi sakkharakathalāpi macchagumbāpi carantipi tiṭṭhantipī’ti’. Evameva kho, bhikkhave, bhikkhu ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti … pe … nāparaṁ itthattāyāti pajānāti.",
    "mn39:27": "Ayaṁ vuccati, bhikkhave, bhikkhu ‘samaṇo’ itipi ‘brāhmaṇo’itipi ‘nhātako’itipi ‘vedagū’itipi ‘sottiyo’itipi ‘ariyo’itipi ‘arahaṁ’itipi.",
    "mn39:28": "Kathañca, bhikkhave, bhikkhu brāhmaṇo hoti? Bāhitāssa honti pāpakā akusalā dhammā, saṅkilesikā, ponobbhavikā, sadarā, dukkhavipākā, āyatiṁ, jātijarāmaraṇiyā. Evaṁ kho, bhikkhave, bhikkhu brāhmaṇo hoti.",
    "mn39:29": "Kathañca, bhikkhave, bhikkhunhātakohoti? Nhātāssa honti pāpakā akusalā dhammā, saṁkilesikā, ponobbhavikā, sadarā, dukkhavipākā, āyatiṁ, jātijarāmaraṇiyā. Evaṁ kho, bhikkhave, bhikkhu nhātako hoti.",
    "mn39:30": "Kathañca, bhikkhave, bhikkhu vedagū hoti? Viditāssa honti pāpakā akusalā dhammā, saṅkilesikā, ponobbhavikā, sadarā, dukkhavipākā, āyatiṁ, jātijarāmaraṇiyā. Evaṁ kho, bhikkhave, bhikkhu vedagū hoti.",
    "mn39:31": "Kathañca, bhikkhave, bhikkhu sottiyo hoti? Nissutāssa honti pāpakā akusalā dhammā, saṅkilesikā, ponobbhavikā, sadarā, dukkhavipākā, āyatiṁ, jātijarāmaraṇiyā. Evaṁ kho, bhikkhave, bhikkhu sottiyo hoti.",
    "mn39:32": "Kathañca, bhikkhave, bhikkhu ariyo hoti? Ārakāssa honti pāpakā akusalā dhammā, saṅkilesikā, ponobbhavikā, sadarā, dukkhavipākā, āyatiṁ, jātijarāmaraṇiyā. Evaṁ kho, bhikkhave, bhikkhu ariyo hoti.",
    "mn39:33": "Kathañca, bhikkhave, bhikkhu arahaṁ hoti? Ārakāssa honti pāpakā akusalā dhammā, saṅkilesikā, ponobbhavikā, sadarā, dukkhavipākā, āyatiṁ, jātijarāmaraṇiyā. Evaṁ kho, bhikkhave, bhikkhu arahaṁ hotī\"ti.",
    "mn39:34": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}