{
    "mn42:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena verañjakā brāhmaṇagahapatikā sāvatthiyaṁ paṭivasanti kenacideva karaṇīyena.",
    "mn42:2": "Atha kho verañjakā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā appekacce bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu; appekacce bhagavatā saddhiṁ sammodiṁsu, sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu; appekacce yena bhagavā tenañjaliṁ paṇāmetvā ekamantaṁ nisīdiṁsu; appekacce bhagavato santike nāmagottaṁ sāvetvā ekamantaṁ nisīdiṁsu; appekacce tuṇhībhūtā ekamantaṁ nisīdiṁsu.",
    "mn42:3": "\"Adhammacariyāvisamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjanti. Dhammacariyāsamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "mn42:4": "\"Na kho mayaṁ imassa bhoto gotamassa saṅkhittena bhāsitassa, vitthārena atthaṁ avibhattassa, vitthārena atthaṁ ājānāma. Sādhu no bhavaṁ gotamo tathā dhammaṁ desetu yathā mayaṁ imassa bhoto gotamassa saṅkhittena bhāsitassa, vitthārena atthaṁ avibhattassa, vitthārena atthaṁ ājāneyyāmā\"ti.",
    "mn42:5": "\"Tividhaṁ kho, gahapatayo, kāyena adhammacārī visamacārī hoti, catubbidhaṁ vācāya adhammacārī visamacārī hoti, tividhaṁ manasā adhammacārī visamacārī hoti.",
    "mn42:6": "Kathañca, gahapatayo, tividhaṁ kāyena adhammacārī visamacārī hoti? Idha, gahapatayo, ekacco pāṇātipātī hoti. Luddo lohitapāṇi hatappahate niviṭṭho adayāpanno pāṇabhūtesu. Adinnādāyī kho pana hoti. Yaṁ taṁ parassa paravittūpakaraṇaṁ … taṁ adinnaṁ theyyasaṅkhātaṁ ādātā hoti. Kāmesumicchācārī kho pana hoti. Yā tā māturakkhitā … tathārūpāsu cārittaṁ āpajjitā hoti. Evaṁ kho, gahapatayo, tividhaṁ kāyena adhammacārī visamacārī hoti.",
    "mn42:7": "Kathañca, gahapatayo, catubbidhaṁ vācāya adhammacārī visamacārī hoti? Idha, gahapatayo, ekacco musāvādī hoti. Sabhāgato vā … sampajānamusā bhāsitā hoti. Pisuṇavāco kho pana hoti. Ito sutvā amutra akkhātā … vaggakaraṇiṁ vācaṁ bhāsitā hoti. Pharusavāco kho pana hoti. Yā sā vācā aṇḍakā kakkasā … tathārūpiṁ vācaṁ bhāsitā hoti. Samphappalāpī kho pana hoti. Akālavādī … apariyantavatiṁ anatthasaṁhitaṁ. Evaṁ kho, gahapatayo, catubbidhaṁ vācāya adhammacārī visamacārī hoti.",
    "mn42:8": "Kathañca, gahapatayo, tividhaṁ manasā adhammacārī visamacārī hoti? Idha, gahapatayo, ekacco abhijjhālu hoti … pe … taṁ mamassā’ti. Byāpannacitto kho pana hoti paduṭṭhamanasaṅkappo: ‘ime sattā haññantu vā … mā vā ahesun’ti. Micchādiṭṭhiko kho pana hoti viparītadassano: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ … sacchikatvā pavedentī’ti. Evaṁ kho, gahapatayo, tividhaṁ manasā adhammacārī visamacārī hoti.",
    "mn42:9": "Evaṁ adhammacariyāvisamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjanti.",
    "mn42:10": "Tividhaṁ kho, gahapatayo, kāyena dhammacārī samacārī hoti, catubbidhaṁ vācāya dhammacārī samacārī hoti, tividhaṁ manasā dhammacārī samacārī hoti.",
    "mn42:11": "Kathañca, gahapatayo, tividhaṁ kāyena dhammacārī samacārī hoti? Idha, gahapatayo, ekacco pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti, nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. Adinnādānaṁ pahāya adinnādānā paṭivirato hoti, yaṁ taṁ parassa … taṁ nādinnaṁ theyyasaṅkhātaṁ ādātā hoti. Kāmesumicchācāraṁ pahāya … tathārūpāsu na cārittaṁ āpajjitā hoti. Evaṁ kho, gahapatayo, tividhaṁ kāyena dhammacārī samacārī hoti.",
    "mn42:12": "Kathañca, gahapatayo, catubbidhaṁ vācāya dhammacārī samacārī hoti? Idha, gahapatayo, ekacco musāvādaṁ pahāya musāvādā paṭivirato hoti. Sabhāgato vā … pe … na sampajānamusā bhāsitā hoti. Pisuṇaṁ vācaṁ pahāya … samaggakaraṇiṁ vācaṁ bhāsitā hoti. Pharusaṁ vācaṁ pahāya … tathārūpaṁ vācaṁ bhāsitā hoti. Samphappalāpaṁ pahāya … kālena sāpadesaṁ pariyantavatiṁ atthasaṁhitaṁ. Evaṁ kho, gahapatayo, catubbidhaṁ vācāya dhammacārī samacārī hoti.",
    "mn42:13": "Kathañca, gahapatayo, tividhaṁ manasā dhammacārī samacārī hoti? Idha, gahapatayo, ekacco anabhijjhālu hoti. Yaṁ taṁ parassa paravittūpakaraṇaṁ taṁ nābhijjhātā hoti: ‘aho vata yaṁ parassa, taṁ mamassā’ti. Abyāpannacitto kho pana hoti appaduṭṭhamanasaṅkappo: ‘ime sattā averā abyābajjhā anīghā sukhī attānaṁ pariharantū’ti. Sammādiṭṭhiko kho pana hoti aviparītadassano: ‘atthi dinnaṁ, atthi yiṭṭhaṁ … sayaṁ abhiññā sacchikatvā pavedentī’ti. Evaṁ kho, gahapatayo, tividhaṁ manasā dhammacārī samacārī hoti.",
    "mn42:14": "Evaṁ dhammacariyāsamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "mn42:15": "Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī: ‘aho vatāhaṁ kāyassa bhedā paraṁ maraṇā khattiyamahāsālānaṁ sahabyataṁ upapajjeyyan’ti; ṭhānaṁ kho panetaṁ vijjati, yaṁ so kāyassa bhedā paraṁ maraṇā khattiyamahāsālānaṁ sahabyataṁ upapajjeyya. Taṁ kissa hetu? Tathā hi so dhammacārī samacārī.",
    "mn42:16": "Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī: ‘aho vatāhaṁ kāyassa bhedā paraṁ maraṇā brāhmaṇamahāsālānaṁ … pe … gahapatimahāsālānaṁ sahabyataṁ upapajjeyyan’ti; ṭhānaṁ kho panetaṁ vijjati, yaṁ so kāyassa bhedā paraṁ maraṇā gahapatimahāsālānaṁ sahabyataṁ upapajjeyya. Taṁ kissa hetu? Tathā hi so dhammacārī samacārī.",
    "mn42:17": "Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī: ‘aho vatāhaṁ kāyassa bhedā paraṁ maraṇā cātumahārājikānaṁ devānaṁ sahabyataṁ upapajjeyyan’ti; ṭhānaṁ kho panetaṁ vijjati, yaṁ so kāyassa bhedā paraṁ maraṇā cātumahārājikānaṁ devānaṁ sahabyataṁ upapajjeyya. Taṁ kissa hetu? Tathā hi so dhammacārī samacārī.",
    "mn42:18": "Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī: ‘aho vatāhaṁ kāyassa bhedā paraṁ maraṇā tāvatiṁsānaṁ devānaṁ … yāmānaṁ devānaṁ … tusitānaṁ devānaṁ … nimmānaratīnaṁ devānaṁ … paranimmitavasavattīnaṁ devānaṁ … brahmakāyikānaṁ devānaṁ sahabyataṁ upapajjeyyan’ti; ṭhānaṁ kho panetaṁ vijjati, yaṁ so kāyassa bhedā paraṁ maraṇā brahmakāyikānaṁ devānaṁ sahabyataṁ upapajjeyya. Taṁ kissa hetu? Tathā hi so dhammacārī samacārī.",
    "mn42:19": "Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī: ‘aho vatāhaṁ kāyassa bhedā paraṁ maraṇā ābhānaṁ devānaṁ sahabyataṁ upapajjeyyan’ti; ṭhānaṁ kho panetaṁ vijjati, yaṁ so kāyassa bhedā paraṁ maraṇā ābhānaṁ devānaṁ sahabyataṁ upapajjeyya. Taṁ kissa hetu? Tathā hi so dhammacārī samacārī.",
    "mn42:20": "Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī: ‘aho vatāhaṁ kāyassa bhedā paraṁ maraṇā parittābhānaṁ devānaṁ … pe … appamāṇābhānaṁ devānaṁ … ābhassarānaṁ devānaṁ … parittasubhānaṁ devānaṁ … appamāṇasubhānaṁ devānaṁ … subhakiṇhānaṁ devānaṁ … vehapphalānaṁ devānaṁ … avihānaṁ devānaṁ … atappānaṁ devānaṁ … sudassānaṁ devānaṁ … sudassīnaṁ devānaṁ … akaniṭṭhānaṁ devānaṁ … ākāsānañcāyatanūpagānaṁ devānaṁ … viññāṇañcāyatanūpagānaṁ devānaṁ … ākiñcaññāyatanūpagānaṁ devānaṁ … nevasaññānāsaññāyatanūpagānaṁ devānaṁ sahabyataṁ upapajjeyyan’ti; ṭhānaṁ kho panetaṁ vijjati, yaṁ so kāyassa bhedā paraṁ maraṇā nevasaññānāsaññāyatanūpagānaṁ devānaṁ sahabyataṁ upapajjeyya. Taṁ kissa hetu? Tathā hi so dhammacārī samacārī.",
    "mn42:21": "Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī: ‘aho vatāhaṁ āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihareyyan’ti; ṭhānaṁ kho panetaṁ vijjati, ‘Yaṁ so āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihareyya. Taṁ kissa hetu? Tathā hi so dhammacārī samacārī’\"ti.",
    "mn42:22": "Evaṁ vutte, verañjakā brāhmaṇagahapatikā bhagavantaṁ etadavocuṁ: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāma dhammañca bhikkhusaṅghañca. Upāsake no bhavaṁ gotamo dhāretu ajjatagge pāṇupete saraṇaṁ gate\"ti."
}