{
    "mn43:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn43:2": "\"‘Duppañño duppañño’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, duppaññoti vuccatī\"ti?",
    "mn43:3": "\"‘Nappajānāti nappajānātī’ti kho, āvuso, tasmā duppaññoti vuccati. Kiñca nappajānāti? ‘Idaṁ dukkhan’ti nappajānāti, ‘Ayaṁ dukkhasamudayo’ti nappajānāti, ‘Ayaṁ dukkhanirodho’ti nappajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti nappajānāti. ‘Nappajānāti nappajānātī’ti kho, āvuso, tasmā duppaññoti vuccatī\"ti.",
    "mn43:4": "\"Sādhāvuso\"ti kho āyasmā mahākoṭṭhiko āyasmato sāriputtassa bhāsitaṁ abhinanditvā anumoditvā āyasmantaṁ sāriputtaṁ uttariṁ pañhaṁ apucchi:",
    "mn43:5": "\"‘Paññavā paññavā’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, paññavāti vuccatī\"ti?",
    "mn43:6": "\"‘Pajānāti pajānātī’ti kho, āvuso, tasmā paññavāti vuccati. Kiñca pajānāti? ‘Idaṁ dukkhan’ti pajānāti, ‘Ayaṁ dukkhasamudayo’ti pajānāti, ‘Ayaṁ dukkhanirodho’ti pajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti pajānāti. ‘Pajānāti pajānātī’ti kho, āvuso, tasmā paññavāti vuccatī\"ti.",
    "mn43:7": "\"‘Viññāṇaṁ viññāṇan’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, viññāṇanti vuccatī\"ti?",
    "mn43:8": "\"‘Vijānāti vijānātī’ti kho, āvuso, tasmā viññāṇanti vuccati. Kiñca vijānāti? Sukhantipi vijānāti, dukkhantipi vijānāti, adukkhamasukhantipi vijānāti. ‘Vijānāti vijānātī’ti kho, āvuso, tasmā viññāṇanti vuccatī\"ti.",
    "mn43:9": "\"Yā cāvuso, paññā yañca viññāṇaṁ — ime dhammā saṁsaṭṭhā udāhu visaṁsaṭṭhā? Labbhā ca panimesaṁ dhammānaṁvinibbhujitvā vinibbhujitvānānākaraṇaṁ paññāpetun\"ti?",
    "mn43:10": "\"Yā cāvuso, paññā yañca viññāṇaṁ — imesaṁ dhammānaṁ saṁsaṭṭhānaṁ no visaṁsaṭṭhānaṁ kiṁ nānākaraṇan\"ti?",
    "mn43:11": "\"‘Vedanā vedanā’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, vedanāti vuccatī\"ti?",
    "mn43:12": "\"‘Vedeti vedetī’ti kho, āvuso, tasmā vedanāti vuccati. Kiñca vedeti? Sukhampi vedeti, dukkhampi vedeti, adukkhamasukhampi vedeti. ‘Vedeti vedetī’ti kho, āvuso, tasmā vedanāti vuccatī\"ti.",
    "mn43:13": "\"‘Saññā saññā’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, saññāti vuccatī\"ti?",
    "mn43:14": "\"‘Sañjānāti sañjānātī’ti kho, āvuso, tasmā saññāti vuccati. Kiñca sañjānāti? Nīlakampi sañjānāti, pītakampi sañjānāti, lohitakampi sañjānāti, odātampi sañjānāti. ‘Sañjānāti sañjānātī’ti kho, āvuso, tasmā saññāti vuccatī\"ti.",
    "mn43:15": "\"Yā cāvuso, vedanā yā ca saññā yañca viññāṇaṁ — ime dhammā saṁsaṭṭhā, no visaṁsaṭṭhā. Na ca labbhā imesaṁ dhammānaṁ vinibbhujitvā vinibbhujitvā nānākaraṇaṁ paññāpetuṁ.Yaṁ hāvuso, vedeti taṁ sañjānāti, yaṁ sañjānāti taṁ vijānāti. Tasmā ime dhammā saṁsaṭṭhā no visaṁsaṭṭhā. Na ca labbhā imesaṁ dhammānaṁ vinibbhujitvā vinibbhujitvā nānākaraṇaṁ paññāpetun\"ti.",
    "mn43:16": "\"Nissaṭṭhena hāvuso, pañcahi indriyehi parisuddhena manoviññāṇena kiṁ neyyan\"ti?",
    "mn43:17": "\"Nissaṭṭhena, āvuso, pañcahi indriyehi parisuddhena manoviññāṇena ‘ananto ākāso’ti ākāsānañcāyatanaṁ neyyaṁ, ‘anantaṁ viññāṇan’ti viññāṇañcāyatanaṁ neyyaṁ, ‘Natthi kiñcī’ti ākiñcaññāyatanaṁ neyyan\"ti.",
    "mn43:18": "\"Neyyaṁ panāvuso, dhammaṁ kena pajānātī\"ti?",
    "mn43:19": "\"Neyyaṁ kho, āvuso, dhammaṁ paññācakkhunā pajānātī\"ti.",
    "mn43:20": "\"Paññā panāvuso, kimatthiyā\"ti?",
    "mn43:21": "\"Paññā kho, āvuso, abhiññatthā pariññatthā pahānatthā\"ti.",
    "mn43:22": "\"Kati panāvuso, paccayā sammādiṭṭhiyā uppādāyā\"ti?",
    "mn43:23": "\"Dve kho, āvuso, paccayā sammādiṭṭhiyā uppādāya — parato ca ghoso, yoniso ca manasikāro. Ime kho, āvuso, dve paccayā sammādiṭṭhiyā uppādāyā\"ti.",
    "mn43:24": "\"Katihi panāvuso, aṅgehi anuggahitā sammādiṭṭhi cetovimuttiphalā ca hoti cetovimuttiphalānisaṁsā ca, paññāvimuttiphalā ca hoti paññāvimuttiphalānisaṁsā cā\"ti?",
    "mn43:25": "\"Pañcahi kho, āvuso, aṅgehi anuggahitā sammādiṭṭhi cetovimuttiphalā ca hoti cetovimuttiphalānisaṁsā ca, paññāvimuttiphalā ca hoti paññāvimuttiphalānisaṁsā ca. Idhāvuso, sammādiṭṭhi sīlānuggahitā ca hoti, sutānuggahitā ca hoti, sākacchānuggahitā ca hoti, samathānuggahitā ca hoti, vipassanānuggahitā ca hoti. Imehi kho, āvuso, pañcahaṅgehi anuggahitā sammādiṭṭhi cetovimuttiphalā ca hoti cetovimuttiphalānisaṁsā ca, paññāvimuttiphalā ca hoti paññāvimuttiphalānisaṁsā cā\"ti.",
    "mn43:26": "\"Kati panāvuso, bhavā\"ti?",
    "mn43:27": "\"Tayome, āvuso, bhavā — kāmabhavo, rūpabhavo, arūpabhavo\"ti.",
    "mn43:28": "\"Kathaṁ panāvuso, āyatiṁ punabbhavābhinibbatti hotī\"ti?",
    "mn43:29": "\"Avijjānīvaraṇānaṁ kho, āvuso, sattānaṁ taṇhāsaṁyojanānaṁ tatratatrābhinandanā — evaṁ āyatiṁ punabbhavābhinibbatti hotī\"ti.",
    "mn43:30": "\"Kathaṁ panāvuso, āyatiṁ punabbhavābhinibbatti na hotī\"ti?",
    "mn43:31": "\"Avijjāvirāgā kho, āvuso, vijjuppādā taṇhānirodhā — evaṁ āyatiṁ punabbhavābhinibbatti na hotī\"ti.",
    "mn43:32": "\"Katamaṁ panāvuso, paṭhamaṁ jhānan\"ti?",
    "mn43:33": "\"Idhāvuso, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati — idaṁ vuccati, āvuso, paṭhamaṁ jhānan\"ti.",
    "mn43:34": "\"Paṭhamaṁ panāvuso, jhānaṁ katiaṅgikan\"ti?",
    "mn43:35": "\"Paṭhamaṁ kho, āvuso, jhānaṁ pañcaṅgikaṁ. Idhāvuso, paṭhamaṁ jhānaṁ samāpannassa bhikkhuno vitakko ca vattati, vicāro ca pīti ca sukhañca cittekaggatā ca. Paṭhamaṁ kho, āvuso, jhānaṁ evaṁ pañcaṅgikan\"ti.",
    "mn43:36": "\"Paṭhamaṁ panāvuso, jhānaṁ kataṅgavippahīnaṁ kataṅgasamannāgatan\"ti?",
    "mn43:37": "\"Paṭhamaṁ kho, āvuso, jhānaṁ pañcaṅgavippahīnaṁ, pañcaṅgasamannāgataṁ. Idhāvuso, paṭhamaṁ jhānaṁ samāpannassa bhikkhuno kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṁ pahīnaṁ hoti, uddhaccakukkuccaṁ pahīnaṁ hoti, vicikicchā pahīnā hoti; vitakko ca vattati, vicāro ca pīti ca sukhañca cittekaggatā ca. Paṭhamaṁ kho, āvuso, jhānaṁ evaṁ pañcaṅgavippahīnaṁ pañcaṅgasamannāgatan\"ti.",
    "mn43:38": "\"Pañcimāni, āvuso, indriyāni nānāvisayāni nānāgocarāni, na aññamaññassa gocaravisayaṁ paccanubhonti, seyyathidaṁ — cakkhundriyaṁ, sotindriyaṁ, ghānindriyaṁ, jivhindriyaṁ, kāyindriyaṁ. Imesaṁ kho, āvuso, pañcannaṁ indriyānaṁ nānāvisayānaṁ nānāgocarānaṁ, na aññamaññassa gocaravisayaṁ paccanubhontānaṁ, kiṁ paṭisaraṇaṁ, ko ca nesaṁ gocaravisayaṁ paccanubhotī\"ti?",
    "mn43:39": "\"Pañcimāni, āvuso, indriyāni nānāvisayāni nānāgocarāni, na aññamaññassa gocaravisayaṁ paccanubhonti, seyyathidaṁ — cakkhundriyaṁ, sotindriyaṁ, ghānindriyaṁ, jivhindriyaṁ, kāyindriyaṁ. Imesaṁ kho, āvuso, pañcannaṁ indriyānaṁ nānāvisayānaṁ nānāgocarānaṁ, na aññamaññassa gocaravisayaṁ paccanubhontānaṁ, mano paṭisaraṇaṁ, mano ca nesaṁ gocaravisayaṁ paccanubhotī\"ti.",
    "mn43:40": "\"Pañcimāni, āvuso, indriyāni, seyyathidaṁ — cakkhundriyaṁ, sotindriyaṁ, ghānindriyaṁ, jivhindriyaṁ, kāyindriyaṁ. Imāni kho, āvuso, pañcindriyāni kiṁ paṭicca tiṭṭhantī\"ti?",
    "mn43:41": "\"Pañcimāni, āvuso, indriyāni, seyyathidaṁ — cakkhundriyaṁ, sotindriyaṁ, ghānindriyaṁ, jivhindriyaṁ, kāyindriyaṁ. Imāni kho, āvuso, pañcindriyāni āyuṁ paṭicca tiṭṭhantī\"ti.",
    "mn43:42": "\"Āyu panāvuso, kiṁ paṭicca tiṭṭhatī\"ti?",
    "mn43:43": "\"Āyu usmaṁ paṭicca tiṭṭhatī\"ti.",
    "mn43:44": "\"Usmā panāvuso, kiṁ paṭicca tiṭṭhatī\"ti?",
    "mn43:45": "\"Usmā āyuṁ paṭicca tiṭṭhatī\"ti.",
    "mn43:46": "\"Idāneva kho mayaṁ, āvuso, āyasmato sāriputtassa bhāsitaṁ evaṁ ājānāma: ‘āyu usmaṁ paṭicca tiṭṭhatī’ti. Idāneva pana mayaṁ, āvuso, āyasmato sāriputtassa bhāsitaṁ evaṁ ājānāma: ‘usmā āyuṁ paṭicca tiṭṭhatī’ti. Yathā kathaṁ panāvuso, imassa bhāsitassa attho daṭṭhabbo\"ti?",
    "mn43:47": "\"Tena hāvuso, upamaṁ te karissāmi; upamāyapidhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Seyyathāpi, āvuso, telappadīpassa jhāyato acciṁ paṭicca ābhā paññāyati, ābhaṁ paṭicca acci paññāyati; evameva kho, āvuso, āyu usmaṁ paṭicca tiṭṭhati, usmā āyuṁ paṭicca tiṭṭhatī\"ti.",
    "mn43:48": "\"Teva nu kho, āvuso, āyusaṅkhārā, te vedaniyā dhammā udāhu aññe āyusaṅkhārā aññe vedaniyā dhammā\"ti?",
    "mn43:49": "\"Na kho, āvuso, teva āyusaṅkhārā te vedaniyā dhammā. Te ca hāvuso, āyusaṅkhārā abhaviṁsu te vedaniyā dhammā, na yidaṁ saññāvedayitanirodhaṁ samāpannassa bhikkhuno vuṭṭhānaṁ paññāyetha. Yasmā ca kho, āvuso, aññe āyusaṅkhārā aññe vedaniyā dhammā, tasmā saññāvedayitanirodhaṁ samāpannassa bhikkhuno vuṭṭhānaṁ paññāyatī\"ti.",
    "mn43:50": "\"Yadā nu kho, āvuso, imaṁ kāyaṁ kati dhammā jahanti; athāyaṁ kāyo ujjhito avakkhitto seti, yathā kaṭṭhaṁ acetanan\"ti?",
    "mn43:51": "\"Yadā kho, āvuso, imaṁ kāyaṁ tayo dhammā jahanti — āyu usmā ca viññāṇaṁ; athāyaṁ kāyo ujjhito avakkhitto seti, yathā kaṭṭhaṁ acetanan\"ti.",
    "mn43:52": "\"Yvāyaṁ, āvuso, mato kālaṅkato, yo cāyaṁ bhikkhu saññāvedayitanirodhaṁ samāpanno — imesaṁ kiṁ nānākaraṇan\"ti?",
    "mn43:53": "\"Yvāyaṁ, āvuso, mato kālaṅkato tassa kāyasaṅkhārā niruddhā paṭippassaddhā, vacīsaṅkhārā niruddhā paṭippassaddhā, cittasaṅkhārā niruddhā paṭippassaddhā, āyu parikkhīṇo, usmā vūpasantā, indriyāni paribhinnāni. Yo cāyaṁ bhikkhu saññāvedayitanirodhaṁ samāpanno tassapi kāyasaṅkhārā niruddhā paṭippassaddhā, vacīsaṅkhārā niruddhā paṭippassaddhā, cittasaṅkhārā niruddhā paṭippassaddhā, āyu na parikkhīṇo, usmā avūpasantā, indriyāni vippasannāni. Yvāyaṁ, āvuso, mato kālaṅkato, yo cāyaṁ bhikkhu saññāvedayitanirodhaṁ samāpanno — idaṁ nesaṁ nānākaraṇan\"ti.",
    "mn43:54": "\"Kati panāvuso, paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā\"ti?",
    "mn43:55": "\"Cattāro kho, āvuso, paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā. Idhāvuso, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. Ime kho, āvuso, cattāro paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā\"ti.",
    "mn43:56": "\"Kati panāvuso, paccayā animittāya cetovimuttiyā samāpattiyā\"ti?",
    "mn43:57": "\"Dve kho, āvuso, paccayā animittāya cetovimuttiyā samāpattiyā –  sabbanimittānañca amanasikāro, animittāya ca dhātuyā manasikāro. Ime kho, āvuso, dve paccayā animittāya cetovimuttiyā samāpattiyā\"ti.",
    "mn43:58": "\"Kati panāvuso, paccayā animittāya cetovimuttiyā ṭhitiyā\"ti?",
    "mn43:59": "\"Tayo kho, āvuso, paccayā animittāya cetovimuttiyā ṭhitiyā — sabbanimittānañca amanasikāro, animittāya ca dhātuyā manasikāro, pubbe ca abhisaṅkhāro. Ime kho, āvuso, tayo paccayā animittāya cetovimuttiyā ṭhitiyā\"ti.",
    "mn43:60": "\"Kati panāvuso, paccayā animittāya cetovimuttiyā vuṭṭhānāyā\"ti?",
    "mn43:61": "\"Dve kho, āvuso, paccayā animittāya cetovimuttiyā vuṭṭhānāya –  sabbanimittānañca manasikāro, animittāya ca dhātuyā amanasikāro. Ime kho, āvuso, dve paccayā animittāya cetovimuttiyā vuṭṭhānāyā\"ti.",
    "mn43:62": "\"Yā cāyaṁ, āvuso, appamāṇā cetovimutti, yā ca ākiñcaññā cetovimutti, yā ca suññatā cetovimutti, yā ca animittā cetovimutti — ime dhammā nānātthā ceva nānābyañjanā ca udāhu ekatthā byañjanameva nānan\"ti?",
    "mn43:63": "\"Yā cāyaṁ, āvuso, appamāṇā cetovimutti, yā ca ākiñcaññā cetovimutti, yā ca suññatā cetovimutti, yā ca animittā cetovimutti — atthi kho, āvuso, pariyāyo yaṁ pariyāyaṁ āgamma ime dhammā nānātthā ceva nānābyañjanā ca; atthi ca kho, āvuso, pariyāyo yaṁ pariyāyaṁ āgamma ime dhammā ekatthā, byañjanameva nānaṁ.",
    "mn43:64": "Katamo cāvuso, pariyāyo yaṁ pariyāyaṁ āgamma ime dhammā nānātthā ceva nānābyañjanā ca?",
    "mn43:65": "Idhāvuso, bhikkhu mettāsahagatena cetasā ekaṁ disaṁ pharitvā viharati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Karuṇāsahagatena cetasā … pe … muditāsahagatena cetasā … upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā viharati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Ayaṁ vuccatāvuso, appamāṇā cetovimutti.",
    "mn43:66": "Katamā cāvuso, ākiñcaññā cetovimutti?",
    "mn43:67": "Idhāvuso, bhikkhu sabbaso viññāṇañcāyatanaṁ samatikkamma natthi kiñcīti ākiñcaññāyatanaṁ upasampajja viharati. Ayaṁ vuccatāvuso, ākiñcaññā cetovimutti.",
    "mn43:68": "Katamā cāvuso, suññatā cetovimutti?",
    "mn43:69": "Idhāvuso, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati: ‘suññamidaṁ attena vā attaniyena vā’ti. Ayaṁ vuccatāvuso, suññatā cetovimutti.",
    "mn43:70": "Katamā cāvuso, animittā cetovimutti?",
    "mn43:71": "Idhāvuso, bhikkhu sabbanimittānaṁ amanasikārā animittaṁ cetosamādhiṁ upasampajja viharati. Ayaṁ vuccatāvuso, animittā cetovimutti. Ayaṁ kho, āvuso, pariyāyo yaṁ pariyāyaṁ āgamma ime dhammā nānātthā ceva nānābyañjanā ca.",
    "mn43:72": "Katamo cāvuso, pariyāyo yaṁ pariyāyaṁ āgamma ime dhammā ekatthā byañjanameva nānaṁ?",
    "mn43:73": "Rāgo kho, āvuso, pamāṇakaraṇo, doso pamāṇakaraṇo, moho pamāṇakaraṇo. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anuppādadhammā. Yāvatā kho, āvuso, appamāṇā cetovimuttiyo, akuppā tāsaṁ cetovimutti aggamakkhāyati. Sā kho panākuppā cetovimutti suññā rāgena, suññā dosena, suññā mohena.",
    "mn43:74": "Idamavocāyasmā sāriputto. Attamano āyasmā mahākoṭṭhiko āyasmato sāriputtassa bhāsitaṁ abhinandīti."
}