{
    "mn44:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho visākho upāsako yena dhammadinnā bhikkhunī tenupasaṅkami; upasaṅkamitvā dhammadinnaṁ bhikkhuniṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho visākho upāsako dhammadinnaṁ bhikkhuniṁ etadavoca:",
    "mn44:2": "\"Sādhayye\"ti kho visākho upāsako dhammadinnāya bhikkhuniyā bhāsitaṁ abhinanditvā anumoditvā dhammadinnaṁ bhikkhuniṁ uttariṁ pañhaṁ apucchi:",
    "mn44:3": "\"‘Sakkāyanirodho sakkāyanirodho’ti, ayye, vuccati. Katamo nu kho, ayye, sakkāyanirodho vutto bhagavatā\"ti?",
    "mn44:4": "\"Yo kho, āvuso visākha, tassāyeva taṇhāya asesavirāganirodho cāgo paṭinissaggo mutti anālayo; ayaṁ kho, āvuso visākha, sakkāyanirodho vutto bhagavatā\"ti.",
    "mn44:5": "\"‘Sakkāyanirodhagāminī paṭipadā sakkāyanirodhagāminī paṭipadā’ti, ayye, vuccati. Katamā nu kho, ayye, sakkāyanirodhagāminī paṭipadā vuttā bhagavatā\"ti?",
    "mn44:6": "\"Ayameva kho, āvuso visākha, ariyo aṭṭhaṅgiko maggo sakkāyanirodhagāminī paṭipadā vuttā bhagavatā, seyyathidaṁ — sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhī\"ti.",
    "mn44:7": "\"Taññeva nu kho, ayye, upādānaṁtepañcupādānakkhandhā udāhu aññatra pañcahupādānakkhandhehi upādānan\"ti? \"Na kho, āvuso visākha, taññeva upādānaṁ te pañcupādānakkhandhā, nāpi aññatra pañcahupādānakkhandhehi upādānaṁ. Yo kho, āvuso visākha, pañcasu upādānakkhandhesu chandarāgo taṁ tattha upādānan\"ti.",
    "mn44:8": "\"Kathaṁ panāyye, sakkāyadiṭṭhi hotī\"ti?",
    "mn44:9": "\"Kathaṁ panāyye, sakkāyadiṭṭhi na hotī\"ti?",
    "mn44:10": "\"Idhāvuso visākha, sutavā ariyasāvako, ariyānaṁ dassāvī ariyadhammassa kovido ariyadhamme suvinīto, sappurisānaṁ dassāvī sappurisadhammassa kovido sappurisadhamme suvinīto, na rūpaṁ attato samanupassati, na rūpavantaṁ vā attānaṁ, na attani vā rūpaṁ, na rūpasmiṁ vā attānaṁ. Na vedanaṁ … pe … na saññaṁ … na saṅkhāre … pe … na viññāṇaṁ attato samanupassati, na viññāṇavantaṁ vā attānaṁ, na attani vā viññāṇaṁ, na viññāṇasmiṁ vā attānaṁ. Evaṁ kho, āvuso visākha, sakkāyadiṭṭhi na hotī\"ti.",
    "mn44:11": "\"Katamo panāyye, ariyo aṭṭhaṅgiko maggo\"ti?",
    "mn44:12": "\"Ayameva kho, āvuso visākha, ariyo aṭṭhaṅgiko maggo, seyyathidaṁ — sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhī\"ti.",
    "mn44:13": "\"Ariyo panāyye, aṭṭhaṅgiko maggo saṅkhato udāhu asaṅkhato\"ti?",
    "mn44:14": "\"Ariyo kho, āvuso visākha, aṭṭhaṅgiko maggo saṅkhato\"ti.",
    "mn44:15": "\"Ariyena nu kho, ayye, aṭṭhaṅgikena maggena tayo khandhā saṅgahitā udāhu tīhi khandhehi ariyo aṭṭhaṅgiko maggo saṅgahito\"ti?",
    "mn44:16": "\"Na kho, āvuso visākha, ariyena aṭṭhaṅgikena maggena tayo khandhā saṅgahitā; tīhi ca kho, āvuso visākha, khandhehi ariyo aṭṭhaṅgiko maggo saṅgahito. Yā cāvuso visākha, sammāvācā yo ca sammākammanto yo ca sammāājīvo ime dhammā sīlakkhandhe saṅgahitā. Yo ca sammāvāyāmo yā ca sammāsati yo ca sammāsamādhi ime dhammā samādhikkhandhe saṅgahitā. Yā ca sammādiṭṭhi yo ca sammāsaṅkappo, ime dhammā paññākkhandhe saṅgahitā\"ti.",
    "mn44:17": "\"Katamo panāyye, samādhi, katame dhammā samādhinimittā, katame dhammā samādhiparikkhārā, katamā samādhibhāvanā\"ti?",
    "mn44:18": "\"Yā kho, āvuso visākha, cittassa ekaggatā ayaṁ samādhi; cattāro satipaṭṭhānā samādhinimittā; cattāro sammappadhānā samādhiparikkhārā. Yā tesaṁyeva dhammānaṁ āsevanā bhāvanā bahulīkammaṁ, ayaṁ ettha samādhibhāvanā\"ti.",
    "mn44:19": "\"Kati panāyye, saṅkhārā\"ti?",
    "mn44:20": "\"Tayome, āvuso visākha, saṅkhārā — kāyasaṅkhāro, vacīsaṅkhāro, cittasaṅkhāro\"ti.",
    "mn44:21": "\"Katamo panāyye, kāyasaṅkhāro, katamo vacīsaṅkhāro, katamo cittasaṅkhāro\"ti?",
    "mn44:22": "\"Assāsapassāsā kho, āvuso visākha, kāyasaṅkhāro, vitakkavicārā vacīsaṅkhāro, saññā ca vedanā ca cittasaṅkhāro\"ti.",
    "mn44:23": "\"Kasmā panāyye, assāsapassāsā kāyasaṅkhāro, kasmā vitakkavicārā vacīsaṅkhāro, kasmā saññā ca vedanā ca cittasaṅkhāro\"ti?",
    "mn44:24": "\"Assāsapassāsā kho, āvuso visākha, kāyikā ete dhammā kāyappaṭibaddhā, tasmā assāsapassāsā kāyasaṅkhāro. Pubbe kho, āvuso visākha, vitakketvā vicāretvā pacchā vācaṁ bhindati, tasmā vitakkavicārā vacīsaṅkhāro. Saññā ca vedanā ca cetasikā ete dhammā cittappaṭibaddhā, tasmā saññā ca vedanā ca cittasaṅkhāro\"ti.",
    "mn44:25": "\"Kathaṁ panāyye, saññāvedayitanirodhasamāpatti hotī\"ti?",
    "mn44:26": "\"Na kho, āvuso visākha, saññāvedayitanirodhaṁ samāpajjantassa bhikkhuno evaṁ hoti: ‘Ahaṁ saññāvedayitanirodhaṁ samāpajjissan’ti vā, ‘Ahaṁ saññāvedayitanirodhaṁ samāpajjāmī’ti vā, ‘Ahaṁ saññāvedayitanirodhaṁ samāpanno’ti vā. Atha khvāssa pubbeva tathā cittaṁ bhāvitaṁ hoti yaṁ taṁ tathattāya upanetī\"ti.",
    "mn44:27": "\"Saññāvedayitanirodhaṁ samāpajjantassa panāyye, bhikkhuno katame dhammā paṭhamaṁ nirujjhanti — yadi vā kāyasaṅkhāro, yadi vā vacīsaṅkhāro, yadi vā cittasaṅkhāro\"ti?",
    "mn44:28": "\"Saññāvedayitanirodhaṁ samāpajjantassa kho, āvuso visākha, bhikkhuno paṭhamaṁ nirujjhati vacīsaṅkhāro, tato kāyasaṅkhāro, tato cittasaṅkhāro\"ti.",
    "mn44:29": "\"Kathaṁ panāyye, saññāvedayitanirodhasamāpattiyā vuṭṭhānaṁ hotī\"ti?",
    "mn44:30": "\"Na kho, āvuso visākha, saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa bhikkhuno evaṁ hoti: ‘Ahaṁ saññāvedayitanirodhasamāpattiyā vuṭṭhahissan’ti vā, ‘Ahaṁ saññāvedayitanirodhasamāpattiyā vuṭṭhahāmī’ti vā, ‘Ahaṁ saññāvedayitanirodhasamāpattiyā vuṭṭhito’ti vā. Atha khvāssa pubbeva tathā cittaṁ bhāvitaṁ hoti yaṁ taṁ tathattāya upanetī\"ti.",
    "mn44:31": "\"Saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa panāyye, bhikkhuno katame dhammā paṭhamaṁ uppajjanti — yadi vā kāyasaṅkhāro, yadi vā vacīsaṅkhāro, yadi vā cittasaṅkhāro\"ti?",
    "mn44:32": "\"Saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa kho, āvuso visākha, bhikkhuno paṭhamaṁ uppajjati cittasaṅkhāro, tato kāyasaṅkhāro, tato vacīsaṅkhāro\"ti.",
    "mn44:33": "\"Saññāvedayitanirodhasamāpattiyā vuṭṭhitaṁ panāyye, bhikkhuṁ kati phassā phusantī\"ti?",
    "mn44:34": "\"Saññāvedayitanirodhasamāpattiyā vuṭṭhitaṁ kho, āvuso visākha, bhikkhuṁ tayo phassā phusanti — suññato phasso, animitto phasso, appaṇihito phasso\"ti.",
    "mn44:35": "\"Saññāvedayitanirodhasamāpattiyā vuṭṭhitassa panāyye, bhikkhuno kiṁninnaṁ cittaṁ hoti kiṁpoṇaṁ kiṁpabbhāran\"ti?",
    "mn44:36": "\"Saññāvedayitanirodhasamāpattiyā vuṭṭhitassa kho, āvuso visākha, bhikkhuno vivekaninnaṁ cittaṁ hoti, vivekapoṇaṁ vivekapabbhāran\"ti.",
    "mn44:37": "\"Kati panāyye, vedanā\"ti?",
    "mn44:38": "\"Tisso kho imā, āvuso visākha, vedanā — sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā\"ti.",
    "mn44:39": "\"Katamā panāyye, sukhā vedanā, katamā dukkhā vedanā, katamā adukkhamasukhā vedanā\"ti?",
    "mn44:40": "\"Yaṁ kho, āvuso visākha, kāyikaṁ vā cetasikaṁ vā sukhaṁ sātaṁ vedayitaṁ — ayaṁ sukhā vedanā. Yaṁ kho, āvuso visākha, kāyikaṁ vā cetasikaṁ vā dukkhaṁ asātaṁ vedayitaṁ — ayaṁ dukkhā vedanā. Yaṁ kho, āvuso visākha, kāyikaṁ vā cetasikaṁ vā neva sātaṁ nāsātaṁ vedayitaṁ — ayaṁ adukkhamasukhā vedanā\"ti.",
    "mn44:41": "\"Sukhā panāyye, vedanā kiṁsukhā kiṁdukkhā, dukkhā vedanā kiṁsukhā kiṁdukkhā, adukkhamasukhā vedanā kiṁsukhā kiṁdukkhā\"ti?",
    "mn44:42": "\"Sukhā kho, āvuso visākha, vedanā ṭhitisukhā vipariṇāmadukkhā; dukkhā vedanā ṭhitidukkhā vipariṇāmasukhā; adukkhamasukhā vedanā ñāṇasukhā aññāṇadukkhā\"ti.",
    "mn44:43": "\"Sukhāya panāyye, vedanāya kiṁ anusayo anuseti, dukkhāya vedanāya kiṁ anusayo anuseti, adukkhamasukhāya vedanāya kiṁ anusayo anusetī\"ti?",
    "mn44:44": "\"Sukhāya kho, āvuso visākha, vedanāya rāgānusayo anuseti, dukkhāya vedanāya paṭighānusayo anuseti, adukkhamasukhāya vedanāya avijjānusayo anusetī\"ti.",
    "mn44:45": "\"Sabbāya nu kho, ayye, sukhāya vedanāya rāgānusayo anuseti, sabbāya dukkhāya vedanāya paṭighānusayo anuseti, sabbāya adukkhamasukhāya vedanāya avijjānusayo anusetī\"ti?",
    "mn44:46": "\"Na kho, āvuso visākha, sabbāya sukhāya vedanāya rāgānusayo anuseti, na sabbāya dukkhāya vedanāya paṭighānusayo anuseti, na sabbāya adukkhamasukhāya vedanāya avijjānusayo anusetī\"ti.",
    "mn44:47": "\"Sukhāya panāyye, vedanāya kiṁ pahātabbaṁ, dukkhāya vedanāya kiṁ pahātabbaṁ, adukkhamasukhāya vedanāya kiṁ pahātabban\"ti?",
    "mn44:48": "\"Sukhāya kho, āvuso visākha, vedanāya rāgānusayo pahātabbo, dukkhāya vedanāya paṭighānusayo pahātabbo, adukkhamasukhāya vedanāya avijjānusayo pahātabbo\"ti.",
    "mn44:49": "\"Sabbāya nu kho, ayye, sukhāya vedanāya rāgānusayo pahātabbo, sabbāya dukkhāya vedanāya paṭighānusayo pahātabbo, sabbāya adukkhamasukhāya vedanāya avijjānusayo pahātabbo\"ti?",
    "mn44:50": "\"Na kho, āvuso visākha, sabbāya sukhāya vedanāya rāgānusayo pahātabbo, na sabbāya dukkhāya vedanāya paṭighānusayo pahātabbo, na sabbāya adukkhamasukhāya vedanāya avijjānusayo pahātabbo.",
    "mn44:51": "\"Sukhāya panāyye, vedanāya kiṁ paṭibhāgo\"ti?",
    "mn44:52": "\"Sukhāya kho, āvuso visākha, vedanāya dukkhā vedanā paṭibhāgo\"ti.",
    "mn44:53": "\"Dukkhāya pannāyye, vedanāya kiṁ paṭibhāgo\"ti?",
    "mn44:54": "\"Dukkhāya kho, āvuso visākha, vedanāya sukhā vedanā paṭibhāgo\"ti.",
    "mn44:55": "\"Adukkhamasukhāya panāyye, vedanāya kiṁ paṭibhāgo\"ti?",
    "mn44:56": "\"Adukkhamasukhāya kho, āvuso visākha, vedanāya avijjā paṭibhāgo\"ti.",
    "mn44:57": "\"Avijjāya panāyye, kiṁ paṭibhāgo\"ti?",
    "mn44:58": "\"Avijjāya kho, āvuso visākha, vijjā paṭibhāgo\"ti.",
    "mn44:59": "\"Vijjāya panāyye, kiṁ paṭibhāgo\"ti?",
    "mn44:60": "\"Vijjāya kho, āvuso visākha, vimutti paṭibhāgo\"ti.",
    "mn44:61": "\"Vimuttiyā panāyye, kiṁ paṭibhāgo\"ti?",
    "mn44:62": "\"Vimuttiyā kho, āvuso visākha, nibbānaṁ paṭibhāgo\"ti.",
    "mn44:63": "\"Nibbānassa panāyye, kiṁ paṭibhāgo\"ti? \"",
    "mn44:64": "Atha kho visākho upāsako dhammadinnāya bhikkhuniyā bhāsitaṁ abhinanditvā anumoditvā uṭṭhāyāsanā dhammadinnaṁ bhikkhuniṁ abhivādetvā padakkhiṇaṁ katvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho visākho upāsako yāvatako ahosi dhammadinnāya bhikkhuniyā saddhiṁ kathāsallāpo taṁ sabbaṁ bhagavato ārocesi. Evaṁ vutte, bhagavā visākhaṁ upāsakaṁ etadavoca:",
    "mn44:65": "Idamavoca bhagavā. Attamano visākho upāsako bhagavato bhāsitaṁ abhinandīti."
}