{
    "mn47:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn47:2": "\"Vīmaṁsakena, bhikkhave, bhikkhunā parassa cetopariyāyaṁ ajānantena dvīsu dhammesu tathāgato samannesitabbo cakkhusotaviññeyyesu dhammesu: ‘ye saṅkiliṭṭhā cakkhusotaviññeyyā dhammā, saṁvijjanti vā te tathāgatassa no vā’ti? Tamenaṁ samannesamāno evaṁ jānāti: ‘ye saṅkiliṭṭhā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṁvijjantī’ti.(1)",
    "mn47:3": "Yato naṁ samannesamāno evaṁ jānāti: ‘ye saṅkiliṭṭhā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṁvijjantī’ti, tato naṁ uttariṁ samannesati: ‘ye vītimissā cakkhusotaviññeyyā dhammā, saṁvijjanti vā te tathāgatassa no vā’ti? Tamenaṁ samannesamāno evaṁ jānāti: ‘ye vītimissā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṁvijjantī’ti.(2)",
    "mn47:4": "Yato naṁ samannesamāno evaṁ jānāti: ‘ye vītimissā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṁvijjantī’ti, tato naṁ uttariṁ samannesati: ‘ye vodātā cakkhusotaviññeyyā dhammā, saṁvijjanti vā te tathāgatassa no vā’ti? Tamenaṁ samannesamāno evaṁ jānāti: ‘ye vodātā cakkhusotaviññeyyā dhammā, saṁvijjanti te tathāgatassā’ti.(3)",
    "mn47:5": "Yato naṁ samannesamāno evaṁ jānāti: ‘ye vodātā cakkhusotaviññeyyā dhammā, saṁvijjanti te tathāgatassā’ti, tato naṁ uttariṁ samannesati: ‘dīgharattaṁ samāpanno ayamāyasmā imaṁ kusalaṁ dhammaṁ, udāhu ittarasamāpanno’ti? Tamenaṁ samannesamāno evaṁ jānāti: ‘dīgharattaṁ samāpanno ayamāyasmā imaṁ kusalaṁ dhammaṁ, nāyamāyasmā ittarasamāpanno’ti.(4)",
    "mn47:6": "Yato naṁ samannesamāno evaṁ jānāti: ‘dīgharattaṁ samāpanno ayamāyasmā imaṁ kusalaṁ dhammaṁ, nāyamāyasmā ittarasamāpanno’ti, tato naṁ uttariṁ samannesati: ‘ñattajjhāpanno ayamāyasmā bhikkhu yasappatto, saṁvijjantassa idhekacce ādīnavā’ti? Na tāva, bhikkhave, bhikkhuno idhekacce ādīnavā saṁvijjanti yāva na ñattajjhāpanno hoti yasappatto. Yato ca kho, bhikkhave, bhikkhu ñattajjhāpanno hoti yasappatto, athassa idhekacce ādīnavā saṁvijjanti. Tamenaṁ samannesamāno evaṁ jānāti: ‘ñattajjhāpanno ayamāyasmā bhikkhu yasappatto, nāssa idhekacce ādīnavā saṁvijjantī’ti.(5)",
    "mn47:7": "Yato naṁ samannesamāno evaṁ jānāti: ‘ñattajjhāpanno ayamāyasmā bhikkhu yasappatto, nāssa idhekacce ādīnavā saṁvijjantī’ti, tato naṁ uttariṁ samannesati: ‘abhayūparato ayamāyasmā, nāyamāyasmā bhayūparato; vītarāgattā kāme na sevati khayā rāgassā’ti? Tamenaṁ samannesamāno evaṁ jānāti: ‘abhayūparato ayamāyasmā, nāyamāyasmā bhayūparato; vītarāgattā kāme na sevati khayā rāgassā’ti.(6)",
    "mn47:8": "Tañce, bhikkhave, bhikkhuṁ pare evaṁ puccheyyuṁ: ‘ke panāyasmato ākārā, ke anvayā, yenāyasmā evaṁ vadesi — abhayūparato ayamāyasmā, nāyamāyasmā bhayūparato; vītarāgattā kāme na sevati khayā rāgassā’ti. Sammā byākaramāno, bhikkhave, bhikkhu evaṁ byākareyya: ‘tathā hi pana ayamāyasmā saṅghe vā viharanto eko vā viharanto, ye ca tattha sugatā ye ca tattha duggatā, ye ca tattha gaṇamanusāsanti, ye ca idhekacce āmisesu sandissanti, ye ca idhekacce āmisena anupalittā, nāyamāyasmā taṁ tena avajānāti. Sammukhā kho pana metaṁ bhagavato sutaṁ sammukhā paṭiggahitaṁ — abhayūparatohamasmi, nāhamasmi bhayūparato, vītarāgattā kāme na sevāmi khayā rāgassā’ti.",
    "mn47:9": "Tatra, bhikkhave, tathāgatova uttariṁ paṭipucchitabbo: ‘ye saṅkiliṭṭhā cakkhusotaviññeyyā dhammā, saṁvijjanti vā te tathāgatassa no vā’ti? Byākaramāno, bhikkhave, tathāgato evaṁ byākareyya: ‘ye saṅkiliṭṭhā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṁvijjantī’ti.(1)",
    "mn47:10": "‘Ye vītimissā cakkhusotaviññeyyā dhammā, saṁvijjanti vā te tathāgatassa no vā’ti? Byākaramāno, bhikkhave, tathāgato evaṁ byākareyya: ‘ye vītimissā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṁvijjantī’ti.(2)",
    "mn47:11": "‘Ye vodātā cakkhusotaviññeyyā dhammā, saṁvijjanti vā te tathāgatassa no vā’ti? Byākaramāno, bhikkhave, tathāgato evaṁ byākareyya: ‘ye vodātā cakkhusotaviññeyyā dhammā, saṁvijjanti te tathāgatassa;etaṁ pathohamasmi, etaṁ gocaro, no ca tena tammayo’ti.(3)",
    "mn47:12": "Evaṁvādiṁ kho, bhikkhave, satthāraṁ arahati sāvako upasaṅkamituṁ dhammassavanāya. Tassa satthā dhammaṁ deseti uttaruttariṁ paṇītapaṇītaṁ kaṇhasukkasappaṭibhāgaṁ. Yathā yathā kho, bhikkhave, bhikkhuno satthā dhammaṁ deseti uttaruttariṁ paṇītapaṇītaṁ kaṇhasukkasappaṭibhāgaṁ tathā tathā so tasmiṁ dhamme abhiññāya idhekaccaṁ dhammaṁ dhammesu niṭṭhaṁ gacchati, satthari pasīdati: ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno saṅgho’ti.",
    "mn47:13": "Yassa kassaci, bhikkhave, imehi ākārehi imehi padehi imehi byañjanehi tathāgate saddhā niviṭṭhā hoti mūlajātā patiṭṭhitā, ayaṁ vuccati, bhikkhave, ākāravatī saddhā dassanamūlikā, daḷhā; asaṁhāriyā samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṁ. Evaṁ kho, bhikkhave, tathāgate dhammasamannesanā hoti. Evañca pana tathāgato dhammatāsusamanniṭṭho hotī\"ti.",
    "mn47:14": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}