{
    "mn48:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā kosambiyaṁ viharati ghositārāme.",
    "mn48:2": "Atha kho bhagavā aññataraṁ bhikkhuṁ āmantesi: \"ehi tvaṁ, bhikkhu, mama vacanena te bhikkhū āmantehi: ‘satthā vo āyasmante āmantetī’\"ti. \"Evaṁ, bhante\"ti kho so bhikkhu bhagavato paṭissutvā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca: \"satthā āyasmante āmantetī\"ti.",
    "mn48:3": "Atha kho bhagavā bhikkhū āmantesi: \"chayime, bhikkhave, dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattanti. Katame cha?",
    "mn48:4": "Puna caparaṁ, bhikkhave, bhikkhuno mettaṁ vacīkammaṁ paccupaṭṭhitaṁ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(2)",
    "mn48:5": "Puna caparaṁ, bhikkhave, bhikkhuno mettaṁ manokammaṁ paccupaṭṭhitaṁ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(3)",
    "mn48:6": "Puna caparaṁ, bhikkhave, bhikkhu ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi, tathārūpehi lābhehi appaṭivibhattabhogī hoti sīlavantehi sabrahmacārīhi sādhāraṇabhogī. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(4)",
    "mn48:7": "Puna caparaṁ, bhikkhave, bhikkhu yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṁvattanikāni tathārūpesu sīlesu sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(5)",
    "mn48:8": "Puna caparaṁ, bhikkhave, bhikkhu yāyaṁ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattati.(6)",
    "mn48:9": "Ime kho, bhikkhave, cha sāraṇīyā dhammā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṁvattanti.",
    "mn48:10": "Kathañca, bhikkhave, yāyaṁ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya?",
    "mn48:11": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘imaṁ nu kho ahaṁ diṭṭhiṁ āsevanto bhāvento bahulīkaronto labhāmi paccattaṁ samathaṁ, labhāmi paccattaṁ nibbutin’ti?",
    "mn48:12": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘yathārūpāyāhaṁ diṭṭhiyā samannāgato, atthi nu kho ito bahiddhā añño samaṇo vā brāhmaṇo vā tathārūpāya diṭṭhiyā samannāgato’ti?",
    "mn48:13": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Kathaṁrūpāya ca, bhikkhave, dhammatāya diṭṭhisampanno puggalo samannāgato? Dhammatā esā, bhikkhave, diṭṭhisampannassa puggalassa: ‘kiñcāpi tathārūpiṁ āpattiṁ āpajjati, yathārūpāya āpattiyā vuṭṭhānaṁ paññāyati, atha kho naṁ khippameva satthari vā viññūsu vā sabrahmacārīsu deseti vivarati uttānīkaroti; desetvā vivaritvā uttānīkatvā āyatiṁ saṁvaraṁ āpajjati’. Seyyathāpi, bhikkhave, daharo kumāro mando uttānaseyyako hatthena vā pādena vā aṅgāraṁ akkamitvā khippameva paṭisaṁharati; evameva kho, bhikkhave, dhammatā esā diṭṭhisampannassa puggalassa: ‘kiñcāpi tathārūpiṁ āpattiṁ āpajjati yathārūpāya āpattiyā vuṭṭhānaṁ paññāyati, atha kho naṁ khippameva satthari vā viññūsu vā sabrahmacārīsu deseti vivarati uttānīkaroti; desetvā vivaritvā uttānīkatvā āyatiṁ saṁvaraṁ āpajjati’.",
    "mn48:14": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Kathaṁrūpāya ca, bhikkhave, dhammatāya diṭṭhisampanno puggalo samannāgato? Dhammatā esā, bhikkhave, diṭṭhisampannassa puggalassa: ‘kiñcāpi yāni tāni sabrahmacārīnaṁ uccāvacāni kiṅkaraṇīyāni tattha ussukkaṁ āpanno hoti, atha khvāssa tibbāpekkhā hoti adhisīlasikkhāya adhicittasikkhāya adhipaññāsikkhāya’. Seyyathāpi, bhikkhave, gāvī taruṇavacchā thambañca ālumpati vacchakañca apacinati; evameva kho, bhikkhave, dhammatā esā diṭṭhisampannassa puggalassa: ‘kiñcāpi yāni tāni sabrahmacārīnaṁ uccāvacāni kiṅkaraṇīyāni tattha ussukkaṁ āpanno hoti, atha khvāssa tibbāpekkhā hoti adhisīlasikkhāya adhicittasikkhāya adhipaññāsikkhāya’.",
    "mn48:15": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘yathārūpāya balatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Kathaṁrūpāya ca, bhikkhave, balatāya diṭṭhisampanno puggalo samannāgato? Balatā esā, bhikkhave, diṭṭhisampannassa puggalassa yaṁ tathāgatappavedite dhammavinaye desiyamāneaṭṭhiṁ katvāmanasikatvāsabbacetasāsamannāharitvā ohitasoto dhammaṁ suṇāti.",
    "mn48:16": "Puna caparaṁ, bhikkhave, ariyasāvako iti paṭisañcikkhati: ‘yathārūpāya balatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Kathaṁrūpāya ca, bhikkhave, balatāya diṭṭhisampanno puggalo samannāgato? Balatā esā, bhikkhave, diṭṭhisampannassa puggalassa yaṁ tathāgatappavedite dhammavinaye desiyamāne labhati atthavedaṁ, labhati dhammavedaṁ, labhati dhammūpasaṁhitaṁ pāmojjaṁ.",
    "mn48:17": "Evaṁ sattaṅgasamannāgatassa kho, bhikkhave, ariyasāvakassa dhammatā susamanniṭṭhā hoti sotāpattiphalasacchikiriyāya. Evaṁ sattaṅgasamannāgato kho, bhikkhave, ariyasāvako sotāpattiphalasamannāgato hotī\"ti.",
    "mn48:18": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}