{
    "mn53:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sakkesu viharati kapilavatthusmiṁ nigrodhārāme.",
    "mn53:2": "Atha kho āyasmā ānando mahānāmaṁ sakkaṁ āmantesi:",
    "mn53:3": "Kathañca, mahānāma, ariyasāvako sīlasampanno hoti? Idha, mahānāma, ariyasāvako sīlavā hoti, pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Evaṁ kho, mahānāma, ariyasāvako sīlasampanno hoti.(1)",
    "mn53:4": "Kathañca, mahānāma, ariyasāvako indriyesu guttadvāro hoti? Idha, mahānāma, ariyasāvako cakkhunā rūpaṁ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ tassa saṁvarāya paṭipajjati, rakkhati cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjati. Sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … pe … jivhāya rasaṁ sāyitvā … pe … kāyena phoṭṭhabbaṁ phusitvā … pe … manasā dhammaṁ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ tassa saṁvarāya paṭipajjati, rakkhati manindriyaṁ, manindriye saṁvaraṁ āpajjati. Evaṁ kho, mahānāma, ariyasāvako indriyesu guttadvāro hoti.(2)",
    "mn53:5": "Kathañca, mahānāma, ariyasāvako bhojane mattaññū hoti? Idha, mahānāma, ariyasāvako paṭisaṅkhā yoniso āhāraṁ āhāreti: ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya; yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṁsūparatiyā brahmacariyānuggahāya. Iti purāṇañca vedanaṁ paṭihaṅkhāmi, navañca vedanaṁ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’ti. Evaṁ kho, mahānāma, ariyasāvako bhojane mattaññū hoti.(3)",
    "mn53:6": "Kathañca, mahānāma, ariyasāvako jāgariyaṁ anuyutto hoti? Idha, mahānāma, ariyasāvako divasaṁ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṁ parisodheti, rattiyā paṭhamaṁ yāmaṁ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṁ parisodheti, rattiyā majjhimaṁ yāmaṁ dakkhiṇena passena sīhaseyyaṁ kappeti, pāde pādaṁ accādhāya, sato sampajāno, uṭṭhānasaññaṁ manasi karitvā, rattiyā pacchimaṁ yāmaṁ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṁ parisodheti. Evaṁ kho, mahānāma, ariyasāvako jāgariyaṁ anuyutto hoti.(4)",
    "mn53:7": "Kathañca, mahānāma, ariyasāvako sattahi saddhammehi samannāgato hoti? Idha, mahānāma, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṁ: ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti.",
    "mn53:8": "Kathañca, mahānāma, ariyasāvako catunnaṁ jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī? Idha, mahānāma, ariyasāvako vivicceva kāmehi … pe … paṭhamaṁ jhānaṁ upasampajja viharati; vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ … pe … dutiyaṁ jhānaṁ upasampajja viharati; pītiyā ca virāgā … pe … tatiyaṁ jhānaṁ upasampajja viharati; sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā … pe … catutthaṁ jhānaṁ upasampajja viharati. Evaṁ kho, mahānāma, ariyasāvako catunnaṁ jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī. (12–15.)",
    "mn53:9": "Yato kho, mahānāma, ariyasāvako evaṁ sīlasampanno hoti, evaṁ indriyesu guttadvāro hoti, evaṁ bhojane mattaññū hoti, evaṁ jāgariyaṁ anuyutto hoti, evaṁ sattahi saddhammehi samannāgato hoti, evaṁ catunnaṁ jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī, ayaṁ vuccati, mahānāma, ariyasāvako sekho pāṭipado apuccaṇḍatāya samāpanno, bhabbo abhinibbhidāya, bhabbo sambodhāya, bhabbo anuttarassa yogakkhemassa adhigamāya.",
    "mn53:10": "Sa kho so, mahānāma, ariyasāvako imaṁyeva anuttaraṁ upekkhāsatipārisuddhiṁ āgamma anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ — ekampi jātiṁ dvepi jātiyo … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati, ayamassa paṭhamābhinibbhidā hoti kukkuṭacchāpakasseva aṇḍakosamhā.(1)",
    "mn53:11": "Sa kho so, mahānāma, ariyasāvako imaṁyeva anuttaraṁ upekkhāsatipārisuddhiṁ āgamma dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate … pe … yathākammūpage satte pajānāti, ayamassa dutiyābhinibbhidā hoti kukkuṭacchāpakasseva aṇḍakosamhā.(2)",
    "mn53:12": "Sa kho so, mahānāma, ariyasāvako imaṁyeva anuttaraṁ upekkhāsatipārisuddhiṁ āgamma āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharati, ayamassa tatiyābhinibbhidā hoti kukkuṭacchāpakasseva aṇḍakosamhā.(3)",
    "mn53:13": "Yampi, mahānāma, ariyasāvako sīlasampanno hoti, idampissa hoti caraṇasmiṁ; yampi, mahānāma, ariyasāvako indriyesu guttadvāro hoti, idampissa hoti caraṇasmiṁ; yampi, mahānāma, ariyasāvako bhojane mattaññū hoti, idampissa hoti caraṇasmiṁ; yampi, mahānāma, ariyasāvako jāgariyaṁ anuyutto hoti, idampissa hoti caraṇasmiṁ; yampi, mahānāma, ariyasāvako sattahi saddhammehi samannāgato hoti, idampissa hoti caraṇasmiṁ; yampi, mahānāma, ariyasāvako catunnaṁ jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī, idampissa hoti caraṇasmiṁ.",
    "mn53:14": "Yañca kho, mahānāma, ariyasāvako anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ — ekampi jātiṁ dvepi jātiyo … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati, idampissa hoti vijjāya; yampi, mahānāma, ariyasāvako dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate … pe … yathākammūpage satte pajānāti, idampissa hoti vijjāya. Yampi, mahānāma, ariyasāvako āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharati, idampissa hoti vijjāya.",
    "mn53:15": "Ayaṁ vuccati, mahānāma, ariyasāvako vijjāsampanno itipi caraṇasampanno itipi vijjācaraṇasampanno itipi.",
    "mn53:16": "Brahmunāpesā, mahānāma, sanaṅkumārena gāthā bhāsitā:",
    "mn53:17": "‘Khattiyo seṭṭho janetasmiṁ,ye gottapaṭisārino;Vijjācaraṇasampanno,so seṭṭho devamānuse’ti.",
    "mn53:18": "Sā kho panesā, mahānāma, brahmunā sanaṅkumārena gāthā sugītā no duggītā,\nsubhāsitā no dubbhāsitā, atthasaṁhitā no anatthasaṁhitā, anumatā bhagavatā\"ti.",
    "mn53:19": "Atha kho bhagavā uṭṭhahitvā āyasmantaṁ ānandaṁ āmantesi: \"sādhu sādhu, ānanda,\nsādhu kho tvaṁ, ānanda, kāpilavatthavānaṁ sakyānaṁ sekhaṁ pāṭipadaṁ abhāsī\"ti.",
    "mn53:20": "Idamavocāyasmā ānando. Samanuñño satthā ahosi. Attamanā kāpilavatthavā sakyā\nāyasmato ānandassa bhāsitaṁ abhinandunti."
}