{
    "mn57:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā koliyesu viharati haliddavasanaṁ nāma koliyānaṁ nigamo.",
    "mn57:2": "\"Addhā kho te ahaṁ, puṇṇa, na labhāmi. Alaṁ, puṇṇa, tiṭṭhatetaṁ; mā maṁ etaṁ pucchīti; api ca tyāhaṁ byākarissāmi.",
    "mn57:3": "Atha kho bhagavā puṇṇaṁ koliyaputtaṁ govatikaṁ etadavoca: \"etaṁ kho te ahaṁ, puṇṇa, nālatthaṁ. Alaṁ, puṇṇa, tiṭṭhatetaṁ; mā maṁ etaṁ pucchī\"ti. \"Nāhaṁ, bhante, etaṁ rodāmi yaṁ maṁ bhagavā evamāha; api ca me idaṁ, bhante, kukkuravataṁ dīgharattaṁ samattaṁ samādinnaṁ. Ayaṁ, bhante, puṇṇo koliyaputto govatiko. Tassa taṁ govataṁ dīgharattaṁ samattaṁ samādinnaṁ. Tassa kā gati, ko abhisamparāyo\"ti?",
    "mn57:4": "\"Addhā kho te ahaṁ, seniya, na labhāmi. Alaṁ, seniya, tiṭṭhatetaṁ; mā maṁ etaṁ pucchīti; api ca tyāhaṁ byākarissāmi.",
    "mn57:5": "Atha kho bhagavā acelaṁ seniyaṁ kukkuravatikaṁ etadavoca: \"etaṁ kho te ahaṁ, seniya, nālatthaṁ. Alaṁ, seniya, tiṭṭhatetaṁ; mā maṁ etaṁ pucchī\"ti.",
    "mn57:6": "\"Cattārimāni, puṇṇa, kammāni mayā sayaṁ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Atthi, puṇṇa, kammaṁ kaṇhaṁ kaṇhavipākaṁ; atthi, puṇṇa, kammaṁ sukkaṁ sukkavipākaṁ; atthi, puṇṇa, kammaṁ kaṇhasukkaṁ kaṇhasukkavipākaṁ; atthi, puṇṇa, kammaṁ akaṇhaṁ asukkaṁ akaṇhaasukkavipākaṁ, kammakkhayāya saṁvattati.",
    "mn57:7": "Katamañca, puṇṇa, kammaṁ kaṇhaṁ kaṇhavipākaṁ? Idha, puṇṇa, ekaccosabyābajjhaṁkāyasaṅkhāraṁ abhisaṅkharoti, sabyābajjhaṁ vacīsaṅkhāraṁ abhisaṅkharoti, sabyābajjhaṁ manosaṅkhāraṁ abhisaṅkharoti. So sabyābajjhaṁ kāyasaṅkhāraṁ abhisaṅkharitvā, sabyābajjhaṁ vacīsaṅkhāraṁ abhisaṅkharitvā, sabyābajjhaṁ manosaṅkhāraṁ abhisaṅkharitvā, sabyābajjhaṁ lokaṁ upapajjati. Tamenaṁ sabyābajjhaṁ lokaṁ upapannaṁ samānaṁ sabyābajjhā phassā phusanti. So sabyābajjhehi phassehi phuṭṭho samāno sabyābajjhaṁ vedanaṁ vedeti ekantadukkhaṁ, seyyathāpi sattā nerayikā. Iti kho, puṇṇa, bhūtā bhūtassa upapatti hoti; yaṁ karoti tena upapajjati, upapannamenaṁ phassā phusanti. Evampāhaṁ, puṇṇa, ‘kammadāyādā sattā’ti vadāmi. Idaṁ vuccati, puṇṇa, kammaṁ kaṇhaṁ kaṇhavipākaṁ.(1)",
    "mn57:8": "Katamañca, puṇṇa, kammaṁ sukkaṁ sukkavipākaṁ? Idha, puṇṇa, ekacco abyābajjhaṁ kāyasaṅkhāraṁ abhisaṅkharoti, abyābajjhaṁ vacīsaṅkhāraṁ abhisaṅkharoti, abyābajjhaṁ manosaṅkhāraṁ abhisaṅkharoti. So abyābajjhaṁ kāyasaṅkhāraṁ abhisaṅkharitvā, abyābajjhaṁ vacīsaṅkhāraṁ abhisaṅkharitvā, abyābajjhaṁ manosaṅkhāraṁ abhisaṅkharitvā abyābajjhaṁ lokaṁ upapajjati. Tamenaṁ abyābajjhaṁ lokaṁ upapannaṁ samānaṁ abyābajjhā phassā phusanti. So abyābajjhehi phassehi phuṭṭho samāno abyābajjhaṁ vedanaṁ vedeti ekantasukhaṁ, seyyathāpi devā subhakiṇhā. Iti kho, puṇṇa, bhūtā bhūtassa upapatti hoti; yaṁ karoti tena upapajjati, upapannamenaṁ phassā phusanti. Evampāhaṁ, puṇṇa, ‘kammadāyādā sattā’ti vadāmi. Idaṁ vuccati, puṇṇa, kammaṁ sukkaṁ sukkavipākaṁ.(2)",
    "mn57:9": "Katamañca, puṇṇa, kammaṁ kaṇhasukkaṁ kaṇhasukkavipākaṁ? Idha, puṇṇa, ekacco sabyābajjhampi abyābajjhampi kāyasaṅkhāraṁ abhisaṅkharoti, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṁ abhisaṅkharoti, sabyābajjhampi abyābajjhampi manosaṅkhāraṁ abhisaṅkharoti. So sabyābajjhampi abyābajjhampi kāyasaṅkhāraṁ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṁ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi manosaṅkhāraṁ abhisaṅkharitvā sabyābajjhampi abyābajjhampi lokaṁ upapajjati. Tamenaṁ sabyābajjhampi abyābajjhampi lokaṁ upapannaṁ samānaṁ sabyābajjhāpi abyābajjhāpi phassā phusanti. So sabyābajjhehipi abyābajjhehipi phassehi phuṭṭho samāno sabyābajjhampi abyābajjhampi vedanaṁ vedeti vokiṇṇasukhadukkhaṁ, seyyathāpi manussā ekacce ca devā ekacce ca vinipātikā. Iti kho, puṇṇa, bhūtā bhūtassa upapatti hoti; yaṁ karoti tena upapajjati. Upapannamenaṁ phassā phusanti. Evampāhaṁ, puṇṇa, ‘kammadāyādā sattā’ti vadāmi. Idaṁ vuccati, puṇṇa, kammaṁ kaṇhasukkaṁ kaṇhasukkavipākaṁ.(3)",
    "mn57:10": "Katamañca, puṇṇa, kammaṁ akaṇhaṁ asukkaṁ akaṇhaasukkavipākaṁ, kammakkhayāya saṁvattati? Tatra, puṇṇa, yamidaṁ kammaṁ kaṇhaṁ kaṇhavipākaṁ tassa pahānāya yā cetanā,yamidaṁkammaṁ sukkaṁ sukkavipākaṁ tassa pahānāya yā cetanā,yamidaṁkammaṁ kaṇhasukkaṁ kaṇhasukkavipākaṁ tassa pahānāya yā cetanā — idaṁ vuccati, puṇṇa, kammaṁ akaṇhaṁ asukkaṁ akaṇhaasukkavipākaṁ, kammakkhayāya saṁvattatīti. Imāni kho, puṇṇa, cattāri kammāni mayā sayaṁ abhiññā sacchikatvā paveditānī\"ti.(4)",
    "mn57:11": "Evaṁ vutte, puṇṇo koliyaputto govatiko bhagavantaṁ etadavoca: \"Abhikkantaṁ, bhante, abhikkantaṁ, bhante.",
    "mn57:12": "\"Sace, bhante, aññatitthiyapubbā imasmiṁ dhammavinaye ākaṅkhantā pabbajjaṁ ākaṅkhantā upasampadaṁ te cattāro māse parivasanti catunnaṁ māsānaṁ accayena āraddhacittā bhikkhū pabbājenti upasampādenti bhikkhubhāvāya, ahaṁ cattāri vassāni parivasissāmi catunnaṁ vassānaṁ accayena āraddhacittā bhikkhū pabbājentu, upasampādentu bhikkhubhāvāyā\"ti.",
    "mn57:13": "Alattha kho acelo seniyo kukkuravatiko bhagavato santike pabbajjaṁ, alattha upasampadaṁ. Acirūpasampanno kho panāyasmā seniyo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva — yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, Tadanuttaraṁ — brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāsi.",
    "mn57:14": "\"Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā\"ti abbhaññāsi. Aññataro kho panāyasmā seniyo arahataṁ ahosīti."
}