{
    "mn58:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā rājagahe viharati veḷuvane kalandakanivāpe.",
    "mn58:2": "Ekamantaṁ nisinnassa kho abhayassa rājakumārassasūriyaṁ ulloketvāetadahosi: \"akālo kho ajja bhagavato vādaṁ āropetuṁ. Sve dānāhaṁ sake nivesane bhagavato vādaṁ āropessāmī\"ti bhagavantaṁ etadavoca: \"adhivāsetu me, bhante, bhagavā svātanāya attacatuttho bhattan\"ti. Adhivāsesi bhagavā tuṇhībhāvena.",
    "mn58:3": "Ekamantaṁ nisinno kho abhayo rājakumāro bhagavantaṁ etadavoca: \"bhāseyya nu kho, bhante, tathāgato taṁ vācaṁ yā sā vācā paresaṁ appiyā amanāpā\"ti?",
    "mn58:4": "Tena kho pana samayena daharo kumāro mando uttānaseyyako abhayassa rājakumārassa aṅke nisinno hoti. Atha kho bhagavā abhayaṁ rājakumāraṁ etadavoca: \"taṁ kiṁ maññasi, rājakumāra, sacāyaṁ kumāro tuyhaṁ vā pamādamanvāya dhātiyā vā pamādamanvāya kaṭṭhaṁ vākaṭhalaṁvā mukhe āhareyya, kinti naṁ kareyyāsī\"ti?",
    "mn58:5": "\"Yeme, bhante, khattiyapaṇḍitāpi brāhmaṇapaṇḍitāpi gahapatipaṇḍitāpi samaṇapaṇḍitāpi pañhaṁ abhisaṅkharitvā tathāgataṁ upasaṅkamitvā pucchanti, pubbeva nu kho, etaṁ, bhante, bhagavato cetaso parivitakkitaṁ hoti ‘ye maṁ upasaṅkamitvā evaṁ pucchissanti tesāhaṁ evaṁ puṭṭho evaṁ byākarissāmī’ti, udāhu ṭhānasovetaṁ tathāgataṁ paṭibhātī\"ti?",
    "mn58:6": "\"Tena hi, rājakumāra, taññevettha paṭipucchissāmi, yathā te khameyya tathā naṁ byākareyyāsi. Taṁ kiṁ maññasi, rājakumāra, kusalo tvaṁ rathassa aṅgapaccaṅgānan\"ti?",
    "mn58:7": "\"Evaṁ, bhante, kusalo ahaṁ rathassa aṅgapaccaṅgānan\"ti.",
    "mn58:8": "\"Taṁ kiṁ maññasi, rājakumāra, ye taṁ upasaṅkamitvā evaṁ puccheyyuṁ: ‘kiṁ nāmidaṁ rathassa aṅgapaccaṅgan’ti? Pubbeva nu kho te etaṁ cetaso parivitakkitaṁ assa ‘ye maṁ upasaṅkamitvā evaṁ pucchissanti tesāhaṁ evaṁ puṭṭho evaṁ byākarissāmī’ti, udāhu ṭhānasovetaṁ paṭibhāseyyā\"ti?",
    "mn58:9": "\"Ahañhi, bhante, rathiko saññāto kusalo rathassa aṅgapaccaṅgānaṁ. Sabbāni me rathassa aṅgapaccaṅgāni suviditāni. Ṭhānasovetaṁ maṁ paṭibhāseyyā\"ti.",
    "mn58:10": "\"Evameva kho, rājakumāra, ye te khattiyapaṇḍitāpi brāhmaṇapaṇḍitāpi gahapatipaṇḍitāpi samaṇapaṇḍitāpi pañhaṁ abhisaṅkharitvā tathāgataṁ upasaṅkamitvā pucchanti, ṭhānasovetaṁ tathāgataṁ paṭibhāti. Taṁ kissa hetu? Sā hi, rājakumāra, tathāgatassa dhammadhātu suppaṭividdhā yassā dhammadhātuyā suppaṭividdhattā ṭhānasovetaṁ tathāgataṁ paṭibhātī\"ti.",
    "mn58:11": "Evaṁ vutte, abhayo rājakumāro bhagavantaṁ etadavoca: \"Abhikkantaṁ, bhante, abhikkantaṁ, bhante … pe … ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}