{
    "mn59:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.\nAtha kho pañcakaṅgo thapati yenāyasmā udāyī tenupasaṅkami; upasaṅkamitvā\nāyasmantaṁ udāyiṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho\npañcakaṅgo thapati āyasmantaṁ udāyiṁ etadavoca: \"kati nu kho, bhante udāyi,\nvedanā vuttā bhagavatā\"ti? \"Tisso kho,thapati, vedanā vuttā bhagavatā. Sukhā\nvedanā, dukkhā vedanā, adukkhamasukhā vedanā — imā kho, thapati, tisso vedanā\nvuttā bhagavatā\"ti. Evaṁ vutte, pañcakaṅgo thapati āyasmantaṁ udāyiṁ etadavoca:\n\"na kho, bhante udāyi, tisso vedanā vuttā bhagavatā; dve vedanā vuttā\nbhagavatā — sukhā vedanā, dukkhā vedanā. Yāyaṁ, bhante, adukkhamasukhā vedanā\nsantasmiṁ esā paṇīte sukhe vuttā bhagavatā\"ti.",
    "mn59:2": "Dutiyampi kho āyasmā udāyī pañcakaṅgaṁ thapatiṁ etadavoca: \"na kho, gahapati,\ndve vedanā vuttā bhagavatā; tisso vedanā vuttā bhagavatā. Sukhā vedanā, dukkhā\nvedanā, adukkhamasukhā vedanā — imā kho, thapati, tisso vedanā vuttā\nbhagavatā\"ti. Dutiyampi kho pañcakaṅgo thapati āyasmantaṁ udāyiṁ etadavoca: \"na\nkho, bhante udāyi, tisso vedanā vuttā bhagavatā; dve vedanā vuttā bhagavatā – \nsukhā vedanā, dukkhā vedanā. Yāyaṁ, bhante, adukkhamasukhā vedanā santasmiṁ esā\npaṇīte sukhe vuttā bhagavatā\"ti.",
    "mn59:3": "Tatiyampi kho āyasmā udāyī pañcakaṅgaṁ thapatiṁ etadavoca: \"na kho, thapati,\ndve vedanā vuttā bhagavatā; tisso vedanā vuttā bhagavatā. Sukhā vedanā, dukkhā\nvedanā, adukkhamasukhā vedanā — imā kho, thapati, tisso vedanā vuttā\nbhagavatā\"ti. Tatiyampi kho pañcakaṅgo thapati āyasmantaṁ udāyiṁ etadavoca: \"na\nkho, bhante udāyi, tisso vedanā vuttā bhagavatā, dve vedanā vuttā bhagavatā – \nsukhā vedanā, dukkhā vedanā. Yāyaṁ, bhante, adukkhamasukhā vedanā santasmiṁ esā\npaṇīte sukhe vuttā bhagavatā\"ti. Neva kho sakkhi āyasmā udāyī pañcakaṅgaṁ\nthapatiṁ saññāpetuṁ, na panāsakkhi pañcakaṅgo thapati āyasmantaṁ udāyiṁ\nsaññāpetuṁ.",
    "mn59:4": "Assosi kho āyasmā ānando āyasmato udāyissa pañcakaṅgena thapatinā saddhiṁ imaṁ\nkathāsallāpaṁ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā\nbhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando\nyāvatako ahosi āyasmato udāyissa pañcakaṅgena thapatinā saddhiṁ kathāsallāpo\ntaṁ sabbaṁ bhagavato ārocesi. Evaṁ vutte, bhagavā āyasmantaṁ ānandaṁ etadavoca:\n\"santaññeva kho, ānanda, pariyāyaṁ pañcakaṅgo thapati udāyissa nābbhanumodi,\nsantaññeva ca pana pariyāyaṁ udāyī pañcakaṅgassa thapatissa nābbhanumodi.\nDvepānanda, vedanā vuttā mayā pariyāyena, tissopi vedanā vuttā mayā pariyāyena,\npañcapi vedanā vuttā mayā pariyāyena, chapi vedanā vuttā mayā pariyāyena,\naṭṭhārasapi vedanā vuttā mayā pariyāyena, chattiṁsapi vedanā vuttā mayā\npariyāyena, aṭṭhasatampi vedanā vuttā mayā pariyāyena. Evaṁ pariyāyadesito kho,\nānanda, mayā dhammo. Evaṁ pariyāyadesite kho, ānanda, mayā dhamme ye\naññamaññassa subhāsitaṁ sulapitaṁ na samanujānissanti na samanumaññissanti na\nsamanumodissanti tesametaṁ pāṭikaṅkhaṁ — bhaṇḍanajātā kalahajātā vivādāpannā\naññamaññaṁ mukhasattīhi vitudantā viharissanti. Evaṁ pariyāyadesito kho,\nānanda, mayā dhammo. Evaṁ pariyāyadesite kho, ānanda, mayā dhamme ye\naññamaññassa subhāsitaṁ sulapitaṁ samanujānissanti samanumaññissanti\nsamanumodissanti tesametaṁ pāṭikaṅkhaṁ — samaggā sammodamānā avivadamānā\nkhīrodakībhūtā aññamaññaṁ piyacakkhūhi sampassantā viharissanti.",
    "mn59:5": "Pañca kho ime, ānanda, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā\nmanāpā piyarūpā kāmūpasaṁhitā rajanīyā, sotaviññeyyā saddā … pe … ghānaviññeyyā\ngandhā … pe … jivhāviññeyyā rasā … pe … kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā\nmanāpā piyarūpā kāmūpasaṁhitā rajanīyā — ime kho, ānanda, pañca kāmaguṇā. Yaṁ\nkho, ānanda, ime pañca kāmaguṇe paṭicca uppajjati sukhaṁ somanassaṁ idaṁ\nvuccati kāmasukhaṁ.",
    "mn59:6": "Yo kho, ānanda, evaṁ vadeyya: ‘etaparamaṁ sattā sukhaṁ somanassaṁ\npaṭisaṁvedentī’ti, idamassa nānujānāmi. Taṁ kissa hetu? Atthānanda, etamhā\nsukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca. Katamañcānanda, etamhā\nsukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu\nvivicceva kāmehi vivicca akusalehi dhammehi … pe … paṭhamaṁ jhānaṁ upasampajja\nviharati. Idaṁ kho, ānanda, etamhā sukhā aññaṁ sukhaṁ abhikkantatarañca\npaṇītatarañca.",
    "mn59:7": "Yo kho, ānanda, evaṁ vadeyya: ‘etaparamaṁ sattā sukhaṁ somanassaṁ\npaṭisaṁvedentī’ti, idamassa nānujānāmi. Taṁ kissa hetu? Atthānanda, etamhā\nsukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca. Katamañcānanda, etamhā\nsukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu\nvitakkavicārānaṁ vūpasamā … pe … dutiyaṁ jhānaṁ upasampajja viharati. Idaṁ kho,\nānanda, etamhā sukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca.",
    "mn59:8": "Yo kho, ānanda, evaṁ vadeyya … pe … . Katamañcānanda, etamhā sukhā aññaṁ sukhaṁ\nabhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu pītiyā ca virāgā … pe …\ntatiyaṁ jhānaṁ upasampajja viharati. Idaṁ kho, ānanda, etamhā sukhā aññaṁ\nsukhaṁ abhikkantatarañca paṇītatarañca.",
    "mn59:9": "Yo kho, ānanda, evaṁ vadeyya … pe … . Katamañcānanda, etamhā sukhā aññaṁ sukhaṁ\nabhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sukhassa ca pahānā … pe …\ncatutthaṁ jhānaṁ upasampajja viharati. Idaṁ kho, ānanda, etamhā sukhā aññaṁ\nsukhaṁ abhikkantatarañca paṇītatarañca.",
    "mn59:10": "Yo kho, ānanda, evaṁ vadeyya … pe … . Katamañcānanda, etamhā sukhā aññaṁ sukhaṁ\nabhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso rūpasaññānaṁ\nsamatikkamā, paṭighasaññānaṁ atthaṅgamā, nānattasaññānaṁ amanasikārā ‘ananto\nākāso’ti ākāsānañcāyatanaṁ upasampajja viharati. Idaṁ kho, ānanda, etamhā sukhā\naññaṁ sukhaṁ abhikkantatarañca paṇītatarañca.",
    "mn59:11": "Yo kho, ānanda, evaṁ vadeyya … pe … . Katamañcānanda, etamhā sukhā aññaṁ sukhaṁ\nabhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso ākāsānañcāyatanaṁ\nsamatikkamma ‘anantaṁ viññāṇan’ti viññāṇañcāyatanaṁ upasampajja viharati. Idaṁ\nkho, ānanda, etamhā sukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca.",
    "mn59:12": "Yo kho, ānanda, evaṁ vadeyya … pe … . Katamañcānanda, etamhā sukhā aññaṁ sukhaṁ\nabhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso viññāṇañcāyatanaṁ\nsamatikkamma ‘Natthi kiñcī’ti ākiñcaññāyatanaṁ upasampajja viharati. Idaṁ kho,\nānanda, etamhā sukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca.",
    "mn59:13": "Yo kho, ānanda, evaṁ vadeyya … pe … . Katamañcānanda, etamhā sukhā aññaṁ sukhaṁ\nabhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso ākiñcaññāyatanaṁ\nsamatikkamma nevasaññānāsaññāyatanaṁ upasampajja viharati. Idaṁ kho, ānanda,\netamhā sukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca.",
    "mn59:14": "Yo kho, ānanda, evaṁ vadeyya: ‘etaparamaṁ sattā sukhaṁ somanassaṁ\npaṭisaṁvedentī’ti, idamassa nānujānāmi. Taṁ kissa hetu? Atthānanda, etamhā\nsukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca. Katamañcānanda, etamhā\nsukhā aññaṁ sukhaṁ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso\nnevasaññānāsaññāyatanaṁ samatikkamma saññāvedayitanirodhaṁ upasampajja\nviharati. Idaṁ kho, ānanda, etamhā sukhā aññaṁ sukhaṁ abhikkantatarañca\npaṇītatarañca.",
    "mn59:15": "Ṭhānaṁ kho panetaṁ, ānanda, vijjati yaṁ aññatitthiyā paribbājakā evaṁ vadeyyuṁ:\n‘saññāvedayitanirodhaṁ samaṇo gotamo āha; tañca sukhasmiṁ paññapeti. Tayidaṁ\nkiṁsu, tayidaṁ kathaṁsū’ti? Evaṁvādino, ānanda, aññatitthiyā paribbājakā\nevamassu vacanīyā: ‘Na kho, āvuso, bhagavā sukhaṁyeva vedanaṁ sandhāya\nsukhasmiṁ paññapeti; api ca, āvuso, yattha yattha sukhaṁ upalabbhati yahiṁ\nyahiṁ taṁ taṁ tathāgato sukhasmiṁ paññapetī’\"ti.",
    "mn59:16": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}