{
    "mn60:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā kosalesu cārikaṁ caramāno mahatā ­bhik­khu­san­ghena saddhiṁ yena sālā nāma kosalānaṁ brāhmaṇagāmo tadavasari.",
    "mn60:2": "Ekamantaṁ nisinne kho sāleyyake brāhma­ṇa­gaha­patike bhagavā etadavoca: \"atthi pana vo, gahapatayo, koci manāpo satthā yasmiṁ vo ākāravatī saddhā paṭiladdhā\"ti?",
    "mn60:3": "\"Manāpaṁ vo, gahapatayo, satthāraṁ alabhantehi ayaṁ apaṇṇako dhammo samādāya vattitabbo. Apaṇṇako hi, gahapatayo, dhammo samatto samādinno, so vo bhavissati dīgharattaṁ hitāya sukhāya. Katamo ca, gahapatayo, apaṇṇako dhammo?",
    "mn60:4": "Santi, gahapatayo, eke samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ, natthi hutaṁ; natthisukata­dukka­ṭā­naṁkammānaṁ phalaṁ vipāko, natthi ayaṁ loko, natthi paro loko; natthi mātā, natthi pitā; natthi sattā opapātikā; natthi loke samaṇabrāhmaṇāsammaggatāsammā paṭipannā ye imañca lokaṁ parañca lokaṁ sayaṁ abhiññā sacchikatvā pavedentī’ti.",
    "mn60:5": "\"Tatra, gahapatayo, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ … pe … ye imañca lokaṁ parañca lokaṁ sayaṁ abhiññā sacchikatvā pavedentī’ti tesametaṁ pāṭikaṅkhaṁ —yamidaṁkāyasucaritaṁ, vacīsucaritaṁ, manosucaritaṁ — ime tayo kusale dhammeabhinivajjetvāyamidaṁkāyaduccaritaṁ, vacīduccaritaṁ, manoduccaritaṁ — ime tayo akusale dhamme samādāya vattissanti. Taṁ kissa hetu? Na hi te bhonto samaṇabrāhmaṇā passanti akusalānaṁ dhammānaṁ ādīnavaṁ okāraṁ saṁkilesaṁ, kusalānaṁ dhammānaṁ nekkhamme ānisaṁsaṁ vodānapakkhaṁ. Santaṁyeva pana paraṁ lokaṁ ‘Natthi paro loko’ tissa diṭṭhi hoti; sāssa hoti micchādiṭṭhi.",
    "mn60:6": "Tatra, gahapatayo, viññū puriso iti paṭi­sañcik­khati: ‘sace kho natthi paro loko evamayaṁ bhavaṁ purisapuggalo kāyassa bhedā sotthimattānaṁ karissati; sace kho atthi paro loko, evamayaṁ bhavaṁ purisapuggalo kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjissati. Kāmaṁ kho pana māhu paro loko, hotu nesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ; atha ca panāyaṁ bhavaṁ purisapuggalo diṭṭheva dhamme viññūnaṁ gārayho — dussīlo purisapuggalo micchādiṭṭhi natthikavādo’ti. Sace kho attheva paro loko, evaṁ imassa bhoto purisa­pugga­lassa ubhayattha kaliggaho — yañca diṭṭheva dhamme viññūnaṁ gārayho, yañca kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjissati. Evamassāyaṁ apaṇṇako dhammo dussamatto samādinno, ekaṁsaṁ pharitvā tiṭṭhati, riñcati kusalaṁ ṭhānaṁ.",
    "mn60:7": "Tatra, gahapatayo, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘atthi dinnaṁ … pe … ye imañca lokaṁ parañca lokaṁ sayaṁ abhiññā sacchikatvā pavedentī’ti tesametaṁ pāṭikaṅkhaṁ — yamidaṁ kāyaduccaritaṁ, vacīduccaritaṁ, manoduccaritaṁ — ime tayo akusale dhamme abhinivajjetvā yamidaṁ kāyasucaritaṁ, vacīsucaritaṁ, manosucaritaṁ — ime tayo kusale dhamme samādāya vattissanti. Taṁ kissa hetu? Passanti hi te bhonto samaṇabrāhmaṇā akusalānaṁ dhammānaṁ ādīnavaṁ okāraṁ saṅkilesaṁ, kusalānaṁ dhammānaṁ nekkhamme ānisaṁsaṁ vodānapakkhaṁ.",
    "mn60:8": "Tatra, gahapatayo, viññū puriso iti paṭi­sañcik­khati: ‘sace kho atthi paro loko, evamayaṁ bhavaṁ purisapuggalo kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjissati. Kāmaṁ kho pana māhu paro loko, hotu nesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ; atha ca panāyaṁ bhavaṁ purisapuggalo diṭṭheva dhamme viññūnaṁ pāsaṁso — sīlavā purisapuggalo sammādiṭṭhi atthikavādo’ti. Sace kho attheva paro loko, evaṁ imassa bhoto purisa­pugga­lassa ubhayattha kaṭaggaho — yañca diṭṭheva dhamme viññūnaṁ pāsaṁso, yañca kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjissati. Evamassāyaṁ apaṇṇako dhammo susamatto samādinno ubhayaṁsaṁ pharitvā tiṭṭhati, riñcati akusalaṁ ṭhānaṁ.",
    "mn60:9": "Santi, gahapatayo, eke samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato,pāṇama­ti­pāta­yato, adinnaṁ ādiyato, sandhiṁ chindato, nillopaṁ harato, ekāgārikaṁ karoto, paripanthe tiṭṭhato, paradāraṁ gacchato, musā bhaṇato; karoto na karīyati pāpaṁ. Khura­pariyan­tena cepi cakkena yo imissā pathaviyā pāṇe ekaṁ maṁsakhalaṁ ekaṁ maṁsapuñjaṁ kareyya, natthi tatonidānaṁ pāpaṁ, natthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṁ gaccheyya hananto ghātento, chindanto chedāpento, pacanto pācento; natthi tatonidānaṁ pāpaṁ, natthi pāpassa āgamo. Uttarāñcepi gaṅgāya tīraṁ gaccheyya dadanto dāpento, yajanto yajāpento; natthi tatonidānaṁ puññaṁ, natthi puññassa āgamo. Dānena damena saṁyamenasaccavajjenanatthi puññaṁ, natthi puññassa āgamo’ti.",
    "mn60:10": "\"Tatra, gahapatayo, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇama­ti­pāta­yato, adinnaṁ ādiyato, sandhiṁ chindato, nillopaṁ harato, ekāgārikaṁ karoto, paripanthe tiṭṭhato, paradāraṁ gacchato, musā bhaṇato; karoto na karīyati pāpaṁ. Khura­pariyan­tena cepi cakkena yo imissā pathaviyā pāṇe ekaṁ maṁsakhalaṁ ekaṁ maṁsapuñjaṁ kareyya, natthi tatonidānaṁ pāpaṁ, natthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṁ gaccheyya hananto ghātento … pe … dānena damena saṁyamena saccavajjena natthi puññaṁ, natthi puññassa āgamo’ti tesametaṁ pāṭikaṅkhaṁ — yamidaṁ kāyasucaritaṁ, vacīsucaritaṁ, manosucaritaṁ — ime tayo kusale dhamme abhinivajjetvā yamidaṁ kāyaduccaritaṁ, vacīduccaritaṁ, manoduccaritaṁ — ime tayo akusale dhamme samādāya vattissanti. Taṁ kissa hetu? Na hi te bhonto samaṇabrāhmaṇā passanti akusalānaṁ dhammānaṁ ādīnavaṁ okāraṁ saṅkilesaṁ, kusalānaṁ dhammānaṁ nekkhamme ānisaṁsaṁ vodānapakkhaṁ.",
    "mn60:11": "Tatra, gahapatayo, viññū puriso iti paṭi­sañcik­khati: ‘sace kho natthi kiriyā, evamayaṁ bhavaṁ purisapuggalo kāyassa bhedā sotthimattānaṁ karissati; sace kho atthi kiriyā evamayaṁ bhavaṁ purisapuggalo kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjissati. Kāmaṁ kho pana māhu kiriyā, hotu nesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ; atha ca panāyaṁ bhavaṁ purisapuggalo diṭṭheva dhamme viññūnaṁ gārayho — dussīlo purisapuggalo micchādiṭṭhi akiriyavādo’ti. Sace kho attheva kiriyā, evaṁ imassa bhoto purisa­pugga­lassa ubhayattha kaliggaho — yañca diṭṭheva dhamme viññūnaṁ gārayho, yañca kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjissati. Evamassāyaṁ apaṇṇako dhammo dussamatto samādinno, ekaṁsaṁ pharitvā tiṭṭhati, riñcati kusalaṁ ṭhānaṁ.",
    "mn60:12": "Tatra, gahapatayo, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇama­ti­pāta­yato, adinnaṁ ādiyato, sandhiṁ chindato, nillopaṁ harato, ekāgārikaṁ karoto, paripanthe tiṭṭhato, paradāraṁ gacchato, musā bhaṇato; karoto karīyati pāpaṁ. Khura­pariyan­tena cepi cakkena yo imissā pathaviyā pāṇe ekaṁ maṁsakhalaṁ ekaṁ maṁsapuñjaṁ kareyya, atthi tatonidānaṁ pāpaṁ, atthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṁ gaccheyya hananto ghātento, chindanto chedāpento, pacanto pācento, atthi tatonidānaṁ pāpaṁ, atthi pāpassa āgamo. Uttarāñcepi gaṅgāya tīraṁ gaccheyya dadanto dāpento, yajanto yajāpento, atthi tatonidānaṁ puññaṁ, atthi puññassa āgamo. Dānena damena saṁyamena saccavajjena atthi puññaṁ, atthi puññassa āgamo’ti tesametaṁ pāṭikaṅkhaṁ yamidaṁ kāyaduccaritaṁ, vacīduccaritaṁ, manoduccaritaṁ — ime tayo akusale dhamme abhinivajjetvā yamidaṁ kāyasucaritaṁ, vacīsucaritaṁ, manosucaritaṁ — ime tayo kusale dhamme samādāya vattissanti. Taṁ kissa hetu? Passanti hi te bhonto samaṇabrāhmaṇā akusalānaṁ dhammānaṁ ādīnavaṁ okāraṁ saṅkilesaṁ, kusalānaṁ dhammānaṁ nekkhamme ānisaṁsaṁ vodānapakkhaṁ.",
    "mn60:13": "Tatra, gahapatayo, viññū puriso iti paṭi­sañcik­khati: ‘sace kho atthi kiriyā, evamayaṁ bhavaṁ purisapuggalo kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjissati. Kāmaṁ kho pana māhu kiriyā, hotu nesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ; atha ca panāyaṁ bhavaṁ purisapuggalo diṭṭheva dhamme viññūnaṁ pāsaṁso — sīlavā purisapuggalo sammādiṭṭhi kiriyavādo’ti. Sace kho attheva kiriyā, evaṁ imassa bhoto purisa­pugga­lassa ubhayattha kaṭaggaho –  yañca diṭṭheva dhamme viññūnaṁ pāsaṁso, yañca kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjissati. Evamassāyaṁ apaṇṇako dhammo susamatto samādinno, ubhayaṁsaṁ pharitvā tiṭṭhati, riñcati akusalaṁ ṭhānaṁ.",
    "mn60:14": "Santi, gahapatayo, eke samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi hetu, natthi paccayo sattānaṁ saṁkilesāya; ahetū appaccayā sattā saṅkilissanti. Natthi hetu, natthi paccayo sattānaṁ visuddhiyā; ahetū appaccayā sattā visujjhanti. Natthi balaṁ, natthivīriyaṁ, natthi purisathāmo, natthi purisa­pa­rakkamo; sabbe sattā sabbe pāṇā sabbe bhūtā sabbe jīvā avasā abalā avīriyā niyati­saṁ­gati­bhāva­pari­ṇatā chas­ve­vā­bhi­jātīsu sukhadukkhaṁ paṭisaṁvedentī’ti.",
    "mn60:15": "\"Tatra, gahapatayo, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi hetu, natthi paccayo sattānaṁ saṅkilesāya; ahetū appaccayā sattā saṅkilissanti. Natthi hetu, natthi paccayo sattānaṁ visuddhiyā; ahetū appaccayā sattā visujjhanti. Natthi balaṁ, natthi vīriyaṁ, natthi purisathāmo, natthi purisa­pa­rakkamo; sabbe sattā sabbe pāṇā sabbe bhūtā sabbe jīvā avasā abalā avīriyā niyati­saṅga­ti­bhāva­pari­ṇatā chas­ve­vā­bhi­jātīsu sukhadukkhaṁ paṭisaṁvedentī’ti tesametaṁ pāṭikaṅkhaṁ — yamidaṁ kāyasucaritaṁ, vacīsucaritaṁ, manosucaritaṁ — ime tayo kusale dhamme abhinivajjetvā yamidaṁ kāyaduccaritaṁ, vacīduccaritaṁ, manoduccaritaṁ — ime tayo akusale dhamme samādāya vattissanti. Taṁ kissa hetu? Na hi te bhonto samaṇabrāhmaṇā passanti akusalānaṁ dhammānaṁ ādīnavaṁ okāraṁ saṅkilesaṁ, kusalānaṁ dhammānaṁ nekkhamme ānisaṁsaṁ vodānapakkhaṁ.",
    "mn60:16": "Tatra, gahapatayo, viññū puriso iti paṭi­sañcik­khati: ‘sace kho natthi hetu, evamayaṁ bhavaṁ purisapuggalo kāyassa bhedā paraṁ maraṇā sotthimattānaṁ karissati; sace kho atthi hetu, evamayaṁ bhavaṁ purisapuggalo kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjissati. Kāmaṁ kho pana māhu hetu, hotu nesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ; atha ca panāyaṁ bhavaṁ purisapuggalo diṭṭheva dhamme viññūnaṁ gārayho — dussīlo purisapuggalo micchādiṭṭhi ahetukavādo’ti. Sace kho attheva hetu, evaṁ imassa bhoto purisa­pugga­lassa ubhayattha kaliggaho — yañca diṭṭheva dhamme viññūnaṁ gārayho, yañca kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjissati. Evamassāyaṁ apaṇṇako dhammo dussamatto samādinno, ekaṁsaṁ pharitvā tiṭṭhati, riñcati kusalaṁ ṭhānaṁ.",
    "mn60:17": "Tatra, gahapatayo, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘atthi hetu, atthi paccayo sattānaṁ saṅkilesāya; sahetū sappaccayā sattā saṅkilissanti. Atthi hetu, atthi paccayo sattānaṁ visuddhiyā; sahetū sappaccayā sattā visujjhanti. Atthi balaṁ, atthi vīriyaṁ, atthi purisathāmo, atthi purisa­pa­rakkamo; na sabbe sattā sabbe pāṇā sabbe bhūtā sabbe jīvā avasā abalā avīriyā niyati­saṅga­ti­bhāva­pari­ṇatā chas­ve­vā­bhi­jātīsu sukhadukkhaṁ paṭisaṁvedentī’ti tesametaṁ pāṭikaṅkhaṁ — yamidaṁ kāyaduccaritaṁ, vacīduccaritaṁ, manoduccaritaṁ — ime tayo akusale dhamme abhinivajjetvā yamidaṁ kāyasucaritaṁ, vacīsucaritaṁ, manosucaritaṁ — ime tayo kusale dhamme samādāya vattissanti. Taṁ kissa hetu? Passanti hi te bhonto samaṇabrāhmaṇā akusalānaṁ dhammānaṁ ādīnavaṁ okāraṁ saṅkilesaṁ, kusalānaṁ dhammānaṁ nekkhamme ānisaṁsaṁ vodānapakkhaṁ.",
    "mn60:18": "Tatra, gahapatayo, viññū puriso iti paṭi­sañcik­khati: ‘sace kho atthi hetu, evamayaṁ bhavaṁ purisapuggalo kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjissati. Kāmaṁ kho pana māhu hetu, hotu nesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ; atha ca panāyaṁ bhavaṁ purisapuggalo diṭṭheva dhamme viññūnaṁ pāsaṁso — sīlavā purisapuggalo sammādiṭṭhi hetuvādo’ti. Sace kho atthi hetu, evaṁ imassa bhoto purisa­pugga­lassa ubhayattha kaṭaggaho — yañca diṭṭheva dhamme viññūnaṁ pāsaṁso, yañca kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjissati. Evamassāyaṁ apaṇṇako dhammo susamatto samādinno, ubhayaṁsaṁ pharitvā tiṭṭhati, riñcati akusalaṁ ṭhānaṁ.",
    "mn60:19": "Santi, gahapatayo, eke samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi sabbaso āruppā’ti.",
    "mn60:20": "\"Tatra, gahapatayo, viññū puriso iti paṭi­sañcik­khati — ye kho te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi sabbaso āruppā’ti, idaṁ me adiṭṭhaṁ; yepi te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘atthi sabbaso āruppā’ti, idaṁ me aviditaṁ.Ahañcevakho pana ajānanto apassanto ekaṁsena ādāya vohareyyaṁ — idameva saccaṁ, moghamaññanti, na metaṁ assa patirūpaṁ. Ye kho te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi sabbaso āruppā’ti, sace tesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ, ṭhānametaṁ vijjati — ye te devā rūpino manomayā, apaṇṇakaṁ me tatrūpapatti bhavissati. Ye pana te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘atthi sabbaso āruppā’ti, sace tesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ, ṭhānametaṁ vijjati — ye te devā arūpino saññāmayā, apaṇṇakaṁ me tatrūpapatti bhavissati. Dissanti kho panarūpādhikaraṇaṁdaṇḍā­dāna­satthā­dānaka­la­havig­gaha­vivāda­tuvaṁ­tuvaṁ­pe­suñ­ña­musā­vādā. ‘Natthi kho panetaṁ sabbaso arūpe’ti. So iti paṭisaṅkhāya rūpānaṁyeva nibbidāya virāgāya nirodhāya paṭipanno hoti.",
    "mn60:21": "Santi, gahapatayo, eke samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi sabbaso bhavanirodho’ti.",
    "mn60:22": "\"Tatra, gahapatayo, viññū puriso iti paṭi­sañcik­khati — ye kho te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi sabbaso bhavanirodho’ti, idaṁ me adiṭṭhaṁ; yepi te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘atthi sabbaso bhavanirodho’ti, idaṁ me aviditaṁ. Ahañceva kho pana ajānanto apassanto ekaṁsena ādāya vohareyyaṁ — idameva saccaṁ, moghamaññanti, na metaṁ assa patirūpaṁ. Ye kho te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi sabbaso bhavanirodho’ti, sace tesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ, ṭhānametaṁ vijjati — ye te devā arūpino saññāmayā apaṇṇakaṁ me tatrūpapatti bhavissati. Ye pana te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘atthi sabbaso bhavanirodho’ti, sace tesaṁ bhavataṁ samaṇab­rāhma­ṇā­naṁ saccaṁ vacanaṁ, ṭhānametaṁ vijjati — yaṁ diṭṭheva dhamme pari­nib­bā­yis­sāmi. Ye kho te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Natthi sabbaso bhavanirodho’ti, tesamayaṁ diṭṭhisārāgāyasantike, saṁyogāya santike, abhinandanāya santike, ajjhosānāya santike, upādānāya santike. Ye pana te bhonto samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘atthi sabbaso bhavanirodho’ti, tesamayaṁ diṭṭhi asārāgāya santike, asaṁyogāya santike, anabhi­nanda­nāya santike, anajjhosānāya santike, anupādānāya santiketi. So iti paṭisaṅkhāya bhavānaṁyeva nibbidāya virāgāya nirodhāya paṭipanno hoti.",
    "mn60:23": "Cattārome, gahapatayo, puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro? Idha, gahapatayo, ekacco puggalo attantapo hoti atta­pari­tāpa­nā­nu­yoga­manu­yutto. Idha, gahapatayo, ekacco puggalo parantapo hoti para­pari­tāpa­nā­nu­yoga­manu­yutto. Idha, gahapatayo, ekacco puggalo attantapo ca hoti atta­pari­tāpa­nā­nu­yoga­manu­yutto parantapo ca para­pari­tāpa­nā­nu­yoga­manu­yutto. Idha, gahapatayo, ekacco puggalo nevattantapo hoti nātta­pari­tāpa­nā­nu­yoga­manu­yutto na parantapo na para­pari­tāpa­nā­nu­yoga­manu­yutto; so anattantapo aparantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhap­paṭi­saṁ­vedī brahmabhūtena attanā viharati.",
    "mn60:24": "Katamo ca, gahapatayo, puggalo attantapo atta­pari­tāpa­nā­nu­yoga­manu­yutto? Idha, gahapatayo, ekacco puggalo acelako hoti muttācāro hatthā­pa­lekhano … pe … iti evarūpaṁ anekavihitaṁ kāyassa ātāpa­na­pari­tāpa­nā­nu­yoga­manu­yutto viharati. Ayaṁ vuccati, gahapatayo, puggalo attantapo atta­pari­tāpa­nā­nu­yoga­manu­yutto.",
    "mn60:25": "Katamo ca, gahapatayo, puggalo parantapo para­pari­tāpa­nā­nu­yoga­manu­yutto? Idha, gahapatayo, ekacco puggalo orabbhiko hoti sūkariko … pe … ye vā panaññepi keci kurūrakammantā. Ayaṁ vuccati, gahapatayo, puggalo parantapo para­pari­tāpa­nā­nu­yoga­manu­yutto.",
    "mn60:26": "Katamo ca, gahapatayo, puggalo attantapo ca atta­pari­tāpa­nā­nu­yoga­manu­yutto parantapo ca para­pari­tāpa­nā­nu­yoga­manu­yutto? Idha, gahapatayo, ekacco puggalo rājā vā hoti khattiyo muddhāvasitto … pe … tepi daṇḍatajjitā bhayatajjitā assumukhā rudamānā parikammāni karonti. Ayaṁ vuccati, gahapatayo, puggalo attantapo ca atta­pari­tāpa­nā­nu­yoga­manu­yutto parantapo ca para­pari­tāpa­nā­nu­yoga­manu­yutto.",
    "mn60:27": "Katamo ca, gahapatayo, puggalo nevattantapo nātta­pari­tāpa­nā­nu­yoga­manu­yutto na parantapo na para­pari­tāpa­nā­nu­yoga­manu­yutto; so anattantapo aparantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhap­paṭi­saṁ­vedī brahmabhūtena attanā viharati?",
    "mn60:28": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe viga­tū­pak­kilese mudubhūte kammaniye ṭhite āneñjappatte pubbe­nivāsā­nus­sati­ñāṇāya cittaṁ abhininnāmeti. So anekavihitaṁ pubbenivāsaṁ anussarati seyyathidaṁ — ekampi jātiṁ dvepi jātiyo … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe viga­tū­pak­kilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutū­papāta­ñā­ṇāya cittaṁ abhininnāmeti. So dibbena cakkhunā visuddhena atik­kanta­mānusa­kena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate … pe … yathākammūpage satte pajānāti. So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe viga­tū­pak­kilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmeti. So ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti … pe … ‘Ayaṁ āsava­nirodha­gāminī paṭipadā’ti yathābhūtaṁ pajānāti. Tassa evaṁ jānato evaṁ passato kāmāsavāpi cittaṁ vimuccati, bhavāsavāpi cittaṁ vimuccati, avijjāsavāpi cittaṁ vimuccati. Vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti.",
    "mn60:29": "Evaṁ vutte, sāleyyakā brāhma­ṇa­gaha­patikā bhagavantaṁ etadavocuṁ: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena aneka­pariyā­yena dhammo pakāsito. Ete mayaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāma dhammañca ­bhik­khu­saṅghañca. Upāsake no bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gate\"ti.",
    "mn60:30": "Kanda­ra­nāga­ra­sekha­vato ca,Potaliyo puna jīvakabhacco;Upālidamatho kukkuraabhayo,Bahu­veda­nī­yāpaṇṇa­kato dasamo."
}