{
    "mn63:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn63:2": "Atha kho āyasmā mālukyaputto sāyanhasamayaṁ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā mālukyaputto bhagavantaṁ etadavoca:",
    "mn63:3": "\"Idha mayhaṁ, bhante, rahogatassa paṭisallīnassa evaṁ cetaso parivitakko udapādi — yānimāni diṭṭhigatāni bhagavatā abyākatāni ṭhapitāni paṭikkhittāni: ‘sassato loko’tipi, ‘asassato loko’tipi … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipi — tāni me bhagavā na byākaroti. Yāni me bhagavā na byākaroti taṁ me na ruccati, taṁ me nakkhamati. Sohaṁ bhagavantaṁ upasaṅkamitvā etamatthaṁ pucchissāmi.",
    "mn63:4": "\"Kiṁ nu tāhaṁ, mālukyaputta, evaṁ avacaṁ: ‘ehi tvaṁ, mālukyaputta, mayi brahmacariyaṁ cara, ahaṁ te byākarissāmi: \"sassato loko\"ti vā, \"asassato loko\"ti vā, \"antavā loko\"ti vā, \"anantavā loko\"ti vā, \"taṁ jīvaṁ taṁ sarīran\"ti vā, \"aññaṁ jīvaṁ aññaṁ sarīran\"ti vā, \"hoti tathāgato paraṁ maraṇā\"ti vā, \"na hoti tathāgato paraṁ maraṇā\"ti vā, \"hoti ca na ca hoti tathāgato paraṁ maraṇā\"ti vā, \"neva hoti na na hoti tathāgato paraṁ maraṇā\"ti vā’\"ti?",
    "mn63:5": "\"No hetaṁ, bhante\".",
    "mn63:6": "\"Tvaṁ vā pana maṁ evaṁ avaca: ‘Ahaṁ, bhante, bhagavati brahmacariyaṁ carissāmi, bhagavā me byākarissati: \"sassato loko\"ti vā, \"asassato loko\"ti vā, \"antavā loko\"ti vā, \"anantavā loko\"ti vā, \"taṁ jīvaṁ taṁ sarīran\"ti vā, \"aññaṁ jīvaṁ aññaṁ sarīran\"ti vā, \"hoti tathāgato paraṁ maraṇā\"ti vā, \"na hoti tathāgato paraṁ maraṇā\"ti vā, \"hoti ca na ca hoti tathāgato paraṁ maraṇā\"ti vā, \"neva hoti na na hoti tathāgato paraṁ maraṇā\"ti vā’\"ti?",
    "mn63:7": "\"No hetaṁ, bhante\".",
    "mn63:8": "\"Iti kira, mālukyaputta, nevāhaṁ taṁ vadāmi: ‘ehi tvaṁ, mālukyaputta, mayi brahmacariyaṁ cara, ahaṁ te byākarissāmi: \"sassato loko\"ti vā, \"asassato loko\"ti vā … pe … \"neva hoti na na hoti tathāgato paraṁ maraṇāti vā\"’ti; napi kira maṁ tvaṁ vadesi: ‘Ahaṁ, bhante, bhagavati brahmacariyaṁ carissāmi, bhagavā me byākarissati: \"sassato loko\"ti vā \"asassato loko\"ti vā … pe … \"neva hoti na na hoti tathāgato paraṁ maraṇā\"ti vā’ti. Evaṁ sante, moghapurisa, ko santo kaṁ paccācikkhasi?",
    "mn63:9": "Yo kho, mālukyaputta, evaṁ vadeyya: ‘Na tāvāhaṁ bhagavati brahmacariyaṁ carissāmi yāva me bhagavā na byākarissati: \"sassato loko\"ti vā, \"asassato loko\"ti vā … pe … \"neva hoti na na hoti tathāgato paraṁ maraṇā\"ti vā’ti, abyākatameva taṁ, mālukyaputta, tathāgatena assa, atha so puggalo kālaṁ kareyya. Seyyathāpi, mālukyaputta, puriso sallena viddho assa savisena gāḷhapalepanena. Tassa mittāmaccā ñātisālohitā bhisakkaṁ sallakattaṁ upaṭṭhapeyyuṁ. So evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ purisaṁ jānāmi yenamhi viddho, khattiyo vā brāhmaṇo vā vesso vā suddo vā’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ purisaṁ jānāmi yenamhi viddho, evaṁnāmo evaṁgotto iti vā’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ purisaṁ jānāmi yenamhi viddho, dīgho vā rasso vā majjhimo vā’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ purisaṁ jānāmi yenamhi viddho, kāḷo vā sāmo vā maṅguracchavī vā’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ purisaṁ jānāmi yenamhi viddho, amukasmiṁ gāme vā nigame vā nagare vā’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ dhanuṁ jānāmi yenamhi viddho, yadi vā cāpo yadi vā kodaṇḍo’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ jiyaṁ jānāmi yāyamhi viddho, yadi vā akkassa yadi vāsaṇhassayadi vā nhārussa yadi vā maruvāya yadi vā khīrapaṇṇino’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ kaṇḍaṁ jānāmi yenamhi viddho, yadi vā gacchaṁ yadi vā ropiman’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ kaṇḍaṁ jānāmi yenamhi viddho, yassa pattehivājitaṁyadi vā gijjhassa yadi vā kaṅkassa yadi vā kulalassa yadi vā morassa yadi vā sithilahanuno’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ kaṇḍaṁ jānāmi yenamhi viddho, yassa nhārunā parikkhittaṁ yadi vā gavassa yadi vā mahiṁsassa yadi vābheravassayadi vā semhārassā’ti; so evaṁ vadeyya: ‘Na tāvāhaṁ imaṁ sallaṁ āharissāmi yāva na taṁ sallaṁ jānāmi yenamhi viddho, yadi vā sallaṁ yadi vā khurappaṁ yadi vā vekaṇḍaṁ yadi vā nārācaṁ yadi vā vacchadantaṁ yadi vā karavīrapattan’ti — aññātameva taṁ, mālukyaputta, tena purisena assa, atha so puriso kālaṁ kareyya. Evameva kho, mālukyaputta, yo evaṁ vadeyya: ‘Na tāvāhaṁ bhagavati brahmacariyaṁ carissāmi yāva me bhagavā na byākarissati: \"sassato loko\"ti vā \"asassato loko\"ti vā … pe … \"neva hoti na na hoti tathāgato paraṁ maraṇā\"ti vā’ti — abyākatameva taṁ, mālukyaputta, tathāgatena assa, atha so puggalo kālaṁ kareyya.",
    "mn63:10": "‘Sassato loko’ti, mālukyaputta, diṭṭhiyā sati brahmacariyavāso abhavissāti, evaṁ no. ‘Asassato loko’ti, mālukyaputta, diṭṭhiyā sati brahmacariyavāso abhavissāti, evampi no. ‘Sassato loko’ti vā, mālukyaputta, diṭṭhiyā sati, ‘asassato loko’ti vā diṭṭhiyā sati attheva jāti, atthi jarā, atthi maraṇaṁ, santi sokaparidevadukkhadomanassupāyāsā; yesāhaṁ diṭṭheva dhamme nighātaṁ paññapemi.",
    "mn63:11": "Tasmātiha, mālukyaputta, abyākatañca me abyākatato dhāretha; byākatañca me byākatato dhāretha. Kiñca, mālukyaputta, mayā abyākataṁ? ‘Sassato loko’ti mālukyaputta, mayā abyākataṁ; ‘asassato loko’ti — mayā abyākataṁ; ‘antavā loko’ti — mayā abyākataṁ; ‘anantavā loko’ti — mayā abyākataṁ; ‘taṁ jīvaṁ taṁ sarīran’ti — mayā abyākataṁ; ‘aññaṁ jīvaṁ aññaṁ sarīran’ti — mayā abyākataṁ; ‘hoti tathāgato paraṁ maraṇā’ti — mayā abyākataṁ; ‘Na hoti tathāgato paraṁ maraṇā’ti — mayā abyākataṁ; ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’ti –  mayā abyākataṁ; ‘neva hoti na na hoti tathāgato paraṁ maraṇā’ti — mayā abyākataṁ.",
    "mn63:12": "Idamavoca bhagavā. Attamano āyasmā mālukyaputto bhagavato bhāsitaṁ abhinandīti."
}