{
    "mn64:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn64:2": "Evaṁ vutte, āyasmā mālukyaputto bhagavantaṁ etadavoca: \"ahaṁ kho, bhante, dhāremi bhagavatā desitāni pañcorambhāgiyāni saṁyojanānī\"ti.",
    "mn64:3": "\"Kassa kho nāma tvaṁ, mālukyaputta, imāni evaṁ pañcorambhāgiyāni saṁyojanāni desitāni dhāresi? Nanu, mālukyaputta, aññatitthiyā paribbājakā iminā taruṇūpamena upārambhena upārambhissanti? Dāhārassa hi, mālukyaputta, kumārassa mandassa uttānaseyyakassa sakkāyotipi na hoti, kuto panassa uppajjissati sakkāyadiṭṭhi?Anusetvevassasakkāyadiṭṭhānusayo. Dāhārassa hi, mālukyaputta, kumārassa mandassa uttānaseyyakassa dhammātipi na hoti, kuto panassa uppajjissati dhammesu vicikicchā? Anusetvevassa vicikicchānusayo. Dāhārassa hi, mālukyaputta, kumārassa mandassa uttānaseyyakassa sīlātipi na hoti, kuto panassa uppajjissati sīlesu sīlabbataparāmāso? Anusetvevassa sīlabbataparāmāsānusayo. Dāhārassa hi, mālukyaputta, kumārassa mandassa uttānaseyyakassa kāmātipi na hoti, kuto panassa uppajjissati kāmesu kāmacchando? Anusetvevassa kāmarāgānusayo. Dāhārassa hi, mālukyaputta, kumārassa mandassa uttānaseyyakassa sattātipi na hoti, kuto panassa uppajjissati sattesu byāpādo? Anusetvevassa byāpādānusayo. Nanu, mālukyaputta, aññatitthiyā paribbājakā iminā taruṇūpamena upārambhena upārambhissantī\"ti?",
    "mn64:4": "Evaṁ vutte, āyasmā ānando bhagavantaṁ etadavoca: \"etassa, bhagavā, kālo, etassa, sugata, kālo yaṁ bhagavā pañcorambhāgiyāni saṁyojanāni deseyya. Bhagavato sutvā bhikkhū dhāressantī\"ti.",
    "mn64:5": "\"Idhānanda, assutavā puthujjano ariyānaṁ adassāvī ariyadhammassa akovido ariyadhamme avinīto, sappurisānaṁ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto sakkāyadiṭṭhipariyuṭṭhitena cetasā viharati sakkāyadiṭṭhiparetena; uppannāya ca sakkāyadiṭṭhiyā nissaraṇaṁ yathābhūtaṁ nappajānāti. Tassa sā sakkāyadiṭṭhi thāmagatā appaṭivinītā orambhāgiyaṁ saṁyojanaṁ.",
    "mn64:6": "Vicikicchāpariyuṭṭhitena cetasā viharati vicikicchāparetena; uppannāya ca vicikicchāya nissaraṇaṁ yathābhūtaṁ nappajānāti. Tassa sā vicikicchā thāmagatā appaṭivinītā orambhāgiyaṁ saṁyojanaṁ.",
    "mn64:7": "Sīlabbataparāmāsapariyuṭṭhitena cetasā viharati sīlabbataparāmāsaparetena; uppannassa ca sīlabbataparāmāsassa nissaraṇaṁ yathābhūtaṁ nappajānāti. Tassa so sīlabbataparāmāso thāmagato appaṭivinīto orambhāgiyaṁ saṁyojanaṁ.",
    "mn64:8": "Kāmarāgapariyuṭṭhitena cetasā viharati kāmarāgaparetena; uppannassa ca kāmarāgassa nissaraṇaṁ yathābhūtaṁ nappajānāti. Tassa so kāmarāgo thāmagato appaṭivinīto orambhāgiyaṁ saṁyojanaṁ.",
    "mn64:9": "Byāpādapariyuṭṭhitena cetasā viharati byāpādaparetena; uppannassa ca byāpādassa nissaraṇaṁ yathābhūtaṁ nappajānāti. Tassa so byāpādo thāmagato appaṭivinīto orambhāgiyaṁ saṁyojanaṁ.",
    "mn64:10": "Sutavā ca kho, ānanda, ariyasāvako ariyānaṁ dassāvī ariyadhammassa kovido ariyadhamme suvinīto, sappurisānaṁ dassāvī sappurisadhammassa kovido sappurisadhamme suvinīto na sakkāyadiṭṭhipariyuṭṭhitena cetasā viharati na sakkāyadiṭṭhiparetena; uppannāya ca sakkāyadiṭṭhiyā nissaraṇaṁ yathābhūtaṁ pajānāti. Tassa sā sakkāyadiṭṭhi sānusayā pahīyati.",
    "mn64:11": "Na vicikicchāpariyuṭṭhitena cetasā viharati na vicikicchāparetena; uppannāya ca vicikicchāya nissaraṇaṁ yathābhūtaṁ pajānāti. Tassa sā vicikicchā sānusayā pahīyati.",
    "mn64:12": "Na sīlabbataparāmāsapariyuṭṭhitena cetasā viharati na sīlabbataparāmāsaparetena; uppannassa ca sīlabbataparāmāsassa nissaraṇaṁ yathābhūtaṁ pajānāti. Tassa so sīlabbataparāmāso sānusayo pahīyati.",
    "mn64:13": "Na kāmarāgapariyuṭṭhitena cetasā viharati na kāmarāgaparetena; uppannassa ca kāmarāgassa nissaraṇaṁ yathābhūtaṁ pajānāti. Tassa so kāmarāgo sānusayo pahīyati.",
    "mn64:14": "Na byāpādapariyuṭṭhitena cetasā viharati na byāpādaparetena; uppannassa ca byāpādassa nissaraṇaṁ yathābhūtaṁ pajānāti. Tassa so byāpādo sānusayo pahīyati.",
    "mn64:15": "Yo, ānanda, maggo yā paṭipadā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ pahānāya taṁ maggaṁ taṁ paṭipadaṁ anāgamma pañcorambhāgiyāni saṁyojanāni ñassati vā dakkhati vā pajahissati vāti — netaṁ ṭhānaṁ vijjati. Seyyathāpi, ānanda, mahato rukkhassa tiṭṭhato sāravato tacaṁ acchetvā phegguṁ acchetvā sāracchedo bhavissatīti — netaṁ ṭhānaṁ vijjati; evameva kho, ānanda, yo maggo yā paṭipadā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ pahānāya taṁ maggaṁ taṁ paṭipadaṁ anāgamma pañcorambhāgiyāni saṁyojanāni ñassati vā dakkhati vā pajahissati vāti — netaṁ ṭhānaṁ vijjati.",
    "mn64:16": "Yo ca kho, ānanda, maggo yā paṭipadā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ pahānāya taṁ maggaṁ taṁ paṭipadaṁ āgamma pañcorambhāgiyāni saṁyojanāni ñassati vā dakkhati vā pajahissati vāti — ṭhānametaṁ vijjati. Seyyathāpi, ānanda, mahato rukkhassa tiṭṭhato sāravato tacaṁ chetvā phegguṁ chetvā sāracchedo bhavissatīti — ṭhānametaṁ vijjati; evameva kho, ānanda, yo maggo yā paṭipadā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ pahānāya taṁ maggaṁ taṁ paṭipadaṁ āgamma pañcorambhāgiyāni saṁyojanāni ñassati vā dakkhati vā pajahissati vāti –  ṭhānametaṁ vijjati.",
    "mn64:17": "Katamo cānanda, maggo, katamā paṭipadā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ pahānāya? Idhānanda, bhikkhu upadhivivekā akusalānaṁ dhammānaṁ pahānā sabbaso kāyaduṭṭhullānaṁ paṭippassaddhiyā vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati.",
    "mn64:18": "Puna caparaṁ, ānanda, bhikkhu vitakkavicārānaṁ vūpasamā … pe … dutiyaṁ jhānaṁ upasampajja viharati … pe … tatiyaṁ jhānaṁ … pe … catutthaṁ jhānaṁ upasampajja viharati.",
    "mn64:19": "Puna caparaṁ, ānanda, bhikkhu sabbaso rūpasaññānaṁ samatikkamā paṭighasaññānaṁ atthaṅgamā nānattasaññānaṁ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṁ upasampajja viharati.",
    "mn64:20": "Puna caparaṁ, ānanda, bhikkhu sabbaso ākāsānañcāyatanaṁ samatikkamma ‘anantaṁ viññāṇan’ti viññāṇañcāyatanaṁ upasampajja viharati.",
    "mn64:21": "Puna caparaṁ, ānanda, bhikkhu sabbaso viññāṇañcāyatanaṁ samatikkamma ‘Natthi kiñcī’ti ākiñcaññāyatanaṁ upasampajja viharati.",
    "mn64:22": "\"Eso ce, bhante, maggo esā paṭipadā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ pahānāya, atha kiñcarahi idhekacce bhikkhū cetovimuttino ekacce bhikkhū paññāvimuttino\"ti?",
    "mn64:23": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}