{
    "mn65:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti. \"Bhadante\"ti te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "mn65:2": "\"Ahaṁ kho, bhikkhave, ekāsanabhojanaṁ bhuñjāmi; ekāsanabhojanaṁ kho, ahaṁ, bhikkhave, bhuñjamāno appābādhatañca sañjānāmi appātaṅkatañca lahuṭṭhānañca balañca phāsuvihārañca. Etha, tumhepi, bhikkhave, ekāsanabhojanaṁ bhuñjatha; ekāsanabhojanaṁ kho, bhikkhave, tumhepi bhuñjamānā appābādhatañca sañjānissatha appātaṅkatañca lahuṭṭhānañca balañca phāsuvihārañcā\"ti.",
    "mn65:3": "Evaṁ vutte, āyasmā bhaddāli bhagavantaṁ etadavoca: \"ahaṁ kho, bhante, na ussahāmi ekāsanabhojanaṁ bhuñjituṁ; ekāsanabhojanañhi me, bhante, bhuñjato siyā kukkuccaṁ, siyā vippaṭisāro\"ti.",
    "mn65:4": "Tena kho pana samayena sambahulā bhikkhū bhagavato cīvarakammaṁ karonti –  niṭṭhitacīvaro bhagavā temāsaccayena cārikaṁ pakkamissatīti.",
    "mn65:5": "\"Taggha tvaṁ, bhaddāli, accayo accagamā yathābālaṁ yathāmūḷhaṁ yathāakusalaṁ, yaṁ tvaṁ mayā sikkhāpade paññāpiyamāne bhikkhusaṅghe sikkhaṁ samādiyamāne anussāhaṁ pavedesi.",
    "mn65:6": "\"Accayo maṁ, bhante, accagamā yathābālaṁ yathāmūḷhaṁ yathāakusalaṁ, yohaṁ bhagavatā sikkhāpade paññāpiyamāne bhikkhusaṅghe sikkhaṁ samādiyamāne anussāhaṁ pavedesiṁ. Tassa me, bhante, bhagavā accayaṁ accayato paṭiggaṇhātu āyatiṁ saṁvarāyā\"ti.",
    "mn65:7": "\"Taggha tvaṁ, bhaddāli, accayo accagamā yathābālaṁ yathāmūḷhaṁ yathāakusalaṁ, yaṁ tvaṁ mayā sikkhāpade paññāpiyamāne bhikkhusaṅghe sikkhaṁ samādiyamāne anussāhaṁ pavedesi.",
    "mn65:8": "Taṁ kiṁ maññasi, bhaddāli, idhassa bhikkhu ubhatobhāgavimutto, tamahaṁ evaṁ vadeyyaṁ: ‘ehi me tvaṁ, bhikkhu, paṅke saṅkamo hohī’ti, api nu kho so saṅkameyya vā aññena vā kāyaṁ sannāmeyya, ‘no’ti vā vadeyyā\"ti?",
    "mn65:9": "\"No hetaṁ, bhante\".",
    "mn65:10": "\"Taṁ kiṁ maññasi, bhaddāli, idhassa bhikkhu paññāvimutto … kāyasakkhi … diṭṭhippatto … saddhāvimutto … dhammānusārī … saddhānusārī, tamahaṁ evaṁ vadeyyaṁ: ‘ehi me tvaṁ, bhikkhu, paṅke saṅkamo hohī’ti, api nu kho so saṅkameyya vā aññena vā kāyaṁ sannāmeyya, ‘no’ti vā vadeyyā\"ti?",
    "mn65:11": "\"No hetaṁ, bhante\".",
    "mn65:12": "\"Taṁ kiṁ maññasi, bhaddāli, api nu tvaṁ, bhaddāli, tasmiṁ samaye ubhatobhāgavimutto vā hosi paññāvimutto vā kāyasakkhi vā diṭṭhippatto vā saddhāvimutto vā dhammānusārī vā saddhānusārī vā\"ti?",
    "mn65:13": "\"No hetaṁ, bhante\".",
    "mn65:14": "\"Nanu tvaṁ, bhaddāli, tasmiṁ samaye ritto tuccho aparaddho\"ti?",
    "mn65:15": "\"Evaṁ, bhante. Accayo maṁ, bhante, accagamā yathābālaṁ yathāmūḷhaṁ yathāakusalaṁ, yohaṁ bhagavatā sikkhāpade paññāpiyamāne bhikkhusaṅghe sikkhaṁ samādiyamāne anussāhaṁ pavedesiṁ. Tassa me, bhante, bhagavā accayaṁ accayato paṭiggaṇhātu āyatiṁ saṁvarāyā\"ti.",
    "mn65:16": "\"Taggha tvaṁ, bhaddāli, accayo accagamā yathābālaṁ yathāmūḷhaṁ yathāakusalaṁ, yaṁ tvaṁ mayā sikkhāpade paññāpiyamāne bhikkhusaṅghe sikkhaṁ samādiyamāne anussāhaṁ pavedesi. Yato ca kho tvaṁ, bhaddāli, accayaṁ accayato disvā yathādhammaṁ paṭikarosi, taṁ te mayaṁ paṭiggaṇhāma. Vuddhihesā, bhaddāli, ariyassa vinaye yo accayaṁ accayato disvā yathādhammaṁ paṭikaroti, āyatiṁ saṁvaraṁ āpajjati.",
    "mn65:17": "Idha, bhaddāli, ekacco bhikkhu satthusāsane sikkhāya aparipūrakārī hoti. Tassa evaṁ hoti: ‘yannūnāhaṁ vivittaṁ senāsanaṁ bhajeyyaṁ araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. Appeva nāmāhaṁuttarimanussadhammā alamariyañāṇadassanavisesaṁ sacchikareyyan’ti. So vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. Tassa tathāvūpakaṭṭhassa viharato satthāpi upavadati, anuviccapi viññū sabrahmacārī upavadanti, devatāpi upavadanti, attāpi attānaṁ upavadati. So satthārāpi upavadito, anuviccapi viññūhi sabrahmacārīhi upavadito, devatāhipi upavadito, attanāpi attānaṁ upavadito na uttari manussadhammā alamariyañāṇadassanavisesaṁ sacchikaroti. Taṁ kissa hetu? Evañhi taṁ, bhaddāli, hoti yathā taṁ satthusāsane sikkhāya aparipūrakārissa.",
    "mn65:18": "Idha pana, bhaddāli, ekacco bhikkhu satthusāsane sikkhāya paripūrakārī hoti. Tassa evaṁ hoti: ‘yannūnāhaṁ vivittaṁ senāsanaṁ bhajeyyaṁ araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. Appeva nāmāhaṁ uttari manussadhammā alamariyañāṇadassanavisesaṁ sacchikareyyan’ti. So vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. Tassa tathāvūpakaṭṭhassa viharato satthāpi na upavadati, anuviccapi viññū sabrahmacārī na upavadanti, devatāpi na upavadanti, attāpi attānaṁ na upavadati. So satthārāpi anupavadito, anuviccapi viññūhi sabrahmacārīhi anupavadito, devatāhipi anupavadito, attanāpi attānaṁ anupavadito uttari manussadhammā alamariyañāṇadassanavisesaṁ sacchikaroti. So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. Taṁ kissa hetu? Evañhi taṁ, bhaddāli, hoti yathā taṁ satthusāsane sikkhāya paripūrakārissa.",
    "mn65:19": "Puna caparaṁ, bhaddāli, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. Taṁ kissa hetu? Evañhi taṁ, bhaddāli, hoti yathā taṁ satthusāsane sikkhāya paripūrakārissa.",
    "mn65:20": "Puna caparaṁ, bhaddāli, bhikkhu pītiyā ca virāgā upekkhako ca viharati, sato ca sampajāno sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti tatiyaṁ jhānaṁ upasampajja viharati. Taṁ kissa hetu? Evañhi taṁ, bhaddāli, hoti yathā taṁ satthusāsane sikkhāya paripūrakārissa.",
    "mn65:21": "Puna caparaṁ, bhaddāli, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. Taṁ kissa hetu? Evañhi taṁ, bhaddāli, hoti yathā taṁ satthusāsane sikkhāya paripūrakārissa.",
    "mn65:22": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhininnāmeti. So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ — ekampi jātiṁ dvepi jātiyo … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. Taṁ kissa hetu? Evañhi taṁ, bhaddāli, hoti yathā taṁ satthusāsane sikkhāya paripūrakārissa.",
    "mn65:23": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā … pe … vinipātaṁ nirayaṁ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā … pe … sugatiṁ saggaṁ lokaṁ upapannā’ti iti dibbena cakkhunā visuddhena atikkantamānusakena … pe … yathākammūpage satte pajānāti. Taṁ kissa hetu? Evañhi taṁ, bhaddāli, hoti yathā taṁ satthusāsane sikkhāya paripūrakārissa.",
    "mn65:24": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmeti. So ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti; ‘ime āsavā’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti.",
    "mn65:25": "Evaṁ vutte, āyasmā bhaddāli bhagavantaṁ etadavoca: \"ko nu kho, bhante, hetu, ko paccayo yena midhekaccaṁ bhikkhuṁpasayha pasayhakāraṇaṁ karonti? Ko pana, bhante, hetu, ko paccayo yena midhekaccaṁ bhikkhuṁ no tathā pasayha pasayha kāraṇaṁ karontī\"ti?",
    "mn65:26": "\"Idha, bhaddāli, ekacco bhikkhu abhiṇhāpattiko hoti āpattibahulo. So bhikkhūhi vuccamāno aññenaññaṁ paṭicarati, bahiddhā kathaṁ apanāmeti, kopañca dosañca appaccayañca pātukaroti, na sammā vattati, na lomaṁ pāteti, na netthāraṁ vattati, ‘yena saṁgho attamano hoti taṁ karomī’ti nāha. Tatra, bhaddāli, bhikkhūnaṁ evaṁ hoti: ‘Ayaṁ kho, āvuso, bhikkhu abhiṇhāpattiko āpattibahulo. So bhikkhūhi vuccamāno aññenaññaṁ paṭicarati, bahiddhā kathaṁ apanāmeti, kopañca dosañca appaccayañca pātukaroti, na sammā vattati, na lomaṁ pāteti, na netthāraṁ vattati, \"yena saṁgho attamano hoti taṁ karomī\"ti nāha. Sādhu vatāyasmanto imassa bhikkhuno tathā tathā upaparikkhathayathāssidaṁadhikaraṇaṁ na khippameva vūpasameyyā’ti. Tassa kho evaṁ, bhaddāli, bhikkhuno bhikkhū tathā tathā upaparikkhanti yathāssidaṁ adhikaraṇaṁ na khippameva vūpasammati.",
    "mn65:27": "Idha pana, bhaddāli, ekacco bhikkhu abhiṇhāpattiko hoti āpattibahulo. So bhikkhūhi vuccamāno nāññenaññaṁ paṭicarati, bahiddhā kathaṁ na apanāmeti, na kopañca dosañca appaccayañca pātukaroti, sammā vattati, lomaṁ pāteti, netthāraṁ vattati, ‘yena saṅgho attamano hoti taṁ karomī’ti āha. Tatra, bhaddāli, bhikkhūnaṁ evaṁ hoti: ‘Ayaṁ kho, āvuso, bhikkhu abhiṇhāpattiko āpattibahulo. So bhikkhūhi vuccamāno nāññenaññaṁ paṭicarati, bahiddhā kathaṁ na apanāmeti, na kopañca dosañca appaccayañca pātukaroti, sammā vattati, lomaṁ pāteti, netthāraṁ vattati, \"yena saṅgho attamano hoti taṁ karomī\"ti āha. Sādhu vatāyasmanto, imassa bhikkhuno tathā tathā upaparikkhatha yathāssidaṁ adhikaraṇaṁ khippameva vūpasameyyā’ti. Tassa kho evaṁ, bhaddāli, bhikkhuno bhikkhū tathā tathā upaparikkhanti yathāssidaṁ adhikaraṇaṁ khippameva vūpasammati.",
    "mn65:28": "Idha, bhaddāli, ekacco bhikkhu adhiccāpattiko hoti anāpattibahulo. So bhikkhūhi vuccamāno aññenaññaṁ paṭicarati, bahiddhā kathaṁ apanāmeti, kopañca dosañca appaccayañca pātukaroti, na sammā vattati, na lomaṁ pāteti, na netthāraṁ vattati, ‘yena saṅgho attamano hoti taṁ karomī’ti nāha. Tatra, bhaddāli, bhikkhūnaṁ evaṁ hoti: ‘Ayaṁ kho, āvuso, bhikkhu adhiccāpattiko anāpattibahulo. So bhikkhūhi vuccamāno aññenaññaṁ paṭicarati, bahiddhā kathaṁ apanāmeti, kopañca dosañca appaccayañca pātukaroti, na sammā vattati, na lomaṁ pāteti, na netthāraṁ vattati, \"yena saṅgho attamano hoti taṁ karomī\"ti nāha. Sādhu vatāyasmanto, imassa bhikkhuno tathā tathā upaparikkhatha yathāssidaṁ adhikaraṇaṁ na khippameva vūpasameyyā’ti. Tassa kho evaṁ, bhaddāli, bhikkhuno bhikkhū tathā tathā upaparikkhanti yathāssidaṁ adhikaraṇaṁ na khippameva vūpasammati.",
    "mn65:29": "Idha pana, bhaddāli, ekacco bhikkhu adhiccāpattiko hoti anāpattibahulo. So bhikkhūhi vuccamāno nāññenaññaṁ paṭicarati, na bahiddhā kathaṁ apanāmeti, na kopañca dosañca appaccayañca pātukaroti, sammā vattati, lomaṁ pāteti, netthāraṁ vattati, ‘yena saṅgho attamano hoti taṁ karomī’ti āha. Tatra, bhaddāli, bhikkhūnaṁ evaṁ hoti: ‘Ayaṁ kho, āvuso, bhikkhu adhiccāpattiko anāpattibahulo. So bhikkhūhi vuccamāno nāññenaññaṁ paṭicarati, na bahiddhā kathaṁ apanāmeti, na kopañca dosañca appaccayañca pātukaroti, sammā vattati, lomaṁ pāteti, netthāraṁ vattati, \"yena saṅgho attamano hoti taṁ karomī\"ti āha. Sādhu vatāyasmanto, imassa bhikkhuno tathā tathā upaparikkhatha yathāssidaṁ adhikaraṇaṁ khippameva vūpasameyyā’ti. Tassa kho evaṁ, bhaddāli, bhikkhuno bhikkhū tathā tathā upaparikkhanti yathāssidaṁ adhikaraṇaṁ khippameva vūpasammati.",
    "mn65:30": "Idha, bhaddāli, ekacco bhikkhu saddhāmattakena vahati pemamattakena. Tatra, bhaddāli, bhikkhūnaṁ evaṁ hoti: ‘Ayaṁ kho, āvuso, bhikkhu saddhāmattakena vahati pemamattakena. Sace mayaṁ imaṁ bhikkhuṁ pasayha pasayha kāraṇaṁ karissāma — mā yampissa taṁ saddhāmattakaṁ pemamattakaṁ tamhāpi parihāyī’ti. Seyyathāpi, bhaddāli, purisassa ekaṁ cakkhuṁ, tassa mittāmaccā ñātisālohitā taṁ ekaṁ cakkhuṁ rakkheyyuṁ: ‘mā yampissa taṁ ekaṁ cakkhuṁ tamhāpi parihāyī’ti; evameva kho, bhaddāli, idhekacco bhikkhu saddhāmattakena vahati pemamattakena. Tatra, bhaddāli, bhikkhūnaṁ evaṁ hoti: ‘Ayaṁ kho, āvuso, bhikkhu saddhāmattakena vahati pemamattakena. Sace mayaṁ imaṁ bhikkhuṁ pasayha pasayha kāraṇaṁ karissāma — mā yampissa taṁ saddhāmattakaṁ pemamattakaṁ tamhāpi parihāyī’ti.",
    "mn65:31": "\"Ko nu kho, bhante, hetu, ko paccayo yena pubbe appatarāni ceva sikkhāpadāni ahesuṁ bahutarā ca bhikkhū aññāya saṇṭhahiṁsu? Ko pana, bhante, hetu, ko paccayo yena etarahi bahutarāni ceva sikkhāpadāni honti appatarā ca bhikkhū aññāya saṇṭhahantī\"ti?",
    "mn65:32": "\"Evametaṁ, bhaddāli, hoti sattesu hāyamānesu, saddhamme antaradhāyamāne, bahutarāni ceva sikkhāpadāni honti appatarā ca bhikkhū aññāya saṇṭhahantīti. Na tāva, bhaddāli, satthā sāvakānaṁ sikkhāpadaṁ paññāpeti yāva na idhekacce āsavaṭṭhānīyā dhammā saṅghe pātubhavanti. Yato ca kho, bhaddāli, idhekacce āsavaṭṭhānīyā dhammā saṅghe pātubhavanti, atha satthā sāvakānaṁ sikkhāpadaṁ paññāpeti tesaṁyeva āsavaṭṭhānīyānaṁ dhammānaṁ paṭighātāya.",
    "mn65:33": "Appakā kho tumhe, bhaddāli, tena samayena ahuvattha yadā vo ahaṁ ājānīyasusūpamaṁ dhammapariyāyaṁ desesiṁ. Taṁsarasibhaddālī\"ti?",
    "mn65:34": "\"No hetaṁ, bhante\".",
    "mn65:35": "\"Tatra, bhaddāli, kaṁ hetuṁ paccesī\"ti?",
    "mn65:36": "\"So hi nūnāhaṁ, bhante, dīgharattaṁ satthusāsane sikkhāya aparipūrakārī ahosin\"ti.",
    "mn65:37": "\"Na kho, bhaddāli, eseva hetu, esa paccayo. Api ca me tvaṁ, bhaddāli, dīgharattaṁ cetasā cetoparicca vidito: ‘Na cāyaṁ moghapuriso mayā dhamme desiyamāne aṭṭhiṁ katvā manasi katvāsabbacetasosamannāharitvā ohitasoto dhammaṁ suṇātī’ti. Api ca te ahaṁ, bhaddāli, ājānīyasusūpamaṁ dhammapariyāyaṁ desessāmi. Taṁ suṇāhi, sādhukaṁ manasi karohi; bhāsissāmī\"ti.",
    "mn65:38": "\"Seyyathāpi, bhaddāli, dakkho assadamako bhadraṁ assājānīyaṁ labhitvā paṭhameneva mukhādhāne kāraṇaṁ kāreti. Tassa mukhādhāne kāraṇaṁ kāriyamānassa hontiyeva visūkāyitāni visevitāni vipphanditāni kānici kānici, yathā taṁ akāritapubbaṁ kāraṇaṁ kāriyamānassa. So abhiṇhakāraṇā anupubbakāraṇā tasmiṁ ṭhāne parinibbāyati. Yato kho, bhaddāli, bhadro assājānīyo abhiṇhakāraṇā anupubbakāraṇā tasmiṁ ṭhāne parinibbuto hoti, tamenaṁ assadamako uttari kāraṇaṁ kāreti yugādhāne. Tassa yugādhāne kāraṇaṁ kāriyamānassa hontiyeva visūkāyitāni visevitāni vipphanditāni kānici kānici, yathā taṁ akāritapubbaṁ kāraṇaṁ kāriyamānassa. So abhiṇhakāraṇā anupubbakāraṇā tasmiṁ ṭhāne parinibbāyati. Yato kho, bhaddāli, bhadro assājānīyo abhiṇhakāraṇā anupubbakāraṇā tasmiṁ ṭhāne parinibbuto hoti, tamenaṁ assadamako uttari kāraṇaṁ kāreti anukkame maṇḍalekhurakāsedhāvedavatterājaguṇe rājavaṁse uttame jave uttame haye uttame sākhalye. Tassa uttame jave uttame haye uttame sākhalye kāraṇaṁ kāriyamānassa hontiyeva visūkāyitāni visevitāni vipphanditāni kānici kānici, yathā taṁ akāritapubbaṁ kāraṇaṁ kāriyamānassa. So abhiṇhakāraṇā anupubbakāraṇā tasmiṁ ṭhāne parinibbāyati. Yato kho, bhaddāli, bhadro assājānīyo abhiṇhakāraṇā anupubbakāraṇā tasmiṁ ṭhāne parinibbuto hoti, tamenaṁ assadamako uttari vaṇṇiyañcapāṇiyañcaanuppavecchati. Imehi kho, bhaddāli, dasahaṅgehi samannāgato bhadro assājānīyo rājāraho hoti rājabhoggo rañño aṅganteva saṅkhyaṁ gacchati.",
    "mn65:39": "Evameva kho, bhaddāli, dasahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṁ puññakkhettaṁ lokassa. Katamehi dasahi? Idha, bhaddāli, bhikkhu asekhāya sammādiṭṭhiyā samannāgato hoti, asekhena sammāsaṅkappena samannāgato hoti, asekhāya sammāvācāya samannāgato hoti, asekhena sammākammantena samannāgato hoti, asekhena sammāājīvena samannāgato hoti, asekhena sammāvāyāmena samannāgato hoti, asekhāya sammāsatiyā samannāgato hoti, asekhena sammāsamādhinā samannāgato hoti, asekhena sammāñāṇena samannāgato hoti, asekhāya sammāvimuttiyā samannāgato hoti — imehi kho, bhaddāli, dasahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṁ puññakkhettaṁ lokassā\"ti.",
    "mn65:40": "Idamavoca bhagavā. Attamano āyasmā bhaddāli bhagavato bhāsitaṁ abhinandīti."
}