{
    "mn67:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā cātumāyaṁ viharati āmalakīvane.",
    "mn67:2": "Tena kho pana samayena cātumeyyakā sakyāsanthāgāresannipatitā honti kenacideva karaṇīyena. Addasaṁsu kho cātumeyyakā sakyā te bhikkhū dūratova āgacchante; disvāna yena te bhikkhū tenupasaṅkamiṁsu; upasaṅkamitvā te bhikkhū etadavocuṁ: \"handa kahaṁ pana tumhe āyasmanto gacchathā\"ti?",
    "mn67:3": "Atha kho brahmā sahampati bhagavato cetasā cetoparivitakkamaññāya — seyyathāpi nāma balavā purisosamiñjitaṁvā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evameva — brahmaloke antarahito bhagavato purato pāturahosi. Atha kho brahmā sahampati ekaṁsaṁ uttarāsaṅgaṁ karitvā yena bhagavā tenañjaliṁ paṇāmetvā bhagavantaṁ etadavoca: \"abhinandatu, bhante, bhagavā bhikkhusaṁghaṁ;",
    "mn67:4": "Asakkhiṁsu kho cātumeyyakā ca sakyā brahmā ca sahampati bhagavantaṁ pasādetuṁ bījūpamena ca taruṇūpamena ca.",
    "mn67:5": "Atha kho bhagavā bhikkhū āmantesi:",
    "mn67:6": "Katamañca, bhikkhave, ūmibhayaṁ? Idha, bhikkhave, ekacco kulaputto saddhā agārasmā anagāriyaṁ pabbajito hoti: ‘otiṇṇomhi jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi dukkhotiṇṇo dukkhapareto; appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti. Tamenaṁ tathā pabbajitaṁ samānaṁ sabrahmacārī ovadanti, anusāsanti: ‘evaṁ te abhikkamitabbaṁ, evaṁ te paṭikkamitabbaṁ, evaṁ te ālokitabbaṁ, evaṁ te vilokitabbaṁ, evaṁ te samiñjitabbaṁ, evaṁ te pasāritabbaṁ, evaṁ te saṅghāṭipattacīvaraṁ dhāretabban’ti. Tassa evaṁ hoti: ‘mayaṁ kho pubbe agāriyabhūtā samānā aññeovadāma, anusāsāma. Ime panamhākaṁ puttamattā maññe, nattamattā maññe,amheovaditabbaṁ anusāsitabbaṁ maññantī’ti. So sikkhaṁ paccakkhāya hīnāyāvattati. Ayaṁ vuccati, bhikkhave, ūmibhayassa bhīto sikkhaṁ paccakkhāya hīnāyāvatto. ‘Ūmibhayan’ti kho, bhikkhave, kodhupāyāsassetaṁ adhivacanaṁ.",
    "mn67:7": "Katamañca, bhikkhave, kumbhīlabhayaṁ? Idha, bhikkhave, ekacco kulaputto saddhā agārasmā anagāriyaṁ pabbajito hoti: ‘otiṇṇomhi jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi dukkhotiṇṇo dukkhapareto; appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti. Tamenaṁ tathā pabbajitaṁ samānaṁ sabrahmacārī ovadanti anusāsanti: ‘idaṁ te khāditabbaṁ, idaṁ te na khāditabbaṁ; idaṁ te bhuñjitabbaṁ, idaṁ te na bhuñjitabbaṁ; idaṁ te sāyitabbaṁ, idaṁ te na sāyitabbaṁ; idaṁ te pātabbaṁ, idaṁ te na pātabbaṁ; kappiyaṁ te khāditabbaṁ, akappiyaṁ te na khāditabbaṁ; kappiyaṁ te bhuñjitabbaṁ, akappiyaṁ te na bhuñjitabbaṁ; kappiyaṁ te sāyitabbaṁ, akappiyaṁ te na sāyitabbaṁ; kappiyaṁ te pātabbaṁ, akappiyaṁ te na pātabbaṁ; kāle te khāditabbaṁ, vikāle te na khāditabbaṁ; kāle te bhuñjitabbaṁ, vikāle te na bhuñjitabbaṁ; kāle te sāyitabbaṁ, vikāle te na sāyitabbaṁ; kāle te pātabbaṁ, vikāle te na pātabban’ti.",
    "mn67:8": "Katamañca, bhikkhave, āvaṭṭabhayaṁ? Idha, bhikkhave, ekacco kulaputto saddhā agārasmā anagāriyaṁ pabbajito hoti: ‘otiṇṇomhi jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi dukkhotiṇṇo dukkhapareto; appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti. So evaṁ pabbajito samāno pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya gāmaṁ vā nigamaṁ vā piṇḍāya pavisati. Arakkhiteneva kāyena arakkhitāya vācāya anupaṭṭhitāya satiyā asaṁvutehi indriyehi so tattha passati gahapatiṁ vā gahapatiputtaṁ vā pañcahi kāmaguṇehi samappitaṁ samaṅgībhūtaṁparicārayamānaṁ. Tassa evaṁ hoti: ‘mayaṁ kho pubbe agāriyabhūtā samānā pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārimhā.Saṁvijjanti kho pana me kulebhogā. Sakkā bhoge ca bhuñjituṁ puññāni ca kātun’ti. So sikkhaṁ paccakkhāya hīnāyāvattati. Ayaṁ vuccati, bhikkhave, āvaṭṭabhayassa bhīto sikkhaṁ paccakkhāya hīnāyāvatto. ‘Āvaṭṭabhayan’ti kho, bhikkhave, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ.",
    "mn67:9": "Katamañca, bhikkhave, susukābhayaṁ? Idha, bhikkhave, ekacco kulaputto saddhā agārasmā anagāriyaṁ pabbajito hoti: ‘otiṇṇomhi jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi dukkhotiṇṇo dukkhapareto; appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti. So evaṁ pabbajito samāno pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya gāmaṁ vā nigamaṁ vā piṇḍāya pavisati. Arakkhiteneva kāyena arakkhitāya vācāya anupaṭṭhitāya satiyā asaṁvutehi indriyehi so tattha passati mātugāmaṁ dunnivatthaṁ vā duppārutaṁ vā. Tassa mātugāmaṁ disvā dunnivatthaṁ vā duppārutaṁ vā rāgo cittaṁ anuddhaṁseti. Sorāgānuddhaṁsenacittena sikkhaṁ paccakkhāya hīnāyāvattati. Ayaṁ vuccati, bhikkhave, susukābhayassa bhīto sikkhaṁ paccakkhāya hīnāyāvatto. ‘Susukābhayan’ti kho, bhikkhave, mātugāmassetaṁ adhivacanaṁ.",
    "mn67:10": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}