{
    "mn73:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā rājagahe viharati veḷuvane kalandakanivāpe.",
    "mn73:2": "\"Lobho kho, vaccha, akusalaṁ, alobho kusalaṁ; doso kho, vaccha, akusalaṁ, adoso kusalaṁ; moho kho, vaccha, akusalaṁ, amoho kusalaṁ. Iti kho, vaccha, ime tayo dhammā akusalā, tayo dhammā kusalā.",
    "mn73:3": "Pāṇātipāto kho, vaccha, akusalaṁ, pāṇātipātā veramaṇī kusalaṁ; adinnādānaṁ kho, vaccha, akusalaṁ, adinnādānā veramaṇī kusalaṁ; kāmesumicchācāro kho, vaccha, akusalaṁ, kāmesumicchācārā veramaṇī kusalaṁ; musāvādo kho, vaccha, akusalaṁ, musāvādā veramaṇī kusalaṁ; pisuṇā vācā kho, vaccha, akusalaṁ, pisuṇāya vācāya veramaṇī kusalaṁ; pharusā vācā kho, vaccha, akusalaṁ, pharusāya vācāya veramaṇī kusalaṁ; samphappalāpo kho, vaccha, akusalaṁ, samphappalāpā veramaṇī kusalaṁ; abhijjhā kho, vaccha, akusalaṁ, anabhijjhā kusalaṁ; byāpādo kho, vaccha, akusalaṁ, abyāpādo kusalaṁ; micchādiṭṭhi kho, vaccha, akusalaṁ sammādiṭṭhi kusalaṁ. Iti kho, vaccha, ime dasa dhammā akusalā, dasa dhammā kusalā.",
    "mn73:4": "Yato kho, vaccha, bhikkhuno taṇhā pahīnā hoti ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anuppādadhammā, so hoti bhikkhu arahaṁ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṁyojano sammadaññāvimutto\"ti.",
    "mn73:5": "\"Tiṭṭhatu bhavaṁ gotamo. Atthi pana te bhoto gotamassa ekabhikkhupisāvako yo āsavānaṁ khayāanāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharatī\"ti?",
    "mn73:6": "\"Tiṭṭhatu bhavaṁ gotamo, tiṭṭhantu bhikkhū. Atthi pana bhoto gotamassa ekā bhikkhunīpi sāvikā yā āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharatī\"ti?",
    "mn73:7": "\"Tiṭṭhatu bhavaṁ gotamo, tiṭṭhantu bhikkhū, tiṭṭhantu bhikkhuniyo. Atthi pana bhoto gotamassa ekupāsakopi sāvako gihī odātavasano brahmacārī yo pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko tattha parinibbāyī anāvattidhammo tasmā lokā\"ti?",
    "mn73:8": "\"Tiṭṭhatu bhavaṁ gotamo, tiṭṭhantu bhikkhū, tiṭṭhantu bhikkhuniyo, tiṭṭhantu upāsakā gihī odātavasanā brahmacārino. Atthi pana bhoto gotamassa ekupāsakopi sāvako gihī odātavasano kāmabhogī sāsanakaro ovādappaṭikaro yo tiṇṇavicikiccho vigatakathaṅkatho vesārajjappatto aparappaccayo satthusāsane viharatī\"ti?",
    "mn73:9": "\"Tiṭṭhatu bhavaṁ gotamo, tiṭṭhantu bhikkhū, tiṭṭhantu bhikkhuniyo, tiṭṭhantu upāsakā gihī odātavasanā brahmacārino, tiṭṭhantu upāsakā gihī odātavasanā kāmabhogino. Atthi pana bhoto gotamassa ekupāsikāpi sāvikā gihinī odātavasanā brahmacārinī yā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātikā tattha parinibbāyinī anāvattidhammā tasmā lokā\"ti?",
    "mn73:10": "\"Tiṭṭhatu bhavaṁ gotamo, tiṭṭhantu bhikkhū, tiṭṭhantu bhikkhuniyo, tiṭṭhantu upāsakā gihī odātavasanā brahmacārino, tiṭṭhantu upāsakā gihī odātavasanā kāmabhogino, tiṭṭhantu upāsikā gihiniyo odātavasanā brahmacāriniyo. Atthi pana bhoto gotamassa ekupāsikāpi sāvikā gihinī odātavasanā kāmabhoginī sāsanakarā ovādappaṭikarā yā tiṇṇavicikicchā vigatakathaṅkathā vesārajjappattā aparappaccayā satthusāsane viharatī\"ti?",
    "mn73:11": "\"Sace hi, bho gotama, imaṁ dhammaṁ bhavaṁyeva gotamo ārādhako abhavissa, no ca kho bhikkhū ārādhakā abhavissaṁsu; evamidaṁ brahmacariyaṁ aparipūraṁ abhavissa tenaṅgena. Yasmā ca kho, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako bhikkhū ca ārādhakā; evamidaṁ brahmacariyaṁ paripūraṁ tenaṅgena.",
    "mn73:12": "Sace hi, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako abhavissa, bhikkhū ca ārādhakā abhavissaṁsu, no ca kho bhikkhuniyo ārādhikā abhavissaṁsu; evamidaṁ brahmacariyaṁ aparipūraṁ abhavissa tenaṅgena. Yasmā ca kho, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako, bhikkhū ca ārādhakā, bhikkhuniyo ca ārādhikā; evamidaṁ brahmacariyaṁ paripūraṁ tenaṅgena.",
    "mn73:13": "Sace hi, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako abhavissa, bhikkhū ca ārādhakā abhavissaṁsu, bhikkhuniyo ca ārādhikā abhavissaṁsu, no ca kho upāsakā gihī odātavasanā brahmacārino ārādhakā abhavissaṁsu; evamidaṁ brahmacariyaṁ aparipūraṁ abhavissa tenaṅgena. Yasmā ca kho, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako, bhikkhū ca ārādhakā, bhikkhuniyo ca ārādhikā, upāsakā ca gihī odātavasanā brahmacārino ārādhakā; evamidaṁ brahmacariyaṁ paripūraṁ tenaṅgena.",
    "mn73:14": "Sace hi, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako abhavissa, bhikkhū ca ārādhakā abhavissaṁsu, bhikkhuniyo ca ārādhikā abhavissaṁsu, upāsakā ca gihī odātavasanā brahmacārino ārādhakā abhavissaṁsu, no ca kho upāsakā gihī odātavasanā kāmabhogino ārādhakā abhavissaṁsu; evamidaṁ brahmacariyaṁ aparipūraṁ abhavissa tenaṅgena. Yasmā ca kho, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako, bhikkhū ca ārādhakā, bhikkhuniyo ca ārādhikā, upāsakā ca gihī odātavasanā brahmacārino ārādhakā, upāsakā ca gihī odātavasanā kāmabhogino ārādhakā; evamidaṁ brahmacariyaṁ paripūraṁ tenaṅgena.",
    "mn73:15": "Sace hi, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako abhavissa, bhikkhū ca ārādhakā abhavissaṁsu, bhikkhuniyo ca ārādhikā abhavissaṁsu, upāsakā ca gihī odātavasanā brahmacārino ārādhakā abhavissaṁsu, upāsakā ca gihī odātavasanā kāmabhogino ārādhakā abhavissaṁsu, no ca kho upāsikā gihiniyo odātavasanā brahmacāriniyo ārādhikā abhavissaṁsu; evamidaṁ brahmacariyaṁ aparipūraṁ abhavissa tenaṅgena. Yasmā ca kho, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako, bhikkhū ca ārādhakā, bhikkhuniyo ca ārādhikā, upāsakā ca gihī odātavasanā brahmacārino ārādhakā, upāsakā ca gihī odātavasanā kāmabhogino ārādhakā, upāsikā ca gihiniyo odātavasanā brahmacāriniyo ārādhikā; evamidaṁ brahmacariyaṁ paripūraṁ tenaṅgena.",
    "mn73:16": "Sace hi, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako abhavissa, bhikkhū ca ārādhakā abhavissaṁsu, bhikkhuniyo ca ārādhikā abhavissaṁsu, upāsakā ca gihī odātavasanā brahmacārino ārādhakā abhavissaṁsu, upāsakā ca gihī odātavasanā kāmabhogino ārādhakā abhavissaṁsu, upāsikā ca gihiniyo odātavasanā brahmacāriniyo ārādhikā abhavissaṁsu, no ca kho upāsikā gihiniyo odātavasanā kāmabhoginiyo ārādhikā abhavissaṁsu; evamidaṁ brahmacariyaṁ aparipūraṁ abhavissa tenaṅgena. Yasmā ca kho, bho gotama, imaṁ dhammaṁ bhavañceva gotamo ārādhako, bhikkhū ca ārādhakā, bhikkhuniyo ca ārādhikā, upāsakā ca gihī odātavasanā brahmacārino ārādhakā, upāsakā ca gihī odātavasanā kāmabhogino ārādhakā, upāsikā ca gihiniyo odātavasanā brahmacāriniyo ārādhikā, upāsikā ca gihiniyo odātavasanā kāmabhoginiyo ārādhikā; evamidaṁ brahmacariyaṁ paripūraṁ tenaṅgena.",
    "mn73:17": "Seyyathāpi, bho gotama, gaṅgā nadī samuddaninnā samuddapoṇā samuddapabbhārā samuddaṁ āhacca tiṭṭhati, evamevāyaṁ bhoto gotamassa parisā sagahaṭṭhapabbajitā nibbānaninnā nibbānapoṇā nibbānapabbhārā nibbānaṁ āhacca tiṭṭhati.",
    "mn73:18": "Acirūpasampanno kho panāyasmā vacchagotto addhamāsūpasampanno yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā vacchagotto bhagavantaṁ etadavoca: \"yāvatakaṁ, bhante, sekhena ñāṇena sekhāya vijjāya pattabbaṁ, anuppattaṁ taṁ mayā;uttari ca mebhagavā dhammaṁ desetū\"ti.",
    "mn73:19": "\"Tena hi tvaṁ, vaccha, dve dhamme uttari bhāvehi — samathañca vipassanañca. Ime kho te, vaccha, dve dhammā uttari bhāvitā — samatho ca vipassanā ca –  anekadhātupaṭivedhāya saṁvattissanti.",
    "mn73:20": "So tvaṁ, vaccha,yāvadevaākaṅkhīssasi: ‘anekavihitaṁ iddhividhaṁ paccanubhaveyyaṁ — ekopi hutvā bahudhā assaṁ, bahudhāpi hutvā eko assaṁ; āvibhāvaṁ, tirobhāvaṁ; tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gaccheyyaṁ, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ kareyyaṁ, seyyathāpi udake; udakepi abhijjamāne gaccheyyaṁ, seyyathāpi pathaviyaṁ; ākāsepi pallaṅkena kameyyaṁ, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parimaseyyaṁ, parimajjeyyaṁ; yāva brahmalokāpi kāyena vasaṁ vatteyyan’ti, tatra tatreva sakkhibhabbataṁ pāpuṇissasi, sati satiāyatane.(1)",
    "mn73:21": "So tvaṁ, vaccha, yāvadeva ākaṅkhīssasi: ‘dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇeyyaṁ — dibbe ca mānuse ca, ye dūre santike cā’ti, tatra tatreva sakkhibhabbataṁ pāpuṇissasi, sati satiāyatane.(2)",
    "mn73:22": "So tvaṁ, vaccha, yāvadeva ākaṅkhīssasi: ‘parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajāneyyaṁ — sarāgaṁ vā cittaṁ sarāgaṁ cittanti pajāneyyaṁ, vītarāgaṁ vā cittaṁ vītarāgaṁ cittanti pajāneyyaṁ; sadosaṁ vā cittaṁ sadosaṁ cittanti pajāneyyaṁ, vītadosaṁ vā cittaṁ vītadosaṁ cittanti pajāneyyaṁ; samohaṁ vā cittaṁ samohaṁ cittanti pajāneyyaṁ, vītamohaṁ vā cittaṁ vītamohaṁ cittanti pajāneyyaṁ; saṅkhittaṁ vā cittaṁ saṅkhittaṁ cittanti pajāneyyaṁ, vikkhittaṁ vā cittaṁ vikkhittaṁ cittanti pajāneyyaṁ; mahaggataṁ vā cittaṁ mahaggataṁ cittanti pajāneyyaṁ, amahaggataṁ vā cittaṁ amahaggataṁ cittanti pajāneyyaṁ; sauttaraṁ vā cittaṁ sauttaraṁ cittanti pajāneyyaṁ, anuttaraṁ vā cittaṁ anuttaraṁ cittanti pajāneyyaṁ; samāhitaṁ vā cittaṁ samāhitaṁ cittanti pajāneyyaṁ, asamāhitaṁ vā cittaṁ asamāhitaṁ cittanti pajāneyyaṁ; vimuttaṁ vā cittaṁ vimuttaṁ cittanti pajāneyyaṁ, avimuttaṁ vā cittaṁ avimuttaṁ cittanti pajāneyyan’ti, tatra tatreva sakkhibhabbataṁ pāpuṇissasi, sati satiāyatane.(3)",
    "mn73:23": "So tvaṁ, vaccha, yāvadeva ākaṅkhīssasi: ‘anekavihitaṁ pubbenivāsaṁ anussareyyaṁ, seyyathidaṁ — ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi; anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe — amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapannoti; iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussareyyan’ti, tatra tatreva sakkhibhabbataṁ pāpuṇissasi, sati satiāyatane.(4)",
    "mn73:24": "So tvaṁ, vaccha, yāvadeva ākaṅkhīssasi: ‘dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṁ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajāneyyaṁ — ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannāti; iti dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṁ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajāneyyan’ti, tatra tatreva sakkhibhabbataṁ pāpuṇissasi, sati satiāyatane.(5)",
    "mn73:25": "So tvaṁ, vaccha, yāvadeva ākaṅkhīssasi: ‘āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihareyyan’ti, tatra tatreva sakkhibhabbataṁ pāpuṇissasi, sati satiāyatane\"ti.(6)",
    "mn73:26": "Atha kho āyasmā vacchagotto bhagavato bhāsitaṁ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā pakkāmi.",
    "mn73:27": "Tena kho pana samayena sambahulā bhikkhū bhagavantaṁ dassanāya gacchanti. Addasā kho āyasmā vacchagotto te bhikkhū dūratova āgacchante. Disvāna yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca: \"handa kahaṁ pana tumhe āyasmanto gacchathā\"ti? \"Bhagavantaṁ kho mayaṁ, āvuso, dassanāya gacchāmā\"ti.",
    "mn73:28": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}