{
    "mn74:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā rājagahe viharati gijjhakūṭe pabbate sūkarakhatāyaṁ.",
    "mn74:2": "Evaṁ vutte, dīghanakho paribbājako bhagavantaṁ etadavoca: \"ukkaṁsetime bhavaṁ gotamo diṭṭhigataṁ,samukkaṁsetime bhavaṁ gotamo diṭṭhigatan\"ti.",
    "mn74:3": "\"Tatraggivessana, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘ekaccaṁ me khamati, ekaccaṁ me nakkhamatī’ti. Yā hi tesaṁ khamati sāyaṁ diṭṭhi sārāgāya santike, saññogāya santike, abhinandanāya santike, ajjhosānāya santike, upādānāya santike; yā hi tesaṁ nakkhamati sāyaṁ diṭṭhi asārāgāya santike, asaññogāya santike, anabhinandanāya santike, anajjhosānāya santike, anupādānāya santike.",
    "mn74:4": "Tatraggivessana, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘sabbaṁ me nakkhamatī’ti tattha viññū puriso iti paṭisañcikkhati: ‘yā kho me ayaṁ diṭṭhi –  sabbaṁ me nakkhamatīti, imañce ahaṁ diṭṭhiṁ thāmasā parāmāsā abhinivissa vohareyyaṁ — idameva saccaṁ moghamaññanti; dvīhi me assa viggaho — yo cāyaṁ samaṇo vā brāhmaṇo vā evaṁvādī evaṁdiṭṭhi — sabbaṁ me khamatīti, yo cāyaṁ samaṇo vā brāhmaṇo vā evaṁvādī evaṁdiṭṭhi — ekaccaṁ me khamati ekaccaṁ me nakkhamatīti — imehiD assa dvīhi viggaho. Iti viggahe sati vivādo, vivāde sati vighāto, vighāte sati vihesā’. Iti so viggahañca vivādañca vighātañca vihesañca attani sampassamāno tañceva diṭṭhiṁ pajahati aññañca diṭṭhiṁ na upādiyati. Evametāsaṁ diṭṭhīnaṁ pahānaṁ hoti, evametāsaṁ diṭṭhīnaṁ paṭinissaggo hoti.",
    "mn74:5": "Tatraggivessana, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘ekaccaṁ me khamati, ekaccaṁ me nakkhamatī’ti tattha viññū puriso iti paṭisañcikkhati: ‘yā kho me ayaṁ diṭṭhi — ekaccaṁ me khamati, ekaccaṁ me nakkhamatīti, imañce ahaṁ diṭṭhiṁ thāmasā parāmāsā abhinivissa vohareyyaṁ — idameva saccaṁ moghamaññanti; dvīhi me assa viggaho — yo cāyaṁ samaṇo vā brāhmaṇo vā evaṁvādī evaṁdiṭṭhi –  sabbaṁ me khamatīti, yo cāyaṁ samaṇo vā brāhmaṇo vā evaṁvādī evaṁdiṭṭhi –  sabbaṁ me nakkhamatīti — imehi assa dvīhi viggaho. Iti viggahe sati vivādo, vivāde sati vighāto, vighāte sati vihesā’. Iti so viggahañca vivādañca vighātañca vihesañca attani sampassamāno tañceva diṭṭhiṁ pajahati aññañca diṭṭhiṁ na upādiyati. Evametāsaṁ diṭṭhīnaṁ pahānaṁ hoti, evametāsaṁ diṭṭhīnaṁ paṭinissaggo hoti.",
    "mn74:6": "Ayaṁ kho panaggivessana, kāyo rūpīcātumahābhūtikomātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṁsanadhammo, aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassitabbo. Tassimaṁ kāyaṁ aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassato yo kāyasmiṁ kāyachando kāyasneho kāyanvayatā sā pahīyati.",
    "mn74:7": "Tisso kho imā, aggivessana, vedanāD — sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Yasmiṁ, aggivessana, samaye sukhaṁ vedanaṁ vedeti, neva tasmiṁ samaye dukkhaṁ vedanaṁ vedeti, na adukkhamasukhaṁ vedanaṁ vedeti; sukhaṁyeva tasmiṁ samaye vedanaṁ vedeti. Yasmiṁ, aggivessana, samaye dukkhaṁ vedanaṁ vedeti, neva tasmiṁ samaye sukhaṁ vedanaṁ vedeti, na adukkhamasukhaṁ vedanaṁ vedeti; dukkhaṁyeva tasmiṁ samaye vedanaṁ vedeti. Yasmiṁ, aggivessana, samaye adukkhamasukhaṁ vedanaṁ vedeti, neva tasmiṁ samaye sukhaṁ vedanaṁ vedeti, na dukkhaṁ vedanaṁ vedeti; adukkhamasukhaṁyeva tasmiṁ samaye vedanaṁ vedeti.",
    "mn74:8": "Tena kho pana samayena āyasmā sāriputto bhagavato piṭṭhito ṭhito hoti bhagavantaṁbījayamāno. Atha kho āyasmato sāriputtassa etadahosi: \"tesaṁ tesaṁ kira no bhagavā dhammānaṁ abhiññā pahānamāha, Dtesaṁ tesaṁ kira no sugato dhammānaṁ abhiññā paṭinissaggamāhā\"ti. Iti hidaṁ āyasmato sāriputtassa paṭisañcikkhato anupādāya āsavehi cittaṁ vimucci."
}