{
    "mn80:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn80:2": "\"Kiṁ pana tvaṁ, kaccāna, evaṁ vadesi: ‘Ayaṁ paramo vaṇṇo, ayaṁ paramo vaṇṇo’ti? Katamo, kaccāna, so paramo vaṇṇo\"ti?",
    "mn80:3": "\"Yasmā, bho gotama, vaṇṇā añño vaṇṇo uttaritaro vā paṇītataro vā natthi so paramo vaṇṇo\"ti.",
    "mn80:4": "\"Katamo pana so, kaccāna, vaṇṇo yasmā vaṇṇā añño vaṇṇo uttaritaro vā paṇītataro vā natthī\"ti?",
    "mn80:5": "\"Yasmā, bho gotama, vaṇṇā añño vaṇṇo uttaritaro vā paṇītataro vā natthi so paramo vaṇṇo\"ti.",
    "mn80:6": "\"Dīghāpi kho te esā, kaccāna, phareyya: ‘yasmā, bho gotama, vaṇṇā añño vaṇṇo uttaritaro vā paṇītataro vā natthi so paramo vaṇṇo’ti vadesi, tañca vaṇṇaṁ na paññapesi. Seyyathāpi, kaccāna, puriso evaṁ vadeyya: ‘Ahaṁ yā imasmiṁ janapade janapadakalyāṇī, taṁ icchāmi taṁ kāmemī’ti. Tamenaṁ evaṁ vadeyyuṁ: ‘ambho purisa, yaṁ tvaṁ janapadakalyāṇiṁ icchasi kāmesi, jānāsi taṁ janapadakalyāṇiṁ –  khattiyī vā brāhmaṇī vā vessī vā suddī vā’ti? Iti puṭṭho ‘no’ti vadeyya. Tamenaṁ evaṁ vadeyyuṁ: ‘ambho purisa, yaṁ tvaṁ janapadakalyāṇiṁ icchasi kāmesi, jānāsi taṁ janapadakalyāṇiṁ evaṁnāmā evaṅgottāti vāti … pe … dīghā vā rassā vā majjhimā vā kāḷī vā sāmā vā maṅguracchavī vāti … amukasmiṁ gāme vā nigame vā nagare vā’ti? Iti puṭṭho ‘no’ti vadeyya. Tamenaṁ evaṁ vadeyyuṁ: ‘ambho purisa, yaṁ tvaṁ na jānāsi na passasi, taṁ tvaṁ icchasi kāmesī’ti? Iti puṭṭho ‘āmā’ti vadeyya.",
    "mn80:7": "Taṁ kiṁ maññasi, kaccāna, nanu evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti?",
    "mn80:8": "\"Taṁ kiṁ maññasi, kaccāna, yo vā maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato paṇḍukambale nikkhitto bhāsate ca tapate ca virocati ca, yo vā rattandhakāratimisāya kimi khajjopanako imesaṁ ubhinnaṁ vaṇṇānaṁ katamo vaṇṇo abhikkantataro ca paṇītataro cā\"ti? \"Yvāyaṁ, bho gotama, rattandhakāratimisāya kimi khajjopanako, ayaṁ imesaṁ ubhinnaṁ vaṇṇānaṁ abhikkantataro ca paṇītataro cā\"ti.",
    "mn80:9": "\"Taṁ kiṁ maññasi, kaccāna, yo vā rattandhakāratimisāya kimi khajjopanako, yo vā rattandhakāratimisāya telappadīpo, imesaṁ ubhinnaṁ vaṇṇānaṁ katamo vaṇṇo abhikkantataro ca paṇītataro cā\"ti? \"Yvāyaṁ, bho gotama, rattandhakāratimisāya telappadīpo, ayaṁ imesaṁ ubhinnaṁ vaṇṇānaṁ abhikkantataro ca paṇītataro cā\"ti.",
    "mn80:10": "\"Taṁ kiṁ maññasi, kaccāna, yo vā rattandhakāratimisāya telappadīpo, yo vā rattandhakāratimisāya mahāaggikkhandho, imesaṁ ubhinnaṁ vaṇṇānaṁ katamo vaṇṇo abhikkantataro ca paṇītataro cā\"ti? \"Yvāyaṁ, bho gotama, rattandhakāratimisāya mahāaggikkhandho, ayaṁ imesaṁ ubhinnaṁ vaṇṇānaṁ abhikkantataro ca paṇītataro cā\"ti.",
    "mn80:11": "\"Taṁ kiṁ maññasi, kaccāna, yo vā rattandhakāratimisāya mahāaggikkhandho, yā vā rattiyā paccūsasamayaṁ viddhe vigatavalāhake deve osadhitārakā, imesaṁ ubhinnaṁ vaṇṇānaṁ katamo vaṇṇo abhikkantataro ca paṇītataro cā\"ti? \"Yvāyaṁ, bho gotama, rattiyā paccūsasamayaṁ viddhe vigatavalāhake deve osadhitārakā, ayaṁ imesaṁ ubhinnaṁ vaṇṇānaṁ abhikkantataro ca paṇītataro cā\"ti.",
    "mn80:12": "\"Taṁ kiṁ maññasi, kaccāna, yā vā rattiyā paccūsasamayaṁ viddhe vigatavalāhake deve osadhitārakā, yo vā tadahuposathe pannarase viddhe vigatavalāhake deve abhido aḍḍharattasamayaṁ cando, imesaṁ ubhinnaṁ vaṇṇānaṁ katamo vaṇṇo abhikkantataro ca paṇītataro cā\"ti? \"Yvāyaṁ, bho gotama, tadahuposathe pannarase viddhe vigatavalāhake deve abhido aḍḍharattasamayaṁ cando, ayaṁ imesaṁ ubhinnaṁ vaṇṇānaṁ abhikkantataro ca paṇītataro cā\"ti.",
    "mn80:13": "\"Taṁ kiṁ maññasi, kaccāna, yo vā tadahuposathe pannarase viddhe vigatavalāhake deve abhido aḍḍharattasamayaṁ cando, yo vā vassānaṁ pacchime māse saradasamaye viddhe vigatavalāhake deve abhido majjhanhikasamayaṁ sūriyo, imesaṁ ubhinnaṁ vaṇṇānaṁ katamo vaṇṇo abhikkantataro ca paṇītataro cā\"ti? \"Yvāyaṁ, bho gotama, vassānaṁ pacchime māse saradasamaye viddhe vigatavalāhake deve abhido majjhanhikasamayaṁ sūriyo — ayaṁ imesaṁ ubhinnaṁ vaṇṇānaṁ abhikkantataro ca paṇītataro cā\"ti.",
    "mn80:14": "\"Ato kho te, kaccāna, bahū hi bahutarā devā ye imesaṁ candimasūriyānaṁ ābhā nānubhonti, tyāhaṁ pajānāmi. Atha ca panāhaṁ na vadāmi: ‘yasmā vaṇṇā añño vaṇṇo uttaritaro ca paṇītataro ca natthī’ti. Atha ca pana tvaṁ, kaccāna, ‘yvāyaṁ vaṇṇo kiminā khajjopanakena nihīnataro ca patikiṭṭhataro ca so paramo vaṇṇo’ti vadesi; tañca vaṇṇaṁ na paññapesi.",
    "mn80:15": "Pañca kho ime, kaccāna, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā, sotaviññeyyā saddā … pe … ghānaviññeyyā gandhā … jivhāviññeyyā rasā … kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā — ime kho, kaccāna, pañca kāmaguṇā.",
    "mn80:16": "Evaṁ vutte, vekhanaso paribbājako bhagavantaṁ etadavoca: \"acchariyaṁ, bho gotama, abbhutaṁ, bho gotama. Yāva subhāsitañcidaṁ bhotā gotamena: ‘kāmehi kāmasukhaṁ, kāmasukhā kāmaggasukhaṁ tattha aggamakkhāyatī’ti. ‘Kāmehi, bho gotama, kāmasukhaṁ, kāmasukhā kāmaggasukhaṁ, tattha aggamakkhāyatī’\"ti",
    "mn80:17": "Evaṁ vutte, vekhanaso paribbājako kupito anattamano bhagavantaṁyeva khuṁsento bhagavantaṁyeva vambhento bhagavantaṁyeva vadamāno: \"samaṇogotamo pāpito bhavissatī\"ti bhagavantaṁ etadavoca: \"evamevapanidhekaccesamaṇabrāhmaṇā ajānantā pubbantaṁ, apassantā aparantaṁ atha ca pana ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁitthattāyāti — pajānāmā’ti –  paṭijānanti. Tesamidaṁ bhāsitaṁ hassakaṁyeva sampajjati, nāmakaṁyeva sampajjati, rittakaṁyeva sampajjati, tucchakaṁyeva sampajjatī\"ti.",
    "mn80:18": "Evaṁ vutte, vekhanaso paribbājako bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti.",
    "mn80:19": "Puṇḍarī aggisaha kathināmo,Dīghanakho puna bhāradvājagotto;Sandakaudāyimuṇḍikaputto,Maṇiko tathākaccāno varavaggo."
}