{
    "mn81:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā kosalesu cārikaṁ carati mahatā bhikkhusaṁghena saddhiṁ. Atha kho bhagavā maggā okkamma aññatarasmiṁ padese sitaṁ pātvākāsi.",
    "mn81:2": "\"Bhūtapubbaṁ, ānanda, imasmiṁ padese vegaḷiṅgaṁ nāma gāmanigamo ahosi iddho ceva phīto ca bahujano ākiṇṇamanusso. Vegaḷiṅgaṁ kho, ānanda, gāmanigamaṁ kassapo bhagavā arahaṁ sammāsambuddho upanissāya vihāsi. Idha sudaṁ, ānanda, kassapassa bhagavato arahato sammāsambuddhassa ārāmo ahosi. Idha sudaṁ, ānanda, kassapo bhagavā arahaṁ sammāsambuddho nisinnako bhikkhusaṅghaṁ ovadati.",
    "mn81:3": "Vegaḷiṅge kho, ānanda, gāmanigameghaṭikāronāma kumbhakāro kassapassa bhagavato arahato sammāsambuddhassa upaṭṭhāko ahosi aggupaṭṭhāko. Ghaṭikārassa kho, ānanda, kumbhakārassa jotipālo nāma māṇavo sahāyo ahosi piyasahāyo.",
    "mn81:4": "Atha kho, ānanda, ghaṭikāro kumbhakāro jotipālaṁ māṇavaṁ āmantesi: ‘ayaṁ, samma jotipāla, kassapassa bhagavato arahato sammāsambuddhassa avidūre ārāmo.Āyāma, samma jotipāla, kassapaṁ bhagavantaṁ arahantaṁ sammāsambuddhaṁ dassanāya upasaṅkamissāma. Sādhusammatañhi me tassa bhagavato dassanaṁ arahato sammāsambuddhassā’ti. Evaṁ vutte, ānanda, jotipālo māṇavo ghaṭikāraṁ kumbhakāraṁ etadavoca: ‘alaṁ, samma ghaṭikāra. Kiṁ pana tena muṇḍakena samaṇakena diṭṭhenā’ti?",
    "mn81:5": "Atha kho, ānanda, ghaṭikāro ca kumbhakāro jotipālo ca māṇavo yena kassapo bhagavā arahaṁ sammāsambuddho tenupasaṅkamiṁsu; upasaṅkamitvā ghaṭikāro kumbhakāro kassapaṁ bhagavantaṁ arahantaṁ sammāsambuddhaṁ abhivādetvā ekamantaṁ nisīdi. Jotipālo pana māṇavo kassapena bhagavatā arahatā sammāsambuddhena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho, ānanda, ghaṭikāro kumbhakāro kassapaṁ bhagavantaṁ arahantaṁ sammāsambuddhaṁ etadavoca: ‘Ayaṁ me, bhante, jotipālo māṇavo sahāyo piyasahāyo. Imassa bhagavā dhammaṁ desetū’ti.",
    "mn81:6": "Atha kho, ānanda, jotipālo māṇavo ghaṭikāraṁ kumbhakāraṁ etadavoca: ‘imaṁ nu tvaṁ, samma ghaṭikāra, dhammaṁ suṇanto atha ca pana agārasmā anagāriyaṁ na pabbajissasī’ti? ‘Nanu maṁ, samma jotipāla, jānāsi, andhe jiṇṇe mātāpitaro posemī’ti? ‘Tena hi, samma ghaṭikāra, ahaṁ agārasmā anagāriyaṁ pabbajissāmī’ti.",
    "mn81:7": "Atha kho, ānanda, kassapo bhagavā arahaṁ sammāsambuddho acirūpasampanne jotipāle māṇave aḍḍhamāsupasampanne vegaḷiṅge yathābhirantaṁ viharitvā yena bārāṇasī tena cārikaṁ pakkāmi. Anupubbena cārikaṁ caramāno yena bārāṇasī tadavasari. Tatra sudaṁ, ānanda, kassapo bhagavā arahaṁ sammāsambuddho bārāṇasiyaṁ viharati isipatane migadāye. Assosi kho, ānanda, kikī kāsirājā: ‘kassapo kira bhagavā arahaṁ sammāsambuddho bārāṇasiṁ anuppatto bārāṇasiyaṁ viharati isipatane migadāye’ti.",
    "mn81:8": "Atha kho, ānanda, kassapo bhagavā arahaṁ sammāsambuddho pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena kikissa kāsirañño nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi saddhiṁ bhikkhusaṅghena. Atha kho, ānanda, kikī kāsirājā buddhappamukhaṁ bhikkhusaṅghaṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho, ānanda, kikī kāsirājā kassapaṁ bhagavantaṁ arahantaṁ sammāsambuddhaṁ bhuttāviṁ onītapattapāṇiṁ aññataraṁ nīcaṁ āsanaṁ gahetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho, ānanda, kikī kāsirājā kassapaṁ bhagavantaṁ arahantaṁ sammāsambuddhaṁ etadavoca: ‘adhivāsetu me, bhante, bhagavā bārāṇasiyaṁ vassāvāsaṁ; evarūpaṁ saṅghassa upaṭṭhānaṁ bhavissatī’ti. ‘Alaṁ, mahārāja. Adhivuttho me vassāvāso’ti.",
    "mn81:9": "‘Atthi, mahārāja, vegaḷiṅgaṁ nāma gāmanigamo. Tattha ghaṭikāro nāma kumbhakāro; so me upaṭṭhāko aggupaṭṭhāko. Tuyhaṁ kho pana, mahārāja, na me kassapo bhagavā arahaṁ sammāsambuddho adhivāseti bārāṇasiyaṁ vassāvāsantiatthevaaññathattaṁ, atthi domanassaṁ. Tayidaṁghaṭikārassa kumbhakārassanatthi ca na ca bhavissati. Ghaṭikāro kho, mahārāja, kumbhakāro buddhaṁ saraṇaṁ gato, dhammaṁ saraṇaṁ gato, saṁghaṁ saraṇaṁ gato. Ghaṭikāro kho, mahārāja, kumbhakāro pāṇātipātā paṭivirato, adinnādānā paṭivirato, kāmesumicchācārā paṭivirato, musāvādā paṭivirato, surāmerayamajjapamādaṭṭhānā paṭivirato. Ghaṭikāro kho, mahārāja, kumbhakāro buddhe aveccappasādena samannāgato, dhamme aveccappasādena samannāgato, saṁghe aveccappasādena samannāgato, ariyakantehi sīlehi samannāgato. Ghaṭikāro kho, mahārāja, kumbhakāro dukkhe nikkaṅkho, dukkhasamudaye nikkaṅkho, dukkhanirodhe nikkaṅkho, dukkhanirodhagāminiyā paṭipadāya nikkaṅkho. Ghaṭikāro kho, mahārāja, kumbhakāro ekabhattiko brahmacārī sīlavā kalyāṇadhammo. Ghaṭikāro kho, mahārāja, kumbhakāro nikkhittamaṇisuvaṇṇo apetajātarūparajato. Ghaṭikāro kho, mahārāja,kumbhakāro pannamusalo na sahatthā pathaviṁ khaṇati. Yaṁ hoti kūlapaluggaṁ vāmūsikukkarovā taṁ kājena āharitvā bhājanaṁ karitvā evamāha: \"ettha yo icchati taṇḍulapaṭibhastāni vā muggapaṭibhastāni vā kaḷāyapaṭibhastāni vā nikkhipitvā yaṁ icchati taṁ haratū\"ti. Ghaṭikāro kho, mahārāja, kumbhakāro andhe jiṇṇe mātāpitaro poseti. Ghaṭikāro kho, mahārāja, kumbhakāro pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko tattha parinibbāyī anāvattidhammo tasmā lokā.",
    "mn81:10": "Ekamidāhaṁ, mahārāja, samayaṁ vegaḷiṅge nāma gāmanigame viharāmi. Atha khvāhaṁ, mahārāja, pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena ghaṭikārassa kumbhakārassa mātāpitaro tenupasaṅkamiṁ; upasaṅkamitvā ghaṭikārassa kumbhakārassa mātāpitaro etadavocaṁ: \"handa ko nu kho ayaṁ bhaggavo gato\"ti? \"Nikkhanto kho te, bhante, upaṭṭhāko antokumbhiyā odanaṁ gahetvā pariyogā sūpaṁ gahetvā paribhuñjā\"ti.",
    "mn81:11": "Ekamidāhaṁ, mahārāja, samayaṁ tattheva vegaḷiṅge nāma gāmanigame viharāmi. Atha khvāhaṁ, mahārāja, pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena ghaṭikārassa kumbhakārassa mātāpitaro tenupasaṅkamiṁ; upasaṅkamitvā ghaṭikārassa kumbhakārassa mātāpitaro etadavocaṁ: \"handa ko nu kho ayaṁ bhaggavo gato\"ti? \"Nikkhanto kho te, bhante, upaṭṭhāko anto kaḷopiyā kummāsaṁ gahetvā pariyogā sūpaṁ gahetvā paribhuñjā\"ti.",
    "mn81:12": "Ekamidāhaṁ, mahārāja, samayaṁ tattheva vegaḷiṅge nāma gāmanigame viharāmi. Tena kho pana samayenakuṭiovassati. Atha khvāhaṁ, mahārāja, bhikkhū āmantesiṁ: \"gacchatha, bhikkhave, ghaṭikārassa kumbhakārassa nivesane tiṇaṁ jānāthā\"ti. Evaṁ vutte, mahārāja, te bhikkhū maṁ etadavocuṁ: \"natthi kho, bhante, ghaṭikārassa kumbhakārassa nivesane tiṇaṁ, atthi ca khvāssaāvesanetiṇacchadanan\"ti. \"Gacchatha, bhikkhave, ghaṭikārassa kumbhakārassa āvesanaṁ uttiṇaṁ karothā\"ti.",
    "mn81:13": "Atha kho, ānanda, kikī kāsirājā ghaṭikārassa kumbhakārassa pañcamattāni taṇḍulavāhasatāni pāhesi paṇḍupuṭakassa sālino tadupiyañca sūpeyyaṁ. Atha kho te, ānanda, rājapurisā ghaṭikāraṁ kumbhakāraṁ upasaṅkamitvā etadavocuṁ: ‘imāni kho, bhante, pañcamattāni taṇḍulavāhasatāni kikinā kāsirājena pahitāni paṇḍupuṭakassa sālino tadupiyañca sūpeyyaṁ. Tāni, bhante,paṭiggaṇhathā’ti. ‘Rājā kho bahukicco bahukaraṇīyo. Alaṁ me. Raññova hotū’ti.",
    "mn81:14": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}