{
    "mn83:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā mithilāyaṁ viharatimaghadevaambavane.",
    "mn83:2": "\"Bhūtapubbaṁ, ānanda, imissāyeva mithilāyaṁ rājā ahosi maghadevo nāma dhammiko dhammarājā dhamme ṭhito mahārājā; dhammaṁ carati brāhmaṇagahapatikesu negamesu ceva jānapadesu ca; uposathañca upavasati cātuddasiṁ pañcadasiṁ aṭṭhamiñca pakkhassa. Atha kho, ānanda, rājā maghadevo bahūnaṁ vassānaṁ bahūnaṁ vassasatānaṁ bahūnaṁ vassasahassānaṁ accayena kappakaṁ āmantesi: ‘yadā me, samma kappaka, passeyyāsi sirasmiṁ palitāni jātāni, atha me āroceyyāsī’ti.",
    "mn83:3": "Atha kho, ānanda, rājā maghadevo kappakassa gāmavaraṁ datvā jeṭṭhaputtaṁ kumāraṁ āmantāpetvā etadavoca: ‘pātubhūtā kho me, tāta kumāra, devadūtā; dissanti sirasmiṁ palitāni jātāni; bhuttā kho pana me mānusakā kāmā; samayo dibbe kāme pariyesituṁ. Ehi tvaṁ, tāta kumāra, imaṁ rajjaṁ paṭipajja. Ahaṁ pana kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajissāmi. Tena hi, tāta kumāra, yadā tvampi passeyyāsi sirasmiṁ palitāni jātāni, atha kappakassa gāmavaraṁ datvā jeṭṭhaputtaṁ kumāraṁ sādhukaṁ rajje samanusāsitvā kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajeyyāsi. Yena me idaṁ kalyāṇaṁ vattaṁ nihitaṁ anuppavatteyyāsi, mā kho me tvaṁ antimapuriso ahosi. Yasmiṁ kho, tāta kumāra, purisayuge vattamāne evarūpassa kalyāṇassa vattassa samucchedo hoti so tesaṁ antimapuriso hoti. Taṁ tāhaṁ, tāta kumāra, evaṁ vadāmi — yena me idaṁ kalyāṇaṁ vattaṁ nihitaṁ anuppavatteyyāsi, mā kho me tvaṁ antimapuriso ahosī’ti.",
    "mn83:4": "Atha kho, ānanda, rājā maghadevo kappakassa gāmavaraṁ datvā jeṭṭhaputtaṁ kumāraṁ sādhukaṁ rajje samanusāsitvā imasmiṁyeva maghadevaambavane kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbaji.",
    "mn83:5": "Rājā kho panānanda, maghadevo caturāsītivassasahassāni kumārakīḷitaṁ kīḷi, caturāsītivassasahassāni oparajjaṁ kāresi, caturāsītivassasahassāni rajjaṁ kāresi, caturāsītivassasahassāni imasmiṁyeva maghadevaambavane agārasmā anagāriyaṁ pabbajito brahmacariyamacari. So cattāro brahmavihāre bhāvetvā kāyassa bhedā paraṁ maraṇā brahmalokūpago ahosi.",
    "mn83:6": "Atha kho rañño, ānanda, maghadevassa putto bahūnaṁ vassānaṁ bahūnaṁ vassasatānaṁ bahūnaṁ vassasahassānaṁ accayena kappakaṁ āmantesi: ‘yadā me, samma kappaka, passeyyāsi sirasmiṁ palitāni jātāni, atha kho āroceyyāsī’ti. ‘Evaṁ, devā’ti kho, ānanda, kappako rañño maghadevassa puttassa paccassosi. Addasā kho, ānanda, kappako bahūnaṁ vassānaṁ bahūnaṁ vassasatānaṁ bahūnaṁ vassasahassānaṁ accayena rañño maghadevassa puttassa sirasmiṁ palitāni jātāni. Disvāna rañño maghadevassa puttaṁ etadavoca: ‘pātubhūtā kho devassa devadūtā; dissanti sirasmiṁ palitāni jātānī’ti. ‘Tena hi, samma kappaka, tāni palitāni sādhukaṁ saṇḍāsena uddharitvā mama añjalismiṁ patiṭṭhāpehī’ti. ‘Evaṁ, devā’ti kho, ānanda, kappako rañño maghadevassa puttassa paṭissutvā tāni palitāni sādhukaṁ saṇḍāsena uddharitvā rañño maghadevassa puttassa añjalismiṁ patiṭṭhāpesi.",
    "mn83:7": "Atha kho, ānanda, rañño maghadevassa putto kappakassa gāmavaraṁ datvā jeṭṭhaputtaṁ kumāraṁ āmantāpetvā etadavoca: ‘pātubhūtā kho me, tāta kumāra, devadūtā; dissanti sirasmiṁ palitāni jātāni; bhuttā kho pana me mānusakā kāmā; samayo dibbe kāme pariyesituṁ. Ehi tvaṁ, tāta kumāra, imaṁ rajjaṁ paṭipajja. Ahaṁ pana kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajissāmi. Tena hi, tāta kumāra, yadā tvampi passeyyāsi sirasmiṁ palitāni jātāni, atha kappakassa gāmavaraṁ datvā jeṭṭhaputtaṁ kumāraṁ sādhukaṁ rajje samanusāsitvā kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajeyyāsi. Yena me idaṁ kalyāṇaṁ vattaṁ nihitaṁ anuppavatteyyāsi, mā kho me tvaṁ antimapuriso ahosi. Yasmiṁ kho, tāta kumāra, purisayuge vattamāne evarūpassa kalyāṇassa vattassa samucchedo hoti so tesaṁ antimapuriso hoti. Taṁ tāhaṁ, tāta kumāra, evaṁ vadāmi — yena me idaṁ kalyāṇaṁ vattaṁ nihitaṁ anuppavatteyyāsi, mā kho me tvaṁ antimapuriso ahosī’ti.",
    "mn83:8": "Atha kho, ānanda, rañño maghadevassa putto kappakassa gāmavaraṁ datvā jeṭṭhaputtaṁ kumāraṁ sādhukaṁ rajje samanusāsitvā imasmiṁyeva maghadevaambavane kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbaji. So mettāsahagatena cetasā ekaṁ disaṁ pharitvā vihāsi, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihāsi. Karuṇāsahagatena cetasā … muditāsahagatena cetasā … upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā vihāsi, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihāsi. Rañño kho panānanda, maghadevassa putto caturāsītivassasahassāni kumārakīḷitaṁ kīḷi, caturāsītivassasahassāni oparajjaṁ kāresi, caturāsītivassasahassāni rajjaṁ kāresi, caturāsītivassasahassāni imasmiṁyeva maghadevaambavane agārasmā anagāriyaṁ pabbajito brahmacariyamacari. So cattāro brahmavihāre bhāvetvā kāyassa bhedā paraṁ maraṇā brahmalokūpago ahosi.",
    "mn83:9": "Rañño kho panānanda, maghadevassa puttapaputtakā tassa paramparācaturāsītirājasahassāniimasmiṁyeva maghadevaambavane kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajiṁsu. Te mettāsahagatena cetasā ekaṁ disaṁ pharitvā vihariṁsu, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihariṁsu. Karuṇāsahagatena cetasā … muditāsahagatena cetasā … upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā vihariṁsu, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihariṁsu.",
    "mn83:10": "Bhūtapubbaṁ, ānanda, devānaṁ tāvatiṁsānaṁ sudhammāyaṁ sabhāyaṁ sannisinnānaṁ sannipatitānaṁ ayamantarākathā udapādi: ‘lābhā vata, bho, videhānaṁ, suladdhaṁ vata, bho, videhānaṁ, yesaṁ nimi rājā dhammiko dhammarājā dhamme ṭhito mahārājā; dhammaṁ carati brāhmaṇagahapatikesu negamesu ceva jānapadesu ca; uposathañca upavasati cātuddasiṁ pañcadasiṁ aṭṭhamiñca pakkhassā’ti.",
    "mn83:11": "Atha kho, ānanda, sakko devānamindo nimissa rañño adhivāsanaṁ viditvā –  seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evameva — nimissa rañño pamukhe antarahito devesu tāvatiṁsesu pāturahosi.",
    "mn83:12": "Atha kho, ānanda, sakko devānamindo mātaliṁ saṅgāhakaṁ āmantesi: ‘ehi tvaṁ, samma mātali, sahassayuttaṁ ājaññarathaṁ yojetvā nimiṁ rājānaṁ tattheva mithilaṁ paṭinehī’ti. ‘Evaṁ, bhaddantavā’ti kho, ānanda, mātali saṅgāhako sakkassa devānamindassa paṭissutvā sahassayuttaṁ ājaññarathaṁ yojetvā nimiṁ rājānaṁ tattheva mithilaṁ paṭinesi. Tatra sudaṁ, ānanda, nimi rājā dhammaṁ carati brāhmaṇagahapatikesu negamesu ceva jānapadesu ca, uposathañca upavasati cātuddasiṁ pañcadasiṁ aṭṭhamiñca pakkhassāti. Atha kho, ānanda, nimi rājā bahūnaṁ vassānaṁ bahūnaṁ vassasatānaṁ bahūnaṁ vassasahassānaṁ accayena kappakaṁ āmantesi: ‘yadā me, samma kappaka, passeyyāsi sirasmiṁ palitāni jātāni, atha me āroceyyāsī’ti. ‘Evaṁ, devā’ti kho, ānanda, kappako nimissa rañño paccassosi. Addasā kho, ānanda, kappako bahūnaṁ vassānaṁ bahūnaṁ vassasatānaṁ bahūnaṁ vassasahassānaṁ accayena nimissa rañño sirasmiṁ palitāni jātāni. Disvāna nimiṁ rājānaṁ etadavoca: ‘pātubhūtā kho devassa devadūtā; dissanti sirasmiṁ palitāni jātānī’ti. ‘Tena hi, samma kappaka, tāni palitāni sādhukaṁ saṇḍāsena uddharitvā mama añjalismiṁ patiṭṭhāpehī’ti. ‘Evaṁ, devā’ti kho, ānanda, kappako nimissa rañño paṭissutvā tāni palitāni sādhukaṁ saṇḍāsena uddharitvā nimissa rañño añjalismiṁ patiṭṭhāpesi. Atha kho, ānanda, nimi rājā kappakassa gāmavaraṁ datvā jeṭṭhaputtaṁ kumāraṁ āmantāpetvā etadavoca: ‘pātubhūtā kho me, tāta kumāra, devadūtā; dissanti sirasmiṁ palitāni jātāni; bhuttā kho pana me mānusakā kāmā; samayo dibbe kāme pariyesituṁ. Ehi tvaṁ, tāta kumāra, imaṁ rajjaṁ paṭipajja. Ahaṁ pana kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajissāmi. Tena hi, tāta kumāra, yadā tvampi passeyyāsi sirasmiṁ palitāni jātāni, atha kappakassa gāmavaraṁ datvā jeṭṭhaputtaṁ kumāraṁ sādhukaṁ rajje samanusāsitvā kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajeyyāsi. Yena me idaṁ kalyāṇaṁ vattaṁ nihitaṁ anuppavatteyyāsi, mā kho me tvaṁ antimapuriso ahosi. Yasmiṁ kho, tāta kumāra, purisayuge vattamāne evarūpassa kalyāṇassa vattassa samucchedo hoti so tesaṁ antimapuriso hoti. Taṁ tāhaṁ, tāta kumāra, evaṁ vadāmi: \"yena me idaṁ kalyāṇaṁ vattaṁ nihitaṁ anuppavatteyyāsi, mā kho me tvaṁ antimapuriso ahosī\"’ti.",
    "mn83:13": "Atha kho, ānanda, nimi rājā kappakassa gāmavaraṁ datvā jeṭṭhaputtaṁ kumāraṁ sādhukaṁ rajje samanusāsitvā imasmiṁyeva maghadevaambavane kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbaji. So mettāsahagatena cetasā ekaṁ disaṁ pharitvā vihāsi, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihāsi. Karuṇāsahagatena cetasā … muditāsahagatena cetasā … upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā vihāsi, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihāsi. Nimi kho panānanda, rājā caturāsītivassasahassāni kumārakīḷitaṁ kīḷi, caturāsītivassasahassāni oparajjaṁ kāresi, caturāsītivassasahassāni rajjaṁ kāresi, caturāsītivassasahassāni imasmiṁyeva maghadevaambavane agārasmā anagāriyaṁ pabbajito brahmacariyamacari. So cattāro brahmavihāre bhāvetvā kāyassa bhedā paraṁ maraṇā brahmalokūpago ahosi. Nimissa kho panānanda, rañño kaḷārajanako nāma putto ahosi. Na so agārasmā anagāriyaṁ pabbaji. So taṁ kalyāṇaṁ vattaṁ samucchindi. So tesaṁ antimapuriso ahosi.",
    "mn83:14": "Siyā kho pana te, ānanda, evamassa: ‘añño nūna tena samayena rājā maghadevo ahosi,yena taṁ kalyāṇaṁ vattaṁ nihitan’ti. Na kho panetaṁ, ānanda, evaṁ daṭṭhabbaṁ. Ahaṁ tena samayena rājā maghadevo ahosiṁ. Ahaṁ taṁ kalyāṇaṁ vattaṁ nihiniṁ, mayā taṁ kalyāṇaṁ vattaṁ nihitaṁ; pacchimā janatā anuppavattesi. Taṁ kho panānanda, kalyāṇaṁ vattaṁ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṁvattati, yāvadeva brahmalokūpapattiyā. Idaṁ kho panānanda, etarahi mayā kalyāṇaṁ vattaṁ nihitaṁ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati. Katamañcānanda, etarahi mayā kalyāṇaṁ vattaṁ nihitaṁ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṁ — sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi. Idaṁ kho, ānanda, etarahi mayā kalyāṇaṁ vattaṁ nihitaṁ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati.",
    "mn83:15": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}