{
    "mn84:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ āyasmā mahākaccāno madhurāyaṁ viharati gundāvane.",
    "mn84:2": "Taṁ kiṁ maññasi, mahārāja, khattiyassa cepi ijjheyya dhanena vā dhaññena vā rajatena vā jātarūpena vā khattiyopissāssa pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī … brāhmaṇopissāssa … vessopissāssa … suddopissāssa pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī\"ti?",
    "mn84:3": "\"Taṁ kiṁ maññasi, mahārāja, brāhmaṇassa cepi ijjheyya dhanena vā dhaññena vā rajatena vā jātarūpena vā brāhmaṇopissāssa pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī … vessopissāssa … suddopissāssa … khattiyopissāssa pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī\"ti?",
    "mn84:4": "\"Taṁ kiṁ maññasi, mahārāja, vessassa cepi ijjheyya dhanena vā dhaññena vā rajatena vā jātarūpena vā vessopissāssa pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī … suddopissāssa … khattiyopissāssa … brāhmaṇopissāssa pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī\"ti?",
    "mn84:5": "\"Taṁ kiṁ maññasi, mahārāja, suddassa cepi ijjheyya dhanena vā dhaññena vā rajatena vā jātarūpena vā suddopissāssa pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī … khattiyopissāssa … brāhmaṇopissāssa … vessopissāssa pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī\"ti?",
    "mn84:6": "\"Taṁ kiṁ maññasi, mahārāja, yadi evaṁ sante, ime cattāro vaṇṇā samasamā honti no vā? Kathaṁ vā te ettha hotī\"ti?",
    "mn84:7": "Taṁ kiṁ maññasi, mahārāja, idhassa khattiyo pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco samphappalāpī abhijjhālu byāpannacittomicchādiṭṭhikāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyya no vā? Kathaṁ vā te ettha hotī\"ti?",
    "mn84:8": "\"Sādhu sādhu, mahārāja. Sādhu kho te etaṁ, mahārāja, evaṁ hoti, sādhu ca pana te etaṁ arahataṁ sutaṁ. Taṁ kiṁ maññasi, mahārāja, idhassa brāhmaṇo … pe … idhassa vesso … pe … idhassa suddo pāṇātipātī adinnādāyī … pe … micchādiṭṭhi kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyya no vā? Kathaṁ vā te ettha hotī\"ti?",
    "mn84:9": "\"Sādhu sādhu, mahārāja. Sādhu kho te etaṁ, mahārāja, evaṁ hoti, sādhu ca pana te etaṁ arahataṁ sutaṁ. Taṁ kiṁ maññasi, mahārāja, yadi evaṁ sante, ime cattāro vaṇṇā samasamā honti no vā? Kathaṁ vā te ettha hotī\"ti?",
    "mn84:10": "\"Taṁ kiṁ maññasi, mahārāja, idhassa khattiyo pāṇātipātā paṭivirato, adinnādānā paṭivirato, kāmesumicchācārā paṭivirato, musāvādā paṭivirato, pisuṇāya vācāya paṭivirato, pharusāya vācāya paṭivirato, samphappalāpā paṭivirato, anabhijjhālu abyāpannacittosammādiṭṭhikāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjeyya no vā? Kathaṁ vā te ettha hotī\"ti?",
    "mn84:11": "\"Sādhu sādhu, mahārāja. Sādhu kho te etaṁ, mahārāja, evaṁ hoti, sādhu ca pana te etaṁ arahataṁ sutaṁ. Taṁ kiṁ maññasi, mahārāja, idhassa brāhmaṇo, idhassa vesso, idhassa suddo pāṇātipātā paṭivirato adinnādānā paṭivirato … pe … sammādiṭṭhi kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjeyya no vā? Kathaṁ vā te ettha hotī\"ti?",
    "mn84:12": "\"Sādhu sādhu, mahārāja. Sādhu kho te etaṁ, mahārāja, evaṁ hoti, sādhu ca pana te etaṁ arahataṁ sutaṁ. Taṁ kiṁ maññasi, mahārāja, yadi evaṁ sante, ime cattāro vaṇṇā samasamā honti no vā? Kathaṁ vā te ettha hotī\"ti?",
    "mn84:13": "\"Taṁ kiṁ maññasi, mahārāja, idha khattiyo sandhiṁ vā chindeyya, nillopaṁ vā hareyya, ekāgārikaṁ vā kareyya, paripanthe vā tiṭṭheyya, paradāraṁ vā gaccheyya, tañce te purisā gahetvā dasseyyuṁ: ‘Ayaṁ te, deva, coro āgucārī. Imassa yaṁ icchasi taṁ daṇḍaṁ paṇehī’ti. Kinti naṁ kareyyāsī\"ti?",
    "mn84:14": "\"Taṁ kiṁ maññasi, mahārāja, idha brāhmaṇo, idha vesso, idha suddo sandhiṁ vā chindeyya, nillopaṁ vā hareyya, ekāgārikaṁ vā kareyya, paripanthe vā tiṭṭheyya, paradāraṁ vā gaccheyya, tañce te purisā gahetvā dasseyyuṁ: ‘Ayaṁ te, deva, coro āgucārī. Imassa yaṁ icchasi taṁ daṇḍaṁ paṇehī’ti. Kinti naṁ kareyyāsī\"ti?",
    "mn84:15": "\"Taṁ kiṁ maññasi, mahārāja, yadi evaṁ sante, ime cattāro vaṇṇā samasamā honti no vā? Kathaṁ vā te ettha hotī\"ti?",
    "mn84:16": "\"Taṁ kiṁ maññasi, mahārāja, idha khattiyo kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajito assa virato pāṇātipātā, virato adinnādānā, virato musāvādā, rattūparato, ekabhattiko, brahmacārī, sīlavā, kalyāṇadhammo. Kinti naṁ kareyyāsī\"ti?",
    "mn84:17": "\"Taṁ kiṁ maññasi, mahārāja, idha brāhmaṇo, idha vesso, idha suddo kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajito assa virato pāṇātipātā, virato adinnādānā virato musāvādā, rattūparato, ekabhattiko, brahmacārī, sīlavā, kalyāṇadhammo. Kinti naṁ kareyyāsī\"ti?",
    "mn84:18": "\"Taṁ kiṁ maññasi, mahārāja, yadi evaṁ sante, ime cattāro vaṇṇā samasamā honti no vā? Kathaṁ vā te ettha hotī\"ti?",
    "mn84:19": "Evaṁ vutte, rājā mādhuro avantiputto āyasmantaṁ mahākaccānaṁ etadavoca: \"Abhikkantaṁ, bho kaccāna, abhikkantaṁ, bho kaccāna. Seyyathāpi, bho kaccāna, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā kaccānena anekapariyāyena dhammo pakāsito. Esāhaṁ bhavantaṁ kaccānaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṁghañca. Upāsakaṁ maṁ bhavaṁ kaccāno dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}