{
    "mn85:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā bhaggesu viharati susumāragire bhesakaḷāvane migadāye.",
    "mn85:2": "Atha kho sañjikāputto māṇavo bhagavato adhivāsanaṁ viditvā uṭṭhāyāsanā yena bodhi rājakumāro tenupasaṅkami; upasaṅkamitvā bodhiṁ rājakumāraṁ etadavoca: \"avocumha bhoto vacanena taṁ bhavantaṁ gotamaṁ: ‘bodhi kho rājakumāro bhoto gotamassa pāde sirasā vandati, appābādhaṁ appātaṅkaṁ lahuṭṭhānaṁ balaṁ phāsuvihāraṁ pucchati. Evañca vadeti — adhivāsetu kira bhavaṁ gotamo bodhissa rājakumārassa svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā’ti. Adhivuṭṭhañca pana samaṇena gotamenā\"ti.",
    "mn85:3": "Atha kho bodhi rājakumāro tassā rattiyā accayena sake nivesane paṇītaṁ khādanīyaṁ bhojanīyaṁ paṭiyādāpetvā, kokanadañca pāsādaṁ odātehi dussehi santharāpetvā yāvapacchimasopānakaḷevarā, sañjikāputtaṁ māṇavaṁ āmantesi: \"ehi tvaṁ, samma sañjikāputta, yena bhagavā tenupasaṅkama; upasaṅkamitvā bhagavato kālaṁ ārocehi: ‘kālo, bhante, niṭṭhitaṁ bhattan’\"ti.",
    "mn85:4": "Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena bodhissa rājakumārassa nivesanaṁ tenupasaṅkami.",
    "mn85:5": "Atha kho bhagavā āyasmantaṁ ānandaṁ apalokesi. Atha kho āyasmā ānando bodhiṁ rājakumāraṁ etadavoca: \"saṁharatu, rājakumāra, dussāni; na bhagavācelapaṭikaṁakkamissati. Pacchimaṁ janataṁ tathāgatoanukampatī\"ti.",
    "mn85:6": "\"Mayhampi kho, rājakumāra, pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi: ‘Na kho sukhena sukhaṁ adhigantabbaṁ, dukkhena kho sukhaṁ adhigantabban’ti.",
    "mn85:7": "Atha khvāhaṁ, rājakumāra, yena āḷāro kālāmo tenupasaṅkamiṁ; upasaṅkamitvā āḷāraṁ kālāmaṁ etadavocaṁ: ‘kittāvatā no, āvuso kālāma, imaṁ dhammaṁ sayaṁ abhiññā sacchikatvāupasampajja viharāmīti pavedesī’ti? Evaṁ vutte, rājakumāra, āḷāro kālāmo ākiñcaññāyatanaṁ pavedesi.",
    "mn85:8": "So kho ahaṁ, rājakumāra, kiṁkusalagavesī anuttaraṁ santivarapadaṁ pariyesamāno yenaudakorāmaputto tenupasaṅkamiṁ; upasaṅkamitvā udakaṁ rāmaputtaṁ etadavocaṁ: ‘icchāmahaṁ,āvuso, imasmiṁ dhammavinaye brahmacariyaṁ caritun’ti. Evaṁ vutte, rājakumāra, udako rāmaputto maṁ etadavoca: ‘viharatāyasmā, tādiso ayaṁ dhammo yattha viññū puriso nacirasseva sakaṁ ācariyakaṁ sayaṁ abhiññā sacchikatvā upasampajja vihareyyā’ti. So kho ahaṁ, rājakumāra, nacirasseva khippameva taṁ dhammaṁ pariyāpuṇiṁ. So kho ahaṁ, rājakumāra, tāvatakeneva oṭṭhapahatamattena lapitalāpanamattena ñāṇavādañca vadāmi, theravādañca jānāmi passāmīti ca paṭijānāmi, ahañceva aññe ca. Tassa mayhaṁ, rājakumāra, etadahosi: ‘Na kho rāmo imaṁ dhammaṁ kevalaṁ saddhāmattakena sayaṁ abhiññā sacchikatvā upasampajja viharāmīti pavedesi; addhā rāmo imaṁ dhammaṁ jānaṁ passaṁ vihāsī’ti.",
    "mn85:9": "Atha khvāhaṁ, rājakumāra, yena udako rāmaputto tenupasaṅkamiṁ; upasaṅkamitvā udakaṁ rāmaputtaṁ etadavocaṁ: ‘kittāvatā no, āvuso, rāmo imaṁ dhammaṁ sayaṁ abhiññā sacchikatvā upasampajja viharāmīti pavedesī’ti? Evaṁ vutte, rājakumāra, udako rāmaputto nevasaññānāsaññāyatanaṁ pavedesi.",
    "mn85:10": "Atha khvāhaṁ, rājakumāra, yenaudako rāmaputtotenupasaṅkamiṁ; upasaṅkamitvā udakaṁ rāmaputtaṁ etadavocaṁ: ‘ettāvatā no, āvuso, rāmo imaṁ dhammaṁ sayaṁ abhiññā sacchikatvā upasampajja pavedesī’ti?",
    "mn85:11": "So kho ahaṁ, rājakumāra, kiṁkusalagavesī anuttaraṁ santivarapadaṁ pariyesamāno, magadhesu anupubbena cārikaṁ caramāno, yena uruvelā senānigamo tadavasariṁ. Tatthaddasaṁ ramaṇīyaṁ bhūmibhāgaṁ, pāsādikañca vanasaṇḍaṁ, nadiñca sandantiṁ setakaṁ supatitthaṁ, ramaṇīyaṁ samantā ca gocaragāmaṁ. Tassa mayhaṁ, rājakumāra, etadahosi: ‘ramaṇīyo vata bho bhūmibhāgo, pāsādiko ca vanasaṇḍo, nadī ca sandati setakā supatitthā, ramaṇīyāsamantāca gocaragāmo. Alaṁ vatidaṁ kulaputtassa padhānatthikassa padhānāyā’ti. So kho ahaṁ, rājakumāra, tattheva nisīdiṁ: ‘alamidaṁ padhānāyā’ti.",
    "mn85:12": "Seyyathāpi, rājakumāra, allaṁ kaṭṭhaṁ sasnehaṁ udake nikkhittaṁ. Atha puriso āgaccheyya uttarāraṇiṁ ādāya: ‘aggiṁ abhinibbattessāmi, tejo pātukarissāmī’ti. Taṁ kiṁ maññasi, rājakumāra, api nu so puriso amuṁ allaṁ kaṭṭhaṁ sasnehaṁ udake nikkhittaṁ uttarāraṇiṁ ādāyaabhimanthentoaggiṁ abhinibbatteyya, tejo pātukareyyā\"ti?",
    "mn85:13": "\"No hidaṁ, bhante. Taṁ kissa hetu? Aduñhi, bhante, allaṁ kaṭṭhaṁ sasnehaṁ tañca pana udake nikkhittaṁ, yāvadeva ca pana so puriso kilamathassa vighātassa bhāgī assā\"ti.",
    "mn85:14": "\"Evameva kho, rājakumāra, ye hi keci samaṇā vā brāhmaṇā vā kāyena ceva cittena ca kāmehi avūpakaṭṭhā viharanti, yo ca nesaṁ kāmesu kāmacchando kāmasneho kāmamucchā kāmapipāsā kāmapariḷāho so ca ajjhattaṁ na suppahīno hoti, na suppaṭippassaddho. Opakkamikā cepi te bhonto samaṇabrāhmaṇā dukkhā tibbā kharā kaṭukā vedanā vedayanti, abhabbāva te ñāṇāya dassanāya anuttarāya sambodhāya. No cepi te bhonto samaṇabrāhmaṇā opakkamikā dukkhā tibbā kharā kaṭukā vedanā vedayanti, abhabbāva te ñāṇāya dassanāya anuttarāya sambodhāya. Ayaṁ kho maṁ, rājakumāra, paṭhamā upamā paṭibhāsi anacchariyā pubbe assutapubbā.",
    "mn85:15": "Aparāpi kho maṁ, rājakumāra, dutiyā upamā paṭibhāsi anacchariyā pubbe assutapubbā.",
    "mn85:16": "Seyyathāpi, rājakumāra, allaṁ kaṭṭhaṁ sasnehaṁ ārakā udakā thale nikkhittaṁ. Atha puriso āgaccheyya uttarāraṇiṁ ādāya: ‘aggiṁ abhinibbattessāmi, tejo pātukarissāmī’ti. Taṁ kiṁ maññasi, rājakumāra, api nu so puriso amuṁ allaṁ kaṭṭhaṁ sasnehaṁ ārakā udakā thale nikkhittaṁ uttarāraṇiṁ ādāya abhimanthento aggiṁ abhinibbatteyya, tejo pātukareyyā\"ti?",
    "mn85:17": "\"No hidaṁ, bhante. Taṁ kissa hetu? Aduñhi, bhante, allaṁ kaṭṭhaṁ sasnehaṁ kiñcāpi ārakā udakā thale nikkhittaṁ, yāvadeva ca pana so puriso kilamathassa vighātassa bhāgī assā\"ti.",
    "mn85:18": "\"Evameva kho, rājakumāra, ye hi keci samaṇā vā brāhmaṇā vā kāyena ceva cittena ca kāmehi vūpakaṭṭhā viharanti, yo ca nesaṁ kāmesu kāmacchando kāmasneho kāmamucchā kāmapipāsā kāmapariḷāho so ca ajjhattaṁ na suppahīno hoti, na suppaṭippassaddho. Opakkamikā cepi te bhonto samaṇabrāhmaṇā dukkhā tibbā kharā kaṭukā vedanā vedayanti, abhabbāva te ñāṇāya dassanāya anuttarāya sambodhāya. No cepi te bhonto samaṇabrāhmaṇā opakkamikā dukkhā tibbā kharā kaṭukā vedanā vedayanti, abhabbāva te ñāṇāya dassanāya anuttarāya sambodhāya. Ayaṁ kho maṁ, rājakumāra, dutiyā upamā paṭibhāsi anacchariyā pubbe assutapubbā.",
    "mn85:19": "Aparāpi kho maṁ, rājakumāra, tatiyā upamā paṭibhāsi anacchariyā pubbe assutapubbā.",
    "mn85:20": "Seyyathāpi, rājakumāra, sukkhaṁ kaṭṭhaṁ koḷāpaṁ ārakā udakā thale nikkhittaṁ. Atha puriso āgaccheyya uttarāraṇiṁ ādāya: ‘aggiṁ abhinibbattessāmi, tejo pātukarissāmī’ti. Taṁ kiṁ maññasi, rājakumāra, api nu so puriso amuṁ sukkhaṁ kaṭṭhaṁ koḷāpaṁ ārakā udakā thale nikkhittaṁ uttarāraṇiṁ ādāya abhimanthento aggiṁ abhinibbatteyya, tejo pātukareyyā\"ti?",
    "mn85:21": "\"Evaṁ, bhante. Taṁ kissa hetu? Aduñhi, bhante, sukkhaṁ kaṭṭhaṁ koḷāpaṁ, tañca pana ārakā udakā thale nikkhittan\"ti.",
    "mn85:22": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘yannūnāhaṁ dantebhidantamādhāya, jivhāya tāluṁ āhacca, cetasā cittaṁ abhiniggaṇheyyaṁ abhinippīḷeyyaṁ abhisantāpeyyan’ti. So kho ahaṁ, rājakumāra, dantebhidantamādhāya, jivhāya tāluṁ āhacca, cetasā cittaṁ abhiniggaṇhāmi abhinippīḷemi abhisantāpemi. Tassa mayhaṁ, rājakumāra, dantebhidantamādhāya, jivhāya tāluṁ āhacca, cetasā cittaṁ abhiniggaṇhato abhinippīḷayato abhisantāpayato kacchehi sedā muccanti. Seyyathāpi, rājakumāra, balavā puriso dubbalataraṁ purisaṁ sīse vā gahetvā khandhe vā gahetvā abhiniggaṇheyya abhinippīḷeyya abhisantāpeyya; evameva kho me, rājakumāra, dantebhidantamādhāya, jivhāya tāluṁ āhacca, cetasā cittaṁ abhiniggaṇhato abhinippīḷayato abhisantāpayato kacchehi sedā muccanti. Āraddhaṁ kho pana me, rājakumāra, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā, sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn85:23": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, rājakumāra, mukhato ca nāsato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, rājakumāra, mukhato ca nāsato ca assāsapassāsesu uparuddhesu kaṇṇasotehi vātānaṁ nikkhamantānaṁ adhimatto saddo hoti. Seyyathāpi nāma kammāragaggariyā dhamamānāya adhimatto saddo hoti; evameva kho me, rājakumāra, mukhato ca nāsato ca assāsapassāsesu uparuddhesu kaṇṇasotehi vātānaṁ nikkhamantānaṁ adhimatto saddo hoti. Āraddhaṁ kho pana me, rājakumāra, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā, sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn85:24": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā vātā muddhaniūhananti. Seyyathāpi, rājakumāra, balavā puriso tiṇhena sikharenamuddhani abhimattheyya; evameva kho me, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā vātā muddhani ūhananti. Āraddhaṁ kho pana me, rājakumāra, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā, sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn85:25": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā sīse sīsavedanā honti. Seyyathāpi, rājakumāra, balavā puriso daḷhenavarattakkhaṇḍenasīse sīsaveṭhaṁ dadeyya; evameva kho me, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā sīse sīsavedanā honti. Āraddhaṁ kho pana me, rājakumāra, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā, sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn85:26": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā vātā kucchiṁ parikantanti. Seyyathāpi, rājakumāra, dakkho goghātako vā goghātakantevāsī vā tiṇhena govikantanena kucchiṁ parikanteyya; evameva kho me, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimattā, vātā kucchiṁ parikantanti. Āraddhaṁ kho pana me, rājakumāra, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā, sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn85:27": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘yannūnāhaṁ appāṇakaṁyeva jhānaṁ jhāyeyyan’ti. So kho ahaṁ, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāse uparundhiṁ. Tassa mayhaṁ, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimatto kāyasmiṁ ḍāho hoti. Seyyathāpi, rājakumāra, dve balavanto purisā dubbalataraṁ purisaṁ nānābāhāsu gahetvā aṅgārakāsuyā santāpeyyuṁ samparitāpeyyuṁ; evameva kho me, rājakumāra, mukhato ca nāsato ca kaṇṇato ca assāsapassāsesu uparuddhesu adhimatto kāyasmiṁ ḍāho hoti. Āraddhaṁ kho pana me, rājakumāra, vīriyaṁ hoti asallīnaṁ, upaṭṭhitā sati asammuṭṭhā, sāraddho ca pana me kāyo hoti appaṭippassaddho, teneva dukkhappadhānena padhānābhitunnassa sato.",
    "mn85:28": "Apissu maṁ, rājakumāra, devatā disvā evamāhaṁsu: ‘kālaṅkato samaṇo gotamo’ti. Ekaccā devatā evamāhaṁsu: ‘Na kālaṅkato samaṇo gotamo, api ca kālaṁ karotī’ti. Ekaccā devatā evamāhaṁsu: ‘Na kālaṅkato samaṇo gotamo, nāpi kālaṁ karoti. Arahaṁ samaṇo gotamo.Vihāro tveva soarahato evarūpo hotī’ti.",
    "mn85:29": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘yannūnāhaṁ sabbaso āhārupacchedāya paṭipajjeyyan’ti. Atha kho maṁ, rājakumāra, devatā upasaṅkamitvā etadavocuṁ: ‘mā kho tvaṁ, mārisa, sabbaso āhārupacchedāya paṭipajji. Sace kho tvaṁ, mārisa, sabbaso āhārupacchedāya paṭipajjissasi, tassa te mayaṁ dibbaṁ ojaṁ lomakūpehiajjhohāressāma, tāya tvaṁ yāpessasī’ti. Tassa mayhaṁ, rājakumāra, etadahosi: ‘ahañceva kho pana sabbasoajajjitaṁpaṭijāneyyaṁ. Imā ca me devatā dibbaṁ ojaṁ lomakūpehiajjhohāreyyuṁ, tāya cāhaṁ yāpeyyaṁ, taṁ mamassa musā’ti. So kho ahaṁ, rājakumāra, tā devatā paccācikkhāmi. ‘Halan’ti vadāmi.",
    "mn85:30": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘yannūnāhaṁ thokaṁ thokaṁ āhāraṁ āhāreyyaṁ pasataṁ pasataṁ, yadi vā muggayūsaṁ yadi vā kulatthayūsaṁ yadi vā kaḷāyayūsaṁ yadi vā hareṇukayūsan’ti. So kho ahaṁ, rājakumāra, thokaṁ thokaṁ āhāraṁ āhāresiṁ pasataṁ pasataṁ, yadi vā muggayūsaṁ yadi vā kulatthayūsaṁ yadi vā kaḷāyayūsaṁ yadi vā hareṇukayūsaṁ. Tassa mayhaṁ, rājakumāra, thokaṁ thokaṁ āhāraṁ āhārayato pasataṁ pasataṁ, yadi vā muggayūsaṁ yadi vā kulatthayūsaṁ yadi vā kaḷāyayūsaṁ yadi vā hareṇukayūsaṁ, adhimattakasimānaṁ patto kāyo hoti. Seyyathāpi nāma āsītikapabbāni vā kāḷapabbāni vā; evamevassu me aṅgapaccaṅgāni bhavanti tāyevappāhāratāya. Seyyathāpi nāma oṭṭhapadaṁ; evamevassu me ānisadaṁ hoti tāyevappāhāratāya. Seyyathāpi nāma vaṭṭanāvaḷī; evamevassu me piṭṭhikaṇṭako uṇṇatāvanato hoti tāyevappāhāratāya. Seyyathāpi nāma jarasālāya gopānasiyo oluggaviluggā bhavanti; evamevassu me phāsuḷiyo oluggaviluggā bhavanti tāyevappāhāratāya. Seyyathāpi nāma gambhīre udapāne udakatārakā gambhīragatā okkhāyikā dissanti; evamevassu me akkhikūpesu akkhitārakā gambhīragatā okkhāyikā dissanti tāyevappāhāratāya. Seyyathāpi nāma tittakālābu āmakacchinno vātātapenasamphuṭitohoti sammilāto; evamevassu me sīsacchavi samphuṭitā hoti sammilātā tāyevappāhāratāya.",
    "mn85:31": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘ye kho keci atītamaddhānaṁ samaṇā vā brāhmaṇā vā opakkamikā dukkhātibbākharā kaṭukā vedanā vedayiṁsu, etāvaparamaṁ nayito bhiyyo. Yepi hi keci anāgatamaddhānaṁ samaṇā vā brāhmaṇā vā opakkamikā dukkhā tibbā kharā kaṭukā vedanā vedayissanti, etāvaparamaṁ nayito bhiyyo. Yepi hi keci etarahi samaṇā vā brāhmaṇā vā opakkamikā dukkhā tibbā kharā kaṭukā vedanā vedayanti, etāvaparamaṁ nayito bhiyyo. Na kho panāhaṁ imāya kaṭukāya dukkarakārikāya adhigacchāmi uttari manussadhammā alamariyañāṇadassanavisesaṁ; siyā nu kho añño maggo bodhāyā’ti.",
    "mn85:32": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘Na kho taṁ sukaraṁ sukhaṁ adhigantuṁ evaṁ adhimattakasimānaṁ pattakāyena. Yannūnāhaṁ oḷārikaṁ āhāraṁ āhāreyyaṁ odanakummāsan’ti. So kho ahaṁ, rājakumāra, oḷārikaṁ āhāraṁ āhāresiṁ odanakummāsaṁ. Tena kho pana maṁ, rājakumāra, samayena pañcavaggiyā bhikkhū paccupaṭṭhitā honti: ‘Yaṁ kho samaṇo gotamo dhammaṁ adhigamissati taṁ no ārocessatī’ti. Yato kho ahaṁ, rājakumāra, oḷārikaṁ āhāraṁ āhāresiṁ odanakummāsaṁ, atha me te pañcavaggiyā bhikkhū nibbijja pakkamiṁsu: ‘bāhullikosamaṇo gotamo padhānavibbhanto, āvatto bāhullāyā’ti.",
    "mn85:33": "So kho ahaṁ, rājakumāra, oḷārikaṁ āhāraṁ āhāretvā balaṁ gahetvā vivicceva kāmehi … pe … paṭhamaṁ jhānaṁ upasampajja vihāsiṁ. Vitakkavicārānaṁ vūpasamā … dutiyaṁ jhānaṁ … tatiyaṁ jhānaṁ … catutthaṁ jhānaṁ upasampajja vihāsiṁ. So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhininnāmesiṁ. So anekavihitaṁ pubbenivāsaṁ anussarāmi, seyyathidaṁ — ekampi jātiṁ dvepi jātiyo … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarāmi.",
    "mn85:34": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhininnāmesiṁ. So dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajānāmi … pe …",
    "mn85:35": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmesiṁ. So ‘idaṁ dukkhan’ti yathābhūtaṁ abbhaññāsiṁ … pe … ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ abbhaññāsiṁ; ‘ime āsavā’ti yathābhūtaṁ abbhaññāsiṁ … pe … ‘Ayaṁ āsavanirodhagāminī paṭipadā’ti yathābhūtaṁ abbhaññāsiṁ.",
    "mn85:36": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘adhigato kho myāyaṁ dhammo gambhīro duddaso duranubodho santo paṇīto atakkāvacaro nipuṇo paṇḍitavedanīyo. Ālayarāmā kho panāyaṁ pajā ālayaratā ālayasammuditā. Ālayarāmāya kho pana pajāya ālayaratāya ālayasammuditāya duddasaṁ idaṁ ṭhānaṁ yadidaṁ — idappaccayatāpaṭiccasamuppādo. Idampi kho ṭhānaṁ duddasaṁ — yadidaṁ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṁ. Ahañceva kho pana dhammaṁ deseyyaṁ, pare ca me na ājāneyyuṁ, so mamassa kilamatho, sā mamassa vihesā’ti. Apissu maṁ, rājakumāra, imā anacchariyā gāthāyo paṭibhaṁsu pubbe assutapubbā:",
    "mn85:37": "‘Kicchena me adhigataṁ,halaṁ dāni pakāsituṁ;Rāgadosaparetehi,nāyaṁ dhammo susambudho.",
    "mn85:38": "Paṭisotagāmiṁ nipuṇaṁ,gambhīraṁ duddasaṁ aṇuṁ;Rāgarattā na dakkhanti,tamokhandhenaāvuṭā’ti.",
    "mn85:39": "Itiha me, rājakumāra, paṭisañcikkhato appossukkatāya cittaṁ namati no dhammadesanāya.",
    "mn85:40": "Atha kho, rājakumāra, brahmuno sahampatissa mama cetasā cetoparivitakkamaññāya etadahosi: ‘nassati vata bho loko; vinassati vata bho loko. Yatra hi nāma tathāgatassa arahato sammāsambuddhassa appossukkatāya cittaṁnamatino dhammadesanāyā’ti. Atha kho, rājakumāra, brahmā sahampati — seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya pasāritaṁ vā bāhaṁ samiñjeyya; evameva — brahmaloke antarahito mama purato pāturahosi. Atha kho, rājakumāra, brahmā sahampati ekaṁsaṁ uttarāsaṅgaṁ karitvā yenāhaṁ tenañjaliṁ paṇāmetvā maṁ etadavoca: ‘desetu, bhante, bhagavā dhammaṁ, desetu sugato dhammaṁ. Santi sattā apparajakkhajātikā assavanatāya dhammassa parihāyanti; bhavissanti dhammassa aññātāro’ti. Idamavoca, rājakumāra, brahmā sahampati; idaṁ vatvā athāparaṁ etadavoca:",
    "mn85:41": "‘Pāturahosi magadhesu pubbe,Dhammo asuddho samalehi cintito;Apāpuretaṁamatassa dvāraṁ,Suṇantu dhammaṁ vimalenānubuddhaṁ.",
    "mn85:42": "Sele yathā pabbatamuddhaniṭṭhito,Yathāpi passe janataṁ samantato;Tathūpamaṁ dhammamayaṁ sumedha,Pāsādamāruyha samantacakkhu.",
    "mn85:43": "Sokāvatiṇṇaṁjanatamapetasoko,Avekkhassu jātijarābhibhūtaṁ;Uṭṭhehi vīra vijitasaṅgāma,Satthavāhaaṇaṇavicara loke;Desassubhagavā dhammaṁ,Aññātāro bhavissantī’ti.",
    "mn85:44": "Atha khvāhaṁ, rājakumāra, brahmuno ca ajjhesanaṁ viditvā sattesu ca kāruññataṁ paṭicca buddhacakkhunā lokaṁ volokesiṁ. Addasaṁ kho ahaṁ, rājakumāra, buddhacakkhunā lokaṁ volokento satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye appekacceparalokavajjabhayadassāvineviharante, appekacce na paralokavajjabhayadassāvine viharante. Seyyathāpi nāma uppaliniyaṁ vā paduminiyaṁ vā puṇḍarīkiniyaṁ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṁvaḍḍhāni udakānuggatāni antonimuggaposīni, appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṁvaḍḍhāni udakānuggatāni samodakaṁ ṭhitāni, appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṁvaḍḍhāni udakā accuggammaṭhitānianupalittāni udakena; evameva kho ahaṁ, rājakumāra; buddhacakkhunā lokaṁ volokento addasaṁ satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye, appekacce paralokavajjabhayadassāvine viharante, appekacce na paralokavajjabhayadassāvine viharante. Atha khvāhaṁ, rājakumāra, brahmānaṁ sahampatiṁ gāthāya paccabhāsiṁ:",
    "mn85:45": "‘Apārutā tesaṁ amatassa dvārā,Ye sotavanto pamuñcantu saddhaṁ;Vihiṁsasaññī paguṇaṁ na bhāsiṁ,Dhammaṁ paṇītaṁ manujesu brahme’ti.",
    "mn85:46": "Atha kho, rājakumāra, brahmā sahampati ‘katāvakāso khomhi bhagavatā dhammadesanāyā’ti maṁ abhivādetvā padakkhiṇaṁ katvā tatthevantaradhāyi.",
    "mn85:47": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘kassa nu kho ahaṁ paṭhamaṁ dhammaṁ deseyyaṁ? Ko imaṁ dhammaṁ khippameva ājānissatī’ti? Tassa mayhaṁ, rājakumāra, etadahosi: ‘Ayaṁ kho āḷāro kālāmo paṇḍito viyatto medhāvī dīgharattaṁ apparajakkhajātiko. Yannūnāhaṁ āḷārassa kālāmassa paṭhamaṁ dhammaṁ deseyyaṁ; so imaṁ dhammaṁ khippameva ājānissatī’ti. Atha kho maṁ, rājakumāra, devatā upasaṅkamitvā etadavoca: ‘sattāhakālaṅkato, bhante, āḷāro kālāmo’ti. Ñāṇañca pana me dassanaṁ udapādi: ‘sattāhakālaṅkato āḷāro kālāmo’ti. Tassa mayhaṁ, rājakumāra, etadahosi: ‘mahājāniyo kho āḷāro kālāmo. Sace hi so imaṁ dhammaṁ suṇeyya, khippameva ājāneyyā’ti.",
    "mn85:48": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘kassa nu kho ahaṁ paṭhamaṁ dhammaṁ deseyyaṁ? Ko imaṁ dhammaṁ khippameva ājānissatī’ti? Tassa mayhaṁ, rājakumāra, etadahosi: ‘Ayaṁ kho udako rāmaputto paṇḍito viyatto medhāvī dīgharattaṁ apparajakkhajātiko. Yannūnāhaṁ udakassa rāmaputtassa paṭhamaṁ dhammaṁ deseyyaṁ; so imaṁ dhammaṁ khippameva ājānissatī’ti. Atha kho maṁ, rājakumāra, devatā upasaṅkamitvā etadavoca: ‘abhidosakālaṅkato, bhante, udako rāmaputto’ti. Ñāṇañca pana me dassanaṁ udapādi: ‘abhidosakālaṅkato udako rāmaputto’ti. Tassa mayhaṁ, rājakumāra, etadahosi: ‘mahājāniyo kho udako rāmaputto. Sace hi so imaṁ dhammaṁ suṇeyya, khippameva ājāneyyā’ti.",
    "mn85:49": "Tassa mayhaṁ, rājakumāra, etadahosi: ‘kassa nu kho ahaṁ paṭhamaṁ dhammaṁ deseyyaṁ? Ko imaṁ dhammaṁ khippameva ājānissatī’ti? Tassa mayhaṁ, rājakumāra, etadahosi: ‘bahukārā kho me pañcavaggiyā bhikkhū ye maṁ padhānapahitattaṁ upaṭṭhahiṁsu. Yannūnāhaṁ pañcavaggiyānaṁ bhikkhūnaṁ paṭhamaṁ dhammaṁ deseyyan’ti. Tassa mayhaṁ, rājakumāra, etadahosi: ‘kahaṁ nu kho etarahi pañcavaggiyā bhikkhū viharantī’ti. Addasaṁ khvāhaṁ, rājakumāra, dibbena cakkhunā visuddhena atikkantamānusakena pañcavaggiye bhikkhū bārāṇasiyaṁ viharante isipatane migadāye.",
    "mn85:50": "Addasā kho maṁ, rājakumāra, upako ājīvako antarā ca gayaṁ antarā ca bodhiṁ addhānamaggappaṭipannaṁ. Disvāna maṁ etadavoca: ‘vippasannāni kho te, āvuso, indriyāni, parisuddho chavivaṇṇo pariyodāto. Kaṁsi tvaṁ, āvuso, uddissa pabbajito? Ko vā te satthā? Kassa vā tvaṁ dhammaṁ rocesī’ti? Evaṁ vutte, ahaṁ, rājakumāra, upakaṁ ājīvakaṁ gāthāhi ajjhabhāsiṁ:",
    "mn85:51": "‘Sabbābhibhū sabbavidūhamasmi,Sabbesu dhammesu anūpalitto;Sabbañjaho taṇhākkhaye vimutto,Sayaṁ abhiññāya kamuddiseyyaṁ.",
    "mn85:52": "Na me ācariyo atthi,sadiso me na vijjati;Sadevakasmiṁ lokasmiṁ,natthi me paṭipuggalo.",
    "mn85:53": "Ahañhi arahā loke,ahaṁ satthā anuttaro;Ekomhi sammāsambuddho,sītibhūtosmi nibbuto.",
    "mn85:54": "Dhammacakkaṁ pavattetuṁ,Gacchāmi kāsinaṁ puraṁ;Andhībhūtasmiṁlokasmiṁ,Āhañchaṁamatadundubhin’ti.",
    "mn85:55": "‘Yathā kho tvaṁ, āvuso, paṭijānāsi arahasi anantajino’ti.",
    "mn85:56": "‘Mādisā ve jinā honti,ye pattā āsavakkhayaṁ;Jitā me pāpakā dhammā,tasmāhamupakajino’ti.",
    "mn85:57": "Evaṁ vutte, rājakumāra, upako ājīvako ‘hupeyyapāvuso’tivatvā sīsaṁ okampetvā ummaggaṁ gahetvā pakkāmi.",
    "mn85:58": "Atha khvāhaṁ, rājakumāra, anupubbena cārikaṁ caramāno yena bārāṇasī isipatanaṁ migadāyo yena pañcavaggiyā bhikkhū tenupasaṅkamiṁ. Addasaṁsu kho maṁ, rājakumāra, pañcavaggiyā bhikkhū dūratova āgacchantaṁ. Disvāna aññamaññaṁ saṇṭhapesuṁ: ‘Ayaṁ kho, āvuso, samaṇo gotamo āgacchati bāhulliko padhānavibbhanto āvatto bāhullāya. So neva abhivādetabbo, na paccuṭṭhātabbo, nāssa pattacīvaraṁ paṭiggahetabbaṁ; api ca kho āsanaṁ ṭhapetabbaṁ — sace so ākaṅkhīssati nisīdissatī’ti. Yathā yathā kho ahaṁ, rājakumāra, pañcavaggiye bhikkhūupasaṅkamiṁtathā tathā pañcavaggiyā bhikkhū nāsakkhiṁsu sakāya katikāya saṇṭhātuṁ. Appekacce maṁ paccuggantvā pattacīvaraṁ paṭiggahesuṁ. Appekacce āsanaṁ paññapesuṁ. Appekacce pādodakaṁ upaṭṭhapesuṁ. Api ca kho maṁ nāmena ca āvusovādena ca samudācaranti.",
    "mn85:59": "Dutiyampi kho, rājakumāra, pañcavaggiyā bhikkhū maṁ etadavocuṁ: ‘tāyapi kho tvaṁ, āvuso gotama, iriyāya tāya paṭipadāya tāya dukkarakārikāya nājjhagamā uttari manussadhammā alamariyañāṇadassanavisesaṁ; kiṁ pana tvaṁ etarahi bāhulliko padhānavibbhanto āvatto bāhullāya adhigamissasi uttari manussadhammā alamariyañāṇadassanavisesan’ti? Dutiyampi kho ahaṁ, rājakumāra, pañcavaggiye bhikkhū etadavocaṁ: ‘na, bhikkhave, tathāgato bāhulliko na padhānavibbhanto na āvatto bāhullāya. Arahaṁ, bhikkhave, tathāgato sammāsambuddho. Odahatha, bhikkhave, sotaṁ. Amatamadhigataṁ ahamanusāsāmi, ahaṁ dhammaṁ desemi. Yathānusiṭṭhaṁ tathā paṭipajjamānā nacirasseva — yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ — brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā’ti.",
    "mn85:60": "Tatiyampi kho, rājakumāra, pañcavaggiyā bhikkhū maṁ etadavocuṁ: ‘tāyapi kho tvaṁ, āvuso gotama, iriyāya tāya paṭipadāya tāya dukkarakārikāya nājjhagamā uttari manussadhammā alamariyañāṇadassanavisesaṁ; kiṁ pana tvaṁ etarahi bāhulliko padhānavibbhanto āvatto bāhullāya adhigamissasi uttari manussadhammā alamariyañāṇadassanavisesan’ti?",
    "mn85:61": "Evaṁ vutte, ahaṁ, rājakumāra, pañcavaggiye bhikkhū etadavocaṁ: ‘abhijānātha me no tumhe, bhikkhave, ito pubbe evarūpaṁpabhāvitametan’ti? ‘No hetaṁ, bhante’. ‘Arahaṁ, bhikkhave, tathāgato sammāsambuddho. Odahatha, bhikkhave, sotaṁ. Amatamadhigataṁ ahamanusāsāmi, ahaṁ dhammaṁ desemi. Yathānusiṭṭhaṁ tathā paṭipajjamānā nacirasseva — yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ — brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā’ti.",
    "mn85:62": "Asakkhiṁ kho ahaṁ, rājakumāra, pañcavaggiye bhikkhū saññāpetuṁ. Dvepi sudaṁ, rājakumāra, bhikkhū ovadāmi. Tayo bhikkhū piṇḍāya caranti. Yaṁ tayo bhikkhū piṇḍāya caritvā āharanti, tenachabbaggiyāyāpema. Tayopi sudaṁ, rājakumāra, bhikkhū ovadāmi, dve bhikkhū piṇḍāya caranti. Yaṁ dve bhikkhū piṇḍāya caritvā āharanti tena chabbaggiyā yāpema.",
    "mn85:63": "Atha kho, rājakumāra, pañcavaggiyā bhikkhū mayā evaṁ ovadiyamānā evaṁ anusāsiyamānā nacirasseva — yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ — brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihariṁsū\"ti.",
    "mn85:64": "Evaṁ vutte, bodhi rājakumāro bhagavantaṁ etadavoca: \"kīva cirena nu kho, bhante, bhikkhu tathāgataṁvināyakaṁlabhamāno — yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ — brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihareyyā\"ti?",
    "mn85:65": "\"Tena hi, rājakumāra, taṁyevettha paṭipucchissāmi. Yathā te khameyya, tathā naṁ byākareyyāsi. Taṁ kiṁ maññasi, rājakumāra, kusalo tvaṁhatthārūḷheaṅkusagayhesippe\"ti?",
    "mn85:66": "\"Taṁ kiṁ maññasi, rājakumāra, idha puriso āgaccheyya: ‘bodhi rājakumāro hatthārūḷhaṁ aṅkusagayhaṁ sippaṁ jānāti; tassāhaṁ santike hatthārūḷhaṁ aṅkusagayhaṁ sippaṁ sikkhissāmī’ti. So cassa assaddho; yāvatakaṁ saddhena pattabbaṁ taṁ na sampāpuṇeyya. So cassa bahvābādho; yāvatakaṁ appābādhena pattabbaṁ taṁ na sampāpuṇeyya. So cassa saṭho māyāvī; yāvatakaṁ asaṭhena amāyāvinā pattabbaṁ taṁ na sampāpuṇeyya. So cassa kusīto; yāvatakaṁ āraddhavīriyena pattabbaṁ taṁ na sampāpuṇeyya. So cassa duppañño; yāvatakaṁ paññavatā pattabbaṁ taṁ na sampāpuṇeyya. Taṁ kiṁ maññasi, rājakumāra, api nu so puriso tava santike hatthārūḷhaṁ aṅkusagayhaṁ sippaṁ sikkheyyā\"ti?",
    "mn85:67": "\"Taṁ kiṁ maññasi, rājakumāra, idha puriso āgaccheyya: ‘bodhi rājakumāro hatthārūḷhaṁ aṅkusagayhaṁ sippaṁ jānāti; tassāhaṁ santike hatthārūḷhaṁ aṅkusagayhaṁ sippaṁ sikkhissāmī’ti. So cassa saddho; yāvatakaṁ saddhena pattabbaṁ taṁ sampāpuṇeyya. So cassa appābādho; yāvatakaṁ appābādhena pattabbaṁ taṁ sampāpuṇeyya. So cassa asaṭho amāyāvī; yāvatakaṁ asaṭhena amāyāvinā pattabbaṁ taṁ sampāpuṇeyya. So cassa āraddhavīriyo; yāvatakaṁ āraddhavīriyena pattabbaṁ taṁ sampāpuṇeyya. So cassa paññavā; yāvatakaṁ paññavatā pattabbaṁ taṁ sampāpuṇeyya. Taṁ kiṁ maññasi, rājakumāra, api nu so puriso tava santike hatthārūḷhaṁ aṅkusagayhaṁ sippaṁ sikkheyyā\"ti?",
    "mn85:68": "\"Evameva kho, rājakumāra, pañcimāni padhāniyaṅgāni. Katamāni pañca? Idha, rājakumāra, bhikkhu saddho hoti; saddahati tathāgatassa bodhiṁ: ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti;",
    "mn85:69": "Imehi, rājakumāra, pañcahi padhāniyaṅgehi samannāgato bhikkhu tathāgataṁ vināyakaṁ labhamāno — yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ — brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihareyya satta vassāni.",
    "mn85:70": "Evaṁ vutte, sañjikāputto māṇavo bodhiṁ rājakumāraṁ etadavoca: \"evameva panāyaṁ bhavaṁ bodhi: ‘aho buddho, aho dhammo, aho dhammassa svākkhātatā’ti cavadeti; atha ca pana na taṁ bhavantaṁ gotamaṁ saraṇaṁ gacchati dhammañca bhikkhusaṁghañcā\"ti."
}