{
    "mn88:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn88:2": "Atha kho rājā pasenadi kosalo aññataraṁ purisaṁ āmantesi: \"ehi tvaṁ, ambho purisa, yenāyasmā ānando tenupasaṅkama; upasaṅkamitvā mama vacanena āyasmato ānandassa pāde sirasā vandāhi: ‘rājā, bhante, pasenadi kosalo āyasmato ānandassa pāde sirasā vandatī’ti; evañca vadehi: ‘sace kira, bhante, āyasmato ānandassa na kiñci accāyikaṁ karaṇīyaṁ, āgametu kira, bhante, āyasmā ānando muhuttaṁ anukampaṁ upādāyā’\"ti.",
    "mn88:3": "Atha kho rājā pasenadi kosalo yāvatikā nāgassa bhūmi nāgena gantvā nāgā paccorohitvā pattikova yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṁ ānandaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho rājā pasenadi kosalo āyasmantaṁ ānandaṁ etadavoca: \"Sace, bhante, āyasmato ānandassa na kiñci accāyikaṁ karaṇīyaṁ, sādhu, bhante, āyasmā ānando yena aciravatiyā nadiyā tīraṁ tenupasaṅkamatu anukampaṁ upādāyā\"ti.",
    "mn88:4": "Atha kho āyasmā ānando yena aciravatiyā nadiyā tīraṁ tenupasaṅkami; upasaṅkamitvā aññatarasmiṁ rukkhamūle paññatte āsane nisīdi. Atha kho rājā pasenadi kosalo yāvatikā nāgassa bhūmi nāgena gantvā nāgā paccorohitvā pattikova yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṁ ānandaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho rājā pasenadi kosalo āyasmantaṁ ānandaṁ etadavoca: \"idha, bhante, āyasmā ānando hatthatthare nisīdatū\"ti.",
    "mn88:5": "\"Kiṁ pana, bhante ānanda, so bhagavā tathārūpaṁ vacīsamācāraṁ … pe … manosamācāraṁ samācareyya, yvāssa manosamācāro opārambho samaṇehibrāhmaṇehī\"ti?",
    "mn88:6": "\"Acchariyaṁ, bhante, abbhutaṁ, bhante. Yañhi mayaṁ, bhante, nāsakkhimhā pañhena paripūretuṁ taṁ, bhante, āyasmatā ānandena pañhassa veyyākaraṇena paripūritaṁ. Ye te, bhante, bālā abyattā ananuvicca apariyogāhetvā paresaṁ vaṇṇaṁ vā avaṇṇaṁ vā bhāsanti, na mayaṁ taṁ sārato paccāgacchāma; yepanate, bhante, paṇḍitāviyattāmedhāvino anuvicca pariyogāhetvā paresaṁ vaṇṇaṁ vā avaṇṇaṁ vā bhāsanti, mayaṁ taṁ sārato paccāgacchāma.",
    "mn88:7": "Katamo pana, bhante ānanda, kāyasamācāro opārambho samaṇehi brāhmaṇehi viññūhī\"ti?",
    "mn88:8": "\"Katamo pana, bhante, kāyasamācāro akusalo\"?",
    "mn88:9": "\"Katamo pana, bhante, kāyasamācāro sāvajjo\"?",
    "mn88:10": "\"Katamo pana, bhante, kāyasamācāro sabyābajjho\"?",
    "mn88:11": "\"Katamo pana, bhante, kāyasamācāro dukkhavipāko\"?",
    "mn88:12": "\"Katamo pana, bhante ānanda, vacīsamācāro … pe … manosamācāro opārambho samaṇehi brāhmaṇehi viññūhī\"ti?",
    "mn88:13": "\"Katamo pana, bhante, manosamācāro akusalo\"?",
    "mn88:14": "\"Katamo pana, bhante, manosamācāro sāvajjo\"?",
    "mn88:15": "\"Katamo pana, bhante, manosamācāro sabyābajjho\"?",
    "mn88:16": "\"Katamo pana, bhante, manosamācāro dukkhavipāko\"?",
    "mn88:17": "\"Kiṁ nu kho, bhante ānanda, so bhagavā sabbesaṁyeva akusalānaṁ dhammānaṁ pahānaṁ vaṇṇetī\"ti? \"Sabbākusaladhammapahīno kho, mahārāja, tathāgato kusaladhammasamannāgato\"ti.",
    "mn88:18": "\"Katamo pana, bhante ānanda, kāyasamācāro anopārambho samaṇehi brāhmaṇehi viññūhī\"ti?",
    "mn88:19": "\"Katamo pana, bhante, kāyasamācāro kusalo\"?",
    "mn88:20": "\"Katamo pana, bhante, kāyasamācāro anavajjo\"?",
    "mn88:21": "\"Katamo pana, bhante, kāyasamācāro abyābajjho\"?",
    "mn88:22": "\"Katamo pana, bhante, kāyasamācāro sukhavipāko\"?",
    "mn88:23": "\"Katamo pana, bhante ānanda, vacīsamācāro … pe … manosamācāro anopārambho samaṇehi brāhmaṇehi viññūhī\"ti?",
    "mn88:24": "\"Katamo pana, bhante, manosamācāro kusalo\"?",
    "mn88:25": "\"Katamo pana, bhante, manosamācāro anavajjo\"?",
    "mn88:26": "\"Katamo pana, bhante, manosamācāro abyābajjho\"?",
    "mn88:27": "\"Katamo pana, bhante, manosamācāro sukhavipāko\"?",
    "mn88:28": "\"Kiṁ pana, bhante ānanda, so bhagavā sabbesaṁyeva kusalānaṁ dhammānaṁ upasampadaṁ vaṇṇetī\"ti? \"Sabbākusaladhammapahīno kho, mahārāja, tathāgato kusaladhammasamannāgato\"ti.",
    "mn88:29": "\"Acchariyaṁ, bhante, abbhutaṁ, bhante. Yāvasubhāsitañcidaṁ, bhante, āyasmatā ānandena. Iminā ca mayaṁ, bhante, āyasmato ānandassa subhāsitena attamanābhiraddhā. Evaṁ attamanābhiraddhā ca mayaṁ, bhante, āyasmato ānandassa subhāsitena. Sace, bhante, āyasmato ānandassa hatthiratanaṁ kappeyya, hatthiratanampi mayaṁ āyasmato ānandassa dadeyyāma. Sace, bhante, āyasmato ānandassa assaratanaṁ kappeyya, assaratanampi mayaṁ āyasmato ānandassa dadeyyāma. Sace, bhante, āyasmato ānandassa gāmavaraṁ kappeyya, gāmavarampi mayaṁ āyasmato ānandassa dadeyyāma. Api ca, bhante,mayampetaṁjānāma: ‘netaṁ āyasmato ānandassa kappatī’ti. Ayaṁ me, bhante, bāhitikā raññā māgadhena ajātasattunā vedehiputtenavatthanāḷiyāpakkhipitvā pahitā soḷasasamā āyāmena, aṭṭhasamā vitthārena. Taṁ, bhante, āyasmā ānando paṭiggaṇhātu anukampaṁ upādāyā\"ti.",
    "mn88:30": "\"Ayaṁ, bhante, aciravatī nadī diṭṭhā āyasmatā ceva ānandena amhehi ca. Yadā uparipabbate mahāmegho abhippavuṭṭho hoti, athāyaṁ aciravatī nadī ubhato kūlāni saṁvissandantī gacchati; evameva kho, bhante, āyasmā ānando imāya bāhitikāya attano ticīvaraṁ karissati. Yaṁ panāyasmato ānandassa purāṇaṁ ticīvaraṁ taṁ sabrahmacārīhi saṁvibhajissati. Evāyaṁ amhākaṁ dakkhiṇā saṁvissandantī maññe gamissati. Paṭiggaṇhātu, bhante, āyasmā ānando bāhitikan\"ti.",
    "mn88:31": "Atha kho rājā pasenadi kosalo āyasmantaṁ ānandaṁ etadavoca: \"handa ca dāni mayaṁ, bhante ānanda, gacchāma; bahukiccā mayaṁ bahukaraṇīyā\"ti.",
    "mn88:32": "Atha kho āyasmā ānando acirapakkantassa rañño pasenadissa kosalassa yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando yāvatako ahosi raññā pasenadinā kosalena saddhiṁ kathāsallāpo taṁ sabbaṁ bhagavato ārocesi. Tañca bāhitikaṁ bhagavato pādāsi.",
    "mn88:33": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}