{
    "mn90:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavāuruññāyaṁviharati kaṇṇakatthale migadāye.",
    "mn90:2": "Assosuṁ kho somā ca bhaginī sakulā ca bhaginī: \"ajja kira rājā pasenadi kosalo pacchābhattaṁ bhuttapātarāso bhagavantaṁ dassanāya upasaṅkamissatī\"ti.",
    "mn90:3": "Atha kho rājā pasenadi kosalo pacchābhattaṁ bhuttapātarāso yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho rājā pasenadi kosalo bhagavantaṁ etadavoca: \"somā ca, bhante, bhaginī sakulā ca bhaginī bhagavato pāde sirasāvandati, appābādhaṁ appātaṅkaṁ lahuṭṭhānaṁ balaṁ phāsuvihāraṁpucchatī\"ti.",
    "mn90:4": "Atha kho rājā pasenadi kosalo bhagavantaṁ etadavoca: \"sutaṁ metaṁ, bhante, samaṇo gotamo evamāha: ‘Natthi so samaṇo vā brāhmaṇo vā yo sabbaññū sabbadassāvī aparisesaṁ ñāṇadassanaṁ paṭijānissati, netaṁ ṭhānaṁ vijjatī’ti. Ye te, bhante, evamāhaṁsu: ‘samaṇo gotamo evamāha — natthi so samaṇo vā brāhmaṇo vā yo sabbaññū sabbadassāvī aparisesaṁ ñāṇadassanaṁ paṭijānissati, netaṁ ṭhānaṁ vijjatī’ti; kacci te, bhante, bhagavato vuttavādino, na ca bhagavantaṁ abhūtena abbhācikkhanti, dhammassa cānudhammaṁ byākaronti, na ca koci sahadhammiko vādānuvādo gārayhaṁ ṭhānaṁ āgacchatī\"ti?",
    "mn90:5": "Atha kho rājā pasenadi kosalo viṭaṭūbhaṁ senāpatiṁ āmantesi: \"ko nu kho, senāpati, imaṁ kathāvatthuṁ rājantepure abbhudāhāsī\"ti? \"Sañjayo, mahārāja, brāhmaṇo ākāsagotto\"ti.",
    "mn90:6": "\"Pañcimāni, mahārāja, padhāniyaṅgāni. Katamāni pañca? Idha, mahārāja, bhikkhu saddho hoti, saddahati tathāgatassa bodhiṁ: ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti; appābādho hoti appātaṅko samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya majjhimāya padhānakkhamāya; asaṭho hoti amāyāvī yathābhūtaṁ attānaṁ āvikattā satthari vā viññūsu vā sabrahmacārīsu; āraddhavīriyo viharati akusalānaṁ dhammānaṁ pahānāya, kusalānaṁ dhammānaṁ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu; paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammādukkhakkhayagāminiyā — imāni kho, mahārāja, pañca padhāniyaṅgāni.",
    "mn90:7": "\"Heturūpaṁ, bhante, bhagavā āha; saheturūpaṁ, bhante, bhagavā āha.",
    "mn90:8": "Evaṁ vutte, viṭaṭūbho senāpati bhagavantaṁ etadavoca: \"ye te, bhante, devā sabyābajjhā āgantāro itthattaṁ te devā, ye te devā abyābajjhā anāgantāro itthattaṁ te deve tamhā ṭhānā cāvessanti vā pabbājessanti vā\"ti?",
    "mn90:9": "Atha kho āyasmato ānandassa etadahosi: \"Ayaṁ kho viṭaṭūbho senāpati rañño pasenadissa kosalassa putto; ahaṁ bhagavato putto. Ayaṁ kho kālo yaṁ putto puttena manteyyā\"ti. Atha kho āyasmā ānando viṭaṭūbhaṁ senāpatiṁ āmantesi: \"Tena hi, senāpati, taññevettha paṭipucchissāmi; yathā te khameyya tathā naṁ byākareyyāsi. Taṁ kiṁ maññasi, senāpati, yāvatā rañño pasenadissa kosalassa vijitaṁ yattha ca rājā pasenadi kosalo issariyādhipaccaṁ rajjaṁ kāreti, pahoti tattha rājā pasenadi kosalo samaṇaṁ vā brāhmaṇaṁ vā puññavantaṁ vā apuññavantaṁ vā brahmacariyavantaṁ vā abrahmacariyavantaṁ vā tamhā ṭhānā cāvetuṁ vā pabbājetuṁ vā\"ti?",
    "mn90:10": "\"Taṁ kiṁ maññasi, senāpati, yāvatā rañño pasenadissa kosalassa avijitaṁ yattha ca rājā pasenadi kosalo na issariyādhipaccaṁ rajjaṁ kāreti, tattha pahoti rājā pasenadi kosalo samaṇaṁ vā brāhmaṇaṁ vā puññavantaṁ vā apuññavantaṁ vā brahmacariyavantaṁ vā abrahmacariyavantaṁ vā tamhā ṭhānā cāvetuṁ vā pabbājetuṁ vā\"ti?",
    "mn90:11": "\"Taṁ kiṁ maññasi, senāpati, sutā te devā tāvatiṁsā\"ti?",
    "mn90:12": "Atha kho rājā pasenadi kosalo bhagavantaṁ etadavoca: \"konāmo ayaṁ, bhante, bhikkhū\"ti?",
    "mn90:13": "Atha kho rājā pasenadi kosalo bhagavantaṁ etadavoca: \"sabbaññutaṁ mayaṁ, bhante, bhagavantaṁ apucchimhā, sabbaññutaṁ bhagavā byākāsi; tañca panamhākaṁ ruccati ceva khamati ca, tena camhā attamanā. Cātuvaṇṇisuddhiṁ mayaṁ, bhante, bhagavantaṁ apucchimhā, cātuvaṇṇisuddhiṁ bhagavā byākāsi; tañca panamhākaṁ ruccati ceva khamati ca, tena camhā attamanā. Adhideve mayaṁ, bhante, bhagavantaṁ apucchimhā, adhideve bhagavā byākāsi; tañca panamhākaṁ ruccati ceva khamati ca, tena camhā attamanā. Adhibrahmānaṁ mayaṁ, bhante, bhagavantaṁ apucchimhā, adhibrahmānaṁ bhagavā byākāsi; tañca panamhākaṁ ruccati ceva khamati ca, tena camhā attamanā. Yaṁ yadeva ca mayaṁ bhagavantaṁ apucchimhā taṁ tadeva bhagavā byākāsi; tañca panamhākaṁ ruccati ceva khamati ca, tena camhā attamanā. Handa ca dāni mayaṁ, bhante, gacchāma; bahukiccā mayaṁ bahukaraṇīyā\"ti.",
    "mn90:14": "Ghaṭikāro raṭṭhapālo,maghadevo madhuriyaṁ;Bodhi aṅgulimālo ca,piyajātaṁ bāhitikaṁ;Dhammacetiyasuttañca,dasamaṁ kaṇṇakatthalaṁ."
}