{
    "mn91:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā videhesu cārikaṁ carati mahatā bhikkhusaṁghena saddhiṁ pañcamattehi bhikkhusatehi.",
    "mn91:2": "Tena kho pana samayena brahmāyussa brāhmaṇassa uttaro nāma māṇavo antevāsī hoti tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ, padako, veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayo. Atha kho brahmāyu brāhmaṇo uttaraṁ māṇavaṁ āmantesi: \"Ayaṁ, tāta uttara, samaṇo gotamo sakyaputto sakyakulā pabbajito videhesu cārikaṁ carati mahatā bhikkhusaṁghena saddhiṁ pañcamattehi bhikkhusatehi. Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ‘itipi so bhagavā arahaṁ sammāsambuddho … pe … sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī’ti. Ehi tvaṁ, tāta uttara, yena samaṇo gotamo tenupasaṅkama; upasaṅkamitvā samaṇaṁ gotamaṁ jānāhi, yadi vā taṁ bhavantaṁ gotamaṁ tathā santaṁyeva saddo abbhuggato, yadi vā no tathā; yadi vā so bhavaṁ gotamo tādiso, yadi vā na tādiso. Tathā mayaṁ taṁ bhavantaṁ gotamaṁ vedissāmā\"ti.",
    "mn91:3": "\"Evaṁ, bho\"ti kho uttaro māṇavo brahmāyussa brāhmaṇassa paṭissutvā uṭṭhāyāsanā brahmāyuṁ brāhmaṇaṁ abhivādetvā padakkhiṇaṁ katvā videhesu yena bhagavā tena cārikaṁ pakkāmi. Anupubbena cārikaṁ caramāno yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho uttaro māṇavo bhagavato kāye dvattiṁsamahāpurisalakkhaṇāni samannesi. Addasā kho uttaro māṇavo bhagavato kāye dvattiṁsamahāpurisalakkhaṇāni, yebhuyyena thapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati –  kosohite ca vatthaguyhe pahūtajivhatāya ca.",
    "mn91:4": "Atha kho uttaro māṇavo sattannaṁ māsānaṁ accayena videhesu yena mithilā tena cārikaṁ pakkāmi. Anupubbena cārikaṁ caramāno yena mithilā yena brahmāyu brāhmaṇo tenupasaṅkami; upasaṅkamitvā brahmāyuṁ brāhmaṇaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho uttaraṁ māṇavaṁ brahmāyu brāhmaṇo etadavoca: \"Kacci, tāta uttara, taṁ bhavantaṁ gotamaṁ tathā santaṁyeva saddo abbhuggato, no aññathā? Kacci pana so bhavaṁ gotamo tādiso, no aññādiso\"ti?",
    "mn91:5": "Suppatiṭṭhitapādo kho pana bho bhavaṁ gotamo; idampi tassa bhoto gotamassa mahāpurisassa mahāpurisalakkhaṇaṁ bhavati.(1)",
    "mn91:6": "Heṭṭhā kho pana tassa bhoto gotamassa pādatalesu cakkāni jātāni sahassārāni sanemikāni sanābhikāni sabbākāraparipūrāni …(2)",
    "mn91:7": "Āyatapaṇhi kho pana so bhavaṁ gotamo …(3)",
    "mn91:8": "Dīghaṅguli kho pana so bhavaṁ gotamo …(4)",
    "mn91:9": "Mudutalunahatthapādo kho pana so bhavaṁ gotamo …(5)",
    "mn91:10": "Jālahatthapādo kho pana so bhavaṁ gotamo …(6)",
    "mn91:11": "Ussaṅkhapādo kho pana so bhavaṁ gotamo …(7)",
    "mn91:12": "Eṇijaṅgho kho pana so bhavaṁ gotamo …(8)",
    "mn91:13": "Ṭhitako kho pana so bhavaṁ gotamo anonamanto ubhohi pāṇitalehi jaṇṇukāni parimasati parimajjati …(9)",
    "mn91:14": "Kosohitavatthaguyho kho pana so bhavaṁ gotamo …(10)",
    "mn91:15": "Suvaṇṇavaṇṇo kho pana so bhavaṁ gotamo kañcanasannibhattaco …(11)",
    "mn91:16": "Sukhumacchavi kho pana so bhavaṁ gotamo. Sukhumattā chaviyā rajojallaṁ kāye na upalimpati …(12)",
    "mn91:17": "Ekekalomo kho pana so bhavaṁ gotamo; ekekāni lomāni lomakūpesu jātāni …(13)",
    "mn91:18": "Uddhaggalomo kho pana so bhavaṁ gotamo; uddhaggāni lomāni jātāni nīlāni añjanavaṇṇāni kuṇḍalāvaṭṭāni dakkhiṇāvaṭṭakajātāni …(14)",
    "mn91:19": "Brahmujugatto kho pana so bhavaṁ gotamo …(15)",
    "mn91:20": "Sattussado kho pana so bhavaṁ gotamo …(16)",
    "mn91:21": "Sīhapubbaddhakāyo kho pana so bhavaṁ gotamo …(17)",
    "mn91:22": "Citantaraṁso kho pana so bhavaṁ gotamo …(18)",
    "mn91:23": "Nigrodhaparimaṇḍalo kho pana so bhavaṁ gotamo; yāvatakvassa kāyo tāvatakvassa byāmo, yāvatakvassa byāmo tāvatakvassa kāyo …(19)",
    "mn91:24": "Samavaṭṭakkhandho kho pana so bhavaṁ gotamo …(20)",
    "mn91:25": "Rasaggasaggī kho pana so bhavaṁ gotamo …(21)",
    "mn91:26": "Sīhahanu kho pana so bhavaṁ gotamo …(22)",
    "mn91:27": "Cattālīsadanto kho pana so bhavaṁ gotamo …(23)",
    "mn91:28": "Samadanto kho pana so bhavaṁ gotamo …(24)",
    "mn91:29": "Aviraḷadanto kho pana so bhavaṁ gotamo …(25)",
    "mn91:30": "Susukkadāṭho kho pana so bhavaṁ gotamo …(26)",
    "mn91:31": "Pahūtajivho kho pana so bhavaṁ gotamo …(27)",
    "mn91:32": "Brahmassaro kho pana so bhavaṁ gotamo karavikabhāṇī …(28)",
    "mn91:33": "Abhinīlanetto kho pana so bhavaṁ gotamo …(29)",
    "mn91:34": "Gopakhumo kho pana so bhavaṁ gotamo …(30)",
    "mn91:35": "Uṇṇā kho panassa bhoto gotamassa bhamukantare jātā odātā mudutūlasannibhā …(31)",
    "mn91:36": "Uṇhīsasīso kho pana so bhavaṁ gotamo; idampi tassa bhoto gotamassa mahāpurisassa mahāpurisalakkhaṇaṁ bhavati.(32)",
    "mn91:37": "Imehi kho, bho, so bhavaṁ gotamo dvattiṁsamahāpurisalakkhaṇehi samannāgato.",
    "mn91:38": "Gacchanto kho pana so bhavaṁ gotamo dakkhiṇeneva pādena paṭhamaṁ pakkamati. So nātidūre pādaṁ uddharati, nāccāsanne pādaṁ nikkhipati; so nātisīghaṁ gacchati, nātisaṇikaṁ gacchati; na ca adduvena adduvaṁ saṅghaṭṭento gacchati, na ca gopphakena gopphakaṁ saṅghaṭṭento gacchati. So gacchanto na satthiṁ unnāmeti, na satthiṁ onāmeti; na satthiṁ sannāmeti, na satthiṁ vināmeti. Gacchato kho pana tassa bhoto gotamassaadharakāyovaiñjati, na ca kāyabalena gacchati. Apalokento kho pana so bhavaṁ gotamo sabbakāyeneva apaloketi; so na uddhaṁ ulloketi, na adho oloketi; na ca vipekkhamāno gacchati, yugamattañca pekkhati; tato cassa uttari anāvaṭaṁ ñāṇadassanaṁ bhavati.",
    "mn91:39": "Aṭṭhaṅgasamannāgataṁkho pana so bhavaṁ gotamo āhāraṁ āhāreti — neva davāya, na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya, vihiṁsūparatiyā brahmacariyānuggahāya: ‘iti purāṇañca vedanaṁ paṭihaṅkhāmi navañca vedanaṁ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’ti.",
    "mn91:40": "Aṭṭhaṅgasamannāgato kho panassa bhoto gotamassa mukhato ghoso niccharati –  vissaṭṭho ca, viññeyyo ca, mañju ca, savanīyo ca, bindu ca, avisārī ca, gambhīro ca, ninnādī ca. Yathāparisaṁ kho pana so bhavaṁ gotamo sarena viññāpeti, na cassa bahiddhā parisāya ghoso niccharati. Te tena bhotā gotamena dhammiyā kathāya sandassitā samādapitā samuttejitā sampahaṁsitā uṭṭhāyāsanā pakkamantiavalokayamānāyevaavijahitattā. Addasāma kho mayaṁ, bho, taṁ bhavantaṁ gotamaṁ gacchantaṁ, addasāma ṭhitaṁ, addasāma antaragharaṁ pavisantaṁ, addasāma antaraghare nisinnaṁ tuṇhībhūtaṁ, addasāma antaraghare bhuñjantaṁ, addasāma bhuttāviṁ nisinnaṁ tuṇhībhūtaṁ, addasāma bhuttāviṁ anumodantaṁ, addasāma ārāmaṁ gacchantaṁ, addasāma ārāmagataṁ nisinnaṁ tuṇhībhūtaṁ, addasāma ārāmagataṁ parisati dhammaṁ desentaṁ. Ediso ca ediso ca so bhavaṁ gotamo, tato ca bhiyyo\"ti.",
    "mn91:41": "Evaṁ vutte, brahmāyu brāhmaṇo uṭṭhāyāsanā ekaṁsaṁ uttarāsaṅgaṁ karitvā yena bhagavā tenañjaliṁ paṇāmetvā tikkhattuṁ udānaṁ udāneti:",
    "mn91:42": "\"Namo tassa bhagavato arahato sammāsambuddhassa.",
    "mn91:43": "Namo tassa bhagavato arahato sammāsambuddhassa.",
    "mn91:44": "Namo tassa bhagavato arahato sammāsambuddhassāti.",
    "mn91:45": "Appeva nāma mayaṁ kadāci karahaci tena bhotā gotamena samāgaccheyyāma? Appeva nāma siyā kocideva kathāsallāpo\"ti.",
    "mn91:46": "Atha kho bhagavā videhesu anupubbena cārikaṁ caramāno yena mithilā tadavasari. Tatra sudaṁ bhagavā mithilāyaṁ viharati maghadevaambavane. Assosuṁ khomithileyyakābrāhmaṇagahapatikā: \"Samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito videhesu cārikaṁ caramāno mahatā bhikkhusaṁghena saddhiṁ pañcamattehi bhikkhusatehi mithilaṁ anuppatto, mithilāyaṁ viharati maghadevaambavane. Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. Sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī\"ti.",
    "mn91:47": "Atha kho mithileyyakā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā appekacce bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu; appekacce bhagavatā saddhiṁ sammodiṁsu, sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu; appekacce yena bhagavā tenañjaliṁ paṇāmetvā ekamantaṁ nisīdiṁsu; appekacce bhagavato santike nāmagottaṁ sāvetvā ekamantaṁ nisīdiṁsu; appekacce tuṇhībhūtā ekamantaṁ nisīdiṁsu.",
    "mn91:48": "Assosi kho brahmāyu brāhmaṇo: \"Samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito mithilaṁ anuppatto, mithilāyaṁ viharati maghadevaambavane\"ti.",
    "mn91:49": "\"Evaṁ, bho\"ti kho so māṇavako brahmāyussa brāhmaṇassa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho so māṇavako bhagavantaṁ etadavoca: \"brahmāyu, bho gotama, brāhmaṇo bhavantaṁ gotamaṁ appābādhaṁ appātaṅkaṁ lahuṭṭhānaṁ balaṁ phāsuvihāraṁ pucchati; evañca vadeti: ‘brahmāyu, bho gotama, brāhmaṇo jiṇṇo vuḍḍho mahallako addhagato vayoanuppatto, vīsavassasatiko jātiyā, tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ, padako, veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayo. Yāvatā, bho, brāhmaṇagahapatikā mithilāyaṁ paṭivasanti, brahmāyu tesaṁ brāhmaṇo aggamakkhāyati — yadidaṁ bhogehi; brahmāyu tesaṁ brāhmaṇo aggamakkhāyati — yadidaṁ mantehi; brahmāyu tesaṁ brāhmaṇo aggamakkhāyati — yadidaṁ āyunā ceva yasasā ca.",
    "mn91:50": "Atha kho brahmāyu brāhmaṇo yena bhagavā tenupasaṅkami. Addasā kho sā parisā brahmāyuṁ brāhmaṇaṁ dūratova āgacchantaṁ. Disvānaoramiyaokāsamakāsi yathā taṁ ñātassa yasassino. Atha kho brahmāyu brāhmaṇo taṁ parisaṁ etadavoca: \"Alaṁ, bho. Nisīdatha tumhe sake āsane. Idhāhaṁ samaṇassa gotamassa santike nisīdissāmī\"ti.",
    "mn91:51": "Atha kho brahmāyu brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho brahmāyu brāhmaṇo bhagavato kāye dvattiṁsamahāpurisalakkhaṇāni samannesi. Addasā kho brahmāyu brāhmaṇo bhagavato kāye dvattiṁsamahāpurisalakkhaṇāni, yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati — kosohite ca vatthaguyhe pahūtajivhatāya ca. Atha kho brahmāyu brāhmaṇo bhagavantaṁ gāthāhi ajjhabhāsi:",
    "mn91:56": "Atha kho bhagavato etadahosi: \"passati kho me ayaṁ brahmāyu brāhmaṇo dvattiṁsamahāpurisalakkhaṇāni, yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati –  kosohite ca vatthaguyhe pahūtajivhatāya cā\"ti.",
    "mn91:57": "\"Ye te dvattiṁsāti sutā,mahāpurisalakkhaṇā;Sabbe te mama kāyasmiṁ,mātekaṅkhāhu brāhmaṇa.",
    "mn91:58": "Abhiññeyyaṁ abhiññātaṁ,bhāvetabbañca bhāvitaṁ;Pahātabbaṁ pahīnaṁ me,tasmā buddhosmi brāhmaṇa.",
    "mn91:59": "Diṭṭhadhammahitatthāya,samparāyasukhāya ca;Katāvakāso pucchassu,yaṁ kiñci abhipatthitan\"ti.",
    "mn91:60": "Atha kho brahmāyussa brāhmaṇassa etadahosi: \"katāvakāso khomhi samaṇena gotamena. Kiṁ nu kho ahaṁ samaṇaṁ gotamaṁ puccheyyaṁ: ‘diṭṭhadhammikaṁ vā atthaṁ samparāyikaṁ vā’\"ti. Atha kho brahmāyussa brāhmaṇassa etadahosi: \"kusalo kho ahaṁ diṭṭhadhammikānaṁ atthānaṁ. Aññepi maṁ diṭṭhadhammikaṁ atthaṁ pucchanti. Yannūnāhaṁ samaṇaṁ gotamaṁ samparāyikaṁyeva atthaṁ puccheyyan\"ti. Atha kho brahmāyu brāhmaṇo bhagavantaṁ gāthāhi ajjhabhāsi:",
    "mn91:61": "\"Kathaṁ kho brāhmaṇo hoti,kathaṁ bhavati vedagū;Tevijjo bho kathaṁ hoti,sotthiyo kinti vuccati.",
    "mn91:62": "Arahaṁ bho kathaṁ hoti,kathaṁ bhavati kevalī;Muni ca bho kathaṁ hoti,buddho kinti pavuccatī\"ti.",
    "mn91:63": "Atha kho bhagavā brahmāyuṁ brāhmaṇaṁ gāthāhi paccabhāsi:",
    "mn91:64": "\"Pubbenivāsaṁ yo vedi,saggāpāyañca passati;Atho jātikkhayaṁ patto,abhiññā vosito muni.",
    "mn91:65": "Cittaṁ visuddhaṁ jānāti,muttaṁ rāgehi sabbaso;Pahīnajātimaraṇo,brahmacariyassa kevalī;Pāragū sabbadhammānaṁ,buddho tādī pavuccatī\"ti.",
    "mn91:66": "Evaṁ vutte, brahmāyu brāhmaṇo uṭṭhāyāsanā ekaṁsaṁ uttarāsaṅgaṁ karitvā bhagavato pādesu sirasā nipatitvā bhagavato pādāni mukhena ca paricumbati, pāṇīhi ca parisambāhati, nāmañca sāveti: \"brahmāyu ahaṁ, bho gotama, brāhmaṇo; brahmāyu ahaṁ, bho gotama, brāhmaṇo\"ti.",
    "mn91:67": "Atha kho bhagavā brahmāyussa brāhmaṇassa anupubbiṁ kathaṁ kathesi, seyyathidaṁ — dānakathaṁ, sīlakathaṁ, saggakathaṁ; kāmānaṁ ādīnavaṁ okāraṁ saṅkilesaṁ nekkhamme ānisaṁsaṁ pakāsesi. Yadā bhagavā aññāsi brahmāyuṁ brāhmaṇaṁ kallacittaṁ muducittaṁ vinīvaraṇacittaṁ udaggacittaṁ pasannacittaṁ, atha yā buddhānaṁ sāmukkaṁsikā dhammadesanā taṁ pakāsesi — dukkhaṁ, samudayaṁ, nirodhaṁ, maggaṁ. Seyyathāpi nāma suddhaṁ vatthaṁ apagatakāḷakaṁ sammadeva rajanaṁ paṭiggaṇheyya; evameva brahmāyussa brāhmaṇassa tasmiṁyeva āsane virajaṁ vītamalaṁ dhammacakkhuṁ udapādi: \"yaṁ kiñci samudayadhammaṁ sabbaṁ taṁ nirodhadhamman\"ti.",
    "mn91:68": "Atha kho brahmāyu brāhmaṇo diṭṭhadhammo pattadhammo viditadhammo pariyogāḷhadhammo tiṇṇavicikiccho vigatakathaṅkatho vesārajjappatto aparappaccayo satthusāsane bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gataṁ. Adhivāsetu ca me bhavaṁ gotamo svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā\"ti.",
    "mn91:69": "Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena brahmāyussa brāhmaṇassa nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi saddhiṁ bhikkhusaṅghena. Atha kho brahmāyu brāhmaṇo sattāhaṁ buddhappamukhaṁ bhikkhusaṅghaṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. =",
    "mn91:70": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṁ abhinandunti."
}