{
    "mn92:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā aṅguttarāpesu cārikaṁ caramāno mahatā bhikkhusaṁghena saddhiṁ aḍḍhateḷasehi bhikkhusatehi yena āpaṇaṁ nāma aṅguttarāpānaṁ nigamo tadavasari.",
    "mn92:2": "Atha kho keṇiyo jaṭilo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho keṇiyaṁ jaṭilaṁ bhagavā dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṁsesi. Atha kho keṇiyo jaṭilo bhagavatā dhammiyā kathāya sandassito samādapito samuttejito sampahaṁsito bhagavantaṁ etadavoca: \"adhivāsetu me bhavaṁ gotamo svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā\"ti.",
    "mn92:3": "Dutiyampi kho keṇiyo jaṭilo bhagavantaṁ etadavoca: \"kiñcāpi kho, bho gotama, mahā bhikkhusaṅgho aḍḍhateḷasāni bhikkhusatāni, ahañca brāhmaṇesu abhippasanno; adhivāsetu me bhavaṁ gotamo svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā\"ti. Dutiyampi kho bhagavā keṇiyaṁ jaṭilaṁ etadavoca: \"mahā kho, keṇiya, bhikkhusaṅgho aḍḍhateḷasāni bhikkhusatāni, tvañca brāhmaṇesu abhippasanno\"ti.",
    "mn92:4": "Tatiyampi kho keṇiyo jaṭilo bhagavantaṁ etadavoca: \"kiñcāpi kho, bho gotama, mahā bhikkhusaṅgho aḍḍhateḷasāni bhikkhusatāni, ahañca brāhmaṇesu abhippasanno; adhivāsetu me bhavaṁ gotamo svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā\"ti. Adhivāsesi bhagavā tuṇhībhāvena.",
    "mn92:5": "Atha kho keṇiyo jaṭilo bhagavato adhivāsanaṁ viditvā uṭṭhāyāsanā yena sako assamo tenupasaṅkami; upasaṅkamitvā mittāmacce ñātisālohite āmantesi: \"suṇantu me bhonto, mittāmaccā ñātisālohitā; samaṇo me gotamo nimantito svātanāya bhattaṁ saddhiṁ bhikkhusaṁghena. Yena mekāyaveyyāvaṭikaṁkareyyāthā\"ti.",
    "mn92:6": "Tena kho pana samayena selo brāhmaṇo āpaṇe paṭivasati tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ, padako, veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayo, tīṇi ca māṇavakasatāni mante vāceti.",
    "mn92:7": "Tena kho pana samayena keṇiyo jaṭilo sele brāhmaṇe abhippasanno hoti. Atha kho selo brāhmaṇo tīhi māṇavakasatehi parivuto jaṅghāvihāraṁ anucaṅkamamāno anuvicaramāno yena keṇiyassa jaṭilassa assamo tenupasaṅkami. Addasā kho selo brāhmaṇo keṇiyassa jaṭilassa assame appekacce uddhanāni khaṇante, appekacce kaṭṭhāni phālente, appekacce bhājanāni dhovante, appekacce udakamaṇikaṁ patiṭṭhāpente, appekacce āsanāni paññapente, keṇiyaṁ pana jaṭilaṁ sāmaṁyeva maṇḍalamālaṁ paṭiyādentaṁ.",
    "mn92:8": "\"Na me, bho sela, āvāho bhavissati napi vivāho bhavissati napi rājā māgadho seniyo bimbisāro nimantito svātanāya saddhiṁ balakāyena; api ca kho me mahāyañño paccupaṭṭhito. Atthi, bho, samaṇo gotamo sakyaputto sakyakulā pabbajito aṅguttarāpesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ aḍḍhateḷasehi bhikkhusatehi āpaṇaṁ anuppatto. Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. So me nimantito svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā\"ti.",
    "mn92:9": "\"Buddhoti — bho keṇiya, vadesi\"?",
    "mn92:10": "\"Buddhoti — bho sela, vadāmi\".",
    "mn92:11": "\"Buddhoti — bho keṇiya, vadesi\"?",
    "mn92:12": "\"Buddhoti — bho sela, vadāmī\"ti.",
    "mn92:13": "Atha kho selassa brāhmaṇassa etadahosi: \"ghosopi kho eso dullabho lokasmiṁ –yadidaṁ ‘buddho’ti. Āgatāni kho panamhākaṁ mantesu dvattiṁsamahāpurisalakkhaṇāni, yehi samannāgatassa mahāpurisassa dveyeva gatiyo bhavanti anaññā. Sace agāraṁ ajjhāvasati, rājā hoti cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni satta ratanāni bhavanti, seyyathidaṁ — cakkaratanaṁ, hatthiratanaṁ, assaratanaṁ, maṇiratanaṁ, itthiratanaṁ, gahapatiratanaṁ, pariṇāyakaratanameva sattamaṁ. Parosahassaṁ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṁ pathaviṁ sāgarapariyantaṁ adaṇḍena asatthena dhammena abhivijiya ajjhāvasati. Sace pana agārasmā anagāriyaṁ pabbajati, arahaṁ hoti sammāsambuddho loke vivaṭṭacchado\".",
    "mn92:14": "\"Kahaṁ pana, bho keṇiya, etarahi so bhavaṁ gotamo viharati arahaṁ sammāsambuddho\"ti?",
    "mn92:15": "Addasā kho selo brāhmaṇo bhagavato kāye dvattiṁsamahāpurisalakkhaṇāni, yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati — kosohite ca vatthaguyhe pahūtajivhatāya ca.",
    "mn92:16": "Atha kho selo brāhmaṇo bhagavantaṁ sammukhā sāruppāhi gāthāhi abhitthavi:",
    "mn92:17": "\"Paripuṇṇakāyo suruci,Sujāto cārudassano;Suvaṇṇavaṇṇosi bhagavā,Susukkadāṭhosivīriyavā.",
    "mn92:18": "Narassa hi sujātassa,ye bhavanti viyañjanā;Sabbe te tava kāyasmiṁ,mahāpurisalakkhaṇā.",
    "mn92:19": "Pasannanetto sumukho,brahāuju patāpavā;Majjhe samaṇasaṁghassa,ādiccova virocasi.",
    "mn92:20": "Kalyāṇadassano bhikkhu,kañcanasannibhattaco;Kiṁ te samaṇabhāvena,evaṁ uttamavaṇṇino.",
    "mn92:21": "Rājā arahasi bhavituṁ,cakkavattī rathesabho;Cāturanto vijitāvī,jambusaṇḍassaissaro.",
    "mn92:22": "Khattiyā bhogirājāno,anuyantābhavantu te;Rājābhirājā manujindo,rajjaṁ kārehi gotama\".",
    "mn92:23": "\"Rājāhamasmi selāti,dhammarājā anuttaro;Dhammena cakkaṁ vattemi,cakkaṁ appaṭivattiyaṁ\".",
    "mn92:24": "\"Sambuddho paṭijānāsi,dhammarājā anuttaro;‘Dhammena cakkaṁ vattemi’,iti bhāsasi gotama.",
    "mn92:25": "Ko nu senāpati bhoto,sāvako satthuranvayo;Ko tetamanuvatteti,dhammacakkaṁ pavattitaṁ\".",
    "mn92:26": "\"Mayā pavattitaṁ cakkaṁ, (selāti bhagavā)Dhammacakkaṁ anuttaraṁ;Sāriputto anuvatteti,Anujāto tathāgataṁ.",
    "mn92:27": "Abhiññeyyaṁ abhiññātaṁ,bhāvetabbañca bhāvitaṁ;Pahātabbaṁ pahīnaṁ me,tasmā buddhosmi brāhmaṇa.",
    "mn92:28": "Vinayassu mayi kaṅkhaṁ,adhimuccassu brāhmaṇa;Dullabhaṁ dassanaṁ hoti,sambuddhānaṁ abhiṇhaso.",
    "mn92:29": "Yesaṁ ve dullabho loke,pātubhāvo abhiṇhaso;Sohaṁ brāhmaṇa sambuddho,sallakatto anuttaro.",
    "mn92:30": "Brahmabhūto atitulo,mārasenappamaddano;Sabbāmitte vasī katvā,modāmi akutobhayo\".",
    "mn92:31": "\"Imaṁ bhonto nisāmetha,yathā bhāsati cakkhumā;Sallakatto mahāvīro,sīhova nadatī vane.",
    "mn92:32": "Brahmabhūtaṁ atitulaṁ,mārasenappamaddanaṁ;Ko disvā nappasīdeyya,api kaṇhābhijātiko.",
    "mn92:33": "Yo maṁ icchati anvetu,yo vā nicchati gacchatu;Idhāhaṁ pabbajissāmi,varapaññassa santike\".",
    "mn92:34": "\"Etañceruccati bhoto,sammāsambuddhasāsanaṁ;Mayampi pabbajissāma,varapaññassa santike\".",
    "mn92:35": "Brāhmaṇā tisatā ime,yācanti pañjalīkatā;\"Brahmacariyaṁ carissāma,bhagavā tava santike\".",
    "mn92:36": "\"Svākkhātaṁ brahmacariyaṁ, (selāti bhagavā)Sandiṭṭhikamakālikaṁ;Yattha amoghā pabbajjā,Appamattassa sikkhato\"ti.",
    "mn92:37": "Alattha kho selo brāhmaṇo sapariso bhagavato santike pabbajjaṁ, alattha upasampadaṁ.",
    "mn92:38": "Atha kho keṇiyo jaṭilo tassā rattiyā accayena sake assame paṇītaṁ khādanīyaṁ bhojanīyaṁ paṭiyādāpetvā bhagavato kālaṁ ārocāpesi: \"kālo, bho gotama, niṭṭhitaṁ bhattan\"ti. Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena keṇiyassa jaṭilassa assamo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi saddhiṁ bhikkhusaṅghena. Atha kho keṇiyo jaṭilo buddhappamukhaṁ bhikkhusaṅghaṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi, sampavāresi. Atha kho keṇiyo jaṭilo bhagavantaṁ bhuttāviṁ onītapattapāṇiṁ aññataraṁ nīcaṁ āsanaṁ gahetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho keṇiyaṁ jaṭilaṁ bhagavā imāhi gāthāhi anumodi:",
    "mn92:39": "\"Aggihuttamukhā yaññā,sāvittī chandaso mukhaṁ;Rājā mukhaṁ manussānaṁ,nadīnaṁ sāgaro mukhaṁ.",
    "mn92:40": "Nakkhattānaṁ mukhaṁ cando,ādicco tapataṁ mukhaṁ;Puññaṁ ākaṅkhamānānaṁ,saṅgho ve yajataṁ mukhan\"ti.",
    "mn92:41": "Atha kho bhagavā keṇiyaṁ jaṭilaṁ imāhi gāthāhi anumoditvā uṭṭhāyāsanā pakkāmi.",
    "mn92:42": "Atha kho āyasmā selo sapariso eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva — yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ — brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāsi. \"Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā\"ti abbhaññāsi. Aññataro kho panāyasmā selo sapariso arahataṁ ahosi.",
    "mn92:43": "\"Yaṁ taṁ saraṇamāgamma,ito aṭṭhami cakkhumā;Sattarattenabhagavā,dantamha tava sāsane.",
    "mn92:44": "Tuvaṁ buddho tuvaṁ satthā,tuvaṁ mārābhibhū muni;Tuvaṁ anusaye chetvā,tiṇṇo tāresimaṁ pajaṁ.",
    "mn92:45": "Upadhī te samatikkantā,āsavā te padālitā;Sīhovaanupādāno,pahīnabhayabheravo.",
    "mn92:46": "Bhikkhavo tisatā ime,tiṭṭhanti pañjalīkatā;Pāde vīra pasārehi,nāgā vandantu satthuno\"ti."
}