{
    "mn93:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn93:2": "Atha kho te brāhmaṇā yena assalāyano māṇavo tenupasaṅkamiṁsu; upasaṅkamitvā assalāyanaṁ māṇavaṁ etadavocuṁ: \"Ayaṁ, bho assalāyana, samaṇo gotamo cātuvaṇṇiṁ suddhiṁ paññapeti. Etu bhavaṁ assalāyano samaṇena gotamena saddhiṁ asmiṁ vacanepaṭimantetū\"ti.",
    "mn93:3": "Evaṁ vutte, assalāyano māṇavo te brāhmaṇe etadavoca: \"Samaṇo khalu, bho, gotamo dhammavādī; dhammavādino ca pana duppaṭimantiyā bhavanti. Nāhaṁ sakkomi samaṇena gotamena saddhiṁ asmiṁ vacane paṭimantetun\"ti.",
    "mn93:4": "Dutiyampi kho te brāhmaṇā assalāyanaṁ māṇavaṁ etadavocuṁ: \"Ayaṁ, bho assalāyana, samaṇo gotamo cātuvaṇṇiṁ suddhiṁ paññapeti. Etu bhavaṁ assalāyano samaṇena gotamena saddhiṁ asmiṁ vacanepaṭimantetu. Caritaṁ kho pana bhotā assalāyanena paribbājakan\"ti.",
    "mn93:5": "Tatiyampi kho te brāhmaṇā assalāyanaṁ māṇavaṁ etadavocuṁ: \"Ayaṁ, bho assalāyana, samaṇo gotamo cātuvaṇṇiṁ suddhiṁ paññapeti. Etu bhavaṁ assalāyano samaṇena gotamena saddhiṁ asmiṁ vacanepaṭimantetu. Caritaṁ kho pana bhotā assalāyanena paribbājakaṁ. Mā bhavaṁ assalāyano ayuddhaparājitaṁ parājayī\"ti.",
    "mn93:6": "Evaṁ vutte, assalāyano māṇavo te brāhmaṇe etadavoca: \"addhā kho ahaṁ bhavanto na labhāmi. Samaṇo khalu, bho, gotamo dhammavādī; dhammavādino ca pana duppaṭimantiyā bhavanti. Nāhaṁ sakkomi samaṇena gotamena saddhiṁ asmiṁ vacane paṭimantetunti. Api cāhaṁ bhavantānaṁ vacanena gamissāmī\"ti.",
    "mn93:7": "Atha kho assalāyano māṇavo mahatā brāhmaṇagaṇena saddhiṁ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho assalāyano māṇavo bhagavantaṁ etadavoca: \"brāhmaṇā, bho gotama, evamāhaṁsu: ‘brāhmaṇova seṭṭho vaṇṇo, hīno añño vaṇṇo; brāhmaṇova sukko vaṇṇo, kaṇho añño vaṇṇo; brāhmaṇova sujjhanti, no abrāhmaṇā; brāhmaṇāva brahmuno puttā orasā mukhato jātā brahmajā brahmanimmitā brahmadāyādā’ti. Idha bhavaṁ gotamo kimāhā\"ti?",
    "mn93:8": "\"Taṁ kiṁ maññasi, assalāyana, sutaṁ te: ‘yonakambojesu aññesu ca paccantimesu janapadesu dveva vaṇṇā — ayyo ceva dāso ca; ayyo hutvā dāso hoti, dāso hutvā ayyo hotī’\"ti?",
    "mn93:9": "\"Taṁ kiṁ maññasi, assalāyana, khattiyova nu kho pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco samphappalāpī abhijjhālu byāpannacitto micchādiṭṭhi kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyya, no brāhmaṇo? Vessova nu kho … pe … suddova nu kho pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco sabhijjhālu byāpannacitto micchādiṭṭhi kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyya, no brāhmaṇo\"ti?",
    "mn93:10": "\"Taṁ kiṁ maññasi, assalāyana, brāhmaṇova nu kho pāṇātipātā paṭivirato adinnādānā paṭivirato kāmesumicchācārā paṭivirato musāvādā paṭivirato pisuṇāya vācāya paṭivirato pharusāya vācāya paṭivirato samphappalāpā paṭivirato anabhijjhālu abyāpannacitto sammādiṭṭhi kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjeyya,nokhattiyo,novesso,nosuddo\"ti?",
    "mn93:11": "\"Taṁ kiṁ maññasi, assalāyana, brāhmaṇova nu kho pahoti asmiṁ padese averaṁ abyābajjhaṁ mettacittaṁ bhāvetuṁ, no khattiyo, no vesso, no suddo\"ti?",
    "mn93:12": "\"Taṁ kiṁ maññasi, assalāyana, brāhmaṇova nu kho pahoti sottisināniṁ ādāya nadiṁ gantvā rajojallaṁ pavāhetuṁ, no khattiyo, no vesso, no suddo\"ti?",
    "mn93:13": "\"Taṁ kiṁ maññasi, assalāyana, idha rājā khattiyo muddhāvasitto nānājaccānaṁ purisānaṁ purisasataṁ sannipāteyya: ‘āyantu bhonto ye tattha khattiyakulā brāhmaṇakulā rājaññakulā uppannā,sākassa vā sālassa vālaḷassa vā candanassa vā padumakassa vā uttarāraṇiṁ ādāya, aggiṁ abhinibbattentu, tejo pātukarontu. Āyantu pana bhonto ye tattha caṇḍālakulā nesādakulāvenakulārathakārakulā pukkusakulā uppannā, sāpānadoṇiyā vā sūkaradoṇiyā vā rajakadoṇiyā vā eraṇḍakaṭṭhassa vā uttarāraṇiṁ ādāya, aggiṁ abhinibbattentu, tejo pātukarontū’ti.",
    "mn93:14": "Taṁ kiṁ maññasi, assalāyana, yoevaṁ nu kho sokhattiyakulā brāhmaṇakulā rājaññakulā uppannehi sākassa vā sālassa vā salaḷassa vā candanassa vā padumakassa vā uttarāraṇiṁ ādāya aggi abhinibbatto, tejo pātukato, so eva nu khvāssa aggi accimācevavaṇṇavāca pabhassaro ca, tena ca sakkā agginā aggikaraṇīyaṁ kātuṁ; yo pana so caṇḍālakulā nesādakulā venakulā rathakārakulā pukkusakulā uppannehi sāpānadoṇiyā vā sūkaradoṇiyā vā rajakadoṇiyā vā eraṇḍakaṭṭhassa vā uttarāraṇiṁ ādāya aggi abhinibbatto, tejo pātukato svāssa aggi na ceva accimā na ca vaṇṇavā na ca pabhassaro, na ca tena sakkā agginā aggikaraṇīyaṁ kātun\"ti?",
    "mn93:15": "\"Taṁ kiṁ maññasi, assalāyana, idha khattiyakumāro brāhmaṇakaññāya saddhiṁ saṁvāsaṁ kappeyya, tesaṁ saṁvāsamanvāya putto jāyetha; yo so khattiyakumārena brāhmaṇakaññāya putto uppanno, siyā so mātupi sadiso pitupi sadiso, ‘khattiyo’tipi vattabbo ‘brāhmaṇo’tipi vattabbo\"ti?",
    "mn93:16": "\"Taṁ kiṁ maññasi, assalāyana, idha brāhmaṇakumāro khattiyakaññāya saddhiṁ saṁvāsaṁ kappeyya, tesaṁ saṁvāsamanvāya putto jāyetha; yo so brāhmaṇakumārena khattiyakaññāya putto uppanno, siyā so mātupi sadiso pitupi sadiso, ‘khattiyo’tipi vattabbo ‘brāhmaṇo’tipi vattabbo\"ti?",
    "mn93:17": "\"Taṁ kiṁ maññasi, assalāyana, idha vaḷavaṁ gadrabhenasampayojeyyuṁ, tesaṁ sampayogamanvāya kisoro jāyetha; yo so vaḷavāya gadrabhena kisoro uppanno, siyā so mātupi sadiso pitupi sadiso, ‘asso’tipi vattabbo ‘gadrabho’tipi vattabbo\"ti?",
    "mn93:18": "\"Taṁ kiṁ maññasi, assalāyana, idhāssu dve māṇavakā bhātaro sodariyā, eko ajjhāyako upanīto eko anajjhāyako anupanīto. Kamettha brāhmaṇā paṭhamaṁ bhojeyyuṁ saddhe vā thālipāke vā yaññe vā pāhune vā\"ti?",
    "mn93:19": "\"Taṁ kiṁ maññasi, assalāyana, idhāssu dve māṇavakā bhātaro sodariyā, eko ajjhāyako upanīto dussīlo pāpadhammo, eko anajjhāyako anupanīto sīlavā kalyāṇadhammo. Kamettha brāhmaṇā paṭhamaṁ bhojeyyuṁ saddhe vā thālipāke vā yaññe vā pāhune vā\"ti?",
    "mn93:20": "\"Pubbe kho tvaṁ, assalāyana, jātiṁ agamāsi; jātiṁ gantvā mante agamāsi;mante gantvā tape agamāsi; tape gantvācātuvaṇṇiṁ suddhiṁ paccāgato, yamahaṁ paññapemī\"ti.",
    "mn93:21": "Atha kho bhagavā assalāyanaṁ māṇavaṁ tuṇhībhūtaṁ maṅkubhūtaṁ pattakkhandhaṁ adhomukhaṁ pajjhāyantaṁ appaṭibhānaṁ viditvā assalāyanaṁ māṇavaṁ etadavoca: \"Bhūtapubbaṁ, assalāyana, sattannaṁ brāhmaṇisīnaṁ araññāyatane paṇṇakuṭīsu sammantānaṁ evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ hoti: ‘brāhmaṇova seṭṭho vaṇṇo, hīno añño vaṇṇo … pe … brahmadāyādā’ti. Assosi kho, assalāyana, asito devalo isi: ‘sattannaṁ kira brāhmaṇisīnaṁ araññāyatane paṇṇakuṭīsu sammantānaṁ evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ — brāhmaṇova seṭṭho vaṇṇo … pe … brahmadāyādā’ti. Atha kho, assalāyana, asito devalo isi kesamassuṁ kappetvā mañjiṭṭhavaṇṇāni dussāni nivāsetvāpaṭaliyoupāhanā āruhitvā jātarūpamayaṁ daṇḍaṁ gahetvā sattannaṁ brāhmaṇisīnaṁ patthaṇḍile pāturahosi. Atha kho, assalāyana, asito devalo isi sattannaṁ brāhmaṇisīnaṁ patthaṇḍile caṅkamamāno evamāha: ‘handa ko nu kho ime bhavanto brāhmaṇisayogatā; handa ko nu kho ime bhavanto brāhmaṇisayo gatā’ti? Atha kho, assalāyana, sattannaṁ brāhmaṇisīnaṁ etadahosi: ‘ko nāyaṁ gāmaṇḍalarūpo viya sattannaṁ brāhmaṇisīnaṁ patthaṇḍile caṅkamamāno evamāha: \"handa ko nu kho ime bhavanto brāhmaṇisayo gatā; handa ko nu kho ime bhavanto brāhmaṇisayo gatāti? Handa naṁ abhisapāmā\"’ti. Atha kho, assalāyana, satta brāhmaṇisayo asitaṁ devalaṁ isiṁ abhisapiṁsu: ‘bhasmā,vasala,hohi; bhasmā, vasala, hohī’ti. Yathā yathā kho, assalāyana, satta brāhmaṇisayo asitaṁ devalaṁ isiṁ abhisapiṁsu tathā tathā asito devalo isi abhirūpataro ceva hoti dassanīyataro ca pāsādikataro ca. Atha kho, assalāyana, sattannaṁ brāhmaṇisīnaṁ etadahosi: ‘moghaṁ vata no tapo, aphalaṁ brahmacariyaṁ. Mayañhi pubbe yaṁ abhisapāma — bhasmā, vasala, hohi; bhasmā, vasala, hohīti bhasmāva bhavati ekacco. Imaṁ pana mayaṁ yathā yathā abhisapāma tathā tathā abhirūpataro ceva hoti dassanīyataro ca pāsādikataro cā’ti.",
    "mn93:22": "Atha kho, assalāyana, asito devalo isi satta brāhmaṇisayo etadavoca: ‘sutaṁ metaṁ, bho, sattannaṁ kira brāhmaṇisīnaṁ araññāyatane paṇṇakuṭīsu sammantānaṁ evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ — brāhmaṇova seṭṭho vaṇṇo, hīno añño vaṇṇo; brāhmaṇova sukko vaṇṇo, kaṇho añño vaṇṇo; brāhmaṇāva sujjhanti, no abrāhmaṇā; brāhmaṇāva brahmuno puttā orasā mukhato jātā brahmajā brahmanimmitā brahmadāyādā’ti. ‘Evaṁ, bho’.",
    "mn93:23": "‘Jānanti pana bhonto — yājanikā mātābrāhmaṇaṁyeva agamāsi, no abrāhmaṇan’ti? ‘No hidaṁ, bho’.",
    "mn93:24": "‘Jānanti pana bhonto — yājanikāmātumātā yāva sattamā mātumātāmahayugā brāhmaṇaṁyeva agamāsi, no abrāhmaṇan’ti? ‘No hidaṁ, bho’.",
    "mn93:25": "‘Jānanti pana bhonto — yojanako pitābrāhmaṇiṁyeva agamāsi, no abrāhmaṇin’ti? ‘No hidaṁ, bho’.",
    "mn93:26": "‘Jānanti pana bhonto — yojanakapitupitā yāva sattamā pitupitāmahayugā brāhmaṇiṁyeva agamāsi, no abrāhmaṇin’ti? ‘No hidaṁ, bho’.",
    "mn93:27": "‘Jānanti pana bhonto — yathā gabbhassa avakkanti hotī’ti?",
    "mn93:28": "‘Jānanti pana bhonto —taggha, so gandhabbo khattiyo vā brāhmaṇo vā vesso vā suddo vā’ti?",
    "mn93:29": "Evaṁ vutte, assalāyano māṇavo bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}