{
    "mn95:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā kosalesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ yena opāsādaṁ nāma kosalānaṁ brāhmaṇagāmo tadavasari. Tatra sudaṁ bhagavā opāsāde viharati uttarena opāsādaṁ devavane sālavane.",
    "mn95:2": "Atha kho opāsādakā brāhmaṇagahapatikā opāsādā nikkhamitvā saṅghasaṅghī gaṇībhūtā uttarenamukhā gacchanti yena devavanaṁ sālavanaṁ. Tena kho pana samayena caṅkī brāhmaṇo uparipāsāde divāseyyaṁ upagato.",
    "mn95:3": "Tena kho pana samayena nānāverajjakānaṁ brāhmaṇānaṁ pañcamattāni brāhmaṇasatāni opāsāde paṭivasanti kenacideva karaṇīyena. Assosuṁ kho te brāhmaṇā: \"caṅkī kira brāhmaṇo samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī\"ti. Atha kho te brāhmaṇā yena caṅkī brāhmaṇo tenupasaṅkamiṁsu; upasaṅkamitvā caṅkiṁ brāhmaṇaṁ etadavocuṁ: \"Saccaṁ kira bhavaṁ caṅkī samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī\"ti?",
    "mn95:4": "Evaṁ vutte, caṅkī brāhmaṇo te brāhmaṇe etadavoca: \" tena hi, bho, mamapi suṇātha, yathā mayameva arahāma taṁ samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ; na tveva arahati so bhavaṁ gotamo amhākaṁ dassanāya upasaṅkamituṁ.",
    "mn95:5": "Samaṇo khalu, bho, gotamo pahūtaṁ hiraññasuvaṇṇaṁ ohāya pabbajito bhūmigatañca vehāsaṭṭhañca … pe …",
    "mn95:6": "Samaṇo khalu, bho, gotamo daharova samāno yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā agārasmā anagāriyaṁ pabbajito … pe …",
    "mn95:7": "Samaṇo khalu, bho, gotamo akāmakānaṁ mātāpitūnaṁ assumukhānaṁ rudantānaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajito … pe …",
    "mn95:8": "Samaṇo khalu, bho, gotamo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya … pe …",
    "mn95:9": "Samaṇo khalu, bho, gotamo sīlavā ariyasīlī kusalasīlī kusalena sīlena samannāgato … pe …",
    "mn95:10": "Samaṇo khalu, bho, gotamo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā … pe …",
    "mn95:11": "Samaṇo khalu, bho, gotamo bahūnaṁ ācariyapācariyo … pe …",
    "mn95:12": "Samaṇo khalu, bho, gotamo khīṇakāmarāgo vigatacāpallo … pe …",
    "mn95:13": "Samaṇo khalu, bho, gotamo kammavādī kiriyavādī apāpapurekkhāro brahmaññāya pajāya … pe …",
    "mn95:14": "Samaṇo khalu, bho, gotamo uccā kulā pabbajito asambhinnā khattiyakulā … pe …",
    "mn95:15": "Samaṇo khalu, bho, gotamo aḍḍhā kulā pabbajito mahaddhanā mahābhogā … pe …",
    "mn95:16": "Samaṇaṁ khalu, bho, gotamaṁ tiroraṭṭhā tirojanapadā saṁpucchituṁ āgacchanti … pe …",
    "mn95:17": "Samaṇaṁ khalu, bho, gotamaṁ anekāni devatāsahassāni pāṇehi saraṇaṁ gatāni … pe …",
    "mn95:18": "Samaṇaṁ khalu, bho, gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti … pe …",
    "mn95:19": "Samaṇo khalu, bho, gotamo dvattiṁsamahāpurisalakkhaṇehi samannāgato… pe …",
    "mn95:20": "Samaṇaṁ khalu, bho, gotamaṁ rājā māgadho seniyo bimbisāro saputtadāro pāṇehi saraṇaṁ gato … pe …",
    "mn95:21": "Samaṇaṁ khalu, bho, gotamaṁ rājā pasenadi kosalo saputtadāro pāṇehi saraṇaṁ gato … pe …",
    "mn95:22": "Samaṇaṁ khalu, bho, gotamaṁ brāhmaṇo pokkharasāti saputtadāro pāṇehi saraṇaṁ gato … pe …",
    "mn95:23": "Samaṇo khalu, bho, gotamo opāsādaṁ anuppatto opāsāde viharati uttarena opāsādaṁ devavane sālavane. Ye kho te samaṇā vā brāhmaṇā vā amhākaṁ gāmakkhettaṁ āgacchanti, atithī no te honti. Atithī kho panamhehi sakkātabbā garukātabbā mānetabbā pūjetabbā. Yampi samaṇo gotamo opāsādaṁ anuppatto opāsāde viharati uttarena opāsādaṁ devavane sālavane, atithimhākaṁ samaṇo gotamo. Atithi kho panamhehi sakkātabbo garukātabbo mānetabbo pūjetabbo. Imināpaṅgena na arahati so bhavaṁ gotamo amhākaṁ dassanāya upasaṅkamituṁ; atha kho mayameva arahāma taṁ bhavantaṁ gotamaṁ dassanāya upasaṅkamituṁ.",
    "mn95:24": "Atha kho caṅkī brāhmaṇo mahatā brāhmaṇagaṇena saddhiṁ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi.",
    "mn95:25": "Atha kho kāpaṭikassa māṇavassa etadahosi: \"samannāharati kho maṁ samaṇo gotamo. Yannūnāhaṁ samaṇaṁ gotamaṁ pañhaṁ puccheyyan\"ti. Atha kho kāpaṭiko māṇavo bhagavantaṁ etadavoca: \"yadidaṁ, bho gotama, brāhmaṇānaṁ porāṇaṁ mantapadaṁ itihitihaparamparāya piṭakasampadāya, tattha ca brāhmaṇā ekaṁsena niṭṭhaṁ gacchanti: ‘idameva saccaṁ, moghamaññan’ti. Idha bhavaṁ gotamo kimāhā\"ti?",
    "mn95:26": "\"Iti kira, bhāradvāja, natthi koci brāhmaṇānaṁ ekabrāhmaṇopi yo evamāha: ‘ahametaṁ jānāmi, ahametaṁ passāmi. Idameva saccaṁ, moghamaññan’ti; natthi koci brāhmaṇānaṁ ekācariyopi ekācariyapācariyopi, yāva sattamā ācariyamahayugāpi, yo evamāha: ‘ahametaṁ jānāmi, ahametaṁ passāmi. Idameva saccaṁ, moghamaññan’ti; yepi te brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro yesamidaṁ etarahi brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ tadanugāyanti tadanubhāsanti bhāsitamanubhāsanti vācitamanuvācenti seyyathidaṁ — aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṁsu: ‘mayametaṁ jānāma, mayametaṁ passāma. Idameva saccaṁ, moghamaññan’ti.",
    "mn95:27": "Seyyathāpi, bhāradvāja, andhaveṇi paramparāsaṁsattā purimopi na passati majjhimopi na passati pacchimopi na passati; evameva kho, bhāradvāja, andhaveṇūpamaṁ maññe brāhmaṇānaṁ bhāsitaṁ sampajjati — purimopi na passati majjhimopi na passati pacchimopi na passati. Taṁ kiṁ maññasi, bhāradvāja, nanu evaṁ sante brāhmaṇānaṁ amūlikā saddhā sampajjatī\"ti?",
    "mn95:28": "\"Kittāvatā pana, bho gotama, saccānurakkhaṇā hoti, kittāvatā saccamanurakkhati? Saccānurakkhaṇaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:29": "\"Ettāvatā, bho gotama, saccānurakkhaṇā hoti, ettāvatā saccamanurakkhati, ettāvatā ca mayaṁ saccānurakkhaṇaṁ pekkhāma. Kittāvatā pana, bho gotama, saccānubodho hoti, kittāvatā saccamanubujjhati? Saccānubodhaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:30": "Yato naṁ samannesamāno visuddhaṁ lobhanīyehi dhammehi samanupassati tato naṁ uttari samannesati dosanīyesu dhammesu. Atthi nu kho imassāyasmato tathārūpā dosanīyā dhammā yathārūpehi dosanīyehi dhammehi pariyādinnacitto ajānaṁ vā vadeyya — jānāmīti, apassaṁ vā vadeyya — passāmīti, paraṁ vā tadatthāya samādapeyya yaṁ paresaṁ assa dīgharattaṁ ahitāya dukkhāyāti? Tamenaṁ samannesamāno evaṁ jānāti: ‘Natthi kho imassāyasmato tathārūpā dosanīyā dhammā yathārūpehi dosanīyehi dhammehi pariyādinnacitto ajānaṁ vā vadeyya — jānāmīti, apassaṁ vā vadeyya — passāmīti, paraṁ vā tadatthāya samādapeyya yaṁ paresaṁ assa dīgharattaṁ ahitāya dukkhāya. Tathārūpo kho panimassāyasmato kāyasamācāro tathārūpo vacīsamācāro yathā taṁ aduṭṭhassa. Yaṁ kho pana ayamāyasmā dhammaṁ deseti, gambhīro so dhammo duddaso duranubodho santo paṇīto atakkāvacaro nipuṇo paṇḍitavedanīyo; na so dhammo sudesiyo duṭṭhenā’ti.",
    "mn95:31": "Yato naṁ samannesamāno visuddhaṁ dosanīyehi dhammehi samanupassati, tato naṁ uttari samannesati mohanīyesu dhammesu. Atthi nu kho imassāyasmato tathārūpā mohanīyā dhammā yathārūpehi mohanīyehi dhammehi pariyādinnacitto ajānaṁ vā vadeyya — jānāmīti, apassaṁ vā vadeyya — passāmīti, paraṁ vā tadatthāya samādapeyya yaṁ paresaṁ assa dīgharattaṁ ahitāya dukkhāyāti? Tamenaṁ samannesamāno evaṁ jānāti: ‘Natthi kho imassāyasmato tathārūpā mohanīyā dhammā yathārūpehi mohanīyehi dhammehi pariyādinnacitto ajānaṁ vā vadeyya — jānāmīti, apassaṁ vā vadeyya — passāmīti, paraṁ vā tadatthāya samādapeyya yaṁ paresaṁ assa dīgharattaṁ ahitāya dukkhāya. Tathārūpo kho panimassāyasmato kāyasamācāro tathārūpo vacīsamācāro yathā taṁ amūḷhassa. Yaṁ kho pana ayamāyasmā dhammaṁ deseti, gambhīro so dhammo duddaso duranubodho santo paṇīto atakkāvacaro nipuṇo paṇḍitavedanīyo; na so dhammo sudesiyo mūḷhenā’ti.",
    "mn95:32": "Yato naṁ samannesamāno visuddhaṁ mohanīyehi dhammehi samanupassati; atha tamhi saddhaṁ niveseti, saddhājāto upasaṅkamati, upasaṅkamanto payirupāsati, payirupāsanto sotaṁ odahati, ohitasoto dhammaṁ suṇāti, sutvā dhammaṁ dhāreti,dhatānaṁdhammānaṁ atthaṁ upaparikkhati, atthaṁ upaparikkhato dhammā nijjhānaṁ khamanti, dhammanijjhānakkhantiyā sati chando jāyati, chandajāto ussahati, ussahitvā tuleti, tulayitvā padahati, pahitatto samāno kāyena ceva paramasaccaṁ sacchikaroti paññāya ca naṁ ativijjha passati. Ettāvatā kho, bhāradvāja, saccānubodho hoti, ettāvatā saccamanubujjhati, ettāvatā ca mayaṁ saccānubodhaṁ paññapema; na tveva tāva saccānuppatti hotī\"ti.",
    "mn95:33": "\"Ettāvatā, bho gotama, saccānubodho hoti, ettāvatā saccamanubujjhati, ettāvatā ca mayaṁ saccānubodhaṁ pekkhāma. Kittāvatā pana, bho gotama, saccānuppatti hoti, kittāvatā saccamanupāpuṇāti? Saccānuppattiṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti. \"Tesaṁyeva, bhāradvāja, dhammānaṁ āsevanā bhāvanā bahulīkammaṁ saccānuppatti hoti. Ettāvatā kho, bhāradvāja, saccānuppatti hoti, ettāvatā saccamanupāpuṇāti, ettāvatā ca mayaṁ saccānuppattiṁ paññapemā\"ti.",
    "mn95:34": "\"Ettāvatā, bho gotama, saccānuppatti hoti, ettāvatā saccamanupāpuṇāti, ettāvatā ca mayaṁ saccānuppattiṁ pekkhāma. Saccānuppattiyā pana, bho gotama, katamo dhammo bahukāro? Saccānuppattiyā bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti. \"Saccānuppattiyā kho, bhāradvāja, padhānaṁ bahukāraṁ. No cetaṁ padaheyya, nayidaṁ saccamanupāpuṇeyya. Yasmā ca kho padahati tasmā saccamanupāpuṇāti. Tasmā saccānuppattiyā padhānaṁ bahukāran\"ti.",
    "mn95:35": "\"Padhānassa pana, bho gotama, katamo dhammo bahukāro? Padhānassa bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:36": "\"Tulanāya pana, bho gotama, katamo dhammo bahukāro? Tulanāya bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:37": "\"Ussāhassa pana, bho gotama, katamo dhammo bahukāro? Ussāhassa bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:38": "\"Chandassa pana, bho gotama, katamo dhammo bahukāro? Chandassa bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:39": "\"Dhammanijjhānakkhantiyā pana, bho gotama, katamo dhammo bahukāro? Dhammanijjhānakkhantiyā bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:40": "\"Atthūpaparikkhāya pana, bho gotama, katamo dhammo bahukāro? Atthūpaparikkhāya bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:41": "\"Dhammadhāraṇāya pana, bho gotama, katamo dhammo bahukāro? Dhammadhāraṇāya bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:42": "\"Dhammassavanassa pana, bho gotama, katamo dhammo bahukāro? Dhammassavanassa bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:43": "\"Sotāvadhānassa pana, bho gotama, katamo dhammo bahukāro? Sotāvadhānassa bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:44": "\"Payirupāsanāya pana, bho gotama, katamo dhammo bahukāro? Payirupāsanāya bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:45": "\"Upasaṅkamanassa pana, bho gotama, katamo dhammo bahukāro? Upasaṅkamanassa bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ pucchāmā\"ti.",
    "mn95:46": "\"Saccānurakkhaṇaṁ mayaṁ bhavantaṁ gotamaṁ apucchimha, saccānurakkhaṇaṁ bhavaṁ gotamo byākāsi; tañca panamhākaṁ ruccati ceva khamati ca tena camha attamanā. Saccānubodhaṁ mayaṁ bhavantaṁ gotamaṁ apucchimha, saccānubodhaṁ bhavaṁ gotamo byākāsi; tañca panamhākaṁ ruccati ceva khamati ca tena camha attamanā. Saccānuppattiṁ mayaṁ bhavantaṁ gotamaṁ apucchimha, saccānuppattiṁ bhavaṁ gotamo byākāsi; tañca panamhākaṁ ruccati ceva khamati ca tena camha attamanā. Saccānuppattiyā bahukāraṁ dhammaṁ mayaṁ bhavantaṁ gotamaṁ apucchimha, saccānuppattiyā bahukāraṁ dhammaṁ bhavaṁ gotamo byākāsi; tañca panamhākaṁ ruccati ceva khamati ca tena camha attamanā. Yaṁyadeva ca mayaṁ bhavantaṁ gotamaṁ apucchimha taṁtadeva bhavaṁ gotamo byākāsi; tañca panamhākaṁ ruccati ceva khamati ca tena camha attamanā. Mayañhi, bho gotama, pubbe evaṁ jānāma: ‘ke ca muṇḍakā samaṇakā ibbhā kaṇhā bandhupādāpaccā, ke ca dhammassa aññātāro’ti? Ajanesi vata me bhavaṁ gotamo samaṇesu samaṇapemaṁ, samaṇesu samaṇapasādaṁ, samaṇesu samaṇagāravaṁ."
}