{
    "mn96:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn96:2": "\"Kiṁ pana, brāhmaṇa, sabbo loko brāhmaṇānaṁ etadabbhanujānāti: ‘imā catasso pāricariyāpaññapentū’\"ti? \"No hidaṁ, bho gotama\". \"Seyyathāpi, brāhmaṇa, purisodaliddoassako anāḷhiyo. Tassa akāmassa bilaṁ olaggeyyuṁ: ‘idaṁ te, ambho purisa, maṁsaṁ khāditabbaṁ, mūlañca anuppadātabban’ti. Evameva kho, brāhmaṇa, brāhmaṇā appaṭiññāya tesaṁ samaṇabrāhmaṇānaṁ, atha ca panimā catasso pāricariyā paññapenti.",
    "mn96:3": "Uccākulīnopi hi, brāhmaṇa, idhekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇāvāco hoti, pharusāvāco hoti, samphappalāpī hoti, abhijjhālu hoti, byāpannacitto hoti, micchādiṭṭhi hoti. Tasmā ‘Na uccākulīnatā seyyaṁso’ti vadāmi. Uccākulīnopi hi, brāhmaṇa, idhekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhi hoti. Tasmā ‘Na uccākulīnatā pāpiyaṁso’ti vadāmi.",
    "mn96:4": "Uḷāravaṇṇopi hi, brāhmaṇa … pe … uḷārabhogopi hi, brāhmaṇa, idhekacco pāṇātipātī hoti … pe … micchādiṭṭhi hoti. Tasmā ‘Na uḷārabhogatā seyyaṁso’ti vadāmi. Uḷārabhogopi hi, brāhmaṇa, idhekacco pāṇātipātā paṭivirato hoti … pe … sammādiṭṭhi hoti. Tasmā ‘Na uḷārabhogatā pāpiyaṁso’ti vadāmi.",
    "mn96:5": "Evaṁ vutte, esukārī brāhmaṇo bhagavantaṁ etadavoca: \"brāhmaṇā, bho gotama, cattāri dhanāni paññapenti — brāhmaṇassa sandhanaṁ paññapenti, khattiyassa sandhanaṁ paññapenti, vessassa sandhanaṁ paññapenti, suddassa sandhanaṁ paññapenti. Tatridaṁ, bho gotama, brāhmaṇā brāhmaṇassa sandhanaṁ paññapenti bhikkhācariyaṁ; bhikkhācariyañca pana brāhmaṇo sandhanaṁ atimaññamāno akiccakārī hoti gopova adinnaṁ ādiyamānoti. Idaṁ kho, bho gotama, brāhmaṇā brāhmaṇassa sandhanaṁ paññapenti. Tatridaṁ, bho gotama, brāhmaṇā khattiyassa sandhanaṁ paññapenti dhanukalāpaṁ; dhanukalāpañca pana khattiyo sandhanaṁ atimaññamāno akiccakārī hoti gopova adinnaṁ ādiyamānoti. Idaṁ kho, bho gotama, brāhmaṇā khattiyassa sandhanaṁ paññapenti. Tatridaṁ, bho gotama, brāhmaṇā vessassa sandhanaṁ paññapenti kasigorakkhaṁ; kasigorakkhañca pana vesso sandhanaṁ atimaññamāno akiccakārī hoti gopova adinnaṁ ādiyamānoti. Idaṁ kho, bho gotama, brāhmaṇā vessassa sandhanaṁ paññapenti. Tatridaṁ, bho gotama, brāhmaṇā suddassa sandhanaṁ paññapenti asitabyābhaṅgiṁ; asitabyābhaṅgiñca pana suddo sandhanaṁ atimaññamāno akiccakārī hoti gopova adinnaṁ ādiyamānoti. Idaṁ kho, bho gotama, brāhmaṇā suddassa sandhanaṁ paññapenti. Brāhmaṇā, bho gotama, imāni cattāri dhanāni paññapenti. Idha bhavaṁ gotamo kimāhā\"ti?",
    "mn96:6": "\"Kiṁ pana, brāhmaṇa, sabbo loko brāhmaṇānaṁ etadabbhanujānāti: ‘imāni cattāri dhanāni paññapentū’\"ti? \"No hidaṁ, bho gotama\". \"Seyyathāpi, brāhmaṇa, puriso daliddo assako anāḷhiyo. Tassa akāmassa bilaṁ olaggeyyuṁ: ‘idaṁ te, ambho purisa, maṁsaṁ khāditabbaṁ, mūlañca anuppadātabban’ti. Evameva kho, brāhmaṇa, brāhmaṇā appaṭiññāya tesaṁ samaṇabrāhmaṇānaṁ, atha ca panimāni cattāri dhanāni paññapenti. Ariyaṁ kho ahaṁ, brāhmaṇa, lokuttaraṁ dhammaṁ purisassa sandhanaṁ paññapemi. Porāṇaṁ kho panassa mātāpettikaṁ kulavaṁsaṁ anussarato yattha yattheva attabhāvassa abhinibbatti hoti tena teneva saṅkhyaṁ gacchati. Khattiyakule ce attabhāvassa abhinibbatti hoti ‘khattiyo’tveva saṅkhyaṁ gacchati; brāhmaṇakule ce attabhāvassa abhinibbatti hoti ‘brāhmaṇo’tveva saṅkhyaṁ gacchati; vessakule ce attabhāvassa abhinibbatti hoti ‘vesso’tveva saṅkhyaṁ gacchati; suddakule ce attabhāvassa abhinibbatti hoti ‘suddo’tveva saṅkhyaṁ gacchati. Seyyathāpi, brāhmaṇa, yaṁyadeva paccayaṁ paṭicca aggi jalati tena teneva saṅkhyaṁ gacchati. Kaṭṭhañce paṭicca aggi jalati ‘kaṭṭhaggi’tveva saṅkhyaṁ gacchati; sakalikañce paṭicca aggi jalati ‘sakalikaggi’tveva saṅkhyaṁ gacchati; tiṇañce paṭicca aggi jalati ‘tiṇaggi’tveva saṅkhyaṁ gacchati; gomayañce paṭicca aggi jalati ‘gomayaggi’tveva saṅkhyaṁ gacchati. Evameva kho ahaṁ, brāhmaṇa, ariyaṁ lokuttaraṁ dhammaṁ purisassa sandhanaṁ paññapemi. Porāṇaṁ kho panassa mātāpettikaṁ kulavaṁsaṁ anussarato yattha yattheva attabhāvassa abhinibbatti hoti tena teneva saṅkhyaṁ gacchati.",
    "mn96:7": "Khattiyakule ce attabhāvassa abhinibbatti hoti ‘khattiyo’tveva saṅkhyaṁ gacchati; brāhmaṇakule ce attabhāvassa abhinibbatti hoti ‘brāhmaṇo’tveva saṅkhyaṁ gacchati; vessakule ce attabhāvassa abhinibbatti hoti ‘vesso’tveva saṅkhyaṁ gacchati; suddakule ce attabhāvassa abhinibbatti hoti ‘suddo’tveva saṅkhyaṁ gacchati.",
    "mn96:8": "Khattiyakulā cepi, brāhmaṇa, agārasmā anagāriyaṁ pabbajito hoti, so ca tathāgatappaveditaṁ dhammavinayaṁ āgamma pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, abrahmacariyā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhi hoti, ārādhako hoti ñāyaṁ dhammaṁ kusalaṁ.",
    "mn96:9": "Brāhmaṇakulā cepi, brāhmaṇa, agārasmā anagāriyaṁ pabbajito hoti, so ca tathāgatappaveditaṁ dhammavinayaṁ āgamma pāṇātipātā paṭivirato hoti … pe … sammādiṭṭhi hoti, ārādhako hoti ñāyaṁ dhammaṁ kusalaṁ.",
    "mn96:10": "Vessakulā cepi, brāhmaṇa, agārasmā anagāriyaṁ pabbajito hoti, so ca tathāgatappaveditaṁ dhammavinayaṁ āgamma pāṇātipātā paṭivirato hoti … pe … sammādiṭṭhi hoti, ārādhako hoti ñāyaṁ dhammaṁ kusalaṁ.",
    "mn96:11": "Suddakulā cepi, brāhmaṇa, agārasmā anagāriyaṁ pabbajito hoti, so ca tathāgatappaveditaṁ dhammavinayaṁ āgamma pāṇātipātā paṭivirato hoti … pe … sammādiṭṭhi hoti, ārādhako hoti ñāyaṁ dhammaṁ kusalaṁ.",
    "mn96:12": "Taṁ kiṁ maññasi, brāhmaṇa, brāhmaṇova nu kho pahoti asmiṁ padese averaṁ abyābajjhaṁ mettacittaṁ bhāvetuṁ, no khattiyo no vesso no suddo\"ti?",
    "mn96:13": "Brāhmaṇakulā cepi, brāhmaṇa … vessakulā cepi, brāhmaṇa … suddakulā cepi, brāhmaṇa, agārasmā anagāriyaṁ pabbajito hoti, so ca tathāgatappaveditaṁ dhammavinayaṁ āgamma pāṇātipātā paṭivirato hoti … pe … sammādiṭṭhi hoti, ārādhako hoti ñāyaṁ dhammaṁ kusalaṁ.",
    "mn96:14": "Taṁ kiṁ maññasi, brāhmaṇa, brāhmaṇova nu kho pahoti sottisināniṁ ādāya nadiṁ gantvā rajojallaṁ pavāhetuṁ, no khattiyo no vesso no suddo\"ti?",
    "mn96:15": "Brāhmaṇakulā cepi, brāhmaṇa … vessakulā cepi, brāhmaṇa … suddakulā cepi, brāhmaṇa, agārasmā anagāriyaṁ pabbajito hoti, so ca tathāgatappaveditaṁ dhammavinayaṁ āgamma pāṇātipātā paṭivirato hoti … pe … sammādiṭṭhi hoti, ārādhako hoti ñāyaṁ dhammaṁ kusalaṁ.",
    "mn96:16": "Taṁ kiṁ maññasi, brāhmaṇa, idha rājā khattiyo muddhāvasitto nānājaccānaṁ purisānaṁ purisasataṁ sannipāteyya: ‘āyantu bhonto ye tattha khattiyakulā brāhmaṇakulā rājaññakulā uppannā sākassa vā sālassa vā salaḷassa vā candanassa vā padumakassa vā uttarāraṇiṁ ādāya aggiṁ abhinibbattentu, tejo pātukarontu; āyantu pana bhonto ye tattha caṇḍālakulā nesādakulā venakulā rathakārakulā pukkusakulā uppannā sāpānadoṇiyā vā sūkaradoṇiyā vā rajakadoṇiyā vā eraṇḍakaṭṭhassa vā uttarāraṇiṁ ādāya aggiṁ abhinibbattentu, tejo pātukarontū’\"ti?",
    "mn96:17": "\"Taṁ kiṁ maññasi, brāhmaṇa, yo evaṁ nu kho so khattiyakulā brāhmaṇakulā rājaññakulā uppannehi sākassa vā sālassa vā salaḷassa vā candanassa vā padumakassa vā uttarāraṇiṁ ādāya aggi abhinibbatto tejo pātukato so eva nu khvāssa aggi accimā ceva vaṇṇavā ca pabhassaro ca tena ca sakkā agginā aggikaraṇīyaṁ kātuṁ; yo pana so caṇḍālakulā nesādakulā venakulā rathakārakulā pukkusakulā uppannehi sāpānadoṇiyā vā sūkaradoṇiyā vā rajakadoṇiyā vā eraṇḍakaṭṭhassa vā uttarāraṇiṁ ādāya aggi abhinibbatto tejo pātukato svāssa aggi na ceva accimā na ca vaṇṇavā na ca pabhassaro na ca tena sakkā agginā aggikaraṇīyaṁ kātun\"ti?",
    "mn96:18": "\"Evameva kho, brāhmaṇa, khattiyakulā cepi agārasmā anagāriyaṁ pabbajito hoti, so ca tathāgatappaveditaṁ dhammavinayaṁ āgamma pāṇātipātā paṭivirato hoti … pe … sammādiṭṭhi hoti, ārādhako hoti ñāyaṁ dhammaṁ kusalaṁ. Brāhmaṇakulā cepi, brāhmaṇa … vessakulā cepi, brāhmaṇa … suddakulā cepi, brāhmaṇa, agārasmā anagāriyaṁ pabbajito hoti, so ca tathāgatappaveditaṁ dhammavinayaṁ āgamma pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, abrahmacariyā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhi hoti, ārādhako hoti ñāyaṁ dhammaṁ kusalan\"ti.",
    "mn96:19": "Evaṁ vutte, esukārī brāhmaṇo bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}