{
    "mn99:1": "Evaṁ me sutaṁ — ​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme.",
    "mn99:2": "\"Vibhajjavādo kho ahamettha, māṇava; nāhamettha ekaṁsavādo. Gihissa vāhaṁ, māṇava, pabbajitassa vā micchāpaṭipattiṁ na vaṇṇemi. Gihī vā hi, māṇava, pabbajito vā micchāpaṭipanno micchāpaṭipattādhikaraṇahetu na ārādhako hoti ñāyaṁ dhammaṁ kusalaṁ. Gihissa vāhaṁ, māṇava, pabbajitassa vā sammāpaṭipattiṁ vaṇṇemi. Gihī vā hi, māṇava, pabbajito vā sammāpaṭipanno sammāpaṭipattādhikaraṇahetu ārādhako hoti ñāyaṁ dhammaṁ kusalan\"ti.",
    "mn99:3": "\"Brāhmaṇā, bho gotama, evamāhaṁsu: ‘mahaṭṭhamidaṁ mahākiccaṁ mahādhikaraṇaṁ mahāsamārambhaṁ gharāvāsakammaṭṭhānaṁ mahapphalaṁ hoti; appaṭṭhamidaṁ appakiccaṁ appādhikaraṇaṁ appasamārambhaṁ pabbajjā kammaṭṭhānaṁ appaphalaṁ hotī’ti. Idha bhavaṁ gotamo kimāhā\"ti.",
    "mn99:4": "\"Etthāpi kho ahaṁ, māṇava, vibhajjavādo; nāhamettha ekaṁsavādo. Atthi, māṇava, kammaṭṭhānaṁ mahaṭṭhaṁ mahākiccaṁ mahādhikaraṇaṁ mahāsamārambhaṁ, vipajjamānaṁ appaphalaṁ hoti; atthi, māṇava, kammaṭṭhānaṁ mahaṭṭhaṁ mahākiccaṁ mahādhikaraṇaṁ mahāsamārambhaṁ, sampajjamānaṁ mahapphalaṁ hoti; atthi, māṇava, kammaṭṭhānaṁ appaṭṭhaṁ appakiccaṁ appādhikaraṇaṁ appasamārambhaṁ, vipajjamānaṁ appaphalaṁ hoti; atthi, māṇava, kammaṭṭhānaṁ appaṭṭhaṁ appakiccaṁ appādhikaraṇaṁ appasamārambhaṁ sampajjamānaṁ mahapphalaṁ hoti. Katamañca, māṇava, kammaṭṭhānaṁ mahaṭṭhaṁ mahākiccaṁ mahādhikaraṇaṁ mahāsamārambhaṁ vipajjamānaṁ appaphalaṁ hoti?",
    "mn99:5": "Seyyathāpi, māṇava, kasi kammaṭṭhānaṁ mahaṭṭhaṁ mahākiccaṁ mahādhikaraṇaṁ mahāsamārambhaṁ vipajjamānaṁ appaphalaṁ hoti; evameva kho, māṇava, gharāvāsakammaṭṭhānaṁ mahaṭṭhaṁ mahākiccaṁ mahādhikaraṇaṁ mahāsamārambhaṁ vipajjamānaṁ appaphalaṁ hoti. Seyyathāpi, māṇava, kasiyeva kammaṭṭhānaṁ mahaṭṭhaṁ mahākiccaṁ mahādhikaraṇaṁ mahāsamārambhaṁ sampajjamānaṁ mahapphalaṁ hoti; evameva kho, māṇava, gharāvāsakammaṭṭhānaṁ mahaṭṭhaṁ mahākiccaṁ mahādhikaraṇaṁ mahāsamārambhaṁ sampajjamānaṁ mahapphalaṁ hoti. Seyyathāpi, māṇava, vaṇijjā kammaṭṭhānaṁ appaṭṭhaṁ appakiccaṁ appādhikaraṇaṁ appasamārambhaṁ vipajjamānaṁ appaphalaṁ hoti; evameva kho, māṇava, pabbajjā kammaṭṭhānaṁ appaṭṭhaṁ appakiccaṁ appādhikaraṇaṁ appasamārambhaṁ vipajjamānaṁ appaphalaṁ hoti. Seyyathāpi, māṇava, vaṇijjāyeva kammaṭṭhānaṁ appaṭṭhaṁ appakiccaṁ appādhikaraṇaṁ appasamārambhaṁ sampajjamānaṁ mahapphalaṁ hoti; evameva kho, māṇava, pabbajjā kammaṭṭhānaṁ appaṭṭhaṁ appakiccaṁ appādhikaraṇaṁ appasamārambhaṁ sampajjamānaṁ mahapphalaṁ hotī\"ti.",
    "mn99:6": "\"Brāhmaṇā, bho gotama, pañca dhamme paññapenti puññassa kiriyāya, kusalassa ārādhanāyā\"ti.",
    "mn99:7": "\"Kiṁ pana, māṇava, atthi koci brāhmaṇānaṁ ekabrāhmaṇopi yo evamāha: ‘Ahaṁ imesaṁ pañcannaṁ dhammānaṁ sayaṁ abhiññā sacchikatvā vipākaṁ pavedemī’\"ti? \"No hidaṁ, bho gotama\".",
    "mn99:8": "\"Iti kira, māṇava, natthi koci brāhmaṇānaṁ ekabrāhmaṇopi yo evamāha: ‘Ahaṁ imesaṁ pañcannaṁ dhammānaṁ sayaṁ abhiññā sacchikatvā vipākaṁ pavedemī’ti; natthi koci brāhmaṇānaṁ ekācariyopi ekācariyapācariyopi yāva sattamā ācariyamahayugāpi yo evamāha: ‘Ahaṁ imesaṁ pañcannaṁ dhammānaṁ sayaṁ abhiññā sacchikatvā vipākaṁ pavedemī’ti; yepi te brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti tadanubhāsanti bhāsitamanubhāsanti vācitamanuvācenti, seyyathidaṁ — aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu. Tepi na evamāhaṁsu: ‘mayaṁ imesaṁ pañcannaṁ dhammānaṁ sayaṁ abhiññā sacchikatvā vipākaṁ pavedemā’ti.",
    "mn99:9": "Seyyathāpi, māṇava, andhaveṇi paramparāsaṁsattā purimopi na passati majjhimopi na passati pacchimopi na passati; evameva kho, māṇava, andhaveṇūpamaṁ maññe brāhmaṇānaṁ bhāsitaṁ sampajjati — purimopi na passati majjhimopi na passati pacchimopi na passatī\"ti.",
    "mn99:10": "Evaṁ vutte, subho māṇavo todeyyaputto bhagavatā andhaveṇūpamena vuccamāno kupito anattamano bhagavantaṁyeva khuṁsento bhagavantaṁyeva vambhento bhagavantaṁyeva vadamāno: \"Samaṇo gotamo pāpito bhavissatī\"ti bhagavantaṁ etadavoca: \"brāhmaṇo, bho gotama, pokkharasāti opamañño subhagavaniko evamāha: ‘evamevapanidhekaccesamaṇabrāhmaṇā uttari manussadhammā alamariyañāṇadassanavisesaṁ paṭijānanti. Tesamidaṁ bhāsitaṁ hassakaṁyeva sampajjati, nāmakaṁyeva sampajjati, rittakaṁyeva sampajjati, tucchakaṁyeva sampajjati. Kathañhi nāma manussabhūto uttari manussadhammā alamariyañāṇadassanavisesaṁ ñassati vā dakkhati vā sacchi vā karissatīti — netaṁ ṭhānaṁ vijjatī’\"ti?",
    "mn99:11": "\"Kiṁ pana, māṇava, brāhmaṇo pokkharasāti opamañño subhagavaniko sabbesaṁyeva samaṇabrāhmaṇānaṁ cetasā ceto paricca pajānātī\"ti?",
    "mn99:12": "\"Seyyathāpi, māṇava, jaccandho puriso na passeyya kaṇhasukkāni rūpāni, na passeyya nīlakāni rūpāni, na passeyya pītakāni rūpāni, na passeyya lohitakāni rūpāni, na passeyya mañjiṭṭhakāni rūpāni, na passeyya samavisamaṁ, na passeyya tārakarūpāni, na passeyya candimasūriye. So evaṁ vadeyya: ‘Natthi kaṇhasukkāni rūpāni, natthi kaṇhasukkānaṁ rūpānaṁ dassāvī; natthi nīlakāni rūpāni, natthi nīlakānaṁ rūpānaṁ dassāvī; natthi pītakāni rūpāni, natthi pītakānaṁ rūpānaṁ dassāvī; natthi lohitakāni rūpāni, natthi lohitakānaṁ rūpānaṁ dassāvī; natthi mañjiṭṭhakāni rūpāni, natthi mañjiṭṭhakānaṁ rūpānaṁ dassāvī; natthi samavisamaṁ, natthi samavisamassa dassāvī; natthi tārakarūpāni, natthi tārakarūpānaṁ dassāvī; natthi candimasūriyā, natthi candimasūriyānaṁ dassāvī. Ahametaṁ na jānāmi, ahametaṁ na passāmi; tasmā taṁ natthī’ti. Sammā nu kho so, māṇava, vadamāno vadeyyā\"ti?",
    "mn99:13": "\"No hidaṁ, bho gotama. Atthi kaṇhasukkāni rūpāni, atthi kaṇhasukkānaṁ rūpānaṁ dassāvī; atthi nīlakāni rūpāni, atthi nīlakānaṁ rūpānaṁ dassāvī; atthi pītakāni rūpāni, atthi pītakānaṁ rūpānaṁ dassāvī; atthi lohitakāni rūpāni, atthi lohitakānaṁ rūpānaṁ dassāvī; atthi mañjiṭṭhakāni rūpāni, atthi mañjiṭṭhakānaṁ rūpānaṁ dassāvī; atthi samavisamaṁ, atthi samavisamassa dassāvī; atthi tārakarūpāni, atthi tārakarūpānaṁ dassāvī; atthi candimasūriyā, atthi candimasūriyānaṁ dassāvī. ‘Ahametaṁ na jānāmi, ahametaṁ na passāmi; tasmā taṁ natthī’ti; na hi so, bho gotama, sammā vadamāno vadeyyā\"ti.",
    "mn99:14": "\"Evameva kho, māṇava, brāhmaṇo pokkharasāti opamañño subhagavaniko andho acakkhuko. So vata uttari manussadhammā alamariyañāṇadassanavisesaṁ ñassati vā dakkhati vā sacchi vā karissatīti — netaṁ ṭhānaṁ vijjati.",
    "mn99:15": "Taṁ kiṁ maññasi, māṇava, ye te kosalakā brāhmaṇamahāsālā, seyyathidaṁ — caṅkī brāhmaṇo tārukkho brāhmaṇo pokkharasāti brāhmaṇo jāṇussoṇi brāhmaṇo pitācate todeyyo, katamā nesaṁseyyo, yaṁ vā tesammuccāvācaṁ bhāseyyuṁ yaṁ vā asammuccā\"ti?",
    "mn99:16": "\"Katamā nesaṁ seyyo, yaṁ vā te mantā vācaṁ bhāseyyuṁ yaṁ vā amantā\"ti?",
    "mn99:17": "\"Katamā nesaṁ seyyo, yaṁ vā te paṭisaṅkhāya vācaṁ bhāseyyuṁ yaṁ vā appaṭisaṅkhāyā\"ti?",
    "mn99:18": "\"Katamā nesaṁ seyyo, yaṁ vā te atthasaṁhitaṁ vācaṁ bhāseyyuṁ yaṁ vā anatthasaṁhitan\"ti?",
    "mn99:19": "\"Taṁ kiṁ maññasi, māṇava, yadi evaṁ sante, brāhmaṇena pokkharasātinā opamaññena subhagavanikena sammuccā vācā bhāsitāasammuccā\"ti?",
    "mn99:20": "\"Mantā vācā bhāsitā amantā vā\"ti?",
    "mn99:21": "\"Paṭisaṅkhāya vācā bhāsitā appaṭisaṅkhāyā\"ti?",
    "mn99:22": "\"Atthasaṁhitā vācā bhāsitā anatthasaṁhitā\"ti?",
    "mn99:23": "\"Pañca kho ime, māṇava, nīvaraṇā. Katame pañca? Kāmacchandanīvaraṇaṁ, byāpādanīvaraṇaṁ, thinamiddhanīvaraṇaṁ uddhaccakukkuccanīvaraṇaṁ, vicikicchānīvaraṇaṁ — ime kho, māṇava, pañca nīvaraṇā. Imehi kho, māṇava, pañcahi nīvaraṇehi brāhmaṇo pokkharasāti opamañño subhagavaniko āvuto nivutoophuṭopariyonaddho. So vata uttari manussadhammā alamariyañāṇadassanavisesaṁ ñassati vā dakkhati vā sacchi vā karissatīti — netaṁ ṭhānaṁ vijjati.",
    "mn99:24": "Pañca kho ime, māṇava, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā; sotaviññeyyā saddā … pe … ghānaviññeyyā gandhā … jivhā viññeyyā rasā … kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā — ime kho, māṇava, pañca kāmaguṇā. Imehi kho, māṇava, pañcahi kāmaguṇehi brāhmaṇo pokkharasāti opamañño subhagavaniko gathito mucchito ajjhopanno anādīnavadassāvī anissaraṇapañño paribhuñjati. So vata uttari manussadhammā alamariyañāṇadassanavisesaṁ ñassati vā dakkhati vā sacchi vā karissatīti — netaṁ ṭhānaṁ vijjati.",
    "mn99:25": "Taṁ kiṁ maññasi, māṇava, yaṁ vā tiṇakaṭṭhupādānaṁ paṭicca aggiṁ jāleyya yaṁ vā nissaṭṭhatiṇakaṭṭhupādānaṁ aggiṁ jāleyya, katamo nu khvāssa aggi accimā ceva vaṇṇavā ca pabhassaro cā\"ti?",
    "mn99:26": "Katamā ca, māṇava, pīti aññatreva kāmehi aññatra akusalehi dhammehi? Idha, māṇava, bhikkhu vivicceva kāmehi … pe … paṭhamaṁ jhānaṁ upasampajja viharati. Ayampi kho, māṇava, pīti aññatreva kāmehi aññatra akusalehi dhammehi. Puna caparaṁ, māṇava, bhikkhu vitakkavicārānaṁ vūpasamā … dutiyaṁ jhānaṁ upasampajja viharati. Ayampi kho, māṇava, pīti aññatreva kāmehi aññatra akusalehi dhammehi.",
    "mn99:27": "Ye te, māṇava, brāhmaṇā pañca dhamme paññapenti puññassa kiriyāya kusalassa ārādhanāya,katametthabrāhmaṇā dhammaṁ mahapphalataraṁ paññapenti puññassa kiriyāya kusalassa ārādhanāyā\"ti?",
    "mn99:28": "\"Taṁ kiṁ maññasi, māṇava, idha aññatarassa brāhmaṇassa mahāyañño paccupaṭṭhito assa. Atha dve brāhmaṇā āgaccheyyuṁ: ‘itthannāmassa brāhmaṇassa mahāyaññaṁ anubhavissāmā’ti.Tatrekassabrāhmaṇassa evamassa: ‘aho vata ahameva labheyyaṁ bhattagge aggāsanaṁ aggodakaṁ aggapiṇḍaṁ, na añño brāhmaṇo labheyya bhattagge aggāsanaṁ aggodakaṁ aggapiṇḍan’ti. Ṭhānaṁ kho panetaṁ, māṇava, vijjati yaṁ añño brāhmaṇo labheyya bhattagge aggāsanaṁ aggodakaṁ aggapiṇḍaṁ, na so brāhmaṇo labheyya bhattagge aggāsanaṁ aggodakaṁ aggapiṇḍaṁ. ‘Añño brāhmaṇo labhati bhattagge aggāsanaṁ aggodakaṁ aggapiṇḍaṁ, nāhaṁ labhāmi bhattagge aggāsanaṁ aggodakaṁ aggapiṇḍan’ti — iti so kupito hoti anattamano. Imassa pana, māṇava, brāhmaṇā kiṁ vipākaṁ paññapentī\"ti?",
    "mn99:29": "\"Ye te, māṇava, brāhmaṇā pañca dhamme paññapenti puññassa kiriyāya kusalassa ārādhanāya, ime tvaṁ pañca dhamme kattha bahulaṁ samanupassasi — gahaṭṭhesu vā pabbajitesu vā\"ti?",
    "mn99:30": "\"Ye te, māṇava, brāhmaṇā pañca dhamme paññapenti puññassa kiriyāya kusalassa ārādhanāya cittassāhaṁ ete parikkhāre vadāmi — yadidaṁ cittaṁ averaṁ abyābajjhaṁ tassa bhāvanāya. Idha, māṇava, bhikkhu saccavādī hoti. So ‘saccavādīmhī’ti labhati atthavedaṁ, labhati dhammavedaṁ, labhati dhammūpasaṁhitaṁ pāmojjaṁ. Yaṁ taṁ kusalūpasaṁhitaṁ pāmojjaṁ, cittassāhaṁ etaṁ parikkhāraṁ vadāmi — yadidaṁ cittaṁ averaṁ abyābajjhaṁ tassa bhāvanāya. Idha, māṇava, bhikkhu tapassī hoti … pe … brahmacārī hoti … pe … sajjhāyabahulo hoti … pe … cāgabahulo hoti. So ‘cāgabahulomhī’ti labhati atthavedaṁ, labhati dhammavedaṁ, labhati dhammūpasaṁhitaṁ pāmojjaṁ. Yaṁ taṁ kusalūpasaṁhitaṁ pāmojjaṁ, cittassāhaṁ etaṁ parikkhāraṁ vadāmi — yadidaṁ cittaṁ averaṁ abyābajjhaṁ tassa bhāvanāya. Ye te, māṇava, brāhmaṇā pañca dhamme paññapenti puññassa kiriyāya kusalassa ārādhanāya, cittassāhaṁ ete parikkhāre vadāmi –  yadidaṁ cittaṁ averaṁ abyābajjhaṁ tassa bhāvanāyā\"ti.",
    "mn99:31": "Evaṁ vutte, subho māṇavo todeyyaputto bhagavantaṁ etadavoca: \"sutaṁ metaṁ, bho gotama: ‘samaṇo gotamo brahmānaṁ sahabyatāya maggaṁ jānātī’\"ti.",
    "mn99:32": "\"Taṁ kiṁ maññasi, māṇava, āsanne ito naḷakāragāmo, na yito dūre naḷakāragāmo\"ti?",
    "mn99:33": "\"Evaṁ, bho, āsanne ito naḷakāragāmo, na yito dūre naḷakāragāmo\"ti.",
    "mn99:34": "\"Taṁ, kiṁ maññasi, māṇava, idhassa puriso naḷakāragāmejātavaddho; tamenaṁ naḷakāragāmato tāvadevaavasaṭaṁnaḷakāragāmassa maggaṁ puccheyyuṁ; siyā nu kho, māṇava, tassa purisassa naḷakāragāme jātavaddhassa naḷakāragāmassa maggaṁ puṭṭhassa dandhāyitattaṁ vā vitthāyitattaṁ vā\"ti?",
    "mn99:35": "\"No hidaṁ, bho gotama\".",
    "mn99:36": "\"Taṁ kissa hetu\"?",
    "mn99:37": "\"Amu hi, bho gotama, puriso naḷakāragāme jātavaddho. Tassa sabbāneva naḷakāragāmassa maggāni suviditānī\"ti.",
    "mn99:38": "\"Sutaṁ metaṁ, bho gotama: ‘samaṇo gotamo brahmānaṁ sahabyatāya maggaṁ desetī’ti. Sādhu me bhavaṁ gotamo brahmānaṁ sahabyatāya maggaṁ desetū\"ti.",
    "mn99:39": "\"Tena hi, māṇava, suṇāhi, sādhukaṁ manasi karohi, bhāsissāmī\"ti.",
    "mn99:40": "\"Katamo ca, māṇava, brahmānaṁ sahabyatāya maggo? Idha, māṇava, bhikkhu mettāsahagatena cetasā ekaṁ disaṁ pharitvā viharati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Evaṁ bhāvitāya kho, māṇava, mettāya cetovimuttiyā yaṁ pamāṇakataṁ kammaṁ na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati. Seyyathāpi, māṇava, balavā saṅkhadhamo appakasireneva cātuddisā viññāpeyya;evameva kho, māṇava … pe … evaṁ bhāvitāya kho, māṇava, mettāyacetovimuttiyā yaṁ pamāṇakataṁ kammaṁ na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati. Ayampi kho, māṇava, brahmānaṁ sahabyatāya maggo.",
    "mn99:41": "\"Puna caparaṁ, māṇava, bhikkhu karuṇāsahagatena cetasā … pe … muditāsahagatena cetasā … pe … upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā viharati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ; iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Evaṁ bhāvitāya kho, māṇava, upekkhāya cetovimuttiyā yaṁ pamāṇakataṁ kammaṁ na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati. Seyyathāpi, māṇava, balavā saṅkhadhamo appakasireneva cātuddisā viññāpeyya; evameva kho, māṇava … pe … evaṁ bhāvitāya kho, māṇava, upekkhāya cetovimuttiyā yaṁ pamāṇakataṁ kammaṁ na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati. Ayampi kho, māṇava, brahmānaṁ sahabyatāya maggo\"ti.",
    "mn99:42": "Evaṁ vutte, subho māṇavo todeyyaputto bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gataṁ.",
    "mn99:43": "Tena kho pana samayena jāṇussoṇi brāhmaṇo sabbasetenavaḷavābhirathenasāvatthiyā niyyāti divā divassa. Addasā kho jāṇussoṇi brāhmaṇo subhaṁ māṇavaṁ todeyyaputtaṁ dūratova āgacchantaṁ. Disvāna subhaṁ māṇavaṁ todeyyaputtaṁ etadavoca: \"handa kuto nu bhavaṁ bhāradvājo āgacchati divā divassā\"ti?",
    "mn99:44": "Evaṁ vutte, jāṇussoṇi brāhmaṇo sabbasetā vaḷavābhirathā orohitvā ekaṁsaṁ uttarāsaṅgaṁ karitvā yena bhagavā tenañjaliṁ paṇāmetvā udānaṁ udānesi: \"lābhā rañño pasenadissa kosalassa, suladdhalābhā rañño pasenadissa kosalassa yassa vijite tathāgato viharati arahaṁ sammāsambuddho\"ti."
}