{
    "an10.51:1": "Ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi:  \"bhikkhavo\"ti.",
    "an10.51:2": "\"No ce, bhikkhave, bhikkhu paracittapariyāyakusalo hoti, atha ‘sacittapariyāyakusalo bhavissāmī’ti – evañhi vo, bhikkhave, sikkhitabbaṁ.",
    "an10.51:3": "Kathañca, bhikkhave, bhikkhu sacittapariyāyakusalo hoti? Seyyathāpi, bhikkhave, itthī vā puriso vā daharo yuvā maṇḍanakajātiko ādāse vā parisuddhe pariyodāte acche vā udakapatte sakaṁ mukhanimittaṁ paccavekkhamāno sace tattha passati rajaṁ vā aṅgaṇaṁ vā, tasseva rajassa vā aṅgaṇassa vā pahānāya vāyamati. No ce tattha passati rajaṁ vā aṅgaṇaṁ vā, tenevattamano hoti paripuṇṇasaṅkappo:  ‘lābhā vata me, parisuddhaṁ vata me’ti. Evamevaṁ kho, bhikkhave, bhikkhuno paccavekkhaṇā bahukārā hoti kusalesu dhammesu:",
    "an10.51:4": "Sace, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘abhijjhālu bahulaṁ viharāmi, byāpannacitto bahulaṁ viharāmi, thinamiddhapariyuṭṭhito bahulaṁ viharāmi, uddhato bahulaṁ viharāmi, vicikiccho bahulaṁ viharāmi, kodhano bahulaṁ viharāmi, saṅkiliṭṭhacitto bahulaṁ viharāmi, sāraddhakāyo bahulaṁ viharāmi, kusīto bahulaṁ viharāmi, asamāhito bahulaṁ viharāmī’ti, tena, bhikkhave, bhikkhunā tesaṁyeva pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṁ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā. Tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṁ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya. Evamevaṁ kho tena, bhikkhave, bhikkhunā tesaṁyeva pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṁ.",
    "an10.51:5": "Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘anabhijjhālu bahulaṁ viharāmi, abyāpannacitto bahulaṁ viharāmi, vigatathinamiddho bahulaṁ viharāmi, anuddhato bahulaṁ viharāmi, tiṇṇavicikiccho bahulaṁ viharāmi, akkodhano bahulaṁ viharāmi, asaṅkiliṭṭhacitto bahulaṁ viharāmi, asāraddhakāyo bahulaṁ viharāmi, āraddhavīriyo bahulaṁ viharāmi, samāhito bahulaṁ viharāmī’ti, tena, bhikkhave, bhikkhunā tesuyeva kusalesu dhammesu patiṭṭhāya uttari āsavānaṁ khayāya yogo karaṇīyo\"ti."
}