{
    "an10.219:1": "\"Nāhaṁ, bhikkhave, sañcetanikānaṁ kammānaṁ katānaṁ upacitānaṁ appaṭisaṁveditvā byantībhāvaṁ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṁ, bhikkhave, sañcetanikānaṁ kammānaṁ katānaṁ upacitānaṁ appaṭisaṁveditvā dukkhassantakiriyaṁ vadāmi.",
    "an10.219:2": "Sa kho so, bhikkhave, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṁ disaṁ pharitvā viharati tathā dutiyaṁ tathā tatiyaṁ tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati.",
    "an10.219:3": "So evaṁ pajānāti:  ‘pubbe kho me idaṁ cittaṁ parittaṁ ahosi abhāvitaṁ, etarahi pana me idaṁ cittaṁ appamāṇaṁ subhāvitaṁ. Yaṁ kho pana kiñci pamāṇakataṁ kammaṁ, na taṁ tatrāvasissati na taṁ tatrāvatiṭṭhatī’ti.",
    "an10.219:4": "Taṁ kiṁ maññatha, bhikkhave, dāhāratagge ce so ayaṁ kumāro mettaṁ cetovimuttiṁ bhāveyya, api nu kho pāpakammaṁ kareyyā\"ti?",
    "an10.219:5": "\"Akarontaṁ kho pana pāpakammaṁ api nu kho dukkhaṁ phuseyyā\"ti? \"No hetaṁ, bhante. Akarontañhi, bhante, pāpakammaṁ kuto dukkhaṁ phusissatī\"ti.",
    "an10.219:6": "\"Bhāvetabbā kho panāyaṁ, bhikkhave, mettācetovimutti itthiyā vā purisena vā. Itthiyā vā, bhikkhave, purisassa vā nāyaṁ kāyo ādāya gamanīyo. Cittantaro ayaṁ, bhikkhave, macco.",
    "an10.219:7": "Karuṇāsahagatena cetasā … muditāsahagatena cetasā … upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā viharati tathā dutiyaṁ tathā tatiyaṁ tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati.",
    "an10.219:8": "So evaṁ pajānāti:  ‘pubbe kho me idaṁ cittaṁ parittaṁ ahosi abhāvitaṁ, etarahi pana me idaṁ cittaṁ appamāṇaṁ subhāvitaṁ. Yaṁ kho pana kiñci pamāṇakataṁ kammaṁ, na taṁ tatrāvasissati na taṁ tatrāvatiṭṭhatī’ti.",
    "an10.219:9": "Taṁ kiṁ maññatha, bhikkhave, dāhāratagge ce so ayaṁ kumāro upekkhaṁ cetovimuttiṁ bhāveyya, api nu kho pāpakammaṁ kareyyā\"ti?",
    "an10.219:10": "\"Akarontaṁ kho pana pāpakammaṁ api nu kho dukkhaṁ phuseyyā\"ti?",
    "an10.219:11": "\"Bhāvetabbā kho panāyaṁ, bhikkhave, upekkhā cetovimutti itthiyā vā purisena vā. Itthiyā vā, bhikkhave, purisassa vā nāyaṁ kāyo ādāya gamanīyo. Cittantaro ayaṁ, bhikkhave, macco."
}