{
    "an10.86:1": "Ekaṁ samayaṁ āyasmā mahākassapo rājagahe viharati veḷuvane kalandakanivāpe. Tatra kho āyasmā mahākassapo bhikkhū āmantesi:  \"āvuso bhikkhave\"ti.",
    "an10.86:2": "\"Idhāvuso, bhikkhu aññaṁ byākaroti:  ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti.",
    "an10.86:3": "Tamenaṁ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṁ cetasā ceto paricca manasi karoti:  ‘kiṁ nu kho ayamāyasmā aññaṁ byākaroti – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti.",
    "an10.86:4": "Tamenaṁ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṁ cetasā ceto paricca pajānāti:",
    "an10.86:5": "‘Adhimāniko kho ayamāyasmā adhimānasacco, appatte pattasaññī, akate katasaññī, anadhigate adhigatasaññī. Adhimānena aññaṁ byākaroti – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti.",
    "an10.86:6": "Tamenaṁ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṁ cetasā ceto paricca manasi karoti:  ‘kiṁ nu kho ayamāyasmā nissāya adhimāniko adhimānasacco, appatte pattasaññī, akate katasaññī, anadhigate adhigatasaññī. Adhimānena aññaṁ byākaroti – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti.",
    "an10.86:7": "Tamenaṁ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṁ cetasā ceto paricca pajānāti:",
    "an10.86:8": "‘Bahussuto kho pana ayamāyasmā sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Tasmā ayamāyasmā adhimāniko adhimānasacco, appatte pattasaññī, akate katasaññī, anadhigate adhigatasaññī. Adhimānena aññaṁ byākaroti – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti.",
    "an10.86:9": "Tamenaṁ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṁ cetasā ceto paricca pajānāti:",
    "an10.86:10": "‘Abhijjhālu kho pana ayamāyasmā; abhijjhāpariyuṭṭhitena cetasā bahulaṁ viharati. Abhijjhāpariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(1)",
    "an10.86:11": "Byāpanno kho pana ayamāyasmā; byāpādapariyuṭṭhitena cetasā bahulaṁ viharati. Byāpādapariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(2)",
    "an10.86:12": "Thinamiddho kho pana ayamāyasmā; thinamiddhapariyuṭṭhitena cetasā bahulaṁ viharati. Thinamiddhapariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(3)",
    "an10.86:13": "Uddhato kho pana ayamāyasmā; uddhaccapariyuṭṭhitena cetasā bahulaṁ viharati. Uddhaccapariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(4)",
    "an10.86:14": "Vicikiccho kho pana ayamāyasmā; vicikicchāpariyuṭṭhitena cetasā bahulaṁ viharati. Vicikicchāpariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(5)",
    "an10.86:15": "Kammārāmo kho pana ayamāyasmā kammarato kammārāmataṁ anuyutto. Kammārāmatā kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(6)",
    "an10.86:16": "Bhassārāmo kho pana ayamāyasmā bhassarato bhassārāmataṁ anuyutto. Bhassārāmatā kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(7)",
    "an10.86:17": "Niddārāmo kho pana ayamāyasmā niddārato niddārāmataṁ anuyutto. Niddārāmatā kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(8)",
    "an10.86:18": "Saṅgaṇikārāmo kho pana ayamāyasmā saṅgaṇikarato saṅgaṇikārāmataṁ anuyutto. Saṅgaṇikārāmatā kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(9)",
    "an10.86:19": "Sati kho pana ayamāyasmā uttari karaṇīye oramattakena visesādhigamena antarā vosānaṁ āpanno. Antarā vosānagamanaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ’.(10)",
    "an10.86:20": "So vatāvuso, bhikkhu ‘ime dasa dhamme appahāya imasmiṁ dhammavinaye vuddhiṁ virūḷhiṁ vepullaṁ āpajjissatī’ti netaṁ ṭhānaṁ vijjati. So vatāvuso, bhikkhu ‘ime dasa dhamme pahāya imasmiṁ dhammavinaye vuddhiṁ virūḷhiṁ vepullaṁ āpajjissatī’ti ṭhānametaṁ vijjatī\"ti."
}