{
    "an10.94:1": "Ekaṁ samayaṁ bhagavā campāyaṁ viharati gaggarāya pokkharaṇiyā tīre. Atha kho vajjiyamāhito gahapati divā divassa campāya nikkhami bhagavantaṁ dassanāya. Atha kho vajjiyamāhitassa gahapatissa etadahosi:  \"akālo kho tāva bhagavantaṁ dassanāya. Paṭisallīno bhagavā. Manobhāvanīyānampi bhikkhūnaṁ akālo dassanāya. Paṭisallīnā manobhāvanīyāpi bhikkhū. Yannūnāhaṁ yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkameyyan\"ti.",
    "an10.94:2": "Atha kho vajjiyamāhito gahapati yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkami. Tena kho pana samayena te aññatitthiyā paribbājakā saṅgamma samāgamma unnādino uccāsaddamahāsaddā anekavihitaṁ tiracchānakathaṁ kathentā nisinnā honti.",
    "an10.94:3": "Addasaṁsu kho te aññatitthiyā paribbājakā vajjiyamāhitaṁ gahapatiṁ dūratova āgacchantaṁ. Disvāna aññamaññaṁ saṇṭhāpesuṁ:  \"appasaddā bhonto hontu. Mā bhonto saddamakattha. Ayaṁ vajjiyamāhito gahapati āgacchati samaṇassa gotamassa sāvako. Yāvatā kho pana samaṇassa gotamassa sāvakā gihī odātavasanā campāyaṁ paṭivasanti, ayaṁ tesaṁ aññataro vajjiyamāhito gahapati. Appasaddakāmā kho pana te āyasmanto appasaddavinītā appasaddassa vaṇṇavādino. Appeva nāma appasaddaṁ parisaṁ viditvā upasaṅkamitabbaṁ maññeyyā\"ti.",
    "an10.94:4": "Atha kho te aññatitthiyā paribbājakā tuṇhī ahesuṁ.",
    "an10.94:5": "Evaṁ vutte, aññataro paribbājako vajjiyamāhitaṁ gahapatiṁ etadavoca:  \"Āgamehi tvaṁ, gahapati, yassa tvaṁ samaṇassa gotamassa vaṇṇaṁ bhāsati, samaṇo gotamo venayiko appaññattiko\"ti?",
    "an10.94:6": "Evaṁ vutte te paribbājakā tuṇhībhūtā maṅkubhūtā pattakkhandhā adhomukhā pajjhāyantā appaṭibhānā nisīdiṁsu. Atha kho vajjiyamāhito gahapati te paribbājake tuṇhībhūte maṅkubhūte pattakkhandhe adhomukhe pajjhāyante appaṭibhāne viditvā uṭṭhāyāsanā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho vajjiyamāhito gahapati yāvatako ahosi tehi aññatitthiyehi paribbājakehi saddhiṁ kathāsallāpo taṁ sabbaṁ bhagavato ārocesi.",
    "an10.94:7": "\"Sādhu sādhu, gahapati. Evaṁ kho te, gahapati, moghapurisā kālena kālaṁ sahadhammena suniggahitaṁ niggahetabbā.",
    "an10.94:8": "Yañhi, gahapati, tapaṁ tapato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṁ tapaṁ na tapitabbanti vadāmi. Yañca khvassa, gahapati, tapaṁ tapato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpaṁ tapaṁ tapitabbanti vadāmi.",
    "an10.94:9": "Yañhi, gahapati, samādānaṁ samādiyato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṁ samādānaṁ na samāditabbanti vadāmi. Yañca khvassa, gahapati, samādānaṁ samādiyato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpaṁ samādānaṁ samāditabbanti vadāmi.",
    "an10.94:10": "Yañhi, gahapati, padhānaṁ padahato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṁ padhānaṁ na padahitabbanti vadāmi. Yañca khvassa, gahapati, padhānaṁ padahato akusalā dhammā parihāyanti kusalā dhammā abhivaḍḍhanti, evarūpaṁ padhānaṁ padahitabbanti vadāmi.",
    "an10.94:11": "Yañhi, gahapati, paṭinissaggaṁ paṭinissajjato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpo paṭinissaggo na paṭinissajjitabboti vadāmi. Yañca khvassa, gahapati, paṭinissaggaṁ paṭinissajjato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpo paṭinissaggo paṭinissajjitabboti vadāmi.",
    "an10.94:12": "Yañhi, gahapati, vimuttiṁ vimuccato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpā vimutti na vimuccitabbāti vadāmi. Yañca khvassa, gahapati, vimuttiṁ vimuccato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpā vimutti vimuccitabbāti vadāmī\"ti.",
    "an10.94:13": "Atha kho vajjiyamāhito gahapati bhagavatā dhammiyā kathāya sandassito samādapito samuttejito sampahaṁsito uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā pakkāmi.",
    "an10.94:14": "Atha kho bhagavā acirapakkante vajjiyamāhite gahapatimhi bhikkhū āmantesi:  \"yopi so, bhikkhave, bhikkhu dīgharattaṁ apparajakkho imasmiṁ dhammavinaye, sopi evamevaṁ aññatitthiye paribbājake sahadhammena suniggahitaṁ niggaṇheyya yathā taṁ vajjiyamāhitena gahapatinā niggahitā\"ti."
}