{
    "an10.84:1": "Tatra kho āyasmā mahāmoggallāno bhikkhū āmantesi:  \"āvuso bhikkhave\"ti.",
    "an10.84:2": "\"Idhāvuso, bhikkhu aññaṁ byākaroti:  ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti. Tamenaṁ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo samanuyuñjati samanuggāhati samanubhāsati. So tathāgatena vā tathāgatasāvakena vā jhāyinā samāpattikusalena paracittakusalena paracittapariyāyakusalena samanuyuñjiyamāno samanuggāhiyamāno samanubhāsiyamāno irīṇaṁ āpajjati vicinaṁ āpajjati anayaṁ āpajjati byasanaṁ āpajjati anayabyasanaṁ āpajjati.",
    "an10.84:3": "Tamenaṁ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṁ cetasā ceto paricca manasi karoti:  ‘kiṁ nu kho ayamāyasmā aññaṁ byākaroti – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti?",
    "an10.84:4": "Tamenaṁ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṁ cetasā ceto paricca pajānāti:",
    "an10.84:5": "‘Kodhano kho ayamāyasmā; kodhapariyuṭṭhitena cetasā bahulaṁ viharati. Kodhapariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(1)",
    "an10.84:6": "Upanāhī kho pana ayamāyasmā; upanāhapariyuṭṭhitena cetasā bahulaṁ viharati. Upanāhapariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(2)",
    "an10.84:7": "Makkhī kho pana ayamāyasmā; makkhapariyuṭṭhitena cetasā bahulaṁ viharati. Makkhapariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(3)",
    "an10.84:8": "Paḷāsī kho pana ayamāyasmā; paḷāsapariyuṭṭhitena cetasā bahulaṁ viharati. Paḷāsapariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(4)",
    "an10.84:9": "Issukī kho pana ayamāyasmā; issāpariyuṭṭhitena cetasā bahulaṁ viharati. Issāpariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(5)",
    "an10.84:10": "Maccharī kho pana ayamāyasmā; maccherapariyuṭṭhitena cetasā bahulaṁ viharati. Maccherapariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(6)",
    "an10.84:11": "Saṭho kho pana ayamāyasmā; sāṭheyyapariyuṭṭhitena cetasā bahulaṁ viharati. Sāṭheyyapariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(7)",
    "an10.84:12": "Māyāvī kho pana ayamāyasmā; māyāpariyuṭṭhitena cetasā bahulaṁ viharati. Māyāpariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(8)",
    "an10.84:13": "Pāpiccho kho pana ayamāyasmā; icchāpariyuṭṭhitena cetasā bahulaṁ viharati. Icchāpariyuṭṭhānaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ.(9)",
    "an10.84:14": "Sati kho pana ayamāyasmā uttari karaṇīye oramattakena visesādhigamena antarā vosānaṁ āpanno. Antarā vosānagamanaṁ kho pana tathāgatappavedite dhammavinaye parihānametaṁ’.(10)",
    "an10.84:15": "So vatāvuso, bhikkhu ‘ime dasa dhamme appahāya imasmiṁ dhammavinaye vuddhiṁ virūḷhiṁ vepullaṁ āpajjissatī’ti netaṁ ṭhānaṁ vijjati. So vatāvuso, bhikkhu ‘ime dasa dhamme pahāya imasmiṁ dhammavinaye vuddhiṁ virūḷhiṁ vepullaṁ āpajjissatī’ti ṭhānametaṁ vijjatī\"ti."
}