{
    "an10.108:1": "\"Tikicchakā, bhikkhave, virecanaṁ denti pittasamuṭṭhānānampi ābādhānaṁ paṭighātāya, semhasamuṭṭhānānampi ābādhānaṁ paṭighātāya, vātasamuṭṭhānānampi ābādhānaṁ paṭighātāya. Atthetaṁ, bhikkhave, virecanaṁ; ‘netaṁ natthī’ti vadāmi. Tañca kho etaṁ, bhikkhave, virecanaṁ sampajjatipi vipajjatipi.",
    "an10.108:2": "Ahañca kho, bhikkhave, ariyaṁ virecanaṁ desessāmi, yaṁ virecanaṁ sampajjatiyeva no vipajjati, yaṁ virecanaṁ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "an10.108:3": "\"Katamañca taṁ, bhikkhave, ariyaṁ virecanaṁ, yaṁ virecanaṁ sampajjatiyeva no vipajjati, yaṁ virecanaṁ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti?",
    "an10.108:4": "Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi virittā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa virittā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti.",
    "an10.108:5": "Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo viritto hoti … pe … sammāvācassa, bhikkhave, micchāvācā virittā hoti … sammākammantassa, bhikkhave, micchākammanto viritto hoti … sammāājīvassa, bhikkhave, micchāājīvo viritto hoti … sammāvāyāmassa, bhikkhave, micchāvāyāmo viritto hoti … sammāsatissa, bhikkhave, micchāsati virittā hoti … sammāsamādhissa, bhikkhave, micchāsamādhi viritto hoti … sammāñāṇissa, bhikkhave, micchāñāṇaṁ virittaṁ hoti … pe ….",
    "an10.108:6": "Sammāvimuttissa, bhikkhave, micchāvimutti virittā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa virittā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti."
}