{
    "an10.167:1": "Tena kho pana samayena jāṇussoṇi brāhmaṇo tadahuposathe sīsaṁnhāto navaṁ khomayugaṁ nivattho allakusamuṭṭhiṁ ādāya bhagavato avidūre ekamantaṁ ṭhito hoti.",
    "an10.167:2": "Addasā kho bhagavā jāṇussoṇiṁ brāhmaṇaṁ tadahuposathe sīsaṁnhātaṁ navaṁ khomayugaṁ nivatthaṁ allakusamuṭṭhiṁ ādāya ekamantaṁ ṭhitaṁ. Disvāna jāṇussoṇiṁ brāhmaṇaṁ etadavoca:",
    "an10.167:3": "\"Yathā kathaṁ pana, brāhmaṇa, brāhmaṇānaṁ paccorohaṇī hotī\"ti?",
    "an10.167:4": "\"Aññathā kho, brāhmaṇa, brāhmaṇānaṁ paccorohaṇī hoti, aññathā ca pana ariyassa vinaye paccorohaṇī hotī\"ti.",
    "an10.167:5": "\"Tena hi, brāhmaṇa, suṇāhi, sādhukaṁ manasi karohi; bhāsissāmī\"ti.",
    "an10.167:6": "\"Idha, brāhmaṇa, ariyasāvako iti paṭisañcikkhati:  ‘pāṇātipātassa kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya pāṇātipātaṁ pajahati; pāṇātipātā paccorohati.",
    "an10.167:7": "…  ‘Adinnādānassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya adinnādānaṁ pajahati; adinnādānā paccorohati.",
    "an10.167:8": "…  ‘Kāmesumicchācārassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya kāmesumicchācāraṁ pajahati; kāmesumicchācārā paccorohati.",
    "an10.167:9": "…  ‘Musāvādassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya musāvādaṁ pajahati; musāvādā paccorohati.",
    "an10.167:10": "…  ‘Pisuṇāya vācāya kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya pisuṇaṁ vācaṁ pajahati; pisuṇāya vācāya paccorohati.",
    "an10.167:11": "…  ‘Pharusāya vācāya kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya pharusaṁ vācaṁ pajahati; pharusāya vācāya paccorohati.",
    "an10.167:12": "…  ‘Samphappalāpassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya samphappalāpaṁ pajahati; samphappalāpā paccorohati.",
    "an10.167:13": "…  ‘Abhijjhāya kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya abhijjhaṁ pajahati; abhijjhāya paccorohati.",
    "an10.167:14": "…  ‘Byāpādassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya byāpādaṁ pajahati; byāpādā paccorohati.",
    "an10.167:15": "…  ‘Micchādiṭṭhiyā kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchādiṭṭhiṁ pajahati; micchādiṭṭhiyā paccorohati.",
    "an10.167:16": "\"Aññathā kho, bho gotama, brāhmaṇānaṁ paccorohaṇī hoti, aññathā ca pana ariyassa vinaye paccorohaṇī hoti. Imissā, bho gotama, ariyassa vinaye paccorohaṇiyā brāhmaṇānaṁ paccorohaṇī kalaṁ nāgghati soḷasiṁ."
}