{
    "an10.54:1": "\"No ce, bhikkhave, bhikkhu paracittapariyāyakusalo hoti, atha ‘sacittapariyāyakusalo bhavissāmī’ti – evañhi vo, bhikkhave, sikkhitabbaṁ.",
    "an10.54:2": "Kathañca, bhikkhave, bhikkhu sacittapariyāyakusalo hoti? Seyyathāpi, bhikkhave, itthī vā puriso vā daharo yuvā maṇḍanakajātiko ādāse vā parisuddhe pariyodāte acche vā udapatte sakaṁ mukhanimittaṁ paccavekkhamāno sace tattha passati rajaṁ vā aṅgaṇaṁ vā, tasseva rajassa vā aṅgaṇassa vā pahānāya vāyamati. No ce tattha passati rajaṁ vā aṅgaṇaṁ vā, tenevattamano hoti paripuṇṇasaṅkappo:  ‘lābhā vata me, parisuddhaṁ vata me’ti.",
    "an10.54:3": "Sace, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘lābhīmhi ajjhattaṁ cetosamathassa, na lābhī adhipaññādhammavipassanāyā’ti, tena, bhikkhave, bhikkhunā ajjhattaṁ cetosamathe patiṭṭhāya adhipaññādhammavipassanāya yogo karaṇīyo. So aparena samayena lābhī ceva hoti ajjhattaṁ cetosamathassa lābhī ca adhipaññādhammavipassanāya.",
    "an10.54:4": "Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘lābhīmhi adhipaññādhammavipassanāya, na lābhī ajjhattaṁ cetosamathassā’ti, tena, bhikkhave, bhikkhunā adhipaññādhammavipassanāya patiṭṭhāya ajjhattaṁ cetosamathe yogo karaṇīyo. So aparena samayena lābhī ceva hoti adhipaññādhammavipassanāya lābhī ca ajjhattaṁ cetosamathassa.",
    "an10.54:5": "Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘Na lābhī ajjhattaṁ cetosamathassa, na lābhī adhipaññādhammavipassanāyā’ti, tena, bhikkhave, bhikkhunā tesaṁyeva kusalānaṁ dhammānaṁ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṁ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā. Tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṁ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya. Evamevaṁ kho, bhikkhave, tena bhikkhunā tesaṁyeva kusalānaṁ dhammānaṁ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṁ. So aparena samayena lābhī ceva hoti ajjhattaṁ cetosamathassa lābhī ca adhipaññādhammavipassanāya.",
    "an10.54:6": "Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘lābhīmhi ajjhattaṁ cetosamathassa, lābhī adhipaññādhammavipassanāyā’ti, tena, bhikkhave, bhikkhunā tesuyeva kusalesu dhammesu patiṭṭhāya uttari āsavānaṁ khayāya yogo karaṇīyo.",
    "an10.54:7": "Cīvarampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Piṇḍapātampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Senāsanampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Gāmanigamampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Janapadapadesampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Puggalampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi.",
    "an10.54:8": "‘Cīvarampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā cīvaraṁ:  ‘idaṁ kho me cīvaraṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpaṁ cīvaraṁ na sevitabbaṁ. Tattha yaṁ jaññā cīvaraṁ:  ‘idaṁ kho me cīvaraṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpaṁ cīvaraṁ sevitabbaṁ. ‘Cīvarampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "an10.54:9": "‘Piṇḍapātampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā piṇḍapātaṁ:  ‘imaṁ kho me piṇḍapātaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo piṇḍapāto na sevitabbo. Tattha yaṁ jaññā piṇḍapātaṁ:  ‘imaṁ kho me piṇḍapātaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo piṇḍapāto sevitabbo. ‘Piṇḍapātampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "an10.54:10": "‘Senāsanampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā senāsanaṁ:  ‘idaṁ kho me senāsanaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpaṁ senāsanaṁ na sevitabbaṁ. Tattha yaṁ jaññā senāsanaṁ:  ‘idaṁ kho me senāsanaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpaṁ senāsanaṁ sevitabbaṁ. ‘Senāsanampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "an10.54:11": "‘Gāmanigamampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā gāmanigamaṁ:  ‘imaṁ kho me gāmanigamaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo gāmanigamo na sevitabbo. Tattha yaṁ jaññā gāmanigamaṁ:  ‘imaṁ kho me gāmanigamaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo gāmanigamo sevitabbo. ‘Gāmanigamampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "an10.54:12": "‘Janapadapadesampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā janapadapadesaṁ:  ‘imaṁ kho me janapadapadesaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo janapadapadeso na sevitabbo. Tattha yaṁ jaññā janapadapadesaṁ:  ‘imaṁ kho me janapadapadesaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo janapadapadeso sevitabbo. ‘Janapadapadesampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "an10.54:13": "‘Puggalampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṁ vuttaṁ. Kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā puggalaṁ:  ‘imaṁ kho me puggalaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo puggalo na sevitabbo. Tattha yaṁ jaññā puggalaṁ:  ‘imaṁ kho me puggalaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo puggalo sevitabbo. ‘Puggalampāhaṁ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttan\"ti."
}