{
    "an10.114:1": "\"Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabbaṁ.",
    "an10.114:2": "Katamo ca, bhikkhave, adhammo, katamo ca dhammo, katamo ca anattho, katamo ca attho?",
    "an10.114:3": "Micchādiṭṭhi, bhikkhave, adhammo; sammādiṭṭhi dhammo; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(1)",
    "an10.114:4": "Micchāsaṅkappo, bhikkhave, adhammo; sammāsaṅkappo dhammo; ye ca micchāsaṅkappapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammāsaṅkappapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(2)",
    "an10.114:5": "Micchāvācā, bhikkhave, adhammo; sammāvācā dhammo; ye ca micchāvācāpaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammāvācāpaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(3)",
    "an10.114:6": "Micchākammanto, bhikkhave, adhammo; sammākammanto dhammo; ye ca micchākammantapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammākammantapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(4)",
    "an10.114:7": "Micchāājīvo, bhikkhave, adhammo; sammāājīvo dhammo; ye ca micchāājīvapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammāājīvapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(5)",
    "an10.114:8": "Micchāvāyāmo, bhikkhave, adhammo; sammāvāyāmo dhammo; ye ca micchāvāyāmapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammāvāyāmapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(6)",
    "an10.114:9": "Micchāsati, bhikkhave, adhammo; sammāsati dhammo; ye ca micchāsatipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammāsatipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(7)",
    "an10.114:10": "Micchāsamādhi, bhikkhave, adhammo; sammāsamādhi dhammo; ye ca micchāsamādhipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammāsamādhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(8)",
    "an10.114:11": "Micchāñāṇaṁ, bhikkhave, adhammo; sammāñāṇaṁ dhammo; ye ca micchāñāṇapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammāñāṇapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(9)",
    "an10.114:12": "Micchāvimutti, bhikkhave, adhammo; sammāvimutti dhammo; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.(10)",
    "an10.114:13": "‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabban’ti, iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttan\"ti."
}