{
    "an10.119:1": "Tena kho pana samayena jāṇussoṇi brāhmaṇo tadahuposathe sīsaṁnhāto navaṁ khomayugaṁ nivattho allakusamuṭṭhiṁ ādāya bhagavato avidūre ekamantaṁ ṭhito hoti.",
    "an10.119:2": "Addasā kho bhagavā jāṇussoṇiṁ brāhmaṇaṁ tadahuposathe sīsaṁnhātaṁ navaṁ khomayugaṁ nivatthaṁ allakusamuṭṭhiṁ ādāya ekamantaṁ ṭhitaṁ. Disvāna jāṇussoṇiṁ brāhmaṇaṁ etadavoca:",
    "an10.119:3": "\"Yathā kathaṁ pana, brāhmaṇa, brāhmaṇānaṁ paccorohaṇī hotī\"ti?",
    "an10.119:4": "\"Aññathā kho, brāhmaṇa, brāhmaṇānaṁ paccorohaṇī hoti, aññathā ca pana ariyassa vinaye paccorohaṇī hotī\"ti.",
    "an10.119:5": "\"Tena hi, brāhmaṇa, suṇāhi, sādhukaṁ manasi karohi; bhāsissāmī\"ti.",
    "an10.119:6": "\"Idha, brāhmaṇa, ariyasāvako iti paṭisañcikkhati:  ‘micchādiṭṭhiyā kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchādiṭṭhiṁ pajahati; micchādiṭṭhiyā paccorohati.",
    "an10.119:7": "…  ‘Micchāsaṅkappassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchāsaṅkappaṁ pajahati; micchāsaṅkappā paccorohati.",
    "an10.119:8": "…  ‘Micchāvācāya kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchāvācaṁ pajahati; micchāvācāya paccorohati.",
    "an10.119:9": "…  ‘Micchākammantassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchākammantaṁ pajahati; micchākammantā paccorohati.",
    "an10.119:10": "…  ‘Micchāājīvassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchāājīvaṁ pajahati; micchāājīvā paccorohati.",
    "an10.119:11": "…  ‘Micchāvāyāmassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchāvāyāmaṁ pajahati; micchāvāyāmā paccorohati.",
    "an10.119:12": "…  ‘Micchāsatiyā kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchāsatiṁ pajahati; micchāsatiyā paccorohati.",
    "an10.119:13": "…  ‘Micchāsamādhissa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchāsamādhiṁ pajahati; micchāsamādhimhā paccorohati.",
    "an10.119:14": "…  ‘Micchāñāṇassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchāñāṇaṁ pajahati; micchāñāṇamhā paccorohati.",
    "an10.119:15": "…  ‘Micchāvimuttiyā kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchāvimuttiṁ pajahati; micchāvimuttiyā paccorohati.",
    "an10.119:16": "\"Aññathā, bho gotama, brāhmaṇānaṁ paccorohaṇī, aññathā ca pana ariyassa vinaye paccorohaṇī hoti. Imissā ca, bho gotama, ariyassa vinaye paccorohaṇiyā brāhmaṇānaṁ paccorohaṇī kalaṁ nāgghati soḷasiṁ."
}