{
    "an10.26:1": "Ekaṁ samayaṁ āyasmā mahākaccāno avantīsu viharati kuraraghare pavatte pabbate. Atha kho kāḷī upāsikā kuraragharikā yenāyasmā mahākaccāno tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnā kho kāḷī upāsikā kuraragharikā āyasmantaṁ mahākaccānaṁ etadavoca:",
    "an10.26:2": "‘Atthassa pattiṁ hadayassa santiṁ,Jetvāna senaṁ piyasātarūpaṁ;Ekohaṁ jhāyaṁ sukhamanubodhiṁ,Tasmā janena na karomi sakkhiṁ;Sakkhī na sampajjati kenaci me’ti.",
    "an10.26:3": "Imassa kho, bhante, bhagavatā saṅkhittena bhāsitassa kathaṁ vitthārena attho daṭṭhabbo\"ti?",
    "an10.26:4": "\"Pathavīkasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā ‘attho’ti abhinibbattesuṁ. Yāvatā kho, bhagini, pathavīkasiṇasamāpattiparamatā, tadabhiññāsi bhagavā. Tadabhiññāya bhagavā assādamaddasa ādīnavamaddasa nissaraṇamaddasa maggāmaggañāṇadassanamaddasa. Tassa assādadassanahetu ādīnavadassanahetu nissaraṇadassanahetu maggāmaggañāṇadassanahetu atthassa patti hadayassa santi viditā hoti.",
    "an10.26:5": "Āpokasiṇasamāpattiparamā kho, bhagini … pe … tejokasiṇasamāpattiparamā kho, bhagini … vāyokasiṇasamāpattiparamā kho, bhagini … nīlakasiṇasamāpattiparamā kho, bhagini … pītakasiṇasamāpattiparamā kho, bhagini … lohitakasiṇasamāpattiparamā kho, bhagini … odātakasiṇasamāpattiparamā kho, bhagini … ākāsakasiṇasamāpattiparamā kho, bhagini … viññāṇakasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā ‘attho’ti abhinibbattesuṁ. Yāvatā kho, bhagini, viññāṇakasiṇasamāpattiparamatā, tadabhiññāsi bhagavā. Tadabhiññāya bhagavā assādamaddasa … ādīnavamaddasa … nissaraṇamaddasa … maggāmaggañāṇadassanamaddasa … tassa assādadassanahetu ādīnavadassanahetu nissaraṇadassanahetu maggāmaggañāṇadassanahetu atthassa patti hadayassa santi viditā hoti.",
    "an10.26:6": "‘Atthassa pattiṁ hadayassa santiṁ,Jetvāna senaṁ piyasātarūpaṁ;Ekohaṁ jhāyaṁ sukhamanubodhiṁ,Tasmā janena na karomi sakkhiṁ;Sakkhī na sampajjati kenaci me’ti.",
    "an10.26:7": "Imassa kho, bhagini, bhagavatā saṅkhittena bhāsitassa evaṁ vitthārena attho daṭṭhabbo\"ti."
}