{
    "an10.96:1": "Ekaṁ samayaṁ āyasmā ānando rājagahe viharati tapodārāme. Atha kho āyasmā ānando rattiyā paccūsasamayaṁ paccuṭṭhāya yena tapodā tenupasaṅkami gattāni parisiñcituṁ. Tapodāya gattāni parisiñcitvā paccuttaritvā ekacīvaro aṭṭhāsi gattāni pubbāpayamāno. Kokanudopi kho paribbājako rattiyā paccūsasamayaṁ paccuṭṭhāya yena tapodā tenupasaṅkami gattāni parisiñcituṁ.",
    "an10.96:2": "Addasā kho kokanudo paribbājako āyasmantaṁ ānandaṁ dūratova āgacchantaṁ. Disvāna āyasmantaṁ ānandaṁ etadavoca:",
    "an10.96:3": "\"Katamesaṁ, āvuso, bhikkhūnan\"ti?",
    "an10.96:4": "\"Puccheyyāma mayaṁ āyasmantaṁ kiñcideva desaṁ, sace āyasmā okāsaṁ karoti pañhassa veyyākaraṇāyā\"ti.",
    "an10.96:5": "\"Kiṁ nu kho, bho, ‘sassato loko, idameva saccaṁ moghamaññan’ti – evaṁdiṭṭhi bhavan\"ti?",
    "an10.96:6": "\"Kiṁ pana, bho, ‘asassato loko, idameva saccaṁ moghamaññan’ti – evaṁdiṭṭhi bhavan\"ti?",
    "an10.96:7": "\"Kiṁ nu kho, bho, antavā loko … pe … anantavā loko … taṁ jīvaṁ taṁ sarīraṁ … aññaṁ jīvaṁ aññaṁ sarīraṁ … hoti tathāgato paraṁ maraṇā … na hoti tathāgato paraṁ maraṇā … hoti ca na ca hoti tathāgato paraṁ maraṇā … neva hoti na na hoti tathāgato paraṁ maraṇā, idameva saccaṁ moghamaññanti – evaṁdiṭṭhi bhavan\"ti?",
    "an10.96:8": "\"Tena hi bhavaṁ na jānāti, na passatī\"ti?",
    "an10.96:9": "\"‘Kiṁ nu kho, bho, sassato loko, idameva saccaṁ moghamaññanti – evaṁdiṭṭhi bhavan’ti, iti puṭṭho samāno:  ‘Na kho ahaṁ, āvuso, evaṁdiṭṭhi – sassato loko, idameva saccaṁ moghamaññan’ti vadesi.",
    "an10.96:10": "‘Kiṁ pana, bho, asassato loko, idameva saccaṁ moghamaññanti – evaṁdiṭṭhi bhavan’ti, iti puṭṭho samāno:  ‘Na kho ahaṁ, āvuso, evaṁdiṭṭhi – asassato loko, idameva saccaṁ moghamaññan’ti vadesi.",
    "an10.96:11": "Kiṁ nu kho, bho, antavā loko … pe … anantavā loko … taṁ jīvaṁ taṁ sarīraṁ … aññaṁ jīvaṁ aññaṁ sarīraṁ … hoti tathāgato paraṁ maraṇā … na hoti tathāgato paraṁ maraṇā … hoti ca na ca hoti tathāgato paraṁ maraṇā … neva hoti na na hoti tathāgato paraṁ maraṇā, idameva saccaṁ moghamaññanti – evaṁdiṭṭhi bhavanti, iti puṭṭho samāno:  ‘Na kho ahaṁ, āvuso, evaṁdiṭṭhi – neva hoti na na hoti tathāgato paraṁ maraṇā, idameva saccaṁ moghamaññan’ti vadesi.",
    "an10.96:12": "‘Tena hi bhavaṁ na jānāti na passatī’ti, iti puṭṭho samāno:  ‘Na kho ahaṁ, āvuso, na jānāmi na passāmi. Jānāmahaṁ, āvuso, passāmī’ti vadesi. Yathā kathaṁ panāvuso, imassa bhāsitassa attho daṭṭhabbo\"ti?",
    "an10.96:13": "\"‘Sassato loko, idameva saccaṁ moghamaññan’ti kho, āvuso, diṭṭhigatametaṁ. ‘Asassato loko, idameva saccaṁ moghamaññan’ti kho, āvuso, diṭṭhigatametaṁ. Antavā loko … pe … anantavā loko … taṁ jīvaṁ taṁ sarīraṁ … aññaṁ jīvaṁ aññaṁ sarīraṁ … hoti tathāgato paraṁ maraṇā … na hoti tathāgato paraṁ maraṇā … hoti ca na ca hoti tathāgato paraṁ maraṇā … ‘neva hoti na na hoti tathāgato paraṁ maraṇā, idameva saccaṁ moghamaññan’ti kho, āvuso, diṭṭhigatametaṁ.",
    "an10.96:14": "Yāvatā, āvuso, diṭṭhi yāvatā diṭṭhiṭṭhānaṁ diṭṭhiadhiṭṭhānaṁ diṭṭhipariyuṭṭhānaṁ diṭṭhisamuṭṭhānaṁ diṭṭhisamugghāto, tamahaṁ jānāmi tamahaṁ passāmi. Tamahaṁ jānanto tamahaṁ passanto kyāhaṁ vakkhāmi:  ‘Na jānāmi na passāmī’ti? Jānāmahaṁ, āvuso, passāmī\"ti.",
    "an10.96:15": "\"Ko nāmo āyasmā, kathañca panāyasmantaṁ sabrahmacārī jānantī\"ti?"
}