{
    "an10.44:1": "Ekaṁ samayaṁ bhagavā kusinārāyaṁ viharati baliharaṇe vanasaṇḍe. Tatra kho bhagavā bhikkhū āmantesi:  \"bhikkhavo\"ti.",
    "an10.44:2": "\"Codakena, bhikkhave, bhikkhunā paraṁ codetukāmena pañca dhamme ajjhattaṁ paccavekkhitvā pañca dhamme ajjhattaṁ upaṭṭhāpetvā paro codetabbo. Katame pañca dhammā ajjhattaṁ paccavekkhitabbā?",
    "an10.44:3": "Puna caparaṁ, bhikkhave, codakena bhikkhunā paraṁ codetukāmena evaṁ paccavekkhitabbaṁ:  ‘parisuddhavacīsamācāro nu khomhi, parisuddhenamhi vacīsamācārena samannāgato acchiddena appaṭimaṁsena. Saṁvijjati nu kho me eso dhammo udāhu no’ti? No ce, bhikkhave, bhikkhu parisuddhavacīsamācāro hoti parisuddhena vacīsamācārena samannāgato acchiddena appaṭimaṁsena, tassa bhavanti vattāro:  ‘iṅgha tāva āyasmā vācasikaṁ sikkhassū’ti, itissa bhavanti vattāro.",
    "an10.44:4": "Puna caparaṁ, bhikkhave, codakena bhikkhunā paraṁ codetukāmena evaṁ paccavekkhitabbaṁ:  ‘mettaṁ nu kho me cittaṁ paccupaṭṭhitaṁ sabrahmacārīsu anāghātaṁ. Saṁvijjati nu kho me eso dhammo udāhu no’ti? No ce, bhikkhave, bhikkhuno mettaṁ cittaṁ paccupaṭṭhitaṁ hoti sabrahmacārīsu anāghātaṁ, tassa bhavanti vattāro:  ‘iṅgha tāva āyasmā sabrahmacārīsu mettaṁ cittaṁ upaṭṭhāpehī’ti, itissa bhavanti vattāro.",
    "an10.44:5": "Puna caparaṁ, bhikkhave, codakena bhikkhunā paraṁ codetukāmena evaṁ paccavekkhitabbaṁ:  ‘bahussuto nu khomhi sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ abhivadanti, tathārūpā me dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Saṁvijjati nu kho me eso dhammo udāhu no’ti? No ce, bhikkhave, bhikkhu bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, tassa bhavanti vattāro:  ‘iṅgha tāva āyasmā āgamaṁ pariyāpuṇassū’ti, itissa bhavanti vattāro.",
    "an10.44:6": "Puna caparaṁ, bhikkhave, codakena bhikkhunā paraṁ codetukāmena evaṁ paccavekkhitabbaṁ:  ‘ubhayāni kho pana me pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso. Saṁvijjati nu kho me eso dhammo udāhu no’ti? No ce, bhikkhave, bhikkhuno ubhayāni pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso, ‘idaṁ panāyasmā, kattha vuttaṁ bhagavatā’ti, iti puṭṭho na sampāyissati. Tassa bhavanti vattāro:  ‘iṅgha tāva āyasmā vinayaṁ sikkhassū’ti, itissa bhavanti vattāro.",
    "an10.44:7": "Katame pañca dhammā ajjhattaṁ upaṭṭhāpetabbā?"
}