{
    "an10.107:1": "\"Atthi, bhikkhave, dakkhiṇesu janapadesu dhovanaṁ nāma. Tattha hoti annampi pānampi khajjampi bhojjampi leyyampi peyyampi naccampi gītampi vāditampi. Atthetaṁ, bhikkhave, dhovanaṁ; ‘netaṁ natthī’ti vadāmi. Tañca kho etaṁ, bhikkhave, dhovanaṁ hīnaṁ gammaṁ pothujjanikaṁ anariyaṁ anatthasaṁhitaṁ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṁvattati.",
    "an10.107:2": "Ahañca kho, bhikkhave, ariyaṁ dhovanaṁ desessāmi, yaṁ dhovanaṁ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati, yaṁ dhovanaṁ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "an10.107:3": "\"Katamañca taṁ, bhikkhave, ariyaṁ dhovanaṁ, yaṁ dhovanaṁ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati, yaṁ dhovanaṁ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti?",
    "an10.107:4": "Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi niddhotā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhotā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti.",
    "an10.107:5": "Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo niddhoto hoti … pe … sammāvācassa, bhikkhave, micchāvācā niddhotā hoti … sammākammantassa, bhikkhave, micchākammanto niddhoto hoti … sammāājīvassa, bhikkhave, micchāājīvo niddhoto hoti … sammāvāyāmassa, bhikkhave, micchāvāyāmo niddhoto hoti … sammāsatissa, bhikkhave, micchāsati niddhotā hoti … sammāsamādhissa, bhikkhave, micchāsamādhi niddhoto hoti … sammāñāṇissa, bhikkhave, micchāñāṇaṁ niddhotaṁ hoti … pe ….",
    "an10.107:6": "Sammāvimuttissa, bhikkhave, micchāvimutti niddhotā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhotā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti."
}