{
    "an10.29:1": "\"Yāvatā, bhikkhave, kāsikosalā, yāvatā rañño pasenadissa kosalassa vijitaṁ, rājā tattha pasenadi kosalo aggamakkhāyati. Raññopi kho, bhikkhave, pasenadissa kosalassa attheva aññathattaṁ atthi vipariṇāmo. Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṁ nibbindanto agge virajjati, pageva hīnasmiṁ.()",
    "an10.29:2": "Yāvatā, bhikkhave, candimasūriyā pariharanti disā bhanti virocamānā, tāva sahassadhā loko. Tasmiṁ sahassadhā loke sahassaṁ candānaṁ sahassaṁ sūriyānaṁ sahassaṁ sinerupabbatarājānaṁ sahassaṁ jambudīpānaṁ sahassaṁ aparagoyānānaṁ sahassaṁ uttarakurūnaṁ sahassaṁ pubbavidehānaṁ cattāri mahāsamuddasahassāni cattāri mahārājasahassāni sahassaṁ cātumahārājikānaṁ sahassaṁ tāvatiṁsānaṁ sahassaṁ yāmānaṁ sahassaṁ tusitānaṁ sahassaṁ nimmānaratīnaṁ sahassaṁ paranimmitavasavattīnaṁ sahassaṁ brahmalokānaṁ. Yāvatā, bhikkhave, sahassī lokadhātu, mahābrahmā tattha aggamakkhāyati. Mahābrahmunopi kho, bhikkhave, attheva aññathattaṁ atthi vipariṇāmo. Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṁ nibbindanto agge virajjati, pageva hīnasmiṁ.()",
    "an10.29:3": "Hoti so, bhikkhave, samayo yaṁ ayaṁ loko saṁvaṭṭati. Saṁvaṭṭamāne, bhikkhave, loke yebhuyyena sattā ābhassarasaṁvattanikā bhavanti. Te tattha honti manomayā pītibhakkhā sayaṁpabhā antalikkhecarā subhaṭṭhāyino ciraṁ dīghamaddhānaṁ tiṭṭhanti. Saṁvaṭṭamāne, bhikkhave, loke ābhassarā devā aggamakkhāyanti. Ābhassarānampi kho, bhikkhave, devānaṁ attheva aññathattaṁ atthi vipariṇāmo. Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṁ nibbindanto agge virajjati, pageva hīnasmiṁ.()",
    "an10.29:4": "Dasayimāni, bhikkhave, kasiṇāyatanāni. Katamāni dasa? Pathavīkasiṇameko sañjānāti uddhaṁ adho tiriyaṁ advayaṁ appamāṇaṁ; āpokasiṇameko sañjānāti … pe … tejokasiṇameko sañjānāti … vāyokasiṇameko sañjānāti … nīlakasiṇameko sañjānāti … pītakasiṇameko sañjānāti … lohitakasiṇameko sañjānāti … odātakasiṇameko sañjānāti … ākāsakasiṇameko sañjānāti … viññāṇakasiṇameko sañjānāti uddhaṁ adho tiriyaṁ advayaṁ appamāṇaṁ. Imāni kho, bhikkhave, dasa kasiṇāyatanāni.",
    "an10.29:5": "Etadaggaṁ, bhikkhave, imesaṁ dasannaṁ kasiṇāyatanānaṁ yadidaṁ viññāṇakasiṇaṁ eko sañjānāti uddhaṁ adho tiriyaṁ advayaṁ appamāṇaṁ. Evaṁsaññinopi kho, bhikkhave, santi sattā. Evaṁsaññīnampi kho, bhikkhave, sattānaṁ attheva aññathattaṁ atthi vipariṇāmo. Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṁ nibbindanto agge virajjati, pageva hīnasmiṁ.(4)",
    "an10.29:6": "Aṭṭhimāni, bhikkhave, abhibhāyatanāni. Katamāni aṭṭha?",
    "an10.29:7": "Ajjhattaṁ rūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṁsaññī hoti. Idaṁ dutiyaṁ abhibhāyatanaṁ.",
    "an10.29:8": "Ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṁsaññī hoti. Idaṁ tatiyaṁ abhibhāyatanaṁ.",
    "an10.29:9": "Ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṁsaññī hoti. Idaṁ catutthaṁ abhibhāyatanaṁ.",
    "an10.29:10": "Ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni. Seyyathāpi nāma umāpupphaṁ nīlaṁ nīlavaṇṇaṁ nīlanidassanaṁ nīlanibhāsaṁ, seyyathā vā pana taṁ vatthaṁ bārāṇaseyyakaṁ ubhatobhāgavimaṭṭhaṁ nīlaṁ nīlavaṇṇaṁ nīlanidassanaṁ nīlanibhāsaṁ; evamevaṁ ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṁsaññī hoti. Idaṁ pañcamaṁ abhibhāyatanaṁ.",
    "an10.29:11": "Ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni. Seyyathāpi nāma kaṇikārapupphaṁ pītaṁ pītavaṇṇaṁ pītanidassanaṁ pītanibhāsaṁ, seyyathā vā pana taṁ vatthaṁ bārāṇaseyyakaṁ ubhatobhāgavimaṭṭhaṁ pītaṁ pītavaṇṇaṁ pītanidassanaṁ pītanibhāsaṁ; evamevaṁ ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṁsaññī hoti. Idaṁ chaṭṭhaṁ abhibhāyatanaṁ.",
    "an10.29:12": "Ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni. Seyyathāpi nāma bandhujīvakapupphaṁ lohitakaṁ lohitakavaṇṇaṁ lohitakanidassanaṁ lohitakanibhāsaṁ, seyyathā vā pana taṁ vatthaṁ bārāṇaseyyakaṁ ubhatobhāgavimaṭṭhaṁ lohitakaṁ lohitakavaṇṇaṁ lohitakanidassanaṁ lohitakanibhāsaṁ; evamevaṁ ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṁsaññī hoti. Idaṁ sattamaṁ abhibhāyatanaṁ.",
    "an10.29:13": "Ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni. Seyyathāpi nāma osadhitārakā odātā odātavaṇṇā odātanidassanā odātanibhāsā, seyyathā vā pana taṁ vatthaṁ bārāṇaseyyakaṁ ubhatobhāgavimaṭṭhaṁ odātaṁ odātavaṇṇaṁ odātanidassanaṁ odātanibhāsaṁ; evamevaṁ ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṁsaññī hoti. Idaṁ aṭṭhamaṁ abhibhāyatanaṁ. Imāni kho, bhikkhave, aṭṭha abhibhāyatanāni.",
    "an10.29:14": "Etadaggaṁ, bhikkhave, imesaṁ aṭṭhannaṁ abhibhāyatanānaṁ yadidaṁ ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṁsaññī hoti. Evaṁsaññinopi kho, bhikkhave, santi sattā. Evaṁsaññīnampi kho, bhikkhave, sattānaṁ attheva aññathattaṁ atthi vipariṇāmo. Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṁ nibbindanto agge virajjati, pageva hīnasmiṁ.(5)",
    "an10.29:15": "Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā – imā kho, bhikkhave, catasso paṭipadā.",
    "an10.29:16": "Etadaggaṁ, bhikkhave, imāsaṁ catunnaṁ paṭipadānaṁ yadidaṁ sukhā paṭipadā khippābhiññā. Evaṁpaṭipannāpi kho, bhikkhave, santi sattā. Evaṁpaṭipannānampi kho, bhikkhave, sattānaṁ attheva aññathattaṁ atthi vipariṇāmo. Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṁ nibbindanto agge virajjati, pageva hīnasmiṁ.(6)",
    "an10.29:17": "Catasso imā, bhikkhave, saññā. Katamā catasso? Parittameko sañjānāti, mahaggatameko sañjānāti, appamāṇameko sañjānāti, ‘Natthi kiñcī’ti ākiñcaññāyatanameko sañjānāti – imā kho, bhikkhave, catasso saññā.",
    "an10.29:18": "Etadaggaṁ, bhikkhave, imāsaṁ catunnaṁ saññānaṁ yadidaṁ ‘Natthi kiñcī’ti ākiñcaññāyatanameko sañjānāti. Evaṁsaññinopi kho, bhikkhave, santi sattā. Evaṁsaññīnampi kho, bhikkhave, sattānaṁ attheva aññathattaṁ atthi vipariṇāmo. Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṁ nibbindanto agge virajjati, pageva hīnasmiṁ.(7)",
    "an10.29:19": "Etadaggaṁ, bhikkhave, bāhirakānaṁ diṭṭhigatānaṁ yadidaṁ ‘no cassaṁ, no ca me siyā, na bhavissāmi, na me bhavissatī’ti. Evaṁdiṭṭhino, bhikkhave, etaṁ pāṭikaṅkhaṁ:  ‘yā cāyaṁ bhave appaṭikulyatā, sā cassa na bhavissati; yā cāyaṁ bhavanirodhe pāṭikulyatā, sā cassa na bhavissatī’ti. Evaṁdiṭṭhinopi kho, bhikkhave, santi sattā. Evaṁdiṭṭhīnampi kho, bhikkhave, sattānaṁ attheva aññathattaṁ atthi vipariṇāmo. Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṁ nibbindanto agge virajjati, pageva hīnasmiṁ.(8)",
    "an10.29:20": "Santi, bhikkhave, eke samaṇabrāhmaṇā paramatthavisuddhiṁ paññāpenti. Etadaggaṁ, bhikkhave, paramatthavisuddhiṁ paññapentānaṁ yadidaṁ sabbaso ākiñcaññāyatanaṁ samatikkamma nevasaññānāsaññāyatanaṁ upasampajja viharati. Te tadabhiññāya tassa sacchikiriyāya dhammaṁ desenti. Evaṁvādinopi kho, bhikkhave, santi sattā. Evaṁvādīnampi kho, bhikkhave, sattānaṁ attheva aññathattaṁ atthi vipariṇāmo. Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṁ nibbindanto agge virajjati, pageva hīnasmiṁ.(9)",
    "an10.29:21": "Santi, bhikkhave, eke samaṇabrāhmaṇā paramadiṭṭhadhammanibbānaṁ paññāpenti. Etadaggaṁ, bhikkhave, paramadiṭṭhadhammanibbānaṁ paññapentānaṁ yadidaṁ channaṁ phassāyatanānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ viditvā anupādā vimokkho."
}