{
    "an10.95:1": "Atha kho uttiyo paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho uttiyo paribbājako bhagavantaṁ etadavoca:",
    "an10.95:2": "\"Kiṁ pana, bho gotama, asassato loko, idameva saccaṁ moghamaññan\"ti?",
    "an10.95:3": "\"Kiṁ nu kho, bho gotama, antavā loko … pe … anantavā loko … taṁ jīvaṁ taṁ sarīraṁ … aññaṁ jīvaṁ aññaṁ sarīraṁ … hoti tathāgato paraṁ maraṇā … na hoti tathāgato paraṁ maraṇā … hoti ca na ca hoti tathāgato paraṁ maraṇā … neva hoti na na hoti tathāgato paraṁ maraṇā, idameva saccaṁ moghamaññan\"ti?",
    "an10.95:4": "\"‘Kiṁ nu kho, bho gotama, sassato loko, idameva saccaṁ moghamaññan’ti, iti puṭṭho samāno ‘abyākataṁ kho etaṁ, uttiya, mayā – sassato loko, idameva saccaṁ moghamaññan’ti vadesi.",
    "an10.95:5": "‘Kiṁ pana, bho gotama, asassato loko, idameva saccaṁ moghamaññan’ti, iti puṭṭho samāno:  ‘etampi kho, uttiya, abyākataṁ mayā asassato loko, idameva saccaṁ moghamaññan’ti vadesi.",
    "an10.95:6": "‘Kiṁ nu kho, bho gotama, antavā loko … pe … anantavā loko … taṁ jīvaṁ taṁ sarīraṁ … aññaṁ jīvaṁ aññaṁ sarīraṁ … hoti tathāgato paraṁ maraṇā … na hoti tathāgato paraṁ maraṇā … hoti ca na ca hoti tathāgato paraṁ maraṇā … neva hoti na na hoti tathāgato paraṁ maraṇā, idameva saccaṁ moghamaññan’ti, iti puṭṭho samāno:  ‘etampi kho, uttiya, abyākataṁ mayā – neva hoti na na hoti tathāgato paraṁ maraṇā, idameva saccaṁ moghamaññan’ti vadesi. Atha kiñcarahi bhotā gotamena byākatan\"ti?",
    "an10.95:7": "\"Abhiññāya kho ahaṁ, uttiya, sāvakānaṁ dhammaṁ desemi sattānaṁ visuddhiyā sokaparidevānaṁ samatikkamāya dukkhadomanassānaṁ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāyā\"ti.",
    "an10.95:8": "\"Yaṁ panetaṁ bhavaṁ gotamo abhiññāya sāvakānaṁ dhammaṁ desesi sattānaṁ visuddhiyā sokaparidevānaṁ samatikkamāya dukkhadomanassānaṁ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, sabbo vā tena loko nīyati upaḍḍho vā tibhāgo vā\"ti? Evaṁ vutte, bhagavā tuṇhī ahosi.",
    "an10.95:9": "Atha kho āyasmato ānandassa etadahosi:  \"mā hevaṁ kho uttiyo paribbājako pāpakaṁ diṭṭhigataṁ paṭilabhi:  ‘sabbasāmukkaṁsikaṁ vata me samaṇo gotamo pañhaṁ puṭṭho saṁsādeti, no vissajjeti, na nūna visahatī’ti. Tadassa uttiyassa paribbājakassa dīgharattaṁ ahitāya dukkhāyā\"ti.",
    "an10.95:10": "Atha kho āyasmā ānando uttiyaṁ paribbājakaṁ etadavoca:  \"tenahāvuso uttiya, upamaṁ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Seyyathāpi, āvuso uttiya, rañño paccantimaṁ nagaraṁ daḷhuddhāpaṁ daḷhapākāratoraṇaṁ ekadvāraṁ. Tatrassa dovāriko paṇḍito byatto medhāvī aññātānaṁ nivāretā ñātānaṁ pavesetā. So tassa nagarassa samantā anupariyāyapathaṁ anukkamati. Anupariyāyapathaṁ anukkamamāno na passeyya pākārasandhiṁ vā pākāravivaraṁ vā, antamaso biḷāranikkhamanamattampi. No ca khvassa evaṁ ñāṇaṁ hoti:  ‘ettakā pāṇā imaṁ nagaraṁ pavisanti vā nikkhamanti vā’ti. Atha khvassa evamettha hoti:  ‘ye kho keci oḷārikā pāṇā imaṁ nagaraṁ pavisanti vā nikkhamanti vā, sabbe te iminā dvārena pavisanti vā nikkhamanti vā’ti.",
    "an10.95:11": "Evamevaṁ kho, āvuso uttiya, na tathāgatassa evaṁ ussukkaṁ hoti:  ‘sabbo vā tena loko nīyati, upaḍḍho vā, tibhāgo vā’ti. Atha kho evamettha tathāgatassa hoti:  ‘ye kho keci lokamhā nīyiṁsu vā nīyanti vā nīyissanti vā, sabbe te pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta bojjhaṅge yathābhūtaṁ bhāvetvā. Evamete lokamhā nīyiṁsu vā nīyanti vā nīyissanti vā’ti."
}