{
    "an10.216:1": "\"Saṁsappanīyapariyāyaṁ vo, bhikkhave, dhammapariyāyaṁ desessāmi. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "an10.216:2": "\"Katamo ca, bhikkhave, saṁsappanīyapariyāyo dhammapariyāyo? Kammassakā, bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṁ kammaṁ karonti – kalyāṇaṁ vā pāpakaṁ vā – tassa dāyādā bhavanti.",
    "an10.216:3": "Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho, adayāpanno sabbapāṇabhūtesu. So saṁsappati kāyena, saṁsappati vācāya, saṁsappati manasā. Tassa jimhaṁ kāyakammaṁ hoti, jimhaṁ vacīkammaṁ, jimhaṁ manokammaṁ, jimhā gati, jimhupapatti.",
    "an10.216:4": "Jimhagatikassa kho panāhaṁ, bhikkhave, jimhupapattikassa dvinnaṁ gatīnaṁ aññataraṁ gatiṁ vadāmi – ye vā ekantadukkhā nirayā yā vā saṁsappajātikā tiracchānayoni. Katamā ca sā, bhikkhave, saṁsappajātikā tiracchānayoni? Ahi vicchikā satapadī nakulā biḷārā mūsikā ulūkā, ye vā panaññepi keci tiracchānayonikā sattā manusse disvā saṁsappanti. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti. Yaṁ karoti tena upapajjati. Upapannamenaṁ phassā phusanti. Evamahaṁ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi.",
    "an10.216:5": "Idha pana, bhikkhave, ekacco adinnādāyī hoti … pe … kāmesumicchācārī hoti … musāvādī hoti … pisuṇavāco hoti … pharusavāco hoti … samphappalāpī hoti … abhijjhālu hoti … byāpannacitto hoti … micchādiṭṭhiko hoti viparītadassano:  ‘Natthi dinnaṁ … pe … sayaṁ abhiññā sacchikatvā pavedentī’ti. So saṁsappati kāyena, saṁsappati vācāya, saṁsappati manasā. Tassa jimhaṁ kāyakammaṁ hoti, jimhaṁ vacīkammaṁ, jimhaṁ manokammaṁ, jimhā gati, jimhupapatti.",
    "an10.216:6": "Jimhagatikassa kho panāhaṁ, bhikkhave, jimhupapattikassa dvinnaṁ gatīnaṁ aññataraṁ gatiṁ vadāmi – ye vā ekantadukkhā nirayā yā vā saṁsappajātikā tiracchānayoni. Katamā ca sā, bhikkhave, saṁsappajātikā tiracchānayoni? Ahi vicchikā satapadī nakulā biḷārā mūsikā ulūkā, ye vā panaññepi keci tiracchānayonikā sattā manusse disvā saṁsappanti. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti, yaṁ karoti tena upapajjati. Upapannamenaṁ phassā phusanti. Evamahaṁ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi.",
    "an10.216:7": "Idha, bhikkhave, ekacco pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho, lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. So na saṁsappati kāyena, na saṁsappati vācāya, na saṁsappati manasā. Tassa uju kāyakammaṁ hoti, uju vacīkammaṁ, uju manokammaṁ, uju gati, ujupapatti.",
    "an10.216:8": "Ujugatikassa kho panāhaṁ, bhikkhave, ujupapattikassa dvinnaṁ gatīnaṁ aññataraṁ gatiṁ vadāmi – ye vā ekantasukhā saggā yāni vā pana tāni uccākulāni khattiyamahāsālakulāni vā brāhmaṇamahāsālakulāni vā gahapatimahāsālakulāni vā aḍḍhāni mahaddhanāni mahābhogāni pahūtajātarūparajatāni pahūtavittūpakaraṇāni pahūtadhanadhaññāni. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti. Yaṁ karoti tena upapajjati. Upapannamenaṁ phassā phusanti. Evamahaṁ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi.",
    "an10.216:9": "Idha pana, bhikkhave, ekacco adinnādānaṁ pahāya adinnādānā paṭivirato hoti … pe … kāmesumicchācārā paṭivirato hoti … musāvādaṁ pahāya musāvādā paṭivirato hoti … pisuṇaṁ vācaṁ pahāya pisuṇāya vācāya paṭivirato hoti … pharusaṁ vācaṁ pahāya pharusāya vācāya paṭivirato hoti … samphappalāpaṁ pahāya samphappalāpā paṭivirato hoti … anabhijjhālu hoti … abyāpannacitto hoti … sammādiṭṭhiko hoti aviparītadassano:  ‘atthi dinnaṁ … pe … ye imañca lokaṁ parañca lokaṁ sayaṁ abhiññā sacchikatvā pavedentī’ti. So na saṁsappati kāyena, na saṁsappati vācāya, na saṁsappati manasā. Tassa uju kāyakammaṁ hoti, uju vacīkammaṁ, uju manokammaṁ, uju gati, ujupapatti.",
    "an10.216:10": "Ujugatikassa kho pana ahaṁ, bhikkhave, ujupapattikassa dvinnaṁ gatīnaṁ aññataraṁ gatiṁ vadāmi – ye vā ekantasukhā saggā yāni vā pana tāni uccākulāni khattiyamahāsālakulāni vā brāhmaṇamahāsālakulāni vā gahapatimahāsālakulāni vā aḍḍhāni mahaddhanāni mahābhogāni pahūtajātarūparajatāni pahūtavittūpakaraṇāni pahūtadhanadhaññāni. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti. Yaṁ karoti tena upapajjati. Upapannamenaṁ phassā phusanti. Evamahaṁ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi.",
    "an10.216:11": "Kammassakā, bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṁ kammaṁ karonti – kalyāṇaṁ vā pāpakaṁ vā – tassa dāyādā bhavanti."
}