{
    "an10.76:1": "\"Tayome, bhikkhave, dhammā loke na saṁvijjeyyuṁ, na tathāgato loke uppajjeyya arahaṁ sammāsambuddho, na tathāgatappavedito dhammavinayo loke dibbeyya. Katame tayo? Jāti ca, jarā ca, maraṇañca – ime kho, bhikkhave, tayo dhammā loke na saṁvijjeyyuṁ, na tathāgato loke uppajjeyya arahaṁ sammāsambuddho, na tathāgatappavedito dhammavinayo loke dibbeyya. Yasmā ca kho, bhikkhave, ime tayo dhammā loke saṁvijjanti tasmā tathāgato loke uppajjati arahaṁ sammāsambuddho, tasmā tathāgatappavedito dhammavinayo loke dibbati.",
    "an10.76:2": "Tayome, bhikkhave, dhamme appahāya abhabbo jātiṁ pahātuṁ jaraṁ pahātuṁ maraṇaṁ pahātuṁ. Katame tayo? Rāgaṁ appahāya, dosaṁ appahāya, mohaṁ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo jātiṁ pahātuṁ jaraṁ pahātuṁ maraṇaṁ pahātuṁ.(1)",
    "an10.76:3": "Tayome, bhikkhave, dhamme appahāya abhabbo rāgaṁ pahātuṁ dosaṁ pahātuṁ mohaṁ pahātuṁ. Katame tayo? Sakkāyadiṭṭhiṁ appahāya, vicikicchaṁ appahāya, sīlabbataparāmāsaṁ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo rāgaṁ pahātuṁ dosaṁ pahātuṁ mohaṁ pahātuṁ.(2)",
    "an10.76:4": "Tayome, bhikkhave, dhamme appahāya abhabbo sakkāyadiṭṭhiṁ pahātuṁ vicikicchaṁ pahātuṁ sīlabbataparāmāsaṁ pahātuṁ. Katame tayo? Ayonisomanasikāraṁ appahāya, kummaggasevanaṁ appahāya, cetaso līnattaṁ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo sakkāyadiṭṭhiṁ pahātuṁ vicikicchaṁ pahātuṁ sīlabbataparāmāsaṁ pahātuṁ.(3)",
    "an10.76:5": "Tayome, bhikkhave, dhamme appahāya abhabbo ayoniso manasikāraṁ pahātuṁ kummaggasevanaṁ pahātuṁ cetaso līnattaṁ pahātuṁ. Katame tayo? Muṭṭhassaccaṁ appahāya, asampajaññaṁ appahāya, cetaso vikkhepaṁ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo ayonisomanasikāraṁ pahātuṁ kummaggasevanaṁ pahātuṁ cetaso līnattaṁ pahātuṁ.(4)",
    "an10.76:6": "Tayome, bhikkhave, dhamme appahāya abhabbo muṭṭhassaccaṁ pahātuṁ asampajaññaṁ pahātuṁ cetaso vikkhepaṁ pahātuṁ. Katame tayo? Ariyānaṁ adassanakamyataṁ appahāya, ariyadhammassa asotukamyataṁ appahāya, upārambhacittataṁ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo muṭṭhassaccaṁ pahātuṁ asampajaññaṁ pahātuṁ cetaso vikkhepaṁ pahātuṁ.(5)",
    "an10.76:7": "Tayome, bhikkhave, dhamme appahāya abhabbo ariyānaṁ adassanakamyataṁ pahātuṁ ariyadhammassa asotukamyataṁ pahātuṁ upārambhacittataṁ pahātuṁ. Katame tayo? Uddhaccaṁ appahāya, asaṁvaraṁ appahāya, dussilyaṁ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo ariyānaṁ adassanakamyataṁ pahātuṁ ariyadhammassa asotukamyataṁ pahātuṁ upārambhacittataṁ pahātuṁ.(6)",
    "an10.76:8": "Tayome, bhikkhave, dhamme appahāya abhabbo uddhaccaṁ pahātuṁ asaṁvaraṁ pahātuṁ dussilyaṁ pahātuṁ. Katame tayo? Assaddhiyaṁ appahāya, avadaññutaṁ appahāya, kosajjaṁ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo uddhaccaṁ pahātuṁ asaṁvaraṁ pahātuṁ dussilyaṁ pahātuṁ.(7)",
    "an10.76:9": "Tayome, bhikkhave, dhamme appahāya abhabbo assaddhiyaṁ pahātuṁ avadaññutaṁ pahātuṁ kosajjaṁ pahātuṁ. Katame tayo? Anādariyaṁ appahāya, dovacassataṁ appahāya, pāpamittataṁ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo assaddhiyaṁ pahātuṁ avadaññutaṁ pahātuṁ kosajjaṁ pahātuṁ.(8)",
    "an10.76:10": "Tayome, bhikkhave, dhamme appahāya abhabbo anādariyaṁ pahātuṁ dovacassataṁ pahātuṁ pāpamittataṁ pahātuṁ. Katame tayo? Ahirikaṁ appahāya, anottappaṁ appahāya, pamādaṁ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo anādariyaṁ pahātuṁ dovacassataṁ pahātuṁ pāpamittataṁ pahātuṁ.(9)",
    "an10.76:11": "Ahirikoyaṁ, bhikkhave, anottāpī pamatto hoti. So pamatto samāno abhabbo anādariyaṁ pahātuṁ dovacassataṁ pahātuṁ pāpamittataṁ pahātuṁ. So pāpamitto samāno abhabbo assaddhiyaṁ pahātuṁ avadaññutaṁ pahātuṁ kosajjaṁ pahātuṁ. So kusīto samāno abhabbo uddhaccaṁ pahātuṁ asaṁvaraṁ pahātuṁ dussilyaṁ pahātuṁ. So dussīlo samāno abhabbo ariyānaṁ adassanakamyataṁ pahātuṁ ariyadhammassa asotukamyataṁ pahātuṁ upārambhacittataṁ pahātuṁ. So upārambhacitto samāno abhabbo muṭṭhassaccaṁ pahātuṁ asampajaññaṁ pahātuṁ cetaso vikkhepaṁ pahātuṁ. So vikkhittacitto samāno abhabbo ayonisomanasikāraṁ pahātuṁ kummaggasevanaṁ pahātuṁ cetaso līnattaṁ pahātuṁ. So līnacitto samāno abhabbo sakkāyadiṭṭhiṁ pahātuṁ vicikicchaṁ pahātuṁ sīlabbataparāmāsaṁ pahātuṁ. So vicikiccho samāno abhabbo rāgaṁ pahātuṁ dosaṁ pahātuṁ mohaṁ pahātuṁ. So rāgaṁ appahāya dosaṁ appahāya mohaṁ appahāya abhabbo jātiṁ pahātuṁ jaraṁ pahātuṁ maraṇaṁ pahātuṁ.(10)",
    "an10.76:12": "Tayome, bhikkhave, dhamme pahāya bhabbo jātiṁ pahātuṁ jaraṁ pahātuṁ maraṇaṁ pahātuṁ. Katame tayo? Rāgaṁ pahāya, dosaṁ pahāya, mohaṁ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo jātiṁ pahātuṁ jaraṁ pahātuṁ maraṇaṁ pahātuṁ.(1)",
    "an10.76:13": "Tayome, bhikkhave, dhamme pahāya bhabbo rāgaṁ pahātuṁ dosaṁ pahātuṁ mohaṁ pahātuṁ. Katame tayo? Sakkāyadiṭṭhiṁ pahāya, vicikicchaṁ pahāya, sīlabbataparāmāsaṁ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo rāgaṁ pahātuṁ dosaṁ pahātuṁ mohaṁ pahātuṁ.(2)",
    "an10.76:14": "Tayome, bhikkhave, dhamme pahāya bhabbo sakkāyadiṭṭhiṁ pahātuṁ vicikicchaṁ pahātuṁ sīlabbataparāmāsaṁ pahātuṁ. Katame tayo? Ayonisomanasikāraṁ pahāya, kummaggasevanaṁ pahāya, cetaso līnattaṁ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo sakkāyadiṭṭhiṁ pahātuṁ vicikicchaṁ pahātuṁ sīlabbataparāmāsaṁ pahātuṁ.(3)",
    "an10.76:15": "Tayome, bhikkhave, dhamme pahāya bhabbo ayonisomanasikāraṁ pahātuṁ kummaggasevanaṁ pahātuṁ cetaso līnattaṁ pahātuṁ. Katame tayo? Muṭṭhassaccaṁ pahāya, asampajaññaṁ pahāya, cetaso vikkhepaṁ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo ayonisomanasikāraṁ pahātuṁ kummaggasevanaṁ pahātuṁ cetaso līnattaṁ pahātuṁ.(4)",
    "an10.76:16": "Tayome, bhikkhave, dhamme pahāya bhabbo muṭṭhassaccaṁ pahātuṁ asampajaññaṁ pahātuṁ cetaso vikkhepaṁ pahātuṁ. Katame tayo? Ariyānaṁ adassanakamyataṁ pahāya, ariyadhammassa asotukamyataṁ pahāya, upārambhacittataṁ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo muṭṭhassaccaṁ pahātuṁ asampajaññaṁ pahātuṁ cetaso vikkhepaṁ pahātuṁ.(5)",
    "an10.76:17": "Tayome, bhikkhave, dhamme pahāya bhabbo ariyānaṁ adassanakamyataṁ pahātuṁ ariyadhammassa asotukamyataṁ pahātuṁ upārambhacittataṁ pahātuṁ. Katame tayo? Uddhaccaṁ pahāya, asaṁvaraṁ pahāya, dussilyaṁ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo ariyānaṁ adassanakamyataṁ pahātuṁ ariyadhammassa asotukamyataṁ pahātuṁ upārambhacittataṁ pahātuṁ.(6)",
    "an10.76:18": "Tayome, bhikkhave, dhamme pahāya bhabbo uddhaccaṁ pahātuṁ asaṁvaraṁ pahātuṁ dussilyaṁ pahātuṁ. Katame tayo? Assaddhiyaṁ pahāya, avadaññutaṁ pahāya, kosajjaṁ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo uddhaccaṁ pahātuṁ asaṁvaraṁ pahātuṁ dussilyaṁ pahātuṁ.(7)",
    "an10.76:19": "Tayome, bhikkhave, dhamme pahāya bhabbo assaddhiyaṁ pahātuṁ avadaññutaṁ pahātuṁ kosajjaṁ pahātuṁ. Katame tayo? Anādariyaṁ pahāya, dovacassataṁ pahāya, pāpamittataṁ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo assaddhiyaṁ pahātuṁ avadaññutaṁ pahātuṁ kosajjaṁ pahātuṁ.(8)",
    "an10.76:20": "Tayome, bhikkhave, dhamme pahāya bhabbo anādariyaṁ pahātuṁ dovacassataṁ pahātuṁ pāpamittataṁ pahātuṁ. Katame tayo? Ahirikaṁ pahāya, anottappaṁ pahāya, pamādaṁ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo anādariyaṁ pahātuṁ dovacassataṁ pahātuṁ pāpamittataṁ pahātuṁ.(9)",
    "an10.76:21": "Hirīmāyaṁ, bhikkhave, ottāpī appamatto hoti. So appamatto samāno bhabbo anādariyaṁ pahātuṁ dovacassataṁ pahātuṁ pāpamittataṁ pahātuṁ. So kalyāṇamitto samāno bhabbo assaddhiyaṁ pahātuṁ avadaññutaṁ pahātuṁ kosajjaṁ pahātuṁ. So āraddhavīriyo samāno bhabbo uddhaccaṁ pahātuṁ asaṁvaraṁ pahātuṁ dussilyaṁ pahātuṁ. So sīlavā samāno bhabbo ariyānaṁ adassanakamyataṁ pahātuṁ ariyadhammassa asotukamyataṁ pahātuṁ upārambhacittataṁ pahātuṁ. So anupārambhacitto samāno bhabbo muṭṭhassaccaṁ pahātuṁ asampajaññaṁ pahātuṁ cetaso vikkhepaṁ pahātuṁ. So avikkhittacitto samāno bhabbo ayonisomanasikāraṁ pahātuṁ kummaggasevanaṁ pahātuṁ cetaso līnattaṁ pahātuṁ. So alīnacitto samāno bhabbo sakkāyadiṭṭhiṁ pahātuṁ vicikicchaṁ pahātuṁ sīlabbataparāmāsaṁ pahātuṁ. So avicikiccho samāno bhabbo rāgaṁ pahātuṁ dosaṁ pahātuṁ mohaṁ pahātuṁ. So rāgaṁ pahāya dosaṁ pahāya mohaṁ pahāya bhabbo jātiṁ pahātuṁ jaraṁ pahātuṁ maraṇaṁ pahātun\"ti.(10)"
}