{
    "an10.220:1": "Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho so brāhmaṇo bhagavantaṁ etadavoca:",
    "an10.220:2": "\"Ko pana, bho gotama, hetu ko paccayo yena midhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti?",
    "an10.220:3": "\"Na kho ahaṁ imassa bhoto gotamassa saṅkhittena bhāsitassa vitthārena atthaṁ ājānāmi. Sādhu me bhavaṁ gotamo tathā dhammaṁ desetu yathāhaṁ imassa bhoto gotamassa saṅkhittena bhāsitassa vitthārena atthaṁ ājāneyyan\"ti.",
    "an10.220:4": "\"Tividhā kho, brāhmaṇa, kāyena adhammacariyāvisamacariyā hoti; catubbidhā vācāya adhammacariyāvisamacariyā hoti; tividhā manasā adhammacariyāvisamacariyā hoti.",
    "an10.220:5": "Kathañca, brāhmaṇa, tividhā kāyena adhammacariyāvisamacariyā hoti … pe … evaṁ kho, brāhmaṇa, tividhā kāyena adhammacariyā visamacariyā hoti.",
    "an10.220:6": "Kathañca, brāhmaṇa, catubbidhā vācāya adhammacariyāvisamacariyā hoti … pe … evaṁ kho, brāhmaṇa, catubbidhā vācāya adhammacariyāvisamacariyā hoti.",
    "an10.220:7": "Kathañca, brāhmaṇa, tividhā manasā adhammacariyāvisamacariyā hoti … pe … evaṁ kho, brāhmaṇa, tividhā manasā adhammacariyāvisamacariyā hoti. Evaṁ adhammacariyāvisamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjanti.",
    "an10.220:8": "Tividhā, brāhmaṇa, kāyena dhammacariyāsamacariyā hoti; catubbidhā vācāya dhammacariyāsamacariyā hoti; tividhā manasā dhammacariyāsamacariyā hoti.",
    "an10.220:9": "Kathañca, brāhmaṇa, tividhā kāyena dhammacariyāsamacariyā hoti … pe … evaṁ kho, brāhmaṇa, tividhā kāyena dhammacariyāsamacariyā hoti.",
    "an10.220:10": "Kathañca, brāhmaṇa, catubbidhā vācāya dhammacariyāsamacariyā hoti … pe … evaṁ kho, brāhmaṇa, catubbidhā vācāya dhammacariyāsamacariyā hoti.",
    "an10.220:11": "Kathañca, brāhmaṇa, tividhā manasā dhammacariyāsamacariyā hoti … pe … evaṁ kho, brāhmaṇa, tividhā manasā dhammacariyāsamacariyā hoti. Evaṁ dhammacariyāsamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "an10.220:12": "\"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}