{
    "an10.116:1": "Atha kho ajito paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho ajito paribbājako bhagavantaṁ etadavoca:",
    "an10.116:2": "\"Amhākaṁ, bho gotama, paṇḍito nāma sabrahmacārī. Tena pañcamattāni cittaṭṭhānasatāni cintitāni, yehi aññatitthiyā upāraddhāva jānanti upāraddhasmā\"ti.",
    "an10.116:3": "Atha kho bhagavā bhikkhū āmantesi:  \"dhāretha no tumhe, bhikkhave, paṇḍitavatthūnī\"ti?",
    "an10.116:4": "\"Tena hi, bhikkhave, suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "an10.116:5": "\"Idha, bhikkhave, ekacco adhammikena vādena adhammikaṁ vādaṁ abhiniggaṇhāti abhinippīḷeti, tena ca adhammikaṁ parisaṁ rañjeti. Tena sā adhammikā parisā uccāsaddamahāsaddā hoti:  ‘paṇḍito vata bho, paṇḍito vata bho’ti.",
    "an10.116:6": "Idha pana, bhikkhave, ekacco adhammikena vādena dhammikaṁ vādaṁ abhiniggaṇhāti abhinippīḷeti, tena ca adhammikaṁ parisaṁ rañjeti. Tena sā adhammikā parisā uccāsaddamahāsaddā hoti:  ‘paṇḍito vata bho, paṇḍito vata bho’ti.",
    "an10.116:7": "Idha pana, bhikkhave, ekacco adhammikena vādena dhammikañca vādaṁ adhammikañca vādaṁ abhiniggaṇhāti abhinippīḷeti, tena ca adhammikaṁ parisaṁ rañjeti. Tena sā adhammikā parisā uccāsaddamahāsaddā hoti:  ‘paṇḍito vata bho, paṇḍito vata bho’ti.",
    "an10.116:8": "Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabbaṁ.",
    "an10.116:9": "Katamo ca, bhikkhave, adhammo, katamo ca dhammo, katamo ca anattho, katamo ca attho?",
    "an10.116:10": "Micchāsaṅkappo, bhikkhave, adhammo; sammāsaṅkappo dhammo … micchāvācā, bhikkhave, adhammo; sammāvācā dhammo … micchākammanto, bhikkhave, adhammo; sammākammanto dhammo … micchāājīvo, bhikkhave, adhammo; sammāājīvo dhammo … micchāvāyāmo, bhikkhave, adhammo; sammāvāyāmo dhammo … micchāsati, bhikkhave, adhammo; sammāsati dhammo … micchāsamādhi, bhikkhave adhammo; sammāsamādhi dhammo … micchāñāṇaṁ, bhikkhave, adhammo; sammāñāṇaṁ dhammo.",
    "an10.116:11": "Micchāvimutti, bhikkhave, adhammo; sammāvimutti dhammo; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṁ anattho; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṁ gacchanti, ayaṁ attho.",
    "an10.116:12": "‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabban’ti, iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttan\"ti."
}