{
    "an11.16:1": "Ekaṁ samayaṁ āyasmā ānando vesāliyaṁ viharati beluvagāmake. Tena kho pana samayena dasamo gahapati aṭṭhakanāgaro pāṭaliputtaṁ anuppatto hoti kenacideva karaṇīyena.",
    "an11.16:2": "Atha kho dasamo gahapati aṭṭhakanāgaro yena kukkuṭārāmo yena aññataro bhikkhu tenupasaṅkami; upasaṅkamitvā taṁ bhikkhuṁ etadavoca:  \"kahaṁ nu kho, bhante, āyasmā ānando etarahi viharati? Dassanakāmā hi mayaṁ, bhante, āyasmantaṁ ānandan\"ti.",
    "an11.16:3": "Atha kho dasamo gahapati aṭṭhakanāgaro pāṭaliputte taṁ karaṇīyaṁ tīretvā yena vesālī beluvagāmako yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṁ ānandaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho dasamo gahapati aṭṭhakanāgaro āyasmantaṁ ānandaṁ etadavoca:",
    "an11.16:4": "\"Katamo pana, bhante ānanda, tena bhagavatā jānatā passatā arahatā sammāsambuddhena ekadhammo sammadakkhāto, yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṁ vā cittaṁ vimuccati, aparikkhīṇā vā āsavā parikkhayaṁ gacchanti, ananuppattaṁ vā anuttaraṁ yogakkhemaṁ anupāpuṇātī\"ti?",
    "an11.16:5": "Puna caparaṁ, gahapati, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ … pe … tatiyaṁ jhānaṁ … pe … catutthaṁ jhānaṁ upasampajja viharati. So iti paṭisañcikkhati:  ‘idampi kho catutthaṁ jhānaṁ abhisaṅkhataṁ abhisañcetayitaṁ’. ‘Yaṁ kho pana kiñci abhisaṅkhataṁ abhisañcetayitaṁ tadaniccaṁ nirodhadhamman’ti pajānāti. So tattha ṭhito āsavānaṁ khayaṁ pāpuṇāti; no ce āsavānaṁ khayaṁ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā.",
    "an11.16:6": "Puna caparaṁ, gahapati, bhikkhu mettāsahagatena cetasā ekaṁ disaṁ pharitvā viharati tathā dutiyaṁ tathā tatiyaṁ tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā ekaṁ disaṁ pharitvā viharati vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati:  ‘ayampi kho mettā cetovimutti abhisaṅkhatā abhisañcetayitā’. ‘Yaṁ kho pana kiñci abhisaṅkhataṁ abhisañcetayitaṁ tadaniccaṁ nirodhadhamman’ti pajānāti. So tattha ṭhito āsavānaṁ khayaṁ pāpuṇāti; no ce āsavānaṁ khayaṁ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā.",
    "an11.16:7": "Puna caparaṁ, gahapati, bhikkhu karuṇāsahagatena cetasā … pe … muditāsahagatena cetasā … pe … upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā viharati tathā dutiyaṁ tathā tatiyaṁ tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati:  ‘ayampi kho upekkhācetovimutti abhisaṅkhatā abhisañcetayitā’. ‘Yaṁ kho pana kiñci abhisaṅkhataṁ abhisañcetayitaṁ tadaniccaṁ nirodhadhamman’ti pajānāti. So tattha ṭhito āsavānaṁ khayaṁ pāpuṇāti; no ce āsavānaṁ khayaṁ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā.",
    "an11.16:8": "Puna caparaṁ, gahapati, bhikkhu sabbaso rūpasaññānaṁ samatikkamā paṭighasaññānaṁ atthaṅgamā nānattasaññānaṁ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṁ upasampajja viharati. So iti paṭisañcikkhati:  ‘ayampi kho ākāsānañcāyatanasamāpatti abhisaṅkhatā abhisañcetayitā’. ‘Yaṁ kho pana kiñci abhisaṅkhataṁ abhisañcetayitaṁ tadaniccaṁ nirodhadhamman’ti pajānāti. So tattha ṭhito āsavānaṁ khayaṁ pāpuṇāti; no ce āsavānaṁ khayaṁ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā.",
    "an11.16:9": "Puna caparaṁ, gahapati, bhikkhu sabbaso ākāsānañcāyatanaṁ samatikkamma ‘anantaṁ viññāṇan’ti viññāṇañcāyatanaṁ upasampajja viharati … pe … sabbaso viññāṇañcāyatanaṁ samatikkamma ‘Natthi kiñcī’ti ākiñcaññāyatanaṁ upasampajja viharati. So iti paṭisañcikkhati:  ‘ayampi kho ākiñcaññāyatanasamāpatti abhisaṅkhatā abhisañcetayitā’. ‘Yaṁ kho pana kiñci abhisaṅkhataṁ abhisañcetayitaṁ tadaniccaṁ nirodhadhamman’ti pajānāti. So tattha ṭhito āsavānaṁ khayaṁ pāpuṇāti; no ce āsavānaṁ khayaṁ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā.",
    "an11.16:10": "Evaṁ vutte dasamo gahapati aṭṭhakanāgaro āyasmantaṁ ānandaṁ etadavoca:  \"Seyyathāpi, bhante ānanda, puriso ekaṁ nidhimukhaṁ gavesanto sakideva ekādasa nidhimukhāni adhigaccheyya; evamevaṁ kho ahaṁ, bhante, ekaṁ amatadvāraṁ gavesanto sakideva ekādasa amatadvārāni alatthaṁ sevanāya. Seyyathāpi, bhante, purisassa agāraṁ ekādasa dvāraṁ. So tasmiṁ agāre āditte ekamekenapi dvārena sakkuṇeyya attānaṁ sotthiṁ kātuṁ; evamevaṁ kho ahaṁ, bhante, imesaṁ ekādasannaṁ amatadvārānaṁ ekamekenapi amatadvārena sakkuṇissāmi attānaṁ sotthiṁ kātuṁ. Ime hi nāma, bhante, aññatitthiyā ācariyassa ācariyadhanaṁ pariyesissanti. Kiṁ panāhaṁ āyasmato ānandassa pūjaṁ na karissāmī\"ti.",
    "an11.16:11": "Atha kho dasamo gahapati aṭṭhakanāgaro vesālikañca pāṭaliputtakañca bhikkhusaṅghaṁ sannipātāpetvā paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Ekamekañca bhikkhuṁ paccekaṁ dussayugena acchādesi, āyasmantañca ānandaṁ ticīvarena. Āyasmato ānandassa pañcasataṁ vihāraṁ kārāpesīti."
}