{
    "an11.2:1": "\"Sīlavato, bhikkhave, sīlasampannassa na cetanāya karaṇīyaṁ:  ‘avippaṭisāro me uppajjatū’ti. Dhammatā esā, bhikkhave, yaṁ sīlavato sīlasampannassa avippaṭisāro uppajjati.",
    "an11.2:2": "Avippaṭisārissa, bhikkhave, na cetanāya karaṇīyaṁ:  ‘pāmojjaṁ me uppajjatū’ti. Dhammatā esā, bhikkhave, yaṁ avippaṭisārissa pāmojjaṁ uppajjati.",
    "an11.2:3": "Pamuditassa, bhikkhave, na cetanāya karaṇīyaṁ:  ‘pīti me uppajjatū’ti. Dhammatā esā, bhikkhave, yaṁ pamuditassa pīti uppajjati.",
    "an11.2:4": "Pītimanassa, bhikkhave, na cetanāya karaṇīyaṁ:  ‘kāyo me passambhatū’ti. Dhammatā esā, bhikkhave, yaṁ pītimanassa kāyo passambhati.",
    "an11.2:5": "Passaddhakāyassa, bhikkhave, na cetanāya karaṇīyaṁ:  ‘sukhaṁ vediyāmī’ti. Dhammatā esā, bhikkhave, yaṁ passaddhakāyo sukhaṁ vediyati.",
    "an11.2:6": "Sukhino, bhikkhave, na cetanāya karaṇīyaṁ:  ‘cittaṁ me samādhiyatū’ti. Dhammatā esā, bhikkhave, yaṁ sukhino cittaṁ samādhiyati.",
    "an11.2:7": "Samāhitassa, bhikkhave, na cetanāya karaṇīyaṁ:  ‘yathābhūtaṁ jānāmi passāmī’ti. Dhammatā esā, bhikkhave, yaṁ samāhito yathābhūtaṁ jānāti passati.",
    "an11.2:8": "Yathābhūtaṁ, bhikkhave, jānato passato na cetanāya karaṇīyaṁ:  ‘nibbindāmī’ti. Dhammatā esā, bhikkhave, yaṁ yathābhūtaṁ jānaṁ passaṁ nibbindati.",
    "an11.2:9": "Nibbinnassa, bhikkhave, na cetanāya karaṇīyaṁ:  ‘virajjāmī’ti. Dhammatā esā, bhikkhave, yaṁ nibbinno virajjati.",
    "an11.2:10": "Virattassa, bhikkhave, na cetanāya karaṇīyaṁ:  ‘vimuttiñāṇadassanaṁ sacchikaromī’ti. Dhammatā esā, bhikkhave, yaṁ viratto vimuttiñāṇadassanaṁ sacchikaroti.",
    "an11.2:11": "Iti kho, bhikkhave, virāgo vimuttiñāṇadassanattho vimuttiñāṇadassanānisaṁso, nibbidā virāgatthā virāgānisaṁsā, yathābhūtañāṇadassanaṁ nibbidatthaṁ nibbidānisaṁsaṁ, samādhi yathābhūtañāṇadassanattho yathābhūtañāṇadassanānisaṁso, sukhaṁ samādhatthaṁ samādhānisaṁsaṁ, passaddhi sukhatthā sukhānisaṁsā, pīti passaddhatthā passaddhānisaṁsā, pāmojjaṁ pītatthaṁ pītānisaṁsaṁ, avippaṭisāro pāmojjattho pāmojjānisaṁso, kusalāni sīlāni avippaṭisāratthāni avippaṭisārānisaṁsāni."
}