{
    "an2.36:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā sāriputto sāvatthiyaṁ viharati pubbārāme migāramātupāsāde. Tatra kho āyasmā sāriputto bhikkhū āmantesi:",
    "an2.36:2": "\"Katamo cāvuso, ajjhattasaṁyojano puggalo? Idhāvuso, bhikkhu sīlavā hoti, pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. So kāyassa bhedā paraṁ maraṇā aññataraṁ devanikāyaṁ upapajjati. So tato cuto āgāmī hoti, āgantā itthattaṁ. Ayaṁ vuccati, āvuso, ajjhattasaṁyojano puggalo āgāmī hoti, āgantā itthattaṁ.",
    "an2.36:3": "Katamo cāvuso, bahiddhāsaṁyojano puggalo? Idhāvuso, bhikkhu sīlavā hoti, pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. So aññataraṁ santaṁ cetovimuttiṁ upasampajja viharati. So kāyassa bhedā paraṁ maraṇā aññataraṁ devanikāyaṁ upapajjati. So tato cuto anāgāmī hoti, anāgantā itthattaṁ. Ayaṁ vuccatāvuso, bahiddhāsaṁyojano puggalo anāgāmī hoti, anāgantā itthattaṁ.",
    "an2.36:4": "Puna caparaṁ, āvuso, bhikkhu sīlavā hoti … pe … samādāya sikkhati sikkhāpadesu. So kāmānaṁyeva nibbidāya virāgāya nirodhāya paṭipanno hoti. So bhavānaṁyeva nibbidāya virāgāya nirodhāya paṭipanno hoti. So taṇhākkhayāya paṭipanno hoti. So lobhakkhayāya paṭipanno hoti. So kāyassa bhedā paraṁ maraṇā aññataraṁ devanikāyaṁ upapajjati. So tato cuto anāgāmī hoti, anāgantā itthattaṁ. Ayaṁ vuccatāvuso, bahiddhāsaṁyojano puggalo anāgāmī hoti, anāgantā itthattan\"ti.",
    "an2.36:5": "Atha kho sambahulā samacittā devatā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhaṁsu. Ekamantaṁ ṭhitā kho tā devatā bhagavantaṁ etadavocuṁ:  \"eso, bhante, āyasmā sāriputto pubbārāme migāramātupāsāde bhikkhūnaṁ ajjhattasaṁyojanañca puggalaṁ deseti bahiddhāsaṁyojanañca. Haṭṭhā, bhante, parisā. Sādhu, bhante, bhagavā yenāyasmā sāriputto tenupasaṅkamatu anukampaṁ upādāyā\"ti. Adhivāsesi bhagavā tuṇhībhāvena.",
    "an2.36:6": "\"Idha, sāriputta, sambahulā samacittā devatā yenāhaṁ tenupasaṅkamiṁsu; upasaṅkamitvā maṁ abhivādetvā ekamantaṁ aṭṭhaṁsu. Ekamantaṁ ṭhitā kho, sāriputta, tā devatā maṁ etadavocuṁ:  ‘eso, bhante, āyasmā sāriputto pubbārāme migāramātupāsāde bhikkhūnaṁ ajjhattasaṁyojanañca puggalaṁ deseti bahiddhāsaṁyojanañca. Haṭṭhā, bhante, parisā. Sādhu, bhante, bhagavā yena āyasmā sāriputto tenupasaṅkamatu anukampaṁ upādāyā’ti."
}