{
    "an2.15:1": "\"Yasmiṁ, bhikkhave, adhikaraṇe āpanno ca bhikkhu codako ca bhikkhu na sādhukaṁ attanāva attānaṁ paccavekkhati tasmetaṁ, bhikkhave, adhikaraṇe pāṭikaṅkhaṁ: ‘dīghattāya kharattāya vāḷattāya saṁvattissati, bhikkhū ca na phāsuṁ viharissantī’ti. Yasmiñca kho, bhikkhave, adhikaraṇe āpanno ca bhikkhu codako ca bhikkhu sādhukaṁ attanāva attānaṁ paccavekkhati tasmetaṁ, bhikkhave, adhikaraṇe pāṭikaṅkhaṁ:  ‘Na dīghattāya kharattāya vāḷattāya saṁvattissati, bhikkhū ca phāsuṁ viharissantī’ti.",
    "an2.15:2": "Kathañca, bhikkhave, āpanno bhikkhu sādhukaṁ attanāva attānaṁ paccavekkhati? Idha, bhikkhave, āpanno bhikkhu iti paṭisañcikkhati:  ‘Ahaṁ kho akusalaṁ āpanno kañcideva desaṁ kāyena. Maṁ so bhikkhu addasa akusalaṁ āpajjamānaṁ kañcideva desaṁ kāyena. No ce ahaṁ akusalaṁ āpajjeyyaṁ kañcideva desaṁ kāyena, na maṁ so bhikkhu passeyya akusalaṁ āpajjamānaṁ kañcideva desaṁ kāyena. Yasmā ca kho, ahaṁ akusalaṁ āpanno kañcideva desaṁ kāyena, tasmā maṁ so bhikkhu addasa akusalaṁ āpajjamānaṁ kañcideva desaṁ kāyena. Disvā ca pana maṁ so bhikkhu akusalaṁ āpajjamānaṁ kañcideva desaṁ kāyena anattamano ahosi. Anattamano samāno anattamanavacanaṁ maṁ so bhikkhu avaca. Anattamanavacanāhaṁ tena bhikkhunā vutto samāno anattamano ahosiṁ. Anattamano samāno paresaṁ ārocesiṁ. Iti mameva tattha accayo accagamā suṅkadāyakaṁva bhaṇḍasmin’ti. Evaṁ kho, bhikkhave, āpanno bhikkhu sādhukaṁ attanāva attānaṁ paccavekkhati.",
    "an2.15:3": "Kathañca, bhikkhave, codako bhikkhu sādhukaṁ attanāva attānaṁ paccavekkhati? Idha, bhikkhave, codako bhikkhu iti paṭisañcikkhati:  ‘Ayaṁ kho bhikkhu akusalaṁ āpanno kañcideva desaṁ kāyena. Ahaṁ imaṁ bhikkhuṁ addasaṁ akusalaṁ āpajjamānaṁ kañcideva desaṁ kāyena. No ce ayaṁ bhikkhu akusalaṁ āpajjeyya kañcideva desaṁ kāyena, nāhaṁ imaṁ bhikkhuṁ passeyyaṁ akusalaṁ āpajjamānaṁ kañcideva desaṁ kāyena. Yasmā ca kho, ayaṁ bhikkhu akusalaṁ āpanno kañcideva desaṁ kāyena, tasmā ahaṁ imaṁ bhikkhuṁ addasaṁ akusalaṁ āpajjamānaṁ kañcideva desaṁ kāyena. Disvā ca panāhaṁ imaṁ bhikkhuṁ akusalaṁ āpajjamānaṁ kañcideva desaṁ kāyena anattamano ahosiṁ. Anattamano samāno anattamanavacanāhaṁ imaṁ bhikkhuṁ avacaṁ. Anattamanavacanāyaṁ bhikkhu mayā vutto samāno anattamano ahosi. Anattamano samāno paresaṁ ārocesi. Iti mameva tattha accayo accagamā suṅkadāyakaṁva bhaṇḍasmin’ti. Evaṁ kho, bhikkhave, codako bhikkhu sādhukaṁ attanāva attānaṁ paccavekkhati.",
    "an2.15:4": "Yasmiṁ, bhikkhave, adhikaraṇe āpanno ca bhikkhu codako ca bhikkhu na sādhukaṁ attanāva attānaṁ paccavekkhati tasmetaṁ, bhikkhave, adhikaraṇe pāṭikaṅkhaṁ dīghattāya kharattāya vāḷattāya saṁvattissati, bhikkhū ca na phāsuṁ viharissantīti. Yasmiñca kho, bhikkhave, adhikaraṇe āpanno ca bhikkhu codako ca bhikkhu sādhukaṁ attanāva attānaṁ paccavekkhati tasmetaṁ, bhikkhave, adhikaraṇe pāṭikaṅkhaṁ na dīghattāya kharattāya vāḷattāya saṁvattissati, bhikkhū ca phāsuṁ viharissantī\"ti."
}