{
    "an2.1:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi:  \"bhikkhavo\"ti.",
    "an2.1:2": "\"Dvemāni, bhikkhave, vajjāni. Katamāni dve? Diṭṭhadhammikañca vajjaṁ samparāyikañca vajjaṁ.",
    "an2.1:3": "Tassa evaṁ hoti:  ‘yathārūpānaṁ kho pāpakānaṁ kammānaṁ hetu coraṁ āgucāriṁ rājāno gahetvā vividhā kammakāraṇā kārenti; kasāhipi tāḷenti, vettehipi tāḷenti, addhadaṇḍakehipi tāḷenti, hatthampi chindanti, pādampi chindanti, hatthapādampi chindanti, kaṇṇampi chindanti, nāsampi chindanti, kaṇṇanāsampi chindanti, bilaṅgathālikampi karonti, saṅkhamuṇḍikampi karonti, rāhumukhampi karonti, jotimālikampi karonti, hatthapajjotikampi karonti, erakavattikampi karonti, cīrakavāsikampi karonti, eṇeyyakampi karonti, baḷisamaṁsikampi karonti, kahāpaṇikampi karonti, khārāpatacchikampi karonti, palighaparivattikampi karonti, palālapīṭhakampi karonti, tattenapi telena osiñcanti, sunakhehipi khādāpenti, jīvantampi sūle uttāsenti, asināpi sīsaṁ chindanti. Ahañceva kho pana evarūpaṁ pāpakammaṁ kareyyaṁ, mampi rājāno gahetvā evarūpā vividhā kammakāraṇā kāreyyuṁ; kasāhipi tāḷeyyuṁ … pe … asināpi sīsaṁ chindeyyun’ti. So diṭṭhadhammikassa vajjassa bhīto na paresaṁ pābhataṁ vilumpanto carati. Idaṁ vuccati, bhikkhave, diṭṭhadhammikaṁ vajjaṁ.",
    "an2.1:4": "Katamañca, bhikkhave, samparāyikaṁ vajjaṁ? Idha, bhikkhave, ekacco iti paṭisañcikkhati:  ‘kāyaduccaritassa kho pana pāpako dukkho vipāko abhisamparāyaṁ, vacīduccaritassa pāpako dukkho vipāko abhisamparāyaṁ, manoduccaritassa pāpako dukkho vipāko abhisamparāyaṁ. Ahañceva kho pana kāyena duccaritaṁ careyyaṁ, vācāya duccaritaṁ careyyaṁ, manasā duccaritaṁ careyyaṁ. Kiñca taṁ yāhaṁ na kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyyan’ti. So samparāyikassa vajjassa bhīto kāyaduccaritaṁ pahāya kāyasucaritaṁ bhāveti, vacīduccaritaṁ pahāya vacīsucaritaṁ bhāveti, manoduccaritaṁ pahāya manosucaritaṁ bhāveti, suddhaṁ attānaṁ pariharati. Idaṁ vuccati, bhikkhave, samparāyikaṁ vajjaṁ."
}