{
    "an2.62:1": "\"Asantasannivāsañca vo, bhikkhave, desessāmi santasannivāsañca. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti. \"Evaṁ, bhante\"ti kho te bhikkhū bhagavato paccassosuṁ.",
    "an2.62:2": "\"Kathañca, bhikkhave, asantasannivāso hoti, kathañca asanto sannivasanti? Idha, bhikkhave, therassa bhikkhuno evaṁ hoti:  ‘theropi maṁ na vadeyya, majjhimopi maṁ na vadeyya, navopi maṁ na vadeyya; therampāhaṁ na vadeyyaṁ, majjhimampāhaṁ na vadeyyaṁ, navampāhaṁ na vadeyyaṁ. Thero cepi maṁ vadeyya ahitānukampī maṁ vadeyya no hitānukampī, noti naṁ vadeyyaṁ viheṭheyyaṁ passampissa nappaṭikareyyaṁ. Majjhimo cepi maṁ vadeyya … pe … navo cepi maṁ vadeyya, ahitānukampī maṁ vadeyya no hitānukampī, noti naṁ vadeyyaṁ viheṭheyyaṁ passampissa nappaṭikareyyaṁ’. Majjhimassapi bhikkhuno evaṁ hoti … pe … navassapi bhikkhuno evaṁ hoti:  ‘theropi maṁ na vadeyya, majjhimopi maṁ na vadeyya, navopi maṁ na vadeyya; therampāhaṁ na vadeyyaṁ, majjhimampāhaṁ na vadeyyaṁ, navampāhaṁ na vadeyyaṁ. Thero cepi maṁ vadeyya ahitānukampī maṁ vadeyya no hitānukampī noti naṁ vadeyyaṁ viheṭheyyaṁ passampissa nappaṭikareyyaṁ. Majjhimo cepi maṁ vadeyya … navo cepi maṁ vadeyya ahitānukampī maṁ vadeyya no hitānukampī, noti naṁ vadeyyaṁ viheṭheyyaṁ passampissa nappaṭikareyyaṁ’. Evaṁ kho, bhikkhave, asantasannivāso hoti, evañca asanto sannivasanti.",
    "an2.62:3": "Kathañca, bhikkhave, santasannivāso hoti, kathañca santo sannivasanti? Idha, bhikkhave, therassa bhikkhuno evaṁ hoti:  ‘theropi maṁ vadeyya, majjhimopi maṁ vadeyya, navopi maṁ vadeyya; therampāhaṁ vadeyyaṁ, majjhimampāhaṁ vadeyyaṁ, navampāhaṁ vadeyyaṁ. Thero cepi maṁ vadeyya hitānukampī maṁ vadeyya no ahitānukampī, sādhūti naṁ vadeyyaṁ na naṁ viheṭheyyaṁ passampissa paṭikareyyaṁ. Majjhimo cepi maṁ vadeyya … pe … navo cepi maṁ vadeyya hitānukampī maṁ vadeyya no ahitānukampī, sādhūti naṁ vadeyyaṁ na naṁ viheṭheyyaṁ passampissa paṭikareyyaṁ’. Majjhimassapi bhikkhuno evaṁ hoti … pe … navassapi bhikkhuno evaṁ hoti:  ‘theropi maṁ vadeyya, majjhimopi maṁ vadeyya, navopi maṁ vadeyya; therampāhaṁ vadeyyaṁ, majjhimampāhaṁ vadeyyaṁ, navampāhaṁ vadeyyaṁ. Thero cepi maṁ vadeyya hitānukampī maṁ vadeyya no ahitānukampī, sādhūti naṁ vadeyyaṁ na naṁ viheṭheyyaṁ passampissa paṭikareyyaṁ. Majjhimo cepi maṁ vadeyya … pe … navo cepi maṁ vadeyya hitānukampī maṁ vadeyya no ahitānukampī, sādhūti naṁ vadeyyaṁ na naṁ viheṭheyyaṁ passampissa paṭikareyyaṁ’. Evaṁ kho, bhikkhave, santasannivāso hoti, evañca santo sannivasantī\"ti."
}