{
    "an2.37:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ āyasmā mahākaccāno varaṇāyaṁ viharati bhaddasāritīre. Atha kho ārāmadaṇḍo brāhmaṇo yenāyasmā mahākaccāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahākaccānena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho ārāmadaṇḍo brāhmaṇo āyasmantaṁ mahākaccānaṁ etadavoca:  \"ko nu kho, bho kaccāna, hetu ko paccayo yena khattiyāpi khattiyehi vivadanti, brāhmaṇāpi brāhmaṇehi vivadanti, gahapatikāpi gahapatikehi vivadantī\"ti.",
    "an2.37:2": "\"Ko pana, bho kaccāna, hetu ko paccayo yena samaṇāpi samaṇehi vivadantī\"ti?",
    "an2.37:3": "\"Atthi pana, bho kaccāna, koci lokasmiṁ yo imañceva kāmarāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṁ samatikkanto, imañca diṭṭhirāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṁ samatikkanto\"ti?",
    "an2.37:4": "\"Ko pana so, bho kaccāna, lokasmiṁ yo imañceva kāmarāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṁ samatikkanto, imañca diṭṭhirāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṁ samatikkanto\"ti?",
    "an2.37:5": "Evaṁ vutte, ārāmadaṇḍo brāhmaṇo uṭṭhāyāsanā ekaṁsaṁ uttarāsaṅgaṁ karitvā dakkhiṇaṁ jāṇumaṇḍalaṁ pathaviyaṁ nihantvā yena bhagavā tenañjaliṁ paṇāmetvā tikkhattuṁ udānaṁ udānesi:.",
    "an2.37:6": "\"Namo tassa bhagavato arahato sammāsambuddhassa.",
    "an2.37:7": "Namo tassa bhagavato arahato sammāsambuddhassa.",
    "an2.37:8": "Namo tassa bhagavato arahato sammāsambuddhassa.",
    "an2.37:9": "Yo hi so bhagavā imañceva kāmarāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṁ samatikkanto, imañca diṭṭhirāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṁ samatikkanto\"ti.",
    "an2.37:10": "\"Abhikkantaṁ, bho kaccāna, abhikkantaṁ, bho kaccāna. Seyyathāpi, bho kaccāna, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya; andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā kaccānena anekapariyāyena dhammo pakāsito. Esāhaṁ, bho kaccāna, taṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṁ maṁ bhavaṁ kaccāno dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}