{
    "an3.100:1": "\"Yo, bhikkhave, evaṁ vadeyya:  ‘yathā yathāyaṁ puriso kammaṁ karoti tathā tathā taṁ paṭisaṁvediyatī’ti, evaṁ santaṁ, bhikkhave, brahmacariyavāso na hoti, okāso na paññāyati sammā dukkhassa antakiriyāya. Yo ca kho, bhikkhave, evaṁ vadeyya:  ‘yathā yathā vedanīyaṁ ayaṁ puriso kammaṁ karoti tathā tathāssa vipākaṁ paṭisaṁvediyatī’ti, evaṁ santaṁ, bhikkhave, brahmacariyavāso hoti, okāso paññāyati sammā dukkhassa antakiriyāya.",
    "an3.100:2": "Kathaṁrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṁ kataṁ tamenaṁ nirayaṁ upaneti? Idha pana, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṁ kataṁ tamenaṁ nirayaṁ upaneti.",
    "an3.100:3": "Kathaṁrūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva.",
    "an3.100:4": "Seyyathāpi, bhikkhave, puriso loṇakapallaṁ paritte udakamallake pakkhipeyya. Taṁ kiṁ maññatha, bhikkhave, api nu taṁ parittaṁ udakaṁ amunā loṇakapallena loṇaṁ assa apeyyan\"ti.",
    "an3.100:5": "\"Evamevaṁ kho, bhikkhave, idhekaccassa puggalassa appamattakampi pāpakammaṁ kataṁ tamenaṁ nirayaṁ upaneti. Idha, bhikkhave, ekaccassa puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva.",
    "an3.100:6": "Kathaṁrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṁ kataṁ tamenaṁ nirayaṁ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṁ kataṁ tamenaṁ nirayaṁ upaneti.",
    "an3.100:7": "Kathaṁrūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva.(1)",
    "an3.100:8": "Idha, bhikkhave, ekacco aḍḍhakahāpaṇenapi bandhanaṁ nigacchati, kahāpaṇenapi bandhanaṁ nigacchati, kahāpaṇasatenapi bandhanaṁ nigacchati. Idha, bhikkhave, ekacco aḍḍhakahāpaṇenapi na bandhanaṁ nigacchati, kahāpaṇenapi na bandhanaṁ nigacchati, kahāpaṇasatenapi na bandhanaṁ nigacchati.",
    "an3.100:9": "Kathaṁrūpo, bhikkhave, aḍḍhakahāpaṇenapi bandhanaṁ nigacchati, kahāpaṇenapi bandhanaṁ nigacchati, kahāpaṇasatenapi bandhanaṁ nigacchati? Idha, bhikkhave, ekacco daliddo hoti appassako appabhogo. Evarūpo, bhikkhave, aḍḍhakahāpaṇenapi bandhanaṁ nigacchati, kahāpaṇenapi bandhanaṁ nigacchati, kahāpaṇasatenapi bandhanaṁ nigacchati.",
    "an3.100:10": "Kathaṁrūpo, bhikkhave, aḍḍhakahāpaṇenapi na bandhanaṁ nigacchati, kahāpaṇenapi na bandhanaṁ nigacchati, kahāpaṇasatenapi na bandhanaṁ nigacchati? Idha, bhikkhave, ekacco aḍḍho hoti mahaddhano mahābhogo. Evarūpo, bhikkhave, aḍḍhakahāpaṇenapi na bandhanaṁ nigacchati, kahāpaṇenapi na bandhanaṁ nigacchati, kahāpaṇasatenapi na bandhanaṁ nigacchati.",
    "an3.100:11": "Kathaṁrūpassa, bhikkhave, puggalassa appamattakaṁ pāpakammaṁ kataṁ, tamenaṁ nirayaṁ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ tamenaṁ nirayaṁ upaneti.",
    "an3.100:12": "Kathaṁrūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva.(2)",
    "an3.100:13": "Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva.",
    "an3.100:14": "Kathaṁrūpaṁ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṁ adinnaṁ ādiyamānaṁ pahoti hantuṁ vā bandhituṁ vā jāpetuṁ vā yathāpaccayaṁ vā kātuṁ? Idha, bhikkhave, ekacco daliddo hoti appassako appabhogo. Evarūpaṁ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṁ adinnaṁ ādiyamānaṁ pahoti hantuṁ vā bandhituṁ vā jāpetuṁ vā yathāpaccayaṁ vā kātuṁ.",
    "an3.100:15": "Kathaṁrūpaṁ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṁ adinnaṁ ādiyamānaṁ nappahoti hantuṁ vā bandhituṁ vā jāpetuṁ vā yathāpaccayaṁ vā kātuṁ. Idha, bhikkhave, ekacco aḍḍho hoti mahaddhano mahābhogo rājā vā rājamahāmatto vā. Evarūpaṁ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṁ adinnaṁ ādiyamānaṁ nappahoti hantuṁ vā bandhituṁ vā jāpetuṁ vā yathāpaccayaṁ vā kātuṁ. Aññadatthu pañjalikova naṁ yācati:  ‘dehi me, mārisa, urabbhaṁ vā urabbhadhanaṁ vā’ti.",
    "an3.100:16": "Kathaṁrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṁ kataṁ tamenaṁ nirayaṁ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṁ kataṁ tamenaṁ nirayaṁ upaneti.",
    "an3.100:17": "Kathaṁrūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṁyeva appamattakaṁ pāpakammaṁ kataṁ diṭṭhadhammavedanīyaṁ hoti, nāṇupi khāyati, kiṁ bahudeva.(3)",
    "an3.100:18": "Yo, bhikkhave, evaṁ vadeyya:  ‘yathā yathāyaṁ puriso kammaṁ karoti tathā tathā taṁ paṭisaṁvedetī’ti, evaṁ santaṁ, bhikkhave, brahmacariyavāso na hoti, okāso na paññāyati sammā dukkhassa antakiriyāya. Yo ca kho, bhikkhave, evaṁ vadeyya:  ‘yathā yathā vedanīyaṁ ayaṁ puriso kammaṁ karoti tathā tathā tassa vipākaṁ paṭisaṁvedetī’ti, evaṁ santaṁ, bhikkhave, brahmacariyavāso hoti, okāso paññāyati sammā dukkhassa antakiriyāyā\"ti."
}