{
    "an3.21:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ca samiddho āyasmā ca mahākoṭṭhiko yenāyasmā sāriputto tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā sāriputtena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnaṁ kho āyasmantaṁ samiddhaṁ āyasmā sāriputto etadavoca:",
    "an3.21:2": "\"Tayome, āvuso samiddha, puggalā santo saṁvijjamānā lokasmiṁ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṁvijjamānā lokasmiṁ. Imesaṁ, āvuso, tiṇṇaṁ puggalānaṁ katamo te puggalo khamati abhikkantataro ca paṇītataro cā\"ti?",
    "an3.21:3": "\"Tayome, āvuso sāriputta, puggalā santo saṁvijjamānā lokasmiṁ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṁvijjamānā lokasmiṁ. Imesaṁ, āvuso, tiṇṇaṁ puggalānaṁ yvāyaṁ puggalo saddhāvimutto, ayaṁ me puggalo khamati imesaṁ tiṇṇaṁ puggalānaṁ abhikkantataro ca paṇītataro ca. Taṁ kissa hetu? Imassa, āvuso, puggalassa saddhindriyaṁ adhimattan\"ti.",
    "an3.21:4": "Atha kho āyasmā sāriputto āyasmantaṁ mahākoṭṭhikaṁ etadavoca:  \"tayome, āvuso koṭṭhika, puggalā santo saṁvijjamānā lokasmiṁ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṁvijjamānā lokasmiṁ. Imesaṁ, āvuso, tiṇṇaṁ puggalānaṁ katamo te puggalo khamati abhikkantataro ca paṇītataro cā\"ti?",
    "an3.21:5": "\"Tayome, āvuso sāriputta, puggalā santo saṁvijjamānā lokasmiṁ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṁvijjamānā lokasmiṁ. Imesaṁ, āvuso, tiṇṇaṁ puggalānaṁ yvāyaṁ puggalo kāyasakkhī, ayaṁ me puggalo khamati imesaṁ tiṇṇaṁ puggalānaṁ abhikkantataro ca paṇītataro ca. Taṁ kissa hetu? Imassa, āvuso, puggalassa samādhindriyaṁ adhimattan\"ti.",
    "an3.21:6": "Atha kho āyasmā mahākoṭṭhiko āyasmantaṁ sāriputtaṁ etadavoca:  \"tayome, āvuso sāriputta, puggalā santo saṁvijjamānā lokasmiṁ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṁvijjamānā lokasmiṁ. Imesaṁ, āvuso, tiṇṇaṁ puggalānaṁ katamo te puggalo khamati abhikkantataro ca paṇītataro cā\"ti?",
    "an3.21:7": "\"Tayome, āvuso koṭṭhika, puggalā santo saṁvijjamānā lokasmiṁ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṁvijjamānā lokasmiṁ.",
    "an3.21:8": "Atha kho āyasmā sāriputto āyasmantañca samiddhaṁ āyasmantañca mahākoṭṭhikaṁ etadavoca:  \"byākataṁ kho, āvuso, amhehi sabbeheva yathāsakaṁ paṭibhānaṁ. Āyāmāvuso, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavato etamatthaṁ ārocessāma. Yathā no bhagavā byākarissati tathā naṁ dhāressāmā\"ti.",
    "an3.21:9": "\"Na khvettha, sāriputta, sukaraṁ ekaṁsena byākātuṁ:  ‘Ayaṁ imesaṁ tiṇṇaṁ puggalānaṁ abhikkantataro ca paṇītataro cā’ti.",
    "an3.21:10": "Na khvettha, sāriputta, sukaraṁ ekaṁsena byākātuṁ:  ‘Ayaṁ imesaṁ tiṇṇaṁ puggalānaṁ abhikkantataro ca paṇītataro cā’ti.",
    "an3.21:11": "Na khvettha, sāriputta, sukaraṁ ekaṁsena byākātuṁ:  ‘Ayaṁ imesaṁ tiṇṇaṁ puggalānaṁ abhikkantataro ca paṇītataro cā’ti.",
    "an3.21:12": "Na khvettha, sāriputta, sukaraṁ ekaṁsena byākātuṁ:  ‘Ayaṁ imesaṁ tiṇṇaṁ puggalānaṁ abhikkantataro ca paṇītataro cā’\"ti."
}