{
    "an3.62:1": "\"Tīṇimāni, bhikkhave, amātāputtikāni bhayānīti assutavā puthujjano bhāsati. Katamāni tīṇi.",
    "an3.62:2": "Puna caparaṁ, bhikkhave, hoti so samayo yaṁ mahāmegho vuṭṭhāti. Mahāmeghe kho pana, bhikkhave, vuṭṭhite mahāudakavāhako sañjāyati. Mahāudakavāhake kho pana, bhikkhave, sañjāyante tena gāmāpi vuyhanti nigamāpi vuyhanti nagarāpi vuyhanti. Gāmesupi vuyhamānesu nigamesupi vuyhamānesu nagaresupi vuyhamānesu tattha mātāpi puttaṁ nappaṭilabhati, puttopi mātaraṁ nappaṭilabhati. Idaṁ, bhikkhave, dutiyaṁ amātāputtikaṁ bhayanti assutavā puthujjano bhāsati.",
    "an3.62:3": "Puna caparaṁ, bhikkhave, hoti so samayo yaṁ bhayaṁ hoti aṭavisaṅkopo, cakkasamāruḷhā jānapadā pariyāyanti. Bhaye kho pana, bhikkhave, sati aṭavisaṅkope cakkasamāruḷhesu jānapadesu pariyāyantesu tattha mātāpi puttaṁ nappaṭilabhati, puttopi mātaraṁ nappaṭilabhati. Idaṁ, bhikkhave, tatiyaṁ amātāputtikaṁ bhayanti assutavā puthujjano bhāsati.",
    "an3.62:4": "Tāni kho panimāni, bhikkhave, tīṇi samātāputtikāniyeva bhayāni amātāputtikāni bhayānīti assutavā puthujjano bhāsati. Katamāni tīṇi.",
    "an3.62:5": "Puna caparaṁ, bhikkhave, hoti so samayo yaṁ mahāmegho vuṭṭhāti. Mahāmeghe kho pana, bhikkhave, vuṭṭhite mahāudakavāhako sañjāyati. Mahāudakavāhake kho pana, bhikkhave, sañjāte tena gāmāpi vuyhanti nigamāpi vuyhanti nagarāpi vuyhanti. Gāmesupi vuyhamānesu nigamesupi vuyhamānesu nagaresupi vuyhamānesu hoti so samayo yaṁ kadāci karahaci mātāpi puttaṁ paṭilabhati, puttopi mātaraṁ paṭilabhati. Idaṁ, bhikkhave, dutiyaṁ samātāputtikaṁyeva bhayaṁ amātāputtikaṁ bhayanti assutavā puthujjano bhāsati.",
    "an3.62:6": "Puna caparaṁ, bhikkhave, hoti so samayo yaṁ bhayaṁ hoti aṭavisaṅkopo, cakkasamāruḷhā jānapadā pariyāyanti. Bhaye kho pana, bhikkhave, sati aṭavisaṅkope cakkasamāruḷhesu jānapadesu pariyāyantesu hoti so samayo yaṁ kadāci karahaci mātāpi puttaṁ paṭilabhati, puttopi mātaraṁ paṭilabhati. Idaṁ, bhikkhave, tatiyaṁ samātāputtikaṁyeva bhayaṁ amātāputtikaṁ bhayanti assutavā puthujjano bhāsati.",
    "an3.62:7": "Tīṇimāni, bhikkhave, amātāputtikāni bhayāni. Katamāni tīṇi? Jarābhayaṁ, byādhibhayaṁ, maraṇabhayanti.",
    "an3.62:8": "Na, bhikkhave, mātā puttaṁ byādhiyamānaṁ evaṁ labhati:  ‘Ahaṁ byādhiyāmi, mā me putto byādhiyī’ti; putto vā pana mātaraṁ byādhiyamānaṁ na evaṁ labhati:  ‘Ahaṁ byādhiyāmi, mā me mātā byādhiyī’ti.",
    "an3.62:9": "Na, bhikkhave, mātā puttaṁ mīyamānaṁ evaṁ labhati:  ‘Ahaṁ mīyāmi, mā me putto mīyī’ti; putto vā pana mātaraṁ mīyamānaṁ na evaṁ labhati:  ‘Ahaṁ mīyāmi, mā me mātā mīyī’ti.",
    "an3.62:10": "Atthi, bhikkhave, maggo atthi paṭipadā imesañca tiṇṇaṁ samātāputtikānaṁ bhayānaṁ imesañca tiṇṇaṁ amātāputtikānaṁ bhayānaṁ pahānāya samatikkamāya saṁvattati. Katamo ca, bhikkhave, maggo katamā ca paṭipadā imesañca tiṇṇaṁ samātāputtikānaṁ bhayānaṁ imesañca tiṇṇaṁ amātāputtikānaṁ bhayānaṁ pahānāya samatikkamāya saṁvattati? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṁ – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi. Ayaṁ kho, bhikkhave, maggo ayaṁ paṭipadā imesañca tiṇṇaṁ samātāputtikānaṁ bhayānaṁ imesañca tiṇṇaṁ amātāputtikānaṁ bhayānaṁ pahānāya samatikkamāya saṁvattatī\"ti."
}