{
    "an3.57:1": "Atha kho vacchagotto paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho vacchagotto paribbājako bhagavantaṁ etadavoca.",
    "an3.57:2": "\"Ye te, vaccha, evamāhaṁsu:  ‘samaṇo gotamo evamāha:  \"mayhameva dānaṁ dātabbaṁ … pe … nāññesaṁ sāvakānaṁ dinnaṁ mahapphalan\"’ti na me te vuttavādino. Abbhācikkhanti ca pana maṁ asatā abhūtena. Yo kho, vaccha, paraṁ dānaṁ dadantaṁ vāreti so tiṇṇaṁ antarāyakaro hoti, tiṇṇaṁ pāripanthiko. Katamesaṁ tiṇṇaṁ? Dāyakassa puññantarāyakaro hoti, paṭiggāhakānaṁ lābhantarāyakaro hoti, pubbeva kho panassa attā khato ca hoti upahato ca. Yo kho, vaccha, paraṁ dānaṁ dadantaṁ vāreti so imesaṁ tiṇṇaṁ antarāyakaro hoti, tiṇṇaṁ pāripanthiko.",
    "an3.57:3": "Ahaṁ kho pana, vaccha, evaṁ vadāmi:  ‘ye hi te candanikāya vā oligalle vā pāṇā, tatrapi yo thālidhovanaṁ vā sarāvadhovanaṁ vā chaḍḍeti:  \"ye tattha pāṇā te tena yāpentū\"’ti, tato nidānampāhaṁ, vaccha, puññassa āgamaṁ vadāmi. Ko pana vādo manussabhūte. Api cāhaṁ, vaccha, sīlavato dinnaṁ mahapphalaṁ vadāmi, no tathā dussīlassa, so ca hoti pañcaṅgavippahīno pañcaṅgasamannāgato.",
    "an3.57:4": "Katamāni pañcaṅgāni pahīnāni honti? Kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṁ pahīnaṁ hoti, uddhaccakukkuccaṁ pahīnaṁ hoti, vicikicchā pahīnā hoti. Imāni pañcaṅgāni vippahīnāni honti.",
    "an3.57:5": "Katamehi pañcahi aṅgehi samannāgato hoti? Asekkhena sīlakkhandhena samannāgato hoti, asekkhena samādhikkhandhena samannāgato hoti, asekkhena paññākkhandhena samannāgato hoti, asekkhena vimuttikkhandhena samannāgato hoti, asekkhena vimuttiñāṇadassanakkhandhena samannāgato hoti; imehi pañcahi aṅgehi samannāgato hoti.",
    "an3.57:6": "Iti kaṇhāsu setāsu,rohiṇīsu harīsu vā;Kammāsāsu sarūpāsu,gosu pārevatāsu vā.",
    "an3.57:7": "Yāsu kāsuci etāsu,danto jāyati puṅgavo;Dhorayho balasampanno,kalyāṇajavanikkamo;Tameva bhāre yuñjanti,nāssa vaṇṇaṁ parikkhare.",
    "an3.57:8": "Evamevaṁ manussesu,yasmiṁ kasmiñci jātiye;Khattiye brāhmaṇe vesse,sudde caṇḍālapukkuse.",
    "an3.57:9": "Yāsu kāsuci etāsu,danto jāyati subbato;Dhammaṭṭho sīlasampanno,saccavādī hirīmano.",
    "an3.57:10": "Pahīnajātimaraṇo,brahmacariyassa kevalī;Pannabhāro visaṁyutto,katakicco anāsavo.",
    "an3.57:11": "Pāragū sabbadhammānaṁ,anupādāya nibbuto;Tasmiṁyeva viraje khette,vipulā hoti dakkhiṇā.",
    "an3.57:12": "Bālā ca avijānantā,dummedhā assutāvino;Bahiddhā denti dānāni,na hi sante upāsare.",
    "an3.57:13": "Ye ca sante upāsanti,sappaññe dhīrasammate;Saddhā ca nesaṁ sugate,mūlajātā patiṭṭhitā.",
    "an3.57:14": "Devalokañca te yanti,kule vā idha jāyare;Anupubbena nibbānaṁ,adhigacchanti paṇḍitā\"ti."
}