{
    "an3.68:1": "\"Sace, bhikkhave, aññatitthiyā paribbājakā evaṁ puccheyyuṁ:  ‘tayome, āvuso, dhammā. Katame tayo? Rāgo, doso, moho – ime kho, āvuso, tayo dhammā. Imesaṁ, āvuso, tiṇṇaṁ dhammānaṁ ko viseso ko adhippayāso kiṁ nānākaraṇan’ti? Evaṁ puṭṭhā tumhe, bhikkhave, tesaṁ aññatitthiyānaṁ paribbājakānaṁ kinti byākareyyāthā\"ti.",
    "an3.68:2": "\"Sace, bhikkhave, aññatitthiyā paribbājakā evaṁ puccheyyuṁ:  ‘tayome, āvuso, dhammā. Katame tayo? Rāgo, doso, moho – ime kho, āvuso, tayo dhammā; imesaṁ, āvuso, tiṇṇaṁ dhammānaṁ ko viseso ko adhippayāso kiṁ nānākaraṇan’ti? Evaṁ puṭṭhā tumhe, bhikkhave, tesaṁ aññatitthiyānaṁ paribbājakānaṁ evaṁ byākareyyātha:  ‘rāgo kho, āvuso, appasāvajjo dandhavirāgī, doso mahāsāvajjo khippavirāgī, moho mahāsāvajjo dandhavirāgī’ti.",
    "an3.68:3": "‘Ko panāvuso, hetu ko paccayo yena anuppanno vā rāgo uppajjati uppanno vā rāgo bhiyyobhāvāya vepullāya saṁvattatī’ti? ‘\"Subhanimittan\"tissa vacanīyaṁ. Tassa subhanimittaṁ ayoniso manasi karoto anuppanno vā rāgo uppajjati uppanno vā rāgo bhiyyobhāvāya vepullāya saṁvattati. Ayaṁ kho, āvuso, hetu ayaṁ paccayo yena anuppanno vā rāgo uppajjati uppanno vā rāgo bhiyyobhāvāya vepullāya saṁvattatī’ti.",
    "an3.68:4": "‘Ko panāvuso, hetu ko paccayo yena anuppanno vā doso uppajjati uppanno vā doso bhiyyobhāvāya vepullāya saṁvattatī’ti? ‘\"Paṭighanimittan\"tissa vacanīyaṁ. Tassa paṭighanimittaṁ ayoniso manasi karoto anuppanno vā doso uppajjati uppanno vā doso bhiyyobhāvāya vepullāya saṁvattati. Ayaṁ kho, āvuso, hetu ayaṁ paccayo yena anuppanno vā doso uppajjati uppanno vā doso bhiyyobhāvāya vepullāya saṁvattatī’ti.",
    "an3.68:5": "‘Ko panāvuso, hetu ko paccayo yena anuppanno vā moho uppajjati uppanno vā moho bhiyyobhāvāya vepullāya saṁvattatī’ti? ‘\"Ayoniso manasikāro\"tissa vacanīyaṁ. Tassa ayoniso manasi karoto anuppanno vā moho uppajjati uppanno vā moho bhiyyobhāvāya vepullāya saṁvattati. Ayaṁ kho, āvuso, hetu ayaṁ paccayo yena anuppanno vā moho uppajjati uppanno vā moho bhiyyobhāvāya vepullāya saṁvattatī’ti.",
    "an3.68:6": "‘Ko panāvuso, hetu ko paccayo yena anuppanno ceva rāgo nuppajjati uppanno ca rāgo pahīyatī’ti? ‘\"Asubhanimittan\"tissa vacanīyaṁ. Tassa asubhanimittaṁ yoniso manasi karoto anuppanno ceva rāgo nuppajjati uppanno ca rāgo pahīyati. Ayaṁ kho, āvuso, hetu ayaṁ paccayo yena anuppanno ceva rāgo nuppajjati uppanno ca rāgo pahīyatī’ti.",
    "an3.68:7": "‘Ko panāvuso, hetu ko paccayo yena anuppanno ceva doso nuppajjati uppanno ca doso pahīyatī’ti? ‘\"Mettā cetovimuttī\"tissa vacanīyaṁ. Tassa mettaṁ cetovimuttiṁ yoniso manasi karoto anuppanno ceva doso nuppajjati uppanno ca doso pahīyati. Ayaṁ kho, āvuso, hetu ayaṁ paccayo yena anuppanno ceva doso nuppajjati uppanno ca doso pahīyatī’ti.",
    "an3.68:8": "‘Ko panāvuso, hetu ko paccayo yena anuppanno ceva moho nuppajjati uppanno ca moho pahīyatī’ti? ‘\"Yonisomanasikāro\"tissa vacanīyaṁ. Tassa yoniso manasi karoto anuppanno ceva moho nuppajjati uppanno ca moho pahīyati. Ayaṁ kho, āvuso, hetu ayaṁ paccayo yena anuppanno vā moho nuppajjati uppanno ca moho pahīyatī’\"ti."
}