{
    "an3.112:1": "\"Tīṇimāni, bhikkhave, nidānāni kammānaṁ samudayāya. Katamāni tīṇi? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati; anāgate, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati; paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati.",
    "an3.112:2": "Kathañca, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Anāgate, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa anāgate chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṁyutto hoti. Etamahaṁ, bhikkhave, saṁyojanaṁ vadāmi yo cetaso sārāgo. Evaṁ kho, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando jāyati.",
    "an3.112:3": "Kathañca, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa paccuppanne chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṁyutto hoti. Etamahaṁ, bhikkhave, saṁyojanaṁ vadāmi yo cetaso sārāgo. Evaṁ kho, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando jāyati.",
    "an3.112:4": "Tīṇimāni, bhikkhave, nidānāni kammānaṁ samudayāya. Katamāni tīṇi? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati; anāgate, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati; paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati.",
    "an3.112:5": "Kathañca, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Atītānaṁ, bhikkhave, chandarāgaṭṭhāniyānaṁ dhammānaṁ āyatiṁ vipākaṁ pajānāti. Āyatiṁ vipākaṁ viditvā tadabhinivatteti. Tadabhinivattetvā cetasā abhinivijjhitvā paññāya ativijjha passati. Evaṁ kho, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati.",
    "an3.112:6": "Kathañca, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Anāgatānaṁ, bhikkhave, chandarāgaṭṭhāniyānaṁ dhammānaṁ āyatiṁ vipākaṁ pajānāti. Āyatiṁ vipākaṁ viditvā tadabhinivatteti. Tadabhinivattetvā cetasā abhinivijjhitvā paññāya ativijjha passati. Evaṁ kho, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati.",
    "an3.112:7": "Kathañca, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Paccuppannānaṁ, bhikkhave, chandarāgaṭṭhāniyānaṁ dhammānaṁ āyatiṁ vipākaṁ pajānāti, āyatiṁ vipākaṁ viditvā tadabhinivatteti, tadabhinivattetvā cetasā abhinivijjhitvā paññāya ativijjha passati. Evaṁ kho, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati.",
    "an3.112:8": "Pubbeva duve assādā,Samaṇo ruṇṇapañcamaṁ;Atitti dve ca vuttāni,Nidānāni apare duveti."
}