{
    "an3.50:1": "\"Tīhi, bhikkhave, aṅgehi samannāgato mahācoro sandhimpi chindati, nillopampi harati, ekāgārikampi karoti, paripanthepi tiṭṭhati. Katamehi tīhi? Idha, bhikkhave, mahācoro visamanissito ca hoti, gahananissito ca hoti, balavanissito ca hoti.",
    "an3.50:2": "Kathañca, bhikkhave, mahācoro gahananissito hoti? Idha, bhikkhave, mahācoro tiṇagahanaṁ vā nissito hoti, rukkhagahanaṁ vā rodhaṁ vā mahāvanasaṇḍaṁ vā. Evaṁ kho, bhikkhave, mahācoro gahananissito hoti.",
    "an3.50:3": "Kathañca, bhikkhave, mahācoro balavanissito hoti? Idha, bhikkhave, mahācoro rājānaṁ vā rājamahāmattānaṁ vā nissito hoti. Tassa evaṁ hoti:  ‘sace maṁ koci kiñci vakkhati, ime me rājāno vā rājamahāmattā vā pariyodhāya atthaṁ bhaṇissantī’ti. Sace naṁ koci kiñci āha, tyāssa rājāno vā rājamahāmattā vā pariyodhāya atthaṁ bhaṇanti. Evaṁ kho, bhikkhave, mahācoro balavanissito hoti.",
    "an3.50:4": "Evamevaṁ kho, bhikkhave, tīhi aṅgehi samannāgato pāpabhikkhu khataṁ upahataṁ attānaṁ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṁ, bahuñca apuññaṁ pasavati. Katamehi tīhi? Idha, bhikkhave, pāpabhikkhu visamanissito ca hoti gahananissito ca balavanissito ca.",
    "an3.50:5": "Kathañca, bhikkhave, pāpabhikkhu visamanissito hoti? Idha, bhikkhave, pāpabhikkhu visamena kāyakammena samannāgato hoti, visamena vacīkammena samannāgato hoti, visamena manokammena samannāgato hoti. Evaṁ kho, bhikkhave, pāpabhikkhu visamanissito hoti.",
    "an3.50:6": "Kathañca, bhikkhave, pāpabhikkhu gahananissito hoti? Idha, bhikkhave, pāpabhikkhu micchādiṭṭhiko hoti, antaggāhikāya diṭṭhiyā samannāgato hoti. Evaṁ kho, bhikkhave, pāpabhikkhu gahananissito hoti.",
    "an3.50:7": "Kathañca, bhikkhave, pāpabhikkhu balavanissito hoti? Idha, bhikkhave, pāpabhikkhu rājānaṁ vā rājamahāmattānaṁ vā nissito hoti. Tassa evaṁ hoti:  ‘sace maṁ koci kiñci vakkhati, ime me rājāno vā rājamahāmattā vā pariyodhāya atthaṁ bhaṇissantī’ti. Sace naṁ koci kiñci āha, tyāssa rājāno vā rājamahāmattā vā pariyodhāya atthaṁ bhaṇanti. Evaṁ kho, bhikkhave, pāpabhikkhu balavanissito hoti.",
    "an3.50:8": "Sammukhī ṭhānatthavasaṁ,pavatti paṇḍita sīlavaṁ;Saṅkhataṁ pabbatātappaṁ,mahācorenekādasāti."
}