{
    "an3.34:1": "\"Tīṇimāni, bhikkhave, nidānāni kammānaṁ samudayāya. Katamāni tīṇi? Lobho nidānaṁ kammānaṁ samudayāya, doso nidānaṁ kammānaṁ samudayāya, moho nidānaṁ kammānaṁ samudayāya.",
    "an3.34:2": "Yaṁ, bhikkhave, lobhapakataṁ kammaṁ lobhajaṁ lobhanidānaṁ lobhasamudayaṁ, yatthassa attabhāvo nibbattati tattha taṁ kammaṁ vipaccati. Yattha taṁ kammaṁ vipaccati tattha tassa kammassa vipākaṁ paṭisaṁvedeti, diṭṭhe vā dhamme upapajja vā apare vā pariyāye.",
    "an3.34:3": "Yaṁ, bhikkhave, dosapakataṁ kammaṁ dosajaṁ dosanidānaṁ dosasamudayaṁ, yatthassa attabhāvo nibbattati tattha taṁ kammaṁ vipaccati. Yattha taṁ kammaṁ vipaccati tattha tassa kammassa vipākaṁ paṭisaṁvedeti, diṭṭhe vā dhamme upapajja vā apare vā pariyāye.",
    "an3.34:4": "Yaṁ, bhikkhave, mohapakataṁ kammaṁ mohajaṁ mohanidānaṁ mohasamudayaṁ, yatthassa attabhāvo nibbattati tattha taṁ kammaṁ vipaccati. Yattha taṁ kammaṁ vipaccati tattha tassa kammassa vipākaṁ paṭisaṁvedeti, diṭṭhe vā dhamme upapajja vā apare vā pariyāye.",
    "an3.34:5": "Seyyathāpi, bhikkhave, bījāni akhaṇḍāni apūtīni avātātapahatāni sārādāni sukhasayitāni sukhette suparikammakatāya bhūmiyā nikkhittāni. Devo ca sammādhāraṁ anuppaveccheyya. Evassu tāni, bhikkhave, bījāni vuddhiṁ viruḷhiṁ vepullaṁ āpajjeyyuṁ. Evamevaṁ kho, bhikkhave, yaṁ lobhapakataṁ kammaṁ lobhajaṁ lobhanidānaṁ lobhasamudayaṁ, yatthassa attabhāvo nibbattati tattha taṁ kammaṁ vipaccati. Yattha taṁ kammaṁ vipaccati tattha tassa kammassa vipākaṁ paṭisaṁvedeti, diṭṭhe vā dhamme upapajja vā apare vā pariyāye.",
    "an3.34:6": "Yaṁ dosapakataṁ kammaṁ … pe … yaṁ mohapakataṁ kammaṁ mohajaṁ mohanidānaṁ mohasamudayaṁ, yatthassa attabhāvo nibbattati tattha taṁ kammaṁ vipaccati. Yattha taṁ kammaṁ vipaccati tattha tassa kammassa vipākaṁ paṭisaṁvedeti, diṭṭhe vā dhamme upapajja vā apare vā pariyāye.",
    "an3.34:7": "Tīṇimāni, bhikkhave, nidānāni kammānaṁ samudayāya. Katamāni tīṇi? Alobho nidānaṁ kammānaṁ samudayāya, adoso nidānaṁ kammānaṁ samudayāya, amoho nidānaṁ kammānaṁ samudayāya.",
    "an3.34:8": "Yaṁ, bhikkhave, alobhapakataṁ kammaṁ alobhajaṁ alobhanidānaṁ alobhasamudayaṁ, lobhe vigate evaṁ taṁ kammaṁ pahīnaṁ hoti ucchinnamūlaṁ tālāvatthukataṁ anabhāvaṅkataṁ āyatiṁ anuppādadhammaṁ.",
    "an3.34:9": "Yaṁ, bhikkhave, adosapakataṁ kammaṁ adosajaṁ adosanidānaṁ adosasamudayaṁ, dose vigate evaṁ taṁ kammaṁ pahīnaṁ hoti ucchinnamūlaṁ tālāvatthukataṁ anabhāvaṅkataṁ āyatiṁ anuppādadhammaṁ.",
    "an3.34:10": "Yaṁ, bhikkhave, amohapakataṁ kammaṁ amohajaṁ amohanidānaṁ amohasamudayaṁ, mohe vigate evaṁ taṁ kammaṁ pahīnaṁ hoti ucchinnamūlaṁ tālāvatthukataṁ anabhāvaṅkataṁ āyatiṁ anuppādadhammaṁ.",
    "an3.34:11": "Seyyathāpi, bhikkhave, bījāni akhaṇḍāni apūtīni avātātapahatāni sārādāni sukhasayitāni. Tāni puriso agginā ḍaheyya. Agginā ḍahitvā masiṁ kareyya. Masiṁ karitvā mahāvāte vā ophuṇeyya nadiyā vā sīghasotāya pavāheyya. Evassu tāni, bhikkhave, bījāni ucchinnamūlāni tālāvatthukatāni anabhāvaṅkatāni āyatiṁ anuppādadhammāni. Evamevaṁ kho, bhikkhave, yaṁ alobhapakataṁ kammaṁ alobhajaṁ alobhanidānaṁ alobhasamudayaṁ, lobhe vigate evaṁ taṁ kammaṁ pahīnaṁ hoti ucchinnamūlaṁ tālāvatthukataṁ anabhāvaṅkataṁ āyatiṁ anuppādadhammaṁ.",
    "an3.34:12": "Yaṁ adosapakataṁ kammaṁ … pe … yaṁ amohapakataṁ kammaṁ amohajaṁ amohanidānaṁ amohasamudayaṁ, mohe vigate evaṁ taṁ kammaṁ pahīnaṁ hoti … pe … āyatiṁ anuppādadhammaṁ.",
    "an3.34:13": "Lobhajaṁ dosajañceva,mohajañcāpaviddasu;Yaṁ tena pakataṁ kammaṁ,appaṁ vā yadi vā bahuṁ;Idheva taṁ vedaniyaṁ,vatthu aññaṁ na vijjati.",
    "an3.34:14": "Tasmā lobhañca dosañca,mohajañcāpi viddasu;Vijjaṁ uppādayaṁ bhikkhu,sabbā duggatiyo jahe\"ti."
}