{
    "an3.36:1": "\"Tīṇimāni, bhikkhave, devadūtāni. Katamāni tīṇi.",
    "an3.36:2": "Tamenaṁ, bhikkhave, yamo rājā paṭhamaṁ devadūtaṁ samanuyuñjati samanugāhati samanubhāsati:  ‘ambho, purisa, na tvaṁ addasa manussesu paṭhamaṁ devadūtaṁ pātubhūtan’ti? So evamāha:  ‘nāddasaṁ, bhante’ti.",
    "an3.36:3": "Tamenaṁ, bhikkhave, yamo rājā evamāha:  ‘ambho purisa, na tvaṁ addasa manussesu itthiṁ vā purisaṁ vā āsītikaṁ vā nāvutikaṁ vā vassasatikaṁ vā jātiyā jiṇṇaṁ gopānasivaṅkaṁ bhoggaṁ daṇḍaparāyaṇaṁ pavedhamānaṁ gacchantaṁ āturaṁ gatayobbanaṁ khaṇḍadantaṁ palitakesaṁ vilūnaṁ khallitasiraṁ valitaṁ tilakāhatagattan’ti? So evamāha:  ‘addasaṁ, bhante’ti.",
    "an3.36:4": "Tamenaṁ, bhikkhave, yamo rājā evamāha:  ‘ambho, purisa, tassa te viññussa sato mahallakassa na etadahosi – ahampi khomhi jarādhammo jaraṁ anatīto, handāhaṁ kalyāṇaṁ karomi, kāyena vācāya manasā’ti? So evamāha:  ‘nāsakkhissaṁ, bhante. Pamādassaṁ, bhante’ti.",
    "an3.36:5": "Tamenaṁ, bhikkhave, yamo rājā evamāha:  ‘ambho, purisa, pamādatāya na kalyāṇamakāsi kāyena vācāya manasā. Taggha tvaṁ, ambho purisa, tathā karissanti yathā taṁ pamattaṁ. Taṁ kho pana te etaṁ pāpakammaṁ neva mātarā kataṁ, na pitarā kataṁ, na bhātarā kataṁ, na bhaginiyā kataṁ, na mittāmaccehi kataṁ, na ñātisālohitehi kataṁ, na devatāhi kataṁ, na samaṇabrāhmaṇehi kataṁ; atha kho tayāvetaṁ pāpakammaṁ kataṁ, tvaññevetassa vipākaṁ paṭisaṁvedissasī’ti.(1)",
    "an3.36:6": "Tamenaṁ, bhikkhave, yamo rājā paṭhamaṁ devadūtaṁ samanuyuñjitvā samanugāhitvā samanubhāsitvā, dutiyaṁ devadūtaṁ samanuyuñjati samanugāhati samanubhāsati:  ‘ambho purisa, na tvaṁ addasa manussesu dutiyaṁ devadūtaṁ pātubhūtan’ti? So evamāha:  ‘nāddasaṁ, bhante’ti.",
    "an3.36:7": "Tamenaṁ, bhikkhave, yamo rājā evamāha:  ‘ambho purisa, tassa te viññussa sato mahallakassa na etadahosi:  \"ahampi khomhi byādhidhammo byādhiṁ anatīto, handāhaṁ kalyāṇaṁ karomi kāyena vācāya manasā\"’ti? So evamāha:  ‘nāsakkhissaṁ, bhante. Pamādassaṁ, bhante’ti.",
    "an3.36:8": "Tamenaṁ, bhikkhave, yamo rājā evamāha:  ‘ambho purisa, pamādatāya na kalyāṇamakāsi kāyena vācāya manasā. Taggha tvaṁ, ambho purisa, tathā karissanti yathā taṁ pamattaṁ. Taṁ kho pana te etaṁ pāpakammaṁ neva mātarā kataṁ, na pitarā kataṁ, na bhātarā kataṁ, na bhaginiyā kataṁ, na mittāmaccehi kataṁ, na ñātisālohitehi kataṁ, na devatāhi kataṁ, na samaṇabrāhmaṇehi kataṁ; atha kho tayāvetaṁ pāpakammaṁ kataṁ. Tvaññevetassa vipākaṁ paṭisaṁvedissasī’ti.(2)",
    "an3.36:9": "Tamenaṁ, bhikkhave, yamo rājā dutiyaṁ devadūtaṁ samanuyuñjitvā samanugāhitvā samanubhāsitvā, tatiyaṁ devadūtaṁ samanuyuñjati samanugāhati samanubhāsati:  ‘ambho purisa, na tvaṁ addasa manussesu tatiyaṁ devadūtaṁ pātubhūtan’ti? So evamāha:  ‘nāddasaṁ, bhante’ti.",
    "an3.36:10": "Tamenaṁ, bhikkhave, yamo rājā evamāha:  ‘ambho purisa, na tvaṁ addasa manussesu itthiṁ vā purisaṁ vā ekāhamataṁ vā dvīhamataṁ vā tīhamataṁ vā uddhumātakaṁ vinīlakaṁ vipubbakajātan’ti? So evamāha:  ‘addasaṁ, bhante’ti.",
    "an3.36:11": "Tamenaṁ, bhikkhave, yamo rājā evamāha:  ‘ambho purisa, tassa te viññussa sato mahallakassa na etadahosi – ahampi khomhi maraṇadhammo maraṇaṁ anatīto, handāhaṁ kalyāṇaṁ karomi kāyena vācāya manasā’ti? So evamāha:  ‘nāsakkhissaṁ, bhante. Pamādassaṁ, bhante’ti.",
    "an3.36:12": "Tamenaṁ, bhikkhave, yamo rājā evamāha:  ‘ambho purisa, pamādatāya na kalyāṇamakāsi kāyena vācāya manasā. Taggha tvaṁ, ambho purisa, tathā karissanti yathā taṁ pamattaṁ. Taṁ kho pana te etaṁ pāpakammaṁ neva mātarā kataṁ, na pitarā kataṁ, na bhātarā kataṁ, na bhaginiyā kataṁ, na mittāmaccehi kataṁ, na ñātisālohitehi kataṁ, na devatāhi kataṁ, na samaṇabrāhmaṇehi kataṁ; atha kho tayāvetaṁ pāpakammaṁ kataṁ. Tvaññevetassa vipākaṁ paṭisaṁvedissasī’\"ti.(3)",
    "an3.36:13": "Tamenaṁ, bhikkhave, yamo rājā tatiyaṁ devadūtaṁ samanuyuñjitvā samanugāhitvā samanubhāsitvā tuṇhī hoti. Tamenaṁ, bhikkhave, nirayapālā pañcavidhabandhanaṁ nāma kāraṇaṁ karonti. Tattaṁ ayokhilaṁ hatthe gamenti. Tattaṁ ayokhilaṁ dutiyasmiṁ hatthe gamenti. Tattaṁ ayokhilaṁ pāde gamenti. Tattaṁ ayokhilaṁ dutiyasmiṁ pāde gamenti. Tattaṁ ayokhilaṁ majjhe urasmiṁ gamenti. So tattha dukkhā tibbā kharā kaṭukā vedanā vediyati, na ca tāva kālaṁ karoti yāva na taṁ pāpakammaṁ byantīhoti.",
    "an3.36:14": "Tamenaṁ, bhikkhave, nirayapālā saṁvesetvā kudhārīhi tacchanti. So tattha dukkhā tibbā kharā kaṭukā vedanā vediyati, na ca tāva kālaṁ karoti yāva na taṁ pāpakammaṁ byantīhoti.",
    "an3.36:15": "Tamenaṁ, bhikkhave, nirayapālā uddhampādaṁ adhosiraṁ gahetvā vāsīhi tacchanti … pe … tamenaṁ, bhikkhave, nirayapālā rathe yojetvā ādittāya bhūmiyā sampajjalitāya sajotibhūtāya sārentipi paccāsārentipi … pe … tamenaṁ, bhikkhave, nirayapālā mahantaṁ aṅgārapabbataṁ ādittaṁ sampajjalitaṁ sajotibhūtaṁ āropentipi oropentipi … pe … tamenaṁ, bhikkhave, nirayapālā uddhampādaṁ adhosiraṁ gahetvā tattāya lohakumbhiyā pakkhipanti, ādittāya sampajjalitāya sajotibhūtāya. () So tattha pheṇuddehakaṁ paccamāno sakimpi uddhaṁ gacchati, sakimpi adho gacchati, sakimpi tiriyaṁ gacchati. So tattha dukkhā tibbā kharā kaṭukā vedanā vediyati, na ca tāva kālaṁ karoti yāva na taṁ pāpakammaṁ byantīhoti.",
    "an3.36:16": "Catukkaṇṇo catudvāro,vibhatto bhāgaso mito;Ayopākārapariyanto,ayasā paṭikujjito.",
    "an3.36:17": "Tassa ayomayā bhūmi,Jalitā tejasā yutā;Samantā yojanasataṁ,Pharitvā tiṭṭhati sabbadāti.",
    "an3.36:18": "Bhūtapubbaṁ, bhikkhave, yamassa rañño etadahosi:  ‘ye kira, bho, loke pāpakāni kammāni karonti te evarūpā vividhā kammakāraṇā karīyanti. Aho vatāhaṁ manussattaṁ labheyyaṁ, tathāgato ca loke uppajjeyya arahaṁ sammāsambuddho, tañcāhaṁ bhagavantaṁ payirupāseyyaṁ. So ca me bhagavā dhammaṁ deseyya, tassa cāhaṁ bhagavato dhammaṁ ājāneyyan’ti.",
    "an3.36:19": "Coditā devadūtehi,ye pamajjanti māṇavā;Te dīgharattaṁ socanti,hīnakāyūpagā narā.",
    "an3.36:20": "Ye ca kho devadūtehi,santo sappurisā idha;Coditā nappamajjanti,ariyadhamme kudācanaṁ.",
    "an3.36:21": "Upādāne bhayaṁ disvā,jātimaraṇasambhave;Anupādā vimuccanti,jātimaraṇasaṅkhaye.",
    "an3.36:22": "Te appamattā sukhino,diṭṭhadhammābhinibbutā;Sabbaverabhayātītā,sabbadukkhaṁ upaccagun\"ti."
}