{
    "an3.72:1": "Ekaṁ samayaṁ āyasmā ānando kosambiyaṁ viharati ghositārāme. Atha kho aññataro ājīvakasāvako gahapati yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṁ ānandaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho so ājīvakasāvako gahapati āyasmantaṁ ānandaṁ etadavoca:",
    "an3.72:2": "\"Kesaṁ no, bhante ānanda, dhammo svākkhāto? Ke loke suppaṭipannā? Ke loke sukatā\"ti.",
    "an3.72:3": "\"Taṁ kiṁ maññasi, gahapati, ye rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā no vā? Kathaṁ vā te ettha hotī\"ti.",
    "an3.72:4": "\"Taṁ kiṁ maññasi, gahapati, yesaṁ rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṁ anuppādadhammo, yesaṁ doso pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṁ anuppādadhammo, yesaṁ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṁ anuppādadhammo, te loke sukatā no vā? Kathaṁ vā te ettha hotī\"ti.",
    "an3.72:5": "\"Iti kho, gahapati, tayāvetaṁ byākataṁ:  ‘ye, bhante, rāgassa pahānāya dhammaṁ desenti, dosassa pahānāya dhammaṁ desenti, mohassa pahānāya dhammaṁ desenti, tesaṁ dhammo svākkhāto’ti. Tayāvetaṁ byākataṁ:  ‘ye, bhante, rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā’ti. Tayāvetaṁ byākataṁ:  ‘yesaṁ, bhante, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṁ anuppādadhammo, yesaṁ doso pahīno … pe … yesaṁ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṁ anuppādadhammo, te loke sukatā’\"ti.",
    "an3.72:6": "\"Acchariyaṁ, bhante, abbhutaṁ, bhante. Na ceva nāma sadhammukkaṁsanā bhavissati, na ca paradhammāpasādanā. Āyataneva dhammadesanā, attho ca vutto, attā ca anupanīto.",
    "an3.72:7": "Abhikkantaṁ, bhante, abhikkantaṁ, bhante. Seyyathāpi, bhante, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya:  ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ ayyena ānandena anekapariyāyena dhammo pakāsito. Esāhaṁ, bhante ānanda, taṁ bhagavantaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṁ maṁ ayyo ānando dhāretu, ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}