{
    "an3.141:1": "\"Tayo ca, bhikkhave, assaparasse desessāmi tayo ca purisaparasse. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti. \"Evaṁ, bhante\"ti kho te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "an3.141:2": "\"Katame ca, bhikkhave, tayo assaparassā? Idha, bhikkhave, ekacco assaparasso javasampanno hoti; na vaṇṇasampanno na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assaparasso javasampanno hoti vaṇṇasampanno ca; na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo assaparassā.",
    "an3.141:3": "Katame ca, bhikkhave, tayo purisaparassā? Idha, bhikkhave, ekacco purisaparasso javasampanno hoti; na vaṇṇasampanno na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisaparasso javasampanno ca hoti vaṇṇasampanno ca; na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca.",
    "an3.141:4": "Kathañca, bhikkhave, purisaparasso javasampanno hoti; na vaṇṇasampanno, na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Idamassa javasmiṁ vadāmi. Abhidhamme kho pana abhivinaye pañhaṁ puṭṭho saṁsādeti, no vissajjeti. Idamassa na vaṇṇasmiṁ vadāmi. Na kho pana lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṁ. Idamassa na ārohapariṇāhasmiṁ vadāmi. Evaṁ kho, bhikkhave, purisaparasso javasampanno hoti; na vaṇṇasampanno, na ārohapariṇāhasampanno.",
    "an3.141:5": "Kathañca, bhikkhave, purisaparasso javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Idamassa javasmiṁ vadāmi. Abhidhamme kho pana abhivinaye pañhaṁ puṭṭho vissajjeti, no saṁsādeti. Idamassa vaṇṇasmiṁ vadāmi. Na kho pana lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṁ. Idamassa na ārohapariṇāhasmiṁ vadāmi. Evaṁ kho, bhikkhave, purisaparasso javasampanno ca hoti; vaṇṇasampanno ca, na ārohapariṇāhasampanno.",
    "an3.141:6": "Kathañca, bhikkhave, purisaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Idamassa javasmiṁ vadāmi. Abhidhamme kho pana abhivinaye pañhaṁ puṭṭho vissajjeti, no saṁsādeti. Idamassa vaṇṇasmiṁ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṁ. Idamassa ārohapariṇāhasmiṁ vadāmi. Evaṁ kho, bhikkhave, purisaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca."
}