{
    "an3.69:1": "\"Tīṇimāni, bhikkhave, akusalamūlāni. Katamāni tīṇi? Lobho akusalamūlaṁ, doso akusalamūlaṁ, moho akusalamūlaṁ.",
    "an3.69:2": "Yadapi, bhikkhave, lobho tadapi akusalamūlaṁ; yadapi luddho abhisaṅkharoti kāyena vācāya manasā tadapi akusalaṁ; yadapi luddho lobhena abhibhūto pariyādinnacitto parassa asatā dukkhaṁ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi akusalaṁ. Itissame lobhajā lobhanidānā lobhasamudayā lobhapaccayā aneke pāpakā akusalā dhammā sambhavanti.",
    "an3.69:3": "Yadapi, bhikkhave, doso tadapi akusalamūlaṁ; yadapi duṭṭho abhisaṅkharoti kāyena vācāya manasā tadapi akusalaṁ; yadapi duṭṭho dosena abhibhūto pariyādinnacitto parassa asatā dukkhaṁ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi akusalaṁ. Itissame dosajā dosanidānā dosasamudayā dosapaccayā aneke pāpakā akusalā dhammā sambhavanti.",
    "an3.69:4": "Yadapi, bhikkhave, moho tadapi akusalamūlaṁ; yadapi mūḷho abhisaṅkharoti kāyena vācāya manasā tadapi akusalaṁ; yadapi mūḷho mohena abhibhūto pariyādinnacitto parassa asatā dukkhaṁ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi akusalaṁ. Itissame mohajā mohanidānā mohasamudayā mohapaccayā aneke pāpakā akusalā dhammā sambhavanti. Evarūpo cāyaṁ, bhikkhave, puggalo vuccati akālavādītipi, abhūtavādītipi, anatthavādītipi, adhammavādītipi, avinayavādītipi.",
    "an3.69:5": "Kasmā cāyaṁ, bhikkhave, evarūpo puggalo vuccati akālavādītipi, abhūtavādītipi, anatthavādītipi, adhammavādītipi, avinayavādītipi?",
    "an3.69:6": "Evarūpo, bhikkhave, puggalo lobhajehi pāpakehi akusalehi dhammehi abhibhūto pariyādinnacitto diṭṭhe ceva dhamme dukkhaṁ viharati, savighātaṁ saupāyāsaṁ sapariḷāhaṁ. Kāyassa ca bhedā paraṁ maraṇā duggati pāṭikaṅkhā.",
    "an3.69:7": "Dosajehi … pe … mohajehi pāpakehi akusalehi dhammehi abhibhūto pariyādinnacitto diṭṭhe ceva dhamme dukkhaṁ viharati, savighātaṁ saupāyāsaṁ sapariḷāhaṁ. Kāyassa ca bhedā paraṁ maraṇā duggati pāṭikaṅkhā.",
    "an3.69:8": "Dosajehi … pe … mohajehi pāpakehi akusalehi dhammehi abhibhūto pariyādinnacitto diṭṭhe ceva dhamme dukkhaṁ viharati savighātaṁ saupāyāsaṁ sapariḷāhaṁ. Kāyassa ca bhedā paraṁ maraṇā duggati pāṭikaṅkhā. Imāni kho, bhikkhave, tīṇi akusalamūlānīti.",
    "an3.69:9": "Tīṇimāni, bhikkhave, kusalamūlāni. Katamāni tīṇi? Alobho kusalamūlaṁ, adoso kusalamūlaṁ, amoho kusalamūlaṁ.",
    "an3.69:10": "Yadapi, bhikkhave, alobho tadapi kusalamūlaṁ; yadapi aluddho abhisaṅkharoti kāyena vācāya manasā tadapi kusalaṁ; yadapi aluddho lobhena anabhibhūto apariyādinnacitto na parassa asatā dukkhaṁ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi kusalaṁ. Itissame alobhajā alobhanidānā alobhasamudayā alobhapaccayā aneke kusalā dhammā sambhavanti.",
    "an3.69:11": "Yadapi, bhikkhave, adoso tadapi kusalamūlaṁ; yadapi aduṭṭho abhisaṅkharoti kāyena vācāya manasā tadapi kusalaṁ; yadapi aduṭṭho dosena anabhibhūto apariyādinnacitto na parassa asatā dukkhaṁ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi kusalaṁ. Itissame adosajā adosanidānā adosasamudayā adosapaccayā aneke kusalā dhammā sambhavanti.",
    "an3.69:12": "Yadapi, bhikkhave, amoho tadapi kusalamūlaṁ; yadapi amūḷho abhisaṅkharoti kāyena vācāya manasā tadapi kusalaṁ; yadapi amūḷho mohena anabhibhūto apariyādinnacitto na parassa asatā dukkhaṁ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi kusalaṁ. Itissame amohajā amohanidānā amohasamudayā amohapaccayā aneke kusalā dhammā sambhavanti. Evarūpo cāyaṁ, bhikkhave, puggalo vuccati kālavādītipi, bhūtavādītipi, atthavādītipi, dhammavādītipi, vinayavādītipi.",
    "an3.69:13": "Kasmā cāyaṁ, bhikkhave, evarūpo puggalo vuccati kālavādītipi, bhūtavādītipi, atthavādītipi, dhammavādītipi, vinayavādītipi? Tathāhāyaṁ, bhikkhave, puggalo na parassa asatā dukkhaṁ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi. Bhūtena kho pana vuccamāno paṭijānāti no avajānāti; abhūtena vuccamāno ātappaṁ karoti tassa nibbeṭhanāya:  ‘itipetaṁ atacchaṁ, itipetaṁ abhūtan’ti. Tasmā evarūpo puggalo vuccati kālavādītipi, atthavādītipi, dhammavādītipi, vinayavādītipi.",
    "an3.69:14": "Evarūpassa, bhikkhave, puggalassa lobhajā pāpakā akusalā dhammā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anuppādadhammā. Diṭṭheva dhamme sukhaṁ viharati avighātaṁ anupāyāsaṁ apariḷāhaṁ. Diṭṭheva dhamme parinibbāyati.",
    "an3.69:15": "Dosajā … pe … parinibbāyati. Mohajā … pe … parinibbāyati.",
    "an3.69:16": "Dosajā … pe … mohajā pāpakā akusalā dhammā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anuppādadhammā. Diṭṭheva dhamme sukhaṁ viharati avighātaṁ anupāyāsaṁ apariḷāhaṁ. Diṭṭheva dhamme parinibbāyati. Imāni kho, bhikkhave, tīṇi kusalamūlānī\"ti."
}