{
    "an3.54:1": "Atha kho aññataro brāhmaṇaparibbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā … pe … ekamantaṁ nisinno kho so brāhmaṇaparibbājako bhagavantaṁ etadavoca:.",
    "an3.54:2": "\"Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṁ domanassaṁ paṭisaṁvedeti.",
    "an3.54:3": "Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. Rāge pahīne neva kāyena duccaritaṁ carati, na vācāya duccaritaṁ carati, na manasā duccaritaṁ carati.",
    "an3.54:4": "Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attatthampi yathābhūtaṁ nappajānāti, paratthampi yathābhūtaṁ nappajānāti, ubhayatthampi yathābhūtaṁ nappajānāti. Rāge pahīne attatthampi yathābhūtaṁ pajānāti, paratthampi yathābhūtaṁ pajānāti, ubhayatthampi yathābhūtaṁ pajānāti. Evampi kho, brāhmaṇa, sandiṭṭhiko dhammo hoti … pe ….",
    "an3.54:5": "Duṭṭho kho, brāhmaṇa, dosena … pe … mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṁ domanassaṁ paṭisaṁvedeti. Mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṁ dukkhaṁ domanassaṁ paṭisaṁvedeti.",
    "an3.54:6": "Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto, kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. Mohe pahīne neva kāyena duccaritaṁ carati, na vācāya duccaritaṁ carati, na manasā duccaritaṁ carati.",
    "an3.54:7": "Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attatthampi yathābhūtaṁ nappajānāti, paratthampi yathābhūtaṁ nappajānāti, ubhayatthampi yathābhūtaṁ nappajānāti. Mohe pahīne attatthampi yathābhūtaṁ pajānāti, paratthampi yathābhūtaṁ pajānāti, ubhayatthampi yathābhūtaṁ pajānāti. Evaṁ kho, brāhmaṇa, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhī\"ti.",
    "an3.54:8": "\"Abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}