{
    "an3.67:1": "\"Tīṇimāni, bhikkhave, kathāvatthūni. Katamāni tīṇi? Atītaṁ vā, bhikkhave, addhānaṁ ārabbha kathaṁ katheyya:  ‘evaṁ ahosi atītamaddhānan’ti.",
    "an3.67:2": "Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā kaccho yadi vā akacchoti. Sacāyaṁ, bhikkhave, puggalo pañhaṁ puṭṭho samāno ekaṁsabyākaraṇīyaṁ pañhaṁ na ekaṁsena byākaroti, vibhajjabyākaraṇīyaṁ pañhaṁ na vibhajja byākaroti, paṭipucchābyākaraṇīyaṁ pañhaṁ na paṭipucchā byākaroti, ṭhapanīyaṁ pañhaṁ na ṭhapeti, evaṁ santāyaṁ, bhikkhave, puggalo akaccho hoti.",
    "an3.67:3": "Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā kaccho yadi vā akacchoti. Sacāyaṁ, bhikkhave, puggalo pañhaṁ puṭṭho samāno ṭhānāṭhāne na saṇṭhāti parikappe na saṇṭhāti aññātavāde na saṇṭhāti paṭipadāya na saṇṭhāti, evaṁ santāyaṁ, bhikkhave, puggalo akaccho hoti.",
    "an3.67:4": "Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā kaccho yadi vā akacchoti. Sacāyaṁ, bhikkhave, puggalo pañhaṁ puṭṭho samāno aññenaññaṁ paṭicarati, bahiddhā kathaṁ apanāmeti, kopañca dosañca appaccayañca pātukaroti, evaṁ santāyaṁ, bhikkhave, puggalo akaccho hoti.",
    "an3.67:5": "Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā kaccho yadi vā akacchoti. Sacāyaṁ, bhikkhave, puggalo pañhaṁ puṭṭho samāno abhiharati abhimaddati anupajagghati khalitaṁ gaṇhāti, evaṁ santāyaṁ, bhikkhave, puggalo akaccho hoti.",
    "an3.67:6": "Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā saupaniso yadi vā anupanisoti. Anohitasoto, bhikkhave, anupaniso hoti, ohitasoto saupaniso hoti. So saupaniso samāno abhijānāti ekaṁ dhammaṁ, parijānāti ekaṁ dhammaṁ, pajahati ekaṁ dhammaṁ, sacchikaroti ekaṁ dhammaṁ. So abhijānanto ekaṁ dhammaṁ, parijānanto ekaṁ dhammaṁ, pajahanto ekaṁ dhammaṁ, sacchikaronto ekaṁ dhammaṁ sammāvimuttiṁ phusati.",
    "an3.67:7": "Ye viruddhā sallapanti,viniviṭṭhā samussitā;Anariyaguṇamāsajja,aññoññavivaresino.",
    "an3.67:8": "Dubbhāsitaṁ vikkhalitaṁ,sampamohaṁ parājayaṁ;Aññoññassābhinandanti,tadariyo kathanācare.",
    "an3.67:9": "Sace cassa kathākāmo,kālamaññāya paṇḍito;Dhammaṭṭhapaṭisaṁyuttā,yā ariyacaritā kathā.",
    "an3.67:10": "Taṁ kathaṁ kathaye dhīro,aviruddho anussito;Anunnatena manasā,apaḷāso asāhaso.",
    "an3.67:11": "Anusūyāyamāno so,sammadaññāya bhāsati;Subhāsitaṁ anumodeyya,dubbhaṭṭhe nāpasādaye.",
    "an3.67:12": "Upārambhaṁ na sikkheyya,khalitañca na gāhaye;Nābhihare nābhimadde,na vācaṁ payutaṁ bhaṇe.",
    "an3.67:13": "Aññātatthaṁ pasādatthaṁ,sataṁ ve hoti mantanā;Evaṁ kho ariyā mantenti,esā ariyāna mantanā;Etadaññāya medhāvī,na samusseyya mantaye\"ti."
}