{
    "an3.58:1": "Atha kho tikaṇṇo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ … pe … ekamantaṁ nisinno kho tikaṇṇo brāhmaṇo bhagavato sammukhā tevijjānaṁ sudaṁ brāhmaṇānaṁ vaṇṇaṁ bhāsati:  \"evampi tevijjā brāhmaṇā, itipi tevijjā brāhmaṇā\"ti.",
    "an3.58:2": "\"Yathā kathaṁ pana, brāhmaṇa, brāhmaṇā brāhmaṇaṁ tevijjaṁ paññāpentī\"ti.",
    "an3.58:3": "\"Aññathā kho, brāhmaṇa, brāhmaṇā brāhmaṇaṁ tevijjaṁ paññāpenti, aññathā ca pana ariyassa vinaye tevijjo hotī\"ti. \"Yathā kathaṁ pana, bho gotama, ariyassa vinaye tevijjo hoti? Sādhu me bhavaṁ gotamo tathā dhammaṁ desetu yathā ariyassa vinaye tevijjo hotī\"ti. \"Tena hi, brāhmaṇa, suṇāhi, sādhukaṁ manasi karohi; bhāsissāmī\"ti. \"Evaṁ, bho\"ti kho tikaṇṇo brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca:",
    "an3.58:4": "\"Idha, brāhmaṇa, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. Vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṁvedeti yaṁ taṁ ariyā ācikkhanti:  ‘upekkhako satimā sukhavihārī’ti tatiyaṁ jhānaṁ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati.",
    "an3.58:5": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhininnāmeti. So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ – ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattārīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi, anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe:  ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ. Tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati.",
    "an3.58:6": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti:  ‘ime vata bhonto sattā kāyaduccaritena samannāgatā … pe … manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā, vacīsucaritena samannāgatā, manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti.",
    "an3.58:7": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhininnāmeti. So ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti; ‘ime āsavā’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ āsavanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti.",
    "an3.58:8": "Anuccāvacasīlassa,nipakassa ca jhāyino;Cittaṁ yassa vasībhūtaṁ,ekaggaṁ susamāhitaṁ.",
    "an3.58:9": "Taṁ ve tamonudaṁ dhīraṁ,tevijjaṁ maccuhāyinaṁ;Hitaṁ devamanussānaṁ,āhu sabbappahāyinaṁ.",
    "an3.58:10": "Tīhi vijjāhi sampannaṁ,asammūḷhavihārinaṁ;Buddhaṁ antimadehinaṁ,taṁ namassanti gotamaṁ.",
    "an3.58:11": "Pubbenivāsaṁ yo vedī,saggāpāyañca passati;Atho jātikkhayaṁ patto,abhiññāvosito muni.",
    "an3.58:12": "Etāhi tīhi vijjāhi,tevijjo hoti brāhmaṇo;Tamahaṁ vadāmi tevijjaṁ,nāññaṁ lapitalāpananti.",
    "an3.58:13": "Evaṁ kho, brāhmaṇa, ariyassa vinaye tevijjo hotī\"ti.",
    "an3.58:14": "Abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}