{
    "an3.80:1": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:.",
    "an3.80:2": "Dutiyampi kho āyasmā ānando bhagavantaṁ etadavoca:  \"sammukhā metaṁ, bhante, bhagavato sutaṁ sammukhā paṭiggahitaṁ:  ‘bhagavato, ānanda, sikhissa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṁ sarena viññāpesī’ti. Bhagavā pana, bhante, arahaṁ sammāsambuddho kīvatakaṁ pahoti sarena viññāpetun\"ti.",
    "an3.80:3": "Tatiyampi kho āyasmā ānando bhagavantaṁ etadavoca:  \"sammukhā metaṁ, bhante, bhagavato sutaṁ sammukhā paṭiggahitaṁ:  ‘bhagavato, ānanda, sikhissa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṁ sarena viññāpesī’ti. Bhagavā pana, bhante, arahaṁ sammāsambuddho kīvatakaṁ pahoti sarena viññāpetun\"ti.",
    "an3.80:4": "\"Yāvatā, ānanda, candimasūriyā pariharanti, disā bhanti virocanā, tāva sahassadhā loko. Tasmiṁ sahassadhā loke sahassaṁ candānaṁ, sahassaṁ sūriyānaṁ, sahassaṁ sinerupabbatarājānaṁ, sahassaṁ jambudīpānaṁ, sahassaṁ aparagoyānānaṁ, sahassaṁ uttarakurūnaṁ, sahassaṁ pubbavidehānaṁ, cattāri mahāsamuddasahassāni, cattāri mahārājasahassāni, sahassaṁ cātumahārājikānaṁ, sahassaṁ tāvatiṁsānaṁ, sahassaṁ yāmānaṁ, sahassaṁ tusitānaṁ, sahassaṁ nimmānaratīnaṁ, sahassaṁ paranimmitavasavattīnaṁ, sahassaṁ brahmalokānaṁ – ayaṁ vuccatānanda, sahassī cūḷanikā lokadhātu.",
    "an3.80:5": "Yāvatānanda, sahassī cūḷanikā lokadhātu tāva sahassadhā loko. Ayaṁ vuccatānanda, dvisahassī majjhimikā lokadhātu.",
    "an3.80:6": "Yāvatānanda, dvisahassī majjhimikā lokadhātu tāva sahassadhā loko. Ayaṁ vuccatānanda, tisahassī mahāsahassī lokadhātu.",
    "an3.80:7": "Ākaṅkhamāno, ānanda, tathāgato tisahassimahāsahassilokadhātuṁ sarena viññāpeyya, yāvatā pana ākaṅkheyyā\"ti.",
    "an3.80:8": "\"Yathā kathaṁ pana, bhante, bhagavā tisahassimahāsahassilokadhātuṁ sarena viññāpeyya, yāvatā pana ākaṅkheyyā\"ti.",
    "an3.80:9": "Evaṁ vutte, āyasmā ānando āyasmantaṁ udāyiṁ etadavoca:  \"lābhā vata me, suladdhaṁ vata me, yassa me satthā evaṁmahiddhiko evaṁmahānubhāvo\"ti.",
    "an3.80:10": "Channo ājīvako sakko,nigaṇṭho ca nivesako;Duve bhavā sīlabbataṁ,gandhajātañca cūḷanīti."
}