{
    "an3.63:1": "Ekaṁ samayaṁ bhagavā kosalesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ yena venāgapuraṁ nāma kosalānaṁ brāhmaṇagāmo tadavasari. Assosuṁ kho venāgapurikā brāhmaṇagahapatikā:  \"Samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito venāgapuraṁ anuppatto. Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato:  ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. Sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī\"ti.",
    "an3.63:2": "Atha kho venāgapurikā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā appekacce bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu, appekacce bhagavatā saddhiṁ sammodiṁsu, sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu, appekacce yena bhagavā tenañjaliṁ paṇāmetvā ekamantaṁ nisīdiṁsu, appekacce nāmagottaṁ sāvetvā ekamantaṁ nisīdiṁsu, appekacce tuṇhībhūtā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinno kho venāgapuriko vacchagotto brāhmaṇo bhagavantaṁ etadavoca:",
    "an3.63:3": "\"Acchariyaṁ, bho gotama, abbhutaṁ, bho gotama. Yāvañcidaṁ bhoto gotamassa vippasannāni indriyāni, parisuddho chavivaṇṇo pariyodāto. Seyyathāpi, bho gotama, sāradaṁ badarapaṇḍuṁ parisuddhaṁ hoti pariyodātaṁ; evamevaṁ bhoto gotamassa vippasannāni indriyāni parisuddho chavivaṇṇo pariyodāto. Seyyathāpi, bho gotama, tālapakkaṁ sampati bandhanā pamuttaṁ parisuddhaṁ hoti pariyodātaṁ; evamevaṁ bhoto gotamassa vippasannāni indriyāni parisuddho chavivaṇṇo pariyodāto. Seyyathāpi, bho gotama, nekkhaṁ jambonadaṁ dakkhakammāraputtasuparikammakataṁ ukkāmukhe sukusalasampahaṭṭhaṁ paṇḍukambale nikkhittaṁ bhāsate ca tapate ca virocati ca; evamevaṁ bhoto gotamassa vippasannāni indriyāni parisuddho chavivaṇṇo pariyodāto. Yāni tāni, bho gotama, uccāsayanamahāsayanāni, seyyathidaṁ – āsandi pallaṅko gonako cittako paṭikā paṭalikā tūlikā vikatikā uddalomī ekantalomī kaṭṭissaṁ koseyyaṁ kuttakaṁ hatthattharaṁ assattharaṁ rathattharaṁ ajinappaveṇī kadalimigapavarapaccattharaṇaṁ sauttaracchadaṁ ubhatolohitakūpadhānaṁ, evarūpānaṁ nūna bhavaṁ gotamo uccāsayanamahāsayanānaṁ nikāmalābhī akicchalābhī akasiralābhī\"ti.",
    "an3.63:4": "\"Yāni kho pana tāni, brāhmaṇa, uccāsayanamahāsayanāni, seyyathidaṁ – āsandi pallaṅko gonako cittako paṭikā paṭalikā tūlikā vikatikā uddalomī ekantalomī kaṭṭissaṁ koseyyaṁ kuttakaṁ hatthattharaṁ assattharaṁ rathattharaṁ ajinappaveṇī kadalimigapavarapaccattharaṇaṁ sauttaracchadaṁ ubhatolohitakūpadhānaṁ. Dullabhāni tāni pabbajitānaṁ laddhā ca pana na kappanti.",
    "an3.63:5": "Tīṇi kho, imāni, brāhmaṇa, uccāsayanamahāsayanāni, yesāhaṁ etarahi nikāmalābhī akicchalābhī akasiralābhī. Katamāni tīṇi? Dibbaṁ uccāsayanamahāsayanaṁ, brahmaṁ uccāsayanamahāsayanaṁ, ariyaṁ uccāsayanamahāsayanaṁ. Imāni kho, brāhmaṇa, tīṇi uccāsayanamahāsayanāni, yesāhaṁ etarahi nikāmalābhī akicchalābhī akasiralābhī\"ti.",
    "an3.63:6": "\"Katamaṁ pana taṁ, bho gotama, dibbaṁ uccāsayanamahāsayanaṁ, yassa bhavaṁ gotamo etarahi nikāmalābhī akicchalābhī akasiralābhī\"ti.",
    "an3.63:7": "\"Acchariyaṁ, bho gotama, abbhutaṁ, bho gotama. Ko cañño evarūpassa dibbassa uccāsayanamahāsayanassa nikāmalābhī bhavissati akicchalābhī akasiralābhī, aññatra bhotā gotamena.",
    "an3.63:8": "Katamaṁ pana taṁ, bho gotama, brahmaṁ uccāsayanamahāsayanaṁ, yassa bhavaṁ gotamo etarahi nikāmalābhī akicchalābhī akasiralābhī\"ti.",
    "an3.63:9": "\"Acchariyaṁ, bho gotama, abbhutaṁ, bho gotama. Ko cañño evarūpassa brahmassa uccāsayanamahāsayanassa nikāmalābhī bhavissati akicchalābhī akasiralābhī, aññatra bhotā gotamena.",
    "an3.63:10": "Katamaṁ pana taṁ, bho gotama, ariyaṁ uccāsayanamahāsayanaṁ, yassa bhavaṁ gotamo etarahi nikāmalābhī akicchalābhī akasiralābhī\"ti.",
    "an3.63:11": "\"Acchariyaṁ, bho gotama, abbhutaṁ, bho gotama. Ko cañño evarūpassa ariyassa uccāsayanamahāsayanassa nikāmalābhī bhavissati akicchalābhī akasiralābhī, aññatra bhotā gotamena.",
    "an3.63:12": "Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya:  ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ kho bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāma dhammañca bhikkhusaṅghañca. Upāsake no bhavaṁ gotamo dhāretu ajjatagge pāṇupete saraṇaṁ gate\"ti."
}