{
    "an3.27:1": "\"Tayome, bhikkhave, puggalā santo saṁvijjamānā lokasmiṁ. Katame tayo? Atthi, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo.",
    "an3.27:2": "Katamo ca, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo? Idha, bhikkhave, ekacco puggalo kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Seyyathāpi, bhikkhave, duṭṭhāruko kaṭṭhena vā kaṭhalāya vā ghaṭṭito bhiyyoso mattāya āsavaṁ deti; evamevaṁ kho, bhikkhave … pe … seyyathāpi, bhikkhave, tindukālātaṁ kaṭṭhena vā kaṭhalāya vā ghaṭṭitaṁ bhiyyoso mattāya cicciṭāyati ciṭiciṭāyati; evamevaṁ kho, bhikkhave … pe … seyyathāpi, bhikkhave, gūthakūpo kaṭṭhena vā kaṭhalāya vā ghaṭṭito bhiyyoso mattāya duggandho hoti; evamevaṁ kho, bhikkhave, idhekacco puggalo kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Evarūpo, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Taṁ kissa hetu? Akkoseyyapi maṁ paribhāseyyapi maṁ anatthampi maṁ kareyyāti. Tasmā evarūpo puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo.",
    "an3.27:3": "Katamo ca, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo? Idha, bhikkhave, ekacco puggalo sīlavā hoti kalyāṇadhammo. Evarūpo, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Taṁ kissa hetu? Kiñcāpi, bhikkhave, evarūpassa puggalassa na diṭṭhānugatiṁ āpajjati, atha kho naṁ kalyāṇo kittisaddo abbhuggacchati:  ‘kalyāṇamitto purisapuggalo kalyāṇasahāyo kalyāṇasampavaṅko’ti. Tasmā evarūpo puggalo sevitabbo bhajitabbo payirupāsitabbo.",
    "an3.27:4": "Nihīyati puriso nihīnasevī,Na ca hāyetha kadāci tulyasevī;Seṭṭhamupanamaṁ udeti khippaṁ,Tasmā attano uttariṁ bhajethā\"ti."
}