{
    "an3.30:1": "\"Tayome, bhikkhave, puggalā santo saṁvijjamānā lokasmiṁ. Katame tayo? Avakujjapañño puggalo, ucchaṅgapañño puggalo, puthupañño puggalo.",
    "an3.30:2": "Katamo ca, bhikkhave, ucchaṅgapañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṁ gantā hoti abhikkhaṇaṁ bhikkhūnaṁ santike dhammassavanāya. Tassa bhikkhū dhammaṁ desenti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāsenti. So tasmiṁ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhito ca kho tamhā āsanā tassā kathāya neva ādiṁ manasi karoti, na majjhaṁ manasi karoti, na pariyosānaṁ manasi karoti. Seyyathāpi, bhikkhave, purisassa ucchaṅge nānākhajjakāni ākiṇṇāni – tilā taṇḍulā modakā badarā. So tamhā āsanā vuṭṭhahanto satisammosā pakireyya. Evamevaṁ kho, bhikkhave, idhekacco puggalo ārāmaṁ gantā hoti abhikkhaṇaṁ bhikkhūnaṁ santike dhammassavanāya. Tassa bhikkhū dhammaṁ desenti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāsenti. So tasmiṁ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhito ca kho tamhā āsanā tassā kathāya neva ādiṁ manasi karoti, na majjhaṁ manasi karoti, na pariyosānaṁ manasi karoti. Ayaṁ vuccati, bhikkhave, ucchaṅgapañño puggalo.",
    "an3.30:3": "Katamo ca, bhikkhave, puthupañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṁ gantā hoti abhikkhaṇaṁ bhikkhūnaṁ santike dhammassavanāya. Tassa bhikkhū dhammaṁ desenti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāsenti. So tasmiṁ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti. Seyyathāpi, bhikkhave, kumbho ukkujjo tatra udakaṁ āsittaṁ saṇṭhāti no vivaṭṭati; evamevaṁ kho, bhikkhave, idhekacco puggalo ārāmaṁ gantā hoti abhikkhaṇaṁ bhikkhūnaṁ santike dhammassavanāya. Tassa bhikkhū dhammaṁ desenti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāsenti. So tasmiṁ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti. Ayaṁ vuccati, bhikkhave, puthupañño puggalo.",
    "an3.30:4": "Avakujjapañño puriso,dummedho avicakkhaṇo;Abhikkhaṇampi ce hoti,gantā bhikkhūna santike.",
    "an3.30:5": "Ādiṁ kathāya majjhañca,pariyosānañca tādiso;Uggahetuṁ na sakkoti,paññā hissa na vijjati.",
    "an3.30:6": "Ucchaṅgapañño puriso,seyyo etena vuccati;Abhikkhaṇampi ce hoti,gantā bhikkhūna santike.",
    "an3.30:7": "Ādiṁ kathāya majjhañca,pariyosānañca tādiso;Nisinno āsane tasmiṁ,uggahetvāna byañjanaṁ;Vuṭṭhito nappajānāti,gahitaṁ hissa mussati.",
    "an3.30:8": "Puthupañño ca puriso,seyyo etehi vuccati;Abhikkhaṇampi ce hoti,gantā bhikkhūna santike.",
    "an3.30:9": "Ādiṁ kathāya majjhañca,pariyosānañca tādiso;Nisinno āsane tasmiṁ,uggahetvāna byañjanaṁ.",
    "an3.30:10": "Dhāreti seṭṭhasaṅkappo,Abyaggamānaso naro;Dhammānudhammappaṭipanno,Dukkhassantakaro siyā\"ti.",
    "an3.30:11": "Samiddha gilāna saṅkhārā,bahukārā vajirena ca;Sevi jiguccha gūthabhāṇī,andho ca avakujjatāti."
}