{
    "an4.23:1": "\"Loko, bhikkhave, tathāgatena abhisambuddho. Lokasmā tathāgato visaṁyutto. Lokasamudayo, bhikkhave, tathāgatena abhisambuddho. Lokasamudayo tathāgatassa pahīno. Lokanirodho, bhikkhave, tathāgatena abhisambuddho. Lokanirodho tathāgatassa sacchikato. Lokanirodhagāminī paṭipadā, bhikkhave, tathāgatena abhisambuddhā. Lokanirodhagāminī paṭipadā tathāgatassa bhāvitā.",
    "an4.23:2": "Yaṁ, bhikkhave, sadevakassa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya diṭṭhaṁ sutaṁ mutaṁ viññātaṁ pattaṁ pariyesitaṁ anuvicaritaṁ manasā, sabbaṁ taṁ tathāgatena abhisambuddhaṁ. Tasmā ‘tathāgato’ti vuccati.",
    "an4.23:3": "Yañca, bhikkhave, rattiṁ tathāgato anuttaraṁ sammāsambodhiṁ abhisambujjhati yañca rattiṁ anupādisesāya nibbānadhātuyā parinibbāyati, yaṁ etasmiṁ antare bhāsati lapati niddisati sabbaṁ taṁ tatheva hoti, no aññathā. Tasmā ‘tathāgato’ti vuccati.",
    "an4.23:4": "Yathāvādī, bhikkhave, tathāgato tathākārī, yathākārī tathāvādī. Iti yathāvādī tathākārī, yathākārī tathāvādī. Tasmā ‘tathāgato’ti vuccati.",
    "an4.23:5": "Sadevake, bhikkhave, loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya tathāgato abhibhū anabhibhūto aññadatthu daso vasavattī. Tasmā ‘tathāgato’ti vuccati.",
    "an4.23:6": "Sabbaṁ lokaṁ abhiññāya,sabbaṁ loke yathātathaṁ;Sabbaṁ lokaṁ visaṁyutto,sabbaloke anūpayo.",
    "an4.23:7": "Sa ve sabbābhibhū dhīro,sabbaganthappamocano;Phuṭṭha'ssa paramā santi,nibbānaṁ akutobhayaṁ.",
    "an4.23:8": "Esa khīṇāsavo buddho,anīgho chinnasaṁsayo;Sabbakammakkhayaṁ patto,vimutto upadhisaṅkhaye.",
    "an4.23:9": "Esa so bhagavā buddho,esa sīho anuttaro;Sadevakassa lokassa,brahmacakkaṁ pavattayī.",
    "an4.23:10": "Iti devā manussā ca,ye buddhaṁ saraṇaṁ gatā;Saṅgamma taṁ namassanti,mahantaṁ vītasāradaṁ.",
    "an4.23:11": "Danto damayataṁ seṭṭho,santo samayataṁ isi;Mutto mocayataṁ aggo,tiṇṇo tārayataṁ varo.",
    "an4.23:12": "Iti hetaṁ namassanti,mahantaṁ vītasāradaṁ;Sadevakasmiṁ lokasmiṁ,natthi me paṭipuggalo\"ti."
}