{
    "an4.178:1": "\"Cattārome, bhikkhave, puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro?",
    "an4.178:2": "Idha pana, bhikkhave, bhikkhu aññataraṁ santaṁ cetovimuttiṁ upasampajja viharati. So sakkāyanirodhaṁ manasi karoti. Tassa sakkāyanirodhaṁ manasi karoto sakkāyanirodhe cittaṁ pakkhandati pasīdati santiṭṭhati adhimuccati. Tassa kho evaṁ, bhikkhave, bhikkhuno sakkāyanirodho pāṭikaṅkho. Seyyathāpi, bhikkhave, puriso suddhena hatthena sākhaṁ gaṇheyya, tassa so hattho neva sajjeyya na gaṇheyya na bajjheyya; evamevaṁ kho, bhikkhave, bhikkhu aññataraṁ santaṁ cetovimuttiṁ upasampajja viharati. So sakkāyanirodhaṁ manasi karoti. Tassa sakkāyanirodhaṁ manasi karoto sakkāyanirodhe cittaṁ pakkhandati pasīdati santiṭṭhati adhimuccati. Tassa kho evaṁ, bhikkhave, bhikkhuno sakkāyanirodho pāṭikaṅkho.",
    "an4.178:3": "Idha pana, bhikkhave, bhikkhu aññataraṁ santaṁ cetovimuttiṁ upasampajja viharati. So avijjāppabhedaṁ manasi karoti. Tassa avijjāppabhedaṁ manasi karoto avijjāppabhede cittaṁ na pakkhandati nappasīdati na santiṭṭhati nādhimuccati. Tassa kho evaṁ, bhikkhave, bhikkhuno na avijjāppabhedo pāṭikaṅkho. Seyyathāpi, bhikkhave, jambālī anekavassagaṇikā. Tassā puriso yāni ceva āyamukhāni tāni pidaheyya, yāni ca apāyamukhāni tāni vivareyya, devo ca na sammā dhāraṁ anuppaveccheyya. Evañhi tassā, bhikkhave, jambāliyā na āḷippabhedo pāṭikaṅkho. Evamevaṁ kho, bhikkhave, bhikkhu aññataraṁ santaṁ cetovimuttiṁ upasampajja viharati. So avijjāppabhedaṁ manasi karoti. Tassa avijjāppabhedaṁ manasi karoto avijjāppabhede cittaṁ na pakkhandati nappasīdati na santiṭṭhati nādhimuccati. Tassa kho evaṁ, bhikkhave, bhikkhuno na avijjāppabhedo pāṭikaṅkho.",
    "an4.178:4": "Idha pana, bhikkhave, bhikkhu aññataraṁ santaṁ cetovimuttiṁ upasampajja viharati. So avijjāppabhedaṁ manasi karoti. Tassa avijjāppabhedaṁ manasi karoto avijjāppabhede cittaṁ pakkhandati pasīdati santiṭṭhati adhimuccati. Tassa kho evaṁ, bhikkhave, bhikkhuno avijjāppabhedo pāṭikaṅkho. Seyyathāpi, bhikkhave, jambālī anekavassagaṇikā. Tassā puriso yāni ceva āyamukhāni tāni vivareyya, yāni ca apāyamukhāni tāni pidaheyya, devo ca sammā dhāraṁ anuppaveccheyya. Evañhi tassā, bhikkhave, jambāliyā āḷippabhedo pāṭikaṅkho. Evamevaṁ kho, bhikkhave, bhikkhu aññataraṁ santaṁ cetovimuttiṁ upasampajja viharati. So avijjāppabhedaṁ manasi karoti. Tassa avijjāppabhedaṁ manasi karoto avijjāppabhede cittaṁ pakkhandati pasīdati santiṭṭhati adhimuccati. Tassa kho evaṁ, bhikkhave, bhikkhuno avijjāppabhedo pāṭikaṅkho."
}