{
    "an4.62:1": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho anāthapiṇḍikaṁ gahapatiṁ bhagavā etadavoca:",
    "an4.62:2": "\"Cattārimāni, gahapati, sukhāni adhigamanīyāni gihinā kāmabhoginā kālena kālaṁ samayena samayaṁ upādāya. Katamāni cattāri? Atthisukhaṁ, bhogasukhaṁ, ānaṇyasukhaṁ, anavajjasukhaṁ.",
    "an4.62:3": "Katamañca, gahapati, atthisukhaṁ? Idha, gahapati, kulaputtassa bhogā honti uṭṭhānavīriyādhigatā bāhābalaparicitā sedāvakkhittā dhammikā dhammaladdhā. So ‘bhogā me atthi uṭṭhānavīriyādhigatā bāhābalaparicitā sedāvakkhittā dhammikā dhammaladdhā’ti adhigacchati sukhaṁ, adhigacchati somanassaṁ. Idaṁ vuccati, gahapati, atthisukhaṁ.",
    "an4.62:4": "Katamañca, gahapati, bhogasukhaṁ? Idha, gahapati, kulaputto uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi paribhuñjati puññāni ca karoti. So ‘uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi paribhuñjāmi puññāni ca karomī’ti adhigacchati sukhaṁ, adhigacchati somanassaṁ. Idaṁ vuccati, gahapati, bhogasukhaṁ.",
    "an4.62:5": "Katamañca, gahapati, ānaṇyasukhaṁ? Idha, gahapati, kulaputto na kassaci kiñci dhāreti appaṁ vā bahuṁ vā. So ‘Na kassaci kiñci dhāremi appaṁ vā bahuṁ vā’ti adhigacchati sukhaṁ, adhigacchati somanassaṁ. Idaṁ vuccati, gahapati, ānaṇyasukhaṁ.",
    "an4.62:6": "Katamañca, gahapati, anavajjasukhaṁ? Idha, gahapati, ariyasāvako anavajjena kāyakammena samannāgato hoti, anavajjena vacīkammena samannāgato hoti, anavajjena manokammena samannāgato hoti. So ‘anavajjenamhi kāyakammena samannāgato, anavajjena vacīkammena samannāgato, anavajjena manokammena samannāgato’ti adhigacchati sukhaṁ, adhigacchati somanassaṁ. Idaṁ vuccati, gahapati, anavajjasukhaṁ.",
    "an4.62:7": "Ānaṇyasukhaṁ ñatvāna,Atho atthisukhaṁ paraṁ;Bhuñjaṁ bhogasukhaṁ macco,Tato paññā vipassati.",
    "an4.62:8": "Vipassamāno jānāti,ubho bhoge sumedhaso;Anavajjasukhassetaṁ,kalaṁ nāgghati soḷasin\"ti."
}