{
    "an4.187:1": "Ekaṁ samayaṁ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho vassakāro brāhmaṇo magadhamahāmatto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho vassakāro brāhmaṇo magadhamahāmatto bhagavantaṁ etadavoca:",
    "an4.187:2": "\"Jāneyya nu kho, bho gotama, asappuriso asappurisaṁ:  ‘asappuriso ayaṁ bhavan’\"ti?",
    "an4.187:3": "\"Acchariyaṁ, bho gotama, abbhutaṁ, bho gotama. Yāva subhāsitañcidaṁ bhotā gotamena:  ‘aṭṭhānaṁ kho etaṁ, brāhmaṇa, anavakāso yaṁ asappuriso asappurisaṁ jāneyya – asappuriso ayaṁ bhavanti. Etampi kho, brāhmaṇa, aṭṭhānaṁ anavakāso yaṁ asappuriso sappurisaṁ jāneyya – sappuriso ayaṁ bhavanti. Ṭhānaṁ kho etaṁ, brāhmaṇa, vijjati yaṁ sappuriso sappurisaṁ jāneyya – sappuriso ayaṁ bhavanti. Etampi kho, brāhmaṇa, ṭhānaṁ vijjati yaṁ sappuriso asappurisaṁ jāneyya – asappuriso ayaṁ bhavan’ti.",
    "an4.187:4": "Ekamidaṁ, bho gotama, samayaṁ todeyyassa brāhmaṇassa parisati parūpārambhaṁ vattenti:  ‘bālo ayaṁ rājā eḷeyyo samaṇe rāmaputte abhippasanno, samaṇe ca pana rāmaputte evarūpaṁ paramanipaccakāraṁ karoti, yadidaṁ abhivādanaṁ paccuṭṭhānaṁ añjalikammaṁ sāmīcikammanti. Imepi rañño eḷeyyassa parihārakā bālā – yamako moggallo uggo nāvindakī gandhabbo aggivesso, ye samaṇe rāmaputte abhippasannā, samaṇe ca pana rāmaputte evarūpaṁ paramanipaccakāraṁ karonti, yadidaṁ abhivādanaṁ paccuṭṭhānaṁ añjalikammaṁ sāmīcikamman’ti. Tyāssudaṁ todeyyo brāhmaṇo iminā nayena neti. ‘Taṁ kiṁ maññanti, bhonto, paṇḍito rājā eḷeyyo karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasataro’ti?",
    "an4.187:5": "Yasmā ca kho, bho, samaṇo rāmaputto raññā eḷeyyena paṇḍitena paṇḍitataro karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarena alamatthadasataro, tasmā rājā eḷeyyo samaṇe rāmaputte abhippasanno, samaṇe ca pana rāmaputte evarūpaṁ paramanipaccakāraṁ karoti, yadidaṁ abhivādanaṁ paccuṭṭhānaṁ añjalikammaṁ sāmīcikammaṁ’.",
    "an4.187:6": "‘Taṁ kiṁ maññanti, bhonto, paṇḍitā rañño eḷeyyassa parihārakā – yamako moggallo uggo nāvindakī gandhabbo aggivesso, karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasatarā’ti?",
    "an4.187:7": "Yasmā ca kho, bho, samaṇo rāmaputto rañño eḷeyyassa parihārakehi paṇḍitehi paṇḍitataro karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasataro, tasmā rañño eḷeyyassa parihārakā samaṇe rāmaputte abhippasannā; samaṇe ca pana rāmaputte evarūpaṁ paramanipaccakāraṁ karonti, yadidaṁ abhivādanaṁ paccuṭṭhānaṁ añjalikammaṁ sāmīcikamman’ti.",
    "an4.187:8": "Acchariyaṁ, bho gotama, abbhutaṁ, bho gotama. Yāva subhāsitañcidaṁ bhotā gotamena:  ‘aṭṭhānaṁ kho etaṁ, brāhmaṇa, anavakāso yaṁ asappuriso asappurisaṁ jāneyya – asappuriso ayaṁ bhavanti. Etampi kho, brāhmaṇa, aṭṭhānaṁ anavakāso yaṁ asappuriso sappurisaṁ jāneyya – sappuriso ayaṁ bhavanti. Ṭhānaṁ kho etaṁ, brāhmaṇa, vijjati yaṁ sappuriso sappurisaṁ jāneyya – sappuriso ayaṁ bhavanti. Etampi kho, brāhmaṇa, ṭhānaṁ vijjati yaṁ sappuriso asappurisaṁ jāneyya – asappuriso ayaṁ bhavan’ti. Handa ca dāni mayaṁ, bho gotama, gacchāma. Bahukiccā mayaṁ bahukaraṇīyā\"ti.",
    "an4.187:9": "Atha kho vassakāro brāhmaṇo magadhamahāmatto bhagavato bhāsitaṁ abhinanditvā anumoditvā uṭṭhāyāsanā pakkāmīti."
}