{
    "an4.131:1": "\"Cattārome, bhikkhave, puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro?",
    "an4.131:2": "Idha pana, bhikkhave, ekaccassa puggalassa orambhāgiyāni saṁyojanāni pahīnāni honti, upapattipaṭilābhiyāni saṁyojanāni appahīnāni honti, bhavapaṭilābhiyāni saṁyojanāni appahīnāni honti.",
    "an4.131:3": "Idha pana, bhikkhave, ekaccassa puggalassa orambhāgiyāni saṁyojanāni pahīnāni honti, upapattipaṭilābhiyāni saṁyojanāni pahīnāni honti, bhavapaṭilābhiyāni saṁyojanāni appahīnāni honti.",
    "an4.131:4": "Idha pana, bhikkhave, ekaccassa puggalassa orambhāgiyāni saṁyojanāni pahīnāni honti, upapattipaṭilābhiyāni saṁyojanāni pahīnāni honti, bhavapaṭilābhiyāni saṁyojanāni pahīnāni honti.",
    "an4.131:5": "Katamassa, bhikkhave, puggalassa orambhāgiyāni saṁyojanāni appahīnāni, upapattipaṭilābhiyāni saṁyojanāni appahīnāni, bhavapaṭilābhiyāni saṁyojanāni appahīnāni? Sakadāgāmissa. Imassa kho, bhikkhave, puggalassa orambhāgiyāni saṁyojanāni appahīnāni, upapattipaṭilābhiyāni saṁyojanāni appahīnāni, bhavapaṭilābhiyāni saṁyojanāni appahīnāni.",
    "an4.131:6": "Katamassa, bhikkhave, puggalassa orambhāgiyāni saṁyojanāni pahīnāni, upapattipaṭilābhiyāni saṁyojanāni appahīnāni, bhavapaṭilābhiyāni saṁyojanāni appahīnāni? Uddhaṁsotassa akaniṭṭhagāmino. Imassa kho, bhikkhave, puggalassa orambhāgiyāni saṁyojanāni pahīnāni, upapattipaṭilābhiyāni saṁyojanāni appahīnāni, bhavapaṭilābhiyāni saṁyojanāni appahīnāni.",
    "an4.131:7": "Katamassa, bhikkhave, puggalassa orambhāgiyāni saṁyojanāni pahīnāni, upapattipaṭilābhiyāni saṁyojanāni pahīnāni, bhavapaṭilābhiyāni saṁyojanāni appahīnāni? Antarāparinibbāyissa. Imassa kho, bhikkhave, puggalassa orambhāgiyāni saṁyojanāni pahīnāni, upapattipaṭilābhiyāni saṁyojanāni pahīnāni, bhavapaṭilābhiyāni saṁyojanāni appahīnāni.",
    "an4.131:8": "Katamassa, bhikkhave, puggalassa orambhāgiyāni saṁyojanāni pahīnāni, upapattipaṭilābhiyāni saṁyojanāni pahīnāni, bhavapaṭilābhiyāni saṁyojanāni pahīnāni? Arahato. Imassa kho, bhikkhave, puggalassa orambhāgiyāni saṁyojanāni pahīnāni, upapattipaṭilābhiyāni saṁyojanāni pahīnāni, bhavapaṭilābhiyāni saṁyojanāni pahīnāni."
}