{
    "an4.99:1": "\"Cattārome, bhikkhave, puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca.",
    "an4.99:2": "Kathañca, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo attanā pāṇātipātā paṭivirato hoti, no paraṁ pāṇātipātā veramaṇiyā samādapeti; attanā adinnādānā paṭivirato hoti, no paraṁ adinnādānā veramaṇiyā samādapeti; attanā kāmesumicchācārā paṭivirato hoti, no paraṁ kāmesumicchācārā veramaṇiyā samādapeti; attanā musāvādā paṭivirato hoti, no paraṁ musāvādā veramaṇiyā samādapeti; attanā surāmerayamajjapamādaṭṭhānā paṭivirato hoti, no paraṁ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṁ kho, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya.",
    "an4.99:3": "Kathañca, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya? Idha, bhikkhave, ekacco puggalo attanā pāṇātipātā appaṭivirato hoti, paraṁ pāṇātipātā veramaṇiyā samādapeti; attanā adinnādānā appaṭivirato hoti, paraṁ adinnādānā veramaṇiyā samādapeti; attanā kāmesumicchācārā appaṭivirato hoti, paraṁ kāmesumicchācārā veramaṇiyā samādapeti; attanā musāvādā appaṭivirato hoti, paraṁ musāvādā veramaṇiyā samādapeti; attanā surāmerayamajjapamādaṭṭhānā appaṭivirato hoti, paraṁ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṁ kho, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya.",
    "an4.99:4": "Kathañca, bhikkhave, puggalo nevattahitāya paṭipanno hoti no parahitāya? Idha, bhikkhave, ekacco puggalo attanā pāṇātipātā appaṭivirato hoti, no paraṁ pāṇātipātā veramaṇiyā samādapeti … pe … attanā surāmerayamajjapamādaṭṭhānā appaṭivirato hoti, no paraṁ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṁ kho, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya.",
    "an4.99:5": "Kathañca, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti … pe … attanā ca surāmerayamajjapamādaṭṭhānā paṭivirato hoti, parañca surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṁ kho, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca."
}