{
    "an4.61:1": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho anāthapiṇḍikaṁ gahapatiṁ bhagavā etadavoca:",
    "an4.61:2": "\"Cattārome, gahapati, dhammā iṭṭhā kantā manāpā dullabhā lokasmiṁ. Katame cattāro?",
    "an4.61:3": "Bhoge laddhā sahadhammena yaso me āgacchatu saha ñātīhi saha upajjhāyehīti, ayaṁ dutiyo dhammo iṭṭho kanto manāpo dullabho lokasmiṁ.",
    "an4.61:4": "Bhoge laddhā sahadhammena yasaṁ laddhā saha ñātīhi saha upajjhāyehi ciraṁ jīvāmi dīghamāyuṁ pālemīti, ayaṁ tatiyo dhammo iṭṭho kanto manāpo dullabho lokasmiṁ.",
    "an4.61:5": "Bhoge laddhā sahadhammena yasaṁ laddhā saha ñātīhi saha upajjhāyehi ciraṁ jīvitvā dīghamāyuṁ pāletvā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjāmīti, ayaṁ catuttho dhammo iṭṭho kanto manāpo dullabho lokasmiṁ.",
    "an4.61:6": "Imesaṁ kho, gahapati, catunnaṁ dhammānaṁ iṭṭhānaṁ kantānaṁ manāpānaṁ dullabhānaṁ lokasmiṁ cattāro dhammā paṭilābhāya saṁvattanti. Katame cattāro? Saddhāsampadā, sīlasampadā, cāgasampadā, paññāsampadā.",
    "an4.61:7": "Katamā ca, gahapati, saddhāsampadā? Idha, gahapati, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṁ:  ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi, satthā devamanussānaṁ buddho bhagavā’ti. Ayaṁ vuccati, gahapati, saddhāsampadā.",
    "an4.61:8": "Katamā ca, gahapati, sīlasampadā? Idha, gahapati, ariyasāvako pāṇātipātā paṭivirato hoti … pe … surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Ayaṁ vuccati, gahapati, sīlasampadā.",
    "an4.61:9": "Katamā ca, gahapati, cāgasampadā? Idha, gahapati, ariyasāvako vigatamalamaccherena cetasā agāraṁ ajjhāvasati muttacāgo payatapāṇi vosaggarato yācayogo dānasaṁvibhāgarato. Ayaṁ vuccati, gahapati, cāgasampadā.",
    "an4.61:10": "Katamā ca, gahapati, paññāsampadā? Abhijjhāvisamalobhābhibhūtena, gahapati, cetasā viharanto akiccaṁ karoti, kiccaṁ aparādheti. Akiccaṁ karonto kiccaṁ aparādhento yasā ca sukhā ca dhaṁsati. Byāpādābhibhūtena, gahapati, cetasā viharanto akiccaṁ karoti, kiccaṁ aparādheti. Akiccaṁ karonto kiccaṁ aparādhento yasā ca sukhā ca dhaṁsati. Thinamiddhābhibhūtena, gahapati, cetasā viharanto akiccaṁ karoti kiccaṁ aparādheti. Akiccaṁ karonto kiccaṁ aparādhento yasā ca sukhā ca dhaṁsati. Uddhaccakukkuccābhibhūtena, gahapati, cetasā viharanto akiccaṁ karoti, kiccaṁ aparādheti. Akiccaṁ karonto kiccaṁ aparādhento yasā ca sukhā ca dhaṁsati. Vicikicchābhibhūtena, gahapati, cetasā viharanto akiccaṁ karoti, kiccaṁ aparādheti. Akiccaṁ karonto kiccaṁ aparādhento yasā ca sukhā ca dhaṁsati.",
    "an4.61:11": "Sa kho so, gahapati, ariyasāvako abhijjhāvisamalobho cittassa upakkilesoti, iti viditvā abhijjhāvisamalobhaṁ cittassa upakkilesaṁ pajahati. Byāpādo cittassa upakkilesoti, iti viditvā byāpādaṁ cittassa upakkilesaṁ pajahati. Thinamiddhaṁ cittassa upakkilesoti, iti viditvā thinamiddhaṁ cittassa upakkilesaṁ pajahati. Uddhaccakukkuccaṁ cittassa upakkilesoti, iti viditvā uddhaccakukkuccaṁ cittassa upakkilesaṁ pajahati. Vicikicchā cittassa upakkilesoti, iti viditvā vicikicchaṁ cittassa upakkilesaṁ pajahati.",
    "an4.61:12": "Yato ca kho, gahapati, ariyasāvakassa abhijjhāvisamalobho cittassa upakkilesoti, iti viditvā abhijjhāvisamalobho cittassa upakkileso pahīno hoti. Byāpādo cittassa upakkilesoti, iti viditvā byāpādo cittassa upakkileso pahīno hoti. Thinamiddhaṁ cittassa upakkilesoti, iti viditvā thinamiddhaṁ cittassa upakkileso pahīno hoti. Uddhaccakukkuccaṁ cittassa upakkilesoti, iti viditvā uddhaccakukkuccaṁ cittassa upakkileso pahīno hoti. Vicikicchā cittassa upakkilesoti, iti viditvā vicikicchā cittassa upakkileso pahīno hoti. Ayaṁ vuccati, gahapati, ariyasāvako mahāpañño puthupañño āpātadaso paññāsampanno. Ayaṁ vuccati, gahapati, paññāsampadā.",
    "an4.61:13": "Sa kho so, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi cattāri pattakammāni kattā hoti. Katamāni cattāri?",
    "an4.61:14": "Puna caparaṁ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi yā tā honti āpadā aggito vā udakato vā rājato vā corato vā appiyato vā dāyādato, tathārūpāsu āpadāsu pariyodhāya saṁvattati. Sotthiṁ attānaṁ karoti. Idamassa dutiyaṁ ṭhānagataṁ hoti pattagataṁ āyatanaso paribhuttaṁ.",
    "an4.61:15": "Puna caparaṁ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi pañcabaliṁ kattā hoti – ñātibaliṁ, atithibaliṁ, pubbapetabaliṁ, rājabaliṁ, devatābaliṁ. Idamassa tatiyaṁ ṭhānagataṁ hoti pattagataṁ āyatanaso paribhuttaṁ.",
    "an4.61:16": "Puna caparaṁ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi ye te samaṇabrāhmaṇā madappamādā paṭiviratā khantisoracce niviṭṭhā ekamattānaṁ damenti, ekamattānaṁ samenti, ekamattānaṁ parinibbāpenti, tathārūpesu samaṇabrāhmaṇesu uddhaggikaṁ dakkhiṇaṁ patiṭṭhāpeti sovaggikaṁ sukhavipākaṁ saggasaṁvattanikaṁ. Idamassa catutthaṁ ṭhānagataṁ hoti pattagataṁ āyatanaso paribhuttaṁ.",
    "an4.61:17": "Sa kho so, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi imāni cattāri pattakammāni kattā hoti. Yassa kassaci, gahapati, aññatra imehi catūhi pattakammehi bhogā parikkhayaṁ gacchanti, ime vuccanti, gahapati, bhogā aṭṭhānagatā apattagatā anāyatanaso paribhuttā. Yassa kassaci, gahapati, imehi catūhi pattakammehi bhogā parikkhayaṁ gacchanti, ime vuccanti, gahapati, bhogā ṭhānagatā pattagatā āyatanaso paribhuttāti.",
    "an4.61:18": "Bhuttā bhogā bhatā bhaccā,Vitiṇṇā āpadāsu me;Uddhaggā dakkhiṇā dinnā,Atho pañcabalī katā;Upaṭṭhitā sīlavanto,Saññatā brahmacārayo.",
    "an4.61:19": "Yadatthaṁ bhogaṁ iccheyya,paṇḍito gharamāvasaṁ;So me attho anuppatto,kataṁ ananutāpiyaṁ.",
    "an4.61:20": "Etaṁ anussaraṁ macco,ariyadhamme ṭhito naro;Idheva naṁ pasaṁsanti,pecca sagge pamodatī\"ti."
}