{
    "an4.114:1": "\"Catūhi, bhikkhave, aṅgehi samannāgato rañño nāgo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṁ gacchati. Katamehi catūhi? Idha, bhikkhave, rañño nāgo sotā ca hoti, hantā ca, khantā ca, gantā ca.",
    "an4.114:2": "Kathañca, bhikkhave, rañño nāgo sotā hoti? Idha, bhikkhave, rañño nāgo yamenaṁ hatthidammasārathi kāraṇaṁ kāreti – yadi vā katapubbaṁ yadi vā akatapubbaṁ – taṁ aṭṭhiṁ katvā manasi katvā sabbacetasā samannāharitvā ohitasoto suṇāti. Evaṁ kho, bhikkhave, rañño nāgo sotā hoti.",
    "an4.114:3": "Kathañca, bhikkhave, rañño nāgo hantā hoti? Idha, bhikkhave, rañño nāgo saṅgāmagato hatthimpi hanati, hatthāruhampi hanati, assampi hanati, assāruhampi hanati, rathampi hanati, rathikampi hanati, pattikampi hanati. Evaṁ kho, bhikkhave, rañño nāgo hantā hoti.",
    "an4.114:4": "Kathañca, bhikkhave, rañño nāgo khantā hoti? Idha bhikkhave, rañño nāgo saṅgāmagato khamo hoti sattippahārānaṁ asippahārānaṁ usuppahārānaṁ pharasuppahārānaṁ bheripaṇavasaṅkhatiṇavaninnādasaddānaṁ. Evaṁ kho, bhikkhave, rañño nāgo khantā hoti.",
    "an4.114:5": "Kathañca, bhikkhave, rañño nāgo gantā hoti? Idha, bhikkhave, rañño nāgo yamenaṁ hatthidammasārathi disaṁ peseti – yadi vā gatapubbaṁ yadi vā agatapubbaṁ – taṁ khippameva gantā hoti. Evaṁ kho, bhikkhave, rañño nāgo gantā hoti.",
    "an4.114:6": "Evamevaṁ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti … pe … anuttaraṁ puññakkhettaṁ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu sotā ca hoti, hantā ca, khantā ca, gantā ca.",
    "an4.114:7": "Kathañca, bhikkhave, bhikkhu sotā hoti? Idha, bhikkhave, bhikkhu tathāgatappavedite dhammavinaye desiyamāne aṭṭhiṁ katvā manasi katvā sabbacetasā samannāharitvā ohitasoto dhammaṁ suṇāti. Evaṁ kho, bhikkhave, bhikkhu sotā hoti.",
    "an4.114:8": "Kathañca, bhikkhave, bhikkhu hantā hoti? Idha, bhikkhave, bhikkhu uppannaṁ kāmavitakkaṁ nādhivāseti pajahati vinodeti hanati byantīkaroti anabhāvaṁ gameti, uppannaṁ byāpādavitakkaṁ … pe … uppannaṁ vihiṁsāvitakkaṁ … pe … uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti hanati byantīkaroti anabhāvaṁ gameti. Evaṁ kho, bhikkhave, bhikkhu hantā hoti.",
    "an4.114:9": "Kathañca, bhikkhave, bhikkhu khantā hoti? Idha, bhikkhave, bhikkhu khamo hoti sītassa uṇhassa jighacchāya pipāsāya, ḍaṁsamakasavātātapasarīsapasamphassānaṁ duruttānaṁ durāgatānaṁ vacanapathānaṁ uppannānaṁ sārīrikānaṁ vedanānaṁ dukkhānaṁ tibbānaṁ kharānaṁ kaṭukānaṁ asātānaṁ amanāpānaṁ pāṇaharānaṁ adhivāsakajātiko hoti. Evaṁ kho, bhikkhave, bhikkhu khantā hoti.",
    "an4.114:10": "Kathañca, bhikkhave, bhikkhu gantā hoti? Idha, bhikkhave, bhikkhu yāyaṁ disā agatapubbā iminā dīghena addhunā yadidaṁ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṁ, taṁ khippaññeva gantā hoti. Evaṁ kho, bhikkhave, bhikkhu gantā hoti."
}