{
    "an4.30:1": "Ekaṁ samayaṁ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena sambahulā abhiññātā abhiññātā paribbājakā sippinikātīre paribbājakārāme paṭivasanti, seyyathidaṁ annabhāro varadharo sakuludāyī ca paribbājako aññe ca abhiññātā abhiññātā paribbājakā.",
    "an4.30:2": "\"Cattārimāni, paribbājakā, dhammapadāni aggaññāni rattaññāni vaṁsaññāni porāṇāni asaṅkiṇṇāni asaṅkiṇṇapubbāni, na saṅkīyanti na saṅkīyissanti, appaṭikuṭṭhāni samaṇehi brāhmaṇehi viññūhi. Katamāni cattāri?",
    "an4.30:3": "Yo kho, paribbājakā, evaṁ vadeyya:  ‘ahametaṁ anabhijjhaṁ dhammapadaṁ paccakkhāya abhijjhāluṁ kāmesu tibbasārāgaṁ samaṇaṁ vā brāhmaṇaṁ vā paññāpessāmī’ti, tamahaṁ tattha evaṁ vadeyyaṁ:  ‘etu vadatu byāharatu passāmissānubhāvan’ti. So vata, paribbājakā, anabhijjhaṁ dhammapadaṁ paccakkhāya abhijjhāluṁ kāmesu tibbasārāgaṁ samaṇaṁ vā brāhmaṇaṁ vā paññāpessatīti netaṁ ṭhānaṁ vijjati.",
    "an4.30:4": "Yo kho, paribbājakā, evaṁ vadeyya:  ‘ahametaṁ abyāpādaṁ dhammapadaṁ paccakkhāya byāpannacittaṁ paduṭṭhamanasaṅkappaṁ samaṇaṁ vā brāhmaṇaṁ vā paññāpessāmī’ti, tamahaṁ tattha evaṁ vadeyyaṁ:  ‘etu vadatu byāharatu passāmissānubhāvan’ti. So vata, paribbājakā, abyāpādaṁ dhammapadaṁ paccakkhāya byāpannacittaṁ paduṭṭhamanasaṅkappaṁ samaṇaṁ vā brāhmaṇaṁ vā paññāpessatīti netaṁ ṭhānaṁ vijjati.",
    "an4.30:5": "Yo kho, paribbājakā, evaṁ vadeyya:  ‘ahametaṁ sammāsatiṁ dhammapadaṁ paccakkhāya muṭṭhassatiṁ asampajānaṁ samaṇaṁ vā brāhmaṇaṁ vā paññāpessāmī’ti, tamahaṁ tattha evaṁ vadeyyaṁ:  ‘etu vadatu byāharatu passāmissānubhāvan’ti. So vata, paribbājakā, sammāsatiṁ dhammapadaṁ paccakkhāya muṭṭhassatiṁ asampajānaṁ samaṇaṁ vā brāhmaṇaṁ vā paññāpessatīti netaṁ ṭhānaṁ vijjati.",
    "an4.30:6": "Yo kho, paribbājakā, evaṁ vadeyya:  ‘ahametaṁ sammāsamādhiṁ dhammapadaṁ paccakkhāya asamāhitaṁ vibbhantacittaṁ samaṇaṁ vā brāhmaṇaṁ vā paññāpessāmī’ti, tamahaṁ tattha evaṁ vadeyyaṁ:  ‘etu vadatu byāharatu passāmissānubhāvan’ti. So vata, paribbājakā, sammāsamādhiṁ dhammapadaṁ paccakkhāya asamāhitaṁ vibbhantacittaṁ samaṇaṁ vā brāhmaṇaṁ vā paññāpessatīti netaṁ ṭhānaṁ vijjati.",
    "an4.30:7": "Yo kho, paribbājakā, imāni cattāri dhammapadāni garahitabbaṁ paṭikkositabbaṁ maññeyya, tassa diṭṭheva dhamme cattāro sahadhammikā vādānupātā gārayhā ṭhānā āgacchanti. Katame cattāro?",
    "an4.30:8": "Yo kho, paribbājakā, imāni cattāri dhammapadāni garahitabbaṁ paṭikkositabbaṁ maññeyya, tassa diṭṭheva dhamme ime cattāro sahadhammikā vādānupātā gārayhā ṭhānā āgacchanti. Yepi te paribbājakā ahesuṁ ukkalā vassabhaññā ahetukavādā akiriyavādā natthikavādā, tepi imāni cattāri dhammapadāni na garahitabbaṁ na paṭikkositabbaṁ amaññiṁsu. Taṁ kissa hetu? Nindābyārosanaupārambhabhayāti.",
    "an4.30:9": "Abyāpanno sadā sato,ajjhattaṁ susamāhito;Abhijjhāvinaye sikkhaṁ,appamattoti vuccatī\"ti.",
    "an4.30:10": "Dve uruvelā loko kāḷako,Brahmacariyena pañcamaṁ;Kuhaṁ santuṭṭhi vaṁso ca,Dhammapadaṁ paribbājakena cāti."
}