{
    "an4.184:1": "Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṁ etadavoca:",
    "an4.184:2": "\"Ahañhi, bho gotama, evaṁvādī evaṁdiṭṭhi:  ‘Natthi yo maraṇadhammo samāno na bhāyati, na santāsaṁ āpajjati maraṇassā’\"ti.",
    "an4.184:3": "Katamo ca, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṁ āpajjati maraṇassa?",
    "an4.184:4": "Puna caparaṁ, brāhmaṇa, idhekacco kāye avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Tamenaṁ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṁ hoti:  ‘piyo vata maṁ kāyo jahissati, piyañcāhaṁ kāyaṁ jahissāmī’ti. So socati kilamati paridevati, urattāḷiṁ kandati, sammohaṁ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṁ āpajjati maraṇassa.",
    "an4.184:5": "Puna caparaṁ, brāhmaṇa, idhekacco akatakalyāṇo hoti akatakusalo akatabhīruttāṇo katapāpo kataluddo katakibbiso. Tamenaṁ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṁ hoti:  ‘akataṁ vata me kalyāṇaṁ, akataṁ kusalaṁ, akataṁ bhīruttāṇaṁ; kataṁ pāpaṁ, kataṁ luddaṁ, kataṁ kibbisaṁ. Yāvatā, bho, akatakalyāṇānaṁ akatakusalānaṁ akatabhīruttāṇānaṁ katapāpānaṁ kataluddānaṁ katakibbisānaṁ gati taṁ gatiṁ pecca gacchāmī’ti. So socati kilamati paridevati, urattāḷiṁ kandati, sammohaṁ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṁ āpajjati maraṇassa.",
    "an4.184:6": "Puna caparaṁ, brāhmaṇa, idhekacco kaṅkhī hoti vicikicchī aniṭṭhaṅgato saddhamme. Tamenaṁ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṁ hoti:  ‘kaṅkhī vatamhi vicikicchī aniṭṭhaṅgato saddhamme’ti. So socati kilamati paridevati, urattāḷiṁ kandati, sammohaṁ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṁ āpajjati maraṇassa.",
    "an4.184:7": "Katamo ca, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṁ āpajjati maraṇassa?",
    "an4.184:8": "Puna caparaṁ, brāhmaṇa, idhekacco kāye vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho. Tamenaṁ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa na evaṁ hoti:  ‘piyo vata maṁ kāyo jahissati, piyañcāhaṁ kāyaṁ jahissāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṁ kandati, na sammohaṁ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṁ āpajjati maraṇassa.",
    "an4.184:9": "Puna caparaṁ, brāhmaṇa, idhekacco akatapāpo hoti akataluddo akatakibbiso katakalyāṇo katakusalo katabhīruttāṇo. Tamenaṁ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṁ hoti:  ‘akataṁ vata me pāpaṁ, akataṁ luddaṁ, akataṁ kibbisaṁ; kataṁ kalyāṇaṁ, kataṁ kusalaṁ, kataṁ bhīruttāṇaṁ. Yāvatā, bho, akatapāpānaṁ akataluddānaṁ akatakibbisānaṁ katakalyāṇānaṁ katakusalānaṁ katabhīruttāṇānaṁ gati taṁ gatiṁ pecca gacchāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṁ kandati, na sammohaṁ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṁ āpajjati maraṇassa.",
    "an4.184:10": "Puna caparaṁ, brāhmaṇa, idhekacco akaṅkhī hoti avicikicchī niṭṭhaṅgato saddhamme. Tamenaṁ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṁ hoti:  ‘akaṅkhī vatamhi avicikicchī niṭṭhaṅgato saddhamme’ti. So na socati na kilamati na paridevati, na urattāḷiṁ kandati, na sammohaṁ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṁ āpajjati maraṇassa.",
    "an4.184:11": "\"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}