{
    "an4.73:1": "\"Catūhi, bhikkhave, dhammehi samannāgato asappuriso veditabbo. Katamehi catūhi?",
    "an4.73:2": "Puna caparaṁ, bhikkhave, asappuriso yo hoti parassa vaṇṇo taṁ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa. Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṁ avitthārena parassa vaṇṇaṁ bhāsitā hoti. Veditabbametaṁ, bhikkhave, asappuriso ayaṁ bhavanti.",
    "an4.73:3": "Puna caparaṁ, bhikkhave, asappuriso yo hoti attano avaṇṇo taṁ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa. Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṁ avitthārena attano avaṇṇaṁ bhāsitā hoti. Veditabbametaṁ, bhikkhave, asappuriso ayaṁ bhavanti.",
    "an4.73:4": "Puna caparaṁ, bhikkhave, asappuriso yo hoti attano vaṇṇo taṁ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa. Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṁ vitthārena attano vaṇṇaṁ bhāsitā hoti. Veditabbametaṁ, bhikkhave, asappuriso ayaṁ bhavanti.",
    "an4.73:5": "Catūhi, bhikkhave, dhammehi samannāgato sappuriso veditabbo. Katamehi catūhi?",
    "an4.73:6": "Puna caparaṁ, bhikkhave, sappuriso yo hoti parassa vaṇṇo taṁ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa. Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṁ vitthārena parassa vaṇṇaṁ bhāsitā hoti. Veditabbametaṁ, bhikkhave, sappuriso ayaṁ bhavanti.",
    "an4.73:7": "Puna caparaṁ, bhikkhave, sappuriso yo hoti attano avaṇṇo taṁ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa. Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṁ vitthārena attano avaṇṇaṁ bhāsitā hoti. Veditabbametaṁ, bhikkhave, sappuriso ayaṁ bhavanti.",
    "an4.73:8": "Puna caparaṁ, bhikkhave, sappuriso yo hoti attano vaṇṇo taṁ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa. Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṁ avitthārena attano vaṇṇaṁ bhāsitā hoti. Veditabbametaṁ, bhikkhave, sappuriso ayaṁ bhavanti.",
    "an4.73:9": "Seyyathāpi, bhikkhave, vadhukā yaññadeva rattiṁ vā divaṁ vā ānītā hoti, tāvadevassā tibbaṁ hirottappaṁ paccupaṭṭhitaṁ hoti sassuyāpi sasurepi sāmikepi antamaso dāsakammakaraporisesu. Sā aparena samayena saṁvāsamanvāya vissāsamanvāya sassumpi sasurampi sāmikampi evamāha:  ‘apetha, kiṁ pana tumhe jānāthā’ti."
}