{
    "an4.244:1": "\"Cattārimāni, bhikkhave, āpattibhayāni. Katamāni cattāri?",
    "an4.244:2": "Seyyathāpi, bhikkhave, puriso kāḷavatthaṁ paridhāya kese pakiritvā musalaṁ khandhe āropetvā mahājanakāyaṁ upasaṅkamitvā evaṁ vadeyya:  ‘Ahaṁ, bhante, pāpakammaṁ akāsiṁ gārayhaṁ mosallaṁ, yena me āyasmanto attamanā honti taṁ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa:  ‘pāpakaṁ vata, bho, ayaṁ puriso kammaṁ akāsi gārayhaṁ mosallaṁ. Yatra hi nāma kāḷavatthaṁ paridhāya kese pakiritvā musalaṁ khandhe āropetvā mahājanakāyaṁ upasaṅkamitvā evaṁ vakkhati:  \"Ahaṁ, bhante, pāpakammaṁ akāsiṁ gārayhaṁ mosallaṁ, yena me āyasmanto attamanā honti taṁ karomī\"ti. So vatassāhaṁ evarūpaṁ pāpakammaṁ na kareyyaṁ gārayhaṁ mosallan’ti.",
    "an4.244:3": "Seyyathāpi, bhikkhave, puriso kāḷavatthaṁ paridhāya kese pakiritvā bhasmapuṭaṁ khandhe āropetvā mahājanakāyaṁ upasaṅkamitvā evaṁ vadeyya:  ‘Ahaṁ, bhante, pāpakammaṁ akāsiṁ gārayhaṁ bhasmapuṭaṁ. Yena me āyasmanto attamanā honti taṁ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa:  ‘pāpakaṁ vata, bho, ayaṁ puriso kammaṁ akāsi gārayhaṁ bhasmapuṭaṁ. Yatra hi nāma kāḷavatthaṁ paridhāya kese pakiritvā bhasmapuṭaṁ khandhe āropetvā mahājanakāyaṁ upasaṅkamitvā evaṁ vakkhati:  \"Ahaṁ, bhante, pāpakammaṁ akāsiṁ gārayhaṁ bhasmapuṭaṁ; yena me āyasmanto attamanā honti taṁ karomī\"ti. So vatassāhaṁ evarūpaṁ pāpakammaṁ na kareyyaṁ gārayhaṁ bhasmapuṭan’ti.",
    "an4.244:4": "Seyyathāpi, bhikkhave, puriso kāḷavatthaṁ paridhāya kese pakiritvā mahājanakāyaṁ upasaṅkamitvā evaṁ vadeyya:  ‘Ahaṁ, bhante, pāpakammaṁ akāsiṁ gārayhaṁ upavajjaṁ. Yena me āyasmanto attamanā honti taṁ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa:  ‘pāpakaṁ vata, bho, ayaṁ puriso kammaṁ akāsi gārayhaṁ upavajjaṁ. Yatra hi nāma kāḷavatthaṁ paridhāya kese pakiritvā mahājanakāyaṁ upasaṅkamitvā evaṁ vakkhati:  \"Ahaṁ, bhante, pāpakammaṁ akāsiṁ gārayhaṁ upavajjaṁ; yena me āyasmanto attamanā honti taṁ karomī\"ti. So vatassāhaṁ evarūpaṁ pāpakammaṁ na kareyyaṁ gārayhaṁ upavajjan’ti."
}