{
    "an4.169:1": "\"Cattārome, bhikkhave, puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro?",
    "an4.169:2": "Kathañca, bhikkhave, puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu aniccānupassī. Māraṇasaññā kho panassa ajjhattaṁ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṁ, hiribalaṁ, ottappabalaṁ, vīriyabalaṁ, paññābalaṁ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṁ, vīriyindriyaṁ, satindriyaṁ, samādhindriyaṁ, paññindriyaṁ. So imesaṁ pañcannaṁ indriyānaṁ adhimattattā diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti. Evaṁ kho, bhikkhave, puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti.",
    "an4.169:3": "Kathañca, bhikkhave, puggalo kāyassa bhedā sasaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu aniccānupassī. Māraṇasaññā kho panassa ajjhattaṁ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṁ, hiribalaṁ, ottappabalaṁ, vīriyabalaṁ, paññābalaṁ. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṁ, vīriyindriyaṁ, satindriyaṁ, samādhindriyaṁ, paññindriyaṁ. So imesaṁ pañcannaṁ indriyānaṁ muduttā kāyassa bhedā sasaṅkhāraparinibbāyī hoti. Evaṁ kho, bhikkhave, puggalo kāyassa bhedā sasaṅkhāraparinibbāyī hoti.",
    "an4.169:4": "Kathañca, bhikkhave, puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu vivicceva kāmehi … pe … paṭhamaṁ jhānaṁ … pe … dutiyaṁ jhānaṁ … pe … tatiyaṁ jhānaṁ … pe … catutthaṁ jhānaṁ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṁ … pe … paññābalaṁ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṁ … pe … paññindriyaṁ. So imesaṁ pañcannaṁ indriyānaṁ adhimattattā diṭṭheva dhamme asaṅkhāraparinibbāyī hoti. Evaṁ kho, bhikkhave, puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti.",
    "an4.169:5": "Kathañca, bhikkhave, puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu vivicceva kāmehi … pe … paṭhamaṁ jhānaṁ … pe … dutiyaṁ jhānaṁ … pe … tatiyaṁ jhānaṁ … pe … catutthaṁ jhānaṁ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṁ, hiribalaṁ, ottappabalaṁ, vīriyabalaṁ, paññābalaṁ. Tassimāni pañcindriyāni … pe … paññindriyaṁ. So imesaṁ pañcannaṁ indriyānaṁ muduttā kāyassa bhedā asaṅkhāraparinibbāyī hoti. Evaṁ kho, bhikkhave, puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti."
}