{
    "an4.102:1": "\"Cattārome, bhikkhave, valāhakā. Katame cattāro? Gajjitā no vassitā, vassitā no gajjitā, neva gajjitā no vassitā gajjitā ca vassitā ca. Ime kho, bhikkhave, cattāro valāhakā. Evamevaṁ kho, bhikkhave, cattāro valāhakūpamā puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro? Gajjitā no vassitā, vassitā no gajjitā, neva gajjitā no vassitā, gajjitā ca vassitā ca.",
    "an4.102:2": "Kathañca, bhikkhave, puggalo gajjitā hoti, no vassitā? Idha, bhikkhave, ekacco puggalo dhammaṁ pariyāpuṇāti – suttaṁ, geyyaṁ, veyyākaraṇaṁ, gāthaṁ, udānaṁ, itivuttakaṁ, jātakaṁ, abbhutadhammaṁ, vedallaṁ. So ‘idaṁ dukkhan’ti yathābhūtaṁ nappajānāti, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ nappajānāti, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ nappajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ nappajānāti. Evaṁ kho, bhikkhave, puggalo gajjitā hoti, no vassitā. Seyyathāpi so, bhikkhave, valāhako gajjitā, no vassitā; tathūpamāhaṁ, bhikkhave, imaṁ puggalaṁ vadāmi.",
    "an4.102:3": "Kathañca, bhikkhave, puggalo vassitā hoti, no gajjitā? Idha, bhikkhave, ekacco puggalo dhammaṁ na pariyāpuṇāti – suttaṁ, geyyaṁ, veyyākaraṇaṁ, gāthaṁ, udānaṁ, itivuttakaṁ, jātakaṁ, abbhutadhammaṁ, vedallaṁ. So ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti … pe … ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti. Evaṁ kho, bhikkhave, puggalo vassitā hoti, no gajjitā. Seyyathāpi so, bhikkhave, valāhako vassitā, no gajjitā; tathūpamāhaṁ, bhikkhave, imaṁ puggalaṁ vadāmi.",
    "an4.102:4": "Kathañca, bhikkhave, puggalo neva gajjitā hoti, no vassitā? Idha, bhikkhave, ekacco puggalo neva dhammaṁ pariyāpuṇāti – suttaṁ, geyyaṁ, veyyākaraṇaṁ, gāthaṁ, udānaṁ, itivuttakaṁ, jātakaṁ, abbhutadhammaṁ, vedallaṁ. So ‘idaṁ dukkhan’ti yathābhūtaṁ nappajānāti … pe … ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ nappajānāti. Evaṁ kho, bhikkhave, puggalo neva gajjitā hoti, no vassitā. Seyyathāpi so, bhikkhave, valāhako neva gajjitā, no vassitā; tathūpamāhaṁ, bhikkhave, imaṁ puggalaṁ vadāmi.",
    "an4.102:5": "Kathañca, bhikkhave, puggalo gajjitā ca hoti vassitā ca? Idha, bhikkhave, ekacco puggalo dhammaṁ pariyāpuṇāti – suttaṁ, geyyaṁ, veyyākaraṇaṁ, gāthaṁ, udānaṁ, itivuttakaṁ, jātakaṁ, abbhutadhammaṁ, vedallaṁ. So ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti … pe … ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti. Evaṁ kho, bhikkhave, puggalo gajjitā ca hoti vassitā ca. Seyyathāpi so, bhikkhave, valāhako gajjitā ca vassitā ca; tathūpamāhaṁ, bhikkhave, imaṁ puggalaṁ vadāmi."
}