{
    "an4.21:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi:  \"bhikkhavo\"ti.",
    "an4.21:2": "\"Ekamidāhaṁ, bhikkhave, samayaṁ uruvelāyaṁ viharāmi najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Tassa mayhaṁ, bhikkhave, rahogatassa paṭisallīnassa evaṁ cetaso parivitakko udapādi:  ‘dukkhaṁ kho agāravo viharati appatisso. Kiṁ nu kho ahaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyan’ti?",
    "an4.21:3": "Tassa mayhaṁ, bhikkhave, etadahosi:  ‘aparipūrassa kho ahaṁ sīlakkhandhassa pāripūriyā aññaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyaṁ. Na kho panāhaṁ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya aññaṁ samaṇaṁ vā brāhmaṇaṁ vā attanā sīlasampannataraṁ, yamahaṁ sakkatvā garuṁ katvā upanissāya vihareyyaṁ.",
    "an4.21:4": "Aparipūrassa kho ahaṁ samādhikkhandhassa pāripūriyā aññaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyaṁ. Na kho panāhaṁ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya aññaṁ samaṇaṁ vā brāhmaṇaṁ vā attanā samādhisampannataraṁ, yamahaṁ sakkatvā garuṁ katvā upanissāya vihareyyaṁ.",
    "an4.21:5": "Aparipūrassa kho ahaṁ paññākkhandhassa pāripūriyā aññaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyaṁ. Na kho panāhaṁ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya aññaṁ samaṇaṁ vā brāhmaṇaṁ vā attanā paññāsampannataraṁ, yamahaṁ sakkatvā garuṁ katvā upanissāya vihareyyaṁ.",
    "an4.21:6": "Aparipūrassa kho ahaṁ vimuttikkhandhassa pāripūriyā aññaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyaṁ. Na kho panāhaṁ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya aññaṁ samaṇaṁ vā brāhmaṇaṁ vā attanā vimuttisampannataraṁ, yamahaṁ sakkatvā garuṁ katvā upanissāya vihareyyan’ti.",
    "an4.21:7": "Tassa mayhaṁ, bhikkhave, etadahosi:  ‘yannūnāhaṁ yvāyaṁ dhammo mayā abhisambuddho tameva dhammaṁ sakkatvā garuṁ katvā upanissāya vihareyyan’ti.",
    "an4.21:8": "Atha kho, bhikkhave, brahmā sahampati mama cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evamevaṁ – brahmaloke antarahito mama purato pāturahosi. Atha kho, bhikkhave, brahmā sahampati ekaṁsaṁ uttarāsaṅgaṁ karitvā dakkhiṇaṁ jāṇumaṇḍalaṁ pathaviyaṁ nihantvā yenāhaṁ tenañjaliṁ paṇāmetvā maṁ etadavoca:  ‘evametaṁ, bhagavā, evametaṁ, sugata. Yepi te, bhante, ahesuṁ atītamaddhānaṁ arahanto sammāsambuddhā tepi bhagavanto dhammaṁyeva sakkatvā garuṁ katvā upanissāya vihariṁsu; yepi te, bhante, bhavissanti anāgatamaddhānaṁ arahanto sammāsambuddhā tepi bhagavanto dhammaṁyeva sakkatvā garuṁ katvā upanissāya viharissanti; bhagavāpi, bhante, etarahi arahaṁ sammāsambuddho dhammaṁyeva sakkatvā garuṁ katvā upanissāya viharatū’ti.",
    "an4.21:9": "‘Ye ca atītā sambuddhā,ye ca buddhā anāgatā;Yo cetarahi sambuddho,bahūnaṁ sokanāsano.",
    "an4.21:10": "Sabbe saddhammagaruno,vihaṁsu viharanti ca;Athopi viharissanti,esā buddhāna dhammatā.",
    "an4.21:11": "Tasmā hi attakāmena,mahattamabhikaṅkhatā;Saddhammo garukātabbo,saraṁ buddhāna sāsanan’ti.",
    "an4.21:12": "Idamavoca, bhikkhave, brahmā sahampati. Idaṁ vatvā maṁ abhivādetvā padakkhiṇaṁ katvā tatthevantaradhāyi. Atha khvāhaṁ, bhikkhave, brahmuno ca ajjhesanaṁ viditvā attano ca patirūpaṁ yvāyaṁ dhammo mayā abhisambuddho tameva dhammaṁ sakkatvā garuṁ katvā upanissāya vihāsiṁ. Yato ca kho, bhikkhave, saṅghopi mahattena samannāgato, atha me saṅghepi gāravo\"ti."
}