{
    "an4.174:1": "Atha kho āyasmā ānando yenāyasmā mahākoṭṭhiko tenupasaṅkami; upasaṅkamitvā āyasmatā mahākoṭṭhikena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando āyasmantaṁ mahākoṭṭhikaṁ etadavoca:",
    "an4.174:2": "\"Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā atthaññaṁ kiñcī\"ti?",
    "an4.174:3": "\"Mā hevaṁ, āvuso\".",
    "an4.174:4": "\"Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā natthaññaṁ kiñcī\"ti?",
    "an4.174:5": "\"Mā hevaṁ, āvuso\".",
    "an4.174:6": "\"Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā atthi ca natthi ca aññaṁ kiñcī\"ti?",
    "an4.174:7": "\"Mā hevaṁ, āvuso\".",
    "an4.174:8": "\"Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā nevatthi no natthaññaṁ kiñcī\"ti?",
    "an4.174:9": "\"Mā hevaṁ, āvuso\".",
    "an4.174:10": "\"‘Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā atthaññaṁ kiñcī’ti, iti puṭṭho samāno:  ‘mā hevaṁ, āvuso’ti vadesi. ‘Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā natthaññaṁ kiñcī’ti, iti puṭṭho samāno:  ‘mā hevaṁ, āvuso’ti vadesi. ‘Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā atthi ca natthi ca aññaṁ kiñcī’ti, iti puṭṭho samāno:  ‘mā hevaṁ, āvuso’ti vadesi. ‘Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā nevatthi no natthaññaṁ kiñcī’ti, iti puṭṭho samāno:  ‘mā hevaṁ, āvuso’ti vadesi. Yathā kathaṁ panāvuso, imassa bhāsitassa attho daṭṭhabbo\"ti?",
    "an4.174:11": "\"‘Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā atthaññaṁ kiñcī’ti, iti vadaṁ appapañcaṁ papañceti. ‘Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā natthaññaṁ kiñcī’ti, iti vadaṁ appapañcaṁ papañceti. ‘Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā atthi ca natthi ca aññaṁ kiñcī’ti, iti vadaṁ appapañcaṁ papañceti. ‘Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā nevatthi no natthaññaṁ kiñcī’ti, iti vadaṁ appapañcaṁ papañceti. Yāvatā, āvuso, channaṁ phassāyatanānaṁ gati tāvatā papañcassa gati. Yāvatā papañcassa gati tāvatā channaṁ phassāyatanānaṁ gati. Channaṁ, āvuso, phassāyatanānaṁ asesavirāganirodhā papañcanirodho papañcavūpasamo\"ti."
}