{
    "an4.97:1": "\"Cattārome, bhikkhave, puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca.",
    "an4.97:2": "Kathañca, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo khippanisantī ca hoti kusalesu dhammesu, sutānañca dhammānaṁ dhārakajātiko hoti, dhātānañca dhammānaṁ atthūpaparikkhī hoti atthamaññāya dhammamaññāya, dhammānudhammappaṭipanno hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, no ca sandassako hoti samādapako samuttejako sampahaṁsako sabrahmacārīnaṁ. Evaṁ kho, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya.",
    "an4.97:3": "Kathañca, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya? Idha, bhikkhave, ekacco puggalo na heva kho khippanisantī hoti kusalesu dhammesu, no ca sutānaṁ dhammānaṁ dhārakajātiko hoti, no ca dhātānaṁ dhammānaṁ atthūpaparikkhī hoti, no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, sandassako ca hoti samādapako samuttejako sampahaṁsako sabrahmacārīnaṁ. Evaṁ kho, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya.",
    "an4.97:4": "Kathañca, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo na heva kho khippanisantī hoti kusalesu dhammesu, no ca sutānaṁ dhammānaṁ dhārakajātiko hoti, no ca dhātānaṁ dhammānaṁ atthūpaparikkhī hoti, no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, no ca sandassako hoti samādapako samuttejako sampahaṁsako sabrahmacārīnaṁ. Evaṁ kho, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya.",
    "an4.97:5": "Kathañca, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo khippanisantī ca hoti kusalesu dhammesu, sutānañca dhammānaṁ dhārakajātiko hoti, dhātānañca dhammānaṁ atthūpaparikkhī hoti atthamaññāya dhammamaññāya, dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, sandassako ca hoti samādapako samuttejako sampahaṁsako sabrahmacārīnaṁ. Evaṁ kho, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca."
}