{
    "an4.10:1": "\"Cattārome, bhikkhave, yogā. Katame cattāro? Kāmayogo, bhavayogo, diṭṭhiyogo, avijjāyogo.",
    "an4.10:2": "Bhavayogo ca kathaṁ hoti? Idha, bhikkhave, ekacco bhavānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ nappajānāti. Tassa bhavānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ appajānato yo bhavesu bhavarāgo bhavanandī bhavasneho bhavamucchā bhavapipāsā bhavapariḷāho bhavajjhosānaṁ bhavataṇhā sānuseti. Ayaṁ vuccati, bhikkhave, bhavayogo. Iti kāmayogo bhavayogo.",
    "an4.10:3": "Diṭṭhiyogo ca kathaṁ hoti? Idha, bhikkhave, ekacco diṭṭhīnaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ nappajānāti. Tassa diṭṭhīnaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ appajānato yo diṭṭhīsu diṭṭhirāgo diṭṭhinandī diṭṭhisneho diṭṭhimucchā diṭṭhipipāsā diṭṭhipariḷāho diṭṭhijjhosānaṁ diṭṭhitaṇhā sānuseti. Ayaṁ vuccati, bhikkhave, diṭṭhiyogo. Iti kāmayogo bhavayogo diṭṭhiyogo.",
    "an4.10:4": "Avijjāyogo ca kathaṁ hoti? Idha, bhikkhave, ekacco channaṁ phassāyatanānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ nappajānāti. Tassa channaṁ phassāyatanānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ appajānato yā chasu phassāyatanesu avijjā aññāṇaṁ sānuseti. Ayaṁ vuccati, bhikkhave, avijjāyogo.",
    "an4.10:5": "Cattārome, bhikkhave, visaṁyogā. Katame cattāro? Kāmayogavisaṁyogo, bhavayogavisaṁyogo, diṭṭhiyogavisaṁyogo, avijjāyogavisaṁyogo.",
    "an4.10:6": "Bhavayogavisaṁyogo ca kathaṁ hoti? Idha, bhikkhave, ekacco bhavānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ pajānāti. Tassa bhavānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ pajānato yo bhavesu bhavarāgo bhavanandī bhavasneho bhavamucchā bhavapipāsā bhavapariḷāho bhavajjhosānaṁ bhavataṇhā sā nānuseti. Ayaṁ vuccati, bhikkhave, bhavayogavisaṁyogo. Iti kāmayogavisaṁyogo bhavayogavisaṁyogo.",
    "an4.10:7": "Diṭṭhiyogavisaṁyogo ca kathaṁ hoti? Idha, bhikkhave, ekacco diṭṭhīnaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ pajānāti. Tassa diṭṭhīnaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ pajānato yo diṭṭhīsu diṭṭhirāgo diṭṭhinandī diṭṭhisneho diṭṭhimucchā diṭṭhipipāsā diṭṭhipariḷāho diṭṭhijjhosānaṁ diṭṭhitaṇhā sā nānuseti. Ayaṁ vuccati, bhikkhave, diṭṭhiyogavisaṁyogo. Iti kāmayogavisaṁyogo bhavayogavisaṁyogo diṭṭhiyogavisaṁyogo.",
    "an4.10:8": "Avijjāyogavisaṁyogo ca kathaṁ hoti? Idha, bhikkhave, ekacco channaṁ phassāyatanānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ pajānāti. Tassa channaṁ phassāyatanānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ pajānato yā chasu phassāyatanesu avijjā aññāṇaṁ sā nānuseti.",
    "an4.10:9": "Kāmayogena saṁyuttā,bhavayogena cūbhayaṁ;Diṭṭhiyogena saṁyuttā,avijjāya purakkhatā.",
    "an4.10:10": "Sattā gacchanti saṁsāraṁ,jātimaraṇagāmino;Ye ca kāme pariññāya,bhavayogañca sabbaso.",
    "an4.10:11": "Diṭṭhiyogaṁ samūhacca,avijjañca virājayaṁ;Sabbayogavisaṁyuttā,te ve yogātigā munī\"ti.",
    "an4.10:12": "Anubuddhaṁ papatitaṁ dve,Khatā anusotapañcamaṁ;Appassuto ca sobhanaṁ,Vesārajjaṁ taṇhāyogena te dasāti."
}