{
    "an4.45:1": "Ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho rohitasso devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṁ jetavanaṁ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho rohitasso devaputto bhagavantaṁ etadavoca:",
    "an4.45:2": "\"Yattha nu kho, bhante, na jāyati na jīyati na mīyati na cavati na upapajjati, sakkā nu kho so, bhante, gamanena lokassa anto ñātuṁ vā daṭṭhuṁ vā pāpuṇituṁ vā\"ti?",
    "an4.45:3": "\"Acchariyaṁ, bhante, abbhutaṁ, bhante. Yāva subhāsitamidaṁ, bhante, bhagavatā:  ‘yattha kho, āvuso, na jāyati na jīyati na mīyati na cavati na upapajjati, nāhaṁ taṁ gamanena lokassa antaṁ ñāteyyaṁ daṭṭheyyaṁ patteyyanti vadāmī’\"ti.",
    "an4.45:4": "\"Bhūtapubbāhaṁ, bhante, rohitasso nāma isi ahosiṁ bhojaputto iddhimā vehāsaṅgamo. Tassa mayhaṁ, bhante, evarūpo javo ahosi, seyyathāpi nāma daḷhadhammā dhanuggaho sikkhito katahattho katūpāsano lahukena asanena appakasirena tiriyaṁ tālacchāyaṁ atipāteyya. Tassa mayhaṁ, bhante, evarūpo padavītihāro ahosi, seyyathāpi nāma puratthimā samuddā pacchimo samuddo. Tassa mayhaṁ, bhante, evarūpena javena samannāgatassa evarūpena ca padavītihārena evarūpaṁ icchāgataṁ uppajji:  ‘Ahaṁ gamanena lokassa antaṁ pāpuṇissāmī’ti. So kho ahaṁ, bhante, aññatreva asitapītakhāyitasāyitā aññatra uccārapassāvakammā aññatra niddākilamathapaṭivinodanā vassasatāyuko vassasatajīvī vassasataṁ gantvā appatvāva lokassa antaṁ antarāyeva kālaṅkato.",
    "an4.45:5": "Acchariyaṁ, bhante, abbhutaṁ, bhante. Yāva subhāsitamidaṁ, bhante, bhagavatā:  ‘yattha kho, āvuso, na jāyati na jīyati na mīyati na cavati na upapajjati, nāhaṁ taṁ gamanena lokassa antaṁ ñāteyyaṁ daṭṭheyyaṁ patteyyanti vadāmī’\"ti.",
    "an4.45:6": "\"‘Yattha kho, āvuso, na jāyati na jīyati na mīyati na cavati na upapajjati, nāhaṁ taṁ gamanena lokassa antaṁ ñāteyyaṁ daṭṭheyyaṁ patteyyan’ti vadāmi. Na cāhaṁ, āvuso, appatvāva lokassa antaṁ dukkhassa antakiriyaṁ vadāmi. Api cāhaṁ, āvuso, imasmiṁyeva byāmamatte kaḷevare sasaññimhi samanake lokañca paññāpemi lokasamudayañca lokanirodhañca lokanirodhagāminiñca paṭipadanti.",
    "an4.45:7": "Gamanena na pattabbo,lokassanto kudācanaṁ;Na ca appatvā lokantaṁ,dukkhā atthi pamocanaṁ.",
    "an4.45:8": "Tasmā have lokavidū sumedho,Lokantagū vusitabrahmacariyo;Lokassa antaṁ samitāvi ñatvā,Nāsīsatī lokamimaṁ parañcā\"ti."
}