{
    "an4.4:1": "\"Catūsu, bhikkhave, micchā paṭipajjamāno bālo abyatto asappuriso khataṁ upahataṁ attānaṁ pariharati sāvajjo ca hoti sānuvajjo ca viññūnaṁ, bahuñca apuññaṁ pasavati. Katamesu catūsu? Mātari, bhikkhave, micchā paṭipajjamāno bālo abyatto asappuriso khataṁ upahataṁ attānaṁ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṁ, bahuñca apuññaṁ pasavati. Pitari, bhikkhave, micchā paṭipajjamāno … pe … tathāgate, bhikkhave, micchā paṭipajjamāno … pe … tathāgatasāvake, bhikkhave, micchā paṭipajjamāno bālo abyatto asappuriso khataṁ upahataṁ attānaṁ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṁ, bahuñca apuññaṁ pasavati. Imesu kho, bhikkhave, catūsu micchā paṭipajjamāno bālo abyatto asappuriso khataṁ upahataṁ attānaṁ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṁ, bahuñca apuññaṁ pasavati.",
    "an4.4:2": "Catūsu, bhikkhave, sammā paṭipajjamāno paṇḍito viyatto sappuriso akkhataṁ anupahataṁ attānaṁ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṁ, bahuñca puññaṁ pasavati. Katamesu catūsu? Mātari, bhikkhave, sammā paṭipajjamāno paṇḍito viyatto sappuriso akkhataṁ anupahataṁ attānaṁ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṁ, bahuñca puññaṁ pasavati. Pitari, bhikkhave, sammā paṭipajjamāno … pe … tathāgate, bhikkhave, sammā paṭipajjamāno … pe … tathāgatasāvake, bhikkhave, sammā paṭipajjamāno paṇḍito viyatto sappuriso akkhataṁ anupahataṁ attānaṁ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṁ, bahuñca puññaṁ pasavati. Imesu kho, bhikkhave, catūsu sammā paṭipajjamāno paṇḍito viyatto sappuriso akkhataṁ anupahataṁ attānaṁ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṁ, bahuñca puññaṁ pasavatīti.",
    "an4.4:3": "Mātari pitari cāpi,yo micchā paṭipajjati;Tathāgate vā sambuddhe,atha vā tassa sāvake;Bahuñca so pasavati,apuññaṁ tādiso naro.",
    "an4.4:4": "Tāya naṁ adhammacariyāya,Mātāpitūsu paṇḍitā;Idheva naṁ garahanti,Peccāpāyañca gacchati.",
    "an4.4:5": "Mātari pitari cāpi,yo sammā paṭipajjati;Tathāgate vā sambuddhe,atha vā tassa sāvake;Bahuñca so pasavati,puññaṁ etādiso naro.",
    "an4.4:6": "Tāya naṁ dhammacariyāya,mātāpitūsu paṇḍitā;Idheva naṁ pasaṁsanti,pecca sagge pamodatī\"ti."
}