{
    "an4.85:1": "\"Cattārome, bhikkhave, puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro? Tamo tamaparāyaṇo, tamo jotiparāyaṇo, joti tamaparāyaṇo, joti jotiparāyaṇo.",
    "an4.85:2": "Kathañca, bhikkhave, puggalo tamo hoti tamaparāyaṇo? Idha, bhikkhave, ekacco puggalo nīce kule paccājāto hoti – caṇḍālakule vā venakule vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā, vācāya duccaritaṁ caritvā, manasā duccaritaṁ caritvā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Evaṁ kho, bhikkhave, puggalo tamo hoti tamaparāyaṇo.",
    "an4.85:3": "Kathañca, bhikkhave, puggalo tamo hoti jotiparāyaṇo? Idha, bhikkhave, ekacco puggalo nīce kule paccājāto hoti – caṇḍālakule vā venakule vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati; so ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho kāṇo vā kuṇī vā khañjo vā pakkhahato vā na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena sucaritaṁ carati, vācāya sucaritaṁ carati, manasā sucaritaṁ carati. So kāyena sucaritaṁ caritvā, vācāya sucaritaṁ caritvā, manasā sucaritaṁ caritvā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati. Evaṁ kho, bhikkhave, puggalo tamo hoti jotiparāyaṇo.",
    "an4.85:4": "Kathañca, bhikkhave, puggalo joti hoti tamaparāyaṇo? Idha, bhikkhave, ekacco puggalo ucce kule paccājāto hoti – khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe; so ca hoti abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā, vācāya duccaritaṁ caritvā, manasā duccaritaṁ caritvā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Evaṁ kho, bhikkhave, puggalo joti hoti tamaparāyaṇo.",
    "an4.85:5": "Kathañca, bhikkhave, puggalo joti hoti jotiparāyaṇo? Idha, bhikkhave, ekacco puggalo ucce kule paccājāto hoti – khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe; so ca hoti abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena sucaritaṁ carati, vācāya sucaritaṁ carati, manasā sucaritaṁ carati. So kāyena sucaritaṁ caritvā, vācāya sucaritaṁ caritvā, manasā sucaritaṁ caritvā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati. Evaṁ kho, bhikkhave, puggalo joti hoti jotiparāyaṇo."
}