{
    "an5.200:1": "\"Pañcimā, bhikkhave, nissāraṇīyā dhātuyo. Katamā pañca?",
    "an5.200:2": "Puna caparaṁ, bhikkhave, bhikkhuno byāpādaṁ manasikaroto byāpāde cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati. Abyāpādaṁ kho panassa manasikaroto abyāpāde cittaṁ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṁ cittaṁ sugataṁ subhāvitaṁ suvuṭṭhitaṁ suvimuttaṁ suvisaṁyuttaṁ byāpādena; ye ca byāpādapaccayā uppajjanti āsavā vighātapariḷāhā, mutto so tehi, na so taṁ vedanaṁ vediyati. Idamakkhātaṁ byāpādassa nissaraṇaṁ.()",
    "an5.200:3": "Puna caparaṁ, bhikkhave, bhikkhuno vihesaṁ manasikaroto vihesāya cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati. Avihesaṁ kho panassa manasikaroto avihesāya cittaṁ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṁ cittaṁ sugataṁ subhāvitaṁ suvuṭṭhitaṁ suvimuttaṁ suvisaṁyuttaṁ vihesāya; ye ca vihesāpaccayā uppajjanti āsavā vighātapariḷāhā, mutto so tehi, na so taṁ vedanaṁ vediyati. Idamakkhātaṁ vihesāya nissaraṇaṁ.()",
    "an5.200:4": "Puna caparaṁ, bhikkhave, bhikkhuno rūpaṁ manasikaroto rūpe cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati. Arūpaṁ kho panassa manasikaroto arūpe cittaṁ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṁ cittaṁ sugataṁ subhāvitaṁ suvuṭṭhitaṁ suvimuttaṁ suvisaṁyuttaṁ rūpehi; ye ca rūpapaccayā uppajjanti āsavā vighātapariḷāhā, mutto so tehi, na so taṁ vedanaṁ vediyati. Idamakkhātaṁ rūpānaṁ nissaraṇaṁ.()",
    "an5.200:5": "Puna caparaṁ, bhikkhave, bhikkhuno sakkāyaṁ manasikaroto sakkāye cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati. Sakkāyanirodhaṁ kho panassa manasikaroto sakkāyanirodhe cittaṁ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṁ cittaṁ sugataṁ subhāvitaṁ suvuṭṭhitaṁ suvimuttaṁ suvisaṁyuttaṁ sakkāyena; ye ca sakkāyapaccayā uppajjanti āsavā vighātapariḷāhā, mutto so tehi, na so taṁ vedanaṁ vediyati. Idamakkhātaṁ sakkāyassa nissaraṇaṁ.()",
    "an5.200:6": "Tassa kāmanandīpi nānuseti, byāpādanandīpi nānuseti, vihesānandīpi nānuseti, rūpanandīpi nānuseti, sakkāyanandīpi nānuseti so kāmanandiyāpi ananusayā, byāpādanandiyāpi ananusayā, vihesānandiyāpi ananusayā, rūpanandiyāpi ananusayā, sakkāyanandiyāpi ananusayā. Ayaṁ vuccati, bhikkhave, bhikkhu niranusayo, acchecchi taṇhaṁ, vivattayi saṁyojanaṁ, sammā mānābhisamayā antamakāsi dukkhassa. Imā kho, bhikkhave, pañca nissāraṇīyā dhātuyo\"ti.",
    "an5.200:7": "Soṇo doṇo saṅgāravo,Kāraṇapālī ca piṅgiyānī;Supinā ca vassā vācā,Kulaṁ nissāraṇīyena cāti."
}