{
    "an5.44:1": "Ekaṁ samayaṁ bhagavā vesāliyaṁ viharati mahāvane kūṭāgārasālāyaṁ. Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena uggassa gahapatino vesālikassa nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho uggo gahapati vesāliko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho uggo gahapati vesāliko bhagavantaṁ etadavoca:",
    "an5.44:2": "\"Sammukhā metaṁ, bhante, bhagavato sutaṁ sammukhā paṭiggahitaṁ:  ‘manāpadāyī labhate manāpan’ti. Manāpaṁ me, bhante, sālapupphakaṁ khādanīyaṁ; taṁ me bhagavā paṭiggaṇhātu anukampaṁ upādāyā\"ti. Paṭiggahesi bhagavā anukampaṁ upādāya.",
    "an5.44:3": "\"Sammukhā metaṁ, bhante, bhagavato sutaṁ sammukhā paṭiggahitaṁ:  ‘manāpadāyī labhate manāpan’ti. Manāpaṁ me, bhante, sampannakolakaṁ sūkaramaṁsaṁ; taṁ me bhagavā paṭiggaṇhātu anukampaṁ upādāyā\"ti. Paṭiggahesi bhagavā anukampaṁ upādāya.",
    "an5.44:4": "\"Sammukhā metaṁ, bhante, bhagavato sutaṁ sammukhā paṭiggahitaṁ:  ‘manāpadāyī labhate manāpan’ti. Manāpaṁ me, bhante, nibbattatelakaṁ nāliyasākaṁ; taṁ me bhagavā paṭiggaṇhātu anukampaṁ upādāyā\"ti. Paṭiggahesi bhagavā anukampaṁ upādāya.",
    "an5.44:5": "\"Sammukhā metaṁ, bhante, bhagavato sutaṁ sammukhā paṭiggahitaṁ:  ‘manāpadāyī labhate manāpan’ti. Manāpo me, bhante, sālīnaṁ odano vicitakāḷako anekasūpo anekabyañjano; taṁ me bhagavā paṭiggaṇhātu anukampaṁ upādāyā\"ti. Paṭiggahesi bhagavā anukampaṁ upādāya.",
    "an5.44:6": "\"Sammukhā metaṁ, bhante, bhagavato sutaṁ sammukhā paṭiggahitaṁ:  ‘manāpadāyī labhate manāpan’ti. Manāpāni me, bhante, kāsikāni vatthāni; tāni me bhagavā paṭiggaṇhātu anukampaṁ upādāyā\"ti. Paṭiggahesi bhagavā anukampaṁ upādāya.",
    "an5.44:7": "\"Sammukhā metaṁ, bhante, bhagavato sutaṁ sammukhā paṭiggahitaṁ:  ‘manāpadāyī labhate manāpan’ti. Manāpo me, bhante, pallaṅko gonakatthato paṭalikatthato kadalimigapavarapaccattharaṇo sauttaracchado ubhatolohitakūpadhāno. Api ca, bhante, mayampetaṁ jānāma:  ‘netaṁ bhagavato kappatī’ti. Idaṁ me, bhante, candanaphalakaṁ agghati adhikasatasahassaṁ; taṁ me bhagavā paṭiggaṇhātu anukampaṁ upādāyā\"ti. Paṭiggahesi bhagavā anukampaṁ upādāya.",
    "an5.44:8": "\"Manāpadāyī labhate manāpaṁ,Yo ujjubhūtesu dadāti chandasā;Acchādanaṁ sayanamannapānaṁ,Nānāppakārāni ca paccayāni.",
    "an5.44:9": "Cattañca muttañca anuggahītaṁ,Khettūpame arahante viditvā;So duccajaṁ sappuriso cajitvā,Manāpadāyī labhate manāpan\"ti.",
    "an5.44:10": "Atha kho bhagavā uggaṁ gahapatiṁ vesālikaṁ iminā anumodanīyena anumoditvā uṭṭhāyāsanā pakkāmi.",
    "an5.44:11": "Atha kho uggo gahapati vesāliko aparena samayena kālamakāsi. Kālaṅkato ca uggo gahapati vesāliko aññataraṁ manomayaṁ kāyaṁ upapajji. Tena kho pana samayena bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho uggo devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṁ jetavanaṁ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitaṁ kho uggaṁ devaputtaṁ bhagavā etadavoca:  \"Kacci te, ugga, yathādhippāyo\"ti?",
    "an5.44:12": "\"Manāpadāyī labhate manāpaṁ,Aggassa dātā labhate punaggaṁ;Varassa dātā varalābhi hoti,Seṭṭhaṁ dado seṭṭhamupeti ṭhānaṁ.",
    "an5.44:13": "Yo aggadāyī varadāyī,seṭṭhadāyī ca yo naro;Dīghāyu yasavā hoti,yattha yatthūpapajjatī\"ti."
}