{
    "an5.43:1": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho anāthapiṇḍikaṁ gahapatiṁ bhagavā etadavoca:",
    "an5.43:2": "\"Pañcime, gahapati, dhammā iṭṭhā kantā manāpā dullabhā lokasmiṁ. Katame pañca? Āyu, gahapati, iṭṭho kanto manāpo dullabho lokasmiṁ; vaṇṇo iṭṭho kanto manāpo dullabho lokasmiṁ; sukhaṁ iṭṭhaṁ kantaṁ manāpaṁ dullabhaṁ lokasmiṁ; yaso iṭṭho kanto manāpo dullabho lokasmiṁ; saggā iṭṭhā kantā manāpā dullabhā lokasmiṁ. Ime kho, gahapati, pañca dhammā iṭṭhā kantā manāpā dullabhā lokasmiṁ.",
    "an5.43:3": "Imesaṁ kho, gahapati, pañcannaṁ dhammānaṁ iṭṭhānaṁ kantānaṁ manāpānaṁ dullabhānaṁ lokasmiṁ na āyācanahetu vā patthanāhetu vā paṭilābhaṁ vadāmi. Imesaṁ kho, gahapati, pañcannaṁ dhammānaṁ iṭṭhānaṁ kantānaṁ manāpānaṁ dullabhānaṁ lokasmiṁ āyācanahetu vā patthanāhetu vā paṭilābho abhavissa, ko idha kena hāyetha?",
    "an5.43:4": "Na kho, gahapati, arahati ariyasāvako āyukāmo āyuṁ āyācituṁ vā abhinandituṁ vā āyussa vāpi hetu. Āyukāmena, gahapati, ariyasāvakena āyusaṁvattanikā paṭipadā paṭipajjitabbā. Āyusaṁvattanikā hissa paṭipadā paṭipannā āyupaṭilābhāya saṁvattati. So lābhī hoti āyussa dibbassa vā mānusassa vā.",
    "an5.43:5": "Na kho, gahapati, arahati ariyasāvako vaṇṇakāmo vaṇṇaṁ āyācituṁ vā abhinandituṁ vā vaṇṇassa vāpi hetu. Vaṇṇakāmena, gahapati, ariyasāvakena vaṇṇasaṁvattanikā paṭipadā paṭipajjitabbā. Vaṇṇasaṁvattanikā hissa paṭipadā paṭipannā vaṇṇapaṭilābhāya saṁvattati. So lābhī hoti vaṇṇassa dibbassa vā mānusassa vā.",
    "an5.43:6": "Na kho, gahapati, arahati ariyasāvako sukhakāmo sukhaṁ āyācituṁ vā abhinandituṁ vā sukhassa vāpi hetu. Sukhakāmena, gahapati, ariyasāvakena sukhasaṁvattanikā paṭipadā paṭipajjitabbā. Sukhasaṁvattanikā hissa paṭipadā paṭipannā sukhapaṭilābhāya saṁvattati. So lābhī hoti sukhassa dibbassa vā mānusassa vā.",
    "an5.43:7": "Na kho, gahapati, arahati ariyasāvako yasakāmo yasaṁ āyācituṁ vā abhinandituṁ vā yasassa vāpi hetu. Yasakāmena, gahapati, ariyasāvakena yasasaṁvattanikā paṭipadā paṭipajjitabbā. Yasasaṁvattanikā hissa paṭipadā paṭipannā yasapaṭilābhāya saṁvattati. So lābhī hoti yasassa dibbassa vā mānusassa vā.",
    "an5.43:8": "Na kho, gahapati, arahati ariyasāvako saggakāmo saggaṁ āyācituṁ vā abhinandituṁ vā saggānaṁ vāpi hetu. Saggakāmena, gahapati, ariyasāvakena saggasaṁvattanikā paṭipadā paṭipajjitabbā. Saggasaṁvattanikā hissa paṭipadā paṭipannā saggapaṭilābhāya saṁvattati. So lābhī hoti saggānanti.",
    "an5.43:9": "Āyuṁ vaṇṇaṁ yasaṁ kittiṁ,Saggaṁ uccākulīnataṁ;Ratiyo patthayānena,Uḷārā aparāparā.",
    "an5.43:10": "Appamādaṁ pasaṁsanti,puññakiriyāsu paṇḍitā;Appamatto ubho atthe,adhigaṇhāti paṇḍito.",
    "an5.43:11": "Diṭṭhe dhamme ca yo attho,yo cattho samparāyiko;Atthābhisamayā dhīro,paṇḍitoti pavuccatī\"ti."
}