{
    "an5.179:1": "Atha kho anāthapiṇḍiko gahapati pañcamattehi upāsakasatehi parivuto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Atha kho bhagavā āyasmantaṁ sāriputtaṁ āmantesi:  \"yaṁ kañci, sāriputta, jāneyyātha gihiṁ odātavasanaṁ pañcasu sikkhāpadesu saṁvutakammantaṁ catunnaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhiṁ akicchalābhiṁ akasiralābhiṁ, so ākaṅkhamāno attanāva attānaṁ byākareyya:  ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’ti.",
    "an5.179:2": "Katamesu pañcasu sikkhāpadesu saṁvutakammanto hoti? Idha, sāriputta, ariyasāvako pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Imesu pañcasu sikkhāpadesu saṁvutakammanto hoti.",
    "an5.179:3": "Katamesaṁ catunnaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī?",
    "an5.179:4": "Puna caparaṁ, sāriputta, ariyasāvako dhamme aveccappasādena samannāgato hoti:  ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhī’ti. Ayamassa dutiyo ābhicetasiko diṭṭhadhammasukhavihāro adhigato hoti avisuddhassa cittassa visuddhiyā apariyodātassa cittassa pariyodapanāya.",
    "an5.179:5": "Puna caparaṁ, sāriputta, ariyasāvako saṅghe aveccappasādena samannāgato hoti:  ‘suppaṭipanno bhagavato sāvakasaṅgho ujuppaṭipanno bhagavato sāvakasaṅgho ñāyappaṭipanno bhagavato sāvakasaṅgho sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṁ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṁ puññakkhettaṁ lokassā’ti. Ayamassa tatiyo ābhicetasiko diṭṭhadhammasukhavihāro adhigato hoti avisuddhassa cittassa visuddhiyā apariyodātassa cittassa pariyodapanāya.",
    "an5.179:6": "Puna caparaṁ, sāriputta, ariyasāvako ariyakantehi sīlehi samannāgato hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṁvattanikehi. Ayamassa catuttho ābhicetasiko diṭṭhadhammasukhavihāro adhigato hoti avisuddhassa cittassa visuddhiyā apariyodātassa cittassa pariyodapanāya.",
    "an5.179:7": "Yaṁ kañci, sāriputta, jāneyyātha gihiṁ odātavasanaṁ – imesu pañcasu sikkhāpadesu saṁvutakammantaṁ, imesañca catunnaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhiṁ akicchalābhiṁ akasiralābhiṁ, so ākaṅkhamāno attanāva attānaṁ byākareyya:  ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’ti.",
    "an5.179:8": "Nirayesu bhayaṁ disvā,pāpāni parivajjaye;Ariyadhammaṁ samādāya,paṇḍito parivajjaye.",
    "an5.179:9": "Na hiṁse pāṇabhūtāni,vijjamāne parakkame;Musā ca na bhaṇe jānaṁ,adinnaṁ na parāmase.",
    "an5.179:10": "Sehi dārehi santuṭṭho,paradārañca ārame;Merayaṁ vāruṇiṁ jantu,na pive cittamohaniṁ.",
    "an5.179:11": "Anussareyya sambuddhaṁ,dhammañcānuvitakkaye;Abyāpajjaṁ hitaṁ cittaṁ,devalokāya bhāvaye.",
    "an5.179:12": "Upaṭṭhite deyyadhamme,puññatthassa jigīsato;Santesu paṭhamaṁ dinnā,vipulā hoti dakkhiṇā.",
    "an5.179:13": "Santo have pavakkhāmi,sāriputta suṇohi me;Iti kaṇhāsu setāsu,rohiṇīsu harīsu vā.",
    "an5.179:14": "Kammāsāsu sarūpāsu,gosu pārevatāsu vā;Yāsu kāsuci etāsu,danto jāyati puṅgavo.",
    "an5.179:15": "Dhorayho balasampanno,kalyāṇajavanikkamo;Tameva bhāre yuñjanti,nāssa vaṇṇaṁ parikkhare.",
    "an5.179:16": "Evamevaṁ manussesu,yasmiṁ kismiñci jātiye;Khattiye brāhmaṇe vesse,sudde caṇḍālapukkuse.",
    "an5.179:17": "Yāsu kāsuci etāsu,danto jāyati subbato;Dhammaṭṭho sīlasampanno,saccavādī hirīmano.",
    "an5.179:18": "Pahīnajātimaraṇo,brahmacariyassa kevalī;Pannabhāro visaṁyutto,katakicco anāsavo.",
    "an5.179:19": "Pāragū sabbadhammānaṁ,anupādāya nibbuto;Tasmiñca viraje khette,vipulā hoti dakkhiṇā.",
    "an5.179:20": "Bālā ca avijānantā,dummedhā assutāvino;Bahiddhā dadanti dānāni,na hi sante upāsare.",
    "an5.179:21": "Ye ca sante upāsanti,sappaññe dhīrasammate;Saddhā ca nesaṁ sugate,mūlajātā patiṭṭhitā.",
    "an5.179:22": "Devalokañca te yanti,kule vā idha jāyare;Anupubbena nibbānaṁ,adhigacchanti paṇḍitā\"ti."
}