{
    "an5.157:1": "\"Pañcannaṁ, bhikkhave, puggalānaṁ kathā dukkathā puggale puggalaṁ upanidhāya. Katamesaṁ pañcannaṁ? Assaddhassa, bhikkhave, saddhākathā dukkathā; dussīlassa sīlakathā dukkathā; appassutassa bāhusaccakathā dukkathā; maccharissa cāgakathā dukkathā; duppaññassa paññākathā dukkathā.",
    "an5.157:2": "Kasmā ca, bhikkhave, assaddhassa saddhākathā dukkathā? Assaddho, bhikkhave, saddhākathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, saddhāsampadaṁ attani na samanupassati, na ca labhati tatonidānaṁ pītipāmojjaṁ. Tasmā assaddhassa saddhākathā dukkathā.",
    "an5.157:3": "Kasmā ca, bhikkhave, dussīlassa sīlakathā dukkathā? Dussīlo, bhikkhave, sīlakathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, sīlasampadaṁ attani na samanupassati na ca labhati tatonidānaṁ pītipāmojjaṁ. Tasmā dussīlassa sīlakathā dukkathā.",
    "an5.157:4": "Kasmā ca, bhikkhave, appassutassa bāhusaccakathā dukkathā? Appassuto, bhikkhave, bāhusaccakathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, sutasampadaṁ attani na samanupassati, na ca labhati tatonidānaṁ pītipāmojjaṁ. Tasmā appassutassa bāhusaccakathā dukkathā.",
    "an5.157:5": "Kasmā ca, bhikkhave, maccharissa cāgakathā dukkathā? Maccharī, bhikkhave, cāgakathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, cāgasampadaṁ attani na samanupassati na ca labhati tatonidānaṁ pītipāmojjaṁ. Tasmā maccharissa cāgakathā dukkathā.",
    "an5.157:6": "Kasmā ca, bhikkhave, duppaññassa paññākathā dukkathā? Duppañño, bhikkhave, paññākathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, paññāsampadaṁ attani na samanupassati, na ca labhati tatonidānaṁ pītipāmojjaṁ. Tasmā duppaññassa paññākathā dukkathā.",
    "an5.157:7": "Pañcannaṁ, bhikkhave, puggalānaṁ kathā sukathā puggale puggalaṁ upanidhāya. Katamesaṁ pañcannaṁ? Saddhassa, bhikkhave, saddhākathā sukathā; sīlavato sīlakathā sukathā; bahussutassa bāhusaccakathā sukathā; cāgavato cāgakathā sukathā; paññavato paññākathā sukathā.",
    "an5.157:8": "Kasmā ca, bhikkhave, saddhassa saddhākathā sukathā? Saddho, bhikkhave, saddhākathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, saddhāsampadaṁ attani samanupassati labhati ca tatonidānaṁ pītipāmojjaṁ. Tasmā saddhassa saddhākathā sukathā.",
    "an5.157:9": "Kasmā ca, bhikkhave, sīlavato sīlakathā sukathā? Sīlavā, bhikkhave, sīlakathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, sīlasampadaṁ attani samanupassati, labhati ca tatonidānaṁ pītipāmojjaṁ. Tasmā sīlavato sīlakathā sukathā.",
    "an5.157:10": "Kasmā ca, bhikkhave, bahussutassa bāhusaccakathā sukathā? Bahussuto, bhikkhave, bāhusaccakathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, sutasampadaṁ attani samanupassati, labhati ca tatonidānaṁ pītipāmojjaṁ. Tasmā bahussutassa bāhusaccakathā sukathā.",
    "an5.157:11": "Kasmā ca, bhikkhave, cāgavato cāgakathā sukathā? Cāgavā, bhikkhave, cāgakathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, cāgasampadaṁ attani samanupassati, labhati ca tatonidānaṁ pītipāmojjaṁ. Tasmā cāgavato cāgakathā sukathā.",
    "an5.157:12": "Kasmā ca, bhikkhave, paññavato paññākathā sukathā? Paññavā, bhikkhave, paññākathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṁ kissa hetu? Tañhi so, bhikkhave, paññāsampadaṁ attani samanupassati labhati ca tatonidānaṁ pītipāmojjaṁ. Tasmā paññavato paññākathā sukathā."
}