{
    "an5.31:1": "Ekaṁ samayaṁ … pe … anāthapiṇḍikassa ārāme. Atha kho sumanā rājakumārī pañcahi rathasatehi pañcahi rājakumārisatehi parivutā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnā kho sumanā rājakumārī bhagavantaṁ etadavoca:",
    "an5.31:2": "\"Idhassu, bhante, bhagavato dve sāvakā samasaddhā samasīlā samapaññā – eko dāyako, eko adāyako. Te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjeyyuṁ. Devabhūtānaṁ pana nesaṁ, bhante, siyā viseso, siyā nānākaraṇan\"ti?",
    "an5.31:3": "\"Siyā, sumane\"ti bhagavā avoca:  \"yo so, sumane, dāyako so amuṁ adāyakaṁ devabhūto samāno pañcahi ṭhānehi adhigaṇhāti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena. Yo so, sumane, dāyako so amuṁ adāyakaṁ devabhūto samāno imehi pañcahi ṭhānehi adhigaṇhāti\".",
    "an5.31:4": "\"Sace pana te, bhante, tato cutā itthattaṁ āgacchanti, manussabhūtānaṁ pana nesaṁ, bhante, siyā viseso, siyā nānākaraṇan\"ti?",
    "an5.31:5": "\"Sace pana te, bhante, ubho agārasmā anagāriyaṁ pabbajanti, pabbajitānaṁ pana nesaṁ, bhante, siyā viseso, siyā nānākaraṇan\"ti?",
    "an5.31:6": "\"Sace pana te, bhante, ubho arahattaṁ pāpuṇanti, arahattappattānaṁ pana nesaṁ, bhante, siyā viseso, siyā nānākaraṇan\"ti?",
    "an5.31:7": "\"Acchariyaṁ, bhante, abbhutaṁ, bhante. Yāvañcidaṁ, bhante, alameva dānāni dātuṁ alaṁ puññāni kātuṁ; yatra hi nāma devabhūtassāpi upakārāni puññāni, manussabhūtassāpi upakārāni puññāni, pabbajitassāpi upakārāni puññānī\"ti.",
    "an5.31:8": "Idamavoca bhagavā. Idaṁ vatvāna sugato athāparaṁ etadavoca satthā:",
    "an5.31:9": "\"Yathāpi cando vimalo,gacchaṁ ākāsadhātuyā;Sabbe tārāgaṇe loke,ābhāya atirocati.",
    "an5.31:10": "Tatheva sīlasampanno,saddho purisapuggalo;Sabbe maccharino loke,cāgena atirocati.",
    "an5.31:11": "Yathāpi megho thanayaṁ,vijjumālī satakkaku;Thalaṁ ninnañca pūreti,abhivassaṁ vasundharaṁ.",
    "an5.31:12": "Evaṁ dassanasampanno,sammāsambuddhasāvako;Macchariṁ adhigaṇhāti,pañcaṭhānehi paṇḍito.",
    "an5.31:13": "Āyunā yasasā ceva,vaṇṇena ca sukhena ca;Sa ve bhogaparibyūḷho,pecca sagge pamodatī\"ti."
}