{
    "an5.194:1": "Ekaṁ samayaṁ bhagavā vesāliyaṁ viharati mahāvane kūṭāgārasālāyaṁ. Tena kho pana samayena kāraṇapālī brāhmaṇo licchavīnaṁ kammantaṁ kāreti. Addasā kho kāraṇapālī brāhmaṇo piṅgiyāniṁ brāhmaṇaṁ dūratova āgacchantaṁ; disvā piṅgiyāniṁ brāhmaṇaṁ etadavoca:",
    "an5.194:2": "\"Handa kuto nu bhavaṁ piṅgiyānī āgacchati divā divassā\"ti?",
    "an5.194:3": "\"Seyyathāpi, bho, puriso aggarasaparititto na aññesaṁ hīnānaṁ rasānaṁ piheti; evamevaṁ kho, bho, yato yato tassa bhoto gotamassa dhammaṁ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato na aññesaṁ puthusamaṇabrāhmaṇappavādānaṁ piheti.",
    "an5.194:4": "Seyyathāpi, bho, puriso jighacchādubbalyapareto madhupiṇḍikaṁ adhigaccheyya. So yato yato sāyetha, labhateva sādurasaṁ asecanakaṁ; evamevaṁ kho, bho, yato yato tassa bhoto gotamassa dhammaṁ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato labhateva attamanataṁ, labhati cetaso pasādaṁ.",
    "an5.194:5": "Seyyathāpi, bho, puriso candanaghaṭikaṁ adhigaccheyya – haricandanassa vā lohitacandanassa vā. So yato yato ghāyetha – yadi mūlato, yadi majjhato, yadi aggato – adhigacchateva surabhigandhaṁ asecanakaṁ; evamevaṁ kho, bho, yato yato tassa bhoto gotamassa dhammaṁ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato adhigacchati pāmojjaṁ adhigacchati somanassaṁ.",
    "an5.194:6": "Seyyathāpi, bho, puriso ābādhiko dukkhito bāḷhagilāno. Tassa kusalo bhisakko ṭhānaso ābādhaṁ nīhareyya; evamevaṁ kho, bho, yato yato tassa bhoto gotamassa dhammaṁ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato sokaparidevadukkhadomanassupāyāsā abbhatthaṁ gacchanti.",
    "an5.194:7": "Seyyathāpi, bho, pokkharaṇī acchodakā sātodakā sītodakā setakā supatitthā ramaṇīyā. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. So taṁ pokkharaṇiṁ ogāhetvā nhātvā ca pivitvā ca sabbadarathakilamathapariḷāhaṁ paṭippassambheyya. Evamevaṁ kho, bho, yato yato tassa bhoto gotamassa dhammaṁ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato sabbadarathakilamathapariḷāhā paṭippassambhantī\"ti.",
    "an5.194:8": "Evaṁ vutte, kāraṇapālī brāhmaṇo uṭṭhāyāsanā ekaṁsaṁ uttarāsaṅgaṁ karitvā dakkhiṇaṁ jāṇumaṇḍalaṁ pathaviyaṁ nihantvā yena bhagavā tenañjaliṁ paṇāmetvā tikkhattuṁ udānaṁ udānesi:",
    "an5.194:9": "\"Namo tassa bhagavato arahato sammāsambuddhassa.",
    "an5.194:10": "Namo tassa bhagavato arahato sammāsambuddhassa.",
    "an5.194:11": "Namo tassa bhagavato arahato sammāsambuddhassāti.",
    "an5.194:12": "Abhikkantaṁ, bho piṅgiyāni, abhikkantaṁ, bho piṅgiyāni. Seyyathāpi, bho piṅgiyāni, nikkujjitaṁ vā ukkujjeyya paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya andhakāre vā telapajjotaṁ dhāreyya:  ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā piṅgiyāninā anekapariyāyena dhammo pakāsito. Esāhaṁ, bho piṅgiyāni, taṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṁ maṁ bhavaṁ piṅgiyānī dhāretu, ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}