{
    "an5.33:1": "Ekaṁ samayaṁ bhagavā bhaddiye viharati jātiyā vane. Atha kho uggaho meṇḍakanattā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho uggaho meṇḍakanattā bhagavantaṁ etadavoca:",
    "an5.33:2": "\"Adhivāsetu me, bhante, bhagavā svātanāya attacatuttho bhattan\"ti.",
    "an5.33:3": "Atha kho bhagavā tassā rattiyā accayena pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena uggahassa meṇḍakanattuno nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho uggaho meṇḍakanattā bhagavantaṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi.",
    "an5.33:4": "Atha kho bhagavā tā kumāriyo etadavoca:",
    "an5.33:5": "Tasmātiha, kumāriyo, evaṁ sikkhitabbaṁ:  ‘ye te bhattu garuno bhavissanti mātāti vā pitāti vā samaṇabrāhmaṇāti vā, te sakkarissāma garuṁ karissāma mānessāma pūjessāma abbhāgate ca āsanodakena paṭipūjessāmā’ti. Evañhi vo, kumāriyo, sikkhitabbaṁ.",
    "an5.33:6": "Tasmātiha, kumāriyo, evaṁ sikkhitabbaṁ:  ‘ye te bhattu abbhantarā kammantā uṇṇāti vā kappāsāti vā, tattha dakkhā bhavissāma analasā, tatrupāyāya vīmaṁsāya samannāgatā, alaṁ kātuṁ alaṁ saṁvidhātun’ti. Evañhi vo, kumāriyo, sikkhitabbaṁ.",
    "an5.33:7": "Tasmātiha, kumāriyo, evaṁ sikkhitabbaṁ:  ‘yo so bhattu abbhantaro antojano dāsāti vā pessāti vā kammakarāti vā, tesaṁ katañca katato jānissāma akatañca akatato jānissāma, gilānakānañca balābalaṁ jānissāma, khādanīyaṁ bhojanīyañcassa paccaṁsena saṁvibhajissāmā’ti. Evañhi vo, kumāriyo, sikkhitabbaṁ.",
    "an5.33:8": "Tasmātiha, kumāriyo, evaṁ sikkhitabbaṁ:  ‘Yaṁ bhattā āharissati dhanaṁ vā dhaññaṁ vā rajataṁ vā jātarūpaṁ vā, taṁ ārakkhena guttiyā sampādessāma, tattha ca bhavissāma adhuttī athenī asoṇḍī avināsikāyo’ti. Evañhi vo, kumāriyo, sikkhitabbaṁ.",
    "an5.33:9": "Yo naṁ bharati sabbadā,niccaṁ ātāpi ussuko;Sabbakāmāhāraṁ posaṁ,bhattāraṁ nātimaññati.",
    "an5.33:10": "Na cāpi sotthi bhattāraṁ,issācārena rosaye;Bhattu ca garuno sabbe,paṭipūjeti paṇḍitā.",
    "an5.33:11": "Uṭṭhāhikā analasā,saṅgahitaparijjanā;Bhattu manāpaṁ carati,sambhataṁ anurakkhati.",
    "an5.33:12": "Yā evaṁ vattatī nārī,bhattuchandavasānugā;Manāpā nāma te devā,yattha sā upapajjatī\"ti."
}