{
    "an5.34:1": "Ekaṁ samayaṁ bhagavā vesāliyaṁ viharati mahāvane kūṭāgārasālāyaṁ. Atha kho sīho senāpati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho sīho senāpati bhagavantaṁ etadavoca:",
    "an5.34:2": "\"Sakkā, sīhā\"ti bhagavā avoca:",
    "an5.34:3": "Puna caparaṁ, sīha, dāyakaṁ dānapatiṁ santo sappurisā bhajanti. Yampi, sīha, dāyakaṁ dānapatiṁ santo sappurisā bhajanti, idampi sandiṭṭhikaṁ dānaphalaṁ.",
    "an5.34:4": "Puna caparaṁ, sīha, dāyakassa dānapatino kalyāṇo kittisaddo abbhuggacchati. Yampi, sīha, dāyakassa dānapatino kalyāṇo kittisaddo abbhuggacchati, idampi sandiṭṭhikaṁ dānaphalaṁ.",
    "an5.34:5": "Puna caparaṁ, sīha, dāyako dānapati yaṁ yadeva parisaṁ upasaṅkamati – yadi khattiyaparisaṁ yadi brāhmaṇaparisaṁ yadi gahapatiparisaṁ yadi samaṇaparisaṁ – visārado upasaṅkamati amaṅkubhūto. Yampi, sīha, dāyako dānapati yaṁ yadeva parisaṁ upasaṅkamati – yadi khattiyaparisaṁ yadi brāhmaṇaparisaṁ yadi gahapatiparisaṁ yadi samaṇaparisaṁ – visārado upasaṅkamati amaṅkubhūto, idampi sandiṭṭhikaṁ dānaphalaṁ.",
    "an5.34:6": "Puna caparaṁ, sīha, dāyako dānapati kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati. Yampi, sīha, dāyako dānapati kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati, idaṁ samparāyikaṁ dānaphalan\"ti.",
    "an5.34:7": "Evaṁ vutte, sīho senāpati bhagavantaṁ etadavoca:  \"yānimāni, bhante, bhagavatā cattāri sandiṭṭhikāni dānaphalāni akkhātāni, nāhaṁ ettha bhagavato saddhāya gacchāmi; ahaṁ petāni jānāmi. Ahaṁ, bhante, dāyako dānapati bahuno janassa piyo manāpo. Ahaṁ, bhante, dāyako dānapati; maṁ santo sappurisā bhajanti. Ahaṁ, bhante, dāyako dānapati; mayhaṁ kalyāṇo kittisaddo abbhuggato:  ‘sīho senāpati dāyako kārako saṅghupaṭṭhāko’ti. Ahaṁ, bhante, dāyako dānapati yaṁ yadeva parisaṁ upasaṅkamāmi – yadi khattiyaparisaṁ yadi brāhmaṇaparisaṁ yadi gahapatiparisaṁ yadi samaṇaparisaṁ – visārado upasaṅkamāmi amaṅkubhūto. Yānimāni, bhante, bhagavatā cattāri sandiṭṭhikāni dānaphalāni akkhātāni, nāhaṁ ettha bhagavato saddhāya gacchāmi; ahaṁ petāni jānāmi. Yañca kho maṁ, bhante, bhagavā evamāha:  ‘dāyako, sīha, dānapati kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjatī’ti, etāhaṁ na jānāmi; ettha ca panāhaṁ bhagavato saddhāya gacchāmī\"ti.",
    "an5.34:8": "Dadaṁ piyo hoti bhajanti naṁ bahū,Kittiñca pappoti yaso ca vaḍḍhati;Amaṅkubhūto parisaṁ vigāhati,Visārado hoti naro amaccharī.",
    "an5.34:9": "Tasmā hi dānāni dadanti paṇḍitā,Vineyya maccheramalaṁ sukhesino;Te dīgharattaṁ tidive patiṭṭhitā,Devānaṁ sahabyagatā ramanti te.",
    "an5.34:10": "Katāvakāsā katakusalā ito cutā,Sayaṁpabhā anuvicaranti nandanaṁ;Te tattha nandanti ramanti modare,Samappitā kāmaguṇehi pañcahi;Katvāna vākyaṁ asitassa tādino,Ramanti sagge sugatassa sāvakā\"ti."
}