{
    "an5.73:1": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho so bhikkhu bhagavantaṁ etadavoca:",
    "an5.73:2": "\"Idha, bhikkhu, bhikkhu dhammaṁ pariyāpuṇāti – suttaṁ, geyyaṁ, veyyākaraṇaṁ, gāthaṁ, udānaṁ, itivuttakaṁ, jātakaṁ, abbhutadhammaṁ, vedallaṁ. So tāya dhammapariyattiyā divasaṁ atināmeti, riñcati paṭisallānaṁ, nānuyuñjati ajjhattaṁ cetosamathaṁ. Ayaṁ vuccati, bhikkhu:  ‘bhikkhu pariyattibahulo, no dhammavihārī’.",
    "an5.73:3": "Puna caparaṁ, bhikkhu, bhikkhu yathāsutaṁ yathāpariyattaṁ dhammaṁ vitthārena paresaṁ deseti. So tāya dhammapaññattiyā divasaṁ atināmeti, riñcati paṭisallānaṁ, nānuyuñjati ajjhattaṁ cetosamathaṁ. Ayaṁ vuccati, bhikkhu:  ‘bhikkhu paññattibahulo, no dhammavihārī’.",
    "an5.73:4": "Puna caparaṁ, bhikkhu, bhikkhu yathāsutaṁ yathāpariyattaṁ dhammaṁ vitthārena sajjhāyaṁ karoti. So tena sajjhāyena divasaṁ atināmeti, riñcati paṭisallānaṁ, nānuyuñjati ajjhattaṁ cetosamathaṁ. Ayaṁ vuccati, bhikkhu:  ‘bhikkhu sajjhāyabahulo, no dhammavihārī’.",
    "an5.73:5": "Puna caparaṁ, bhikkhu, bhikkhu yathāsutaṁ yathāpariyattaṁ dhammaṁ cetasā anuvitakketi anuvicāreti manasānupekkhati. So tehi dhammavitakkehi divasaṁ atināmeti, riñcati paṭisallānaṁ, nānuyuñjati ajjhattaṁ cetosamathaṁ. Ayaṁ vuccati, bhikkhu:  ‘bhikkhu vitakkabahulo, no dhammavihārī’.",
    "an5.73:6": "Idha, bhikkhu, bhikkhu dhammaṁ pariyāpuṇāti – suttaṁ, geyyaṁ, veyyākaraṇaṁ, gāthaṁ, udānaṁ, itivuttakaṁ, jātakaṁ, abbhutadhammaṁ, vedallaṁ. So tāya dhammapariyattiyā na divasaṁ atināmeti, nāpi riñcati paṭisallānaṁ, anuyuñjati ajjhattaṁ cetosamathaṁ. Evaṁ kho, bhikkhu, bhikkhu dhammavihārī hoti.",
    "an5.73:7": "Iti kho, bhikkhu, desito mayā pariyattibahulo, desito paññattibahulo, desito sajjhāyabahulo, desito vitakkabahulo, desito dhammavihārī. Yaṁ kho, bhikkhu, satthārā karaṇīyaṁ sāvakānaṁ hitesinā anukampakena anukampaṁ upādāya, kataṁ vo taṁ mayā. Etāni, bhikkhu, rukkhamūlāni, etāni suññāgārāni. Jhāyatha, bhikkhu, mā pamādattha, mā pacchā vippaṭisārino ahuvattha. Ayaṁ vo amhākaṁ anusāsanī\"ti."
}