{
    "an5.103:1": "\"Pañcahi, bhikkhave, aṅgehi samannāgato mahācoro sandhimpi chindati, nillopampi harati, ekāgārikampi karoti, paripanthepi tiṭṭhati. Katamehi pañcahi? Idha, bhikkhave, mahācoro visamanissito ca hoti, gahananissito ca, balavanissito ca, bhogacāgī ca, ekacārī ca.",
    "an5.103:2": "Kathañca, bhikkhave, mahācoro visamanissito hoti? Idha, bhikkhave, mahācoro nadīviduggaṁ vā nissito hoti pabbatavisamaṁ vā. Evaṁ kho, bhikkhave, mahācoro visamanissito hoti.",
    "an5.103:3": "Kathañca, bhikkhave, mahācoro gahananissito hoti? Idha, bhikkhave, mahācoro tiṇagahanaṁ vā nissito hoti rukkhagahanaṁ vā rodhaṁ vā mahāvanasaṇḍaṁ vā. Evaṁ kho, bhikkhave, mahācoro gahananissito hoti.",
    "an5.103:4": "Kathañca, bhikkhave, mahācoro balavanissito hoti? Idha, bhikkhave, mahācoro rājānaṁ vā rājamahāmattānaṁ vā nissito hoti. Tassa evaṁ hoti:  ‘sace maṁ koci kiñci vakkhati, ime me rājāno vā rājamahāmattā vā pariyodhāya atthaṁ bhaṇissantī’ti. Sace naṁ koci kiñci āha, tyassa rājāno vā rājamahāmattā vā pariyodhāya atthaṁ bhaṇanti. Evaṁ kho, bhikkhave, mahācoro balavanissito hoti.",
    "an5.103:5": "Kathañca, bhikkhave, mahācoro bhogacāgī hoti? Idha, bhikkhave, mahācoro aḍḍho hoti mahaddhano mahābhogo. Tassa evaṁ hoti:  ‘sace maṁ koci kiñci vakkhati, ito bhogena paṭisantharissāmī’ti. Sace naṁ koci kiñci āha, tato bhogena paṭisantharati. Evaṁ kho, bhikkhave, mahācoro bhogacāgī hoti.",
    "an5.103:6": "Kathañca, bhikkhave, mahācoro ekacārī hoti? Idha, bhikkhave, mahācoro ekakova gahaṇāni kattā hoti. Taṁ kissa hetu? ‘Mā me guyhamantā bahiddhā sambhedaṁ agamaṁsū’ti. Evaṁ kho, bhikkhave, mahācoro ekacārī hoti.",
    "an5.103:7": "Imehi kho, bhikkhave, pañcahaṅgehi samannāgato mahācoro sandhimpi chindati nillopampi harati ekāgārikampi karoti paripanthepi tiṭṭhati.",
    "an5.103:8": "Evamevaṁ kho, bhikkhave, pañcahi dhammehi samannāgato pāpabhikkhu khataṁ upahataṁ attānaṁ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṁ, bahuñca apuññaṁ pasavati. Katamehi pañcahi? Idha, bhikkhave, pāpabhikkhu visamanissito ca hoti, gahananissito ca, balavanissito ca, bhogacāgī ca, ekacārī ca.",
    "an5.103:9": "Kathañca, bhikkhave, pāpabhikkhu visamanissito hoti? Idha, bhikkhave, pāpabhikkhu visamena kāyakammena samannāgato hoti, visamena vacīkammena samannāgato hoti, visamena manokammena samannāgato hoti. Evaṁ kho, bhikkhave, pāpabhikkhu visamanissito hoti.",
    "an5.103:10": "Kathañca, bhikkhave, pāpabhikkhu gahananissito hoti? Idha, bhikkhave, pāpabhikkhu micchādiṭṭhiko hoti antaggāhikāya diṭṭhiyā samannāgato. Evaṁ kho, bhikkhave, pāpabhikkhu gahananissito hoti.",
    "an5.103:11": "Kathañca, bhikkhave, pāpabhikkhu balavanissito hoti? Idha, bhikkhave, pāpabhikkhu rājānaṁ vā rājamahāmattānaṁ vā nissito hoti. Tassa evaṁ hoti:  ‘sace maṁ koci kiñci vakkhati, ime me rājāno vā rājamahāmattā vā pariyodhāya atthaṁ bhaṇissantī’ti. Sace naṁ koci kiñci āha, tyassa rājāno vā rājamahāmattā vā pariyodhāya atthaṁ bhaṇanti. Evaṁ kho, bhikkhave, pāpabhikkhu balavanissito hoti.",
    "an5.103:12": "Kathañca, bhikkhave, pāpabhikkhu bhogacāgī hoti? Idha, bhikkhave, pāpabhikkhu lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṁ. Tassa evaṁ hoti:  ‘sace maṁ koci kiñci vakkhati, ito lābhena paṭisantharissāmī’ti. Sace naṁ koci kiñci āha, tato lābhena paṭisantharati. Evaṁ kho, bhikkhave, pāpabhikkhu bhogacāgī hoti.",
    "an5.103:13": "Kathañca, bhikkhave, pāpabhikkhu ekacārī hoti? Idha, bhikkhave, pāpabhikkhu ekakova paccantimesu janapadesu nivāsaṁ kappeti. So tattha kulāni upasaṅkamanto lābhaṁ labhati. Evaṁ kho, bhikkhave, pāpabhikkhu ekacārī hoti.",
    "an5.103:14": "Imehi kho, bhikkhave, pañcahi dhammehi samannāgato pāpabhikkhu khataṁ upahataṁ attānaṁ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṁ, bahuñca apuññaṁ pasavatī\"ti."
}