{
    "an6.19:1": "Ekaṁ samayaṁ bhagavā nātike viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi:  \"bhikkhavo\"ti.",
    "an6.19:2": "Evaṁ vutte, aññataro bhikkhu bhagavantaṁ etadavoca:  \"ahaṁ kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an6.19:3": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an6.19:4": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an6.19:5": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an6.19:6": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an6.19:7": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an6.19:8": "Evaṁ vutte, bhagavā te bhikkhū etadavoca:",
    "an6.19:9": "Yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ divasaṁ jīveyyaṁ, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti.(2)",
    "an6.19:10": "Yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ tadantaraṁ jīveyyaṁ yadantaraṁ ekapiṇḍapātaṁ bhuñjāmi, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti.(3)",
    "an6.19:11": "Yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ tadantaraṁ jīveyyaṁ yadantaraṁ cattāro pañca ālope saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti.(4)",
    "an6.19:12": "Ime vuccanti, bhikkhave, bhikkhū pamattā viharanti dandhaṁ maraṇassatiṁ bhāventi āsavānaṁ khayāya. (1–4.)",
    "an6.19:13": "Yo ca khvāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ tadantaraṁ jīveyyaṁ yadantaraṁ ekaṁ ālopaṁ saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti.(5)",
    "an6.19:14": "Yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ tadantaraṁ jīveyyaṁ yadantaraṁ assasitvā vā passasāmi passasitvā vā assasāmi, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti.(6)",
    "an6.19:15": "Ime vuccanti, bhikkhave, bhikkhū appamattā viharanti tikkhaṁ maraṇassatiṁ bhāventi āsavānaṁ khayāya. (5–6.)",
    "an6.19:16": "Tasmātiha, bhikkhave, evaṁ sikkhitabbaṁ:  ‘appamattā viharissāma, tikkhaṁ maraṇassatiṁ bhāvessāma āsavānaṁ khayāyā’ti. Evañhi vo, bhikkhave, sikkhitabban\"ti."
}