{
    "an6.46:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ āyasmā mahācundo cetīsu viharati sayaṁjātiyaṁ. Tatra kho āyasmā mahācundo bhikkhū āmantesi:",
    "an6.46:2": "\"Idhāvuso, dhammayogā bhikkhū jhāyī bhikkhū apasādenti:  ‘ime pana jhāyinomhā, jhāyinomhāti jhāyanti pajjhāyanti nijjhāyanti avajjhāyanti. Kimime jhāyanti, kintime jhāyanti, kathaṁ ime jhāyantī’ti? Tattha dhammayogā ca bhikkhū nappasīdanti, jhāyī ca bhikkhū nappasīdanti, na ca bahujanahitāya paṭipannā honti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṁ.(1)",
    "an6.46:3": "Idha panāvuso, jhāyī bhikkhū dhammayoge bhikkhū apasādenti:  ‘ime pana dhammayogamhā, dhammayogamhāti uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatī asampajānā asamāhitā vibbhantacittā pākatindriyā. Kimime dhammayogā, kintime dhammayogā, kathaṁ ime dhammayogā’ti? Tattha jhāyī ca bhikkhū nappasīdanti, dhammayogā ca bhikkhū nappasīdanti, na ca bahujanahitāya paṭipannā honti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṁ.(2)",
    "an6.46:4": "Idha panāvuso, dhammayogā bhikkhū dhammayogānaññeva bhikkhūnaṁ vaṇṇaṁ bhāsanti, no jhāyīnaṁ bhikkhūnaṁ vaṇṇaṁ bhāsanti. Tattha dhammayogā ca bhikkhū nappasīdanti, jhāyī ca bhikkhū nappasīdanti, na ca bahujanahitāya paṭipannā honti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṁ.(3)",
    "an6.46:5": "Idha panāvuso, jhāyī bhikkhū jhāyīnaññeva bhikkhūnaṁ vaṇṇaṁ bhāsanti, no dhammayogānaṁ bhikkhūnaṁ vaṇṇaṁ bhāsanti. Tattha jhāyī ca bhikkhū nappasīdanti, dhammayogā ca bhikkhū nappasīdanti, na ca bahujanahitāya paṭipannā honti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṁ.(4)",
    "an6.46:6": "Tasmātihāvuso, evaṁ sikkhitabbaṁ:  ‘dhammayogā samānā jhāyīnaṁ bhikkhūnaṁ vaṇṇaṁ bhāsissāmā’ti. Evañhi vo, āvuso, sikkhitabbaṁ. Taṁ kissa hetu? Acchariyā hete, āvuso, puggalā dullabhā lokasmiṁ, ye amataṁ dhātuṁ kāyena phusitvā viharanti.(5)",
    "an6.46:7": "Tasmātihāvuso, evaṁ sikkhitabbaṁ:  ‘jhāyī samānā dhammayogānaṁ bhikkhūnaṁ vaṇṇaṁ bhāsissāmā’ti. Evañhi vo, āvuso, sikkhitabbaṁ. Taṁ kissa hetu? Acchariyā hete, āvuso, puggalā dullabhā lokasmiṁ ye gambhīraṁ atthapadaṁ paññāya ativijjha passantī\"ti.(6)"
}