{
    "an6.29:1": "Atha kho bhagavā āyasmantaṁ udāyiṁ āmantesi:  \"kati nu kho, udāyi, anussatiṭṭhānānī\"ti?",
    "an6.29:2": "Atha kho āyasmā ānando āyasmantaṁ udāyiṁ etadavoca:  \"satthā taṁ, āvuso udāyi, āmantesī\"ti.",
    "an6.29:3": "Atha kho bhagavā āyasmantaṁ ānandaṁ āmantesi:  \"aññāsiṁ kho ahaṁ, ānanda:  ‘nevāyaṁ udāyī moghapuriso adhicittaṁ anuyutto viharatī’ti. Kati nu kho, ānanda, anussatiṭṭhānānī\"ti?",
    "an6.29:4": "\"Pañca, bhante, anussatiṭṭhānāni. Katamāni pañca?",
    "an6.29:5": "\"Puna caparaṁ, bhante, bhikkhu ālokasaññaṁ manasi karoti, divā saññaṁ adhiṭṭhāti, yathā divā tathā rattiṁ, yathā rattiṁ tathā divā; iti vivaṭena cetasā apariyonaddhena sappabhāsaṁ cittaṁ bhāveti. Idaṁ, bhante, anussatiṭṭhānaṁ evaṁ bhāvitaṁ evaṁ bahulīkataṁ ñāṇadassanappaṭilābhāya saṁvattati.(2)",
    "an6.29:6": "Puna caparaṁ, bhante, bhikkhu imameva kāyaṁ uddhaṁ pādatalā adho kesamatthakā tacapariyantaṁ pūraṁ nānappakārassa asucino paccavekkhati:  ‘atthi imasmiṁ kāye kesā lomā nakhā dantā taco, maṁsaṁ nhāru aṭṭhi aṭṭhimiñjaṁ vakkaṁ, hadayaṁ yakanaṁ kilomakaṁ pihakaṁ papphāsaṁ, antaṁ antaguṇaṁ udariyaṁ karīsaṁ, pittaṁ semhaṁ pubbo lohitaṁ sedo medo, assu vasā kheḷo siṅghāṇikā lasikā muttan’ti. Idaṁ, bhante, anussatiṭṭhānaṁ evaṁ bhāvitaṁ evaṁ bahulīkataṁ kāmarāgappahānāya saṁvattati.(3)",
    "an6.29:7": "Puna caparaṁ, bhante, bhikkhu seyyathāpi passeyya sarīraṁ sivathikāya chaṭṭitaṁ ekāhamataṁ vā dvīhamataṁ vā tīhamataṁ vā uddhumātakaṁ vinīlakaṁ vipubbakajātaṁ. So imameva kāyaṁ evaṁ upasaṁharati:  ‘ayampi kho kāyo evaṁdhammo evaṁbhāvī evaṁanatīto’ti.(4)",
    "an6.29:8": "Seyyathāpi vā pana passeyya sarīraṁ sīvathikāya chaṭṭitaṁ kākehi vā khajjamānaṁ kulalehi vā khajjamānaṁ gijjhehi vā khajjamānaṁ sunakhehi vā khajjamānaṁ siṅgālehi vā khajjamānaṁ vividhehi vā pāṇakajātehi khajjamānaṁ. So imameva kāyaṁ evaṁ upasaṁharati:  ‘ayampi kho kāyo evaṁdhammo evaṁbhāvī evaṁanatīto’ti.",
    "an6.29:9": "Seyyathāpi vā pana passeyya sarīraṁ sīvathikāya chaṭṭitaṁ aṭṭhikasaṅkhalikaṁ samaṁsalohitaṁ nhārusambandhaṁ … pe … aṭṭhikasaṅkhalikaṁ nimmaṁsalohitamakkhitaṁ nhārusambandhaṁ … aṭṭhikasaṅkhalikaṁ apagatamaṁsalohitaṁ nhārusambandhaṁ. Aṭṭhikāni apagatasambandhāni disāvidisāvikkhittāni, aññena hatthaṭṭhikaṁ aññena pādaṭṭhikaṁ aññena jaṅghaṭṭhikaṁ aññena ūruṭṭhikaṁ aññena kaṭiṭṭhikaṁ aññena phāsukaṭṭhikaṁ aññena piṭṭhikaṇṭakaṭṭhikaṁ aññena khandhaṭṭhikaṁ aññena gīvaṭṭhikaṁ aññena hanukaṭṭhikaṁ aññena dantakaṭṭhikaṁ aññena sīsakaṭāhaṁ, aṭṭhikāni setāni saṅkhavaṇṇappaṭibhāgāni aṭṭhikāni puñjakitāni terovassikāni aṭṭhikāni pūtīni cuṇṇakajātāni. So imameva kāyaṁ evaṁ upasaṁharati:  ‘ayampi kho kāyo evaṁdhammo evaṁbhāvī evaṁanatīto’ti. Idaṁ, bhante, anussatiṭṭhānaṁ evaṁ bhāvitaṁ evaṁ bahulīkataṁ asmimānasamugghātāya saṁvattati.",
    "an6.29:10": "Puna caparaṁ, bhante, bhikkhu sukhassa ca pahānā … pe … catutthaṁ jhānaṁ upasampajja viharati. Idaṁ, bhante, anussatiṭṭhānaṁ evaṁ bhāvitaṁ evaṁ bahulīkataṁ anekadhātupaṭivedhāya saṁvattati.",
    "an6.29:11": "\"Sādhu sādhu, ānanda. Tena hi tvaṁ, ānanda, idampi chaṭṭhaṁ anussatiṭṭhānaṁ dhārehi."
}