{
    "an6.59:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā nātike viharati giñjakāvasathe. Atha kho dārukammiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho dārukammikaṁ gahapatiṁ bhagavā etadavoca:  \"api nu te, gahapati, kule dānaṁ dīyatī\"ti?",
    "an6.59:2": "\"Dujjānaṁ kho etaṁ, gahapati, tayā gihinā kāmabhoginā puttasambādhasayanaṁ ajjhāvasantena, kāsikacandanaṁ paccanubhontena, mālāgandhavilepanaṁ dhārayantena, jātarūparajataṁ sādiyantena ime vā arahanto ime vā arahattamaggaṁ samāpannāti.",
    "an6.59:3": "Āraññiko cepi, gahapati, bhikkhu hoti uddhato unnaḷo capalo mukharo vikiṇṇavāco muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo. Evaṁ so tenaṅgena gārayho. Āraññiko cepi, gahapati, bhikkhu hoti anuddhato anunnaḷo acapalo amukharo avikiṇṇavāco upaṭṭhitassati sampajāno samāhito ekaggacitto saṁvutindriyo. Evaṁ so tenaṅgena pāsaṁso.(1)",
    "an6.59:4": "Gāmantavihārī cepi, gahapati, bhikkhu hoti uddhato … pe … evaṁ so tenaṅgena gārayho. Gāmantavihārī cepi, gahapati, bhikkhu hoti anuddhato … pe … evaṁ so tenaṅgena pāsaṁso.(2)",
    "an6.59:5": "Piṇḍapātiko cepi, gahapati, bhikkhu hoti uddhato … pe … evaṁ so tenaṅgena gārayho. Piṇḍapātiko cepi, gahapati, bhikkhu hoti anuddhato … pe … evaṁ so tenaṅgena pāsaṁso.(3)",
    "an6.59:6": "Nemantaniko cepi, gahapati, bhikkhu hoti uddhato … pe … evaṁ so tenaṅgena gārayho. Nemantaniko cepi, gahapati, bhikkhu hoti anuddhato … pe … evaṁ so tenaṅgena pāsaṁso.(4)",
    "an6.59:7": "Paṁsukūliko cepi, gahapati, bhikkhu hoti uddhato … pe … evaṁ so tenaṅgena gārayho. Paṁsukūliko cepi, gahapati, bhikkhu hoti anuddhato … pe … evaṁ so tenaṅgena pāsaṁso.(5)",
    "an6.59:8": "Gahapaticīvaradharo cepi, gahapati, bhikkhu hoti uddhato unnaḷo capalo mukharo vikiṇṇavāco muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo. Evaṁ so tenaṅgena gārayho. Gahapaticīvaradharo cepi, gahapati, bhikkhu hoti anuddhato anunnaḷo acapalo amukharo avikiṇṇavāco upaṭṭhitassati sampajāno samāhito ekaggacitto saṁvutindriyo. Evaṁ so tenaṅgena pāsaṁso.(6)",
    "an6.59:9": "Iṅgha tvaṁ, gahapati, saṅghe dānaṁ dehi. Saṅghe te dānaṁ dadato cittaṁ pasīdissati. So tvaṁ pasannacitto kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjissasī\"ti."
}