{
    "an6.54:1": "Ekaṁ samayaṁ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena āyasmā dhammiko jātibhūmiyaṁ āvāsiko hoti sabbaso jātibhūmiyaṁ sattasu āvāsesu. Tatra sudaṁ āyasmā dhammiko āgantuke bhikkhū akkosati paribhāsati vihiṁsati vitudati roseti vācāya. Te ca āgantukā bhikkhū āyasmatā dhammikena akkosiyamānā paribhāsiyamānā vihesiyamānā vitudiyamānā rosiyamānā vācāya pakkamanti, na saṇṭhanti, riñcanti āvāsaṁ.",
    "an6.54:2": "Atha kho jātibhūmakānaṁ upāsakānaṁ etadahosi:  \"Mayaṁ kho bhikkhusaṅghaṁ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena. Atha ca pana āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsaṁ. Ko nu kho hetu ko paccayo yena āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsan\"ti?",
    "an6.54:3": "Atha kho jātibhūmakā upāsakā yena āyasmā dhammiko tenupasaṅkamiṁsu; upasaṅkamitvā āyasmantaṁ dhammikaṁ etadavocuṁ:  \"pakkamatu, bhante, āyasmā dhammiko imamhā āvāsā; alaṁ te idha vāsenā\"ti.",
    "an6.54:4": "Atha kho jātibhūmakānaṁ upāsakānaṁ etadahosi:  \"Mayaṁ kho bhikkhusaṅghaṁ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena. Atha ca pana āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsaṁ. Ko nu kho hetu ko paccayo yena āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsan\"ti?",
    "an6.54:5": "Atha kho jātibhūmakā upāsakā yenāyasmā dhammiko tenupasaṅkamiṁsu; upasaṅkamitvā āyasmantaṁ dhammikaṁ etadavocuṁ:  \"pakkamatu, bhante, āyasmā dhammiko imamhāpi āvāsā; alaṁ te idha vāsenā\"ti.",
    "an6.54:6": "Atha kho jātibhūmakānaṁ upāsakānaṁ etadahosi:  \"Mayaṁ kho bhikkhusaṅghaṁ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena. Atha ca pana āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsaṁ. Ko nu kho hetu ko paccayo yena āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsan\"ti?",
    "an6.54:7": "Atha kho āyasmā dhammiko pattacīvaramādāya yena rājagahaṁ tena pakkāmi. Anupubbena yena rājagahaṁ gijjhakūṭo pabbato yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho āyasmantaṁ dhammikaṁ bhagavā etadavoca:  \"handa kuto nu tvaṁ, brāhmaṇa dhammika, āgacchasī\"ti?",
    "an6.54:8": "Bhūtapubbaṁ, brāhmaṇa dhammika, sāmuddikā vāṇijā tīradassiṁ sakuṇaṁ gahetvā nāvāya samuddaṁ ajjhogāhanti. Te atīradakkhiṇiyā nāvāya tīradassiṁ sakuṇaṁ muñcanti. So gacchateva puratthimaṁ disaṁ, gacchati pacchimaṁ disaṁ, gacchati uttaraṁ disaṁ, gacchati dakkhiṇaṁ disaṁ, gacchati uddhaṁ, gacchati anudisaṁ. Sace so samantā tīraṁ passati, tathāgatakova hoti. Sace pana so samantā tīraṁ na passati tameva nāvaṁ paccāgacchati. Evamevaṁ kho, brāhmaṇa dhammika, yaṁ taṁ tato tato pabbājenti so tvaṁ tato tato pabbājito mameva santike āgacchasi.",
    "an6.54:9": "Bhūtapubbaṁ, brāhmaṇa dhammika, rañño korabyassa suppatiṭṭho nāma nigrodharājā ahosi pañcasākho sītacchāyo manoramo. Suppatiṭṭhassa kho pana, brāhmaṇa dhammika, nigrodharājassa dvādasayojanāni abhiniveso ahosi, pañca yojanāni mūlasantānakānaṁ. Suppatiṭṭhassa kho pana, brāhmaṇa dhammika, nigrodharājassa tāva mahantāni phalāni ahesuṁ; seyyathāpi nāma āḷhakathālikā. Evamassa sādūni phalāni ahesuṁ; seyyathāpi nāma khuddaṁ madhuṁ anelakaṁ. Suppatiṭṭhassa kho pana, brāhmaṇa dhammika, nigrodharājassa ekaṁ khandhaṁ rājā paribhuñjati saddhiṁ itthāgārena, ekaṁ khandhaṁ balakāyo paribhuñjati, ekaṁ khandhaṁ negamajānapadā paribhuñjanti, ekaṁ khandhaṁ samaṇabrāhmaṇā paribhuñjanti, ekaṁ khandhaṁ migā paribhuñjanti. Suppatiṭṭhassa kho pana, brāhmaṇa dhammika, nigrodharājassa na koci phalāni rakkhati, na ca sudaṁ aññamaññassa phalāni hiṁsanti.",
    "an6.54:10": "Atha kho, brāhmaṇa dhammika, aññataro puriso suppatiṭṭhassa nigrodharājassa yāvadatthaṁ phalāni bhakkhitvā sākhaṁ bhañjitvā pakkāmi. Atha kho, brāhmaṇa dhammika, suppatiṭṭhe nigrodharāje adhivatthāya devatāya etadahosi:  ‘acchariyaṁ vata bho, abbhutaṁ vata bho. Yāva pāpo manusso, yatra hi nāma suppatiṭṭhassa nigrodharājassa yāvadatthaṁ phalāni bhakkhitvā sākhaṁ bhañjitvā pakkamissati, yannūna suppatiṭṭho nigrodharājā āyatiṁ phalaṁ na dadeyyā’ti. Atha kho, brāhmaṇa dhammika, suppatiṭṭho nigrodharājā āyatiṁ phalaṁ na adāsi.",
    "an6.54:11": "Atha kho, brāhmaṇa dhammika, rājā korabyo yena sakko devānamindo tenupasaṅkami; upasaṅkamitvā sakkaṁ devānamindaṁ etadavoca:  ‘yagghe, mārisa, jāneyyāsi suppatiṭṭho nigrodharājā phalaṁ na detī’ti?",
    "an6.54:12": "Atha kho, brāhmaṇa dhammika, sakko devānamindo yena suppatiṭṭhe nigrodharāje adhivatthā devatā tenupasaṅkami; upasaṅkamitvā suppatiṭṭhe nigrodharāje adhivatthaṁ devataṁ etadavoca:  ‘kiṁ nu tvaṁ, devate, dukkhī dummanā assumukhī rudamānā ekamantaṁ ṭhitā’ti? ‘Tathā hi pana me, mārisa, bhusā vātavuṭṭhi āgantvā bhavanaṁ pavattesi ummūlamakāsī’ti. ‘Api nu tvaṁ, devate, rukkhadhamme ṭhitāya bhusā vātavuṭṭhi āgantvā bhavanaṁ pavattesi ummūlamakāsī’ti? ‘Kathaṁ pana, mārisa, rukkho rukkhadhamme ṭhito hotī’ti? ‘Idha, devate, rukkhassa mūlaṁ mūlatthikā haranti, tacaṁ tacatthikā haranti, pattaṁ pattatthikā haranti, pupphaṁ pupphatthikā haranti, phalaṁ phalatthikā haranti. Na ca tena devatāya anattamanatā vā anabhinandi vā karaṇīyā. Evaṁ kho, devate, rukkho rukkhadhamme ṭhito hotī’ti. ‘Aṭṭhitāyeva kho me, mārisa, rukkhadhamme bhusā vātavuṭṭhi āgantvā bhavanaṁ pavattesi ummūlamakāsī’ti. ‘Sace kho tvaṁ, devate, rukkhadhamme tiṭṭheyyāsi, siyā te bhavanaṁ yathāpure’ti? ‘Ṭhassāmahaṁ, mārisa, rukkhadhamme, hotu me bhavanaṁ yathāpure’ti.",
    "an6.54:13": "Atha kho, brāhmaṇa dhammika, sakko devānamindo tathārūpaṁ iddhābhisaṅkhāraṁ abhisaṅkhāsi, yathā bhusā vātavuṭṭhi āgantvā suppatiṭṭhaṁ nigrodharājaṁ ussāpesi, sacchavīni mūlāni ahesuṁ. Evamevaṁ kho, brāhmaṇa dhammika, api nu taṁ samaṇadhamme ṭhitaṁ jātibhūmakā upāsakā pabbājesuṁ sabbaso jātibhūmiyaṁ sattahi āvāsehī\"ti?",
    "an6.54:14": "\"Bhūtapubbaṁ, brāhmaṇa dhammika, sunetto nāma satthā ahosi titthakaro kāmesu vītarāgo. Sunettassa kho pana, brāhmaṇa dhammika, satthuno anekāni sāvakasatāni ahesuṁ. Sunetto satthā sāvakānaṁ brahmalokasahabyatāya dhammaṁ desesi. Ye kho pana, brāhmaṇa dhammika, sunettassa satthuno brahmalokasahabyatāya dhammaṁ desentassa cittāni na pasādesuṁ te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjiṁsu. Ye kho pana, brāhmaṇa dhammika, sunettassa satthuno brahmalokasahabyatāya dhammaṁ desentassa cittāni pasādesuṁ te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjiṁsu.(1)",
    "an6.54:15": "Bhūtapubbaṁ, brāhmaṇa dhammika, mūgapakkho nāma satthā ahosi … pe …(2)",
    "an6.54:16": "Aranemi nāma satthā ahosi …(3)",
    "an6.54:17": "…  Kuddālako nāma satthā ahosi …(4)",
    "an6.54:18": "…  Hatthipālo nāma satthā ahosi …(5)",
    "an6.54:19": "…  Jotipālo nāma satthā ahosi titthakaro kāmesu vītarāgo. Jotipālassa kho pana, brāhmaṇa dhammika, satthuno anekāni sāvakasatāni ahesuṁ. Jotipālo satthā sāvakānaṁ brahmalokasahabyatāya dhammaṁ desesi. Ye kho pana, brāhmaṇa dhammika, jotipālassa satthuno brahmalokasahabyatāya dhammaṁ desentassa cittāni na pasādesuṁ te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjiṁsu. Ye kho pana, brāhmaṇa dhammika, jotipālassa satthuno brahmalokasahabyatāya dhammaṁ desentassa cittāni pasādesuṁ te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjiṁsu.(6)",
    "an6.54:20": "Taṁ kiṁ maññasi, brāhmaṇa dhammika, yo ime cha satthāre titthakare kāmesu vītarāge, anekasataparivāre sasāvakasaṅghe paduṭṭhacitto akkoseyya paribhāseyya, bahuṁ so apuññaṁ pasaveyyā\"ti? \"",
    "an6.54:21": "Sunetto mūgapakkho ca,aranemi ca brāhmaṇo;Kuddālako ahu satthā,hatthipālo ca māṇavo.",
    "an6.54:22": "Jotipālo ca govindo,ahu sattapurohito;Ahiṁsakā atītaṁse,cha satthāro yasassino.",
    "an6.54:23": "Nirāmagandhā karuṇedhimuttā,Kāmasaṁyojanātigā;Kāmarāgaṁ virājetvā,Brahmalokūpagā ahuṁ.",
    "an6.54:24": "Ahesuṁ sāvakā tesaṁ,Anekāni satānipi;Nirāmagandhā karuṇedhimuttā,Kāmasaṁyojanātigā;Kāmarāgaṁ virājetvā,Brahmalokūpagā ahuṁ.",
    "an6.54:25": "Yete isī bāhirake,vītarāge samāhite;Paduṭṭhamanasaṅkappo,yo naro paribhāsati;Bahuñca so pasavati,apuññaṁ tādiso naro.",
    "an6.54:26": "Yo cekaṁ diṭṭhisampannaṁ,Bhikkhuṁ buddhassa sāvakaṁ;Paduṭṭhamanasaṅkappo,Yo naro paribhāsati;Ayaṁ tato bahutaraṁ,Apuññaṁ pasave naro.",
    "an6.54:27": "Na sādhurūpaṁ āsīde,diṭṭhiṭṭhānappahāyinaṁ;Sattamo puggalo eso,ariyasaṅghassa vuccati.",
    "an6.54:28": "Avītarāgo kāmesu,yassa pañcindriyā mudū;Saddhā sati ca vīriyaṁ,samatho ca vipassanā.",
    "an6.54:29": "Tādisaṁ bhikkhumāsajja,pubbeva upahaññati;Attānaṁ upahantvāna,pacchā aññaṁ vihiṁsati.",
    "an6.54:30": "Yo ca rakkhati attānaṁ,rakkhito tassa bāhiro;Tasmā rakkheyya attānaṁ,akkhato paṇḍito sadā\"ti.",
    "an6.54:31": "Nāgamigasālā iṇaṁ,Cundaṁ dve sandiṭṭhikā duve;Khemaindriya ānanda,Khattiyā appamādena dhammikoti."
}