{
    "an6.57:1": "Ekaṁ samayaṁ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:",
    "an6.57:2": "Tatridaṁ, bhante, pūraṇena kassapena kaṇhābhijāti paññattā, orabbhikā sūkarikā sākuṇikā māgavikā luddā macchaghātakā corā coraghātakā bandhanāgārikā ye vā panaññepi keci kurūrakammantā.(1)",
    "an6.57:3": "Tatridaṁ, bhante, pūraṇena kassapena nīlābhijāti paññattā, bhikkhū kaṇṭakavuttikā ye vā panaññepi keci kammavādā kriyavādā.(2)",
    "an6.57:4": "Tatridaṁ, bhante, pūraṇena kassapena lohitābhijāti paññattā, nigaṇṭhā ekasāṭakā.(3)",
    "an6.57:5": "Tatridaṁ, bhante, pūraṇena kassapena haliddābhijāti paññattā, gihī odātavasanā acelakasāvakā.(4)",
    "an6.57:6": "Tatridaṁ, bhante, pūraṇena kassapena sukkābhijāti paññattā, ājīvakā ājīvakiniyo.(5)",
    "an6.57:7": "Tatridaṁ, bhante, pūraṇena kassapena paramasukkābhijāti paññattā, nando vaccho kiso saṅkicco makkhali gosālo.(6)",
    "an6.57:8": "Pūraṇena, bhante, kassapena imā chaḷabhijātiyo paññattā\"ti.",
    "an6.57:9": "\"Kiṁ panānanda, pūraṇassa kassapassa sabbo loko etadabbhanujānāti imā chaḷabhijātiyo paññāpetun\"ti?",
    "an6.57:10": "Ahaṁ kho panānanda, chaḷabhijātiyo paññāpemi. Taṁ suṇāhi, sādhukaṁ manasi karohi; bhāsissāmī\"ti.",
    "an6.57:11": "Kathañcānanda, kaṇhābhijātiyo samāno kaṇhaṁ dhammaṁ abhijāyati? Idhānanda, ekacco nīce kule paccājāto hoti – caṇḍālakule vā nesādakule vā venakule vā rathakārakule vā pukkusakule vā, dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā, vācāya duccaritaṁ caritvā, manasā duccaritaṁ caritvā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Evaṁ kho, ānanda, kaṇhābhijātiyo samāno kaṇhaṁ dhammaṁ abhijāyati.(1)",
    "an6.57:12": "Kathañcānanda, kaṇhābhijātiyo samāno sukkaṁ dhammaṁ abhijāyati? Idhānanda, ekacco nīce kule paccājāto hoti – caṇḍālakule vā … pe … seyyāvasathapadīpeyyassa. So kāyena sucaritaṁ carati, vācāya sucaritaṁ carati, manasā sucaritaṁ carati. So kāyena sucaritaṁ caritvā, vācāya sucaritaṁ caritvā, manasā sucaritaṁ caritvā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati. Evaṁ kho, ānanda, kaṇhābhijātiyo samāno sukkaṁ dhammaṁ abhijāyati.(2)",
    "an6.57:13": "Kathañcānanda, kaṇhābhijātiyo samāno akaṇhaṁ asukkaṁ nibbānaṁ abhijāyati? Idhānanda, ekacco nīce kule paccājāto hoti – caṇḍālakule vā … pe … so ca hoti dubbaṇṇo duddasiko okoṭimako. So kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajati. So evaṁ pabbajito samāno pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacitto, satta bojjhaṅge yathābhūtaṁ bhāvetvā akaṇhaṁ asukkaṁ nibbānaṁ abhijāyati. Evaṁ kho, ānanda, kaṇhābhijātiyo samāno akaṇhaṁ asukkaṁ nibbānaṁ abhijāyati.(3)",
    "an6.57:14": "Kathañcānanda, sukkābhijātiyo samāno kaṇhaṁ dhammaṁ abhijāyati? Idhānanda, ekacco ucce kule paccājāto hoti – khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā, aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe. So ca hoti abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā, vācāya duccaritaṁ caritvā, manasā duccaritaṁ caritvā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Evaṁ kho, ānanda, sukkābhijātiyo samāno kaṇhaṁ dhammaṁ abhijāyati.(4)",
    "an6.57:15": "Kathañcānanda, sukkābhijātiyo samāno sukkaṁ dhammaṁ abhijāyati? Idhānanda, ekacco ucce kule paccājāto hoti – khattiyamahāsālakule vā … pe … seyyāvasathapadīpeyyassa. So kāyena sucaritaṁ carati, vācāya sucaritaṁ carati, manasā sucaritaṁ carati. So kāyena sucaritaṁ caritvā, vācāya sucaritaṁ caritvā, manasā sucaritaṁ caritvā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati. Evaṁ kho, ānanda, sukkābhijātiyo samāno sukkaṁ dhammaṁ abhijāyati.(5)",
    "an6.57:16": "Kathañcānanda, sukkābhijātiyo samāno akaṇhaṁ asukkaṁ nibbānaṁ abhijāyati? Idhānanda, ekacco ucce kule paccājāto hoti – khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā, aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe. So ca hoti abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajati. So evaṁ pabbajito samāno pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacitto, satta bojjhaṅge yathābhūtaṁ bhāvetvā akaṇhaṁ asukkaṁ nibbānaṁ abhijāyati. Evaṁ kho, ānanda, sukkābhijātiyo samāno akaṇhaṁ asukkaṁ nibbānaṁ abhijāyati.(6)",
    "an6.57:17": "Imā kho, ānanda, chaḷabhijātiyo\"ti."
}