{
    "an6.13:1": "\"Chayimā, bhikkhave, nissāraṇīyā dhātuyo. Katamā cha?",
    "an6.13:2": "Idha pana, bhikkhave, bhikkhu evaṁ vadeyya:  ‘karuṇā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me vihesā cittaṁ pariyādāya tiṭṭhatī’ti. So ‘mā hevan’tissa vacanīyo:  ‘māyasmā evaṁ avaca; mā bhagavantaṁ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṁ, na hi bhagavā evaṁ vadeyya. Aṭṭhānametaṁ, āvuso, anavakāso yaṁ karuṇāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa vihesā cittaṁ pariyādāya ṭhassati, netaṁ ṭhānaṁ vijjati. Nissaraṇañhetaṁ, āvuso, vihesāya yadidaṁ karuṇācetovimuttī’ti.()",
    "an6.13:3": "Idha pana, bhikkhave, bhikkhu evaṁ vadeyya:  ‘muditā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me arati cittaṁ pariyādāya tiṭṭhatī’ti. So ‘mā hevan’tissa vacanīyo:  ‘māyasmā evaṁ avaca; mā bhagavantaṁ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṁ, na hi bhagavā evaṁ vadeyya. Aṭṭhānametaṁ, āvuso, anavakāso yaṁ muditāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa arati cittaṁ pariyādāya ṭhassati, netaṁ ṭhānaṁ vijjati. Nissaraṇañhetaṁ, āvuso, aratiyā yadidaṁ muditācetovimuttī’ti.()",
    "an6.13:4": "Idha pana, bhikkhave, bhikkhu evaṁ vadeyya:  ‘upekkhā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me rāgo cittaṁ pariyādāya tiṭṭhatī’ti. So ‘mā hevan’tissa vacanīyo:  ‘māyasmā evaṁ avaca; mā bhagavantaṁ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṁ, na hi bhagavā evaṁ vadeyya. Aṭṭhānametaṁ, āvuso, anavakāso yaṁ upekkhāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa rāgo cittaṁ pariyādāya ṭhassati, netaṁ ṭhānaṁ vijjati. Nissaraṇañhetaṁ, āvuso, rāgassa yadidaṁ upekkhācetovimuttī’ti.()",
    "an6.13:5": "Idha pana, bhikkhave, bhikkhu evaṁ vadeyya:  ‘animittā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me nimittānusāri viññāṇaṁ hotī’ti. So ‘mā hevan’tissa vacanīyo:  ‘māyasmā evaṁ avaca; mā bhagavantaṁ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṁ, na hi bhagavā evaṁ vadeyya. Aṭṭhānametaṁ, āvuso, anavakāso yaṁ animittāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa nimittānusāri viññāṇaṁ bhavissati, netaṁ ṭhānaṁ vijjati. Nissaraṇañhetaṁ, āvuso, sabbanimittānaṁ yadidaṁ animittācetovimuttī’ti.()",
    "an6.13:6": "Idha pana bhikkhave, bhikkhu evaṁ vadeyya:  ‘asmīti kho me vigataṁ, ayamahamasmīti ca na samanupassāmi; atha ca pana me vicikicchākathaṅkathāsallaṁ cittaṁ pariyādāya tiṭṭhatī’ti. So ‘mā hevan’tissa vacanīyo:  ‘māyasmā evaṁ avaca; mā bhagavantaṁ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṁ, na hi bhagavā evaṁ vadeyya. Aṭṭhānametaṁ, āvuso, anavakāso yaṁ asmīti vigate ayamahamasmīti ca na samanupassato; atha ca panassa vicikicchākathaṅkathāsallaṁ cittaṁ pariyādāya ṭhassati, netaṁ ṭhānaṁ vijjati. Nissaraṇañhetaṁ, āvuso, vicikicchākathaṅkathāsallassa yadidaṁ asmīti mānasamugghāto’ti.()",
    "an6.13:7": "Imā kho, bhikkhave, cha nissāraṇīyā dhātuyo\"ti."
}