{
    "an6.16:1": "Ekaṁ samayaṁ bhagavā bhaggesu viharati susumāragire bhesakaḷāvane migadāye. Tena kho pana samayena nakulapitā gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho nakulamātā gahapatānī nakulapitaraṁ gahapatiṁ etadavoca:",
    "an6.16:2": "\"Mā kho tvaṁ, gahapati, sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā. Siyā kho pana te, gahapati, evamassa:  ‘Na nakulamātā gahapatānī mamaccayena sakkhissati dārake posetuṁ, gharāvāsaṁ santharitun’ti. Na kho panetaṁ, gahapati, evaṁ daṭṭhabbaṁ. Kusalāhaṁ, gahapati, kappāsaṁ kantituṁ veṇiṁ olikhituṁ. Sakkomahaṁ, gahapati, tavaccayena dārake posetuṁ, gharāvāsaṁ santharituṁ. Tasmātiha tvaṁ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā.(1)",
    "an6.16:3": "Siyā kho pana te, gahapati, evamassa:  ‘nakulamātā gahapatānī mamaccayena aññaṁ gharaṁ gamissatī’ti. Na kho panetaṁ, gahapati, evaṁ daṭṭhabbaṁ. Tvañceva kho, gahapati, jānāsi ahañca, yaṁ no soḷasavassāni gahaṭṭhakaṁ brahmacariyaṁ samāciṇṇaṁ. Tasmātiha tvaṁ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā.(2)",
    "an6.16:4": "Siyā kho pana te, gahapati, evamassa:  ‘nakulamātā gahapatānī mamaccayena na dassanakāmā bhavissati bhagavato na dassanakāmā bhikkhusaṅghassā’ti. Na kho panetaṁ, gahapati, evaṁ daṭṭhabbaṁ. Ahañhi, gahapati, tavaccayena dassanakāmatarā ceva bhavissāmi bhagavato, dassanakāmatarā ca bhikkhusaṅghassa. Tasmātiha tvaṁ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā.(3)",
    "an6.16:5": "Siyā kho pana te, gahapati, evamassa:  ‘Na nakulamātā gahapatānī mamaccayena sīlesu paripūrakārinī’ti. Na kho panetaṁ, gahapati, evaṁ daṭṭhabbaṁ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā sīlesu paripūrakāriniyo, ahaṁ tāsaṁ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṁ so bhagavā arahaṁ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṁ bhagavantaṁ upasaṅkamitvā pucchatu. Tasmātiha tvaṁ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā.(4)",
    "an6.16:6": "Siyā kho pana te, gahapati, evamassa:  ‘Na nakulamātā gahapatānī lābhinī ajjhattaṁ cetosamathassā’ti. Na kho panetaṁ, gahapati, evaṁ daṭṭhabbaṁ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā lābhiniyo ajjhattaṁ cetosamathassa, ahaṁ tāsaṁ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṁ so bhagavā arahaṁ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṁ bhagavantaṁ upasaṅkamitvā pucchatu. Tasmātiha tvaṁ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā.(5)",
    "an6.16:7": "Siyā kho pana te, gahapati, evamassa:  ‘Na nakulamātā gahapatānī imasmiṁ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṅkathā vesārajjappattā aparappaccayā satthusāsane viharatī’ti. Na kho panetaṁ, gahapati, evaṁ daṭṭhabbaṁ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā imasmiṁ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṅkathā vesārajjappattā aparappaccayā satthusāsane viharanti, ahaṁ tāsaṁ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṁ so bhagavā arahaṁ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṁ bhagavantaṁ upasaṅkamitvā pucchatu. Tasmātiha tvaṁ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā\"ti.(6)",
    "an6.16:8": "Atha kho nakulapituno gahapatissa nakulamātarā gahapatāniyā iminā ovādena ovadiyamānassa so ābādho ṭhānaso paṭippassambhi. Vuṭṭhahi ca nakulapitā gahapati tamhā ābādhā; tathā pahīno ca pana nakulapituno gahapatissa so ābādho ahosi.",
    "an6.16:9": "\"Lābhā te, gahapati, suladdhaṁ te, gahapati. Yassa te nakulamātā gahapatānī anukampikā atthakāmā ovādikā anusāsikā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā sīlesu paripūrakāriniyo, nakulamātā gahapatānī tāsaṁ aññatarā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā lābhiniyo ajjhattaṁ cetosamathassa, nakulamātā gahapatānī tāsaṁ aññatarā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā imasmiṁ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṅkathā vesārajjappattā aparappaccayā satthusāsane viharanti, nakulamātā gahapatānī tāsaṁ aññatarā. Lābhā te, gahapati, suladdhaṁ te, gahapati. Yassa te nakulamātā gahapatānī anukampikā atthakāmā ovādikā anusāsikā\"ti."
}