{
    "an6.25:1": "\"Chayimāni, bhikkhave, anussatiṭṭhānāni. Katamāni cha?",
    "an6.25:2": "Puna caparaṁ, bhikkhave, ariyasāvako dhammaṁ anussarati:  ‘svākkhāto bhagavatā dhammo … pe … paccattaṁ veditabbo viññūhī’ti. Yasmiṁ, bhikkhave, samaye ariyasāvako dhammaṁ anussarati, nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, bhikkhave, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Idampi kho, bhikkhave, ārammaṇaṁ karitvā evamidhekacce sattā visujjhanti.()",
    "an6.25:3": "Puna caparaṁ, bhikkhave, ariyasāvako saṅghaṁ anussarati:  ‘suppaṭipanno bhagavato sāvakasaṅgho … pe … anuttaraṁ puññakkhettaṁ lokassā’ti. Yasmiṁ, bhikkhave, samaye ariyasāvako saṅghaṁ anussarati, nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, bhikkhave, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Idampi kho, bhikkhave, ārammaṇaṁ karitvā evamidhekacce sattā visujjhanti.()",
    "an6.25:4": "Puna caparaṁ, bhikkhave, ariyasāvako attano sīlāni anussarati akhaṇḍāni … pe … samādhisaṁvattanikāni. Yasmiṁ, bhikkhave, samaye ariyasāvako sīlaṁ anussarati, nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, bhikkhave, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Idampi kho, bhikkhave, ārammaṇaṁ karitvā evamidhekacce sattā visujjhanti.()",
    "an6.25:5": "Puna caparaṁ, bhikkhave, ariyasāvako attano cāgaṁ anussarati:  ‘lābhā vata me. Suladdhaṁ vata me … pe … yācayogo dānasaṁvibhāgarato’ti. … pe … Evamidhekacce sattā visujjhanti.()",
    "an6.25:6": "Puna caparaṁ, bhikkhave, ariyasāvako devatā anussarati:  ‘santi devā cātumahārājikā, santi devā tāvatiṁsā, santi devā yāmā, santi devā tusitā, santi devā nimmānaratino, santi devā paranimmitavasavattino, santi devā brahmakāyikā, santi devā tatuttari. Yathārūpāya saddhāya samannāgatā tā devatā ito cutā tattha upapannā; mayhampi tathārūpā saddhā saṁvijjati. Yathārūpena sīlena … sutena … cāgena … paññāya samannāgatā tā devatā ito cutā tattha upapannā; mayhampi tathārūpā paññā saṁvijjatī’ti.",
    "an6.25:7": "Yasmiṁ, bhikkhave, samaye ariyasāvako attano ca tāsañca devatānaṁ saddhañca sīlañca sutañca cāgañca paññañca anussarati nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, bhikkhave, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Idampi kho, bhikkhave, ārammaṇaṁ karitvā evamidhekacce sattā visujjhanti.(6)",
    "an6.25:8": "Imāni kho, bhikkhave, cha anussatiṭṭhānānī\"ti."
}