{
    "an6.26:1": "Tatra kho āyasmā mahākaccāno bhikkhū āmantesi:  \"āvuso bhikkhave\"ti.",
    "an6.26:2": "Katamāni cha? Idhāvuso, ariyasāvako tathāgataṁ anussarati:  ‘itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavā’ti. Yasmiṁ, āvuso, samaye ariyasāvako tathāgataṁ anussarati nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṁ karitvā evamidhekacce sattā visuddhidhammā bhavanti.(1)",
    "an6.26:3": "Puna caparaṁ, āvuso, ariyasāvako dhammaṁ anussarati:  ‘svākkhāto bhagavatā dhammo … pe … paccattaṁ veditabbo viññūhī’ti. Yasmiṁ, āvuso, samaye ariyasāvako dhammaṁ anussarati nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṁ karitvā evamidhekacce sattā visuddhidhammā bhavanti.(2)",
    "an6.26:4": "Puna caparaṁ, āvuso, ariyasāvako saṅghaṁ anussarati:  ‘suppaṭipanno bhagavato sāvakasaṅgho … pe … anuttaraṁ puññakkhettaṁ lokassā’ti. Yasmiṁ, āvuso, samaye ariyasāvako saṅghaṁ anussarati nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṁ karitvā evamidhekacce sattā visuddhidhammā bhavanti.(3)",
    "an6.26:5": "Puna caparaṁ, āvuso, ariyasāvako attano sīlāni anussarati akhaṇḍāni … pe … samādhisaṁvattanikāni. Yasmiṁ, āvuso, samaye ariyasāvako attano sīlaṁ anussarati nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṁ karitvā evamidhekacce sattā visuddhidhammā bhavanti.(4)",
    "an6.26:6": "Puna caparaṁ, āvuso, ariyasāvako attano cāgaṁ anussarati:  ‘lābhā vata me, suladdhaṁ vata me … pe … yācayogo dānasaṁvibhāgarato’ti. Yasmiṁ, āvuso, samaye ariyasāvako attano cāgaṁ anussarati nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṁ karitvā evamidhekacce sattā visuddhidhammā bhavanti.(5)",
    "an6.26:7": "Puna caparaṁ, āvuso, ariyasāvako devatā anussarati:  ‘santi devā cātumahārājikā, santi devā … pe … tatuttari. Yathārūpāya saddhāya samannāgatā tā devatā ito cutā tattha upapannā; mayhampi tathārūpā saddhā saṁvijjati. Yathārūpena sīlena … sutena … cāgena … paññāya samannāgatā tā devatā ito cutā tattha upapannā; mayhampi tathārūpā paññā saṁvijjatī’ti. Yasmiṁ, āvuso, samaye ariyasāvako attano ca tāsañca devatānaṁ saddhañca sīlañca sutañca cāgañca paññañca anussarati nevassa tasmiṁ samaye rāgapariyuṭṭhitaṁ cittaṁ hoti, na dosapariyuṭṭhitaṁ cittaṁ hoti, na mohapariyuṭṭhitaṁ cittaṁ hoti; ujugatamevassa tasmiṁ samaye cittaṁ hoti, nikkhantaṁ muttaṁ vuṭṭhitaṁ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṁ kāmaguṇānaṁ adhivacanaṁ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṁ karitvā evamidhekacce sattā visuddhidhammā bhavanti.(6)",
    "an6.26:8": "Acchariyaṁ, āvuso, abbhutaṁ, āvuso. Yāvañcidaṁ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sambādhe okāsādhigamo anubuddho sattānaṁ visuddhiyā sokaparidevānaṁ samatikkamāya dukkhadomanassānaṁ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṁ cha anussatiṭṭhānānī\"ti."
}