{
    "an7.56:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho dve devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṁ gijjhakūṭaṁ obhāsetvā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhaṁsu. Ekamantaṁ ṭhitā kho ekā devatā bhagavantaṁ etadavoca:  \"etā, bhante, bhikkhuniyo vimuttā\"ti.",
    "an7.56:2": "Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi:  \"imaṁ, bhikkhave, rattiṁ dve devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṁ gijjhakūṭaṁ obhāsetvā yenāhaṁ tenupasaṅkamiṁsu; upasaṅkamitvā maṁ abhivādetvā ekamantaṁ aṭṭhaṁsu. Ekamantaṁ ṭhitā kho, bhikkhave, ekā devatā maṁ etadavoca:  ‘etā, bhante, bhikkhuniyo vimuttā’ti. Aparā devatā maṁ etadavoca:  ‘etā, bhante, bhikkhuniyo anupādisesā suvimuttā’ti. Idamavocuṁ, bhikkhave, tā devatā. Idaṁ vatvā maṁ abhivādetvā padakkhiṇaṁ katvā tatthevantaradhāyiṁsū\"ti.",
    "an7.56:3": "Tena kho pana samayena āyasmā mahāmoggallāno bhagavato avidūre nisinno hoti. Atha kho āyasmato mahāmoggallānassa etadahosi:  \"katamesānaṁ kho devānaṁ evaṁ ñāṇaṁ hoti:  ‘saupādisese vā saupādisesoti, anupādisese vā anupādiseso’\"ti?",
    "an7.56:4": "Atha kho āyasmā mahāmoggallāno – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evamevaṁ – gijjhakūṭe pabbate antarahito tasmiṁ brahmaloke pāturahosi. Addasā kho tisso brahmā āyasmantaṁ mahāmoggallānaṁ dūratova āgacchantaṁ. Disvā āyasmantaṁ mahāmoggallānaṁ etadavoca:",
    "an7.56:5": "\"Sabbesaññeva kho, tissa, brahmakāyikānaṁ devānaṁ evaṁ ñāṇaṁ hoti:  ‘saupādisese vā saupādisesoti, anupādisese vā anupādiseso’\"ti?",
    "an7.56:6": "Ye kho te, mārisa moggallāna, brahmakāyikā devā brahmena āyunā santuṭṭhā brahmena vaṇṇena brahmena sukhena brahmena yasena brahmena ādhipateyyena santuṭṭhā, te uttari nissaraṇaṁ yathābhūtaṁ nappajānanti. Tesaṁ na evaṁ ñāṇaṁ hoti:  ‘saupādisese vā saupādisesoti, anupādisese vā anupādiseso’ti. Ye ca kho te, mārisa moggallāna, brahmakāyikā devā brahmena āyunā asantuṭṭhā, brahmena vaṇṇena brahmena sukhena brahmena yasena brahmena ādhipateyyena asantuṭṭhā, te ca uttari nissaraṇaṁ yathābhūtaṁ pajānanti. Tesaṁ evaṁ ñāṇaṁ hoti:  ‘saupādisese vā saupādisesoti, anupādisese vā anupādiseso’ti.",
    "an7.56:7": "Idha, mārisa moggallāna, bhikkhu ubhatobhāgavimutto hoti. Tamenaṁ te devā evaṁ jānanti:  ‘Ayaṁ kho āyasmā ubhatobhāgavimutto. Yāvassa kāyo ṭhassati tāva naṁ dakkhanti devamanussā. Kāyassa bhedā na naṁ dakkhanti devamanussā’ti. Evampi kho, mārisa moggallāna, tesaṁ devānaṁ ñāṇaṁ hoti:  ‘saupādisese vā saupādisesoti, anupādisese vā anupādiseso’ti.",
    "an7.56:8": "Idha pana, mārisa moggallāna, bhikkhu paññāvimutto hoti. Tamenaṁ te devā evaṁ jānanti:  ‘Ayaṁ kho āyasmā paññāvimutto. Yāvassa kāyo ṭhassati tāva naṁ dakkhanti devamanussā. Kāyassa bhedā na naṁ dakkhanti devamanussā’ti. Evampi kho, mārisa moggallāna, tesaṁ devānaṁ ñāṇaṁ hoti:  ‘saupādisese vā saupādisesoti, anupādisese vā anupādiseso’ti.",
    "an7.56:9": "Idha pana, mārisa moggallāna, bhikkhu kāyasakkhī hoti. Tamenaṁ devā evaṁ jānanti:  ‘Ayaṁ kho āyasmā kāyasakkhī. Appeva nāma ayamāyasmā anulomikāni senāsanāni paṭisevamāno kalyāṇamitte bhajamāno indriyāni samannānayamāno – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ – brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihareyyā’ti. Evampi kho, mārisa moggallāna, tesaṁ devānaṁ ñāṇaṁ hoti:  ‘saupādisese vā saupādisesoti, anupādisese vā anupādiseso’ti.",
    "an7.56:10": "Idha pana, mārisa moggallāna, bhikkhu diṭṭhippatto hoti … pe … saddhāvimutto hoti … pe … dhammānusārī hoti. Tamenaṁ te devā evaṁ jānanti:  ‘Ayaṁ kho āyasmā dhammānusārī. Appeva nāma ayamāyasmā anulomikāni senāsanāni paṭisevamāno kalyāṇamitte bhajamāno indriyāni samannānayamāno – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ – brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihareyyā’ti. Evampi kho, mārisa moggallāna, tesaṁ devānaṁ ñāṇaṁ hoti:  ‘saupādisese vā saupādisesoti, anupādisese vā anupādiseso’\"ti.",
    "an7.56:11": "Atha kho āyasmā mahāmoggallāno tissassa brahmuno bhāsitaṁ abhinanditvā anumoditvā – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evamevaṁ – brahmaloke antarahito gijjhakūṭe pabbate pāturahosi. Atha kho āyasmā mahāmoggallāno yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā mahāmoggallāno yāvatako ahosi tissena brahmunā saddhiṁ kathāsallāpo taṁ sabbaṁ bhagavato ārocesi.",
    "an7.56:12": "\"Na hi pana te, moggallāna, tisso brahmā sattamaṁ animittavihāriṁ puggalaṁ deseti\".",
    "an7.56:13": "\"Idha, moggallāna, bhikkhu sabbanimittānaṁ amanasikārā animittaṁ cetosamādhiṁ upasampajja viharati. Tamenaṁ te devā evaṁ jānanti:  ‘Ayaṁ kho āyasmā sabbanimittānaṁ amanasikārā animittaṁ cetosamādhiṁ upasampajja viharati. Appeva nāma ayamāyasmā anulomikāni senāsanāni paṭisevamāno kalyāṇamitte bhajamāno indriyāni samannānayamāno – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ – brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihareyyā’ti. Evaṁ kho, moggallāna, tesaṁ devānaṁ ñāṇaṁ hoti:  ‘saupādisese vā saupādisesoti, anupādisese vā anupādiseso’\"ti."
}