{
    "an7.64:1": "\"Sattime, bhikkhave, dhammā sapattakantā sapattakaraṇā kodhanaṁ āgacchanti itthiṁ vā purisaṁ vā. Katame satta?",
    "an7.64:2": "Puna caparaṁ, bhikkhave, sapatto sapattassa evaṁ icchati:  ‘aho vatāyaṁ dukkhaṁ sayeyyā’ti. Taṁ kissa hetu? Na, bhikkhave, sapatto sapattassa sukhaseyyāya nandati. Kodhanoyaṁ, bhikkhave, purisapuggalo kodhābhibhūto kodhapareto, kiñcāpi so pallaṅke seti gonakatthate paṭalikatthate kadalimigapavarapaccattharaṇe sauttaracchade ubhatolohitakūpadhāne; atha kho so dukkhaññeva seti kodhābhibhūto. Ayaṁ, bhikkhave, dutiyo dhammo sapattakanto sapattakaraṇo kodhanaṁ āgacchati itthiṁ vā purisaṁ vā.()",
    "an7.64:3": "Puna caparaṁ, bhikkhave, sapatto sapattassa evaṁ icchati:  ‘aho vatāyaṁ na pacurattho assā’ti. Taṁ kissa hetu? Na, bhikkhave, sapatto sapattassa pacuratthatāya nandati. Kodhanoyaṁ, bhikkhave, purisapuggalo kodhābhibhūto kodhapareto, anatthampi gahetvā ‘attho me gahito’ti maññati, atthampi gahetvā ‘anattho me gahito’ti maññati. Tassime dhammā aññamaññaṁ vipaccanīkā gahitā dīgharattaṁ ahitāya dukkhāya saṁvattanti kodhābhibhūtassa. Ayaṁ, bhikkhave, tatiyo dhammo sapattakanto sapattakaraṇo kodhanaṁ āgacchati itthiṁ vā purisaṁ vā.()",
    "an7.64:4": "Puna caparaṁ, bhikkhave, sapatto sapattassa evaṁ icchati:  ‘aho vatāyaṁ na bhogavā assā’ti. Taṁ kissa hetu? Na, bhikkhave, sapatto sapattassa bhogavatāya nandati. Kodhanassa, bhikkhave, purisapuggalassa kodhābhibhūtassa kodhaparetassa, yepissa te honti bhogā uṭṭhānavīriyādhigatā bāhābalaparicitā sedāvakkhittā dhammikā dhammaladdhā, tepi rājāno rājakosaṁ pavesenti kodhābhibhūtassa. Ayaṁ, bhikkhave, catuttho dhammo sapattakanto sapattakaraṇo kodhanaṁ āgacchati itthiṁ vā purisaṁ vā.()",
    "an7.64:5": "Puna caparaṁ, bhikkhave, sapatto sapattassa evaṁ icchati:  ‘aho vatāyaṁ na yasavā assā’ti. Taṁ kissa hetu? Na, bhikkhave, sapatto sapattassa yasavatāya nandati. Kodhanoyaṁ, bhikkhave, purisapuggalo kodhābhibhūto kodhapareto, yopissa so hoti yaso appamādādhigato, tamhāpi dhaṁsati kodhābhibhūto. Ayaṁ, bhikkhave, pañcamo dhammo sapattakanto sapattakaraṇo kodhanaṁ āgacchati itthiṁ vā purisaṁ vā.()",
    "an7.64:6": "Puna caparaṁ, bhikkhave, sapatto sapattassa evaṁ icchati:  ‘aho vatāyaṁ na mittavā assā’ti. Taṁ kissa hetu? Na, bhikkhave, sapatto sapattassa mittavatāya nandati. Kodhanaṁ, bhikkhave, purisapuggalaṁ kodhābhibhūtaṁ kodhaparetaṁ, yepissa te honti mittāmaccā ñātisālohitā, tepi ārakā parivajjanti kodhābhibhūtaṁ. Ayaṁ, bhikkhave, chaṭṭho dhammo sapattakanto sapattakaraṇo kodhanaṁ āgacchati itthiṁ vā purisaṁ vā.()",
    "an7.64:7": "Puna caparaṁ, bhikkhave, sapatto sapattassa evaṁ icchati:  ‘aho vatāyaṁ kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyyā’ti. Taṁ kissa hetu? Na, bhikkhave, sapatto sapattassa sugatigamane nandati. Kodhanoyaṁ, bhikkhave, purisapuggalo kodhābhibhūto kodhapareto kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā vācāya … pe … kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati kodhābhibhūto. Ayaṁ, bhikkhave, sattamo dhammo sapattakanto sapattakaraṇo kodhanaṁ āgacchati itthiṁ vā purisaṁ vā.()",
    "an7.64:8": "Ime kho, bhikkhave, satta dhammā sapattakantā sapattakaraṇā kodhanaṁ āgacchanti itthiṁ vā purisaṁ vāti.",
    "an7.64:9": "Kodhano dubbaṇṇo hoti,atho dukkhampi seti so;Atho atthaṁ gahetvāna,anatthaṁ adhipajjati.",
    "an7.64:10": "Tato kāyena vācāya,vadhaṁ katvāna kodhano;Kodhābhibhūto puriso,dhanajāniṁ nigacchati.",
    "an7.64:11": "Kodhasammadasammatto,āyasakyaṁ nigacchati;Ñātimittā suhajjā ca,parivajjanti kodhanaṁ.",
    "an7.64:12": "Anatthajanano kodho,kodho cittappakopano;Bhayamantarato jātaṁ,taṁ jano nāvabujjhati.",
    "an7.64:13": "Kuddho atthaṁ na jānāti,kuddho dhammaṁ na passati;Andhatamaṁ tadā hoti,yaṁ kodho sahate naraṁ.",
    "an7.64:14": "Yaṁ kuddho uparodheti,sukaraṁ viya dukkaraṁ;Pacchā so vigate kodhe,aggidaḍḍhova tappati.",
    "an7.64:15": "Dummaṅkuyaṁ padasseti,dhūmaṁ dhūmīva pāvako;Yato patāyati kodho,yena kujjhanti mānavā.",
    "an7.64:16": "Nāssa hirī na ottappaṁ,na vāco hoti gāravo;Kodhena abhibhūtassa,na dīpaṁ hoti kiñcanaṁ.",
    "an7.64:17": "Tapanīyāni kammāni,yāni dhammehi ārakā;Tāni ārocayissāmi,taṁ suṇātha yathā tathaṁ.",
    "an7.64:18": "Kuddho hi pitaraṁ hanti,hanti kuddho samātaraṁ;Kuddho hi brāhmaṇaṁ hanti,hanti kuddho puthujjanaṁ.",
    "an7.64:19": "Yāya mātu bhato poso,imaṁ lokaṁ avekkhati;Tampi pāṇadadiṁ santiṁ,hanti kuddho puthujjano.",
    "an7.64:20": "Attūpamā hi te sattā,attā hi paramo piyo;Hanti kuddho puthuttānaṁ,nānārūpesu mucchito.",
    "an7.64:21": "Asinā hanti attānaṁ,visaṁ khādanti mucchitā;Rajjuyā bajjha mīyanti,pabbatāmapi kandare.",
    "an7.64:22": "Bhūnahaccāni kammāni,attamāraṇiyāni ca;Karontā nāvabujjhanti,kodhajāto parābhavo.",
    "an7.64:23": "Itāyaṁ kodharūpena,maccupāso guhāsayo;Taṁ damena samucchinde,paññāvīriyena diṭṭhiyā.",
    "an7.64:24": "Yathā metaṁ akusalaṁ,samucchindetha paṇḍito;Tatheva dhamme sikkhetha,mā no dummaṅkuyaṁ ahu.",
    "an7.64:25": "Vītakodhā anāyāsā,Vītalobhā anussukā;Dantā kodhaṁ pahantvāna,Parinibbanti anāsavā\"ti.",
    "an7.64:26": "Abyākato purisagati,Tissa sīha arakkhiyaṁ;Kimilaṁ satta pacalā,Mettā bhariyā kodhekādasāti."
}