{
    "an7.61:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā bhaggesu viharati susumāragire bhesakaḷāvane migadāye. Tena kho pana samayena āyasmā mahāmoggallāno magadhesu kallavāḷaputtagāme pacalāyamāno nisinno hoti. Addasā kho bhagavā dibbena cakkhunā visuddhena atikkantamānusakena āyasmantaṁ mahāmoggallānaṁ magadhesu kallavāḷaputtagāme pacalāyamānaṁ nisinnaṁ. Disvā – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evamevaṁ – bhaggesu susumāragire bhesakaḷāvane migadāye antarahito magadhesu kallavāḷaputtagāme āyasmato mahāmoggallānassa sammukhe pāturahosi. Nisīdi bhagavā paññatte āsane. Nisajja kho bhagavā āyasmantaṁ mahāmoggallānaṁ etadavoca:",
    "an7.61:2": "\"Pacalāyasi no tvaṁ, moggallāna, pacalāyasi no tvaṁ, moggallānā\"ti?",
    "an7.61:3": "No ce te evaṁ viharato taṁ middhaṁ pahīyetha, tato tvaṁ, moggallāna, yathāsutaṁ yathāpariyattaṁ dhammaṁ cetasā anuvitakkeyyāsi anuvicāreyyāsi, manasā anupekkheyyāsi. Ṭhānaṁ kho panetaṁ vijjati yaṁ te evaṁ viharato taṁ middhaṁ pahīyetha.(2)",
    "an7.61:4": "No ce te evaṁ viharato taṁ middhaṁ pahīyetha, tato tvaṁ, moggallāna, yathāsutaṁ yathāpariyattaṁ dhammaṁ vitthārena sajjhāyaṁ kareyyāsi. Ṭhānaṁ kho panetaṁ vijjati yaṁ te evaṁ viharato taṁ middhaṁ pahīyetha.(3)",
    "an7.61:5": "No ce te evaṁ viharato taṁ middhaṁ pahīyetha, tato tvaṁ, moggallāna, ubho kaṇṇasotāni āviñcheyyāsi, pāṇinā gattāni anumajjeyyāsi. Ṭhānaṁ kho panetaṁ vijjati yaṁ te evaṁ viharato taṁ middhaṁ pahīyetha.(4)",
    "an7.61:6": "No ce te evaṁ viharato taṁ middhaṁ pahīyetha, tato tvaṁ, moggallāna, uṭṭhāyāsanā udakena akkhīni anumajjitvā disā anuvilokeyyāsi, nakkhattāni tārakarūpāni ullokeyyāsi. Ṭhānaṁ kho panetaṁ vijjati yaṁ te evaṁ viharato taṁ middhaṁ pahīyetha.(5)",
    "an7.61:7": "No ce te evaṁ viharato taṁ middhaṁ pahīyetha, tato tvaṁ, moggallāna, ālokasaññaṁ manasi kareyyāsi, divāsaññaṁ adhiṭṭhaheyyāsi – yathā divā tathā rattiṁ yathā rattiṁ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṁ cittaṁ bhāveyyāsi. Ṭhānaṁ kho panetaṁ vijjati yaṁ te evaṁ viharato taṁ middhaṁ pahīyetha.(6)",
    "an7.61:8": "No ce te evaṁ viharato taṁ middhaṁ pahīyetha, tato tvaṁ, moggallāna, pacchāpuresaññī caṅkamaṁ adhiṭṭhaheyyāsi antogatehi indriyehi abahigatena mānasena. Ṭhānaṁ kho panetaṁ vijjati yaṁ te evaṁ viharato taṁ middhaṁ pahīyetha.(7)",
    "an7.61:9": "No ce te evaṁ viharato taṁ middhaṁ pahīyetha, tato tvaṁ, moggallāna, dakkhiṇena passena sīhaseyyaṁ kappeyyāsi pāde pādaṁ accādhāya sato sampajāno uṭṭhānasaññaṁ manasi karitvā. Paṭibuddhena ca te, moggallāna, khippaññeva paccuṭṭhātabbaṁ:  ‘Na seyyasukhaṁ na passasukhaṁ na middhasukhaṁ anuyutto viharissāmī’ti. Evañhi te, moggallāna, sikkhitabbaṁ.",
    "an7.61:10": "Tasmātiha, moggallāna, evaṁ sikkhitabbaṁ:  ‘Na uccāsoṇḍaṁ paggahetvā kulāni upasaṅkamissāmī’ti. Evañhi te, moggallāna, sikkhitabbaṁ. Sace, moggallāna, bhikkhu uccāsoṇḍaṁ paggahetvā kulāni upasaṅkamati, santi hi, moggallāna, kulesu kiccakaraṇīyāni. Yehi manussā āgataṁ bhikkhuṁ na manasi karonti, tatra bhikkhussa evaṁ hoti:  ‘kosu nāma idāni maṁ imasmiṁ kule paribhindi, virattarūpā dānime mayi manussā’ti. Itissa alābhena maṅkubhāvo, maṅkubhūtassa uddhaccaṁ, uddhatassa asaṁvaro, asaṁvutassa ārā cittaṁ samādhimhā.",
    "an7.61:11": "Tasmātiha, moggallāna, evaṁ sikkhitabbaṁ:  ‘Na viggāhikakathaṁ kathessāmī’ti. Evañhi te, moggallāna, sikkhitabbaṁ. Viggāhikāya, moggallāna, kathāya sati kathābāhullaṁ pāṭikaṅkhaṁ, kathābāhulle sati uddhaccaṁ, uddhatassa asaṁvaro, asaṁvutassa ārā cittaṁ samādhimhā.",
    "an7.61:12": "Evaṁ vutte, āyasmā mahāmoggallāno bhagavantaṁ etadavoca:  \"kittāvatā nu kho, bhante, bhikkhu saṅkhittena taṇhāsaṅkhayavimutto hoti accantaniṭṭho accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānan\"ti?",
    "an7.61:13": "\"Idha, moggallāna, bhikkhuno sutaṁ hoti:  ‘sabbe dhammā nālaṁ abhinivesāyā’ti; evañcetaṁ, moggallāna, bhikkhuno sutaṁ hoti:  ‘sabbe dhammā nālaṁ abhinivesāyā’ti. So sabbaṁ dhammaṁ abhijānāti, sabbaṁ dhammaṁ abhiññāya sabbaṁ dhammaṁ parijānāti. Sabbaṁ dhammaṁ pariññāya yaṁ kiñci vedanaṁ vediyati sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā. So tāsu vedanāsu aniccānupassī viharati, virāgānupassī viharati, nirodhānupassī viharati, paṭinissaggānupassī viharati. So tāsu vedanāsu aniccānupassī viharanto virāgānupassī viharanto nirodhānupassī viharanto paṭinissaggānupassī viharanto na kiñci loke upādiyati, anupādiyaṁ na paritassati, aparitassaṁ paccattaṁyeva parinibbāyati. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti."
}