{
    "an7.74:1": "\"Bhūtapubbaṁ, bhikkhave, arako nāma satthā ahosi titthakaro kāmesu vītarāgo. Arakassa kho pana, bhikkhave, satthuno anekāni sāvakasatāni ahesuṁ. Arako satthā sāvakānaṁ evaṁ dhammaṁ deseti:  ‘appakaṁ, brāhmaṇa, jīvitaṁ manussānaṁ parittaṁ lahukaṁ bahudukkhaṁ bahupāyāsaṁ mantāyaṁ boddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇaṁ.",
    "an7.74:2": "Seyyathāpi, brāhmaṇa, tiṇagge ussāvabindu sūriye uggacchante khippaṁyeva paṭivigacchati, na ciraṭṭhitikaṁ hoti; evamevaṁ kho, brāhmaṇa, ussāvabindūpamaṁ jīvitaṁ manussānaṁ parittaṁ lahukaṁ bahudukkhaṁ bahupāyāsaṁ mantāyaṁ boddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇaṁ.(1)",
    "an7.74:3": "Seyyathāpi, brāhmaṇa, thullaphusitake deve vassante udakabubbuḷaṁ khippaṁyeva paṭivigacchati, na ciraṭṭhitikaṁ hoti; evamevaṁ kho, brāhmaṇa, udakabubbuḷūpamaṁ jīvitaṁ manussānaṁ parittaṁ lahukaṁ bahudukkhaṁ bahupāyāsaṁ mantāyaṁ boddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇaṁ.(2)",
    "an7.74:4": "Seyyathāpi, brāhmaṇa, udake daṇḍarāji khippaṁyeva paṭivigacchati, na ciraṭṭhitikā hoti; evamevaṁ kho, brāhmaṇa, udake daṇḍarājūpamaṁ jīvitaṁ manussānaṁ parittaṁ … pe … natthi jātassa amaraṇaṁ.(3)",
    "an7.74:5": "Seyyathāpi, brāhmaṇa, nadī pabbateyyā dūraṅgamā sīghasotā hārahārinī, natthi so khaṇo vā layo vā muhutto vā yaṁ sā āvattati, atha kho sā gacchateva vattateva sandateva; evamevaṁ kho, brāhmaṇa, nadīpabbateyyūpamaṁ jīvitaṁ manussānaṁ parittaṁ lahukaṁ … pe … natthi jātassa amaraṇaṁ.(4)",
    "an7.74:6": "Seyyathāpi, brāhmaṇa, balavā puriso jivhagge kheḷapiṇḍaṁ saṁyūhitvā akasireneva vameyya; evamevaṁ kho, brāhmaṇa, kheḷapiṇḍūpamaṁ jīvitaṁ manussānaṁ parittaṁ … pe … natthi jātassa amaraṇaṁ.(5)",
    "an7.74:7": "Seyyathāpi, brāhmaṇa, divasaṁsantatte ayokaṭāhe maṁsapesi pakkhittā khippaṁyeva paṭivigacchati, na ciraṭṭhitikā hoti; evamevaṁ kho, brāhmaṇa, maṁsapesūpamaṁ jīvitaṁ manussānaṁ parittaṁ … pe … natthi jātassa amaraṇaṁ.(6)",
    "an7.74:8": "Seyyathāpi, brāhmaṇa, gāvī vajjhā āghātanaṁ nīyamānā yaṁ yadeva pādaṁ uddharati, santikeva hoti vadhassa santikeva maraṇassa; evamevaṁ kho, brāhmaṇa, govajjhūpamaṁ jīvitaṁ manussānaṁ parittaṁ lahukaṁ bahudukkhaṁ bahupāyāsaṁ mantāyaṁ boddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇan’ti.(7)",
    "an7.74:9": "Tena kho pana, bhikkhave, samayena manussānaṁ saṭṭhivassasahassāni āyuppamāṇaṁ ahosi, pañcavassasatikā kumārikā alaṁpateyyā ahosi. Tena kho pana, bhikkhave, samayena manussānaṁ chaḷeva ābādhā ahesuṁ – sītaṁ, uṇhaṁ, jighacchā, pipāsā, uccāro, passāvo. So hi nāma, bhikkhave, arako satthā evaṁ dīghāyukesu manussesu evaṁ ciraṭṭhitikesu evaṁ appābādhesu sāvakānaṁ evaṁ dhammaṁ desessati:  ‘appakaṁ, brāhmaṇa, jīvitaṁ manussānaṁ parittaṁ lahukaṁ bahudukkhaṁ bahupāyāsaṁ mantāyaṁ boddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇan’ti.",
    "an7.74:10": "Etarahi taṁ, bhikkhave, sammā vadamāno vadeyya:  ‘appakaṁ jīvitaṁ manussānaṁ parittaṁ lahukaṁ bahudukkhaṁ bahupāyāsaṁ mantāyaṁ boddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇan’ti. Etarahi, bhikkhave, yo ciraṁ jīvati so vassasataṁ appaṁ vā bhiyyo. Vassasataṁ kho pana, bhikkhave, jīvanto tīṇiyeva utusatāni jīvati – utusataṁ hemantānaṁ, utusataṁ gimhānaṁ, utusataṁ vassānaṁ. Tīṇi kho pana, bhikkhave, utusatāni jīvanto dvādasayeva māsasatāni jīvati – cattāri māsasatāni hemantānaṁ, cattāri māsasatāni gimhānaṁ, cattāri māsasatāni vassānaṁ. Dvādasa kho pana, bhikkhave, māsasatāni jīvanto catuvīsatiyeva addhamāsasatāni jīvati – aṭṭhaddhamāsasatāni hemantānaṁ, aṭṭhaddhamāsasatāni gimhānaṁ, aṭṭhaddhamāsasatāni vassānaṁ.",
    "an7.74:11": "Tatrime bhattantarāyā kapimiddhopi bhattaṁ na bhuñjati, dukkhitopi bhattaṁ na bhuñjati, byādhitopi bhattaṁ na bhuñjati, uposathikopi bhattaṁ na bhuñjati, alābhakenapi bhattaṁ na bhuñjati.",
    "an7.74:12": "Hirīsūriyaṁ upamā,dhammaññū pārichattakaṁ;Sakkaccaṁ bhāvanā aggi,sunettaarakena cāti."
}