{
    "an7.6:1": "\"Sattimāni, bhikkhave, dhanāni. Katamāni satta? Saddhādhanaṁ, sīladhanaṁ, hirīdhanaṁ, ottappadhanaṁ, sutadhanaṁ, cāgadhanaṁ, paññādhanaṁ.",
    "an7.6:2": "Katamañca, bhikkhave, saddhādhanaṁ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṁ:  ‘itipi so bhagavā arahaṁ sammāsambuddho … pe … buddho bhagavā’ti. Idaṁ vuccati, bhikkhave, saddhādhanaṁ.(1)",
    "an7.6:3": "Katamañca, bhikkhave, sīladhanaṁ? Idha, bhikkhave, ariyasāvako pāṇātipātā paṭivirato hoti … pe … surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Idaṁ vuccati, bhikkhave, sīladhanaṁ.(2)",
    "an7.6:4": "Katamañca, bhikkhave, hirīdhanaṁ? Idha, bhikkhave, ariyasāvako hirīmā hoti, hirīyati kāyaduccaritena vacīduccaritena manoduccaritena, hirīyati pāpakānaṁ akusalānaṁ dhammānaṁ samāpattiyā. Idaṁ vuccati, bhikkhave, hirīdhanaṁ.(3)",
    "an7.6:5": "Katamañca, bhikkhave, ottappadhanaṁ? Idha, bhikkhave, ariyasāvako ottappī hoti, ottappati kāyaduccaritena vacīduccaritena manoduccaritena, ottappati pāpakānaṁ akusalānaṁ dhammānaṁ samāpattiyā. Idaṁ vuccati, bhikkhave, ottappadhanaṁ.(4)",
    "an7.6:6": "Katamañca, bhikkhave, sutadhanaṁ? Idha, bhikkhave, ariyasāvako bahussuto hoti sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ abhivadanti. Tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Idaṁ vuccati, bhikkhave, sutadhanaṁ.(5)",
    "an7.6:7": "Katamañca, bhikkhave, cāgadhanaṁ? Idha, bhikkhave, ariyasāvako vigatamalamaccherena cetasā agāraṁ ajjhāvasati muttacāgo payatapāṇi vosaggarato yācayogo dānasaṁvibhāgarato. Idaṁ vuccati, bhikkhave, cāgadhanaṁ.(6)",
    "an7.6:8": "Katamañca, bhikkhave, paññādhanaṁ? Idha, bhikkhave, ariyasāvako paññavā hoti … pe … sammā dukkhakkhayagāminiyā. Idaṁ vuccati, bhikkhave, paññādhanaṁ.(7)",
    "an7.6:9": "Imāni kho, bhikkhave, sattadhanānīti.",
    "an7.6:10": "Saddhādhanaṁ sīladhanaṁ,hirī ottappiyaṁ dhanaṁ;Sutadhanañca cāgo ca,paññā ve sattamaṁ dhanaṁ.",
    "an7.6:11": "Yassa ete dhanā atthi,itthiyā purisassa vā;Adaliddoti taṁ āhu,amoghaṁ tassa jīvitaṁ.",
    "an7.6:12": "Tasmā saddhañca sīlañca,pasādaṁ dhammadassanaṁ;Anuyuñjetha medhāvī,saraṁ buddhāna sāsanan\"ti."
}