{
    "an7.47:1": "Tena kho pana samayena uggatasarīrassa brāhmaṇassa mahāyañño upakkhaṭo hoti. Pañca usabhasatāni thūṇūpanītāni honti yaññatthāya, pañca vacchatarasatāni thūṇūpanītāni honti yaññatthāya, pañca vacchatarisatāni thūṇūpanītāni honti yaññatthāya, pañca ajasatāni thūṇūpanītāni honti yaññatthāya, pañca urabbhasatāni thūṇūpanītāni honti yaññatthāya.",
    "an7.47:2": "\"Sutaṁ metaṁ, bho gotama, aggissa ādānaṁ yūpassa ussāpanaṁ mahapphalaṁ hoti mahānisaṁsan\"ti.",
    "an7.47:3": "Evaṁ vutte āyasmā ānando uggatasarīraṁ brāhmaṇaṁ etadavoca:  \"na kho, brāhmaṇa, tathāgatā evaṁ pucchitabbā:  ‘sutaṁ metaṁ, bho gotama, aggissa ādānaṁ yūpassa ussāpanaṁ mahapphalaṁ hoti mahānisaṁsan’ti. Evaṁ kho, brāhmaṇa, tathāgatā pucchitabbā:  ‘ahañhi, bhante, aggiṁ ādātukāmo, yūpaṁ ussāpetukāmo. Ovadatu maṁ, bhante, bhagavā. Anusāsatu maṁ, bhante, bhagavā yaṁ mama assa dīgharattaṁ hitāya sukhāyā’\"ti.",
    "an7.47:4": "Atha kho uggatasarīro brāhmaṇo bhagavantaṁ etadavoca:  \"ahañhi, bho gotama, aggiṁ ādātukāmo yūpaṁ ussāpetukāmo. Ovadatu maṁ bhavaṁ gotamo. Anusāsatu maṁ bhavaṁ gotamo yaṁ mama assa dīgharattaṁ hitāya sukhāyā\"ti.",
    "an7.47:5": "\"Aggiṁ, brāhmaṇa, ādento yūpaṁ ussāpento pubbeva yaññā tīṇi satthāni ussāpeti akusalāni dukkhudrayāni dukkhavipākāni. Katamāni tīṇi? Kāyasatthaṁ, vacīsatthaṁ, manosatthaṁ.",
    "an7.47:6": "Puna caparaṁ, brāhmaṇa, aggiṁ ādento yūpaṁ ussāpento pubbeva yaññā evaṁ vācaṁ bhāsati:  ‘ettakā usabhā haññantu yaññatthāya, ettakā vacchatarā haññantu yaññatthāya, ettakā vacchatariyo haññantu yaññatthāya, ettakā ajā haññantu yaññatthāya, ettakā urabbhā haññantu yaññatthāyā’ti. So ‘puññaṁ karomī’ti apuññaṁ karoti, ‘kusalaṁ karomī’ti akusalaṁ karoti, ‘sugatiyā maggaṁ pariyesāmī’ti duggatiyā maggaṁ pariyesati. Aggiṁ, brāhmaṇa, ādento yūpaṁ ussāpento pubbeva yaññā idaṁ dutiyaṁ vacīsatthaṁ ussāpeti akusalaṁ dukkhudrayaṁ dukkhavipākaṁ.",
    "an7.47:7": "Puna caparaṁ, brāhmaṇa, aggiṁ ādento yūpaṁ ussāpento pubbeva yaññā sayaṁ paṭhamaṁ samārambhati usabhā hantuṁ yaññatthāya, sayaṁ paṭhamaṁ samārambhati vacchatarā hantuṁ yaññatthāya, sayaṁ paṭhamaṁ samārambhati vacchatariyo hantuṁ yaññatthāya, sayaṁ paṭhamaṁ samārambhati ajā hantuṁ yaññatthāya, sayaṁ paṭhamaṁ samārambhati urabbhā hantuṁ yaññatthāya. So ‘puññaṁ karomī’ti apuññaṁ karoti, ‘kusalaṁ karomī’ti akusalaṁ karoti, ‘sugatiyā maggaṁ pariyesāmī’ti duggatiyā maggaṁ pariyesati. Aggiṁ, brāhmaṇa, ādento yūpaṁ ussāpento pubbeva yaññā idaṁ tatiyaṁ kāyasatthaṁ ussāpeti akusalaṁ dukkhudrayaṁ dukkhavipākaṁ.",
    "an7.47:8": "Tayome, brāhmaṇa, aggī pahātabbā parivajjetabbā, na sevitabbā. Katame tayo? Rāgaggi, dosaggi, mohaggi.",
    "an7.47:9": "Kasmā cāyaṁ, brāhmaṇa, rāgaggi pahātabbo parivajjetabbo, na sevitabbo? Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā, vācāya duccaritaṁ caritvā, manasā duccaritaṁ caritvā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Tasmāyaṁ rāgaggi pahātabbo parivajjetabbo, na sevitabbo.",
    "an7.47:10": "Kasmā cāyaṁ, brāhmaṇa, dosaggi pahātabbo parivajjetabbo, na sevitabbo? Duṭṭho kho, brāhmaṇa, dosena abhibhūto pariyādinnacitto kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā, vācāya duccaritaṁ caritvā, manasā duccaritaṁ caritvā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Tasmāyaṁ dosaggi pahātabbo parivajjetabbo, na sevitabbo.",
    "an7.47:11": "Kasmā cāyaṁ, brāhmaṇa, mohaggi pahātabbo parivajjetabbo, na sevitabbo? Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā, vācāya duccaritaṁ caritvā, manasā duccaritaṁ caritvā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati. Tasmāyaṁ mohaggi pahātabbo parivajjetabbo, na sevitabbo.",
    "an7.47:12": "Tayo kho, brāhmaṇa, aggī sakkatvā garuṁ katvā mānetvā pūjetvā sammā sukhaṁ parihātabbā. Katame tayo? Āhuneyyaggi, gahapataggi, dakkhiṇeyyaggi.",
    "an7.47:13": "Katamo ca, brāhmaṇa, āhuneyyaggi? Idha, brāhmaṇa, yassa te honti mātāti vā pitāti vā, ayaṁ vuccati, brāhmaṇa, āhuneyyaggi. Taṁ kissa hetu? Atohayaṁ, brāhmaṇa, āhuto sambhūto, tasmāyaṁ āhuneyyaggi sakkatvā garuṁ katvā mānetvā pūjetvā sammā sukhaṁ parihātabbo.",
    "an7.47:14": "Katamo ca, brāhmaṇa, gahapataggi? Idha, brāhmaṇa, yassa te honti puttāti vā dārāti vā dāsāti vā pessāti vā kammakarāti vā, ayaṁ vuccati, brāhmaṇa, gahapataggi. Tasmāyaṁ gahapataggi sakkatvā garuṁ katvā mānetvā pūjetvā sammā sukhaṁ parihātabbo.",
    "an7.47:15": "Katamo ca, brāhmaṇa, dakkhiṇeyyaggi? Idha, brāhmaṇa, ye te samaṇabrāhmaṇā parappavādā paṭiviratā khantisoracce niviṭṭhā ekamattānaṁ damenti, ekamattānaṁ samenti, ekamattānaṁ parinibbāpenti, ayaṁ vuccati, brāhmaṇa, dakkhiṇeyyaggi. Tasmāyaṁ dakkhiṇeyyaggi sakkatvā garuṁ katvā mānetvā pūjetvā sammā sukhaṁ parihātabbo.",
    "an7.47:16": "Ayaṁ kho pana, brāhmaṇa, kaṭṭhaggi kālena kālaṁ ujjaletabbo, kālena kālaṁ ajjhupekkhitabbo, kālena kālaṁ nibbāpetabbo, kālena kālaṁ nikkhipitabbo\"ti.",
    "an7.47:17": "Evaṁ vutte, uggatasarīro brāhmaṇo bhagavantaṁ etadavoca:  \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatanti. Esāhaṁ, bho gotama, pañca usabhasatāni muñcāmi jīvitaṁ demi, pañca vacchatarasatāni muñcāmi jīvitaṁ demi, pañca vacchatarisatāni muñcāmi jīvitaṁ demi, pañca ajasatāni muñcāmi jīvitaṁ demi, pañca urabbhasatāni muñcāmi jīvitaṁ demi. Haritāni ceva tiṇāni khādantu, sītāni ca pānīyāni pivantu, sīto ca nesaṁ vāto upavāyatan\"ti."
}