{
    "an7.43:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā kosambiyaṁ viharati ghositārāme. Atha kho āyasmā ānando pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya kosambiṁ piṇḍāya pāvisi. Atha kho āyasmato ānandassa etadahosi:  \"atippago kho tāva kosambiyaṁ piṇḍāya carituṁ. Yannūnāhaṁ yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkameyyan\"ti.",
    "an7.43:2": "Tena kho pana samayena tesaṁ aññatitthiyānaṁ paribbājakānaṁ sannisinnānaṁ sannipatitānaṁ ayamantarākathā udapādi:  \"yo hi koci, āvuso, dvādasavassāni paripuṇṇaṁ parisuddhaṁ brahmacariyaṁ carati, ‘niddaso bhikkhū’ti alaṁvacanāyā\"ti.",
    "an7.43:3": "Atha kho āyasmā ānando tesaṁ aññatitthiyānaṁ paribbājakānaṁ bhāsitaṁ neva abhinandi nappaṭikkosi. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkāmi:  \"Bhagavato santike etassa bhāsitassa atthaṁ ājānissāmī\"ti.",
    "an7.43:4": "\"Idhāhaṁ, bhante, pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya kosambiṁ piṇḍāya pāvisiṁ. Tassa mayhaṁ, bhante, etadahosi:  ‘atippago kho tāva kosambiyaṁ piṇḍāya carituṁ. Yannūnāhaṁ yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkameyyan’ti … pe … tehi saddhiṁ sammodiṁ. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁ.",
    "an7.43:5": "Tena kho pana, bhante, samayena tesaṁ aññatitthiyānaṁ paribbājakānaṁ sannisinnānaṁ sannipatitānaṁ ayamantarākathā udapādi:  ‘yo hi koci, āvuso, dvādasavassāni paripuṇṇaṁ parisuddhaṁ brahmacariyaṁ carati, niddaso bhikkhūti alaṁvacanāyā’ti. Atha khvāhaṁ, bhante, tesaṁ aññatitthiyānaṁ paribbājakānaṁ bhāsitaṁ neva abhinandiṁ nappaṭikkosiṁ. Anabhinanditvā, appaṭikkositvā uṭṭhāyāsanā pakkamiṁ:  ‘bhagavato santike etassa bhāsitassa atthaṁ ājānissāmī’ti. Sakkā nu kho, bhante, imasmiṁ dhammavinaye kevalaṁ vassagaṇanamattena niddaso bhikkhu paññāpetun\"ti?",
    "an7.43:6": "\"Na kho, ānanda, sakkā imasmiṁ dhammavinaye kevalaṁ vassagaṇanamattena niddaso bhikkhu paññāpetuṁ. Satta kho imāni, ānanda, niddasavatthūni mayā sayaṁ abhiññā sacchikatvā paveditāni.",
    "an7.43:7": "Katamāni satta? Idhānanda, bhikkhu, saddho hoti, hirīmā hoti, ottappī hoti, bahussuto hoti, āraddhavīriyo hoti, satimā hoti, paññavā hoti. Imāni kho, ānanda, satta niddasavatthūni mayā sayaṁ abhiññā sacchikatvā paveditāni.",
    "an7.43:8": "Appamādo hirī ceva,dve suvacā duve mittā;Dve paṭisambhidā dve vasā,duve niddasavatthunāti."
}