{
    "an7.71:1": "\"Bhāvanaṁ ananuyuttassa, bhikkhave, bhikkhuno viharato kiñcāpi evaṁ icchā uppajjeyya:  ‘aho vata me anupādāya āsavehi cittaṁ vimucceyyā’ti, atha khvassa neva anupādāya āsavehi cittaṁ vimuccati. Taṁ kissa hetu? ‘Abhāvitattā’tissa vacanīyaṁ. Kissa abhāvitattā? Catunnaṁ satipaṭṭhānānaṁ, catunnaṁ sammappadhānānaṁ, catunnaṁ iddhipādānaṁ, pañcannaṁ indriyānaṁ, pañcannaṁ balānaṁ, sattannaṁ bojjhaṅgānaṁ, ariyassa aṭṭhaṅgikassa maggassa.",
    "an7.71:2": "Seyyathāpi, bhikkhave, kukkuṭiyā aṇḍāni aṭṭha vā dasa vā dvādasa vā. Tānassu kukkuṭiyā na sammā adhisayitāni, na sammā pariseditāni, na sammā paribhāvitāni. Kiñcāpi tassā kukkuṭiyā evaṁ icchā uppajjeyya:  ‘aho vata me kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṁ padāletvā sotthinā abhinibbhijjeyyun’ti, atha kho abhabbāva te kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṁ padāletvā sotthinā abhinibbhijjituṁ. Taṁ kissa hetu? Tathā hi, bhikkhave, kukkuṭiyā aṇḍāni na sammā adhisayitāni, na sammā pariseditāni, na sammā paribhāvitāni.",
    "an7.71:3": "Bhāvanaṁ anuyuttassa, bhikkhave, bhikkhuno viharato kiñcāpi na evaṁ icchā uppajjeyya:  ‘aho vata me anupādāya āsavehi cittaṁ vimucceyyā’ti, atha khvassa anupādāya āsavehi cittaṁ vimuccati. Taṁ kissa hetu? ‘Bhāvitattā’tissa vacanīyaṁ. Kissa bhāvitattā? Catunnaṁ satipaṭṭhānānaṁ, catunnaṁ sammappadhānānaṁ, catunnaṁ iddhipādānaṁ, pañcannaṁ indriyānaṁ, pañcannaṁ balānaṁ, sattannaṁ bojjhaṅgānaṁ, ariyassa aṭṭhaṅgikassa maggassa.",
    "an7.71:4": "Seyyathāpi, bhikkhave, kukkuṭiyā aṇḍāni aṭṭha vā dasa vā dvādasa vā. Tānassu kukkuṭiyā sammā adhisayitāni, sammā pariseditāni, sammā paribhāvitāni. Kiñcāpi tassā kukkuṭiyā na evaṁ icchā uppajjeyya:  ‘aho vata me kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṁ padāletvā sotthinā abhinibbhijjeyyun’ti, atha kho bhabbāva te kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṁ padāletvā sotthinā abhinibbhijjituṁ. Taṁ kissa hetu? Tathā hi, bhikkhave, kukkuṭiyā aṇḍāni sammā adhisayitāni, sammā pariseditāni, sammā paribhāvitāni.",
    "an7.71:5": "Seyyathāpi, bhikkhave, phalagaṇḍassa vā phalagaṇḍantevāsikassa vā dissanteva vāsijaṭe aṅgulipadāni dissati aṅguṭṭhapadaṁ. No ca khvassa evaṁ ñāṇaṁ hoti:  ‘ettakaṁ me ajja vāsijaṭassa khīṇaṁ, ettakaṁ hiyyo, ettakaṁ pare’ti, atha khvassa khīṇe ‘khīṇan’teva ñāṇaṁ hoti. Evamevaṁ kho, bhikkhave, bhāvanaṁ anuyuttassa bhikkhuno viharato kiñcāpi na evaṁ ñāṇaṁ hoti:  ‘ettakaṁ me ajja āsavānaṁ khīṇaṁ, ettakaṁ hiyyo, ettakaṁ pare’ti, atha khvassa khīṇe ‘khīṇan’teva ñāṇaṁ hoti.",
    "an7.71:6": "Seyyathāpi, bhikkhave, sāmuddikāya nāvāya vettabandhanabaddhāya cha māsāni udake pariyādāya hemantikena thale ukkhittāya vātātapaparetāni bandhanāni, tāni pāvussakena meghena abhippavuṭṭhāni appakasireneva parihāyanti, pūtikāni bhavanti. Evamevaṁ kho, bhikkhave, bhāvanaṁ anuyuttassa bhikkhuno viharato appakasireneva saṁyojanāni paṭippassambhanti, pūtikāni bhavantī\"ti."
}