{
    "an7.66:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā vesāliyaṁ viharati ambapālivane. Tatra kho bhagavā bhikkhū āmantesi:  \"bhikkhavo\"ti.",
    "an7.66:2": "\"Aniccā, bhikkhave, saṅkhārā; adhuvā, bhikkhave, saṅkhārā; anassāsikā, bhikkhave, saṅkhārā. Yāvañcidaṁ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṁ alaṁ virajjituṁ alaṁ vimuccituṁ.",
    "an7.66:3": "Sineru, bhikkhave, pabbatarājā caturāsītiyojanasahassāni āyāmena, caturāsītiyojanasahassāni vitthārena, caturāsītiyojanasahassāni mahāsamudde ajjhogāḷho, caturāsītiyojanasahassāni mahāsamuddā accuggato.",
    "an7.66:4": "Hoti kho so, bhikkhave, samayo yaṁ kadāci karahaci dīghassa addhuno accayena dutiyo sūriyo pātubhavati. Dutiyassa, bhikkhave, sūriyassa pātubhāvā yā kāci kunnadiyo kusobbhā tā ussussanti visussanti, na bhavanti. Evaṁ aniccā, bhikkhave, saṅkhārā … pe … alaṁ vimuccituṁ.(2)",
    "an7.66:5": "Hoti kho so, bhikkhave, samayo yaṁ kadāci karahaci dīghassa addhuno accayena tatiyo sūriyo pātubhavati. Tatiyassa, bhikkhave, sūriyassa pātubhāvā yā kāci mahānadiyo, seyyathidaṁ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, tā ussussanti visussanti, na bhavanti. Evaṁ aniccā, bhikkhave, saṅkhārā … pe … alaṁ vimuccituṁ.(3)",
    "an7.66:6": "Hoti kho so, bhikkhave, samayo yaṁ kadāci karahaci dīghassa addhuno accayena catuttho sūriyo pātubhavati. Catutthassa, bhikkhave, sūriyassa pātubhāvā ye te mahāsarā yato imā mahānadiyo pavattanti, seyyathidaṁ – anotattā, sīhapapātā, rathakārā, kaṇṇamuṇḍā, kuṇālā, chaddantā, mandākiniyā, tā ussussanti visussanti, na bhavanti. Evaṁ aniccā, bhikkhave, saṅkhārā … pe … alaṁ vimuccituṁ.(4)",
    "an7.66:7": "Hoti kho so, bhikkhave, samayo yaṁ kadāci karahaci dīghassa addhuno accayena pañcamo sūriyo pātubhavati. Pañcamassa, bhikkhave, sūriyassa pātubhāvā yojanasatikānipi mahāsamudde udakāni ogacchanti, dviyojanasatikānipi mahāsamudde udakāni ogacchanti, tiyojanasatikānipi, catuyojanasatikānipi, pañcayojanasatikānipi, chayojanasatikānipi, sattayojanasatikānipi mahāsamudde udakāni ogacchanti; sattatālampi mahāsamudde udakaṁ saṇṭhāti, chatālampi, pañcatālampi, catutālampi, titālampi, dvitālampi, tālamattampi mahāsamudde udakaṁ saṇṭhāti; sattaporisampi mahāsamudde udakaṁ saṇṭhāti, chaporisampi, pañcaporisampi, catuporisampi, tiporisampi, dviporisampi, porisampi, aḍḍhaporisampi, kaṭimattampi, jaṇṇukāmattampi, gopphakamattampi mahāsamudde udakaṁ saṇṭhāti. Seyyathāpi, bhikkhave, saradasamaye thullaphusitake deve vassante tattha tattha gopadesu udakāni ṭhitāni honti; evamevaṁ kho, bhikkhave, tattha tattha gopphakamattāni mahāsamudde udakāni ṭhitāni honti. Pañcamassa, bhikkhave, sūriyassa pātubhāvā aṅgulipabbamattampi mahāsamudde udakaṁ na hoti. Evaṁ aniccā, bhikkhave, saṅkhārā … pe … alaṁ vimuccituṁ.(5)",
    "an7.66:8": "Hoti kho so, bhikkhave, samayo yaṁ kadāci karahaci dīghassa addhuno accayena chaṭṭho sūriyo pātubhavati. Chaṭṭhassa, bhikkhave, sūriyassa pātubhāvā ayañca mahāpathavī sineru ca pabbatarājā dhūmāyanti sandhūmāyanti sampadhūmāyanti. Seyyathāpi, bhikkhave, kumbhakārapāko ālepito paṭhamaṁ dhūmeti sandhūmeti sampadhūmeti; evamevaṁ kho, bhikkhave, chaṭṭhassa sūriyassa pātubhāvā ayañca mahāpathavī sineru ca pabbatarājā dhūmāyanti sandhūmāyanti sampadhūmāyanti. Evaṁ aniccā, bhikkhave, saṅkhārā … pe … alaṁ vimuccituṁ.(6)",
    "an7.66:9": "Hoti kho so, bhikkhave, samayo yaṁ kadāci karahaci dīghassa addhuno accayena sattamo sūriyo pātubhavati. Sattamassa, bhikkhave, sūriyassa pātubhāvā ayañca mahāpathavī sineru ca pabbatarājā ādippanti pajjalanti ekajālā bhavanti. Imissā ca, bhikkhave, mahāpathaviyā sinerussa ca pabbatarājassa jhāyamānānaṁ dayhamānānaṁ acci vātena khittā yāva brahmalokāpi gacchati. Sinerussa, bhikkhave, pabbatarājassa jhāyamānassa dayhamānassa vinassamānassa mahatā tejokhandhena abhibhūtassa yojanasatikānipi kūṭāni palujjanti dviyojanasatikānipi, tiyojanasatikānipi, catuyojanasatikānipi, pañcayojanasatikānipi kūṭāni palujjanti.",
    "an7.66:10": "Tatra, bhikkhave, ko mantā ko saddhātā:  ‘ayañca pathavī sineru ca pabbatarājā dayhissanti vinassissanti, na bhavissantī’ti aññatra diṭṭhapadehi?",
    "an7.66:11": "Bhūtapubbaṁ, bhikkhave, sunetto nāma satthā ahosi titthakaro kāmesu vītarāgo. Sunettassa kho pana, bhikkhave, satthuno anekāni sāvakasatāni ahesuṁ. Sunetto, bhikkhave, satthā sāvakānaṁ brahmalokasahabyatāya dhammaṁ desesi. Ye kho pana, bhikkhave, sunettassa satthuno brahmalokasahabyatāya dhammaṁ desentassa sabbena sabbaṁ sāsanaṁ ājāniṁsu te kāyassa bhedā paraṁ maraṇā sugatiṁ brahmalokaṁ upapajjiṁsu. Ye na sabbena sabbaṁ sāsanaṁ ājāniṁsu te kāyassa bhedā paraṁ maraṇā appekacce paranimmitavasavattīnaṁ devānaṁ sahabyataṁ upapajjiṁsu, appekacce nimmānaratīnaṁ devānaṁ sahabyataṁ upapajjiṁsu, appekacce tusitānaṁ devānaṁ sahabyataṁ upapajjiṁsu, appekacce yāmānaṁ devānaṁ sahabyataṁ upapajjiṁsu, appekacce tāvatiṁsānaṁ devānaṁ sahabyataṁ upapajjiṁsu, appekacce cātumahārājikānaṁ devānaṁ sahabyataṁ upapajjiṁsu, appekacce khattiyamahāsālānaṁ sahabyataṁ upapajjiṁsu, appekacce brāhmaṇamahāsālānaṁ sahabyataṁ upapajjiṁsu, appekacce gahapatimahāsālānaṁ sahabyataṁ upapajjiṁsu.",
    "an7.66:12": "Atha kho, bhikkhave, sunettassa satthuno etadahosi:  ‘Na kho metaṁ patirūpaṁ yohaṁ sāvakānaṁ samasamagatiyo assaṁ abhisamparāyaṁ, yannūnāhaṁ uttari mettaṁ bhāveyyan’ti.",
    "an7.66:13": "Atha kho, bhikkhave, sunetto satthā satta vassāni mettaṁ cittaṁ bhāvesi. Satta vassāni mettaṁ cittaṁ bhāvetvā satta saṁvaṭṭavivaṭṭakappe nayimaṁ lokaṁ punarāgamāsi. Saṁvaṭṭamāne sudaṁ, bhikkhave, loke ābhassarūpago hoti. Vivaṭṭamāne loke suññaṁ brahmavimānaṁ upapajjati.",
    "an7.66:14": "Taṁ kissa hetu? Catunnaṁ dhammānaṁ ananubodhā appaṭivedhā. Katamesaṁ catunnaṁ? Ariyassa, bhikkhave, sīlassa ananubodhā appaṭivedhā, ariyassa samādhissa ananubodhā appaṭivedhā, ariyāya paññāya ananubodhā appaṭivedhā, ariyāya vimuttiyā ananubodhā appaṭivedhā.",
    "an7.66:15": "\"Sīlaṁ samādhi paññā ca,vimutti ca anuttarā;Anubuddhā ime dhammā,gotamena yasassinā.",
    "an7.66:16": "Iti buddho abhiññāya,dhammamakkhāsi bhikkhunaṁ;Dukkhassantakaro satthā,cakkhumā parinibbuto\"ti."
}