{
    "an7.67:1": "\"Yato kho, bhikkhave, rañño paccantimaṁ nagaraṁ sattahi nagaraparikkhārehi suparikkhataṁ hoti, catunnañca āhārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī. Idaṁ vuccati, bhikkhave, rañño paccantimaṁ nagaraṁ akaraṇīyaṁ bāhirehi paccatthikehi paccāmittehi.",
    "an7.67:2": "Katamehi sattahi nagaraparikkhārehi suparikkhataṁ hoti?",
    "an7.67:3": "Puna caparaṁ, bhikkhave, rañño paccantime nagare parikkhā hoti gambhīrā ceva vitthatā ca. Iminā dutiyena nagaraparikkhārena suparikkhataṁ hoti rañño paccantimaṁ nagaraṁ abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya.(2)",
    "an7.67:4": "Puna caparaṁ, bhikkhave, rañño paccantime nagare anupariyāyapatho hoti ucco ceva vitthato ca. Iminā tatiyena nagaraparikkhārena suparikkhataṁ hoti rañño paccantimaṁ nagaraṁ abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya.(3)",
    "an7.67:5": "Puna caparaṁ, bhikkhave, rañño paccantime nagare bahuṁ āvudhaṁ sannicitaṁ hoti salākañceva jevanikañca. Iminā catutthena nagaraparikkhārena suparikkhataṁ hoti rañño paccantimaṁ nagaraṁ abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya.(4)",
    "an7.67:6": "Puna caparaṁ, bhikkhave, rañño paccantime nagare bahubalakāyo paṭivasati, seyyathidaṁ – hatthārohā assārohā rathikā dhanuggahā celakā calakā piṇḍadāyakā uggā rājaputtā pakkhandino mahānāgā sūrā cammayodhino dāsakaputtā. Iminā pañcamena nagaraparikkhārena suparikkhataṁ hoti rañño paccantimaṁ nagaraṁ abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya.(5)",
    "an7.67:7": "Puna caparaṁ, bhikkhave, rañño paccantime nagare dovāriko hoti paṇḍito byatto medhāvī aññātānaṁ nivāretā ñātānaṁ pavesetā. Iminā chaṭṭhena nagaraparikkhārena suparikkhataṁ hoti rañño paccantimaṁ nagaraṁ abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya.(6)",
    "an7.67:8": "Puna caparaṁ, bhikkhave, rañño paccantime nagare pākāro hoti ucco ceva vitthato ca vāsanalepanasampanno ca. Iminā sattamena nagaraparikkhārena suparikkhataṁ hoti rañño paccantimaṁ nagaraṁ abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya.",
    "an7.67:9": "Katamesaṁ catunnaṁ āhārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī?",
    "an7.67:10": "Puna caparaṁ, bhikkhave, rañño paccantime nagare bahuṁ sāliyavakaṁ sannicitaṁ hoti abbhantarānaṁ ratiyā aparitassāya phāsuvihārāya bāhirānaṁ paṭighātāya.(2)",
    "an7.67:11": "Puna caparaṁ, bhikkhave, rañño paccantime nagare bahuṁ tilamuggamāsāparaṇṇaṁ sannicitaṁ hoti abbhantarānaṁ ratiyā aparitassāya phāsuvihārāya bāhirānaṁ paṭighātāya.(3)",
    "an7.67:12": "Puna caparaṁ, bhikkhave, rañño paccantime nagare bahuṁ bhesajjaṁ sannicitaṁ hoti, seyyathidaṁ – sappi navanītaṁ telaṁ madhu phāṇitaṁ loṇaṁ abbhantarānaṁ ratiyā aparitassāya phāsuvihārāya bāhirānaṁ paṭighātāya.",
    "an7.67:13": "Yato kho, bhikkhave, rañño paccantimaṁ nagaraṁ imehi sattahi nagaraparikkhārehi suparikkhataṁ hoti, imesañca catunnaṁ āhārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī. Idaṁ vuccati, bhikkhave, rañño paccantimaṁ nagaraṁ akaraṇīyaṁ bāhirehi paccatthikehi paccāmittehi.",
    "an7.67:14": "Seyyathāpi, bhikkhave, rañño paccantime nagare esikā hoti gambhīranemā sunikhātā acalā asampavedhī abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya. Evamevaṁ kho, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṁ ‘itipi so … pe … buddho bhagavā’ti. Saddhesiko, bhikkhave, ariyasāvako akusalaṁ pajahati, kusalaṁ bhāveti; sāvajjaṁ pajahati, anavajjaṁ bhāveti; suddhaṁ attānaṁ pariharati. Iminā paṭhamena saddhammena samannāgato hoti.(1)",
    "an7.67:15": "Seyyathāpi, bhikkhave, rañño paccantime nagare parikkhā hoti gambhīrā ceva vitthatā ca abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya. Evamevaṁ kho, bhikkhave, ariyasāvako hirīmā hoti, hirīyati kāyaduccaritena vacīduccaritena manoduccaritena, hirīyati pāpakānaṁ akusalānaṁ dhammānaṁ samāpattiyā. Hirīparikkho kho, bhikkhave, ariyasāvako akusalaṁ pajahati, kusalaṁ bhāveti; sāvajjaṁ pajahati, anavajjaṁ bhāveti; suddhaṁ attānaṁ pariharati. Iminā dutiyena saddhammena samannāgato hoti.(2)",
    "an7.67:16": "Seyyathāpi, bhikkhave, rañño paccantime nagare anupariyāyapatho hoti ucco ceva vitthato ca abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya. Evamevaṁ, kho, bhikkhave, ariyasāvako ottappī hoti, ottappati kāyaduccaritena vacīduccaritena manoduccaritena, ottappati pāpakānaṁ akusalānaṁ dhammānaṁ samāpattiyā. Ottappapariyāyapatho, bhikkhave, ariyasāvako akusalaṁ pajahati, kusalaṁ bhāveti; sāvajjaṁ pajahati, anavajjaṁ bhāveti; suddhaṁ attānaṁ pariharati. Iminā tatiyena saddhammena samannāgato hoti.(3)",
    "an7.67:17": "Seyyathāpi, bhikkhave, rañño paccantime nagare bahuṁ āvudhaṁ sannicitaṁ hoti salākañceva jevanikañca abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya. Evamevaṁ kho, bhikkhave, ariyasāvako bahussuto hoti … pe … diṭṭhiyā suppaṭividdhā. Sutāvudho, bhikkhave, ariyasāvako akusalaṁ pajahati, kusalaṁ bhāveti; sāvajjaṁ pajahati, anavajjaṁ bhāveti; suddhaṁ attānaṁ pariharati. Iminā catutthena saddhammena samannāgato hoti.(4)",
    "an7.67:18": "Seyyathāpi, bhikkhave, rañño paccantime nagare bahubalakāyo paṭivasati, seyyathidaṁ – hatthārohā assārohā rathikā dhanuggahā celakā calakā piṇḍadāyakā uggā rājaputtā pakkhandino mahānāgā sūrā cammayodhino dāsakaputtā abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya. Evamevaṁ kho, bhikkhave, ariyasāvako āraddhavīriyo viharati akusalānaṁ dhammānaṁ pahānāya, kusalānaṁ dhammānaṁ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Vīriyabalakāyo, bhikkhave, ariyasāvako akusalaṁ pajahati, kusalaṁ bhāveti; sāvajjaṁ pajahati, anavajjaṁ bhāveti; suddhaṁ attānaṁ pariharati. Iminā pañcamena saddhammena samannāgato hoti.(5)",
    "an7.67:19": "Seyyathāpi, bhikkhave, rañño paccantime nagare dovāriko hoti paṇḍito byatto medhāvī aññātānaṁ nivāretā ñātānaṁ pavesetā abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya. Evamevaṁ kho, bhikkhave, ariyasāvako satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā. Satidovāriko, bhikkhave, ariyasāvako akusalaṁ pajahati, kusalaṁ bhāveti; sāvajjaṁ pajahati, anavajjaṁ bhāveti; suddhaṁ attānaṁ pariharati. Iminā chaṭṭhena saddhammena samannāgato hoti.(6)",
    "an7.67:20": "Seyyathāpi, bhikkhave, rañño paccantime nagare pākāro hoti ucco ceva vitthato ca vāsanalepanasampanno ca abbhantarānaṁ guttiyā bāhirānaṁ paṭighātāya. Evamevaṁ kho, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Paññāvāsanalepanasampanno, bhikkhave, ariyasāvako akusalaṁ pajahati, kusalaṁ bhāveti; sāvajjaṁ pajahati, anavajjaṁ bhāveti; suddhaṁ attānaṁ pariharati. Iminā sattamena saddhammena samannāgato hoti.",
    "an7.67:21": "Katamesaṁ catunnaṁ jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī?",
    "an7.67:22": "Seyyathāpi, bhikkhave, rañño paccantime nagare bahuṁ sāliyavakaṁ sannicitaṁ hoti abbhantarānaṁ ratiyā aparitassāya phāsuvihārāya bāhirānaṁ paṭighātāya. Evamevaṁ kho, bhikkhave, ariyasāvako vitakkavicārānaṁ vūpasamā … pe … dutiyaṁ jhānaṁ upasampajja viharati attano ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa.(2)",
    "an7.67:23": "Seyyathāpi, bhikkhave, rañño paccantime nagare bahuṁ tilamuggamāsāparaṇṇaṁ sannicitaṁ hoti abbhantarānaṁ ratiyā aparitassāya phāsuvihārāya bāhirānaṁ paṭighātāya. Evamevaṁ kho, bhikkhave, ariyasāvako pītiyā ca virāgā … pe … tatiyaṁ jhānaṁ upasampajja viharati attano ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa.(3)",
    "an7.67:24": "Seyyathāpi, bhikkhave, rañño paccantime nagare bahuṁ bhesajjaṁ sannicitaṁ hoti, seyyathidaṁ – sappi navanītaṁ telaṁ madhu phāṇitaṁ loṇaṁ abbhantarānaṁ ratiyā aparitassāya phāsuvihārāya bāhirānaṁ paṭighātāya. Evamevaṁ kho, bhikkhave, ariyasāvako sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati attano ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa.",
    "an7.67:25": "Yato kho, bhikkhave, ariyasāvako imehi sattahi saddhammehi samannāgato hoti, imesañca catunnaṁ jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī. Ayaṁ vuccati, bhikkhave, ariyasāvako akaraṇīyo mārassa akaraṇīyo pāpimato\"ti."
}