{
    "an7.4:1": "\"Sattimāni, bhikkhave, balāni. Katamāni satta? Saddhābalaṁ, vīriyabalaṁ, hirībalaṁ, ottappabalaṁ, satibalaṁ, samādhibalaṁ, paññābalaṁ.",
    "an7.4:2": "Katamañca, bhikkhave, saddhābalaṁ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṁ:  ‘itipi so bhagavā arahaṁ sammāsambuddho … pe … satthā devamanussānaṁ buddho bhagavā’ti. Idaṁ vuccati, bhikkhave, saddhābalaṁ.(1)",
    "an7.4:3": "Katamañca, bhikkhave, vīriyabalaṁ? Idha, bhikkhave, ariyasāvako āraddhavīriyo viharati akusalānaṁ dhammānaṁ pahānāya, kusalānaṁ dhammānaṁ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Idaṁ vuccati, bhikkhave, vīriyabalaṁ.(2)",
    "an7.4:4": "Katamañca, bhikkhave, hirībalaṁ? Idha, bhikkhave, ariyasāvako hirīmā hoti, hirīyati kāyaduccaritena vacīduccaritena manoduccaritena, hirīyati pāpakānaṁ akusalānaṁ dhammānaṁ samāpattiyā. Idaṁ vuccati, bhikkhave, hirībalaṁ.(3)",
    "an7.4:5": "Katamañca, bhikkhave, ottappabalaṁ? Idha, bhikkhave, ariyasāvako ottappī hoti, ottappati kāyaduccaritena vacīduccaritena manoduccaritena, ottappati pāpakānaṁ akusalānaṁ dhammānaṁ samāpattiyā. Idaṁ vuccati, bhikkhave, ottappabalaṁ.(4)",
    "an7.4:6": "Katamañca, bhikkhave, satibalaṁ? Idha, bhikkhave, ariyasāvako satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā. Idaṁ vuccati, bhikkhave, satibalaṁ.(5)",
    "an7.4:7": "Katamañca, bhikkhave, samādhibalaṁ? Idha, bhikkhave, ariyasāvako vivicceva kāmehi … pe … catutthaṁ jhānaṁ upasampajja viharati. Idaṁ vuccati, bhikkhave, samādhibalaṁ.(6)",
    "an7.4:8": "Katamañca, bhikkhave, paññābalaṁ? Idha, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Idaṁ vuccati, bhikkhave, paññābalaṁ.(7)",
    "an7.4:9": "Imāni kho, bhikkhave, satta balānīti.",
    "an7.4:10": "Saddhābalaṁ vīriyañca,hirī ottappiyaṁ balaṁ;Satibalaṁ samādhi ca,paññā ve sattamaṁ balaṁ;Etehi balavā bhikkhu,sukhaṁ jīvati paṇḍito.",
    "an7.4:11": "Yoniso vicine dhammaṁ,paññāyatthaṁ vipassati;Pajjotasseva nibbānaṁ,vimokkho hoti cetaso\"ti."
}