{
    "an7.22:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena rājā māgadho ajātasattu vedehiputto vajjī abhiyātukāmo hoti. So evamāha:  \"ahaṁ hime vajjī evaṁmahiddhike evaṁmahānubhāve ucchecchāmi, vajjī vināsessāmi, vajjī anayabyasanaṁ āpādessāmī\"ti.",
    "an7.22:2": "Atha kho rājā māgadho ajātasattu vedehiputto vassakāraṁ brāhmaṇaṁ māgadhamahāmattaṁ āmantesi:  \"ehi tvaṁ, brāhmaṇa, yena bhagavā tenupasaṅkama; upasaṅkamitvā mama vacanena bhagavato pāde sirasā vandāhi, appābādhaṁ appātaṅkaṁ lahuṭṭhānaṁ balaṁ phāsuvihāraṁ puccha:  ‘rājā, bhante, māgadho ajātasattu vedehiputto bhagavato pāde sirasā vandati, appābādhaṁ appātaṅkaṁ lahuṭṭhānaṁ balaṁ phāsuvihāraṁ pucchatī’ti. Evañca vadehi:  ‘rājā, bhante, māgadho ajātasattu vedehiputto vajjī abhiyātukāmo. So evamāha – ahaṁ hime vajjī evaṁmahiddhike evaṁmahānubhāve ucchecchāmi, vajjī vināsessāmi, vajjī anayabyasanaṁ āpādessāmī’ti. Yathā te bhagavā byākaroti, taṁ sādhukaṁ uggahetvā mama āroceyyāsi. Na hi tathāgatā vitathaṁ bhaṇantī\"ti.",
    "an7.22:3": "\"Evaṁ, bho\"ti kho vassakāro brāhmaṇo māgadhamahāmatto rañño māgadhassa ajātasattussa vedehiputtassa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho vassakāro brāhmaṇo māgadhamahāmatto bhagavantaṁ etadavoca:",
    "an7.22:4": "Tena kho pana samayena āyasmā ānando bhagavato piṭṭhito ṭhito hoti bhagavantaṁ bījayamāno. Atha kho bhagavā āyasmantaṁ ānandaṁ āmantesi:",
    "an7.22:5": "Kinti te, ānanda, sutaṁ:  ‘vajjī samaggā sannipatanti, samaggā vuṭṭhahanti, samaggā vajjikaraṇīyāni karontī’\"ti?",
    "an7.22:6": "Kinti te, ānanda, sutaṁ:  ‘vajjī apaññattaṁ na paññāpenti, paññattaṁ na samucchindanti, yathāpaññatte porāṇe vajjidhamme samādāya vattantī’\"ti?",
    "an7.22:7": "Kinti te, ānanda, sutaṁ:  ‘vajjī ye te vajjīnaṁ vajjimahallakā te sakkaronti garuṁ karonti mānenti pūjenti, tesañca sotabbaṁ maññantī’\"ti?",
    "an7.22:8": "Kinti te, ānanda, sutaṁ:  ‘vajjī yā tā kulitthiyo kulakumāriyo tā na okassa pasayha vāsentī’\"ti?",
    "an7.22:9": "Kinti te, ānanda, sutaṁ:  ‘vajjī yāni tāni vajjīnaṁ vajjicetiyāni abbhantarāni ceva bāhirāni ca tāni sakkaronti garuṁ karonti mānenti pūjenti, tesañca dinnapubbaṁ katapubbaṁ dhammikaṁ baliṁ no parihāpentī’\"ti?",
    "an7.22:10": "Kinti te, ānanda, sutaṁ:  ‘vajjīnaṁ arahantesu dhammikā rakkhāvaraṇagutti susaṁvihitā – kinti anāgatā ca arahanto vijitaṁ āgaccheyyuṁ, āgatā ca arahanto vijite phāsuṁ vihareyyun’\"ti?",
    "an7.22:11": "Atha kho bhagavā vassakāraṁ brāhmaṇaṁ māgadhamahāmattaṁ āmantesi:  \"ekamidāhaṁ, brāhmaṇa, samayaṁ vesāliyaṁ viharāmi sārandade cetiye. Tatrāhaṁ, brāhmaṇa, vajjīnaṁ ime satta aparihāniye dhamme desesiṁ. Yāvakīvañca, brāhmaṇa, ime satta aparihāniyā dhammā vajjīsu ṭhassanti, imesu ca sattasu aparihāniyesu dhammesu vajjī sandississanti; vuddhiyeva, brāhmaṇa, vajjīnaṁ pāṭikaṅkhā, no parihānī\"ti.",
    "an7.22:12": "\"Ekamekenapi, bho gotama, aparihāniyena dhammena samannāgatānaṁ vajjīnaṁ vuddhiyeva pāṭikaṅkhā, no parihāni; ko pana vādo sattahi aparihāniyehi dhammehi. Akaraṇīyā ca, bho gotama, vajjī raññā māgadhena ajātasattunā vedehiputtena yadidaṁ yuddhassa, aññatra upalāpanāya, aññatra mithubhedā. Handa ca dāni mayaṁ, bho gotama, gacchāma, bahukiccā mayaṁ bahukaraṇīyā\"ti."
}