{
    "an7.51:1": "\"Saṁyogavisaṁyogaṁ vo, bhikkhave, dhammapariyāyaṁ desessāmi. Taṁ suṇātha … pe … katamo ca so, bhikkhave, saṁyogo visaṁyogo dhammapariyāyo?",
    "an7.51:2": "Itthī, bhikkhave, ajjhattaṁ itthindriyaṁ manasi karoti – itthikuttaṁ itthākappaṁ itthividhaṁ itthicchandaṁ itthissaraṁ itthālaṅkāraṁ. Sā tattha rajjati tatrābhiramati. Sā tattha rattā tatrābhiratā bahiddhā purisindriyaṁ manasi karoti – purisakuttaṁ purisākappaṁ purisavidhaṁ purisacchandaṁ purisassaraṁ purisālaṅkāraṁ. Sā tattha rajjati tatrābhiramati. Sā tattha rattā tatrābhiratā bahiddhā saṁyogaṁ ākaṅkhati. Yañcassā saṁyogapaccayā uppajjati sukhaṁ somanassaṁ tañca ākaṅkhati. Itthatte, bhikkhave, abhiratā sattā purisesu saṁyogaṁ gatā. Evaṁ kho, bhikkhave, itthī itthattaṁ nātivattati.",
    "an7.51:3": "Puriso, bhikkhave, ajjhattaṁ purisindriyaṁ manasi karoti – purisakuttaṁ purisākappaṁ purisavidhaṁ purisacchandaṁ purisassaraṁ purisālaṅkāraṁ. So tattha rajjati tatrābhiramati. So tattha ratto tatrābhirato bahiddhā itthindriyaṁ manasi karoti – itthikuttaṁ itthākappaṁ itthividhaṁ itthicchandaṁ itthissaraṁ itthālaṅkāraṁ. So tattha rajjati tatrābhiramati. So tattha ratto tatrābhirato bahiddhā saṁyogaṁ ākaṅkhati. Yañcassa saṁyogapaccayā uppajjati sukhaṁ somanassaṁ tañca ākaṅkhati. Purisatte, bhikkhave, abhiratā sattā itthīsu saṁyogaṁ gatā. Evaṁ kho, bhikkhave, puriso purisattaṁ nātivattati. Evaṁ kho, bhikkhave, saṁyogo hoti.",
    "an7.51:4": "Kathañca, bhikkhave, visaṁyogo hoti?",
    "an7.51:5": "Puriso, bhikkhave, ajjhattaṁ purisindriyaṁ na manasi karoti – purisakuttaṁ purisākappaṁ purisavidhaṁ purisacchandaṁ purisassaraṁ purisālaṅkāraṁ. So tattha na rajjati, so tatra nābhiramati. So tattha aratto tatra anabhirato bahiddhā itthindriyaṁ na manasi karoti – itthikuttaṁ itthākappaṁ itthividhaṁ itthicchandaṁ itthissaraṁ itthālaṅkāraṁ. So tattha na rajjati, tatra nābhiramati. So tattha aratto tatra anabhirato bahiddhā saṁyogaṁ nākaṅkhati. Yañcassa saṁyogapaccayā uppajjati sukhaṁ somanassaṁ tañca nākaṅkhati. Purisatte, bhikkhave, anabhiratā sattā itthīsu visaṁyogaṁ gatā. Evaṁ kho, bhikkhave, puriso purisattaṁ ativattati."
}