{
    "an7.55:1": "\"Satta ca, bhikkhave, purisagatiyo desessāmi anupādā ca parinibbānaṁ. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "an7.55:2": "Idha, bhikkhave, bhikkhu evaṁ paṭipanno hoti:  ‘no cassa no ca me siyā, na bhavissati na me bhavissati, yadatthi yaṁ bhūtaṁ taṁ pajahāmī’ti upekkhaṁ paṭilabhati. So bhave na rajjati, sambhave na rajjati, atthuttari padaṁ santaṁ sammappaññāya passati. Tañca khvassa padaṁ na sabbena sabbaṁ sacchikataṁ hoti, tassa na sabbena sabbaṁ mānānusayo pahīno hoti, na sabbena sabbaṁ bhavarāgānusayo pahīno hoti, na sabbena sabbaṁ avijjānusayo pahīno hoti. So pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā antarāparinibbāyī hoti.",
    "an7.55:3": "Idha pana, bhikkhave, bhikkhu evaṁ paṭipanno hoti:  ‘no cassa no ca me siyā, na bhavissati na me bhavissati, yadatthi yaṁ bhūtaṁ taṁ pajahāmī’ti upekkhaṁ paṭilabhati. So bhave na rajjati, sambhave na rajjati, atthuttari padaṁ santaṁ sammappaññāya passati. Tañca khvassa padaṁ na sabbena sabbaṁ sacchikataṁ hoti, tassa na sabbena sabbaṁ mānānusayo pahīno hoti, na sabbena sabbaṁ bhavarāgānusayo pahīno hoti, na sabbena sabbaṁ avijjānusayo pahīno hoti. So pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā antarāparinibbāyī hoti.",
    "an7.55:4": "Idha pana, bhikkhave, bhikkhu evaṁ paṭipanno hoti:  ‘no cassa no ca me siyā … pe … so pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā antarāparinibbāyī hoti.",
    "an7.55:5": "Idha pana, bhikkhave, bhikkhu evaṁ paṭipanno hoti:  ‘no cassa no ca me siyā … pe … so pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā upahaccaparinibbāyī hoti.",
    "an7.55:6": "Idha pana, bhikkhave, bhikkhu evaṁ paṭipanno hoti:  ‘no cassa no ca me siyā … pe … so pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā asaṅkhāraparinibbāyī hoti.",
    "an7.55:7": "Idha pana, bhikkhave, bhikkhu evaṁ paṭipanno hoti:  ‘no cassa no ca me siyā … pe … so pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā sasaṅkhāraparinibbāyī hoti.",
    "an7.55:8": "Idha pana, bhikkhave, bhikkhu evaṁ paṭipanno hoti:  ‘no cassa no ca me siyā, na bhavissati na me bhavissati, yadatthi yaṁ bhūtaṁ taṁ pajahāmī’ti upekkhaṁ paṭilabhati. So bhave na rajjati, sambhave na rajjati, atthuttari padaṁ santaṁ sammappaññāya passati. Tañca khvassa padaṁ na sabbena sabbaṁ sacchikataṁ hoti, tassa na sabbena sabbaṁ mānānusayo pahīno hoti, na sabbena sabbaṁ bhavarāgānusayo pahīno hoti, na sabbena sabbaṁ avijjānusayo pahīno hoti. So pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā uddhaṁsoto hoti akaniṭṭhagāmī.",
    "an7.55:9": "Katamañca, bhikkhave, anupādāparinibbānaṁ? Idha, bhikkhave, bhikkhu evaṁ paṭipanno hoti:  ‘no cassa no ca me siyā, na bhavissati na me bhavissati, yadatthi yaṁ bhūtaṁ taṁ pajahāmī’ti upekkhaṁ paṭilabhati. So bhave na rajjati, sambhave na rajjati, atthuttari padaṁ santaṁ sammappaññāya passati. Tañca khvassa padaṁ sabbena sabbaṁ sacchikataṁ hoti, tassa sabbena sabbaṁ mānānusayo pahīno hoti, sabbena sabbaṁ bhavarāgānusayo pahīno hoti, sabbena sabbaṁ avijjānusayo pahīno hoti. So āsavānaṁ khayā … pe … sacchikatvā upasampajja viharati. Idaṁ vuccati, bhikkhave, anupādāparinibbānaṁ."
}