{
    "an7.68:1": "\"Sattahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti … pe … anuttaraṁ puññakkhettaṁ lokassa. Katamehi sattahi? Idha, bhikkhave, bhikkhu dhammaññū ca hoti atthaññū ca attaññū ca mattaññū ca kālaññū ca parisaññū ca puggalaparoparaññū ca.",
    "an7.68:2": "Kathañca, bhikkhave, bhikkhu dhammaññū hoti? Idha, bhikkhave, bhikkhu dhammaṁ jānāti – suttaṁ geyyaṁ veyyākaraṇaṁ gāthaṁ udānaṁ itivuttakaṁ jātakaṁ abbhutadhammaṁ vedallaṁ. No ce, bhikkhave, bhikkhu dhammaṁ jāneyya – suttaṁ geyyaṁ … pe … abbhutadhammaṁ vedallaṁ, nayidha ‘dhammaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu dhammaṁ jānāti – suttaṁ geyyaṁ … pe … abbhutadhammaṁ vedallaṁ, tasmā ‘dhammaññū’ti vuccati. Iti dhammaññū.(1)",
    "an7.68:3": "Atthaññū ca kathaṁ hoti? Idha, bhikkhave, bhikkhu tassa tasseva bhāsitassa atthaṁ jānāti:  ‘Ayaṁ imassa bhāsitassa attho, ayaṁ imassa bhāsitassa attho’ti. No ce, bhikkhave, bhikkhu tassa tasseva bhāsitassa atthaṁ jāneyya:  ‘Ayaṁ imassa bhāsitassa attho, ayaṁ imassa bhāsitassa attho’ti, nayidha ‘atthaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu tassa tasseva bhāsitassa atthaṁ jānāti:  ‘Ayaṁ imassa bhāsitassa attho, ayaṁ imassa bhāsitassa attho’ti, tasmā ‘atthaññū’ti vuccati. Iti dhammaññū, atthaññū.(2)",
    "an7.68:4": "Attaññū ca kathaṁ hoti? Idha, bhikkhave, bhikkhu attānaṁ jānāti:  ‘ettakomhi saddhāya sīlena sutena cāgena paññāya paṭibhānenā’ti. No ce, bhikkhave, bhikkhu attānaṁ jāneyya:  ‘ettakomhi saddhāya sīlena sutena cāgena paññāya paṭibhānenā’ti, nayidha ‘attaññū’ti vucceyya. Yasmā ca, bhikkhave, bhikkhu attānaṁ jānāti:  ‘ettakomhi saddhāya sīlena sutena cāgena paññāya paṭibhānenā’ti, tasmā ‘attaññū’ti vuccati. Iti dhammaññū, atthaññū, attaññū.(3)",
    "an7.68:5": "Mattaññū ca kathaṁ hoti? Idha, bhikkhave, bhikkhu mattaṁ jānāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṁ paṭiggahaṇāya. No ce, bhikkhave, bhikkhu mattaṁ jāneyya cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṁ paṭiggahaṇāya, nayidha ‘mattaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu mattaṁ jānāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṁ paṭiggahaṇāya, tasmā ‘mattaññū’ti vuccati. Iti dhammaññū, atthaññū, attaññū, mattaññū.(4)",
    "an7.68:6": "Kālaññū ca kathaṁ hoti? Idha, bhikkhave, bhikkhu kālaṁ jānāti:  ‘Ayaṁ kālo uddesassa, ayaṁ kālo paripucchāya, ayaṁ kālo yogassa, ayaṁ kālo paṭisallānassā’ti. No ce, bhikkhave, bhikkhu kālaṁ jāneyya:  ‘Ayaṁ kālo uddesassa, ayaṁ kālo paripucchāya, ayaṁ kālo yogassa, ayaṁ kālo paṭisallānassā’ti, nayidha ‘kālaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu kālaṁ jānāti:  ‘Ayaṁ kālo uddesassa, ayaṁ kālo paripucchāya, ayaṁ kālo yogassa, ayaṁ kālo paṭisallānassā’ti, tasmā ‘kālaññū’ti vuccati. Iti dhammaññū, atthaññū, attaññū, mattaññū, kālaññū.(5)",
    "an7.68:7": "Parisaññū ca kathaṁ hoti? Idha, bhikkhave, bhikkhu parisaṁ jānāti:  ‘Ayaṁ khattiyaparisā, ayaṁ brāhmaṇaparisā, ayaṁ gahapatiparisā, ayaṁ samaṇaparisā. Tattha evaṁ upasaṅkamitabbaṁ, evaṁ ṭhātabbaṁ, evaṁ kattabbaṁ, evaṁ nisīditabbaṁ, evaṁ bhāsitabbaṁ, evaṁ tuṇhī bhavitabban’ti. No ce, bhikkhave, bhikkhu parisaṁ jāneyya:  ‘Ayaṁ khattiyaparisā … pe … evaṁ tuṇhī bhavitabban’ti, nayidha ‘parisaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu parisaṁ jānāti:  ‘Ayaṁ khattiyaparisā, ayaṁ brāhmaṇaparisā, ayaṁ gahapatiparisā, ayaṁ samaṇaparisā. Tattha evaṁ upasaṅkamitabbaṁ, evaṁ ṭhātabbaṁ, evaṁ kattabbaṁ, evaṁ nisīditabbaṁ, evaṁ bhāsitabbaṁ, evaṁ tuṇhī bhavitabban’ti, tasmā ‘parisaññū’ti vuccati. Iti dhammaññū, atthaññū, attaññū, mattaññū, kālaññū, parisaññū.(6)",
    "an7.68:8": "Puggalaparoparaññū ca kathaṁ hoti? Idha, bhikkhave, bhikkhuno dvayena puggalā viditā honti.",
    "an7.68:9": "Dve puggalā ariyānaṁ dassanakāmā – eko saddhammaṁ sotukāmo, eko saddhammaṁ na sotukāmo. Yvāyaṁ puggalo saddhammaṁ na sotukāmo, evaṁ so tenaṅgena gārayho. Yvāyaṁ puggalo saddhammaṁ sotukāmo, evaṁ so tenaṅgena pāsaṁso. (7.2)",
    "an7.68:10": "Dve puggalā saddhammaṁ sotukāmā – eko ohitasoto dhammaṁ suṇāti, eko anohitasoto dhammaṁ suṇāti. Yvāyaṁ puggalo anohitasoto dhammaṁ suṇāti, evaṁ so tenaṅgena gārayho. Yvāyaṁ puggalo ohitasoto dhammaṁ suṇāti, evaṁ so tenaṅgena pāsaṁso. (7.3)",
    "an7.68:11": "Dve puggalā ohitasotā dhammaṁ suṇanti – eko sutvā dhammaṁ dhāreti, eko sutvā dhammaṁ na dhāreti. Yvāyaṁ puggalo sutvā na dhammaṁ dhāreti, evaṁ so tenaṅgena gārayho. Yvāyaṁ puggalo sutvā dhammaṁ dhāreti, evaṁ so tenaṅgena pāsaṁso. (7.4)",
    "an7.68:12": "Dve puggalā sutvā dhammaṁ dhārenti – eko dhātānaṁ dhammānaṁ atthaṁ upaparikkhati, eko dhātānaṁ dhammānaṁ atthaṁ na upaparikkhati. Yvāyaṁ puggalo dhātānaṁ dhammānaṁ atthaṁ na upaparikkhati, evaṁ so tenaṅgena gārayho. Yvāyaṁ puggalo dhātānaṁ dhammānaṁ atthaṁ upaparikkhati, evaṁ so tenaṅgena pāsaṁso. (7.5)",
    "an7.68:13": "Dve puggalā dhātānaṁ dhammānaṁ atthaṁ upaparikkhanti – eko atthamaññāya dhammamaññāya dhammānudhammappaṭipanno, eko atthamaññāya dhammamaññāya na dhammānudhammappaṭipanno. Yvāyaṁ puggalo atthamaññāya dhammamaññāya na dhammānudhammappaṭipanno, evaṁ so tenaṅgena gārayho. Yvāyaṁ puggalo atthamaññāya dhammamaññāya dhammānudhammappaṭipanno, evaṁ so tenaṅgena pāsaṁso. (7.6)",
    "an7.68:14": "Dve puggalā atthamaññāya dhammamaññāya dhammānudhammappaṭipannā – eko attahitāya paṭipanno no parahitāya, eko attahitāya ca paṭipanno parahitāya ca. Yvāyaṁ puggalo attahitāya paṭipanno no parahitāya, evaṁ so tenaṅgena gārayho. Yvāyaṁ puggalo attahitāya ca paṭipanno parahitāya ca, evaṁ so tenaṅgena pāsaṁso. (7.7)",
    "an7.68:15": "Evaṁ kho, bhikkhave, bhikkhuno dvayena puggalā viditā honti.",
    "an7.68:16": "Evaṁ, bhikkhave, bhikkhu puggalaparoparaññū hoti."
}