{
    "an8.76:1": "\"Aṭṭhimā, bhikkhave, sampadā. Katamā aṭṭha? Uṭṭhānasampadā, ārakkhasampadā, kalyāṇamittatā, samajīvitā, saddhāsampadā, sīlasampadā, cāgasampadā, paññāsampadā.",
    "an8.76:2": "Katamā ca, bhikkhave, ārakkhasampadā? Idha, bhikkhave, kulaputtassa bhogā honti uṭṭhānavīriyādhigatā bāhābalaparicitā sedāvakkhittā dhammikā dhammaladdhā te ārakkhena guttiyā sampādeti:  ‘Kinti me bhoge neva rājāno hareyyuṁ, na corā hareyyuṁ, na aggi ḍaheyya, na udakaṁ vaheyya, na appiyā dāyādā hareyyun’ti. Ayaṁ vuccati, bhikkhave, ārakkhasampadā.()",
    "an8.76:3": "Katamā ca, bhikkhave, kalyāṇamittatā? Idha, bhikkhave, kulaputto yasmiṁ gāme vā nigame vā paṭivasati, tattha ye te honti gahapatī vā gahapatiputtā vā daharā vā vuddhasīlino vuddhā vā vuddhasīlino saddhāsampannā sīlasampannā cāgasampannā paññāsampannā, tehi saddhiṁ santiṭṭhati sallapati sākacchaṁ samāpajjati; yathārūpānaṁ saddhāsampannānaṁ saddhāsampadaṁ anusikkhati, yathārūpānaṁ sīlasampannānaṁ sīlasampadaṁ anusikkhati, yathārūpānaṁ cāgasampannānaṁ cāgasampadaṁ anusikkhati, yathārūpānaṁ paññāsampannānaṁ paññāsampadaṁ anusikkhati. Ayaṁ vuccati, bhikkhave, kalyāṇamittatā.()",
    "an8.76:4": "Katamā ca, bhikkhave, samajīvitā? Idha, bhikkhave, kulaputto āyañca bhogānaṁ viditvā vayañca bhogānaṁ viditvā samaṁ jīvikaṁ kappeti nāccogāḷhaṁ nātihīnaṁ:  ‘evaṁ me āyo vayaṁ pariyādāya ṭhassati, na ca me vayo āyaṁ pariyādāya ṭhassatī’ti. Seyyathāpi, bhikkhave, tulādhāro vā tulādhārantevāsī vā tulaṁ paggahetvā jānāti:  ‘ettakena vā onataṁ, ettakena vā unnatan’ti; evamevaṁ kho, bhikkhave, kulaputto āyañca bhogānaṁ viditvā vayañca bhogānaṁ viditvā samaṁ jīvikaṁ kappeti nāccogāḷhaṁ nātihīnaṁ:  ‘evaṁ me āyo vayaṁ pariyādāya ṭhassati, na ca me vayo āyaṁ pariyādāya ṭhassatī’ti.",
    "an8.76:5": "Katamā ca, bhikkhave, saddhāsampadā? Idha, bhikkhave, kulaputto saddho hoti, saddahati tathāgatassa bodhiṁ:  ‘itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavā’ti. Ayaṁ vuccati, bhikkhave, saddhāsampadā.()",
    "an8.76:6": "Katamā ca, bhikkhave, sīlasampadā? Idha, bhikkhave, kulaputto pāṇātipātā paṭivirato hoti … pe … surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Ayaṁ vuccati, bhikkhave, sīlasampadā.()",
    "an8.76:7": "Katamā ca, bhikkhave, cāgasampadā? Idha, bhikkhave, kulaputto vigatamalamaccherena cetasā agāraṁ ajjhāvasati … pe … yācayogo dānasaṁvibhāgarato. Ayaṁ vuccati, bhikkhave, cāgasampadā.()",
    "an8.76:8": "Katamā ca, bhikkhave, paññāsampadā? Idha, bhikkhave, kulaputto paññavā hoti … pe … sammā dukkhakkhayagāminiyā. Ayaṁ vuccati, bhikkhave, paññāsampadā.()",
    "an8.76:9": "Imā kho, bhikkhave, aṭṭha sampadāti.",
    "an8.76:10": "Uṭṭhātā kammadheyyesu,appamatto vidhānavā;Samaṁ kappeti jīvikaṁ,sambhataṁ anurakkhati.",
    "an8.76:11": "Saddho sīlena sampanno,vadaññū vītamaccharo;Niccaṁ maggaṁ visodheti,sotthānaṁ samparāyikaṁ.",
    "an8.76:12": "Iccete aṭṭha dhammā ca,saddhassa gharamesino;Akkhātā saccanāmena,ubhayattha sukhāvahā.",
    "an8.76:13": "Diṭṭhadhammahitatthāya,samparāyasukhāya ca;Evametaṁ gahaṭṭhānaṁ,cāgo puññaṁ pavaḍḍhatī\"ti."
}