{
    "an8.2:1": "\"Aṭṭhime, bhikkhave, hetū aṭṭha paccayā ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṁvattanti. Katame aṭṭha?",
    "an8.2:2": "So taṁ satthāraṁ upanissāya viharanto aññataraṁ vā garuṭṭhāniyaṁ sabrahmacāriṁ, yatthassa tibbaṁ hirottappaṁ paccupaṭṭhitaṁ hoti pemañca gāravo ca, te kālena kālaṁ upasaṅkamitvā paripucchati paripañhati:  ‘idaṁ, bhante, kathaṁ; imassa ko attho’ti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṁ paṭivinodenti. Ayaṁ, bhikkhave, dutiyo hetu dutiyo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṁvattati.",
    "an8.2:3": "So taṁ dhammaṁ sutvā dvayena vūpakāsena sampādeti – kāyavūpakāsena ca cittavūpakāsena ca. Ayaṁ, bhikkhave, tatiyo hetu tatiyo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṁvattati.",
    "an8.2:4": "Sīlavā hoti, pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Ayaṁ, bhikkhave, catuttho hetu catuttho paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṁvattati.",
    "an8.2:5": "Bahussuto hoti sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Ayaṁ, bhikkhave, pañcamo hetu pañcamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṁvattati.",
    "an8.2:6": "Āraddhavīriyo viharati akusalānaṁ dhammānaṁ pahānāya, kusalānaṁ dhammānaṁ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Ayaṁ, bhikkhave, chaṭṭho hetu chaṭṭho paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṁvattati.",
    "an8.2:7": "Saṅghagato kho pana anānākathiko hoti atiracchānakathiko. Sāmaṁ vā dhammaṁ bhāsati paraṁ vā ajjhesati ariyaṁ vā tuṇhībhāvaṁ nātimaññati. Ayaṁ, bhikkhave, sattamo hetu sattamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṁvattati.",
    "an8.2:8": "Pañcasu kho pana upādānakkhandhesu udayabbayānupassī viharati:  ‘iti rūpaṁ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā, iti vedanāya samudayo, iti vedanāya atthaṅgamo; iti saññā … pe … iti saṅkhārā … iti viññāṇaṁ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti. Ayaṁ, bhikkhave, aṭṭhamo hetu aṭṭhamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṁvattati.",
    "an8.2:9": "Tamenaṁ sabrahmacārī evaṁ sambhāventi:  ‘Ayaṁ kho āyasmā satthāraṁ upanissāya viharati aññataraṁ vā garuṭṭhāniyaṁ sabrahmacāriṁ, yatthassa tibbaṁ hirottappaṁ paccupaṭṭhitaṁ hoti pemañca gāravo ca. Addhā ayamāyasmā jānaṁ jānāti passaṁ passatī’ti. Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṁvattati.(1)",
    "an8.2:10": "‘Taṁ kho panāyamāyasmā satthāraṁ upanissāya viharanto aññataraṁ vā garuṭṭhāniyaṁ sabrahmacāriṁ, yatthassa tibbaṁ hirottappaṁ paccupaṭṭhitaṁ hoti pemañca gāravo ca, te kālena kālaṁ upasaṅkamitvā paripucchati paripañhati:  \"Idaṁ, bhante, kathaṁ; imassa ko attho\"ti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṁ paṭivinodenti. Addhā ayamāyasmā jānaṁ jānāti passaṁ passatī’ti. Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṁvattati.(2)",
    "an8.2:11": "‘Taṁ kho panāyamāyasmā dhammaṁ sutvā dvayena vūpakāsena sampādeti – kāyavūpakāsena ca cittavūpakāsena ca. Addhā ayamāyasmā jānaṁ jānāti passaṁ passatī’ti. Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṁvattati.(3)",
    "an8.2:12": "‘Sīlavā kho panāyamāyasmā pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Addhā ayamāyasmā jānaṁ jānāti passaṁ passatī’ti. Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṁvattati.(4)",
    "an8.2:13": "‘Bahussuto kho panāyamāyasmā sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Addhā ayamāyasmā jānaṁ jānāti passaṁ passatī’ti. Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṁvattati.(5)",
    "an8.2:14": "‘Āraddhavīriyo kho panāyamāyasmā viharati akusalānaṁ dhammānaṁ pahānāya, kusalānaṁ dhammānaṁ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Addhā ayamāyasmā jānaṁ jānāti passaṁ passatī’ti. Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṁvattati.(6)",
    "an8.2:15": "‘Saṅghagato kho panāyamāyasmā anānākathiko hoti atiracchānakathiko. Sāmaṁ vā dhammaṁ bhāsati paraṁ vā ajjhesati ariyaṁ vā tuṇhībhāvaṁ nātimaññati. Addhā ayamāyasmā jānaṁ jānāti passaṁ passatī’ti. Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṁvattati.(7)",
    "an8.2:16": "‘Pañcasu kho panāyamāyasmā upādānakkhandhesu udayabbayānupassī viharati – iti rūpaṁ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā … pe … iti saññā … iti saṅkhārā … iti viññāṇaṁ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamoti. Addhā ayamāyasmā jānaṁ jānāti passaṁ passatī’ti. Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṁvattati.(8)",
    "an8.2:17": "Ime kho, bhikkhave, aṭṭha hetū aṭṭha paccayā ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṁvattantī\"ti."
}