{
    "an8.70:1": "Ekaṁ samayaṁ bhagavā vesāliyaṁ viharati mahāvane kūṭāgārasālāyaṁ. Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya vesāliṁ piṇḍāya pāvisi. Vesāliyaṁ piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkanto āyasmantaṁ ānandaṁ āmantesi:  \"gaṇhāhi, ānanda, nisīdanaṁ. Yena cāpālaṁ cetiyaṁ tenupasaṅkamissāma divāvihārāyā\"ti.",
    "an8.70:2": "Atha kho bhagavā yena cāpālaṁ cetiyaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṁ ānandaṁ āmantesi:",
    "an8.70:3": "\"Ramaṇīyā, ānanda, vesālī, ramaṇīyaṁ udenaṁ cetiyaṁ, ramaṇīyaṁ gotamakaṁ cetiyaṁ, ramaṇīyaṁ sattambaṁ cetiyaṁ, ramaṇīyaṁ bahuputtakaṁ cetiyaṁ; ramaṇīyaṁ sārandadaṁ cetiyaṁ, ramaṇīyaṁ cāpālaṁ cetiyaṁ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, ākaṅkhamāno so, ānanda, kappaṁ vā tiṭṭheyya kappāvasesaṁ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṁ vā tiṭṭheyya kappāvasesaṁ vā\"ti.",
    "an8.70:4": "Dutiyampi kho bhagavā … pe … tatiyampi kho bhagavā āyasmantaṁ ānandaṁ āmantesi:  \"ramaṇīyā, ānanda, vesālī, ramaṇīyaṁ udenaṁ cetiyaṁ, ramaṇīyaṁ gotamakaṁ cetiyaṁ, ramaṇīyaṁ sattambaṁ cetiyaṁ, ramaṇīyaṁ bahuputtakaṁ cetiyaṁ, ramaṇīyaṁ sārandadaṁ cetiyaṁ, ramaṇīyaṁ cāpālaṁ cetiyaṁ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, ākaṅkhamāno so, ānanda, kappaṁ vā tiṭṭheyya kappāvasesaṁ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā … pe … ākaṅkhamāno, ānanda, tathāgato kappaṁ vā tiṭṭheyya kappāvasesaṁ vā\"ti.",
    "an8.70:5": "Atha kho bhagavā āyasmantaṁ ānandaṁ āmantesi:  \"gaccha tvaṁ, ānanda, yassadāni kālaṁ maññasī\"ti.",
    "an8.70:6": "\"Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā:  ‘Na tāvāhaṁ, pāpima, parinibbāyissāmi yāva me bhikkhū na sāvakā bhavissanti viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṁ ācariyakaṁ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti uppannaṁ parappavādaṁ sahadhammena suniggahitaṁ niggahetvā sappāṭihāriyaṁ dhammaṁ desessantī’ti. Etarahi, bhante, bhikkhū bhagavato sāvakā viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṁ ācariyakaṁ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti uppannaṁ parappavādaṁ sahadhammena suniggahitaṁ niggahetvā sappāṭihāriyaṁ dhammaṁ desenti.",
    "an8.70:7": "Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato.",
    "an8.70:8": "Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato.",
    "an8.70:9": "Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato\"ti.",
    "an8.70:10": "Atha kho bhagavā cāpāle cetiye sato sampajāno āyusaṅkhāraṁ ossaji. Ossaṭṭhe ca bhagavatā āyusaṅkhāre mahābhūmicālo ahosi bhiṁsanako salomahaṁso, devadundubhiyo ca phaliṁsu.",
    "an8.70:11": "\"Tulamatulañca sambhavaṁ,Bhavasaṅkhāramavassaji muni;Ajjhattarato samāhito,Abhindi kavacamivattasambhavan\"ti.",
    "an8.70:12": "Atha kho āyasmato ānandassa etadahosi:  \"mahā vatāyaṁ bhūmicālo; sumahā vatāyaṁ bhūmicālo bhiṁsanako salomahaṁso, devadundubhiyo ca phaliṁsu. Ko nu kho hetu, ko paccayo mahato bhūmicālassa pātubhāvāyā\"ti?",
    "an8.70:13": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:  \"mahā vatāyaṁ, bhante, bhūmicālo; sumahā vatāyaṁ, bhante, bhūmicālo bhiṁsanako salomahaṁso, devadundubhiyo ca phaliṁsu. Ko nu kho, bhante, hetu, ko paccayo mahato bhūmicālassa pātubhāvāyā\"ti?",
    "an8.70:14": "\"Aṭṭhime, ānanda, hetū, aṭṭha paccayā mahato bhūmicālassa pātubhāvāya. Katame aṭṭha?",
    "an8.70:15": "Puna caparaṁ, ānanda, samaṇo vā brāhmaṇo vā iddhimā cetovasippatto devatā vā mahiddhikā mahānubhāvā. Tassa parittā pathavīsaññā bhāvitā hoti, appamāṇā āposaññā. So imaṁ pathaviṁ kampeti saṅkampeti sampakampeti sampavedheti. Ayaṁ, ānanda, dutiyo hetu, dutiyo paccayo mahato bhūmicālassa pātubhāvāya.(2)",
    "an8.70:16": "Puna caparaṁ, ānanda, yadā bodhisatto tusitā kāyā cavitvā sato sampajāno mātukucchiṁ okkamati, tadāyaṁ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṁ, ānanda, tatiyo hetu, tatiyo paccayo mahato bhūmicālassa pātubhāvāya.(3)",
    "an8.70:17": "Puna caparaṁ, ānanda, yadā bodhisatto sato sampajāno mātukucchismā nikkhamati, tadāyaṁ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṁ, ānanda, catuttho hetu, catuttho paccayo mahato bhūmicālassa pātubhāvāya.(4)",
    "an8.70:18": "Puna caparaṁ, ānanda, yadā tathāgato anuttaraṁ sammāsambodhiṁ abhisambujjhati, tadāyaṁ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṁ, ānanda, pañcamo hetu, pañcamo paccayo mahato bhūmicālassa pātubhāvāya.(5)",
    "an8.70:19": "Puna caparaṁ, ānanda, yadā tathāgato anuttaraṁ dhammacakkaṁ pavatteti, tadāyaṁ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṁ, ānanda, chaṭṭho hetu, chaṭṭho paccayo mahato bhūmicālassa pātubhāvāya.(6)",
    "an8.70:20": "Puna caparaṁ, ānanda, yadā tathāgato sato sampajāno āyusaṅkhāraṁ ossajjati, tadāyaṁ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṁ, ānanda, sattamo hetu, sattamo paccayo mahato bhūmicālassa pātubhāvāya.(7)",
    "an8.70:21": "Puna caparaṁ, ānanda, yadā tathāgato anupādisesāya nibbānadhātuyā parinibbāyati, tadāyaṁ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṁ, ānanda, aṭṭhamo hetu, aṭṭhamo paccayo mahato bhūmicālassa pātubhāvāya.",
    "an8.70:22": "Icchā alañca saṅkhittaṁ,gayā abhibhunā saha;Vimokkho dve ca vohārā,parisā bhūmicālenāti."
}