{
    "an8.71:1": "\"Saddho ca, bhikkhave, bhikkhu hoti, no ca sīlavā. Evaṁ so tenaṅgena aparipūro hoti. Tena taṁ aṅgaṁ paripūretabbaṁ:  ‘kintāhaṁ saddho ca assaṁ sīlavā cā’ti. Yato ca kho, bhikkhave, bhikkhu saddho ca hoti sīlavā ca, evaṁ so tenaṅgena paripūro hoti.",
    "an8.71:2": "Saddho ca, bhikkhave, bhikkhu hoti sīlavā ca, no ca bahussuto. Evaṁ so tenaṅgena aparipūro hoti. Tena taṁ aṅgaṁ paripūretabbaṁ:  ‘kintāhaṁ saddho ca assaṁ, sīlavā ca, bahussuto cā’ti. Yato ca kho, bhikkhave, bhikkhu saddho ca hoti sīlavā ca bahussuto ca, evaṁ so tenaṅgena paripūro hoti.",
    "an8.71:3": "Saddho ca, bhikkhave, bhikkhu hoti sīlavā ca bahussuto ca, no ca dhammakathiko … pe … dhammakathiko ca, no ca parisāvacaro … pe … parisāvacaro ca, no ca visārado parisāya dhammaṁ deseti … pe … visārado ca parisāya dhammaṁ deseti, no ca catunnaṁ jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī … pe … catunnaṁ jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī, no ca āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharati; evaṁ so tenaṅgena aparipūro hoti. Tena taṁ aṅgaṁ paripūretabbaṁ:  ‘kintāhaṁ saddho ca assaṁ, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṁ deseyyaṁ, catunnañca jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī assaṁ akicchalābhī akasiralābhī, āsavānañca khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihareyyan’ti.",
    "an8.71:4": "Yato ca kho, bhikkhave, bhikkhu saddho ca hoti, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṁ deseti, catunnañca jhānānaṁ ābhicetasikānaṁ diṭṭhadhammasukhavihārānaṁ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānañca khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharati; evaṁ so tenaṅgena paripūro hoti."
}