{
    "an8.78:1": "Tatra kho āyasmā sāriputto bhikkhū āmantesi … pe",
    "an8.78:2": "Pañcahāvuso, dhammehi samannāgato bhikkhu alaṁ attano, alaṁ paresaṁ. Katamehi pañcahi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṁ dhāraṇajātiko hoti; dhātānañca dhammānaṁ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; kalyāṇavāco ca hoti … pe … sandassako ca hoti … pe … sabrahmacārīnaṁ. Imehi kho, āvuso, pañcahi dhammehi samannāgato bhikkhu alaṁ attano, alaṁ paresaṁ.",
    "an8.78:3": "Catūhāvuso, dhammehi samannāgato bhikkhu alaṁ attano, nālaṁ paresaṁ. Katamehi catūhi? Idhāvuso, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṁ dhāraṇajātiko hoti; dhātānañca dhammānaṁ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti … pe … no ca sandassako hoti … pe … sabrahmacārīnaṁ. Imehi kho, āvuso, catūhi dhammehi samannāgato bhikkhu alaṁ attano, nālaṁ paresaṁ.",
    "an8.78:4": "Catūhāvuso, dhammehi samannāgato bhikkhu alaṁ paresaṁ, nālaṁ attano. Katamehi catūhi? Idhāvuso, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṁ dhāraṇajātiko hoti; no ca dhātānaṁ dhammānaṁ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti … pe … sandassako ca hoti … pe … sabrahmacārīnaṁ. Imehi kho, āvuso, catūhi dhammehi samannāgato bhikkhu alaṁ paresaṁ, nālaṁ attano.",
    "an8.78:5": "Tīhāvuso, dhammehi samannāgato bhikkhu alaṁ attano, nālaṁ paresaṁ. Katamehi tīhi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṁ dhāraṇajātiko hoti; dhātānañca dhammānaṁ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti … pe … no ca sandassako hoti … pe … sabrahmacārīnaṁ. Imehi kho, āvuso, tīhi dhammehi samannāgato bhikkhu alaṁ attano, nālaṁ paresaṁ.",
    "an8.78:6": "Tīhāvuso, dhammehi samannāgato bhikkhu alaṁ paresaṁ, nālaṁ attano. Katamehi tīhi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṁ dhāraṇajātiko hoti; no ca dhātānaṁ dhammānaṁ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti … pe … atthassa viññāpaniyā, sandassako ca hoti … pe … sabrahmacārīnaṁ. Imehi kho, āvuso, tīhi dhammehi samannāgato bhikkhu alaṁ paresaṁ, nālaṁ attano.",
    "an8.78:7": "Dvīhāvuso, dhammehi samannāgato bhikkhu alaṁ attano, nālaṁ paresaṁ. Katamehi dvīhi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca sutānaṁ dhammānaṁ dhāraṇajātiko hoti; dhātānañca dhammānaṁ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti … pe … no ca sandassako hoti … pe … sabrahmacārīnaṁ. Imehi kho, āvuso, dvīhi dhammehi samannāgato bhikkhu alaṁ attano, nālaṁ paresaṁ.",
    "an8.78:8": "Dvīhāvuso, dhammehi samannāgato bhikkhu alaṁ paresaṁ, nālaṁ attano. Katamehi dvīhi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca sutānaṁ dhammānaṁ dhāraṇajātiko hoti; no ca dhātānaṁ dhammānaṁ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṁsako sabrahmacārīnaṁ. Imehi kho, āvuso, dvīhi dhammehi samannāgato bhikkhu alaṁ paresaṁ, nālaṁ attano\"ti."
}