{
    "an8.73:1": "Ekaṁ samayaṁ bhagavā nātike viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi:  \"bhikkhavo\"ti.",
    "an8.73:2": "Evaṁ vutte, aññataro bhikkhu bhagavantaṁ etadavoca:  \"ahaṁ kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an8.73:3": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an8.73:4": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an8.73:5": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an8.73:6": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an8.73:7": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an8.73:8": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an8.73:9": "Aññataropi kho bhikkhu bhagavantaṁ etadavoca:  \"ahampi kho, bhante, bhāvemi maraṇassatin\"ti.",
    "an8.73:10": "Evaṁ vutte, bhagavā te bhikkhū etadavoca:  \"yvāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ rattindivaṁ jīveyyaṁ, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti. Yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ divasaṁ jīveyyaṁ, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti; yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ upaḍḍhadivasaṁ jīveyyaṁ, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti. Yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ tadantaraṁ jīveyyaṁ yadantaraṁ ekapiṇḍapātaṁ bhuñjāmi, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti; yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ tadantaraṁ jīveyyaṁ yadantaraṁ upaḍḍhapiṇḍapātaṁ bhuñjāmi, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti. Yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ tadantaraṁ jīveyyaṁ yadantaraṁ cattāro pañca ālope saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti – ime vuccanti, bhikkhave, ‘bhikkhū pamattā viharanti, dandhaṁ maraṇassatiṁ bhāventi āsavānaṁ khayāya’.",
    "an8.73:11": "Yo ca khvāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ tadantaraṁ jīveyyaṁ yadantaraṁ ekaṁ ālopaṁ saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti. Yo cāyaṁ, bhikkhave, bhikkhu evaṁ maraṇassatiṁ bhāveti:  ‘aho vatāhaṁ tadantaraṁ jīveyyaṁ yadantaraṁ assasitvā vā passasāmi, passasitvā vā assasāmi, bhagavato sāsanaṁ manasi kareyyaṁ, bahu vata me kataṁ assā’ti – ime vuccanti, bhikkhave, ‘bhikkhū appamattā viharanti, tikkhaṁ maraṇassatiṁ bhāventi āsavānaṁ khayāya’.",
    "an8.73:12": "Tasmātiha, bhikkhave, evaṁ sikkhitabbaṁ:  ‘appamattā viharissāma, tikkhaṁ maraṇassatiṁ bhāvayissāma āsavānaṁ khayāyā’ti. Evañhi vo, bhikkhave, sikkhitabban\"ti."
}