{
    "an8.50:1": "\"Catūhi, bhikkhave, dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṁsa loko āraddho hoti. Katamehi catūhi? Idha, bhikkhave, mātugāmo susaṁvihitakammanto hoti, saṅgahitaparijano, bhattu manāpaṁ carati, sambhataṁ anurakkhati.",
    "an8.50:2": "Kathañca, bhikkhave, mātugāmo susaṁvihitakammanto hoti? Idha, bhikkhave, mātugāmo ye te bhattu abbhantarā kammantā … pe … evaṁ kho, bhikkhave, mātugāmo susaṁvihitakammanto hoti.",
    "an8.50:3": "Kathañca, bhikkhave, mātugāmo saṅgahitaparijano hoti? Idha, bhikkhave, mātugāmo yo so bhattu abbhantaro antojano … pe … evaṁ kho, bhikkhave, mātugāmo saṅgahitaparijano hoti.",
    "an8.50:4": "Kathañca, bhikkhave, mātugāmo bhattu manāpaṁ carati? Idha, bhikkhave, mātugāmo yaṁ bhattu amanāpasaṅkhātaṁ taṁ jīvitahetupi na ajjhācarati. Evaṁ kho, bhikkhave, mātugāmo bhattu manāpaṁ carati.",
    "an8.50:5": "Kathañca, bhikkhave, mātugāmo sambhataṁ anurakkhati? Idha, bhikkhave, mātugāmo yaṁ bhattā āharati … pe … evaṁ kho, bhikkhave, mātugāmo sambhataṁ anurakkhati. Imehi kho, bhikkhave, catūhi dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṁsa loko āraddho hoti.",
    "an8.50:6": "Catūhi, bhikkhave, dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hoti. Katamehi catūhi? Idha, bhikkhave, mātugāmo saddhāsampanno hoti, sīlasampanno hoti, cāgasampanno hoti, paññāsampanno hoti.",
    "an8.50:7": "Kathañca, bhikkhave, mātugāmo saddhāsampanno hoti? Idha, bhikkhave, mātugāmo saddho hoti … pe … evaṁ kho, bhikkhave, mātugāmo saddhāsampanno hoti.",
    "an8.50:8": "Kathañca, bhikkhave, mātugāmo sīlasampanno hoti? Idha, bhikkhave, mātugāmo pāṇātipātā paṭivirato hoti … pe … surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Evaṁ kho, bhikkhave, mātugāmo sīlasampanno hoti.",
    "an8.50:9": "Kathañca, bhikkhave, mātugāmo cāgasampanno hoti? Idha, bhikkhave, mātugāmo vigatamalamaccherena cetasā agāraṁ ajjhāvasati … pe … evaṁ kho, bhikkhave, mātugāmo cāgasampanno hoti.",
    "an8.50:10": "Kathañca, bhikkhave, mātugāmo paññāsampanno hoti? Idha, bhikkhave, mātugāmo paññavā hoti … pe … evaṁ kho, bhikkhave, mātugāmo paññāsampanno hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hotīti.",
    "an8.50:11": "Susaṁvihitakammantā,saṅgahitaparijjanā;Bhattu manāpaṁ carati,sambhataṁ anurakkhati.",
    "an8.50:12": "Saddhā sīlena sampannā,vadaññū vītamaccharā;Niccaṁ maggaṁ visodheti,sotthānaṁ samparāyikaṁ.",
    "an8.50:13": "Iccete aṭṭha dhammā ca,yassā vijjanti nāriyā;Tampi sīlavatiṁ āhu,dhammaṭṭhaṁ saccavādiniṁ.",
    "an8.50:14": "Soḷasākārasampannā,Aṭṭhaṅgasusamāgatā;Tādisī sīlavatī upāsikā,Upapajjati devalokaṁ manāpan\"ti.",
    "an8.50:15": "Saṅkhitte vitthate visākhe,Vāseṭṭho bojjhāya pañcamaṁ;Anuruddhaṁ puna visākhe,Nakulā idhalokikā dveti."
}