{
    "an8.8:1": "Ekaṁ samayaṁ āyasmā uttaro mahisavatthusmiṁ viharati saṅkheyyake pabbate vaṭajālikāyaṁ. Tatra kho āyasmā uttaro bhikkhū āmantesi:",
    "an8.8:2": "Tena kho pana samayena vessavaṇo mahārājā uttarāya disāya dakkhiṇaṁ disaṁ gacchati kenacideva karaṇīyena. Assosi kho vessavaṇo mahārājā āyasmato uttarassa mahisavatthusmiṁ saṅkheyyake pabbate vaṭajālikāyaṁ bhikkhūnaṁ evaṁ dhammaṁ desentassa:  \"sādhāvuso, bhikkhu kālena kālaṁ attavipattiṁ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṁ paravipattiṁ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṁ attasampattiṁ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṁ parasampattiṁ paccavekkhitā hotī\"ti.",
    "an8.8:3": "Atha kho vessavaṇo mahārājā – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evamevaṁ mahisavatthusmiṁ saṅkheyyake pabbate vaṭajālikāyaṁ antarahito devesu tāvatiṁsesu pāturahosi.",
    "an8.8:4": "Atha kho sakko devānamindo seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evamevaṁ devesu tāvatiṁsesu antarahito mahisavatthusmiṁ saṅkheyyake pabbate vaṭajālikāyaṁ āyasmato uttarassa sammukhe pāturahosi. Atha kho sakko devānamindo yenāyasmā uttaro tenupasaṅkami; upasaṅkamitvā āyasmantaṁ uttaraṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho sakko devānamindo āyasmantaṁ uttaraṁ etadavoca:",
    "an8.8:5": "\"Saccaṁ kira, bhante, āyasmā uttaro bhikkhūnaṁ evaṁ dhammaṁ desesi:  ‘sādhāvuso, bhikkhu kālena kālaṁ attavipattiṁ paccavekkhitā hoti, sādhāvuso, bhikkhu kālena kālaṁ paravipattiṁ … pe … attasampattiṁ … parasampattiṁ paccavekkhitā hotī’\"ti?",
    "an8.8:6": "Seyyathāpi, devānaminda, gāmassa vā nigamassa vā avidūre mahādhaññarāsi. Tato mahājanakāyo dhaññaṁ āhareyya – kājehipi piṭakehipi ucchaṅgehipi añjalīhipi. Yo nu kho, devānaminda, taṁ mahājanakāyaṁ upasaṅkamitvā evaṁ puccheyya:  ‘kuto imaṁ dhaññaṁ āharathā’ti, kathaṁ byākaramāno nu kho, devānaminda, so mahājanakāyo sammā byākaramāno byākareyyā\"ti?",
    "an8.8:7": "\"Acchariyaṁ, bhante, abbhutaṁ bhante. Yāva subhāsitañcidaṁ āyasmatā uttarena:  ‘Yaṁ kiñci subhāsitaṁ sabbaṁ taṁ tassa bhagavato vacanaṁ arahato sammāsambuddhassa. Tato upādāyupādāya mayañcaññe ca bhaṇāmā’ti.",
    "an8.8:8": "‘Sādhu, bhikkhave, bhikkhu kālena kālaṁ attavipattiṁ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṁ paravipattiṁ … pe … attasampattiṁ … parasampattiṁ paccavekkhitā hoti. Aṭṭhahi, bhikkhave, asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi aṭṭhahi?",
    "an8.8:9": "Sādhu, bhikkhave, bhikkhu uppannaṁ lābhaṁ abhibhuyya abhibhuyya vihareyya; uppannaṁ alābhaṁ … pe … uppannaṁ yasaṁ … uppannaṁ ayasaṁ … uppannaṁ sakkāraṁ … uppannaṁ asakkāraṁ … uppannaṁ pāpicchataṁ … uppannaṁ pāpamittataṁ abhibhuyya abhibhuyya vihareyya.",
    "an8.8:10": "Kiñca, bhikkhave, bhikkhu atthavasaṁ paṭicca uppannaṁ lābhaṁ abhibhuyya abhibhuyya vihareyya; uppannaṁ alābhaṁ … pe … uppannaṁ yasaṁ … uppannaṁ ayasaṁ … uppannaṁ sakkāraṁ … uppannaṁ asakkāraṁ … uppannaṁ pāpicchataṁ … uppannaṁ pāpamittataṁ abhibhuyya abhibhuyya vihareyya?",
    "an8.8:11": "Yaṁ hissa, bhikkhave, uppannaṁ lābhaṁ anabhibhuyya viharato uppajjeyyuṁ āsavā vighātapariḷāhā, uppannaṁ lābhaṁ abhibhuyya viharato evaṁsa te āsavā vighātapariḷāhā na honti. Yaṁ hissa, bhikkhave, uppannaṁ alābhaṁ … pe … uppannaṁ yasaṁ … uppannaṁ ayasaṁ … uppannaṁ sakkāraṁ … uppannaṁ asakkāraṁ … uppannaṁ pāpicchataṁ … uppannaṁ pāpamittataṁ anabhibhuyya viharato uppajjeyyuṁ āsavā vighātapariḷāhā, uppannaṁ pāpamittataṁ abhibhuyya viharato evaṁsa te āsavā vighātapariḷāhā na honti. Idaṁ kho, bhikkhave, bhikkhu atthavasaṁ paṭicca uppannaṁ lābhaṁ abhibhuyya abhibhuyya vihareyya; uppannaṁ alābhaṁ … pe … uppannaṁ yasaṁ … uppannaṁ ayasaṁ … uppannaṁ sakkāraṁ … uppannaṁ asakkāraṁ … uppannaṁ pāpicchataṁ … uppannaṁ pāpamittataṁ abhibhuyya abhibhuyya vihareyya.",
    "an8.8:12": "Tasmātiha, bhikkhave, evaṁ sikkhitabbaṁ:  \"uppannaṁ lābhaṁ abhibhuyya abhibhuyya viharissāma, uppannaṁ alābhaṁ … pe … uppannaṁ yasaṁ … uppannaṁ ayasaṁ … uppannaṁ sakkāraṁ … uppannaṁ asakkāraṁ … uppannaṁ pāpicchataṁ … uppannaṁ pāpamittataṁ abhibhuyya abhibhuyya viharissāmā\"ti. Evañhi vo, bhikkhave, sikkhitabban’ti.",
    "an8.8:13": "Ettāvatā, bhante uttara, manussesu catasso parisā – bhikkhū, bhikkhuniyo, upāsakā, upāsikāyo. Nāyaṁ dhammapariyāyo kismiñci upaṭṭhito. Uggaṇhatu, bhante, āyasmā uttaro imaṁ dhammapariyāyaṁ. Pariyāpuṇātu, bhante, āyasmā uttaro imaṁ dhammapariyāyaṁ. Dhāretu, bhante, āyasmā uttaro imaṁ dhammapariyāyaṁ. Atthasaṁhito ayaṁ, bhante, dhammapariyāyo ādibrahmacariyako\"ti."
}