{
    "an8.74:1": "Ekaṁ samayaṁ bhagavā nātike viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi … pe … maraṇassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṁsā amatogadhā amatapariyosānā.",
    "an8.74:2": "Kathaṁ bhāvitā ca, bhikkhave, maraṇassati kathaṁ bahulīkatā mahapphalā hoti mahānisaṁsā amatogadhā amatapariyosānā?",
    "an8.74:3": "Sace, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘atthi me pāpakā akusalā dhammā appahīnā ye me assu rattiṁ kālaṁ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā tesaṁyeva pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṁ.",
    "an8.74:4": "Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṁ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṁ kho, bhikkhave, tena bhikkhunā tesaṁyeva pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṁ.",
    "an8.74:5": "Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘Natthi me pāpakā akusalā dhammā appahīnā ye me assu rattiṁ kālaṁ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā teneva pītipāmojjena vihātabbaṁ ahorattānusikkhinā kusalesu dhammesu.",
    "an8.74:6": "Idha pana, bhikkhave, bhikkhu rattiyā nikkhantāya divase patihite iti paṭisañcikkhati:  ‘bahukā kho me paccayā maraṇassa – ahi vā maṁ ḍaṁseyya, vicchiko vā maṁ ḍaṁseyya, satapadī vā maṁ ḍaṁseyya; tena me assa kālakiriyā. So mama assa antarāyo.",
    "an8.74:7": "Sace, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘atthi me pāpakā akusalā dhammā appahīnā ye me assu divā kālaṁ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā tesaṁyeva pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṁ.",
    "an8.74:8": "Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṁ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṁ kho, bhikkhave, tena bhikkhunā tesaṁyeva pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṁ.",
    "an8.74:9": "Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṁ jānāti:  ‘Natthi me pāpakā akusalā dhammā appahīnā ye me assu divā kālaṁ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā teneva pītipāmojjena vihātabbaṁ ahorattānusikkhinā kusalesu dhammesu."
}