{
    "an8.28:1": "Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho āyasmantaṁ sāriputtaṁ bhagavā etadavoca:",
    "an8.28:2": "Katamāni aṭṭha?",
    "an8.28:3": "Puna caparaṁ, bhante, khīṇāsavassa bhikkhuno aṅgārakāsūpamā kāmā yathābhūtaṁ sammappaññāya sudiṭṭhā honti. Yampi, bhante, khīṇāsavassa bhikkhuno aṅgārakāsūpamā kāmā yathābhūtaṁ sammappaññāya sudiṭṭhā honti, idampi, bhante, khīṇāsavassa bhikkhuno balaṁ hoti, yaṁ balaṁ āgamma khīṇāsavo bhikkhu āsavānaṁ khayaṁ paṭijānāti:  ‘khīṇā me āsavā’ti.(2)",
    "an8.28:4": "Puna caparaṁ, bhante, khīṇāsavassa bhikkhuno vivekaninnaṁ cittaṁ hoti vivekapoṇaṁ vivekapabbhāraṁ vivekaṭṭhaṁ nekkhammābhirataṁ byantibhūtaṁ sabbaso āsavaṭṭhāniyehi dhammehi. Yampi, bhante, khīṇāsavassa bhikkhuno vivekaninnaṁ cittaṁ hoti vivekapoṇaṁ vivekapabbhāraṁ vivekaṭṭhaṁ nekkhammābhirataṁ byantibhūtaṁ sabbaso āsavaṭṭhāniyehi dhammehi, idampi, bhante, khīṇāsavassa bhikkhuno balaṁ hoti, yaṁ balaṁ āgamma khīṇāsavo bhikkhu āsavānaṁ khayaṁ paṭijānāti:  ‘khīṇā me āsavā’ti.(3)",
    "an8.28:5": "Puna caparaṁ, bhante, khīṇāsavassa bhikkhuno cattāro satipaṭṭhānā bhāvitā honti subhāvitā. Yampi, bhante, khīṇāsavassa bhikkhuno cattāro satipaṭṭhānā bhāvitā honti subhāvitā, idampi, bhante, khīṇāsavassa bhikkhuno balaṁ hoti, yaṁ balaṁ āgamma khīṇāsavo bhikkhu āsavānaṁ khayaṁ paṭijānāti:  ‘khīṇā me āsavā’ti.(4)",
    "an8.28:6": "Puna caparaṁ, bhante, khīṇāsavassa bhikkhuno cattāro iddhipādā bhāvitā honti subhāvitā … pe … pañcindriyāni bhāvitāni honti subhāvitāni … pe … satta bojjhaṅgā bhāvitā honti subhāvitā … pe … ariyo aṭṭhaṅgiko maggo bhāvito hoti subhāvito. Yampi, bhante, khīṇāsavassa bhikkhuno ariyo aṭṭhaṅgiko maggo bhāvito hoti subhāvito, idampi, bhante, khīṇāsavassa bhikkhuno balaṁ hoti, yaṁ balaṁ āgamma khīṇāsavo bhikkhu āsavānaṁ khayaṁ paṭijānāti:  ‘khīṇā me āsavā’ti. (5–8.)",
    "an8.28:7": "Imāni kho, bhante, aṭṭha khīṇāsavassa bhikkhuno balāni, yehi balehi samannāgato khīṇāsavo bhikkhu āsavānaṁ khayaṁ paṭijānāti:  ‘khīṇā me āsavā’\"ti."
}