{
    "an8.6:1": "\"Aṭṭhime, bhikkhave, lokadhammā lokaṁ anuparivattanti, loko ca aṭṭha lokadhamme anuparivattati. Katame aṭṭha? Lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṁsā ca, sukhañca, dukkhañca. Ime kho, bhikkhave, aṭṭha lokadhammā lokaṁ anuparivattanti, loko ca ime aṭṭha lokadhamme anuparivattati.",
    "an8.6:2": "Assutavato, bhikkhave, puthujjanassa uppajjati lābhopi alābhopi yasopi ayasopi nindāpi pasaṁsāpi sukhampi dukkhampi. Sutavatopi, bhikkhave, ariyasāvakassa uppajjati lābhopi alābhopi yasopi ayasopi nindāpi pasaṁsāpi sukhampi dukkhampi. Tatra, bhikkhave, ko viseso ko adhippayāso kiṁ nānākaraṇaṁ sutavato ariyasāvakassa assutavatā puthujjanenā\"ti?",
    "an8.6:3": "\"Tena hi, bhikkhave, suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "an8.6:4": "Tassa lābhopi cittaṁ pariyādāya tiṭṭhati, alābhopi cittaṁ pariyādāya tiṭṭhati, yasopi cittaṁ pariyādāya tiṭṭhati, ayasopi cittaṁ pariyādāya tiṭṭhati, nindāpi cittaṁ pariyādāya tiṭṭhati, pasaṁsāpi cittaṁ pariyādāya tiṭṭhati, sukhampi cittaṁ pariyādāya tiṭṭhati, dukkhampi cittaṁ pariyādāya tiṭṭhati. So uppannaṁ lābhaṁ anurujjhati, alābhe paṭivirujjhati; uppannaṁ yasaṁ anurujjhati, ayase paṭivirujjhati; uppannaṁ pasaṁsaṁ anurujjhati, nindāya paṭivirujjhati; uppannaṁ sukhaṁ anurujjhati, dukkhe paṭivirujjhati. So evaṁ anurodhavirodhasamāpanno na parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi. ‘Na parimuccati dukkhasmā’ti vadāmi.",
    "an8.6:5": "Sutavato ca kho, bhikkhave, ariyasāvakassa uppajjati lābho. So iti paṭisañcikkhati:  ‘uppanno kho me ayaṁ lābho; so ca kho anicco dukkho vipariṇāmadhammo’ti yathābhūtaṁ pajānāti. Uppajjati alābho … pe … uppajjati yaso … uppajjati ayaso … uppajjati nindā … uppajjati pasaṁsā … uppajjati sukhaṁ … uppajjati dukkhaṁ. So iti paṭisañcikkhati:  ‘uppannaṁ kho me idaṁ dukkhaṁ; tañca kho aniccaṁ dukkhaṁ vipariṇāmadhamman’ti yathābhūtaṁ pajānāti.",
    "an8.6:6": "Tassa lābhopi cittaṁ na pariyādāya tiṭṭhati, alābhopi cittaṁ na pariyādāya tiṭṭhati, yasopi cittaṁ na pariyādāya tiṭṭhati, ayasopi cittaṁ na pariyādāya tiṭṭhati, nindāpi cittaṁ na pariyādāya tiṭṭhati, pasaṁsāpi cittaṁ na pariyādāya tiṭṭhati, sukhampi cittaṁ na pariyādāya tiṭṭhati, dukkhampi cittaṁ na pariyādāya tiṭṭhati. So uppannaṁ lābhaṁ nānurujjhati, alābhe nappaṭivirujjhati; uppannaṁ yasaṁ nānurujjhati, ayase nappaṭivirujjhati; uppannaṁ pasaṁsaṁ nānurujjhati, nindāya nappaṭivirujjhati; uppannaṁ sukhaṁ nānurujjhati, dukkhe nappaṭivirujjhati. So evaṁ anurodhavirodhavippahīno parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi. ‘Parimuccati dukkhasmā’ti vadāmi.",
    "an8.6:7": "Lābho alābho ca yasāyaso ca,Nindā pasaṁsā ca sukhaṁ dukhañca;Ete aniccā manujesu dhammā,Asassatā vipariṇāmadhammā.",
    "an8.6:8": "Ete ca ñatvā satimā sumedho,Avekkhati vipariṇāmadhamme;Iṭṭhassa dhammā na mathenti cittaṁ,Aniṭṭhato no paṭighātameti.",
    "an8.6:9": "Tassānurodhā atha vā virodhā,Vidhūpitā atthaṅgatā na santi;Padañca ñatvā virajaṁ asokaṁ,Sammappajānāti bhavassa pāragū\"ti."
}