{
    "an8.41:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi:  \"bhikkhavo\"ti.",
    "an8.41:2": "\"Aṭṭhaṅgasamannāgato, bhikkhave, uposatho upavuttho mahapphalo hoti mahānisaṁso mahājutiko mahāvipphāro. Kathaṁ upavuttho ca, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṁso mahājutiko mahāvipphāro?",
    "an8.41:3": "‘Yāvajīvaṁ arahanto adinnādānaṁ pahāya adinnādānā paṭiviratā dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharanti. Ahampajja imañca rattiṁ imañca divasaṁ adinnādānaṁ pahāya adinnādānā paṭivirato dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharāmi. Imināpaṅgena arahataṁ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā dutiyena aṅgena samannāgato hoti.(2)",
    "an8.41:4": "‘Yāvajīvaṁ arahanto abrahmacariyaṁ pahāya brahmacārino ārācārino viratā methunā gāmadhammā. Ahampajja imañca rattiṁ imañca divasaṁ abrahmacariyaṁ pahāya brahmacārī ārācārī virato methunā gāmadhammā. Imināpaṅgena arahataṁ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā tatiyena aṅgena samannāgato hoti.(3)",
    "an8.41:5": "‘Yāvajīvaṁ arahanto musāvādaṁ pahāya musāvādā paṭiviratā saccavādino saccasandhā thetā paccayikā avisaṁvādako lokassa. Ahampajja imañca rattiṁ imañca divasaṁ musāvādaṁ pahāya musāvādā paṭivirato saccavādī saccasandho theto paccayiko avisaṁvādako lokassa. Imināpaṅgena arahataṁ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā catutthena aṅgena samannāgato hoti.(4)",
    "an8.41:6": "‘Yāvajīvaṁ arahanto surāmerayamajjapamādaṭṭhānaṁ pahāya surāmerayamajjapamādaṭṭhānā paṭiviratā. Ahampajja imañca rattiṁ imañca divasaṁ surāmerayamajjapamādaṭṭhānaṁ pahāya surāmerayamajjapamādaṭṭhānā paṭivirato. Imināpaṅgena arahataṁ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā pañcamena aṅgena samannāgato hoti.(5)",
    "an8.41:7": "‘Yāvajīvaṁ arahanto ekabhattikā rattūparatā viratā vikālabhojanā. Ahampajja imañca rattiṁ imañca divasaṁ ekabhattiko rattūparato virato vikālabhojanā. Imināpaṅgena arahataṁ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā chaṭṭhena aṅgena samannāgato hoti.(6)",
    "an8.41:8": "‘Yāvajīvaṁ arahanto naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānaṁ pahāya naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭiviratā. Ahampajja imañca rattiṁ imañca divasaṁ naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānaṁ pahāya naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato. Imināpaṅgena arahataṁ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā sattamena aṅgena samannāgato hoti.(7)",
    "an8.41:9": "‘Yāvajīvaṁ arahanto uccāsayanamahāsayanaṁ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṁ kappenti – mañcake vā tiṇasanthārake vā. Ahampajja imañca rattiṁ imañca divasaṁ uccāsayanamahāsayanaṁ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṁ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṁ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti.(8)",
    "an8.41:10": "Evaṁ upavuttho kho, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṁso mahājutiko mahāvipphāro\"ti."
}