{
    "an8.23:1": "Ekaṁ samayaṁ bhagavā āḷaviyaṁ viharati aggāḷave cetiye. Tatra kho bhagavā bhikkhū āmantesi:  \"",
    "an8.23:2": "Atha kho aññataro bhikkhu pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena hatthakassa āḷavakassa nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho hatthako āḷavako yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṁ bhikkhuṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho hatthakaṁ āḷavakaṁ so bhikkhu etadavoca:",
    "an8.23:3": "\"Sattahi kho tvaṁ, āvuso, acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato. Katamehi sattahi? ‘Saddho, bhikkhave, hatthako āḷavako; sīlavā … pe … hirīmā … ottappī … bahussuto … cāgavā … paññavā, bhikkhave, hatthako āḷavako’ti. Imehi kho tvaṁ, āvuso, sattahi acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato\"ti. \"Kaccittha, bhante, na koci gihī ahosi odātavasano\"ti? \"Na hettha, āvuso, koci gihī ahosi odātavasano\"ti. \"Sādhu, bhante, yadettha na koci gihī ahosi odātavasano\"ti.",
    "an8.23:4": "Atha kho so bhikkhu hatthakassa āḷavakassa nivesane piṇḍapātaṁ gahetvā uṭṭhāyāsanā pakkāmi. Atha kho so bhikkhu pacchābhattaṁ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho so bhikkhu bhagavantaṁ etadavoca:",
    "an8.23:5": "\"Idhāhaṁ, bhante, pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena hatthakassa āḷavakassa nivesanaṁ tenupasaṅkamiṁ; upasaṅkamitvā paññatte āsane nisīdiṁ. Atha kho, bhante, hatthako āḷavako yenāhaṁ tenupasaṅkami; upasaṅkamitvā maṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho ahaṁ, bhante, hatthakaṁ āḷavakaṁ etadavacaṁ:  ‘sattahi kho tvaṁ, āvuso, acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato. Katamehi sattahi? Saddho, bhikkhave, hatthako āḷavako; sīlavā … pe … hirīmā … ottappī … bahussuto … cāgavā … paññavā, bhikkhave, hatthako āḷavakoti. Imehi kho tvaṁ, āvuso, sattahi acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato’ti.",
    "an8.23:6": "Evaṁ vutte, bhante, hatthako maṁ etadavoca:  ‘kaccittha, bhante, na koci gihī ahosi odātavasano’ti? ‘Na hettha, āvuso, koci gihī ahosi odātavasano’ti. ‘Sādhu, bhante, yadettha na koci gihī ahosi odātavasano’\"ti.",
    "an8.23:7": "\"Sādhu sādhu, bhikkhu. Appiccho so, bhikkhu, kulaputto. Santeyeva attani kusaladhamme na icchati parehi ñāyamāne. Tena hi tvaṁ, bhikkhu, imināpi aṭṭhamena acchariyena abbhutena dhammena samannāgataṁ hatthakaṁ āḷavakaṁ dhārehi, yadidaṁ appicchatāyā\"ti."
}