{
    "an8.10:1": "Ekaṁ samayaṁ bhagavā campāyaṁ viharati gaggarāya pokkharaṇiyā tīre. Tena kho pana samayena bhikkhū bhikkhuṁ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno aññenāññaṁ paṭicarati, bahiddhā kathaṁ apanāmeti, kopañca dosañca appaccayañca pātukaroti.",
    "an8.10:2": "Atha kho bhagavā bhikkhū āmantesi:  \"niddhamathetaṁ, bhikkhave, puggalaṁ; niddhamathetaṁ, bhikkhave, puggalaṁ. Apaneyyeso, bhikkhave, puggalo. Kiṁ vo tena paraputtena visodhitena.",
    "an8.10:3": "Seyyathāpi, bhikkhave, sampanne yavakaraṇe yavadūsī jāyetha yavapalāpo yavakāraṇḍavoti. Tassa tādisaṁyeva mūlaṁ hoti, seyyathāpi aññesaṁ bhaddakānaṁ yavānaṁ; tādisaṁyeva nāḷaṁ hoti, seyyathāpi aññesaṁ bhaddakānaṁ yavānaṁ; tādisaṁyeva pattaṁ hoti, seyyathāpi aññesaṁ bhaddakānaṁ yavānaṁ – yāvassa sīsaṁ na nibbattati. Yato ca khvassa sīsaṁ nibbattati, tamenaṁ evaṁ jānanti:  ‘yavadūsīvāyaṁ yavapalāpo yavakāraṇḍavo’ti. Tamenaṁ iti viditvā samūlaṁ uppāṭetvā bahiddhā yavakaraṇassa chaḍḍenti. Taṁ kissa hetu? Mā aññe bhaddake yave dūsesīti.",
    "an8.10:4": "Evamevaṁ kho, bhikkhave, idhekaccassa puggalassa tādisaṁyeva hoti abhikkantaṁ paṭikkantaṁ ālokitaṁ vilokitaṁ samiñjitaṁ pasāritaṁ saṅghāṭipattacīvaradhāraṇaṁ, seyyathāpi aññesaṁ bhaddakānaṁ bhikkhūnaṁ – yāvassa bhikkhū āpattiṁ na passanti. Yato ca khvassa bhikkhū āpattiṁ passanti, tamenaṁ evaṁ jānanti:  ‘samaṇadūsīvāyaṁ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṁ iti viditvā bahiddhā nāsenti. Taṁ kissa hetu? Mā aññe bhaddake bhikkhū dūsesīti.",
    "an8.10:5": "Seyyathāpi, bhikkhave, mahato dhaññarāsissa phuṇamānassa tattha yāni tāni dhaññāni daḷhāni sāravantāni tāni ekamantaṁ puñjaṁ hoti, yāni pana tāni dhaññāni dubbalāni palāpāni tāni vāto ekamantaṁ apavahati. Tamenaṁ sāmikā sammajjaniṁ gahetvā bhiyyoso mattāya apasammajjanti. Taṁ kissa hetu? Mā aññe bhaddake dhaññe dūsesīti.",
    "an8.10:6": "Seyyathāpi, bhikkhave, puriso udapānapanāḷiyatthiko tiṇhaṁ kuṭhāriṁ ādāya vanaṁ paviseyya. So yaṁ yadeva rukkhaṁ kuṭhāripāsena ākoṭeyya tattha yāni tāni rukkhāni daḷhāni sāravantāni tāni kuṭhāripāsena ākoṭitāni kakkhaḷaṁ paṭinadanti; yāni pana tāni rukkhāni antopūtīni avassutāni kasambujātāni tāni kuṭhāripāsena ākoṭitāni daddaraṁ paṭinadanti. Tamenaṁ mūle chindati, mūle chinditvā agge chindati, agge chinditvā anto suvisodhitaṁ visodheti, anto suvisodhitaṁ visodhetvā udapānapanāḷiṁ yojeti.",
    "an8.10:7": "Saṁvāsāyaṁ vijānātha,pāpiccho kodhano iti;Makkhī thambhī paḷāsī ca,issukī maccharī saṭho.",
    "an8.10:8": "Santavāco janavati,samaṇo viya bhāsati;Raho karoti karaṇaṁ,pāpadiṭṭhi anādaro.",
    "an8.10:9": "Saṁsappī ca musāvādī,taṁ viditvā yathātathaṁ;Sabbe samaggā hutvāna,abhinibbajjayātha naṁ.",
    "an8.10:10": "Kāraṇḍavaṁ niddhamatha,Kasambuṁ apakassatha;Tato palāpe vāhetha,Assamaṇe samaṇamānine.",
    "an8.10:11": "Niddhamitvāna pāpicche,pāpaācāragocare;Suddhāsuddhehi saṁvāsaṁ,kappayavho patissatā;Tato samaggā nipakā,dukkhassantaṁ karissathā\"ti.",
    "an8.10:12": "Mettaṁ paññā ca dve piyā,dve lokā dve vipattiyo;Devadatto ca uttaro,nando kāraṇḍavena cāti."
}