{
    "an8.55:1": "Atha kho ujjayo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho ujjayo brāhmaṇo bhagavantaṁ etadavoca:",
    "an8.55:2": "\"Cattārome, brāhmaṇa, dhammā kulaputtassa diṭṭhadhammahitāya saṁvattanti, diṭṭhadhammasukhāya. Katame cattāro? Uṭṭhānasampadā, ārakkhasampadā, kalyāṇamittatā, samajīvitā.",
    "an8.55:3": "Katamā ca, brāhmaṇa, uṭṭhānasampadā? Idha, brāhmaṇa, kulaputto yena kammaṭṭhānena jīvikaṁ kappeti – yadi kasiyā, yadi vaṇijjāya, yadi gorakkhena, yadi issattena, yadi rājaporisena, yadi sippaññatarena – tattha dakkho hoti analaso, tatrupāyāya vīmaṁsāya samannāgato, alaṁ kātuṁ alaṁ saṁvidhātuṁ. Ayaṁ vuccati, brāhmaṇa, uṭṭhānasampadā. (1:1)",
    "an8.55:4": "Katamā ca, brāhmaṇa, ārakkhasampadā? Idha, brāhmaṇa, kulaputtassa bhogā honti uṭṭhānavīriyādhigatā, bāhābalaparicitā, sedāvakkhittā, dhammikā dhammaladdhā. Te ārakkhena guttiyā sampādeti:  ‘Kinti me ime bhoge neva rājāno hareyyuṁ, na corā hareyyuṁ, na aggi ḍaheyya, na udakaṁ vaheyya, na appiyā dāyādā hareyyun’ti. Ayaṁ vuccati, brāhmaṇa, ārakkhasampadā. (2:2)",
    "an8.55:5": "Katamā ca, brāhmaṇa, kalyāṇamittatā? Idha, brāhmaṇa, kulaputto yasmiṁ gāme vā nigame vā paṭivasati tatra ye te honti – gahapatī vā gahapatiputtā vā daharā vā vuddhasīlino, vuddhā vā vuddhasīlino, saddhāsampannā, sīlasampannā, cāgasampannā, paññāsampannā – tehi saddhiṁ santiṭṭhati sallapati sākacchaṁ samāpajjati; yathārūpānaṁ saddhāsampannānaṁ saddhāsampadaṁ anusikkhati, yathārūpānaṁ sīlasampannānaṁ sīlasampadaṁ anusikkhati, yathārūpānaṁ cāgasampannānaṁ cāgasampadaṁ anusikkhati, yathārūpānaṁ paññāsampannānaṁ paññāsampadaṁ anusikkhati. Ayaṁ vuccati, brāhmaṇa, kalyāṇamittatā. (3:3)",
    "an8.55:6": "Katamā ca, brāhmaṇa, samajīvitā? Idha, brāhmaṇa, kulaputto āyañca bhogānaṁ viditvā vayañca bhogānaṁ viditvā samaṁ jīvikaṁ kappeti nāccogāḷhaṁ nātihīnaṁ:  ‘evaṁ me āyo vayaṁ pariyādāya ṭhassati, na ca me vayo āyaṁ pariyādāya ṭhassatī’ti. Seyyathāpi, brāhmaṇa, tulādhāro vā tulādhārantevāsī vā tulaṁ paggahetvā jānāti:  ‘ettakena vā onataṁ, ettakena vā unnatan’ti; evamevaṁ kho, brāhmaṇa, kulaputto āyañca bhogānaṁ viditvā vayañca bhogānaṁ viditvā samaṁ jīvikaṁ kappeti nāccogāḷhaṁ nātihīnaṁ:  ‘evaṁ me āyo vayaṁ pariyādāya ṭhassati, na ca me vayo āyaṁ pariyādāya ṭhassatī’ti. Sacāyaṁ, brāhmaṇa, kulaputto appāyo samāno uḷāraṁ jīvikaṁ kappeti, tassa bhavanti vattāro:  ‘udumbarakhādīvāyaṁ kulaputto bhoge khādatī’ti. Sace panāyaṁ, brāhmaṇa, kulaputto mahāyo samāno kasiraṁ jīvikaṁ kappeti, tassa bhavanti vattāro:  ‘ajeṭṭhamaraṇaṁvāyaṁ kulaputto marissatī’ti. Yato ca khoyaṁ, brāhmaṇa, kulaputto āyañca bhogānaṁ viditvā vayañca bhogānaṁ viditvā samaṁ jīvikaṁ kappeti nāccogāḷhaṁ nātihīnaṁ:  ‘evaṁ me āyo vayaṁ pariyādāya ṭhassati, na ca me vayo āyaṁ pariyādāya ṭhassatī’ti, ayaṁ vuccati, brāhmaṇa, samajīvitā.",
    "an8.55:7": "Evaṁ samuppannānaṁ, brāhmaṇa, bhogānaṁ cattāri apāyamukhāni honti – itthidhutto, surādhutto, akkhadhutto, pāpamitto pāpasahāyo pāpasampavaṅko. Seyyathāpi, brāhmaṇa, mahato taḷākassa cattāri ceva āyamukhāni, cattāri ca apāyamukhāni. Tassa puriso yāni ceva āyamukhāni tāni pidaheyya, yāni ca apāyamukhāni tāni vivareyya; devo ca na sammā dhāraṁ anuppaveccheyya. Evañhi tassa, brāhmaṇa, mahato taḷākassa parihāniyeva pāṭikaṅkhā, no vuddhi; evamevaṁ kho, brāhmaṇa, evaṁ samuppannānaṁ bhogānaṁ cattāri apāyamukhāni honti – itthidhutto, surādhutto, akkhadhutto, pāpamitto pāpasahāyo pāpasampavaṅko.",
    "an8.55:8": "Evaṁ samuppannānaṁ, brāhmaṇa, bhogānaṁ cattāri āyamukhāni honti – na itthidhutto, na surādhutto, na akkhadhutto, kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko. Seyyathāpi, brāhmaṇa, mahato taḷākassa cattāri ceva āyamukhāni cattāri ca apāyamukhāni. Tassa puriso yāni ceva āyamukhāni tāni vivareyya, yāni ca apāyamukhāni tāni pidaheyya; devo ca sammā dhāraṁ anuppaveccheyya. Evañhi tassa, brāhmaṇa, mahato taḷākassa vuddhiyeva pāṭikaṅkhā, no parihāni; evamevaṁ kho, brāhmaṇa, evaṁ samuppannānaṁ bhogānaṁ cattāri āyamukhāni honti – na itthidhutto … pe … kalyāṇasampavaṅko. (4:4)",
    "an8.55:9": "Ime kho, brāhmaṇa, cattāro dhammā kulaputtassa diṭṭhadhammahitāya saṁvattanti diṭṭhadhammasukhāya.",
    "an8.55:10": "Cattārome, brāhmaṇa, kulaputtassa dhammā samparāyahitāya saṁvattanti samparāyasukhāya. Katame cattāro? Saddhāsampadā, sīlasampadā, cāgasampadā, paññāsampadā. Katamā ca, brāhmaṇa, saddhāsampadā? Idha, brāhmaṇa, kulaputto saddho hoti, saddahati tathāgatassa bodhiṁ:  ‘itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavā’ti. Ayaṁ vuccati, brāhmaṇa, saddhāsampadā. (1:5)",
    "an8.55:11": "Katamā ca, brāhmaṇa, sīlasampadā? Idha, brāhmaṇa, kulaputto pāṇātipātā paṭivirato hoti … pe … surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Ayaṁ vuccati, brāhmaṇa, sīlasampadā. (2:6)",
    "an8.55:12": "Katamā ca, brāhmaṇa, cāgasampadā? Idha, brāhmaṇa, kulaputto vigatamalamaccherena cetasā agāraṁ ajjhāvasati muttacāgo payatapāṇi vosaggarato yācayogo dānasaṁvibhāgarato. Ayaṁ vuccati, brāhmaṇa, cāgasampadā. (3:7)",
    "an8.55:13": "Katamā ca, brāhmaṇa, paññāsampadā? Idha, brāhmaṇa, kulaputto paññavā hoti … pe … sammā dukkhakkhayagāminiyā. Ayaṁ vuccati, brāhmaṇa, paññāsampadā. (4:8)",
    "an8.55:14": "\"Ime kho, brāhmaṇa, cattāro dhammā kulaputtassa samparāyahitāya saṁvattanti samparāyasukhāyāti.",
    "an8.55:15": "Uṭṭhātā kammadheyyesu,appamatto vidhānavā;Samaṁ kappeti jīvikaṁ,sambhataṁ anurakkhati.",
    "an8.55:16": "Saddho sīlena sampanno,vadaññū vītamaccharo;Niccaṁ maggaṁ visodheti,sotthānaṁ samparāyikaṁ.",
    "an8.55:17": "Iccete aṭṭha dhammā ca,saddhassa gharamesino;Akkhātā saccanāmena,ubhayattha sukhāvahā.",
    "an8.55:18": "Diṭṭhadhammahitatthāya,samparāyasukhāya ca;Evametaṁ gahaṭṭhānaṁ,cāgo puññaṁ pavaḍḍhatī\"ti."
}