{
    "an8.51:1": "Ekaṁ samayaṁ bhagavā sakkesu viharati kapilavatthusmiṁ nigrodhārāme. Atha kho mahāpajāpatī gotamī yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitā kho mahāpajāpatī gotamī bhagavantaṁ etadavoca:",
    "an8.51:2": "Dutiyampi kho mahāpajāpatī gotamī bhagavantaṁ etadavoca:  \"Sādhu, bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjan\"ti. \"Alaṁ, gotami. Mā te rucci mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjā\"ti.",
    "an8.51:3": "Tatiyampi kho mahāpajāpatī gotamī bhagavantaṁ etadavoca:  \"Sādhu, bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjan\"ti.",
    "an8.51:4": "Atha kho mahāpajāpatī gotamī \"na bhagavā anujānāti mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjan\"ti dukkhī dummanā assumukhī rudamānā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā pakkāmi.",
    "an8.51:5": "Atha kho bhagavā kapilavatthusmiṁ yathābhirantaṁ viharitvā yena vesālī tena cārikaṁ pakkāmi. Anupubbena cārikaṁ caramāno yena vesālī tadavasari. Tatra sudaṁ bhagavā vesāliyaṁ viharati mahāvane kūṭāgārasālāyaṁ.",
    "an8.51:6": "Addasā kho āyasmā ānando mahāpajāpatiṁ gotamiṁ sūnehi pādehi rajokiṇṇena gattena dukkhiṁ dummanaṁ assumukhiṁ rudamānaṁ bahidvārakoṭṭhake ṭhitaṁ. Disvāna mahāpajāpatiṁ gotamiṁ etadavoca:",
    "an8.51:7": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:  \"Esā, bhante, mahāpajāpatī gotamī sūnehi pādehi rajokiṇṇena gattena dukkhī dummanā assumukhī rudamānā bahidvārakoṭṭhake ṭhitā:  ‘Na bhagavā anujānāti mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjan’ti. Sādhu, bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjan\"ti.",
    "an8.51:8": "Dutiyampi kho … pe … tatiyampi kho āyasmā ānando bhagavantaṁ etadavoca:  \"Sādhu, bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjan\"ti.",
    "an8.51:9": "Atha kho āyasmato ānandassa etadahosi:  \"na bhagavā anujānāti mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjaṁ. Yannūnāhaṁ aññenapi pariyāyena bhagavantaṁ yāceyyaṁ mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjan\"ti.",
    "an8.51:10": "\"Sace, ānanda, mahāpajāpatī gotamī aṭṭha garudhamme paṭiggaṇhāti, sāvassā hotu upasampadā –",
    "an8.51:11": "Vassasatūpasampannāya bhikkhuniyā tadahūpasampannassa bhikkhuno abhivādanaṁ paccuṭṭhānaṁ añjalikammaṁ sāmīcikammaṁ kattabbaṁ. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo.(1)",
    "an8.51:12": "Na bhikkhuniyā abhikkhuke āvāse vassaṁ upagantabbaṁ. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo.(2)",
    "an8.51:13": "Anvaḍḍhamāsaṁ bhikkhuniyā bhikkhusaṅghato dve dhammā paccāsīsitabbā – uposathapucchakañca, ovādūpasaṅkamanañca. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo.(3)",
    "an8.51:14": "Vassaṁvuṭṭhāya bhikkhuniyā ubhatosaṅghe tīhi ṭhānehi pavāretabbaṁ – diṭṭhena vā sutena vā parisaṅkāya vā. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo.(4)",
    "an8.51:15": "Garudhammaṁ ajjhāpannāya bhikkhuniyā ubhatosaṅghe pakkhamānattaṁ caritabbaṁ. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo.(5)",
    "an8.51:16": "Dve vassāni chasu dhammesu sikkhitasikkhāya sikkhamānāya ubhatosaṅghe upasampadā pariyesitabbā. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo.(6)",
    "an8.51:17": "Na kenaci pariyāyena bhikkhuniyā bhikkhu akkositabbo paribhāsitabbo. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo.(7)",
    "an8.51:18": "Ajjatagge ovaṭo bhikkhunīnaṁ bhikkhūsu vacanapatho, anovaṭo bhikkhūnaṁ bhikkhunīsu vacanapatho. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo.(8)",
    "an8.51:19": "Sace, ānanda, mahāpajāpatī gotamī ime aṭṭha garudhamme paṭiggaṇhāti, sāvassā hotu upasampadā\"ti.",
    "an8.51:20": "Atha kho āyasmā ānando bhagavato santike ime aṭṭha garudhamme uggahetvā yena mahāpajāpatī gotamī tenupasaṅkami; upasaṅkamitvā mahāpajāpatiṁ gotamiṁ etadavoca:",
    "an8.51:21": "\"Sace kho tvaṁ, gotami, aṭṭha garudhamme paṭiggaṇheyyāsi, sāva te bhavissati upasampadā –",
    "an8.51:22": "Vassasatūpasampannāya bhikkhuniyā tadahūpasampannassa bhikkhuno abhivādanaṁ paccuṭṭhānaṁ añjalikammaṁ sāmīcikammaṁ kattabbaṁ. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo … pe ….",
    "an8.51:23": "Ajjatagge ovaṭo bhikkhunīnaṁ bhikkhūsu vacanapatho, anovaṭo bhikkhūnaṁ bhikkhunīsu vacanapatho. Ayampi dhammo sakkatvā garuṁ katvā mānetvā pūjetvā yāvajīvaṁ anatikkamanīyo.",
    "an8.51:24": "\"Seyyathāpi, bhante ānanda, itthī vā puriso vā daharo yuvā maṇḍanakajātiko sīsaṁnhāto uppalamālaṁ vā vassikamālaṁ vā adhimuttakamālaṁ vā labhitvā ubhohi hatthehi paṭiggahetvā uttamaṅge sirasmiṁ patiṭṭhāpeyya; evamevaṁ kho ahaṁ, bhante ānanda, ime aṭṭha garudhamme paṭiggaṇhāmi yāvajīvaṁ anatikkamanīye\"ti.",
    "an8.51:25": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:  \"paṭiggahitā, bhante, mahāpajāpatiyā gotamiyā aṭṭha garudhammā yāvajīvaṁ anatikkamanīyā\"ti.",
    "an8.51:26": "\"Sace, ānanda, nālabhissa mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajjaṁ, ciraṭṭhitikaṁ, ānanda, brahmacariyaṁ abhavissa, vassasahassameva saddhammo tiṭṭheyya. Yato ca kho, ānanda, mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṁ pabbajito, na dāni, ānanda, brahmacariyaṁ ciraṭṭhitikaṁ bhavissati. Pañceva dāni, ānanda, vassasatāni saddhammo ṭhassati.",
    "an8.51:27": "Seyyathāpi, ānanda, yāni kānici kulāni bahutthikāni appapurisakāni, tāni suppadhaṁsiyāni honti corehi kumbhatthenakehi; evamevaṁ kho, ānanda, yasmiṁ dhammavinaye labhati mātugāmo agārasmā anagāriyaṁ pabbajjaṁ, na taṁ brahmacariyaṁ ciraṭṭhitikaṁ hoti.",
    "an8.51:28": "Seyyathāpi, ānanda, sampanne sālikkhette setaṭṭhikā nāma rogajāti nipatati, evaṁ taṁ sālikkhettaṁ na ciraṭṭhitikaṁ hoti; evamevaṁ kho, ānanda, yasmiṁ dhammavinaye labhati mātugāmo agārasmā anagāriyaṁ pabbajjaṁ, na taṁ brahmacariyaṁ ciraṭṭhitikaṁ hoti.",
    "an8.51:29": "Seyyathāpi, ānanda, sampanne ucchukkhette mañjiṭṭhikā nāma rogajāti nipatati, evaṁ taṁ ucchukkhettaṁ na ciraṭṭhitikaṁ hoti; evamevaṁ kho, ānanda, yasmiṁ dhammavinaye labhati mātugāmo agārasmā anagāriyaṁ pabbajjaṁ, na taṁ brahmacariyaṁ ciraṭṭhitikaṁ hoti.",
    "an8.51:30": "Seyyathāpi, ānanda, puriso mahato taḷākassa paṭikacceva āḷiṁ bandheyya yāvadeva udakassa anatikkamanāya; evamevaṁ kho, ānanda, mayā paṭikacceva bhikkhunīnaṁ aṭṭha garudhammā paññattā yāvajīvaṁ anatikkamanīyā\"ti."
}