{
    "an8.46:1": "Ekaṁ samayaṁ bhagavā kosambiyaṁ viharati ghositārāme. Tena kho pana samayena āyasmā anuruddho divāvihāraṁ gato hoti paṭisallīno. Atha kho sambahulā manāpakāyikā devatā yenāyasmā anuruddho tenupasaṅkamiṁsu; upasaṅkamitvā āyasmantaṁ anuruddhaṁ abhivādetvā ekamantaṁ aṭṭhaṁsu. Ekamantaṁ ṭhitā kho tā devatā āyasmantaṁ anuruddhaṁ etadavocuṁ:",
    "an8.46:2": "Atha kho āyasmato anuruddhassa etadahosi:  \"aho vatimā devatā sabbāva nīlā assu nīlavaṇṇā nīlavatthā nīlālaṅkārā\"ti. Atha kho tā devatā āyasmato anuruddhassa cittamaññāya sabbāva nīlā ahesuṁ nīlavaṇṇā nīlavatthā nīlālaṅkārā.",
    "an8.46:3": "Atha kho āyasmato anuruddhassa etadahosi:  \"aho vatimā devatā sabbāva pītā assu … pe … sabbāva lohitakā assu … sabbāva odātā assu odātavaṇṇā odātavatthā odātālaṅkārā\"ti. Atha kho tā devatā āyasmato anuruddhassa cittamaññāya sabbāva odātā ahesuṁ odātavaṇṇā odātavatthā odātālaṅkārā.",
    "an8.46:4": "Atha kho tā devatā ekā ca gāyi ekā ca nacci ekā ca accharaṁ vādesi. Seyyathāpi nāma pañcaṅgikassa tūriyassa suvinītassa suppaṭipatāḷitassa kusalehi susamannāhatassa saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca; evamevaṁ tāsaṁ devatānaṁ alaṅkārānaṁ saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca. Atha kho āyasmā anuruddho indriyāni okkhipi.",
    "an8.46:5": "Atha kho tā devatā \"na khvayyo anuruddho sādiyatī\"ti tatthevantaradhāyiṁsu.",
    "an8.46:6": "\"Idhāhaṁ, bhante, divāvihāraṁ gato homi paṭisallīno. Atha kho, bhante, sambahulā manāpakāyikā devatā yenāhaṁ tenupasaṅkamiṁsu; upasaṅkamitvā maṁ abhivādetvā ekamantaṁ aṭṭhaṁsu. Ekamantaṁ ṭhitā kho, bhante, tā devatā maṁ etadavocuṁ:  ‘Mayaṁ, bhante anuruddha, manāpakāyikā nāma devatā tīsu ṭhānesu issariyaṁ kārema vasaṁ vattema. Mayaṁ, bhante anuruddha, yādisakaṁ vaṇṇaṁ ākaṅkhāma tādisakaṁ vaṇṇaṁ ṭhānaso paṭilabhāma; yādisakaṁ saraṁ ākaṅkhāma tādisakaṁ saraṁ ṭhānaso paṭilabhāma; yādisakaṁ sukhaṁ ākaṅkhāma tādisakaṁ sukhaṁ ṭhānaso paṭilabhāma. Mayaṁ, bhante anuruddha, manāpakāyikā nāma devatā imesu tīsu ṭhānesu issariyaṁ kārema vasaṁ vattemā’ti. Tassa mayhaṁ, bhante, etadahosi:  ‘aho vatimā devatā sabbāva nīlā assu nīlavaṇṇā nīlavatthā nīlālaṅkārā’ti. Atha kho, bhante, tā devatā mama cittamaññāya sabbāva nīlā ahesuṁ nīlavaṇṇā nīlavatthā nīlālaṅkārā.",
    "an8.46:7": "Tassa mayhaṁ, bhante, etadahosi:  ‘aho vatimā devatā sabbāva pītā assu … pe … sabbāva lohitakā assu … pe … sabbāva odātā assu odātavaṇṇā odātavatthā odātālaṅkārā’ti. Atha kho, bhante, tā devatā mama cittamaññāya sabbāva odātā ahesuṁ odātavaṇṇā odātavatthā odātālaṅkārā.",
    "an8.46:8": "Atha kho, bhante, tā devatā ekā ca gāyi ekā ca nacci ekā ca accharaṁ vādesi. Seyyathāpi nāma pañcaṅgikassa tūriyassa suvinītassa suppaṭipatāḷitassa kusalehi susamannāhatassa saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca; evamevaṁ tāsaṁ devatānaṁ alaṅkārānaṁ saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca. Atha khvāhaṁ, bhante, indriyāni okkhipi.",
    "an8.46:9": "Atha kho, bhante, tā devatā ‘Na khvayyo anuruddho sādiyatī’ti tatthevantaradhāyiṁsu.",
    "an8.46:10": "\"Aṭṭhahi kho, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṁ maraṇā manāpakāyikānaṁ devānaṁ sahabyataṁ upapajjati.",
    "an8.46:11": "Ye te bhattu garuno honti – mātāti vā pitāti vā samaṇabrāhmaṇāti vā – te sakkaroti, garuṁ karoti, māneti, pūjeti, abbhāgate ca āsanodakena paṭipūjeti.(2)",
    "an8.46:12": "Ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya vīmaṁsāya samannāgatā alaṁ kātuṁ alaṁ saṁvidhātuṁ.(3)",
    "an8.46:13": "Yo so bhattu abbhantaro antojano – dāsāti vā pessāti vā kammakarāti vā – tesaṁ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṁ jānāti khādanīyaṁ bhojanīyañcassa paccaṁsena saṁvibhajati.(4)",
    "an8.46:14": "Yaṁ bhattu āharati dhanaṁ vā dhaññaṁ vā jātarūpaṁ vā taṁ ārakkhena guttiyā sampādeti, tattha ca hoti adhuttī athenī asoṇḍī avināsikā.(5)",
    "an8.46:15": "Upāsikā kho pana hoti buddhaṁ saraṇaṁ gatā dhammaṁ saraṇaṁ gatā saṅghaṁ saraṇaṁ gatā.(6)",
    "an8.46:16": "Sīlavatī kho pana hoti – pāṇātipātā paṭiviratā, adinnādānā paṭiviratā, kāmesumicchācārā paṭiviratā, musāvādā paṭiviratā, surāmerayamajjapamādaṭṭhānā paṭiviratā.(7)",
    "an8.46:17": "Cāgavatī kho pana hoti. Vigatamalamaccherena cetasā agāraṁ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṁvibhāgaratā.(8)",
    "an8.46:18": "Imehi kho, anuruddha, aṭṭhahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṁ maraṇā manāpakāyikānaṁ devānaṁ sahabyataṁ upapajjatīti.",
    "an8.46:19": "Yo naṁ bharati sabbadā,niccaṁ ātāpi ussuko;Taṁ sabbakāmadaṁ posaṁ,bhattāraṁ nātimaññati.",
    "an8.46:20": "Na cāpi sotthi bhattāraṁ,issāvādena rosaye;Bhattu ca garuno sabbe,paṭipūjeti paṇḍitā.",
    "an8.46:21": "Uṭṭhāhikā analasā,saṅgahitaparijjanā;Bhattu manāpaṁ carati,sambhataṁ anurakkhati.",
    "an8.46:22": "Yā evaṁ vattati nārī,bhattu chandavasānugā;Manāpā nāma te devā,yattha sā upapajjatī\"ti."
}