{
    "an8.77:1": "Tatra kho āyasmā sāriputto bhikkhū āmantesi:  \"āvuso bhikkhavo\"ti.",
    "an8.77:2": "\"Aṭṭhime, āvuso, puggalā santo saṁvijjamānā lokasmiṁ. Katame aṭṭha? Idhāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati, ghaṭati, vāyamati lābhāya. Tassa uṭṭhahato, ghaṭato, vāyamato lābhāya lābho nuppajjati. So tena alābhena socati kilamati paridevati, urattāḷiṁ kandati, sammohaṁ āpajjati. Ayaṁ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, uṭṭhahati, ghaṭati, vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’.(1)",
    "an8.77:3": "Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati, ghaṭati, vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho uppajjati. So tena lābhena majjati pamajjati pamādamāpajjati. Ayaṁ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, lābhī ca, madī ca pamādī ca, cuto ca saddhammā’.(2)",
    "an8.77:4": "Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya lābho nuppajjati. So tena alābhena socati kilamati paridevati, urattāḷiṁ kandati, sammohaṁ āpajjati. Ayaṁ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’.(3)",
    "an8.77:5": "Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya lābho uppajjati. So tena lābhena majjati pamajjati pamādamāpajjati. Ayaṁ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati na ghaṭati na vāyamati lābhāya, lābhī ca, madī ca pamādī ca, cuto ca saddhammā’.(4)",
    "an8.77:6": "Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati, ghaṭati, vāyamati lābhāya. Tassa uṭṭhahato, ghaṭato, vāyamato lābhāya, lābho nuppajjati. So tena alābhena na socati na kilamati na paridevati, na urattāḷiṁ kandati, na sammohaṁ āpajjati. Ayaṁ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, na ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’.(5)",
    "an8.77:7": "Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati, ghaṭati, vāyamati lābhāya. Tassa uṭṭhahato, ghaṭato, vāyamato lābhāya, lābho uppajjati. So tena lābhena na majjati na pamajjati na pamādamāpajjati. Ayaṁ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, uṭṭhahati, ghaṭati, vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā’.(6)",
    "an8.77:8": "Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya, lābho nuppajjati. So tena alābhena na socati na kilamati na paridevati, na urattāḷiṁ kandati, na sammohaṁ āpajjati. Ayaṁ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, na ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’.(7)",
    "an8.77:9": "Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya, lābho uppajjati. So tena lābhena na majjati na pamajjati na pamādamāpajjati. Ayaṁ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā’. Ime kho, āvuso, aṭṭha puggalā santo saṁvijjamānā lokasmin\"ti.(8)"
}