{
    "an8.34:1": "\"Aṭṭhaṅgasamannāgate, bhikkhave, khette bījaṁ vuttaṁ na mahapphalaṁ hoti na mahassādaṁ na phātiseyyaṁ. Kathaṁ aṭṭhaṅgasamannāgate?",
    "an8.34:2": "Evamevaṁ kho, bhikkhave, aṭṭhaṅgasamannāgatesu samaṇabrāhmaṇesu dānaṁ dinnaṁ na mahapphalaṁ hoti na mahānisaṁsaṁ na mahājutikaṁ na mahāvipphāraṁ. Kathaṁ aṭṭhaṅgasamannāgatesu? Idha, bhikkhave, samaṇabrāhmaṇā micchādiṭṭhikā honti, micchāsaṅkappā, micchāvācā, micchākammantā, micchāājīvā, micchāvāyāmā, micchāsatino, micchāsamādhino. Evaṁ aṭṭhaṅgasamannāgatesu, bhikkhave, samaṇabrāhmaṇesu dānaṁ dinnaṁ na mahapphalaṁ hoti na mahānisaṁsaṁ na mahājutikaṁ na mahāvipphāraṁ.",
    "an8.34:3": "Aṭṭhaṅgasamannāgate, bhikkhave, khette bījaṁ vuttaṁ mahapphalaṁ hoti mahassādaṁ phātiseyyaṁ. Kathaṁ aṭṭhaṅgasamannāgate?",
    "an8.34:4": "Evamevaṁ kho, bhikkhave, aṭṭhaṅgasamannāgatesu samaṇabrāhmaṇesu dānaṁ dinnaṁ mahapphalaṁ hoti mahānisaṁsaṁ mahājutikaṁ mahāvipphāraṁ. Kathaṁ aṭṭhaṅgasamannāgatesu? Idha, bhikkhave, samaṇabrāhmaṇā sammādiṭṭhikā honti, sammāsaṅkappā, sammāvācā, sammākammantā, sammāājīvā, sammāvāyāmā, sammāsatino, sammāsamādhino. Evaṁ aṭṭhaṅgasamannāgatesu, bhikkhave, samaṇabrāhmaṇesu dānaṁ dinnaṁ mahapphalaṁ hoti mahānisaṁsaṁ mahājutikaṁ mahāvipphāranti.",
    "an8.34:5": "Yathāpi khette sampanne,pavuttā bījasampadā;Deve sampādayantamhi,hoti dhaññassa sampadā.",
    "an8.34:6": "Anītisampadā hoti,virūḷhī bhavati sampadā;Vepullasampadā hoti,phalaṁ ve hoti sampadā.",
    "an8.34:7": "Evaṁ sampannasīlesu,dinnā bhojanasampadā;Sampadānaṁ upaneti,sampannaṁ hissa taṁ kataṁ.",
    "an8.34:8": "Tasmā sampadamākaṅkhī,sampannatthūdha puggalo;Sampannapaññe sevetha,evaṁ ijjhanti sampadā.",
    "an8.34:9": "Vijjācaraṇasampanne,laddhā cittassa sampadaṁ;Karoti kammasampadaṁ,labhati catthasampadaṁ.",
    "an8.34:10": "Lokaṁ ñatvā yathābhūtaṁ,pappuyya diṭṭhisampadaṁ;Maggasampadamāgamma,yāti sampannamānaso.",
    "an8.34:11": "Odhunitvā malaṁ sabbaṁ,patvā nibbānasampadaṁ;Muccati sabbadukkhehi,sā hoti sabbasampadā\"ti."
}