{
    "an8.86:1": "Ekaṁ samayaṁ bhagavā kosalesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ yena icchānaṅgalaṁ nāma kosalānaṁ brāhmaṇagāmo tadavasari. Tatra sudaṁ bhagavā icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Assosuṁ kho icchānaṅgalakā brāhmaṇagahapatikā:  \"Samaṇo khalu bho gotamo sakyaputto sakyakulā pabbajito icchānaṅgalaṁ anuppatto icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato:  ‘itipi so bhagavā arahaṁ sammāsambuddho … pe … sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī’\"ti.",
    "an8.86:2": "Atha kho icchānaṅgalakā brāhmaṇagahapatikā tassā rattiyā accayena pahutaṁ khādanīyaṁ bhojanīyaṁ ādāya yena icchānaṅgalavanasaṇḍo tenupasaṅkamiṁsu; upasaṅkamitvā bahidvārakoṭṭhake aṭṭhaṁsu uccāsaddā mahāsaddā. Tena kho pana samayena āyasmā nāgito bhagavato upaṭṭhāko hoti. Atha kho bhagavā āyasmantaṁ nāgitaṁ āmantesi:  \"ke pana te, nāgita, uccāsaddā mahāsaddā kevaṭṭā maññe macchavilope\"ti?",
    "an8.86:3": "\"Adhivāsetu dāni, bhante, bhagavā. Adhivāsetu sugato. Adhivāsanakālo dāni, bhante, bhagavato. Yena yeneva dāni, bhante, bhagavā gamissati tanninnāva bhavissanti brāhmaṇagahapatikā negamā ceva jānapadā ca. Seyyathāpi, bhante, thullaphusitake deve vassante yathāninnaṁ udakāni pavattanti; evamevaṁ kho, bhante, yena yeneva dāni bhagavā gamissati tanninnāva bhavissanti brāhmaṇagahapatikā negamā ceva jānapadā ca. Taṁ kissa hetu? Tathā hi, bhante, bhagavato sīlapaññāṇan\"ti.",
    "an8.86:4": "\"Māhaṁ, nāgita, yasena samāgamaṁ, mā ca mayā yaso. Yo kho, nāgita, nayimassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī assa akicchalābhī akasiralābhī. Yassāhaṁ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī, so taṁ mīḷhasukhaṁ middhasukhaṁ lābhasakkārasilokasukhaṁ sādiyeyya.",
    "an8.86:5": "Devatāpi kho, nāgita, ekaccā nayimassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhiniyo assu akicchalābhiniyo akasiralābhiniyo, yassāhaṁ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī.",
    "an8.86:6": "Idhāhaṁ, nāgita, bhikkhū passāmi aññamaññaṁ aṅgulipatodakena sañjagghante saṅkīḷante. Tassa mayhaṁ, nāgita, evaṁ hoti:  ‘Na hi nūname āyasmanto imassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhino assu akicchalābhino akasiralābhino. Yassāhaṁ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī. Tathā hi paname āyasmanto aññamaññaṁ aṅgulipatodakena sañjagghanti saṅkīḷanti’.(1)",
    "an8.86:7": "Idha panāhaṁ, nāgita, bhikkhū passāmi yāvadatthaṁ udarāvadehakaṁ bhuñjitvā seyyasukhaṁ passasukhaṁ middhasukhaṁ anuyutte viharante. Tassa mayhaṁ, nāgita, evaṁ hoti:  ‘Na hi nūname āyasmanto imassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhino assu akicchalābhino akasiralābhino. Yassāhaṁ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī. Tathā hi paname āyasmanto yāvadatthaṁ udarāvadehakaṁ bhuñjitvā seyyasukhaṁ passasukhaṁ middhasukhaṁ anuyuttā viharanti’.(2)",
    "an8.86:8": "Idhāhaṁ, nāgita, bhikkhuṁ passāmi gāmantavihāriṁ samāhitaṁ nisinnaṁ. Tassa mayhaṁ, nāgita, evaṁ hoti:  ‘idāni imaṁ āyasmantaṁ ārāmiko vā upaṭṭhahissati samaṇuddeso vā. Taṁ tamhā samādhimhā cāvessatī’ti. Tenāhaṁ, nāgita, tassa bhikkhuno na attamano homi gāmantavihārena.(3)",
    "an8.86:9": "Idha panāhaṁ, nāgita, bhikkhuṁ passāmi āraññikaṁ araññe pacalāyamānaṁ nisinnaṁ. Tassa mayhaṁ, nāgita, evaṁ hoti:  ‘idāni ayamāyasmā imaṁ niddākilamathaṁ paṭivinodetvā araññasaññaṁyeva manasi karissati ekattan’ti. Tenāhaṁ, nāgita, tassa bhikkhuno attamano homi araññavihārena.(4)",
    "an8.86:10": "Idha panāhaṁ, nāgita, bhikkhuṁ passāmi āraññikaṁ araññe asamāhitaṁ nisinnaṁ. Tassa mayhaṁ, nāgita, evaṁ hoti:  ‘idāni ayamāyasmā asamāhitaṁ vā cittaṁ samādahissati, samāhitaṁ vā cittaṁ anurakkhissatī’ti. Tenāhaṁ, nāgita, tassa bhikkhuno attamano homi araññavihārena.(5)",
    "an8.86:11": "Idha panāhaṁ, nāgita, bhikkhuṁ passāmi āraññikaṁ araññe samāhitaṁ nisinnaṁ. Tassa mayhaṁ, nāgita, evaṁ hoti:  ‘idāni ayamāyasmā avimuttaṁ vā cittaṁ vimuccissati, vimuttaṁ vā cittaṁ anurakkhissatī’ti. Tenāhaṁ, nāgita, tassa bhikkhuno attamano homi araññavihārena.(6)",
    "an8.86:12": "Idha panāhaṁ, nāgita, bhikkhuṁ passāmi gāmantavihāriṁ lābhiṁ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkārānaṁ. So taṁ lābhasakkārasilokaṁ nikāmayamāno riñcati paṭisallānaṁ, riñcati araññavanapatthāni pantāni senāsanāni; gāmanigamarājadhāniṁ osaritvā vāsaṁ kappeti. Tenāhaṁ, nāgita, tassa bhikkhuno na attamano homi gāmantavihārena.(7)",
    "an8.86:13": "Idha panāhaṁ, nāgita, bhikkhuṁ passāmi āraññikaṁ lābhiṁ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkārānaṁ. So taṁ lābhasakkārasilokaṁ paṭipaṇāmetvā na riñcati paṭisallānaṁ, na riñcati araññavanapatthāni pantāni senāsanāni. Tenāhaṁ, nāgita, tassa bhikkhuno attamano homi araññavihārena.(8)",
    "an8.86:14": "Yasmāhaṁ, nāgita, samaye addhānamaggappaṭipanno na kañci passāmi purato vā pacchato vā, phāsu me, nāgita, tasmiṁ samaye hoti antamaso uccārapassāvakammāyā\"ti."
}