{
    "an8.49:1": "Ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā yena bhagavā tenupasaṅkami … pe …. Ekamantaṁ nisinnaṁ kho visākhaṁ migāramātaraṁ bhagavā etadavoca:",
    "an8.49:2": "\"Catūhi kho, visākhe, dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṁsa loko āraddho hoti. Katamehi catūhi? Idha, visākhe, mātugāmo susaṁvihitakammanto hoti, saṅgahitaparijano, bhattu manāpaṁ carati, sambhataṁ anurakkhati.",
    "an8.49:3": "Kathañca, visākhe, mātugāmo susaṁvihitakammanto hoti? Idha, visākhe, mātugāmo ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya vīmaṁsāya samannāgatā alaṁ kātuṁ alaṁ saṁvidhātuṁ. Evaṁ kho, visākhe, mātugāmo susaṁvihitakammanto hoti.(1)",
    "an8.49:4": "Kathañca, visākhe, mātugāmo saṅgahitaparijano hoti? Idha, visākhe, mātugāmo yo so bhattu abbhantaro antojano – dāsāti vā pessāti vā kammakarāti vā – tesaṁ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṁ jānāti khādanīyaṁ bhojanīyañcassa paccaṁsena saṁvibhajati. Evaṁ kho, visākhe, mātugāmo saṅgahitaparijano hoti.(2)",
    "an8.49:5": "Kathañca, visākhe, mātugāmo bhattu manāpaṁ carati? Idha, visākhe, mātugāmo yaṁ bhattu amanāpasaṅkhātaṁ taṁ jīvitahetupi na ajjhācarati. Evaṁ kho, visākhe, mātugāmo bhattu manāpaṁ carati.(3)",
    "an8.49:6": "Kathañca, visākhe, mātugāmo sambhataṁ anurakkhati? Idha, visākhe, mātugāmo yaṁ bhattā āharati dhanaṁ vā dhaññaṁ vā rajataṁ vā jātarūpaṁ vā taṁ ārakkhena guttiyā sampādeti, tattha ca hoti adhuttī athenī asoṇḍī avināsikā. Evaṁ kho, visākhe, mātugāmo sambhataṁ anurakkhati.",
    "an8.49:7": "Catūhi kho, visākhe, dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hoti. Katamehi catūhi? Idha, visākhe, mātugāmo saddhāsampanno hoti, sīlasampanno hoti, cāgasampanno hoti, paññāsampanno hoti.",
    "an8.49:8": "Kathañca, visākhe, mātugāmo saddhāsampanno hoti? Idha, visākhe, mātugāmo saddho hoti, saddahati tathāgatassa bodhiṁ:  ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. Evaṁ kho, visākhe, mātugāmo saddhāsampanno hoti.(5)",
    "an8.49:9": "Kathañca, visākhe, mātugāmo sīlasampanno hoti? Idha, visākhe, mātugāmo pāṇātipātā paṭivirato hoti … pe … surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Evaṁ kho, visākhe, mātugāmo sīlasampanno hoti.(6)",
    "an8.49:10": "Kathañca, visākhe, mātugāmo cāgasampanno hoti? Idha, visākhe, mātugāmo vigatamalamaccherena cetasā agāraṁ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṁvibhāgaratā. Evaṁ kho, visākhe, mātugāmo cāgasampanno hoti.(7)",
    "an8.49:11": "Kathañca, visākhe, mātugāmo paññāsampanno hoti? Idha, visākhe, mātugāmo paññavā hoti … pe … evaṁ kho, visākhe, mātugāmo paññāsampanno hoti.(8)",
    "an8.49:12": "Imehi kho, visākhe, catūhi dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hotīti.",
    "an8.49:13": "Susaṁvihitakammantā,saṅgahitaparijjanā;Bhattu manāpaṁ carati,sambhataṁ anurakkhati.",
    "an8.49:14": "Saddhā sīlena sampannā,vadaññū vītamaccharā;Niccaṁ maggaṁ visodheti,sotthānaṁ samparāyikaṁ.",
    "an8.49:15": "Iccete aṭṭha dhammā ca,yassā vijjanti nāriyā;Tampi sīlavatiṁ āhu,dhammaṭṭhaṁ saccavādiniṁ.",
    "an8.49:16": "Soḷasākārasampannā,Aṭṭhaṅgasusamāgatā;Tādisī sīlavatī upāsikā,Upapajjati devalokaṁ manāpan\"ti."
}