{
    "an9.26:1": "Ekaṁ samayaṁ āyasmā ca sāriputto āyasmā ca candikāputto rājagahe viharanti veḷuvane kalandakanivāpe. Tatra kho āyasmā candikāputto bhikkhū āmantesi:",
    "an9.26:2": "Evaṁ vutte, āyasmā sāriputto āyasmantaṁ candikāputtaṁ etadavoca:  \"na kho, āvuso candikāputta, devadatto bhikkhūnaṁ evaṁ dhammaṁ deseti:  ‘yato kho, āvuso, bhikkhuno cetasā citaṁ hoti, tassetaṁ bhikkhuno kallaṁ veyyākaraṇāya – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti. Evañca kho, āvuso, candikāputta, devadatto bhikkhūnaṁ dhammaṁ deseti:  ‘yato kho, āvuso, bhikkhuno cetasā cittaṁ suparicitaṁ hoti, tassetaṁ bhikkhuno kallaṁ veyyākaraṇāya – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’\"ti.",
    "an9.26:3": "Dutiyampi kho āyasmā candikāputto bhikkhū āmantesi:  \"devadatto, āvuso, bhikkhūnaṁ evaṁ dhammaṁ deseti:  ‘yato kho, āvuso, bhikkhuno cetasā citaṁ hoti, tassetaṁ bhikkhuno kallaṁ veyyākaraṇāya – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’\"ti. Dutiyampi kho āyasmā sāriputto āyasmantaṁ candikāputtaṁ etadavoca:  \"na kho, āvuso candikāputta, devadatto bhikkhūnaṁ evaṁ dhammaṁ deseti:  ‘yato kho, āvuso, bhikkhuno cetasā citaṁ hoti, tassetaṁ bhikkhuno kallaṁ veyyākaraṇāya – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti. Evañca kho, āvuso candikāputta, devadatto bhikkhūnaṁ dhammaṁ deseti:  ‘yato kho, āvuso, bhikkhuno cetasā cittaṁ suparicitaṁ hoti, tassetaṁ bhikkhuno kallaṁ veyyākaraṇāya – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’\"ti.",
    "an9.26:4": "Tatiyampi kho āyasmā candikāputto bhikkhū āmantesi:  \"devadatto, āvuso, bhikkhūnaṁ evaṁ dhammaṁ deseti:  ‘yato kho, āvuso, bhikkhuno cetasā citaṁ hoti, tassetaṁ bhikkhuno kallaṁ veyyākaraṇāya – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’\"ti. Tatiyampi kho āyasmā sāriputto āyasmantaṁ candikāputtaṁ etadavoca:  \"na kho, āvuso candikāputta, devadatto bhikkhūnaṁ evaṁ dhammaṁ deseti:  ‘yato kho, āvuso, bhikkhuno cetasā citaṁ hoti, tassetaṁ bhikkhuno kallaṁ veyyākaraṇāya – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti. Evañca kho, āvuso candikāputta, devadatto bhikkhūnaṁ dhammaṁ deseti:  ‘yato kho, āvuso, bhikkhuno cetasā cittaṁ suparicitaṁ hoti, tassetaṁ bhikkhuno kallaṁ veyyākaraṇāya – khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmī’ti.",
    "an9.26:5": "Kathañca, āvuso, bhikkhuno cetasā cittaṁ suparicitaṁ hoti? ‘Vītarāgaṁ me cittan’ti cetasā cittaṁ suparicitaṁ hoti; ‘vītadosaṁ me cittan’ti cetasā cittaṁ suparicitaṁ hoti; ‘vītamohaṁ me cittan’ti cetasā cittaṁ suparicitaṁ hoti; ‘asarāgadhammaṁ me cittan’ti cetasā cittaṁ suparicitaṁ hoti; ‘asadosadhammaṁ me cittan’ti cetasā cittaṁ suparicitaṁ hoti; ‘asamohadhammaṁ me cittan’ti cetasā cittaṁ suparicitaṁ hoti; ‘anāvattidhammaṁ me cittaṁ kāmabhavāyā’ti cetasā cittaṁ suparicitaṁ hoti; ‘anāvattidhammaṁ me cittaṁ rūpabhavāyā’ti cetasā cittaṁ suparicitaṁ hoti; ‘anāvattidhammaṁ me cittaṁ arūpabhavāyā’ti cetasā cittaṁ suparicitaṁ hoti.",
    "an9.26:6": "Seyyathāpi, āvuso, silāyūpo soḷasakukkuko. Tassassu aṭṭha kukkū heṭṭhā nemaṅgamā, aṭṭha kukkū upari nemassa. Atha puratthimāya cepi disāya āgaccheyya bhusā vātavuṭṭhi, neva naṁ saṅkampeyya na sampavedheyya; atha pacchimāya … atha uttarāya … atha dakkhiṇāya cepi disāya āgaccheyya bhusā vātavuṭṭhi, neva naṁ saṅkampeyya na sampavedheyya. Taṁ kissa hetu? Gambhīrattā, āvuso, nemassa, sunikhātattā silāyūpassa. Evamevaṁ kho, āvuso, sammā vimuttacittassa bhikkhuno bhusā cepi cakkhuviññeyyā rūpā cakkhussa āpāthaṁ āgacchanti, nevassa cittaṁ pariyādiyanti; amissīkatamevassa cittaṁ hoti ṭhitaṁ āneñjappattaṁ, vayaṁ cassānupassati.",
    "an9.26:7": "Bhusā cepi sotaviññeyyā saddā … ghānaviññeyyā gandhā … jivhāviññeyyā rasā … kāyaviññeyyā phoṭṭhabbā … manoviññeyyā dhammā manassa āpāthaṁ āgacchanti, nevassa cittaṁ pariyādiyanti; amissīkatamevassa cittaṁ hoti ṭhitaṁ āneñjappattaṁ, vayaṁ cassānupassatī\"ti."
}