{
    "an9.22:1": "\"Tayo ca, bhikkhave, assakhaḷuṅke desessāmi tayo ca purisakhaḷuṅke tayo ca assaparasse tayo ca purisaparasse tayo ca bhadde assājānīye tayo ca bhadde purisājānīye. Taṁ suṇātha.",
    "an9.22:2": "Katame ca, bhikkhave, tayo assakhaḷuṅkā? Idha, bhikkhave, ekacco assakhaḷuṅko javasampanno hoti, na vaṇṇasampanno, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo assakhaḷuṅkā.",
    "an9.22:3": "Katame ca, bhikkhave, tayo purisakhaḷuṅkā? Idha, bhikkhave, ekacco purisakhaḷuṅko javasampanno hoti, na vaṇṇasampanno, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca.",
    "an9.22:4": "Kathañca, bhikkhave, purisakhaḷuṅko javasampanno hoti, na vaṇṇasampanno na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti. Idamassa javasmiṁ vadāmi. Abhidhamme kho pana abhivinaye pañhaṁ puṭṭho saṁsādeti, no vissajjeti. Idamassa na vaṇṇasmiṁ vadāmi. Na kho pana lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkārānaṁ. Idamassa na ārohapariṇāhasmiṁ vadāmi. Evaṁ kho, bhikkhave, purisakhaḷuṅko javasampanno hoti, na vaṇṇasampanno na ārohapariṇāhasampanno.",
    "an9.22:5": "Kathañca, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti … pe … ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti. Idamassa javasmiṁ vadāmi. Abhidhamme kho pana abhivinaye pañhaṁ puṭṭho vissajjeti, no saṁsādeti. Idamassa vaṇṇasmiṁ vadāmi. Na kho pana lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkārānaṁ. Idamassa na ārohapariṇāhasmiṁ vadāmi. Evaṁ kho, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno.",
    "an9.22:6": "Kathañca, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti … pe … ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti. Idamassa javasmiṁ vadāmi. Abhidhamme kho pana abhivinaye pañhaṁ puṭṭho vissajjeti, no saṁsādeti. Idamassa vaṇṇasmiṁ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkārānaṁ. Idamassa ārohapariṇāhasmiṁ vadāmi. Evaṁ kho, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo purisakhaḷuṅkā.",
    "an9.22:7": "Katame ca, bhikkhave, tayo assaparassā? Idha, bhikkhave, ekacco assaparasso … pe … javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo assaparassā.",
    "an9.22:8": "Katame ca, bhikkhave, tayo purisaparassā? Idha, bhikkhave, ekacco purisaparasso … pe … javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca.",
    "an9.22:9": "Kathañca, bhikkhave, purisaparasso … pe … javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti, tattha parinibbāyī anāvattidhammo tasmā lokā. Idamassa javasmiṁ vadāmi. Abhidhamme kho pana abhivinaye pañhaṁ puṭṭho vissajjeti, no saṁsādeti. Idamassa vaṇṇasmiṁ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkārānaṁ. Idamassa ārohapariṇāhasmiṁ vadāmi. Evaṁ kho, bhikkhave, purisaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo purisaparassā.",
    "an9.22:10": "Katame ca, bhikkhave, tayo bhaddā assājānīyā? Idha, bhikkhave, ekacco bhaddo assājānīyo … pe … javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo bhaddā assājānīyā.",
    "an9.22:11": "Katame ca, bhikkhave, tayo bhaddā purisājānīyā? Idha, bhikkhave, ekacco bhaddo purisājānīyo … pe … javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca.",
    "an9.22:12": "Kathañca, bhikkhave, bhaddo purisājānīyo … pe … javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharati. Idamassa javasmiṁ vadāmi. Abhidhamme kho pana abhivinaye pañhaṁ puṭṭho vissajjeti, no saṁsādeti. Idamassa vaṇṇasmiṁ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkārānaṁ. Idamassa ārohapariṇāhasmiṁ vadāmi. Evaṁ kho, bhikkhave, bhaddo purisājānīyo javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo bhaddā purisājānīyā\"ti."
}