{
    "an9.40:1": "\"Yasmiṁ, bhikkhave, samaye āraññikassa nāgassa gocarapasutassa hatthīpi hatthiniyopi hatthikalabhāpi hatthicchāpāpi purato purato gantvā tiṇaggāni chindanti, tena, bhikkhave, āraññiko nāgo aṭṭīyati harāyati jigucchati. Yasmiṁ, bhikkhave, samaye āraññikassa nāgassa gocarapasutassa hatthīpi hatthiniyopi hatthikalabhāpi hatthicchāpāpi obhaggobhaggaṁ sākhābhaṅgaṁ khādanti, tena, bhikkhave, āraññiko nāgo aṭṭīyati harāyati jigucchati. Yasmiṁ, bhikkhave, samaye āraññikassa nāgassa ogāhaṁ otiṇṇassa hatthīpi hatthiniyopi hatthikalabhāpi hatthicchāpāpi purato purato gantvā soṇḍāya udakaṁ āloḷenti, tena, bhikkhave, āraññiko nāgo aṭṭīyati harāyati jigucchati. Yasmiṁ, bhikkhave, samaye āraññikassa nāgassa ogāhā uttiṇṇassa hatthiniyo kāyaṁ upanighaṁsantiyo gacchanti, tena, bhikkhave, āraññiko nāgo aṭṭīyati harāyati jigucchati.",
    "an9.40:2": "Tasmiṁ, bhikkhave, samaye āraññikassa nāgassa evaṁ hoti:  ‘Ahaṁ kho etarahi ākiṇṇo viharāmi hatthīhi hatthinīhi hatthikalabhehi hatthicchāpehi. Chinnaggāni ceva tiṇāni khādāmi, obhaggobhaggañca me sākhābhaṅgaṁ khādanti, āvilāni ca pānīyāni pivāmi, ogāhā ca me uttiṇṇassa hatthiniyo kāyaṁ upanighaṁsantiyo gacchanti. Yannūnāhaṁ eko gaṇasmā vūpakaṭṭho vihareyyan’ti.",
    "an9.40:3": "Tasmiṁ, bhikkhave, samaye āraññikassa nāgassa evaṁ hoti:  ‘Ahaṁ kho pubbe ākiṇṇo vihāsiṁ hatthīhi hatthinīhi hatthikalabhehi hatthicchāpehi, chinnaggāni ceva tiṇāni khādiṁ, obhaggobhaggañca me sākhābhaṅgaṁ khādiṁsu, āvilāni ca pānīyāni apāyiṁ, ogāhā ca me uttiṇṇassa hatthiniyo kāyaṁ upanighaṁsantiyo agamaṁsu. Sohaṁ etarahi eko gaṇasmā vūpakaṭṭho viharāmi, acchinnaggāni ceva tiṇāni khādāmi, obhaggobhaggañca me sākhābhaṅgaṁ na khādanti, anāvilāni ca pānīyāni pivāmi, ogāhā ca me uttiṇṇassa na hatthiniyo kāyaṁ upanighaṁsantiyo gacchantī’ti. So soṇḍāya sākhābhaṅgaṁ bhañjitvā sākhābhaṅgena kāyaṁ parimajjitvā attamano soṇḍaṁ saṁharati.",
    "an9.40:4": "Evamevaṁ kho, bhikkhave, yasmiṁ samaye bhikkhu ākiṇṇo viharati bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi raññā rājamahāmattehi titthiyehi titthiyasāvakehi, tasmiṁ, bhikkhave, samaye bhikkhussa evaṁ hoti:  ‘Ahaṁ kho etarahi ākiṇṇo viharāmi bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi raññā rājamahāmattehi titthiyehi titthiyasāvakehi. Yannūnāhaṁ eko gaṇasmā vūpakaṭṭho vihareyyan’ti.",
    "an9.40:5": "So abhijjhaṁ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṁ parisodheti; byāpādapadosaṁ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṁ parisodheti; thinamiddhaṁ pahāya vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṁ parisodheti; uddhaccakukkuccaṁ pahāya anuddhato viharati ajjhattaṁ vūpasantacitto, uddhaccakukkuccā cittaṁ parisodheti; vicikicchaṁ pahāya tiṇṇavicikiccho viharati akathaṅkathī kusalesu dhammesu, vicikicchāya cittaṁ parisodheti.",
    "an9.40:6": "Sabbaso rūpasaññānaṁ samatikkamā paṭighasaññānaṁ atthaṅgamā nānattasaññānaṁ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṁ upasampajja viharati. So attamano soṇḍaṁ saṁharati."
}