{
    "an9.41:1": "Ekaṁ samayaṁ bhagavā mallesu viharati uruvelakappaṁ nāma mallānaṁ nigamo. Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya uruvelakappaṁ piṇḍāya pāvisi. Uruvelakappe piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkanto āyasmantaṁ ānandaṁ āmantesi:  \"idheva tāva tvaṁ, ānanda, hohi, yāvāhaṁ mahāvanaṁ ajjhogāhāmi divāvihārāyā\"ti.",
    "an9.41:2": "Atha kho tapusso gahapati yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṁ ānandaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho tapusso gahapati āyasmantaṁ ānandaṁ etadavoca:",
    "an9.41:3": "\"Mayaṁ, bhante ānanda, gihī kāmabhogino kāmārāmā kāmaratā kāmasammuditā. Tesaṁ no, bhante, amhākaṁ gihīnaṁ kāmabhogīnaṁ kāmārāmānaṁ kāmaratānaṁ kāmasammuditānaṁ papāto viya khāyati, yadidaṁ nekkhammaṁ. Sutaṁ metaṁ, bhante, ‘imasmiṁ dhammavinaye daharānaṁ daharānaṁ bhikkhūnaṁ nekkhamme cittaṁ pakkhandati pasīdati santiṭṭhati vimuccati etaṁ santanti passato’. Tayidaṁ, bhante, imasmiṁ dhammavinaye bhikkhūnaṁ bahunā janena visabhāgo, yadidaṁ nekkhamman\"ti.",
    "an9.41:4": "\"Atthi kho etaṁ, gahapati, kathāpābhataṁ bhagavantaṁ dassanāya. Āyāma, gahapati, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavato etamatthaṁ ārocessāma. Yathā no bhagavā byākarissati tathā naṁ dhāressāmā\"ti.",
    "an9.41:5": "\"Evaṁ, bhante\"ti kho tapusso gahapati āyasmato ānandassa paccassosi. Atha kho āyasmā ānando tapussena gahapatinā saddhiṁ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:",
    "an9.41:6": "\"Ayaṁ, bhante, tapusso gahapati evamāha:  ‘Mayaṁ, bhante ānanda, gihī kāmabhogino kāmārāmā kāmaratā kāmasammuditā, tesaṁ no, bhante, amhākaṁ gihīnaṁ kāmabhogīnaṁ kāmārāmānaṁ kāmaratānaṁ kāmasammuditānaṁ papāto viya khāyati, yadidaṁ nekkhammaṁ’. Sutaṁ metaṁ, bhante, ‘imasmiṁ dhammavinaye daharānaṁ daharānaṁ bhikkhūnaṁ nekkhamme cittaṁ pakkhandati pasīdati santiṭṭhati vimuccati etaṁ santanti passato. Tayidaṁ, bhante, imasmiṁ dhammavinaye bhikkhūnaṁ bahunā janena visabhāgo yadidaṁ nekkhamman’\"ti.",
    "an9.41:7": "\"Evametaṁ, ānanda, evametaṁ, ānanda.",
    "an9.41:8": "Tassa mayhaṁ, ānanda, etadahosi:  ‘yannūnāhaṁ vitakkavicārānaṁ vūpasamā … pe … dutiyaṁ jhānaṁ upasampajja vihareyyan’ti. Tassa mayhaṁ, ānanda, avitakke cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato. Tassa mayhaṁ, ānanda, etadahosi:  ‘ko nu kho hetu ko paccayo, yena me avitakke cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’? Tassa mayhaṁ, ānanda, etadahosi:  ‘vitakkesu kho me ādīnavo adiṭṭho, so ca me abahulīkato, avitakke ca ānisaṁso anadhigato, so ca me anāsevito. Tasmā me avitakke cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’.",
    "an9.41:9": "Tassa mayhaṁ, ānanda, etadahosi:  ‘yannūnāhaṁ pītiyā ca virāgā upekkhako ca vihareyyaṁ sato ca sampajāno sukhañca kāyena paṭisaṁvedeyyaṁ yaṁ taṁ ariyā ācikkhanti – upekkhako satimā sukhavihārīti tatiyaṁ jhānaṁ upasampajja vihareyyan’ti. Tassa mayhaṁ, ānanda, nippītike cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato. Tassa mayhaṁ, ānanda, etadahosi:  ‘ko nu kho hetu ko paccayo, yena me nippītike cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’? Tassa mayhaṁ, ānanda, etadahosi:  ‘pītiyā kho me ādīnavo adiṭṭho, so ca me abahulīkato, nippītike ca ānisaṁso anadhigato, so ca me anāsevito. Tasmā me nippītike cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’.",
    "an9.41:10": "Tassa mayhaṁ, ānanda, etadahosi:  ‘yannūnāhaṁ sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja vihareyyan’ti. Tassa mayhaṁ, ānanda, adukkhamasukhe cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato. Tassa mayhaṁ, ānanda, etadahosi:  ‘ko nu kho hetu ko paccayo, yena me adukkhamasukhe cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’? Tassa mayhaṁ, ānanda, etadahosi:  ‘upekkhāsukhe kho me ādīnavo adiṭṭho, so ca me abahulīkato, adukkhamasukhe ca ānisaṁso anadhigato, so ca me anāsevito. Tasmā me adukkhamasukhe cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’.",
    "an9.41:11": "Tassa mayhaṁ, ānanda, etadahosi:  ‘yannūnāhaṁ sabbaso rūpasaññānaṁ samatikkamā paṭighasaññānaṁ atthaṅgamā nānattasaññānaṁ amanasikārā \"ananto ākāso\"ti ākāsānañcāyatanaṁ upasampajja vihareyyan’ti. Tassa mayhaṁ, ānanda, ākāsānañcāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato. Tassa mayhaṁ, ānanda, etadahosi:  ‘ko nu kho hetu ko paccayo, yena me ākāsānañcāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’? Tassa mayhaṁ, ānanda, etadahosi:  ‘rūpesu kho me ādīnavo adiṭṭho, so ca abahulīkato, ākāsānañcāyatane ca ānisaṁso anadhigato, so ca me anāsevito. Tasmā me ākāsānañcāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’.",
    "an9.41:12": "Tassa mayhaṁ, ānanda, etadahosi:  ‘yannūnāhaṁ sabbaso ākāsānañcāyatanaṁ samatikkamma \"anantaṁ viññāṇan\"ti viññāṇañcāyatanaṁ upasampajja vihareyyan’ti. Tassa mayhaṁ, ānanda, viññāṇañcāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato. Tassa mayhaṁ, ānanda, etadahosi:  ‘ko nu kho hetu ko paccayo, yena me viññāṇañcāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’? Tassa mayhaṁ, ānanda, etadahosi:  ‘ākāsānañcāyatane kho me ādīnavo adiṭṭho, so ca abahulīkato, viññāṇañcāyatane ca ānisaṁso anadhigato, so ca me anāsevito. Tasmā me viññāṇañcāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’.",
    "an9.41:13": "Tassa mayhaṁ, ānanda, etadahosi:  ‘yannūnāhaṁ sabbaso viññāṇañcāyatanaṁ samatikkamma \"natthi kiñcī\"ti ākiñcaññāyatanaṁ upasampajja vihareyyan’ti. Tassa mayhaṁ, ānanda, ākiñcaññāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato. Tassa mayhaṁ, ānanda, etadahosi:  ‘ko nu kho hetu ko paccayo, yena me ākiñcaññāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’? Tassa mayhaṁ, ānanda, etadahosi:  ‘viññāṇañcāyatane kho me ādīnavo adiṭṭho, so ca me abahulīkato, ākiñcaññāyatane ca ānisaṁso anadhigato, so ca me anāsevito. Tasmā me ākiñcaññāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’.",
    "an9.41:14": "Tassa mayhaṁ, ānanda, etadahosi:  ‘yannūnāhaṁ sabbaso ākiñcaññāyatanaṁ samatikkamma nevasaññānāsaññāyatanaṁ upasampajja vihareyyan’ti. Tassa mayhaṁ, ānanda, nevasaññānāsaññāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato. Tassa mayhaṁ, ānanda, etadahosi:  ‘ko nu kho hetu ko paccayo, yena me nevasaññānāsaññāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’? Tassa mayhaṁ, ānanda, etadahosi:  ‘ākiñcaññāyatane kho me ādīnavo adiṭṭho, so ca me abahulīkato, nevasaññānāsaññāyatane ca ānisaṁso anadhigato, so ca me anāsevito. Tasmā me nevasaññānāsaññāyatane cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’.",
    "an9.41:15": "Tassa mayhaṁ, ānanda, etadahosi:  ‘yannūnāhaṁ nevasaññānāsaññāyatanaṁ samatikkamma saññāvedayitanirodhaṁ upasampajja vihareyyan’ti. Tassa mayhaṁ, ānanda, saññāvedayitanirodhe cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato. Tassa mayhaṁ, ānanda, etadahosi:  ‘ko nu kho hetu, ko paccayo, yena me saññāvedayitanirodhe cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’? Tassa mayhaṁ, ānanda, etadahosi:  ‘nevasaññānāsaññāyatane kho me ādīnavo adiṭṭho, so ca me abahulīkato, saññāvedayitanirodhe ca ānisaṁso anadhigato, so ca me anāsevito. Tasmā me saññāvedayitanirodhe cittaṁ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṁ santanti passato’.",
    "an9.41:16": "Yāvakīvañcāhaṁ, ānanda, imā nava anupubbavihārasamāpattiyo na evaṁ anulomapaṭilomaṁ samāpajjimpi vuṭṭhahimpi, neva tāvāhaṁ, ānanda, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṁ sammāsambodhiṁ abhisambuddho’ti paccaññāsiṁ. Yato ca kho ahaṁ, ānanda, imā nava anupubbavihārasamāpattiyo evaṁ anulomapaṭilomaṁ samāpajjimpi vuṭṭhahimpi, athāhaṁ, ānanda, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṁ sammāsambodhiṁ abhisambuddho’ti paccaññāsiṁ. Ñāṇañca pana me dassanaṁ udapādi:  ‘akuppā me cetovimutti, ayamantimā jāti, natthi dāni punabbhavo’\"ti.",
    "an9.41:17": "Dve vihārā ca nibbānaṁ,gāvī jhānena pañcamaṁ;Ānando brāhmaṇā devo,nāgena tapussena cāti."
}