{
    "an9.42:1": "Ekaṁ samayaṁ āyasmā ānando kosambiyaṁ viharati ghositārāme. Atha kho āyasmā udāyī yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā udāyī āyasmantaṁ ānandaṁ etadavoca:",
    "an9.42:3": "Katamo, āvuso, sambādho, katamo sambādhe okāsādhigamo vutto bhagavatā\"ti?",
    "an9.42:4": "Idhāvuso, bhikkhu vivicceva kāmehi … pe … paṭhamaṁ jhānaṁ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha vitakkavicārā aniruddhā honti, ayamettha sambādho.",
    "an9.42:5": "Puna caparaṁ, āvuso, bhikkhu vitakkavicārānaṁ vūpasamā … pe … dutiyaṁ jhānaṁ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha pīti aniruddhā hoti, ayamettha sambādho.",
    "an9.42:6": "Puna caparaṁ, āvuso, bhikkhu pītiyā ca virāgā … pe … tatiyaṁ jhānaṁ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha upekkhāsukhaṁ aniruddhaṁ hoti, ayamettha sambādho.",
    "an9.42:7": "Puna caparaṁ, āvuso, bhikkhu sukhassa ca pahānā … pe … catutthaṁ jhānaṁ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha rūpasaññā aniruddhā hoti, ayamettha sambādho.",
    "an9.42:8": "Puna caparaṁ, āvuso, bhikkhu sabbaso rūpasaññānaṁ samatikkamā paṭighasaññānaṁ atthaṅgamā nānattasaññānaṁ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṁ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha ākāsānañcāyatanasaññā aniruddhā hoti, ayamettha sambādho.",
    "an9.42:9": "Puna caparaṁ, āvuso, bhikkhu sabbaso ākāsānañcāyatanaṁ samatikkamma ‘anantaṁ viññāṇan’ti viññāṇañcāyatanaṁ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha viññāṇañcāyatanasaññā aniruddhā hoti, ayamettha sambādho.",
    "an9.42:10": "Puna caparaṁ, āvuso, bhikkhu sabbaso viññāṇañcāyatanaṁ samatikkamma ‘Natthi kiñcī’ti ākiñcaññāyatanaṁ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha ākiñcaññāyatanasaññā aniruddhā hoti, ayamettha sambādho.",
    "an9.42:11": "Puna caparaṁ, āvuso, bhikkhu sabbaso ākiñcaññāyatanaṁ samatikkamma nevasaññānāsaññāyatanaṁ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha nevasaññānāsaññāyatanasaññā aniruddhā hoti, ayamettha sambādho.",
    "an9.42:12": "Puna caparaṁ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṁ samatikkamma saññāvedayitanirodhaṁ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā nippariyāyenā\"ti."
}