{
    "an9.3:1": "Ekaṁ samayaṁ bhagavā cālikāyaṁ viharati cālikāpabbate. Tena kho pana samayena āyasmā meghiyo bhagavato upaṭṭhāko hoti. Atha kho āyasmā meghiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho āyasmā meghiyo bhagavantaṁ etadavoca:  \"Icchāmahaṁ, bhante, jantugāmaṁ piṇḍāya pavisitun\"ti.",
    "an9.3:2": "Atha kho āyasmā meghiyo pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya jantugāmaṁ piṇḍāya pāvisi. Jantugāme piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkanto yena kimikāḷāya nadiyā tīraṁ tenupasaṅkami. Addasā kho āyasmā meghiyo kimikāḷāya nadiyā tīre jaṅghāvihāraṁ anucaṅkamamāno anuvicaramāno ambavanaṁ pāsādikaṁ ramaṇīyaṁ. Disvānassa etadahosi:  \"pāsādikaṁ vatidaṁ ambavanaṁ ramaṇīyaṁ, alaṁ vatidaṁ kulaputtassa padhānatthikassa padhānāya. Sace maṁ bhagavā anujāneyya, āgaccheyyāhaṁ imaṁ ambavanaṁ padhānāyā\"ti.",
    "an9.3:3": "Atha kho āyasmā meghiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā meghiyo bhagavantaṁ etadavoca:",
    "an9.3:4": "\"Idhāhaṁ, bhante, pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya jantugāmaṁ piṇḍāya pāvisiṁ. Jantugāme piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkanto yena kimikāḷāya nadiyā tīraṁ tenupasaṅkamiṁ. Addasaṁ kho ahaṁ, bhante, kimikāḷāya nadiyā tīre jaṅghāvihāraṁ anucaṅkamamāno anuvicaramāno ambavanaṁ pāsādikaṁ ramaṇīyaṁ. Disvāna me etadahosi:  ‘pāsādikaṁ vatidaṁ ambavanaṁ ramaṇīyaṁ. Alaṁ vatidaṁ kulaputtassa padhānatthikassa padhānāya. Sace maṁ bhagavā anujāneyya, āgaccheyyāhaṁ imaṁ ambavanaṁ padhānāyā’ti. Sace maṁ bhagavā anujāneyya, gaccheyyāhaṁ taṁ ambavanaṁ padhānāyā\"ti.",
    "an9.3:5": "Dutiyampi kho āyasmā meghiyo bhagavantaṁ etadavoca:  \"bhagavato, bhante, natthi kiñci uttari karaṇīyaṁ, natthi katassa paṭicayo. Mayhaṁ kho pana, bhante, atthi uttari karaṇīyaṁ, atthi katassa paṭicayo. Sace maṁ bhagavā anujāneyya, gaccheyyāhaṁ taṁ ambavanaṁ padhānāyā\"ti.",
    "an9.3:6": "Tatiyampi kho āyasmā meghiyo bhagavantaṁ etadavoca:  \"bhagavato, bhante, natthi kiñci uttari karaṇīyaṁ, natthi katassa paṭicayo. Mayhaṁ kho pana, bhante, atthi uttari karaṇīyaṁ, atthi katassa paṭicayo. Sace maṁ bhagavā anujāneyya, gaccheyyāhaṁ taṁ ambavanaṁ padhānāyā\"ti.",
    "an9.3:7": "Atha kho āyasmā meghiyo uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā yena taṁ ambavanaṁ tenupasaṅkami; upasaṅkamitvā taṁ ambavanaṁ ajjhogāhetvā aññatarasmiṁ rukkhamūle divāvihāraṁ nisīdi. Atha kho āyasmato meghiyassa tasmiṁ ambavane viharantassa yebhuyyena tayo pāpakā akusalā vitakkā samudācaranti, seyyathidaṁ – kāmavitakko, byāpādavitakko, vihiṁsāvitakko. Atha kho āyasmato meghiyassa etadahosi:  \"acchariyaṁ vata bho, abbhutaṁ vata bho. Saddhāya ca vatamhā agārasmā anagāriyaṁ pabbajitā; atha ca panimehi tīhi pāpakehi akusalehi vitakkehi anvāsattā – kāmavitakkena, byāpādavitakkena, vihiṁsāvitakkenā\"ti.",
    "an9.3:8": "Atha kho āyasmā meghiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā meghiyo bhagavantaṁ etadavoca:",
    "an9.3:9": "\"Idha mayhaṁ, bhante, tasmiṁ ambavane viharantassa yebhuyyena tayo pāpakā akusalā vitakkā samudācaranti, seyyathidaṁ – kāmavitakko, byāpādavitakko, vihiṁsāvitakko. Tassa mayhaṁ, bhante, etadahosi:  ‘acchariyaṁ vata bho, abbhutaṁ vata bho. Saddhāya ca vatamhā agārasmā anagāriyaṁ pabbajitā; atha ca panimehi tīhi pāpakehi akusalehi vitakkehi anvāsattā – kāmavitakkena, byāpādavitakkena, vihiṁsāvitakkenā’\"ti.",
    "an9.3:10": "\"Aparipakkāya, meghiya, cetovimuttiyā pañca dhammā paripakkāya saṁvattanti. Katame pañca?",
    "an9.3:11": "Puna caparaṁ, meghiya, bhikkhu sīlavā hoti, pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Aparipakkāya, meghiya, cetovimuttiyā ayaṁ dutiyo dhammo paripakkāya saṁvattati.(2)",
    "an9.3:12": "Puna caparaṁ, meghiya, yāyaṁ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṁ – appicchakathā santuṭṭhikathā pavivekakathā asaṁsaggakathā vīriyārambhakathā sīlakathā samādhikathā paññākathā vimuttikathā vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī hoti akicchalābhī akasiralābhī. Aparipakkāya, meghiya, cetovimuttiyā ayaṁ tatiyo dhammo paripakkāya saṁvattati.(3)",
    "an9.3:13": "Puna caparaṁ, meghiya, bhikkhu āraddhavīriyo viharati akusalānaṁ dhammānaṁ pahānāya, kusalānaṁ dhammānaṁ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Aparipakkāya, meghiya, cetovimuttiyā ayaṁ catuttho dhammo paripakkāya saṁvattati.(4)",
    "an9.3:14": "Puna caparaṁ, meghiya, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Aparipakkāya, meghiya, cetovimuttiyā ayaṁ pañcamo dhammo paripakkāya saṁvattati.",
    "an9.3:15": "Kalyāṇamittassetaṁ, meghiya, bhikkhuno pāṭikaṅkhaṁ kalyāṇasahāyassa kalyāṇasampavaṅkassa:  ‘sīlavā bhavissati … pe … samādāya sikkhissati sikkhāpadesu’.",
    "an9.3:16": "Kalyāṇamittassetaṁ, meghiya, bhikkhuno pāṭikaṅkhaṁ kalyāṇasahāyassa kalyāṇasampavaṅkassa:  ‘yāyaṁ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṁ – appicchakathā … pe … vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī bhavissati akicchalābhī akasiralābhī’.",
    "an9.3:17": "Kalyāṇamittassetaṁ, meghiya, bhikkhuno pāṭikaṅkhaṁ kalyāṇasahāyassa kalyāṇasampavaṅkassa:  ‘āraddhavīriyo viharissati … pe … anikkhittadhuro kusalesu dhammesu’.",
    "an9.3:18": "Kalyāṇamittassetaṁ, meghiya, bhikkhuno pāṭikaṅkhaṁ kalyāṇasahāyassa kalyāṇasampavaṅkassa:  ‘paññavā bhavissati … pe … sammādukkhakkhayagāminiyā’.(5)",
    "an9.3:19": "Tena ca pana, meghiya, bhikkhunā imesu pañcasu dhammesu patiṭṭhāya cattāro dhammā uttari bhāvetabbā – asubhā bhāvetabbā rāgassa pahānāya, mettā bhāvetabbā byāpādassa pahānāya, ānāpānassati bhāvetabbā vitakkupacchedāya, aniccasaññā bhāvetabbā asmimānasamugghātāya. Aniccasaññino, meghiya, anattasaññā saṇṭhāti. Anattasaññī asmimānasamugghātaṁ pāpuṇāti diṭṭheva dhamme nibbānan\"ti. (6–9.)"
}