{
    "an9.34:1": "Ekaṁ samayaṁ āyasmā sāriputto rājagahe viharati veḷuvane kalandakanivāpe. Tatra kho āyasmā sāriputto bhikkhū āmantesi:",
    "an9.34:2": "Idhāvuso, bhikkhu vivicceva kāmehi … pe … paṭhamaṁ jhānaṁ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato kāmasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṁ uppajjeyya yāvadeva ābādhāya; evamevassa te kāmasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṁ vuttaṁ bhagavatā. Imināpi kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā sukhaṁ nibbānaṁ.(1)",
    "an9.34:3": "Puna caparaṁ, āvuso, bhikkhu vitakkavicārānaṁ vūpasamā … pe … dutiyaṁ jhānaṁ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato vitakkasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṁ uppajjeyya yāvadeva ābādhāya; evamevassa te vitakkasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṁ vuttaṁ bhagavatā. Imināpi kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā sukhaṁ nibbānaṁ.(2)",
    "an9.34:4": "Puna caparaṁ, āvuso, bhikkhu pītiyā ca virāgā … pe … tatiyaṁ jhānaṁ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato pītisahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṁ uppajjeyya yāvadeva ābādhāya; evamevassa te pītisahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṁ vuttaṁ bhagavatā. Imināpi kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā sukhaṁ nibbānaṁ.(3)",
    "an9.34:5": "Puna caparaṁ, āvuso, bhikkhu sukhassa ca pahānā … pe … catutthaṁ jhānaṁ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato upekkhāsahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṁ uppajjeyya yāvadeva ābādhāya; evamevassa te upekkhāsahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṁ vuttaṁ bhagavatā. Imināpi kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā sukhaṁ nibbānaṁ.(4)",
    "an9.34:6": "Puna caparaṁ, āvuso, bhikkhu sabbaso rūpasaññānaṁ samatikkamā paṭighasaññānaṁ atthaṅgamā nānattasaññānaṁ amanasikārā ananto ākāsoti ākāsānañcāyatanaṁ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato rūpasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṁ uppajjeyya yāvadeva ābādhāya; evamevassa te rūpasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṁ vuttaṁ bhagavatā. Imināpi kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā sukhaṁ nibbānaṁ.(5)",
    "an9.34:7": "Puna caparaṁ, āvuso, bhikkhu sabbaso ākāsānañcāyatanaṁ samatikkamma anantaṁ viññāṇanti viññāṇañcāyatanaṁ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato ākāsānañcāyatanasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṁ uppajjeyya yāvadeva ābādhāya; evamevassa te ākāsānañcāyatanasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṁ vuttaṁ bhagavatā. Imināpi kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā sukhaṁ nibbānaṁ.(6)",
    "an9.34:8": "Puna caparaṁ, āvuso, bhikkhu sabbaso viññāṇañcāyatanaṁ samatikkamma, natthi kiñcīti ākiñcaññāyatanaṁ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato viññāṇañcāyatanasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṁ uppajjeyya yāvadeva ābādhāya; evamevassa te viññāṇañcāyatanasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṁ vuttaṁ bhagavatā. Imināpi kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā sukhaṁ nibbānaṁ.(7)",
    "an9.34:9": "Puna caparaṁ, āvuso, bhikkhu sabbaso ākiñcaññāyatanaṁ samatikkamma nevasaññānāsaññāyatanaṁ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato ākiñcaññāyatanasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṁ uppajjeyya yāvadeva ābādhāya; evamevassa te ākiñcaññāyatanasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṁ vuttaṁ bhagavatā. Imināpi kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā sukhaṁ nibbānaṁ.(8)",
    "an9.34:10": "Puna caparaṁ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṁ samatikkamma saññāvedayitanirodhaṁ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti.(9)",
    "an9.34:11": "Imināpi kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā sukhaṁ nibbānan\"ti."
}