{
    "an9.12:1": "Ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā sāriputto pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya sāvatthiṁ piṇḍāya pāvisi. Atha kho āyasmato sāriputtassa etadahosi:  \"atippago kho tāva sāvatthiyaṁ piṇḍāya carituṁ, yannūnāhaṁ yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkameyyan\"ti. Atha kho āyasmā sāriputto yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkami; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi.",
    "an9.12:2": "Tena kho pana samayena tesaṁ aññatitthiyānaṁ paribbājakānaṁ sannisinnānaṁ sannipatitānaṁ ayamantarākathā udapādi:  \"yo hi koci, āvuso, saupādiseso kālaṁ karoti, sabbo so aparimutto nirayā aparimutto tiracchānayoniyā aparimutto pettivisayā aparimutto apāyaduggativinipātā\"ti.",
    "an9.12:3": "\"Idhāhaṁ, bhante, pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya sāvatthiṁ piṇḍāya pāvisiṁ. Tassa mayhaṁ, bhante, etadahosi:  ‘atippago kho tāva sāvatthiyaṁ piṇḍāya carituṁ; yannūnāhaṁ yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkameyyan’ti. Atha kho ahaṁ, bhante, yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkamiṁ; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṁ sammodiṁ. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁ. Tena kho pana samayena tesaṁ aññatitthiyānaṁ paribbājakānaṁ sannisinnānaṁ sannipatitānaṁ ayamantarākathā udapādi:  ‘yo hi koci, āvuso, saupādiseso kālaṁ karoti, sabbo so aparimutto nirayā aparimutto tiracchānayoniyā aparimutto pettivisayā aparimutto apāyaduggativinipātā’ti. Atha kho ahaṁ, bhante, tesaṁ aññatitthiyānaṁ paribbājakānaṁ bhāsitaṁ neva abhinandiṁ nappaṭikkosiṁ. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamiṁ:  ‘bhagavato santike etassa bhāsitassa atthaṁ ājānissāmī’\"ti.",
    "an9.12:4": "\"Ke ca, sāriputta, aññatitthiyā paribbājakā bālā abyattā, ke ca saupādisesaṁ vā ‘saupādiseso’ti jānissanti, anupādisesaṁ vā ‘anupādiseso’ti jānissanti.",
    "an9.12:5": "Navayime, sāriputta, puggalā saupādisesā kālaṁ kurumānā parimuttā nirayā parimuttā tiracchānayoniyā parimuttā pettivisayā parimuttā apāyaduggativinipātā. Katame nava?",
    "an9.12:6": "Puna caparaṁ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṁ paripūrakārī, paññāya mattaso kārī. So pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā upahaccaparinibbāyī hoti … pe … asaṅkhāraparinibbāyī hoti … pe … sasaṅkhāraparinibbāyī hoti … pe … uddhaṁsoto hoti akaniṭṭhagāmī. Ayaṁ, sāriputta, pañcamo puggalo saupādiseso kālaṁ kurumāno parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā. (2–5.)",
    "an9.12:7": "Puna caparaṁ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṁ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṁ saṁyojanānaṁ parikkhayā rāgadosamohānaṁ tanuttā sakadāgāmī hoti, sakideva imaṁ lokaṁ āgantvā dukkhassantaṁ karoti. Ayaṁ, sāriputta, chaṭṭho puggalo saupādiseso kālaṁ kurumāno parimutto nirayā … pe … parimutto apāyaduggativinipātā.(6)",
    "an9.12:8": "Puna caparaṁ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṁ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṁ saṁyojanānaṁ parikkhayā ekabījī hoti, ekaṁyeva mānusakaṁ bhavaṁ nibbattetvā dukkhassantaṁ karoti. Ayaṁ, sāriputta, sattamo puggalo saupādiseso kālaṁ kurumāno parimutto nirayā … pe … parimutto apāyaduggativinipātā.(7)",
    "an9.12:9": "Puna caparaṁ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṁ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṁ saṁyojanānaṁ parikkhayā kolaṅkolo hoti, dve vā tīṇi vā kulāni sandhāvitvā saṁsaritvā dukkhassantaṁ karoti. Ayaṁ, sāriputta, aṭṭhamo puggalo saupādiseso kālaṁ kurumāno parimutto nirayā … pe … parimutto apāyaduggativinipātā.(8)",
    "an9.12:10": "Puna caparaṁ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṁ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṁ saṁyojanānaṁ parikkhayā sattakkhattuparamo hoti, sattakkhattuparamaṁ deve ca manusse ca sandhāvitvā saṁsaritvā dukkhassantaṁ karoti. Ayaṁ, sāriputta, navamo puggalo saupādiseso kālaṁ kurumāno parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā.(9)",
    "an9.12:11": "Ke ca, sāriputta, aññatitthiyā paribbājakā bālā abyattā, ke ca saupādisesaṁ vā ‘saupādiseso’ti jānissanti, anupādisesaṁ vā ‘anupādiseso’ti jānissanti."
}