{
    "it:1": "This was said by the Blessed One, said by the Arahant, so I have heard:",
    "it:2": "\"The worldSN35.8defines the \"world\" as the six sense spheres, their objects, consciousness at those spheres, contact at those spheres, and whatever arises in dependence on that contact, experienced as pleasure, pain, or neither-pleasure-nor-pain.has been fully awakened to by the Tathagata. From the world, the Tathagata is disjoined. The origination of the world has been fully awakened to by the Tathagata. The origination of the world has, by the Tathagata, been abandoned. The cessation of the world has been fully awakened to by the Tathagata. The cessation of the world has, by the Tathagata, been realized. The path leading to the cessation of the world has been fully awakened to by the Tathagata. The path leading to the cessation of the world has, by the Tathagata, been developed.",
    "it:3": "\"Whatever in this world — with its devas, Māras, and Brahmas, its generations complete with contemplatives and brahmans, princes and men — is seen, heard, sensed, cognized, attained, sought after, pondered by the intellect, that has been fully awakened to by the Tathagata. Thus he is called the Tathagata.",
    "it:4": "\"From the night the Tathagata fully awakens to the unsurpassed Right Self-awakening to the night he is totally unbound in the Unbinding property with no fuel remaining, whatever the Tathagata has said, spoken, explained is just so(tatha)and not otherwise. Thus he is called the Tathagata.",
    "it:6-2": "Abandon conceit as the one quality, and I guarantee you non-return.\"",
    "it:6-3": "The conceit with which beings go to a bad destination, proud: from rightly discerning that conceit, those who see clearly let go. Letting go, they never come to this world again.",
    "it:6-4": "This, too, was the meaning of what was said by the Blessed One, so I have heard.",
    "it:5": "\"The Tathagata is one who does in line with(tatha)what he teaches, one who teaches in line with what he does. Thus he is called the Tathagata.",
    "it:19-1": "This was said by the Blessed One, said by the Arahant, so I have heard:",
    "it:6": "\"In this world with its devas, Māras, and Brahmas, its generations complete with contemplatives and brahmans, princes and men, the Tathagata is the unconquered conqueror, all-seeing, the wielder of power.These are epithets usually associated with the Great Brahma.Thus he is called the Tathagata.\"This is the meaning of what the Blessed One said. So with regard to this it was said:",
    "it:7": "\"If, while he is lying down, any greed in a monk is done away with, any ill will, any sloth and drowsiness, any restlessness and anxiety, any uncertainty is done away with; if his persistence is aroused and not lax; if his mindfulness is established and unmuddled; if his body is calm and unaroused; if his mind is centered and unified: then a monk lying down with such ardency and concern is called continually and continuously resolute, one with persistence aroused.\"",
    "it:8": "Controlled in walking, controlled in standing, controlled in sitting, controlled in lying down, controlled in flexing and extending his limbs",
    "it:9": "Above, around, and below, as far as the worlds extend — observing the arising and passing away of phenomena, of aggregates:",
    "it:10": "A monk who dwells thus ardently, not restlessly, at peace — always mindful, training in the mastery of awareness-tranquillity — is said to be continually resolute.",
    "it:11": "This, too, was the meaning of what was said by the Blessed One, so I have heard.",
    "it:2-4": "\"I have seen beings who — endowed with bodily misconduct, verbal misconduct, and mental misconduct; who reviled noble ones, held wrong views and undertook actions under the influence of wrong views — at the break-up of the body, after death, have re-appeared in the plane of deprivation, the bad destination, the lower realms, in hell. It is not from having heard this from other brahmans and contemplatives that I tell you that I have seen beings who — endowed with bodily misconduct, verbal misconduct, and mental misconduct; who reviled noble ones, held wrong views and undertook actions under the influence of wrong views — at the break-up of the body, after death, have re-appeared in the plane of deprivation, the bad destination, the lower realms, in hell. It is from having known it myself, seen it myself, realized it myself that I tell you that I have seen beings who — endowed with bodily misconduct, verbal misconduct, and mental misconduct; who reviled noble ones, held wrong views and undertook actions under the influence of wrong views — at the break-up of the body, after death, have re-appeared in the plane of deprivation, the bad destination, the lower realms, in hell.\"",
    "it:12": "But whoever — walking, standing, sitting, or lying down — overcomes thought, delighting in the stilling of thought: he's capable, a monk like this, of touching superlative self-awakening.",
    "it:13": "This, too, was the meaning of what was said by the Blessed One, so I have heard.",
    "it:14": "This, too, was the meaning of what was said by the Blessed One, so I have heard.",
    "it:15": "Having abandoned bodily misconduct, verbal misconduct, mental misconduct, and whatever else is flawed;",
    "it:16": "Having done with the body what's skillful, and much that is skillful with speech, having done what's skillful with a heart without limit, with no acquisitions, then",
    "it:17": "Having made much of that basis of merit through giving — establish other mortals in True Dhamma and the holy life.'",
    "it:18": "With this sympathy, the devas — when they know a deva is passing away — encourage him: 'Come back, deva, again and again.'",
    "it:19": "This, too, was the meaning of what was said by the Blessed One, so I have heard.",
    "it:3-4": "He's missed out on the householder's enjoyment and the purpose of the contemplative life — unfortunate man! Ruining it, he throws it away, perishes like a firebrand used at a funeral.",
    "it:7-13": "Directly knowing all the world, all the world as is really is, from all the world disjoined, in all the world unmatched: Conquering all in all ways, enlightened, released from all bonds, he touches the foremost peace — Unbinding, free from fear. He is free of fermentation, of trouble, awakened, his doubts cut through; has attained the ending of action, is released in the destruction of acquisitions. He is blessed, awakened, a lion, unsurpassed. In the world with its devas he set the Brahma-wheel going.The Brahma-wheel = the Dhamma-wheel, the name of the Buddha’s first sermon, so called because it contains a \"wheel\" that lists all twelve permutations of two sets of variables: the four noble truths — suffering, its origination, its cessation, and the way leading to its cessation — and the three levels of knowledge appropriate to each truth: knowledge of the truth, knowledge of the task appropriate to the truth, and knowledge that the task has been completed. This wheel constitutes the Buddha’s most central teachingThus divine and human beings who have gone to the Buddha for refuge, gathering, pay homage to the great one, thoroughly mature: 'Tamed, he's the best of those who can be tamed; calm, the seer of those who can be calmed; released, supreme among those who can be released; crossed, the foremost of those who can cross.' Thus they pay homage to the great one, thoroughly mature: 'In this world with its devas, there's no one to compare with you.'"
}