{
    "dn13:1": "Evaṁ me sutaṁ—​ ekaṁ samayaṁ bhagavā kosalesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi yena manasākaṭaṁ nāma kosalānaṁ brāhmaṇagāmo tadavasari. Tatra sudaṁ bhagavā manasākaṭe viharati uttarena manasākaṭassa aciravatiyā nadiyā tīre ambavane.",
    "dn13:2": "Tena kho pana samayena sambahulā abhiññātā abhiññātā brāhmaṇamahāsālā manasākaṭe paṭivasanti, seyyathidaṁ—caṅkī brāhmaṇo tārukkho brāhmaṇo pokkharasāti brāhmaṇo jāṇusoṇi brāhmaṇo todeyyo brāhmaṇo aññe ca abhiññātā abhiññātā brāhmaṇamahāsālā.",
    "dn13:3": "Atha kho vāseṭṭhabhāradvājānaṁ māṇavānaṁ jaṅghavihāraṁ anucaṅkamantānaṁ anuvicarantānaṁ maggāmagge kathā udapādi.",
    "dn13:4": "Atha kho vāseṭṭho māṇavo bhāradvājaṁ māṇavaṁ āmantesi: \"Ayaṁ kho, bhāradvāja, samaṇo gotamo sakyaputto sakyakulā pabbajito manasākaṭe viharati uttarena manasākaṭassa aciravatiyā nadiyā tīre ambavane. Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: 'itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā'ti. Āyāma, bho bhāradvāja, yena samaṇo gotamo tenupasaṅkamissāma; upasaṅkamitvā etamatthaṁ samaṇaṁ gotamaṁ pucchissāma. Yathā no samaṇo gotamo byākarissati, tathā naṁ dhāressāmā\"ti. \"Evaṁ, bho\"ti kho bhāradvājo māṇavo vāseṭṭhassa māṇavassa paccassosi.",
    "dn13:5": "Atha kho vāseṭṭhabhāradvājā māṇavā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavatā saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinno kho vāseṭṭho māṇavo bhagavantaṁ etadavoca: \"idha, bho gotama, amhākaṁ jaṅghavihāraṁ anucaṅkamantānaṁ anuvicarantānaṁ maggāmagge kathā udapādi. Ahaṁ evaṁ vadāmi: 'ayameva ujumaggo, ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena pokkharasātinā'ti. Bhāradvājo māṇavo evamāha: 'ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena tārukkhenā'ti. Ettha, bho gotama, attheva viggaho, atthi vivādo, atthi nānāvādo\"ti.",
    "dn13:6": "\"Iti kira, vāseṭṭha, tvaṁ evaṁ vadesi: 'ayameva ujumaggo, ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena pokkharasātinā'ti. Bhāradvājo māṇavo evamāha: 'ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena tārukkhenā'ti. Atha kismiṁ pana vo, vāseṭṭha, viggaho, kismiṁ vivādo, kismiṁ nānāvādo\"ti?",
    "dn13:7": "\"Maggāmagge, bho gotama. Kiñcāpi, bho gotama, brāhmaṇā nānāmagge paññāpenti, addhariyā brāhmaṇā tittiriyā brāhmaṇā chandokā brāhmaṇā bavhārijjhā brāhmaṇā, atha kho sabbāni tāni niyyānikā niyyanti takkarassa brahmasahabyatāya.",
    "dn13:8": "Seyyathāpi, bho gotama, gāmassa vā nigamassa vā avidūre bahūni cepi nānāmaggāni bhavanti, atha kho sabbāni tāni gāmasamosaraṇāni bhavanti; evameva kho, bho gotama, kiñcāpi brāhmaṇā nānāmagge paññāpenti, addhariyā brāhmaṇā tittiriyā brāhmaṇā chandokā brāhmaṇā bavhārijjhā brāhmaṇā, atha kho sabbāni tāni niyyānikā niyyanti takkarassa brahmasahabyatāyā\"ti.",
    "dn13:9": "\"Niyyantīti, vāseṭṭha vadesi\"? \"Niyyantīti, bho gotama, vadāmi\".",
    "dn13:10": "\"Kiṁ pana, vāseṭṭha, atthi koci tevijjānaṁ brāhmaṇānaṁ ekabrāhmaṇopi, yena brahmā sakkhidiṭṭho\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:11": "\"Kiṁ pana, vāseṭṭha, atthi koci tevijjānaṁ brāhmaṇānaṁ ekācariyopi, yena brahmā sakkhidiṭṭho\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:12": "\"Kiṁ pana, vāseṭṭha, atthi koci tevijjānaṁ brāhmaṇānaṁ ekācariyapācariyopi, yena brahmā sakkhidiṭṭho\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:13": "\"Kiṁ pana, vāseṭṭha, atthi koci tevijjānaṁ brāhmaṇānaṁ yāvasattamā ācariyāmahayugāyena brahmā sakkhidiṭṭho\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:14": "\"Kiṁ pana, vāseṭṭha, yepi tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁsamihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu. Tepi evamāhaṁsu: 'mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmā'\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:15": "\"Iti kira, vāseṭṭha, natthi koci tevijjānaṁ brāhmaṇānaṁ ekabrāhmaṇopi, yena brahmā sakkhidiṭṭho. Natthi koci tevijjānaṁ brāhmaṇānaṁ ekācariyopi, yena brahmā sakkhidiṭṭho. Natthi koci tevijjānaṁ brāhmaṇānaṁ ekācariyapācariyopi, yena brahmā sakkhidiṭṭho. Natthi koci tevijjānaṁ brāhmaṇānaṁ yāva sattamā ācariyāmahayugā yena brahmā sakkhidiṭṭho. Yepi kira tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṁsu: 'mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmā'ti. Teva tevijjā brāhmaṇā evamāhaṁsu: 'yaṁ na jānāma, yaṁ na passāma, tassa sahabyatāya maggaṁ desema. Ayameva ujumaggo ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāyā'ti.",
    "dn13:16": "Taṁ kiṁ maññasi, vāseṭṭha, nanu evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bho gotama, evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn13:17": "\"Sādhu, vāseṭṭha,te vata, vāseṭṭha, tevijjā brāhmaṇā yaṁ na jānanti, yaṁ na passanti, tassa sahabyatāya maggaṁ desessanti. 'Ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāyā'ti, netaṁ ṭhānaṁ vijjati.",
    "dn13:18": "Seyyathāpi, vāseṭṭha, andhaveṇi paramparasaṁsattā purimopi na passati, majjhimopi na passati, pacchimopi na passati; evameva kho, vāseṭṭha, andhaveṇūpamaṁ maññe tevijjānaṁ brāhmaṇānaṁ bhāsitaṁ, purimopi na passati, majjhimopi na passati, pacchimopi na passati. Tesamidaṁ tevijjānaṁ brāhmaṇānaṁ bhāsitaṁ hassakaññeva sampajjati, nāmakaññeva sampajjati, rittakaññeva sampajjati, tucchakaññeva sampajjati.",
    "dn13:19": "Taṁ kiṁ maññasi, vāseṭṭha, passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattantī\"ti?",
    "dn13:20": "\"Evaṁ, bho gotama, passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattantī\"ti.",
    "dn13:21": "\"Taṁ kiṁ maññasi, vāseṭṭha, yaṁ passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattanti, pahonti tevijjā brāhmaṇā candimasūriyānaṁ sahabyatāya maggaṁ desetuṁ: 'ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa candimasūriyānaṁ sahabyatāyā'\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:22": "\"Iti kira, vāseṭṭha, yaṁ passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattanti, tesampi nappahonti candimasūriyānaṁ sahabyatāya maggaṁ desetuṁ: 'ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa candimasūriyānaṁ sahabyatāyā'ti.",
    "dn13:23": "Itipanana kira tevijjehi brāhmaṇehi brahmā sakkhidiṭṭho. Napi kira tevijjānaṁ brāhmaṇānaṁ ācariyehi brahmā sakkhidiṭṭho. Napi kira tevijjānaṁ brāhmaṇānaṁ ācariyapācariyehi brahmā sakkhidiṭṭho. Napi kira tevijjānaṁ brāhmaṇānaṁ yāvasattamāācariyāmahayugehi brahmā sakkhidiṭṭho. Yepi kira tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṁsu: 'mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmā'ti. Teva tevijjā brāhmaṇā evamāhaṁsu: 'yaṁ na jānāma, yaṁ na passāma, tassa sahabyatāya maggaṁ desema—ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyā'ti.",
    "dn13:24": "Taṁ kiṁ maññasi, vāseṭṭha, nanu evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bho gotama, evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn13:25": "\"Sādhu, vāseṭṭha, te vata, vāseṭṭha, tevijjā brāhmaṇā yaṁ na jānanti, yaṁ na passanti, tassa sahabyatāya maggaṁ desessanti: 'ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāyā'ti, netaṁ ṭhānaṁ vijjati.",
    "dn13:26": "Seyyathāpi, vāseṭṭha, puriso evaṁ vadeyya: 'ahaṁ yā imasmiṁ janapade janapadakalyāṇī, taṁ icchāmi, taṁ kāmemī'ti. Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa, yaṁ tvaṁ janapadakalyāṇiṁ icchasi kāmesi, jānāsi taṁ janapadakalyāṇiṁ –  khattiyī vā brāhmaṇī vā vessī vā suddī vā'ti? Iti puṭṭho 'no'ti vadeyya.",
    "dn13:27": "Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa, yaṁ tvaṁ janapadakalyāṇiṁ icchasi kāmesi, jānāsi taṁ janapadakalyāṇiṁ—evaṁnāmā evaṅgottāti vā, dīghā vā rassā vā majjhimā vā kāḷī vā sāmā vā maṅguracchavī vāti, amukasmiṁ gāme vā nigame vā nagare vā'ti? Iti puṭṭho 'no'ti vadeyya. Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa, yaṁ tvaṁ na jānāsi na passasi, taṁ tvaṁ icchasi kāmesī'ti? Iti puṭṭho 'āmā'ti vadeyya.",
    "dn13:28": "Taṁ kiṁ maññasi, vāseṭṭha, nanu evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bho gotama, evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn13:29": "\"Evameva kho, vāseṭṭha, na kira tevijjehi brāhmaṇehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ ācariyehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ ācariyapācariyehi brahmā sakkhidiṭṭho. Napi kira tevijjānaṁ brāhmaṇānaṁ yāva sattamā ācariyāmahayugehi brahmā sakkhidiṭṭho. Yepi kira tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṁsu: 'mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmā'ti. Teva tevijjā brāhmaṇā evamāhaṁsu: 'yaṁ na jānāma, yaṁ na passāma, tassa sahabyatāya maggaṁ desema—ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyā'ti.",
    "dn13:30": "Taṁ kiṁ maññasi, vāseṭṭha, nanu evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bho gotama, evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn13:31": "\"Sādhu, vāseṭṭha, te vata, vāseṭṭha, tevijjā brāhmaṇā yaṁ na jānanti, yaṁ na passanti, tassa sahabyatāya maggaṁ desessanti—ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyāti netaṁ ṭhānaṁ vijjati.",
    "dn13:32": "Seyyathāpi, vāseṭṭha, puriso cātumahāpathe nisseṇiṁ kareyya—pāsādassa ārohaṇāya. Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa,yassa tvaṁpāsādassa ārohaṇāya nisseṇiṁ karosi, jānāsi taṁ pāsādaṁ—puratthimāya vā disāya dakkhiṇāya vā disāya pacchimāya vā disāya uttarāya vā disāya ucco vā nīco vā majjhimo vā'ti? Iti puṭṭho 'no'ti vadeyya.",
    "dn13:33": "Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa, yaṁ tvaṁ na jānāsi, na passasi, tassa tvaṁ pāsādassa ārohaṇāya nisseṇiṁ karosī'ti? Iti puṭṭho 'āmā'ti vadeyya.",
    "dn13:34": "Taṁ kiṁ maññasi, vāseṭṭha, nanu evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bho gotama, evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn13:35": "\"Evameva kho, vāseṭṭha, na kira tevijjehi brāhmaṇehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ ācariyehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ ācariyapācariyehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ yāva sattamā ācariyāmahayugehi brahmā sakkhidiṭṭho. Yepi kira tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṁsu—mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmāti. Teva tevijjā brāhmaṇā evamāhaṁsu: 'yaṁ na jānāma, yaṁ na passāma, tassa sahabyatāya maggaṁ desema, ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyā'ti.",
    "dn13:36": "Taṁ kiṁ maññasi, vāseṭṭha, nanu evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bho gotama, evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn13:37": "\"Sādhu, vāseṭṭha, te vata, vāseṭṭha, tevijjā brāhmaṇā yaṁ na jānanti, yaṁ na passanti, tassa sahabyatāya maggaṁ desessanti. Ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyāti, netaṁ ṭhānaṁ vijjati.",
    "dn13:38": "Seyyathāpi, vāseṭṭha, ayaṁ aciravatī nadī pūrā udakassa samatittikā kākapeyyā. Atha puriso āgaccheyya pāratthiko pāragavesī pāragāmī pāraṁ taritukāmo. So orime tīre ṭhito pārimaṁ tīraṁ avheyya: 'ehi pārāpāraṁ, ehi pārāpāran'ti.",
    "dn13:39": "Taṁ kiṁ maññasi, vāseṭṭha, api nu tassa purisassa avhāyanahetu vā āyācanahetu vā patthanahetu vā abhinandanahetu vā aciravatiyā nadiyā pārimaṁ tīraṁ orimaṁ tīraṁ āgaccheyyā\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:40": "\"Evameva kho, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā te dhamme samādāya vattamānā evamāhaṁsu: 'indamavhayāma, somamavhayāma, varuṇamavhayāma, īsānamavhayāma, pajāpatimavhayāma, brahmamavhayāma, mahiddhimavhayāma, yamamavhayāmā'ti.",
    "dn13:41": "Te vata, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā te dhamme samādāya vattamānā avhāyanahetu vā āyācanahetu vā patthanahetu vā abhinandanahetu vā kāyassa bhedā paraṁ maraṇā brahmānaṁ sahabyūpagā bhavissantīti, netaṁ ṭhānaṁ vijjati.",
    "dn13:42": "Seyyathāpi, vāseṭṭha, ayaṁ aciravatī nadī pūrā udakassa samatittikā kākapeyyā. Atha puriso āgaccheyya pāratthiko pāragavesī pāragāmī pāraṁ taritukāmo. So orime tīre daḷhāya anduyā pacchābāhaṁ gāḷhabandhanaṁ baddho.",
    "dn13:43": "Taṁ kiṁ maññasi, vāseṭṭha, api nu so puriso aciravatiyā nadiyā orimā tīrā pārimaṁ tīraṁ gaccheyyā\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:44": "\"Evameva kho, vāseṭṭha, pañcime kāmaguṇā ariyassa vinaye andūtipi vuccanti, bandhanantipi vuccanti. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. Sotaviññeyyā saddā … pe … ghānaviññeyyā gandhā … jivhāviññeyyā rasā … kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā.",
    "dn13:45": "Ime kho, vāseṭṭha, pañca kāmaguṇā ariyassa vinaye andūtipi vuccanti, bandhanantipi vuccanti. Ime kho, vāseṭṭha, pañca kāmaguṇe tevijjā brāhmaṇā gadhitā mucchitā ajjhopannā anādīnavadassāvino anissaraṇapaññā paribhuñjanti.",
    "dn13:46": "Seyyathāpi, vāseṭṭha, ayaṁ aciravatī nadī pūrā udakassa samatittikā kākapeyyā. Atha puriso āgaccheyya pāratthiko pāragavesī pāragāmī pāraṁ taritukāmo. So orime tīre sasīsaṁ pārupitvā nipajjeyya.",
    "dn13:47": "Taṁ kiṁ maññasi, vāseṭṭha, api nu so puriso aciravatiyā nadiyā orimā tīrā pārimaṁ tīraṁ gaccheyyā\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:48": "\"Evameva kho, vāseṭṭha, pañcime nīvaraṇā ariyassa vinaye āvaraṇātipi vuccanti, nīvaraṇātipi vuccanti, onāhanātipi vuccanti, pariyonāhanātipi vuccanti. Katame pañca? Kāmacchandanīvaraṇaṁ, byāpādanīvaraṇaṁ, thinamiddhanīvaraṇaṁ, uddhaccakukkuccanīvaraṇaṁ, vicikicchānīvaraṇaṁ. Ime kho, vāseṭṭha, pañca nīvaraṇā ariyassa vinaye āvaraṇātipi vuccanti, nīvaraṇātipi vuccanti, onāhanātipi vuccanti, pariyonāhanātipi vuccanti.",
    "dn13:49": "Imehi kho, vāseṭṭha, pañcahi nīvaraṇehi tevijjā brāhmaṇā āvuṭā nivutāonaddhāpariyonaddhā. Te vata, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā te dhamme samādāya vattamānā pañcahi nīvaraṇehi āvuṭā nivutā onaddhāpariyonaddhākāyassa bhedā paraṁ maraṇā brahmānaṁ sahabyūpagā bhavissantīti, netaṁ ṭhānaṁ vijjati.",
    "dn13:50": "Taṁ kiṁ maññasi, vāseṭṭha, kinti te sutaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ, sapariggaho vā brahmā apariggaho vā\"ti? \"Apariggaho, bho gotama\".",
    "dn13:51": "\"Taṁ kiṁ maññasi, vāseṭṭha, sapariggahā vā tevijjā brāhmaṇā apariggahā vā\"ti? \"Sapariggahā, bho gotama\".",
    "dn13:52": "\"Iti kira, vāseṭṭha, sapariggahā tevijjā brāhmaṇā apariggaho brahmā. Api nu kho sapariggahānaṁ tevijjānaṁ brāhmaṇānaṁ apariggahena brahmunā saddhiṁ saṁsandati sametī\"ti?",
    "dn13:53": "Iti kira, vāseṭṭha, saveracittā tevijjā brāhmaṇā, averacitto brahmā … pe … sabyāpajjacittā tevijjā brāhmaṇā abyāpajjacitto brahmā … saṅkiliṭṭhacittā tevijjā brāhmaṇā asaṅkiliṭṭhacitto brahmā … avasavattī tevijjā brāhmaṇā vasavattī brahmā, api nu kho avasavattīnaṁ tevijjānaṁ brāhmaṇānaṁ vasavattinā brahmunā saddhiṁ saṁsandati sametī\"ti? \"No hidaṁ, bho gotama\".",
    "dn13:54": "Idha kho pana te, vāseṭṭha, tevijjā brāhmaṇāāsīditvāsaṁsīdanti, saṁsīditvāvisāraṁpāpuṇanti,sukkhataraṁmaññe taranti. Tasmā idaṁ tevijjānaṁ brāhmaṇānaṁ tevijjāiriṇantipi vuccati, tevijjāvivanantipi vuccati, tevijjābyasanantipi vuccatī\"ti.",
    "dn13:55": "Evaṁ vutte, vāseṭṭho māṇavo bhagavantaṁ etadavoca: \"sutaṁ metaṁ, bho gotama, samaṇo gotamo brahmānaṁ sahabyatāya maggaṁ jānātī\"ti. \"Taṁ kiṁ maññasi, vāseṭṭha. Āsanne ito manasākaṭaṁ, na ito dūre manasākaṭan\"ti?",
    "dn13:56": "\"Taṁ kiṁ maññasi, vāseṭṭha, idhassa puriso manasākaṭe jātasaṁvaddho. Tamenaṁ manasākaṭato tāvadeva avasaṭaṁ manasākaṭassa maggaṁ puccheyyuṁ. Siyā nu kho, vāseṭṭha, tassa purisassa manasākaṭe jātasaṁvaddhassa manasākaṭassa maggaṁ puṭṭhassa dandhāyitattaṁ vā vitthāyitattaṁ vā\"ti? \"No hidaṁ, bho gotama\". \"Taṁ kissa hetu\"? \"Amu hi, bho gotama, puriso manasākaṭe jātasaṁvaddho, tassa sabbāneva manasākaṭassa maggāni suviditānī\"ti.",
    "dn13:57": "\"Siyā kho, vāseṭṭha, tassa purisassa manasākaṭe jātasaṁvaddhassa manasākaṭassa maggaṁ puṭṭhassa dandhāyitattaṁ vā vitthāyitattaṁ vā, na tveva tathāgatassa brahmaloke vā brahmalokagāminiyā vā paṭipadāya puṭṭhassa dandhāyitattaṁ vā vitthāyitattaṁ vā. Brahmānañcāhaṁ, vāseṭṭha, pajānāmi brahmalokañca brahmalokagāminiñca paṭipadaṁ, yathā paṭipanno ca brahmalokaṁ upapanno, tañca pajānāmī\"ti.",
    "dn13:58": "Evaṁ vutte, vāseṭṭho māṇavo bhagavantaṁ etadavoca: \"sutaṁ metaṁ, bho gotama, samaṇo gotamo brahmānaṁ sahabyatāya maggaṁ desetī\"ti. \"Sādhu no bhavaṁ gotamo brahmānaṁ sahabyatāya maggaṁ desetu ullumpatu bhavaṁ gotamo brāhmaṇiṁ pajan\"ti.",
    "dn13:59": "Bhagavā etadavoca: \"idha, vāseṭṭha, tathāgato loke uppajjati arahaṁ, sammāsambuddho… pe …Evaṁ kho, vāseṭṭha, bhikkhu sīlasampanno hoti … pe … tassime pañca nīvaraṇe pahīne attani samanupassato pāmojjaṁ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṁ vedeti, sukhino cittaṁ samādhiyati.",
    "dn13:60": "So mettāsahagatena cetasā ekaṁ disaṁ pharitvā viharati. Tathā dutiyaṁ. Tathā tatiyaṁ. Tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati.",
    "dn13:61": "Seyyathāpi, vāseṭṭha, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya; evameva kho, vāseṭṭha, evaṁ bhāvitāyamettāyacetovimuttiyā yaṁ pamāṇakataṁ kammaṁ na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati. Ayampi kho, vāseṭṭha, brahmānaṁ sahabyatāya maggo.",
    "dn13:62": "Puna caparaṁ, vāseṭṭha, bhikkhu karuṇāsahagatena cetasā … pe … muditāsahagatena cetasā … pe … upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā viharati. Tathā dutiyaṁ. Tathā tatiyaṁ. Tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati.",
    "dn13:63": "Seyyathāpi, vāseṭṭha, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya; evameva kho, vāseṭṭha, evaṁ bhāvitāya upekkhāya cetovimuttiyā yaṁ pamāṇakataṁ kammaṁ na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati. Ayampi kho, vāseṭṭha, brahmānaṁ sahabyatāya maggo.",
    "dn13:64": "Taṁ kiṁ maññasi, vāseṭṭha, evaṁvihārī bhikkhu sapariggaho vā apariggaho vā\"ti? \"Apariggaho, bho gotama\". \"Saveracitto vā averacitto vā\"ti? \"Averacitto, bho gotama\". \"Sabyāpajjacitto vā abyāpajjacitto vā\"ti? \"Abyāpajjacitto, bho gotama\". \"Saṅkiliṭṭhacitto vā asaṅkiliṭṭhacitto vā\"ti? \"Asaṅkiliṭṭhacitto, bho gotama\". \"Vasavattī vā avasavattī vā\"ti? \"Vasavattī, bho gotama\".",
    "dn13:65": "\"Iti kira, vāseṭṭha, apariggaho bhikkhu, apariggaho brahmā. Api nu kho apariggahassa bhikkhuno apariggahena brahmunā saddhiṁ saṁsandati sametī\"ti? \"Evaṁ, bho gotama\". \"Sādhu, vāseṭṭha, so vata vāseṭṭha apariggaho bhikkhu kāyassa bhedā paraṁ maraṇā apariggahassa brahmuno sahabyūpago bhavissatīti, ṭhānametaṁ vijjati.",
    "dn13:66": "Iti kira, vāseṭṭha, averacitto bhikkhu, averacitto brahmā … pe … abyāpajjacitto bhikkhu, abyāpajjacitto brahmā … asaṅkiliṭṭhacitto bhikkhu, asaṅkiliṭṭhacitto brahmā … vasavattī bhikkhu, vasavattī brahmā, api nu kho vasavattissa bhikkhuno vasavattinā brahmunā saddhiṁ saṁsandati sametī\"ti? \"Evaṁ, bho gotama\". \"Sādhu, vāseṭṭha, so vata, vāseṭṭha, vasavattī bhikkhu kāyassa bhedā paraṁ maraṇā vasavattissa brahmuno sahabyūpago bhavissatīti, ṭhānametaṁ vijjatī\"ti.",
    "dn13:67": "Evaṁ vutte, vāseṭṭhabhāradvājā māṇavā bhagavantaṁ etadavocuṁ: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: 'cakkhumanto rūpāni dakkhantī'ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito.",
    "dn13:68": "Brahmāsāmaññaambaṭṭha,Soṇakūṭamahālijālinī;Sīhapoṭṭhapādasubho kevaṭṭo,Lohiccatevijjā terasāti."
}