{
    "dn15:1": "Evaṁ me sutaṁ—​ ekaṁ samayaṁ bhagavā kurūsu viharatikammāsadhammaṁ nāmakurūnaṁ nigamo. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca: \"acchariyaṁ, bhante, abbhutaṁ, bhante. Yāva gambhīro cāyaṁ, bhante, paṭiccasamuppādo gambhīrāvabhāso ca, atha ca pana me uttānakuttānako viya khāyatī\"ti. \"Mā hevaṁ, ānanda, avaca, mā hevaṁ, ānanda, avaca. Gambhīro cāyaṁ, ānanda, paṭiccasamuppādo gambhīrāvabhāso ca. Etassa, ānanda, dhammassa ananubodhā appaṭivedhā evamayaṁ pajā tantākulakajātākulagaṇṭhikajātāmuñjapabbajabhūtā apāyaṁ duggatiṁ vinipātaṁ saṁsāraṁ nātivattati.",
    "dn15:2": "'Atthi idappaccayā jarāmaraṇan'ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṁ. 'Kiṁpaccayā jarāmaraṇan'ti iti ce vadeyya, 'jātipaccayā jarāmaraṇan'ti iccassa vacanīyaṁ.",
    "dn15:3": "'Atthi idappaccayā jātī'ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṁ.\n'Kiṁpaccayā jātī'ti iti ce vadeyya, 'bhavapaccayā jātī'ti iccassa vacanīyaṁ.",
    "dn15:4": "'Atthi idappaccayā bhavo'ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṁ.\n'Kiṁpaccayā bhavo'ti iti ce vadeyya, 'upādānapaccayā bhavo'ti iccassa vacanīyaṁ.",
    "dn15:5": "'Atthi idappaccayā upādānan'ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṁ.\n'Kiṁpaccayā upādānan'ti iti ce vadeyya, 'taṇhāpaccayā upādānan'ti iccassa vacanīyaṁ.",
    "dn15:6": "'Atthi idappaccayā taṇhā'ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṁ.\n'Kiṁpaccayā taṇhā'ti iti ce vadeyya, 'vedanāpaccayā taṇhā'ti iccassa vacanīyaṁ.",
    "dn15:7": "'Atthi idappaccayā vedanā'ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṁ.\n'Kiṁpaccayā vedanā'ti iti ce vadeyya, 'phassapaccayā vedanā'ti iccassa vacanīyaṁ.",
    "dn15:8": "'Atthi idappaccayā phasso'ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṁ.\n'Kiṁpaccayā phasso'ti iti ce vadeyya, 'nāmarūpapaccayā phasso'ti iccassa vacanīyaṁ.",
    "dn15:9": "'Atthi idappaccayā nāmarūpan'ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṁ. 'Kiṁpaccayā nāmarūpan'ti iti ce vadeyya, 'viññāṇapaccayā nāmarūpan'ti iccassa vacanīyaṁ.",
    "dn15:10": "'Atthi idappaccayā viññāṇan'ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṁ.\n'Kiṁpaccayā viññāṇan'ti iti ce vadeyya, 'nāmarūpapaccayā viññāṇan'ti iccassa vacanīyaṁ.",
    "dn15:11": "Iti kho, ānanda, nāmarūpapaccayā viññāṇaṁ, viññāṇapaccayā nāmarūpaṁ, nāmarūpapaccayā phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṁ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "dn15:12": "\"Jātipaccayā jarāmaraṇan'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā jātipaccayā jarāmaraṇaṁ. Jāti ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, seyyathidaṁ— devānaṁ vā devattāya, gandhabbānaṁ vā gandhabbattāya, yakkhānaṁ vā yakkhattāya, bhūtānaṁ vā bhūtattāya, manussānaṁ vā manussattāya, catuppadānaṁ vā catuppadattāya, pakkhīnaṁ vā pakkhittāya,sarīsapānaṁ vā sarīsapattāya, tesaṁ tesañca hi, ānanda, sattānaṁ tadattāya jāti nābhavissa. Sabbaso jātiyā asati jātinirodhā api nu kho jarāmaraṇaṁ paññāyethā\"ti?",
    "dn15:13": "'Bhavapaccayā jātī'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā bhavapaccayā jāti. Bhavo ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, seyyathidaṁ—kāmabhavo vā rūpabhavo vā arūpabhavo vā, sabbaso bhave asati bhavanirodhā api nu kho jāti paññāyethā\"ti?",
    "dn15:14": "'Upādānapaccayā bhavo'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā upādānapaccayā bhavo. Upādānañca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, seyyathidaṁ— kāmupādānaṁ vā diṭṭhupādānaṁ vā sīlabbatupādānaṁ vā attavādupādānaṁ vā, sabbaso upādāne asati upādānanirodhā api nu kho bhavo paññāyethā\"ti?",
    "dn15:15": "'Taṇhāpaccayā upādānan'ti iti kho panetaṁ vuttaṁ tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā taṇhāpaccayā upādānaṁ. Taṇhā ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, seyyathidaṁ— rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā, sabbaso taṇhāya asati taṇhānirodhā api nu kho upādānaṁ paññāyethā\"ti?",
    "dn15:16": "'Vedanāpaccayā taṇhā'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā vedanāpaccayā taṇhā. Vedanā ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, seyyathidaṁ— cakkhusamphassajā vedanā sotasamphassajā vedanā ghānasamphassajā vedanā jivhāsamphassajā vedanā kāyasamphassajā vedanā manosamphassajā vedanā, sabbaso vedanāya asati vedanānirodhā api nu kho taṇhā paññāyethā\"ti?",
    "dn15:17": "Iti kho panetaṁ, ānanda, vedanaṁ paṭicca taṇhā, taṇhaṁ paṭicca pariyesanā, pariyesanaṁ paṭicca lābho, lābhaṁ paṭicca vinicchayo, vinicchayaṁ paṭicca chandarāgo, chandarāgaṁ paṭicca ajjhosānaṁ, ajjhosānaṁ paṭicca pariggaho, pariggahaṁ paṭicca macchariyaṁ, macchariyaṁ paṭicca ārakkho. Ārakkhādhikaraṇaṁ daṇḍādānasatthādānakalahaviggahavivādatuvaṁtuvaṁpesuññamusāvādā aneke pāpakā akusalā dhammā sambhavanti.",
    "dn15:18": "'Ārakkhādhikaraṇaṁdaṇḍādānasatthādānakalahaviggahavivādatuvaṁtuvaṁpesuññamusāvādā aneke pāpakā akusalā dhammā sambhavantī'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā ārakkhādhikaraṇaṁ daṇḍādānasatthādānakalahaviggahavivādatuvaṁtuvaṁpesuññamusāvādā aneke pāpakā akusalā dhammā sambhavanti. Ārakkho ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, sabbaso ārakkhe asati ārakkhanirodhā api nu kho daṇḍādānasatthādānakalahaviggahavivādatuvaṁtuvaṁpesuññamusāvādā aneke pāpakā akusalā dhammā sambhaveyyun\"ti?",
    "dn15:19": "'Macchariyaṁ paṭicca ārakkho'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā macchariyaṁ paṭicca ārakkho. Macchariyañca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, sabbaso macchariye asati macchariyanirodhā api nu kho ārakkho paññāyethā\"ti?",
    "dn15:20": "'Pariggahaṁ paṭicca macchariyan'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā pariggahaṁ paṭicca macchariyaṁ. Pariggaho ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, sabbaso pariggahe asati pariggahanirodhā api nu kho macchariyaṁ paññāyethā\"ti?",
    "dn15:21": "'Ajjhosānaṁ paṭicca pariggaho'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā ajjhosānaṁ paṭicca pariggaho. Ajjhosānañca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, sabbaso ajjhosāne asati ajjhosānanirodhā api nu kho pariggaho paññāyethā\"ti?",
    "dn15:22": "'Chandarāgaṁ paṭicca ajjhosānan'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā chandarāgaṁ paṭicca ajjhosānaṁ. Chandarāgo ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, sabbaso chandarāge asati chandarāganirodhā api nu kho ajjhosānaṁ paññāyethā\"ti?",
    "dn15:23": "'Vinicchayaṁ paṭicca chandarāgo'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā vinicchayaṁ paṭicca chandarāgo. Vinicchayo ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, sabbaso vinicchaye asati vinicchayanirodhā api nu kho chandarāgo paññāyethā\"ti?",
    "dn15:24": "'Lābhaṁ paṭicca vinicchayo'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā lābhaṁ paṭicca vinicchayo. Lābho ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, sabbaso lābhe asati lābhanirodhā api nu kho vinicchayo paññāyethā\"ti?",
    "dn15:25": "'Pariyesanaṁ paṭicca lābho'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā pariyesanaṁ paṭicca lābho. Pariyesanā ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, sabbaso pariyesanāya asati pariyesanānirodhā api nu kho lābho paññāyethā\"ti?",
    "dn15:26": "'Taṇhaṁ paṭicca pariyesanā'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā taṇhaṁ paṭicca pariyesanā. Taṇhā ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, seyyathidaṁ— kāmataṇhā bhavataṇhā vibhavataṇhā, sabbaso taṇhāya asati taṇhānirodhā api nu kho pariyesanā paññāyethā\"ti?",
    "dn15:27": "'Phassapaccayā vedanā'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā phassapaccayā vedanā. Phasso ca hi, ānanda, nābhavissa sabbena sabbaṁ sabbathā sabbaṁ kassaci kimhici, seyyathidaṁ— cakkhusamphasso sotasamphasso ghānasamphasso jivhāsamphasso kāyasamphasso manosamphasso, sabbaso phasse asati phassanirodhā api nu kho vedanā paññāyethā\"ti?",
    "dn15:28": "'Nāmarūpapaccayā phasso'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā nāmarūpapaccayā phasso. Yehi, ānanda, ākārehi yehi liṅgehi yehi nimittehi yehi uddesehi nāmakāyassa paññatti hoti, tesu ākāresu tesu liṅgesu tesu nimittesu tesu uddesesu asati api nu kho rūpakāye adhivacanasamphasso paññāyethā\"ti?",
    "dn15:29": "'Viññāṇapaccayā nāmarūpan'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā viññāṇapaccayā nāmarūpaṁ.",
    "dn15:30": "'Nāmarūpapaccayā viññāṇan'ti iti kho panetaṁ vuttaṁ, tadānanda, imināpetaṁ pariyāyena veditabbaṁ, yathā nāmarūpapaccayā viññāṇaṁ. Viññāṇañca hi, ānanda, nāmarūpe patiṭṭhaṁ na labhissatha, api nu kho āyatiṁjātijarāmaraṇaṁ dukkhasamudayasambhavopaññāyethā\"ti?",
    "dn15:31": "Kittāvatā ca, ānanda, attānaṁ paññapento paññapeti? Rūpiṁ vā hi, ānanda, parittaṁ attānaṁ paññapento paññapeti: 'rūpī me paritto attā'ti. Rūpiṁ vā hi, ānanda, anantaṁ attānaṁ paññapento paññapeti: 'rūpī me ananto attā'ti. Arūpiṁ vā hi, ānanda, parittaṁ attānaṁ paññapento paññapeti: 'arūpī me paritto attā'ti. Arūpiṁ vā hi, ānanda, anantaṁ attānaṁ paññapento paññapeti: 'arūpī me ananto attā'ti.",
    "dn15:32": "Tatrānanda, yo so rūpiṁ parittaṁ attānaṁ paññapento paññapeti. Etarahi vā so rūpiṁ parittaṁ attānaṁ paññapento paññapeti, tattha bhāviṁ vā so rūpiṁ parittaṁ attānaṁ paññapento paññapeti, 'atathaṁ vā pana santaṁ tathattāya upakappessāmī'ti iti vā panassa hoti. Evaṁ santaṁ kho, ānanda,rūpiṁparittattānudiṭṭhi anusetīti iccālaṁ vacanāya.",
    "dn15:33": "Tatrānanda, yo so rūpiṁ anantaṁ attānaṁ paññapento paññapeti. Etarahi vā so rūpiṁ anantaṁ attānaṁ paññapento paññapeti, tattha bhāviṁ vā so rūpiṁ anantaṁ attānaṁ paññapento paññapeti, 'atathaṁ vā pana santaṁ tathattāya upakappessāmī'ti iti vā panassa hoti. Evaṁ santaṁ kho, ānanda,rūpiṁanantattānudiṭṭhi anusetīti iccālaṁ vacanāya.",
    "dn15:34": "Tatrānanda, yo so arūpiṁ parittaṁ attānaṁ paññapento paññapeti. Etarahi vā so arūpiṁ parittaṁ attānaṁ paññapento paññapeti, tattha bhāviṁ vā so arūpiṁ parittaṁ attānaṁ paññapento paññapeti, 'atathaṁ vā pana santaṁ tathattāya upakappessāmī'ti iti vā panassa hoti. Evaṁ santaṁ kho, ānanda,arūpiṁparittattānudiṭṭhi anusetīti iccālaṁ vacanāya.",
    "dn15:35": "Tatrānanda, yo so arūpiṁ anantaṁ attānaṁ paññapento paññapeti. Etarahi vā so arūpiṁ anantaṁ attānaṁ paññapento paññapeti, tattha bhāviṁ vā so arūpiṁ anantaṁ attānaṁ paññapento paññapeti, 'atathaṁ vā pana santaṁ tathattāya upakappessāmī'ti iti vā panassa hoti. Evaṁ santaṁ kho, ānanda,arūpiṁanantattānudiṭṭhi anusetīti iccālaṁ vacanāya.",
    "dn15:36": "Kittāvatā ca, ānanda, attānaṁ na paññapento na paññapeti? Rūpiṁ vā hi, ānanda, parittaṁ attānaṁ na paññapento na paññapeti: 'rūpī me paritto attā'ti. Rūpiṁ vā hi, ānanda, anantaṁ attānaṁ na paññapento na paññapeti: 'rūpī me ananto attā'ti. Arūpiṁ vā hi, ānanda, parittaṁ attānaṁ na paññapento na paññapeti: 'arūpī me paritto attā'ti. Arūpiṁ vā hi, ānanda, anantaṁ attānaṁ na paññapento na paññapeti: 'arūpī me ananto attā'ti.",
    "dn15:37": "Tatrānanda, yo so rūpiṁ parittaṁ attānaṁ na paññapento na paññapeti. Etarahi vā so rūpiṁ parittaṁ attānaṁ na paññapento na paññapeti, tattha bhāviṁ vā so rūpiṁ parittaṁ attānaṁ na paññapento na paññapeti, 'atathaṁ vā pana santaṁ tathattāya upakappessāmī'ti iti vā panassa na hoti. Evaṁ santaṁ kho, ānanda, rūpiṁ parittattānudiṭṭhi nānusetīti iccālaṁ vacanāya.",
    "dn15:38": "Tatrānanda, yo so rūpiṁ anantaṁ attānaṁ na paññapento na paññapeti. Etarahi vā so rūpiṁ anantaṁ attānaṁ na paññapento na paññapeti, tattha bhāviṁ vā so rūpiṁ anantaṁ attānaṁ na paññapento na paññapeti, 'atathaṁ vā pana santaṁ tathattāya upakappessāmī'ti iti vā panassa na hoti. Evaṁ santaṁ kho, ānanda, rūpiṁ anantattānudiṭṭhi nānusetīti iccālaṁ vacanāya.",
    "dn15:39": "Tatrānanda, yo so arūpiṁ parittaṁ attānaṁ na paññapento na paññapeti. Etarahi vā so arūpiṁ parittaṁ attānaṁ na paññapento na paññapeti, tattha bhāviṁ vā so arūpiṁ parittaṁ attānaṁ na paññapento na paññapeti, 'atathaṁ vā pana santaṁ tathattāya upakappessāmī'ti iti vā panassa na hoti. Evaṁ santaṁ kho, ānanda, arūpiṁ parittattānudiṭṭhi nānusetīti iccālaṁ vacanāya.",
    "dn15:40": "Tatrānanda, yo so arūpiṁ anantaṁ attānaṁ na paññapento na paññapeti. Etarahi vā so arūpiṁ anantaṁ attānaṁ na paññapento na paññapeti, tattha bhāviṁ vā so arūpiṁ anantaṁ attānaṁ na paññapento na paññapeti, 'atathaṁ vā pana santaṁ tathattāya upakappessāmī'ti iti vā panassa na hoti. Evaṁ santaṁ kho, ānanda, arūpiṁ anantattānudiṭṭhi nānusetīti iccālaṁ vacanāya.",
    "dn15:41": "Kittāvatā ca, ānanda, attānaṁ samanupassamāno samanupassati? Vedanaṁ vā hi, ānanda, attānaṁ samanupassamāno samanupassati: 'vedanā me attā'ti. 'Na heva kho me vedanā attā, appaṭisaṁvedano me attā'ti iti vā hi, ānanda, attānaṁ samanupassamāno samanupassati. 'Na heva kho me vedanā attā, nopi appaṭisaṁvedano me attā, attā me vediyati, vedanādhammo hi me attā'ti iti vā hi, ānanda, attānaṁ samanupassamāno samanupassati.",
    "dn15:42": "Tatrānanda, yo so evamāha: 'vedanā me attā'ti, so evamassa vacanīyo: 'tisso kho imā, āvuso, vedanā—sukhā vedanā dukkhā vedanā adukkhamasukhā vedanā. Imāsaṁ kho tvaṁ tissannaṁ vedanānaṁ katamaṁ attato samanupassasī'ti?",
    "dn15:43": "Sukhāpi kho, ānanda, vedanā aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā. Dukkhāpi kho, ānanda, vedanā aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā. Adukkhamasukhāpi kho, ānanda, vedanā aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā.",
    "dn15:44": "Tatrānanda, yo so evamāha: 'na heva kho me vedanā attā, appaṭisaṁvedano me attā'ti, so evamassa vacanīyo: 'yattha panāvuso, sabbaso vedayitaṁ natthi api nu kho, tattha \"ayamahamasmī\"ti siyā'\"ti?",
    "dn15:45": "Tatrānanda, yo so evamāha: 'na heva kho me vedanā attā, nopi appaṭisaṁvedano me attā, attā me vediyati, vedanādhammo hi me attā'ti. So evamassa vacanīyo – vedanā ca hi, āvuso, sabbena sabbaṁ sabbathā sabbaṁ aparisesā nirujjheyyuṁ. Sabbaso vedanāya asati vedanānirodhā api nu kho tattha 'ayamahamasmī'ti siyā\"ti?",
    "dn15:46": "Yato kho, ānanda, bhikkhu neva vedanaṁ attānaṁ samanupassati, nopi appaṭisaṁvedanaṁ attānaṁ samanupassati, nopi 'attā me vediyati, vedanādhammo hi me attā'ti samanupassati. So evaṁ na samanupassanto na ca kiñci loke upādiyati, anupādiyaṁ na paritassati,aparitassaṁpaccattaññeva parinibbāyati, 'khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā'ti pajānāti.",
    "dn15:47": "Satta kho, ānanda, viññāṇaṭṭhitiyo, dve āyatanāni. Katamā satta?",
    "dn15:48": "Tatrānanda, yāyaṁ paṭhamā viññāṇaṭṭhiti nānattakāyā nānattasaññino, seyyathāpi manussā, ekacce ca devā, ekacce ca vinipātikā. Yo nu kho, ānanda, tañca pajānāti, tassā ca samudayaṁ pajānāti, tassā ca atthaṅgamaṁ pajānāti, tassā ca assādaṁ pajānāti, tassā ca ādīnavaṁ pajānāti, tassā ca nissaraṇaṁ pajānāti, kallaṁ nu tena tadabhinanditun\"ti?",
    "dn15:49": "Aṭṭha kho ime, ānanda, vimokkhā. Katame aṭṭha?",
    "dn15:50": "Yato kho, ānanda, bhikkhu ime aṭṭha vimokkhe anulomampi samāpajjati, paṭilomampi samāpajjati, anulomapaṭilomampi samāpajjati, yatthicchakaṁ yadicchakaṁ yāvaticchakaṁ samāpajjatipi vuṭṭhātipi. Āsavānañca khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharati, ayaṁ vuccatānanda, bhikkhu ubhatobhāgavimutto. Imāya ca, ānanda, ubhatobhāgavimuttiyā aññā ubhatobhāgavimutti uttaritarā vā paṇītatarā vā natthī\"ti.",
    "dn15:51": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṁ abhinandīti."
}