{
    "dn16:1": "Evaṁ me sutaṁ—​ ekaṁ samayaṁ bhagavā rājagahe viharati gijjhakūṭe pabbate.",
    "dn16:2": "Atha kho rājā māgadho ajātasattu vedehiputto vassakāraṁ brāhmaṇaṁ magadhamahāmattaṁ āmantesi:",
    "dn16:3": "\"Evaṁ, bho\"ti kho vassakāro brāhmaṇo magadhamahāmatto rañño māgadhassa ajātasattussa vedehiputtassa paṭissutvā bhaddāni bhaddāni yānāni yojetvā bhaddaṁ bhaddaṁ yānaṁ abhiruhitvā bhaddehi bhaddehi yānehi rājagahamhā niyyāsi, yena gijjhakūṭo pabbato tena pāyāsi. Yāvatikā yānassa bhūmi, yānena gantvā, yānā paccorohitvā pattikova yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho vassakāro brāhmaṇo magadhamahāmatto bhagavantaṁ etadavoca:",
    "dn16:4": "Tena kho pana samayena āyasmā ānando bhagavato piṭṭhito ṭhito hoti bhagavantaṁbījayamāno. Atha kho bhagavā āyasmantaṁ ānandaṁ āmantesi:",
    "dn16:5": "Atha kho bhagavā vassakāraṁ brāhmaṇaṁ magadhamahāmattaṁ āmantesi: \"ekamidāhaṁ, brāhmaṇa, samayaṁ vesāliyaṁ viharāmisārandadecetiye. Tatrāhaṁ vajjīnaṁ ime satta aparihāniye dhamme desesiṁ. Yāvakīvañca, brāhmaṇa, ime satta aparihāniyā dhammā vajjīsu ṭhassanti, imesu ca sattasu aparihāniyesu dhammesu vajjī sandississanti, vuddhiyeva, brāhmaṇa, vajjīnaṁ pāṭikaṅkhā, no parihānī\"ti.",
    "dn16:6": "Atha kho bhagavā acirapakkante vassakāre brāhmaṇe magadhamahāmatte āyasmantaṁ ānandaṁ āmantesi: \"gaccha tvaṁ, Ānanda, yāvatikā bhikkhū rājagahaṁ upanissāya viharanti, te sabbe upaṭṭhānasālāyaṁ sannipātehī\"ti.",
    "dn16:7": "Aparepi vo, bhikkhave, satta aparihāniye dhamme desessāmi, taṁ suṇātha, sādhukaṁ manasikarotha, bhāsissāmī\"ti. \"Evaṁ, bhante\"ti kho te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "dn16:8": "Aparepi vo, bhikkhave, satta aparihāniye dhamme desessāmi … pe … . Yāvakīvañca, bhikkhave, bhikkhū saddhā bhavissanti … pe … hirimanā bhavissanti … ottappī bhavissanti … bahussutā bhavissanti … āraddhavīriyā bhavissanti … upaṭṭhitassatī bhavissanti … paññavanto bhavissanti, vuddhiyeva, bhikkhave, bhikkhūnaṁ pāṭikaṅkhā, no parihāni.",
    "dn16:9": "Aparepi vo, bhikkhave, satta aparihāniye dhamme desessāmi, taṁ suṇātha, sādhukaṁ manasikarotha, bhāsissāmī\"ti. \"Evaṁ, bhante\"ti kho te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "dn16:10": "Aparepi vo, bhikkhave, satta aparihāniye dhamme desessāmi, taṁ suṇātha, sādhukaṁ manasikarotha, bhāsissāmī\"ti. \"Evaṁ, bhante\"ti kho te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "dn16:11": "Cha vo, bhikkhave, aparihāniye dhamme desessāmi, taṁ suṇātha, sādhukaṁ manasikarotha, bhāsissāmī\"ti. \"Evaṁ, bhante\"ti kho te bhikkhū bhagavato paccassosuṁ. Bhagavā etadavoca:",
    "dn16:12": "Tatra sudaṁ bhagavā rājagahe viharanto gijjhakūṭe pabbate etadeva bahulaṁ bhikkhūnaṁ dhammiṁ kathaṁ karoti: \"iti sīlaṁ, iti samādhi, iti paññā. Sīlaparibhāvito samādhi mahapphalo hoti mahānisaṁso. Samādhiparibhāvitā paññā mahapphalā hoti mahānisaṁsā. Paññāparibhāvitaṁ cittaṁ sammadeva āsavehi vimuccati, seyyathidaṁ—kāmāsavā, bhavāsavā, avijjāsavā\"ti.",
    "dn16:13": "Atha kho bhagavā rājagahe yathābhirantaṁ viharitvā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yena ambalaṭṭhikā tenupasaṅkamissāmā\"ti.",
    "dn16:14": "Atha kho bhagavā ambalaṭṭhikāyaṁ yathābhirantaṁ viharitvā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yena nāḷandā tenupasaṅkamissāmā\"ti.",
    "dn16:15": "Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā sāriputto bhagavantaṁ etadavoca: \"evaṁ pasanno ahaṁ, bhante, bhagavati; na cāhu na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro yadidaṁ sambodhiyan\"ti.",
    "dn16:16": "\"Na kho me, bhante, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṁ atthi, api ca me dhammanvayo vidito.",
    "dn16:17": "Tatrapi sudaṁ bhagavā nāḷandāyaṁ viharanto pāvārikambavane etadeva bahulaṁ bhikkhūnaṁ dhammiṁ kathaṁ karoti:",
    "dn16:18": "Atha kho bhagavā nāḷandāyaṁ yathābhirantaṁ viharitvā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yena pāṭaligāmo tenupasaṅkamissāmā\"ti.",
    "dn16:19": "Atha kho bhagavā pāṭaligāmike upāsake āmantesi: \"pañcime, gahapatayo, ādīnavā dussīlassa sīlavipattiyā. Katame pañca?",
    "dn16:20": "Pañcime, gahapatayo, ānisaṁsā sīlavato sīlasampadāya. Katame pañca? Idha, gahapatayo, sīlavā sīlasampanno appamādādhikaraṇaṁ mahantaṁ bhogakkhandhaṁ adhigacchati. Ayaṁ paṭhamo ānisaṁso sīlavato sīlasampadāya.",
    "dn16:21": "Atha kho bhagavā pāṭaligāmike upāsake bahudeva rattiṁ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṁsetvā uyyojesi:",
    "dn16:22": "Tena kho pana samayenasunidhavassakārāmagadhamahāmattā pāṭaligāme nagaraṁ māpenti vajjīnaṁ paṭibāhāya. Tena samayena sambahulā devatāyosahassevapāṭaligāme vatthūni pariggaṇhanti.",
    "dn16:23": "Atha kho sunidhavassakārā magadhamahāmattā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavatā saddhiṁ sammodiṁsu, sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ aṭṭhaṁsu, ekamantaṁ ṭhitā kho sunidhavassakārā magadhamahāmattā bhagavantaṁ etadavocuṁ: \"adhivāsetu no bhavaṁ gotamo ajjatanāya bhattaṁ saddhiṁ bhikkhusaṅghenā\"ti. Adhivāsesi bhagavā tuṇhībhāvena.",
    "dn16:24": "Tena kho pana samayena sunidhavassakārā magadhamahāmattā bhagavantaṁ piṭṭhito piṭṭhito anubandhā honti: \"yenajja samaṇo gotamo dvārena nikkhamissati, taṁ gotamadvāraṁ nāma bhavissati. Yena titthena gaṅgaṁ nadiṁ tarissati, taṁ gotamatitthaṁ nāma bhavissatī\"ti.",
    "dn16:25": "Atha kho bhagavā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yena koṭigāmo tenupasaṅkamissāmā\"ti. \"Evaṁ, bhante\"ti kho āyasmā ānando bhagavato paccassosi. Atha kho bhagavā mahatā bhikkhusaṁghena saddhiṁ yena koṭigāmo tadavasari. Tatra sudaṁ bhagavā koṭigāme viharati.",
    "dn16:26": "Atha kho bhagavā koṭigāme yathābhirantaṁ viharitvā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yenanātikātenupaṅkamissāmā\"ti.",
    "dn16:27": "\"Sāḷho, Ānanda, bhikkhu āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāsi.",
    "dn16:28": "Anacchariyaṁ kho panetaṁ, Ānanda, yaṁ manussabhūto kālaṁ kareyya.Tasmiṁyevakālaṅkate tathāgataṁ upasaṅkamitvā etamatthaṁ pucchissatha, vihesā hesā, Ānanda, tathāgatassa.",
    "dn16:29": "Katamo ca so, Ānanda, dhammādāso dhammapariyāyo, yena samannāgato ariyasāvako ākaṅkhamāno attanāva attānaṁ byākareyya: 'khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo'ti?",
    "dn16:30": "Atha kho bhagavā nātike yathābhirantaṁ viharitvā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yena vesālī tenupasaṅkamissāmā\"ti.",
    "dn16:31": "Assosi kho ambapālī gaṇikā: \"Bhagavā kira vesāliṁ anuppatto vesāliyaṁ viharati mayhaṁ ambavane\"ti.",
    "dn16:32": "Atha kho ambapālī gaṇikā tassā rattiyā accayena sake ārāme paṇītaṁ khādanīyaṁ bhojanīyaṁ paṭiyādāpetvā bhagavato kālaṁ ārocāpesi: \"kālo, bhante, niṭṭhitaṁ bhattan\"ti.",
    "dn16:33": "Atha kho bhagavā ambapālivane yathābhirantaṁ viharitvā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yenaveḷuvagāmakotenupasaṅkamissāmā\"ti.",
    "dn16:34": "Atha kho bhagavā taṁ ābādhaṁ vīriyena paṭipaṇāmetvā jīvitasaṅkhāraṁ adhiṭṭhāya vihāsi. Atha kho bhagavato so ābādho paṭippassambhi. Atha kho bhagavāgilānā vuṭṭhitoaciravuṭṭhito gelaññā vihārā nikkhamma vihārapacchāyāyaṁ paññatte āsane nisīdi.",
    "dn16:35": "\"Kiṁ panānanda, bhikkhusaṁgho mayipaccāsīsati? Desito, Ānanda, mayā dhammo anantaraṁ abāhiraṁ karitvā. Natthānanda, tathāgatassa dhammesu ācariyamuṭṭhi.",
    "dn16:36": "Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya vesāliṁ piṇḍāya pāvisi. Vesāliyaṁ piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkanto āyasmantaṁ ānandaṁ āmantesi: \"gaṇhāhi, Ānanda, nisīdanaṁ, yenacāpālaṁ cetiyaṁtenupasaṅkamissāma divā vihārāyā\"ti.",
    "dn16:37": "Ekamantaṁ nisinnaṁ kho āyasmantaṁ ānandaṁ bhagavā etadavoca:",
    "dn16:38": "Atha kho māro pāpimā acirapakkante āyasmante ānande yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho māro pāpimā bhagavantaṁ etadavoca:",
    "dn16:39": "Atha kho bhagavā cāpāle cetiye sato sampajāno āyusaṅkhāraṁ ossaji. Ossaṭṭhe ca bhagavatā āyusaṅkhāre mahābhūmicālo ahosi bhiṁsanakosalomahaṁso,devadundubhiyoca phaliṁsu.",
    "dn16:40": "Atha kho āyasmato ānandassa etadahosi: \"acchariyaṁ vata bho, abbhutaṁ vata bho, mahā vatāyaṁ bhūmicālo; sumahā vatāyaṁ bhūmicālo bhiṁsanako salomahaṁso; devadundubhiyo ca phaliṁsu. Ko nu kho hetu ko paccayo mahato bhūmicālassa pātubhāvāyā\"ti?",
    "dn16:41": "\"Aṭṭha kho ime, Ānanda, hetū, aṭṭha paccayā mahato bhūmicālassa pātubhāvāya.",
    "dn16:42": "Aṭṭha kho imā, Ānanda, parisā.",
    "dn16:43": "Aṭṭha kho imāni, Ānanda, abhibhāyatanāni.",
    "dn16:44": "Aṭṭha kho ime, Ānanda, vimokkhā. Katame aṭṭha?",
    "dn16:45": "Ekamidāhaṁ, Ānanda, samayaṁ uruvelāyaṁ viharāmi najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Atha kho, Ānanda, māro pāpimā yenāhaṁ tenupasaṅkami; upasaṅkamitvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho, Ānanda, māro pāpimā maṁ etadavoca:",
    "dn16:46": "Idāneva kho, Ānanda, ajja cāpāle cetiye māro pāpimā yenāhaṁ tenupasaṅkami; upasaṅkamitvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho, Ānanda, māro pāpimā maṁ etadavoca:",
    "dn16:47": "Evaṁ vutte, ahaṁ, Ānanda, māraṁ pāpimantaṁ etadavocaṁ: 'appossukko tvaṁ, pāpima, hohi, na ciraṁ tathāgatassa parinibbānaṁ bhavissati. Ito tiṇṇaṁ māsānaṁ accayena tathāgato parinibbāyissatī'ti. Idāneva kho, Ānanda, ajja cāpāle cetiye tathāgatena satena sampajānena āyusaṅkhāro ossaṭṭho\"ti.",
    "dn16:48": "Evaṁ vutte, āyasmā ānando bhagavantaṁ etadavoca: \"tiṭṭhatu, bhante, bhagavā kappaṁ, tiṭṭhatu sugato kappaṁ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānan\"ti.",
    "dn16:49": "Ekamidāhaṁ, Ānanda, samayaṁ rājagahe viharāmi gijjhakūṭe pabbate. Tatrāpi kho tāhaṁ, Ānanda, āmantesiṁ:",
    "dn16:50": "Ekamidāhaṁ, Ānanda, samayaṁ tattheva rājagahe viharāmi gotamanigrodhe … pe … tattheva rājagahe viharāmi corapapāte … tattheva rājagahe viharāmi vebhārapasse sattapaṇṇiguhāyaṁ … tattheva rājagahe viharāmi isigilipasse kāḷasilāyaṁ … tattheva rājagahe viharāmi sītavane sappasoṇḍikapabbhāre … tattheva rājagahe viharāmi tapodārāme … tattheva rājagahe viharāmi veḷuvane kalandakanivāpe … tattheva rājagahe viharāmi jīvakambavane … tattheva rājagahe viharāmi maddakucchismiṁ migadāye.",
    "dn16:51": "Ekamidāhaṁ, Ānanda, samayaṁ idheva vesāliyaṁ viharāmi udene cetiye. Tatrāpi kho tāhaṁ, Ānanda, āmantesiṁ:",
    "dn16:52": "Ekamidāhaṁ, Ānanda, samayaṁ idheva vesāliyaṁ viharāmi gotamake cetiye … pe … idheva vesāliyaṁ viharāmi sattambe cetiye … idheva vesāliyaṁ viharāmi bahuputte cetiye … idheva vesāliyaṁ viharāmi sārandade cetiye … idāneva kho tāhaṁ, Ānanda, ajja cāpāle cetiye āmantesiṁ: 'ramaṇīyā, Ānanda, vesālī, ramaṇīyaṁ udenaṁ cetiyaṁ, ramaṇīyaṁ gotamakaṁ cetiyaṁ, ramaṇīyaṁ sattambaṁ cetiyaṁ, ramaṇīyaṁ bahuputtaṁ cetiyaṁ, ramaṇīyaṁ sārandadaṁ cetiyaṁ, ramaṇīyaṁ cāpālaṁ cetiyaṁ.",
    "dn16:53": "Nanuetaṁ, Ānanda, mayāpaṭikaccevaakkhātaṁ: 'sabbeheva piyehi manāpehi nānābhāvo vinābhāvo aññathābhāvo. Taṁ kutettha, Ānanda, labbhā, yaṁ taṁ jātaṁ bhūtaṁ saṅkhataṁ palokadhammaṁ, taṁ vata mā palujjīti netaṁ ṭhānaṁ vijjati'. Yaṁ kho panetaṁ, Ānanda, tathāgatena cattaṁ vantaṁ muttaṁ pahīnaṁ paṭinissaṭṭhaṁ ossaṭṭho āyusaṅkhāro, ekaṁsena vācā bhāsitā:",
    "dn16:54": "Atha kho bhagavā yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi:",
    "dn16:55": "Atha kho bhagavā bhikkhū āmantesi:",
    "dn16:56": "Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya vesāliṁ piṇḍāya pāvisi. Vesāliyaṁ piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkanto nāgāpalokitaṁ vesāliṁ apaloketvā āyasmantaṁ ānandaṁ āmantesi: \"Idaṁ pacchimakaṁ, Ānanda, tathāgatassa vesāliyā dassanaṁ bhavissati. āyāmānanda, yenabhaṇḍagāmotenupasaṅkamissāmā\"ti.",
    "dn16:57": "Atha kho bhagavā bhaṇḍagāme yathābhirantaṁ viharitvā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yena hatthigāmo, yena ambagāmo, yena jambugāmo, yena bhoganagaraṁ tenupasaṅkamissāmā\"ti. Tatra sudaṁ bhagavā bhoganagare viharatiānandecetiye.",
    "dn16:58": "\"Idha, bhikkhave, bhikkhu evaṁ vadeyya: 'sammukhā metaṁ, āvuso, bhagavato sutaṁ sammukhā paṭiggahitaṁ, ayaṁ dhammo ayaṁ vinayo idaṁ satthusāsanan'ti. Tassa, bhikkhave, bhikkhuno bhāsitaṁ neva abhinanditabbaṁ nappaṭikkositabbaṁ. Anabhinanditvā appaṭikkositvā tāni padabyañjanāni sādhukaṁ uggahetvā sutteosāretabbāni, vinaye sandassetabbāni.",
    "dn16:59": "Atha kho bhagavā bhoganagare yathābhirantaṁ viharitvā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yena pāvā tenupasaṅkamissāmā\"ti.",
    "dn16:60": "Atha kho bhagavato cundassa kammāraputtassa bhattaṁ bhuttāvissa kharo ābādho uppajji, lohitapakkhandikā pabāḷhā vedanā vattanti māraṇantikā. Tā sudaṁ bhagavā sato sampajāno adhivāsesi avihaññamāno. Atha kho bhagavā āyasmantaṁ ānandaṁ āmantesi: \"āyāmānanda, yena kusinārā tenupasaṅkamissāmā\"ti.",
    "dn16:61": "Atha kho bhagavā maggā okkamma yena aññataraṁ rukkhamūlaṁ tenupasaṅkami; upasaṅkamitvā āyasmantaṁ ānandaṁ āmantesi: \"iṅgha me tvaṁ, Ānanda, catugguṇaṁ saṅghāṭiṁ paññapehi, kilantosmi, Ānanda, nisīdissāmī\"ti.",
    "dn16:62": "Tena kho pana samayena pukkuso mallaputto āḷārassa kālāmassa sāvako kusinārāya pāvaṁ addhānamaggappaṭipanno hoti. Addasā kho pukkuso mallaputto bhagavantaṁ aññatarasmiṁ rukkhamūle nisinnaṁ. Disvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho pukkuso mallaputto bhagavantaṁ etadavoca: \"acchariyaṁ, bhante, abbhutaṁ, bhante, santena vata, bhante, pabbajitā vihārena viharanti.",
    "dn16:63": "\"Taṁ kiṁ maññasi, pukkusa, katamaṁ nu kho dukkarataraṁ vā durabhisambhavataraṁ vā—yo vā saññī samāno jāgaro pañcamattāni sakaṭasatāni nissāya nissāya atikkantāni neva passeyya, na pana saddaṁ suṇeyya; yo vā saññī samāno jāgaro deve vassante deve gaḷagaḷāyantevijjullatāsuniccharantīsu asaniyā phalantiyā neva passeyya, na pana saddaṁ suṇeyyā\"ti?",
    "dn16:64": "Atha kho, pukkusa, tassa purisassa etadahosi: 'acchariyaṁ vata bho, abbhutaṁ vata bho, santena vata bho pabbajitā vihārena viharanti. Yatra hi nāma saññī samāno jāgaro deve vassante deve gaḷagaḷāyante vijjullatāsu niccharantīsu asaniyā phalantiyā neva dakkhati, na pana saddaṁsossatī'ti. Mayi uḷāraṁ pasādaṁ pavedetvā maṁ abhivādetvā padakkhiṇaṁ katvā pakkāmī\"ti.",
    "dn16:65": "Atha kho āyasmā Ānando acirapakkante pukkuse mallaputte taṁ siṅgīvaṇṇaṁ yugamaṭṭhaṁ dhāraṇīyaṁ bhagavato kāyaṁ upanāmesi. Taṁ bhagavato kāyaṁ upanāmitaṁhataccikaṁ viyakhāyati.",
    "dn16:66": "Atha kho bhagavā mahatā bhikkhusaṁghena saddhiṁ yena kakudhā nadī tenupasaṅkami; upasaṅkamitvā kakudhaṁ nadiṁ ajjhogāhetvā nhatvā ca pivitvā ca paccuttaritvā yena ambavanaṁ tenupasaṅkami. Upasaṅkamitvā āyasmantaṁ cundakaṁ āmantesi: \"iṅgha me tvaṁ, cundaka, catugguṇaṁ saṅghāṭiṁ paññapehi, kilantosmi, cundaka, nipajjissāmī\"ti.",
    "dn16:67": "Atha kho bhagavā āyasmantaṁ ānandaṁ āmantesi: \"siyākhopanānanda, cundassa kammāraputtassa koci vippaṭisāraṁ uppādeyya: 'tassa te, āvuso cunda, alābhā tassa te dulladdhaṁ, yassa te tathāgato pacchimaṁ piṇḍapātaṁ paribhuñjitvā parinibbuto'ti.",
    "dn16:68": "Atha kho bhagavā āyasmantaṁ Ānandaṁ āmantesi: \"āyāmānanda, yena hiraññavatiyā nadiyā pārimaṁ tīraṁ, yena kusinārā upavattanaṁ mallānaṁ sālavanaṁ tenupasaṅkamissāmā\"ti.",
    "dn16:69": "Atha kho bhagavā āyasmantaṁ ānandaṁ āmantesi: \"sabbaphāliphullā kho, Ānanda, yamakasālā akālapupphehi. Te tathāgatassa sarīraṁ okiranti ajjhokiranti abhippakiranti tathāgatassa pūjāya. Dibbānipi mandāravapupphāni antalikkhā papatanti, tāni tathāgatassa sarīraṁ okiranti ajjhokiranti abhippakiranti tathāgatassa pūjāya. Dibbānipi candanacuṇṇāni antalikkhā papatanti, tāni tathāgatassa sarīraṁ okiranti ajjhokiranti abhippakiranti tathāgatassa pūjāya. Dibbānipi tūriyāni antalikkhe vajjanti tathāgatassa pūjāya. Dibbānipi saṅgītāni antalikkhe vattanti tathāgatassa pūjāya.",
    "dn16:70": "Tena kho pana samayena āyasmā upavāṇo bhagavato purato ṭhito hoti bhagavantaṁ bījayamāno. Atha kho bhagavā āyasmantaṁ upavāṇaṁ apasāresi: \"apehi, bhikkhu, mā me purato aṭṭhāsī\"ti.",
    "dn16:71": "\"Kathaṁbhūtā pana, bhante, bhagavā devatāmanasikarotī\"ti?",
    "dn16:72": "\"Pubbe, bhante, disāsuvassaṁvuṭṭhābhikkhū āgacchanti tathāgataṁ dassanāya. Te mayaṁ labhāma manobhāvanīye bhikkhū dassanāya, labhāma payirupāsanāya. Bhagavato pana mayaṁ, bhante, accayena na labhissāma manobhāvanīye bhikkhū dassanāya, na labhissāma payirupāsanāyā\"ti.",
    "dn16:73": "\"Kathaṁ mayaṁ, bhante, mātugāme paṭipajjāmā\"ti?",
    "dn16:74": "\"Kathaṁ mayaṁ, bhante, tathāgatassa sarīre paṭipajjāmā\"ti?",
    "dn16:75": "\"Kathaṁ pana, bhante, tathāgatassa sarīre paṭipajjitabban\"ti?",
    "dn16:76": "Cattārome, Ānanda, thūpārahā. Katame cattāro?",
    "dn16:77": "Atha kho āyasmā ānando vihāraṁ pavisitvā kapisīsaṁ ālambitvā rodamāno aṭṭhāsi: \"ahañca vatamhi sekho sakaraṇīyo, satthu ca me parinibbānaṁ bhavissati, yo mama anukampako\"ti.",
    "dn16:78": "Atha kho bhagavā bhikkhū āmantesi: \"yepi te, bhikkhave, ahesuṁ atītamaddhānaṁ arahanto sammāsambuddhā, tesampi bhagavantānaṁ etapparamāyeva upaṭṭhākā ahesuṁ, seyyathāpi mayhaṁ ānando. Yepi te, bhikkhave, bhavissanti anāgatamaddhānaṁ arahanto sammāsambuddhā, tesampi bhagavantānaṁ etapparamāyeva upaṭṭhākā bhavissanti, seyyathāpi mayhaṁ ānando.",
    "dn16:79": "Cattārome, bhikkhave, acchariyāabbhutā dhammāānande. Katame cattāro?",
    "dn16:80": "Evaṁ vutte, āyasmā ānando bhagavantaṁ etadavoca: \" mā, bhante, bhagavā imasmiṁ khuddakanagarake ujjaṅgalanagarake sākhānagarake parinibbāyi. Santi, bhante, aññāni mahānagarāni, seyyathidaṁ—campā rājagahaṁ sāvatthī sāketaṁ kosambī bārāṇasī; ettha bhagavā parinibbāyatu. Ettha bahū khattiyamahāsālā, brāhmaṇamahāsālā gahapatimahāsālā tathāgate abhippasannā. Te tathāgatassa sarīrapūjaṁ karissantī\"ti \"mā hevaṁ, Ānanda, avaca; mā hevaṁ, Ānanda, avaca: 'khuddakanagarakaṁ ujjaṅgalanagarakaṁ sākhānagarakan'ti.",
    "dn16:81": "Tena kho pana samayena kosinārakā mallāsandhāgāresannipatitā honti kenacideva karaṇīyena. Atha kho āyasmā ānando yena kosinārakānaṁ mallānaṁ sandhāgāraṁ tenupasaṅkami; upasaṅkamitvā kosinārakānaṁ mallānaṁ ārocesi: \"ajja kho, vāseṭṭhā, rattiyā pacchime yāme tathāgatassa parinibbānaṁ bhavissati. Abhikkamatha, vāseṭṭhā, abhikkamatha, vāseṭṭhā. Mā pacchā vippaṭisārino ahuvattha: 'amhākañca no gāmakkhette tathāgatassa parinibbānaṁ ahosi, na mayaṁ labhimhā pacchime kāle tathāgataṁ dassanāyā'\"ti.",
    "dn16:82": "Tena kho pana samayena subhaddo nāma paribbājako kusinārāyaṁ paṭivasati. Assosi kho subhaddo paribbājako: \"ajja kira rattiyā pacchime yāme samaṇassa gotamassa parinibbānaṁ bhavissatī\"ti.",
    "dn16:83": "Assosi kho bhagavā āyasmato ānandassa subhaddena paribbājakena saddhiṁ imaṁ kathāsallāpaṁ. Atha kho bhagavā āyasmantaṁ ānandaṁ āmantesi: \"Alaṁ, Ānanda, mā subhaddaṁ vāresi, labhataṁ, Ānanda, subhaddo tathāgataṁ dassanāya. Yaṁ kiñci maṁ subhaddo pucchissati, sabbaṁ taṁ aññāpekkhova pucchissati, no vihesāpekkho. Yañcassāhaṁ puṭṭho byākarissāmi, taṁ khippameva ājānissatī\"ti.",
    "dn16:84": "\"Yasmiṁ kho, subhadda, dhammavinaye ariyo aṭṭhaṅgiko maggo na upalabbhati, samaṇopi tattha na upalabbhati. Dutiyopi tattha samaṇo na upalabbhati. Tatiyopi tattha samaṇo na upalabbhati. Catutthopi tattha samaṇo na upalabbhati.",
    "dn16:85": "Evaṁ vutte, subhaddo paribbājako bhagavantaṁ etadavoca: \"Abhikkantaṁ, bhante, abhikkantaṁ, bhante. Seyyathāpi, bhante, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: 'cakkhumanto rūpāni dakkhantī'ti; evamevaṁ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṁ, bhante, bhagavantaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Labheyyāhaṁ, bhante, bhagavato santike pabbajjaṁ, labheyyaṁ upasampadan\"ti.",
    "dn16:86": "Atha kho bhagavā āyasmantaṁ Ānandaṁ āmantesi: \"Siyā kho panānanda, tumhākaṁ evamassa: 'atītasatthukaṁ pāvacanaṁ, natthi no satthā'ti. Na kho panetaṁ, Ānanda, evaṁ daṭṭhabbaṁ. Yo vo, Ānanda, mayā dhammo ca vinayo ca desito paññatto, so vo mamaccayena satthā.",
    "dn16:87": "Atha kho bhagavā bhikkhū āmantesi: \"siyā kho pana, bhikkhave, ekabhikkhussāpi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha: 'sammukhībhūto no satthā ahosi, na mayaṁ sakkhimhā bhagavantaṁ sammukhā paṭipucchitun'\"ti. Evaṁ vutte, te bhikkhū tuṇhī ahesuṁ.",
    "dn16:88": "Atha kho bhagavā bhikkhū āmantesi: \"handa dāni, bhikkhave, āmantayāmi vo, vayadhammā saṅkhārā appamādena sampādethā\"ti. Ayaṁ tathāgatassa pacchimā vācā.",
    "dn16:89": "Atha kho bhagavā paṭhamaṁ jhānaṁ samāpajji, paṭhamajjhānā vuṭṭhahitvā dutiyaṁ jhānaṁ samāpajji, dutiyajjhānā vuṭṭhahitvā tatiyaṁ jhānaṁ samāpajji, tatiyajjhānā vuṭṭhahitvā catutthaṁ jhānaṁ samāpajji, catutthajjhānā vuṭṭhahitvā ākāsānañcāyatanaṁ samāpajji, ākāsānañcāyatanasamāpattiyā vuṭṭhahitvā viññāṇañcāyatanaṁ samāpajji, viññāṇañcāyatanasamāpattiyā vuṭṭhahitvā ākiñcaññāyatanaṁ samāpajji, ākiñcaññāyatanasamāpattiyā vuṭṭhahitvā nevasaññānāsaññāyatanaṁ samāpajji, nevasaññānāsaññāyatanasamāpattiyā vuṭṭhahitvā saññāvedayitanirodhaṁ samāpajji.",
    "dn16:90": "Parinibbute bhagavati saha parinibbānā mahābhūmicālo ahosi bhiṁsanako salomahaṁso. Devadundubhiyo ca phaliṁsu. Parinibbute bhagavati saha parinibbānā brahmāsahampati imaṁ gāthaṁ abhāsi:",
    "dn16:91": "\"Sabbeva nikkhipissanti,bhūtā loke samussayaṁ;Yattha etādiso satthā,loke appaṭipuggalo;Tathāgato balappatto,sambuddho parinibbuto\"ti.",
    "dn16:92": "Parinibbute bhagavati saha parinibbānā sakko devānamindo imaṁ gāthaṁ abhāsi:",
    "dn16:93": "Parinibbute bhagavati saha parinibbānā āyasmā anuruddho imā gāthāyo abhāsi:",
    "dn16:94": "Parinibbute bhagavati ye te tattha bhikkhū avītarāgā appekacce bāhā paggayha kandanti, chinnapātaṁ papatanti, āvaṭṭanti vivaṭṭanti, \"atikhippaṁ bhagavā parinibbuto, atikhippaṁ sugato parinibbuto, atikhippaṁ cakkhuṁ loke antarahito\"ti. Ye pana te bhikkhū vītarāgā, te satā sampajānā adhivāsenti: \"aniccā saṅkhārā, taṁ kutettha labbhā\"ti.",
    "dn16:95": "Atha kho āyasmā anuruddho bhikkhū āmantesi: \"Alaṁ, āvuso, mā socittha mā paridevittha. Nanu etaṁ, āvuso, bhagavatā paṭikacceva akkhātaṁ: 'sabbeheva piyehi manāpehi nānābhāvo vinābhāvo aññathābhāvo'. Taṁ kutettha, āvuso, labbhā. 'Yaṁ taṁ jātaṁ bhūtaṁ saṅkhataṁ palokadhammaṁ, taṁ vata mā palujjī'ti, netaṁ ṭhānaṁ vijjati. Devatā, āvuso, ujjhāyantī\"ti. \"Kathaṁbhūtā pana,bhante, āyasmā anuruddho devatā manasi karotī\"ti?",
    "dn16:96": "Atha kho āyasmā anuruddho āyasmantaṁ ānandaṁ āmantesi: \"gacchāvuso Ānanda, kusināraṁ pavisitvā kosinārakānaṁ mallānaṁ ārocehi: 'parinibbuto, vāseṭṭhā, bhagavā, yassadāni kālaṁ maññathā'\"ti. \"Evaṁ, bhante\"ti kho āyasmā ānando āyasmato anuruddhassa paṭissutvā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya attadutiyo kusināraṁ pāvisi.",
    "dn16:97": "Atha kho kosinārakā mallā purise āṇāpesuṁ: \"Tena hi, bhaṇe, kusinārāyaṁ gandhamālañca sabbañca tāḷāvacaraṁ sannipātethā\"ti.",
    "dn16:98": "Tena kho pana samayena aṭṭha mallapāmokkhā sīsaṁnhātā ahatāni vatthāni nivatthā: \"Mayaṁ bhagavato sarīraṁ uccāressāmā\"ti na sakkonti uccāretuṁ.",
    "dn16:99": "Tena kho pana samayena kusinārā yāva sandhisamalasaṅkaṭīrā jaṇṇumattena odhinā mandāravapupphehisanthatāhoti. Atha kho devatā ca kosinārakā ca mallā bhagavato sarīraṁ dibbehi ca mānusakehi ca naccehi gītehi vāditehi mālehi gandhehi sakkarontā garuṁ karontā mānentā pūjentā uttarena uttaraṁ nagarassa haritvā uttarena dvārena nagaraṁ pavesetvā majjhena majjhaṁ nagarassa haritvā puratthimena dvārena nikkhamitvā puratthimato nagarassa makuṭabandhanaṁ nāma mallānaṁ cetiyaṁ ettha ca bhagavato sarīraṁ nikkhipiṁsu.",
    "dn16:100": "Atha kho kosinārakā mallā āyasmantaṁ ānandaṁ etadavocuṁ: \"Kathaṁ mayaṁ, bhante Ānanda, tathāgatassa sarīre paṭipajjāmā\"ti?",
    "dn16:101": "Tena kho pana samayena āyasmā mahākassapo pāvāya kusināraṁ addhānamaggappaṭipanno hoti mahatā bhikkhusaṁghena saddhiṁ pañcamattehi bhikkhusatehi. Atha kho āyasmā mahākassapo maggā okkamma aññatarasmiṁ rukkhamūle nisīdi.",
    "dn16:102": "Tena kho pana samayena subhaddo nāma vuddhapabbajito tassaṁ parisāyaṁ nisinno hoti. Atha kho subhaddo vuddhapabbajito te bhikkhū etadavoca: \"Alaṁ, āvuso, mā socittha, mā paridevittha, sumuttā mayaṁ tena mahāsamaṇena. Upaddutā ca homa: 'idaṁ vo kappati, idaṁ vo na kappatī'ti. Idāni pana mayaṁ yaṁ icchissāma, taṁ karissāma, yaṁ na icchissāma, na taṁ karissāmā\"ti.",
    "dn16:103": "Tena kho pana samayena cattāro mallapāmokkhā sīsaṁnhātā ahatāni vatthāni nivatthā: \"Mayaṁ bhagavato citakaṁ āḷimpessāmā\"ti na sakkonti āḷimpetuṁ. Atha kho kosinārakā mallā āyasmantaṁ anuruddhaṁ etadavocuṁ: \"ko nu kho, bhante anuruddha, hetu ko paccayo, yenime cattāro mallapāmokkhā sīsaṁnhātā ahatāni vatthāni nivatthā: 'mayaṁ bhagavato citakaṁ āḷimpessāmā'ti na sakkonti āḷimpetun\"ti?",
    "dn16:104": "Atha kho āyasmā mahākassapo yena kusinārā makuṭabandhanaṁ nāma mallānaṁ cetiyaṁ, yena bhagavato citako tenupasaṅkami; upasaṅkamitvā ekaṁsaṁ cīvaraṁ katvā añjaliṁ paṇāmetvā tikkhattuṁ citakaṁ padakkhiṇaṁ katvā bhagavato pāde sirasā vandi.",
    "dn16:105": "Jhāyamānassa kho pana bhagavato sarīrassa yaṁ ahosi chavīti vā cammanti vā maṁsanti vā nhārūti vā lasikāti vā, tassa neva chārikā paññāyittha, na masi; sarīrāneva avasissiṁsu. Seyyathāpi nāma sappissa vā telassa vā jhāyamānassa neva chārikā paññāyati, na masi; evameva bhagavato sarīrassa jhāyamānassa yaṁ ahosi chavīti vā cammanti vā maṁsanti vā nhārūti vā lasikāti vā, tassa neva chārikā paññāyittha, na masi; sarīrāneva avasissiṁsu. Tesañca pañcannaṁ dussayugasatānaṁdveva dussāni na ḍayhiṁsuyañca sabbaabbhantarimaṁ yañca bāhiraṁ.",
    "dn16:106": "Assosi kho rājā māgadho ajātasattu vedehiputto: \"Bhagavā kira kusinārāyaṁ parinibbuto\"ti. Atha kho rājā māgadho ajātasattu vedehiputto kosinārakānaṁ mallānaṁ dūtaṁ pāhesi: \"Bhagavāpi khattiyo ahampi khattiyo, ahampi arahāmi bhagavato sarīrānaṁ bhāgaṁ, ahampi bhagavato sarīrānaṁ thūpañca mahañca karissāmī\"ti.",
    "dn16:107": "Evaṁ vutte, doṇo brāhmaṇo te saṅghe gaṇe etadavoca:",
    "dn16:108": "\"Tena hi, brāhmaṇa, tvaññeva bhagavato sarīrāni aṭṭhadhā samaṁ savibhattaṁ vibhajāhī\"ti.",
    "dn16:109": "Atha kho rājā māgadho ajātasattu vedehiputto rājagahe bhagavato sarīrānaṁ thūpañca mahañca akāsi.",
    "dn16:110": "Aṭṭhadoṇaṁ cakkhumato sarīraṁ,Sattadoṇaṁ jambudīpe mahenti;Ekañca doṇaṁ purisavaruttamassa,Rāmagāme nāgarājā maheti."
}