{
    "dn19:1": "Evaṁ me sutaṁ—​ ekaṁ samayaṁ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho pañcasikho gandhabbaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṁ gijjhakūṭaṁ pabbataṁ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho pañcasikho gandhabbaputto bhagavantaṁ etadavoca: \"yaṁ kho me, bhante, devānaṁ tāvatiṁsānaṁ sammukhā sutaṁ sammukhā paṭiggahitaṁ, ārocemi taṁ bhagavato\"ti. \"Ārocehi me tvaṁ, pañcasikhā\"ti bhagavā avoca.",
    "dn19:2": "\"Purimāni, bhante, divasāni purimatarāni tadahuposathe pannarase pavāraṇāya puṇṇāya puṇṇamāya rattiyā kevalakappā ca devā tāvatiṁsā sudhammāyaṁ sabhāyaṁ sannisinnā honti sannipatitā; mahatī ca dibbaparisā samantato nisinnā honti, cattāro ca mahārājāno catuddisā nisinnā honti; puratthimāya disāya dhataraṭṭho mahārājā pacchimābhimukho nisinno hoti deve purakkhatvā; dakkhiṇāya disāya virūḷhako mahārājā uttarābhimukho nisinno hoti deve purakkhatvā; pacchimāya disāya virūpakkho mahārājā puratthābhimukho nisinno hoti deve purakkhatvā; uttarāya disāya vessavaṇo mahārājā dakkhiṇābhimukho nisinno hoti deve purakkhatvā. Yadā, bhante, kevalakappā ca devā tāvatiṁsā sudhammāyaṁ sabhāyaṁ sannisinnā honti sannipatitā, mahatī ca dibbaparisā samantato nisinnā honti, cattāro ca mahārājāno catuddisā nisinnā honti, idaṁ nesaṁ hoti āsanasmiṁ; atha pacchā amhākaṁ āsanaṁ hoti.",
    "dn19:3": "Ye te, bhante, devā bhagavati brahmacariyaṁ caritvā adhunūpapannā tāvatiṁsakāyaṁ, te aññe deve atirocanti vaṇṇena ceva yasasā ca. Tena sudaṁ, bhante, devā tāvatiṁsā attamanā honti pamuditā pītisomanassajātā; 'dibbā vata bho kāyā paripūrenti, hāyanti asurakāyā'ti.",
    "dn19:4": "Atha kho, bhante, sakko devānamindo devānaṁ tāvatiṁsānaṁ sampasādaṁ viditvā imāhi gāthāhi anumodi:",
    "dn19:5": "'Modanti vata bho devā,tāvatiṁsā sahindakā;Tathāgataṁ namassantā,dhammassa ca sudhammataṁ.",
    "dn19:6": "Nave deve ca passantā,vaṇṇavante yasassine;Sugatasmiṁ brahmacariyaṁ,caritvāna idhāgate.",
    "dn19:7": "Te aññe atirocanti,vaṇṇena yasasāyunā;Sāvakā bhūripaññassa,visesūpagatā idha.",
    "dn19:8": "Idaṁ disvāna nandanti,tāvatiṁsā sahindakā;Tathāgataṁ namassantā,dhammassa ca sudhammatan'ti.",
    "dn19:9": "Tena sudaṁ, bhante, devā tāvatiṁsā bhiyyoso mattāya attamanā honti pamuditā pītisomanassajātā; 'dibbā vata bho, kāyā paripūrenti, hāyanti asurakāyā'ti.",
    "dn19:10": "Atha kho, bhante, sakko devānamindo devānaṁ tāvatiṁsānaṁ sampasādaṁ viditvā deve tāvatiṁse āmantesi: 'iccheyyātha no tumhe, mārisā, tassa bhagavato aṭṭha yathābhucce vaṇṇe sotun'ti? 'Icchāma mayaṁ, mārisa, tassa bhagavato aṭṭha yathābhucce vaṇṇe sotun'ti. Atha kho, bhante, sakko devānamindo devānaṁ tāvatiṁsānaṁ bhagavato aṭṭha yathābhucce vaṇṇe payirudāhāsi:",
    "dn19:11": "'Taṁ kiṁ maññanti, bhonto devā tāvatiṁsā? Yāvañca so bhagavā bahujanahitāya paṭipanno bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṁ. Evaṁ bahujanahitāya paṭipannaṁ bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(1)",
    "dn19:12": "Svākkhāto kho pana tena bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhi. Evaṁ opaneyyikassa dhammassa desetāraṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(2)",
    "dn19:13": "\"Idaṁ kusalan\"ti kho pana tena bhagavatā supaññattaṁ, \"Idaṁ akusalan\"ti supaññattaṁ. \"Idaṁ sāvajjaṁ idaṁ anavajjaṁ, idaṁ sevitabbaṁ idaṁ na sevitabbaṁ, idaṁ hīnaṁ idaṁ paṇītaṁ, idaṁ kaṇhasukkasappaṭibhāgan\"ti supaññattaṁ. Evaṁ kusalākusalasāvajjānavajjasevitabbāsevitabbahīnapaṇītakaṇhasukkasappaṭibhāgānaṁ dhammānaṁ paññāpetāraṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(3)",
    "dn19:14": "Supaññattā kho pana tena bhagavatā sāvakānaṁ nibbānagāminī paṭipadā, saṁsandati nibbānañca paṭipadā ca. Seyyathāpi nāma gaṅgodakaṁ yamunodakena saṁsandati sameti; evameva supaññattā tena bhagavatā sāvakānaṁ nibbānagāminī paṭipadā, saṁsandati nibbānañca paṭipadā ca. Evaṁ nibbānagāminiyā paṭipadāya paññāpetāraṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(4)",
    "dn19:15": "Abhinipphannokho pana tassa bhagavato lābho abhinipphanno siloko, yāva maññe khattiyā sampiyāyamānarūpā viharanti, vigatamado kho pana so bhagavā āhāraṁ āhāreti. Evaṁ vigatamadaṁ āhāraṁ āharayamānaṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(5)",
    "dn19:16": "Laddhasahāyo kho pana so bhagavā sekhānañceva paṭipannānaṁ khīṇāsavānañca vusitavataṁ. Te bhagavā apanujja ekārāmataṁ anuyutto viharati. Evaṁ ekārāmataṁ anuyuttaṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(6)",
    "dn19:17": "Yathāvādī kho pana so bhagavā tathākārī, yathākārī tathāvādī, iti yathāvādī tathākārī, yathākārī tathāvādī. Evaṁ dhammānudhammappaṭipannaṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(7)",
    "dn19:18": "Tiṇṇavicikiccho kho pana so bhagavā vigatakathaṅkatho pariyositasaṅkappo ajjhāsayaṁ ādibrahmacariyaṁ. Evaṁ tiṇṇavicikicchaṁ vigatakathaṅkathaṁ pariyositasaṅkappaṁ ajjhāsayaṁ ādibrahmacariyaṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā'ti.(8)",
    "dn19:19": "Ime kho, bhante, sakko devānamindo devānaṁ tāvatiṁsānaṁ bhagavato aṭṭha yathābhucce vaṇṇe payirudāhāsi. Tena sudaṁ, bhante, devā tāvatiṁsā bhiyyoso mattāya attamanā honti pamuditā pītisomanassajātā bhagavato aṭṭha yathābhucce vaṇṇe sutvā.",
    "dn19:20": "Evaṁ vutte, bhante, sakko devānamindo deve tāvatiṁse etadavoca: 'aṭṭhānaṁ kho etaṁ, mārisā, anavakāso, yaṁ ekissā lokadhātuyā dve arahanto sammāsambuddhā apubbaṁ acarimaṁ uppajjeyyuṁ, netaṁ ṭhānaṁ vijjati. Aho vata, mārisā, so bhagavā appābādho appātaṅko ciraṁ dīghamaddhānaṁ tiṭṭheyya. Tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānan'ti.",
    "dn19:21": "Te vuttavākyā rājāno,paṭiggayhānusāsaniṁ;Vippasannamanā santā,aṭṭhaṁsu samhi āsaneti.",
    "dn19:22": "Atha kho, bhante, uttarāya disāya uḷāro āloko sañjāyi, obhāso pāturahosi atikkammeva devānaṁ devānubhāvaṁ. Atha kho, bhante, sakko devānamindo deve tāvatiṁse āmantesi: 'yathā kho, mārisā, nimittāni dissanti, uḷāro āloko sañjāyati, obhāso pātubhavati, brahmā pātubhavissati; brahmuno hetaṁ pubbanimittaṁ pātubhāvāya, yadidaṁ āloko sañjāyati obhāso pātubhavatīti.",
    "dn19:23": "Yathā nimittā dissanti,brahmā pātubhavissati;Brahmuno hetaṁ nimittaṁ,obhāso vipulo mahā'ti.",
    "dn19:24": "Atha kho, bhante, devā tāvatiṁsā yathāsakesu āsanesu nisīdiṁsu: 'obhāsametaṁ ñassāma, yaṁvipāko bhavissati, sacchikatvāva naṁ gamissāmā'ti. Cattāropi mahārājāno yathāsakesu āsanesu nisīdiṁsu: 'obhāsametaṁ ñassāma, yaṁvipāko bhavissati, sacchikatvāva naṁ gamissāmā'ti. Idaṁ sutvā devā tāvatiṁsā ekaggā samāpajjiṁsu: 'obhāsametaṁ ñassāma, yaṁvipāko bhavissati, sacchikatvāva naṁ gamissāmā'ti.",
    "dn19:25": "Yadā, bhante, brahmā sanaṅkumāro devānaṁ tāvatiṁsānaṁ pātubhavati, oḷārikaṁ attabhāvaṁ abhinimminitvā pātubhavati. Yo kho pana, bhante, brahmuno pakativaṇṇo, anabhisambhavanīyo so devānaṁ tāvatiṁsānaṁ cakkhupathasmiṁ. Yadā, bhante, brahmā sanaṅkumāro devānaṁ tāvatiṁsānaṁ pātubhavati, so aññe deve atirocati vaṇṇena ceva yasasā ca. Seyyathāpi, bhante, so vaṇṇo viggaho mānusaṁ viggahaṁ atirocati; evameva kho, bhante, yadā brahmā sanaṅkumāro devānaṁ tāvatiṁsānaṁ pātubhavati, so aññe deve atirocati vaṇṇena ceva yasasā ca.",
    "dn19:26": "'Modanti vata bho devā,tāvatiṁsā sahindakā;Tathāgataṁ namassantā,dhammassa ca sudhammataṁ.",
    "dn19:27": "Nave deve ca passantā,vaṇṇavante yasassine;Sugatasmiṁ brahmacariyaṁ,caritvāna idhāgate.",
    "dn19:28": "Te aññe atirocanti,vaṇṇena yasasāyunā;Sāvakā bhūripaññassa,visesūpagatā idha.",
    "dn19:29": "Idaṁ disvāna nandanti,tāvatiṁsā sahindakā;Tathāgataṁ namassantā,dhammassa ca sudhammatan'ti.",
    "dn19:30": "Imamatthaṁ, bhante, brahmā sanaṅkumāro abhāsittha. Imamatthaṁ, bhante, brahmuno sanaṅkumārassa bhāsato aṭṭhaṅgasamannāgato saro hoti vissaṭṭho ca viññeyyo ca mañju ca savanīyo ca bindu ca avisārī ca gambhīro ca ninnādī ca. Yathāparisaṁ kho pana, bhante, brahmā sanaṅkumāro sarena viññāpeti, na cassa bahiddhā parisāya ghoso niccharati. Yassa kho pana, bhante, evaṁ aṭṭhaṅgasamannāgato saro hoti, so vuccati 'brahmassaro'ti. Atha kho, bhante, devā tāvatiṁsā brahmānaṁ sanaṅkumāraṁ etadavocuṁ: 'sādhu, mahābrahme, etadeva mayaṁ saṅkhāya modāma; atthi ca sakkena devānamindena tassa bhagavato aṭṭha yathābhuccā vaṇṇā bhāsitā; te ca mayaṁ saṅkhāya modāmā'ti.",
    "dn19:31": "Atha, bhante, brahmā sanaṅkumāro sakkaṁ devānamindaṁ etadavoca: 'sādhu, devānaminda, mayampi tassa bhagavato aṭṭha yathābhucce vaṇṇe suṇeyyāmā'ti. 'Evaṁ, mahābrahme'ti kho, bhante, sakko devānamindo brahmuno sanaṅkumārassa bhagavato aṭṭha yathābhucce vaṇṇe payirudāhāsi.",
    "dn19:32": "'Taṁ kiṁ maññati, bhavaṁ mahābrahmā? Yāvañca so bhagavā bahujanahitāya paṭipanno bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṁ. Evaṁ bahujanahitāya paṭipannaṁ bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(1)",
    "dn19:33": "Svākkhāto kho pana tena bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhi. Evaṁ opaneyyikassa dhammassa desetāraṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(2)",
    "dn19:34": "\"Idaṁ kusalan\"ti kho pana tena bhagavatā supaññattaṁ, \"Idaṁ akusalan\"ti supaññattaṁ, \"Idaṁ sāvajjaṁ idaṁ anavajjaṁ, idaṁ sevitabbaṁ idaṁ na sevitabbaṁ, idaṁ hīnaṁ idaṁ paṇītaṁ, idaṁ kaṇhasukkasappaṭibhāgan\"ti supaññattaṁ. Evaṁ kusalākusalasāvajjānavajjasevitabbāsevitabbahīnapaṇītakaṇhasukkasappaṭibhāgānaṁ dhammānaṁ paññāpetāraṁ. Imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(3)",
    "dn19:35": "Supaññattā kho pana tena bhagavatā sāvakānaṁ nibbānagāminī paṭipadā saṁsandati nibbānañca paṭipadā ca. Seyyathāpi nāma gaṅgodakaṁ yamunodakena saṁsandati sameti; evameva supaññattā tena bhagavatā sāvakānaṁ nibbānagāminī paṭipadā saṁsandati nibbānañca paṭipadā ca. Evaṁ nibbānagāminiyā paṭipadāya paññāpetāraṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(4)",
    "dn19:36": "Abhinipphanno kho pana tassa bhagavato lābho abhinipphanno siloko, yāva maññe khattiyā sampiyāyamānarūpā viharanti. Vigatamado kho pana so bhagavā āhāraṁ āhāreti. Evaṁ vigatamadaṁ āhāraṁ āharayamānaṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(5)",
    "dn19:37": "Laddhasahāyo kho pana so bhagavā sekhānañceva paṭipannānaṁ khīṇāsavānañca vusitavataṁ, te bhagavā apanujja ekārāmataṁ anuyutto viharati. Evaṁ ekārāmataṁ anuyuttaṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(6)",
    "dn19:38": "Yathāvādī kho pana so bhagavā tathākārī, yathākārī tathāvādī; iti yathāvādī tathākārī, yathākārī tathāvādī. Evaṁ dhammānudhammappaṭippannaṁ imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā.(7)",
    "dn19:39": "Tiṇṇavicikiccho kho pana so bhagavā vigatakathaṅkatho pariyositasaṅkappo ajjhāsayaṁ ādibrahmacariyaṁ. Evaṁ tiṇṇavicikicchaṁ vigatakathaṅkathaṁ pariyositasaṅkappaṁ ajjhāsayaṁ ādibrahmacariyaṁ. Imināpaṅgena samannāgataṁ satthāraṁ neva atītaṁse samanupassāma, na panetarahi, aññatra tena bhagavatā'ti.(8)",
    "dn19:40": "Ime kho, bhante, sakko devānamindo brahmuno sanaṅkumārassa bhagavato aṭṭha yathābhucce vaṇṇe payirudāhāsi. Tena sudaṁ, bhante, brahmā sanaṅkumāro attamano hoti pamudito pītisomanassajāto bhagavato aṭṭha yathābhucce vaṇṇe sutvā. Atha, bhante, brahmā sanaṅkumāro oḷārikaṁ attabhāvaṁ abhinimminitvā kumāravaṇṇī hutvā pañcasikho devānaṁ tāvatiṁsānaṁ pāturahosi. So vehāsaṁ abbhuggantvā ākāse antalikkhe pallaṅkena nisīdi. Seyyathāpi, bhante, balavā puriso supaccatthate vā pallaṅke same vā bhūmibhāge pallaṅkena nisīdeyya; evameva kho, bhante, brahmā sanaṅkumāro vehāsaṁ abbhuggantvā ākāse antalikkhe pallaṅkena nisīditvā deve tāvatiṁse āmantesi:",
    "dn19:41": "'Taṁ kiṁ maññanti, bhonto devā tāvatiṁsā, yāva dīgharattaṁ mahāpaññova so bhagavā ahosi.",
    "dn19:42": "Bhūtapubbaṁ, bho, rājā disampati nāma ahosi. Disampatissa rañño govindo nāma brāhmaṇo purohito ahosi. Disampatissa rañño reṇu nāma kumāro putto ahosi. Govindassa brāhmaṇassa jotipālo nāma māṇavo putto ahosi. Iti reṇu ca rājaputto jotipālo ca māṇavo aññe ca cha khattiyā iccete aṭṭha sahāyā ahesuṁ. Atha kho, bho, ahorattānaṁ accayena govindo brāhmaṇo kālamakāsi. Govinde brāhmaṇe kālaṅkate rājā disampati paridevesi: \"yasmiṁ vata, bho, mayaṁ samaye govinde brāhmaṇe sabbakiccāni sammā vossajjitvā pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārema, tasmiṁ no samaye govindo brāhmaṇo kālaṅkato\"ti.",
    "dn19:43": "Atha kho, bho, rājā disampati aññataraṁ purisaṁ āmantesi: \"ehi tvaṁ, ambho purisa, yena jotipālo māṇavo tenupasaṅkama; upasaṅkamitvā jotipālaṁ māṇavaṁ evaṁ vadehi: 'bhavamatthu bhavantaṁ jotipālaṁ, rājā disampati bhavantaṁ jotipālaṁ māṇavaṁ āmantayati, rājā disampati bhoto jotipālassa māṇavassa dassanakāmo'\"ti. \"Evaṁ, devā\"ti kho, bho, so puriso disampatissa rañño paṭissutvā yena jotipālo māṇavo tenupasaṅkami; upasaṅkamitvā jotipālaṁ māṇavaṁ etadavoca: \"bhavamatthu bhavantaṁ jotipālaṁ, rājā disampati bhavantaṁ jotipālaṁ māṇavaṁ āmantayati, rājā disampati bhoto jotipālassa māṇavassa dassanakāmo\"ti. \"Evaṁ, bho\"ti kho, bho, jotipālo māṇavo tassa purisassa paṭissutvā yena rājā disampati tenupasaṅkami; upasaṅkamitvā disampatinā raññā saddhiṁ sammodi; sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho, bho, jotipālaṁ māṇavaṁ rājā disampati etadavoca: \"anusāsatu no bhavaṁ jotipālo, mā no bhavaṁ jotipālo anusāsaniyā paccabyāhāsi. Pettike taṁ ṭhāne ṭhapessāmi, govindiye abhisiñcissāmī\"ti. \"Evaṁ, bho\"ti kho, bho, so jotipālo māṇavo disampatissa rañño paccassosi.",
    "dn19:44": "Atha kho, bho, mahāgovindo brāhmaṇo yena te cha khattiyā tenupasaṅkami; upasaṅkamitvā te cha khattiye etadavoca: \"disampati kho, bho, rājā jiṇṇo vuddho mahallako addhagato vayoanuppatto, ko nu kho pana, bho, jānāti jīvitaṁ? Ṭhānaṁ kho panetaṁ vijjati, yaṁ disampatimhi raññe kālaṅkate rājakattāro reṇuṁ rājaputtaṁ rajje abhisiñceyyuṁ. Āyantu, bhonto, yena reṇu rājaputto tenupasaṅkamatha; upasaṅkamitvā reṇuṁ rājaputtaṁ evaṁ vadetha: 'mayaṁ kho bhoto reṇussa sahāyā piyā manāpā appaṭikūlā, yaṁsukho bhavaṁ taṁsukhā mayaṁ, yaṁdukkho bhavaṁ taṁdukkhā mayaṁ. Disampati kho, bho, rājā jiṇṇo vuddho mahallako addhagato vayoanuppatto, ko nu kho pana, bho, jānāti jīvitaṁ? Ṭhānaṁ kho panetaṁ vijjati, yaṁ disampatimhi raññe kālaṅkate rājakattāro bhavantaṁ reṇuṁ rajje abhisiñceyyuṁ. Sace bhavaṁ reṇu rajjaṁ labhetha, saṁvibhajetha no rajjenā'\"ti.",
    "dn19:45": "Atha kho, bho, ahorattānaṁ accayena rājā disampati kālamakāsi. Disampatimhi raññe kālaṅkate rājakattāro reṇuṁ rājaputtaṁ rajje abhisiñciṁsu. Abhisitto reṇu rajjena pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti. Atha kho, bho, mahāgovindo brāhmaṇo yena te cha khattiyā tenupasaṅkami; upasaṅkamitvā te cha khattiye etadavoca: \"disampati kho, bho, rājā kālaṅkato. Abhisitto reṇu rajjena pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti. Ko nu kho pana, bho, jānāti, madanīyā kāmā? Āyantu, bhonto, yena reṇu rājā tenupasaṅkamatha; upasaṅkamitvā reṇuṁ rājānaṁ evaṁ vadetha: 'disampati kho, bho, rājā kālaṅkato, abhisitto bhavaṁ reṇu rajjena, sarati bhavaṁ taṁ vacanan'\"ti?",
    "dn19:46": "\"Evaṁ, bho\"ti kho, bho, te cha khattiyā mahāgovindassa brāhmaṇassa paṭissutvā yena reṇu rājā tenupasaṅkamiṁsu; upasaṅkamitvā reṇuṁ rājānaṁ etadavocuṁ: \"disampati kho, bho, rājā kālaṅkato, abhisitto bhavaṁ reṇu rajjena, sarati bhavaṁ taṁ vacanan\"ti? \"Sarāmahaṁ, bho, taṁvacanaṁ. Ko nu kho, bho, pahoti imaṁ mahāpathaviṁ uttarena āyataṁ dakkhiṇena sakaṭamukhaṁ sattadhā samaṁ suvibhattaṁ vibhajitun\"ti? \"Ko nu kho, bho, añño pahoti, aññatra mahāgovindena brāhmaṇenā\"ti?",
    "dn19:47": "Dantapuraṁkaliṅgānaṁ,assakānañca potanaṁ;Mahesayaṁavantīnaṁ,sovīrānañca rorukaṁ.",
    "dn19:48": "Mithilā ca videhānaṁ,campā aṅgesu māpitā;Bārāṇasī ca kāsīnaṁ,ete govindamāpitāti.",
    "dn19:49": "Atha kho, bho, te cha khattiyā yathāsakena lābhena attamanā ahesuṁ paripuṇṇasaṅkappā: \"yaṁ vata no ahosi icchitaṁ, yaṁ ākaṅkhītaṁ, yaṁ adhippetaṁ, yaṁ abhipatthitaṁ, taṁ no laddhan\"ti.",
    "dn19:50": "Sattabhū brahmadatto ca,vessabhū bharato saha;Reṇu dve dhataraṭṭhā ca,tadāsuṁ satta bhāradhāti.",
    "dn19:51": "Atha kho, bho, te cha khattiyā yena mahāgovindo brāhmaṇo tenupasaṅkamiṁsu; upasaṅkamitvā mahāgovindaṁ brāhmaṇaṁ etadavocuṁ: \"yathā kho bhavaṁ govindo reṇussa rañño sahāyo piyo manāpo appaṭikūlo. Evameva kho bhavaṁ govindo amhākampi sahāyo piyo manāpo appaṭikūlo, anusāsatu no bhavaṁ govindo; mā no bhavaṁ govindo anusāsaniyā paccabyāhāsī\"ti. \"Evaṁ, bho\"ti kho mahāgovindo brāhmaṇo tesaṁ channaṁ khattiyānaṁ paccassosi. Atha kho, bho, mahāgovindo brāhmaṇo satta ca rājāno khattiyemuddhāvasitte rajjeanusāsi, satta ca brāhmaṇamahāsāle satta ca nhātakasatāni mante vācesi.",
    "dn19:52": "Atha kho, bho, mahāgovindassa brāhmaṇassa aparena samayena evaṁ kalyāṇo kittisaddoabbhuggacchi: \"sakkhi mahāgovindo brāhmaṇo brahmānaṁ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī\"ti. Atha kho, bho, mahāgovindassa brāhmaṇassa etadahosi: \"mayhaṁ kho evaṁ kalyāṇo kittisaddo abbhuggato: 'sakkhi mahāgovindo brāhmaṇo brahmānaṁ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī'ti. Na kho panāhaṁ brahmānaṁ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṁ kho pana metaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ: 'yo vassike cattāro māse paṭisallīyati, karuṇaṁ jhānaṁ jhāyati, so brahmānaṁ passati brahmunā sākaccheti brahmunā sallapati brahmunā mantetī'ti. Yannūnāhaṁ vassike cattāro māse paṭisallīyeyyaṁ, karuṇaṁ jhānaṁ jhāyeyyan\"ti.",
    "dn19:53": "Atha kho, bho, mahāgovindo brāhmaṇo yena reṇu rājā tenupasaṅkami; upasaṅkamitvā reṇuṁ rājānaṁ etadavoca: \"mayhaṁ kho, bho, evaṁ kalyāṇo kittisaddo abbhuggato: 'sakkhi mahāgovindo brāhmaṇo brahmānaṁ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī'ti. Na kho panāhaṁ, bho, brahmānaṁ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṁ kho pana metaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ: 'yo vassike cattāro māse paṭisallīyati, karuṇaṁ jhānaṁ jhāyati, so brahmānaṁ passati, brahmunā sākaccheti brahmunā sallapati brahmunā mantetī'ti. Icchāmahaṁ, bho, vassike cattāro māse paṭisallīyituṁ, karuṇaṁ jhānaṁ jhāyituṁ; namhi kenaci upasaṅkamitabbo aññatra ekena bhattābhihārenā\"ti. \"Yassadāni bhavaṁ govindo kālaṁ maññatī\"ti.",
    "dn19:54": "Atha kho, bho, mahāgovindo brāhmaṇo yena te cha khattiyā tenupasaṅkami; upasaṅkamitvā te cha khattiye etadavoca: \"mayhaṁ kho, bho, evaṁ kalyāṇo kittisaddo abbhuggato: 'sakkhi mahāgovindo brāhmaṇo brahmānaṁ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī'ti. Na kho panāhaṁ, bho, brahmānaṁ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṁ kho pana metaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ, 'yo vassike cattāro māse paṭisallīyati, karuṇaṁ jhānaṁ jhāyati, so brahmānaṁ passati brahmunā sākaccheti brahmunā sallapati brahmunā mantetī'ti. Icchāmahaṁ, bho, vassike cattāro māse paṭisallīyituṁ, karuṇaṁ jhānaṁ jhāyituṁ; namhi kenaci upasaṅkamitabbo aññatra ekena bhattābhihārenā\"ti. \"Yassadāni bhavaṁ govindo kālaṁ maññatī\"ti.",
    "dn19:55": "Atha kho, bho, mahāgovindo brāhmaṇo yena te satta ca brāhmaṇamahāsālā satta ca nhātakasatāni tenupasaṅkami; upasaṅkamitvā te satta ca brāhmaṇamahāsāle satta ca nhātakasatāni etadavoca: \"mayhaṁ kho, bho, evaṁ kalyāṇo kittisaddo abbhuggato: 'sakkhi mahāgovindo brāhmaṇo brahmānaṁ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī'ti. Na kho panāhaṁ, bho, brahmānaṁ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṁ kho pana metaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ: 'yo vassike cattāro māse paṭisallīyati, karuṇaṁ jhānaṁ jhāyati, so brahmānaṁ passati, brahmunā sākaccheti, brahmunā sallapati, brahmunā mantetī'ti. Tena hi, bho, yathāsute yathāpariyatte mante vitthārena sajjhāyaṁ karotha, aññamaññañca mante vācetha; icchāmahaṁ, bho, vassike cattāro māse paṭisallīyituṁ, karuṇaṁ jhānaṁ jhāyituṁ; namhi kenaci upasaṅkamitabbo aññatra ekena bhattābhihārenā\"ti. \"Yassadāni bhavaṁ govindo kālaṁ maññatī\"ti.",
    "dn19:56": "Atha kho, bho, mahāgovindo brāhmaṇo yena cattārīsā bhariyā sādisiyo tenupasaṅkami; upasaṅkamitvā cattārīsā bhariyā sādisiyo etadavoca: \"mayhaṁ kho, bhotī, evaṁ kalyāṇo kittisaddo abbhuggato: 'sakkhi mahāgovindo brāhmaṇo brahmānaṁ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī'ti. Na kho panāhaṁ, bhotī, brahmānaṁ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṁ kho pana metaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ 'yo vassike cattāro māse paṭisallīyati, karuṇaṁ jhānaṁ jhāyati, so brahmānaṁ passati, brahmunā sākaccheti, brahmunā sallapati, brahmunā mantetī'ti, icchāmahaṁ, bhotī, vassike cattāro māse paṭisallīyituṁ, karuṇaṁ jhānaṁ jhāyituṁ; namhi kenaci upasaṅkamitabbo aññatra ekena bhattābhihārenā\"ti. \"Yassadāni bhavaṁ govindo kālaṁ maññatī\"ti.",
    "dn19:57": "Atha kho, bho, mahāgovindo brāhmaṇo puratthimena nagarassa navaṁ sandhāgāraṁ kārāpetvā vassike cattāro māse paṭisallīyi, karuṇaṁ jhānaṁ jhāyi; nāssudha kociupasaṅkamatiaññatra ekena bhattābhihārena. Atha kho, bho, mahāgovindassa brāhmaṇassa catunnaṁ māsānaṁ accayena ahudeva ukkaṇṭhanā ahu paritassanā: \"sutaṁ kho pana metaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ: 'yo vassike cattāro māse paṭisallīyati, karuṇaṁ jhānaṁ jhāyati, so brahmānaṁ passati, brahmunā sākaccheti brahmunā sallapati brahmunā mantetī'ti. Na kho panāhaṁ brahmānaṁ passāmi, na brahmunā sākacchemi na brahmunā sallapāmi na brahmunā mantemī\"ti.",
    "dn19:58": "Atha kho, bho, brahmā sanaṅkumāro mahāgovindassa brāhmaṇassa cetasā cetoparivitakkamaññāya—seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evameva—brahmaloke antarahito mahāgovindassa brāhmaṇassa sammukhe pāturahosi. Atha kho, bho, mahāgovindassa brāhmaṇassa ahudeva bhayaṁ ahu chambhitattaṁ ahu lomahaṁso yathā taṁ adiṭṭhapubbaṁ rūpaṁ disvā. Atha kho, bho, mahāgovindo brāhmaṇo bhīto saṁviggo lomahaṭṭhajāto brahmānaṁ sanaṅkumāraṁ gāthāya ajjhabhāsi:",
    "dn19:59": "\"Vaṇṇavā yasavā sirimā,ko nu tvamasi mārisa;Ajānantā taṁ pucchāma,kathaṁ jānemu taṁ mayan\"ti.",
    "dn19:60": "\"Maṁ ve kumāraṁ jānanti,brahmalokesanantanaṁ;Sabbe jānanti maṁ devā,evaṁ govinda jānahi\".",
    "dn19:61": "\"Āsanaṁ udakaṁ pajjaṁ,madhusākañcabrahmuno;Agghe bhavantaṁ pucchāma,agghaṁ kurutu no bhavaṁ\".",
    "dn19:62": "\"Paṭiggaṇhāma te agghaṁ,yaṁ tvaṁ govinda bhāsasi;Diṭṭhadhammahitatthāya,samparāya sukhāya ca;Katāvakāso pucchassu,yaṁ kiñci abhipatthitan\"ti.",
    "dn19:63": "Atha kho, bho, mahāgovindassa brāhmaṇassa etadahosi: \"katāvakāso khomhi brahmunā sanaṅkumārena. Kiṁ nu kho ahaṁ brahmānaṁ sanaṅkumāraṁ puccheyyaṁ diṭṭhadhammikaṁ vā atthaṁ samparāyikaṁ vā\"ti? Atha kho, bho, mahāgovindassa brāhmaṇassa etadahosi: \"kusalo kho ahaṁ diṭṭhadhammikānaṁ atthānaṁ, aññepi maṁ diṭṭhadhammikaṁ atthaṁ pucchanti. Yannūnāhaṁ brahmānaṁ sanaṅkumāraṁ samparāyikaññeva atthaṁ puccheyyan\"ti. Atha kho, bho, mahāgovindo brāhmaṇo brahmānaṁ sanaṅkumāraṁ gāthāya ajjhabhāsi:",
    "dn19:64": "\"Pucchāmi brahmānaṁ sanaṅkumāraṁ,Kaṅkhī akaṅkhīṁ paravediyesu;Katthaṭṭhito kimhi ca sikkhamāno,Pappoti macco amataṁ brahmalokan\"ti.",
    "dn19:65": "\"Hitvā mamattaṁ manujesu brahme,Ekodibhūtokaruṇedhimutto;Nirāmagandho virato methunasmā,Etthaṭṭhito ettha ca sikkhamāno;Pappoti macco amataṁ brahmalokan\"ti.",
    "dn19:66": "\"'Hitvā mamattan'ti ahaṁ, bhoto, ājānāmi. Idhekacco appaṁ vā bhogakkhandhaṁ pahāya mahantaṁ vā bhogakkhandhaṁ pahāya appaṁ vā ñātiparivaṭṭaṁ pahāya mahantaṁ vā ñātiparivaṭṭaṁ pahāya kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajati, iti 'hitvā mamattan'ti ahaṁ, bhoto, ājānāmi.",
    "dn19:67": "'Ekodibhūto'ti ahaṁ, bhoto, ājānāmi. Idhekacco vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ, iti 'ekodibhūto'ti ahaṁ, bhoto, ājānāmi.",
    "dn19:68": "'Karuṇedhimutto'ti ahaṁ, bhoto, ājānāmi. Idhekacco karuṇāsahagatena cetasā ekaṁ disaṁ pharitvā viharati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ. Iti uddhamadhotiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ karuṇāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Iti 'karuṇedhimutto'ti ahaṁ, bhoto, ājānāmi. Āmagandhe ca kho ahaṁ, bhoto, bhāsamānassa na ājānāmi.",
    "dn19:69": "Ke āmagandhā manujesu brahme,Ete avidvā idha brūhi dhīra;Kenāvaṭāvāti pajākurutu,Āpāyikā nivutabrahmalokā\"ti.",
    "dn19:70": "\"Kodho mosavajjaṁ nikati ca dubbho,Kadariyatā atimāno usūyā;Icchā vivicchā paraheṭhanā ca,Lobho ca doso ca mado ca moho;Etesu yuttā anirāmagandhā,Āpāyikā nivutabrahmalokā\"ti.",
    "dn19:71": "\"Yathā kho ahaṁ, bhoto, āmagandhe bhāsamānassa ājānāmi. Te na sunimmadayā agāraṁ ajjhāvasatā. Pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti. \"Yassadāni bhavaṁ govindo kālaṁ maññatī\"ti.",
    "dn19:72": "Atha kho, bho, mahāgovindo brāhmaṇo yena reṇu rājā tenupasaṅkami; upasaṅkamitvā reṇuṁ rājānaṁ etadavoca: \"aññaṁ dāni bhavaṁ purohitaṁ pariyesatu, yo bhoto rajjaṁ anusāsissati. Icchāmahaṁ, bho, agārasmā anagāriyaṁ pabbajituṁ. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṁ ajjhāvasatā. Pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti.",
    "dn19:73": "\"Āmantayāmi rājānaṁ,reṇuṁ bhūmipatiṁ ahaṁ;Tvaṁ pajānassu rajjena,nāhaṁ porohicce rame\".",
    "dn19:74": "\"Sace te ūnaṁ kāmehi,ahaṁ paripūrayāmi te;Yo taṁ hiṁsati vāremi,bhūmisenāpati ahaṁ;Tuvaṁ pitā ahaṁ putto,mā no govindapājahi\".",
    "dn19:75": "\"Namatthi ūnaṁ kāmehi,hiṁsitā me na vijjati;Amanussavaco sutvā,tasmāhaṁ na gahe rame\".",
    "dn19:76": "\"Amanusso kathaṁvaṇṇo,kiṁ te atthaṁ abhāsatha;Yañca sutvā jahāsi no,gehe amhe ca kevalī\".",
    "dn19:77": "\"Upavutthassa me pubbe,yiṭṭhukāmassa me sato;Aggi pajjalito āsi,kusapattaparitthato.",
    "dn19:78": "Tato me brahmā pāturahu,brahmalokā sanantano;So me pañhaṁ viyākāsi,taṁ sutvā na gahe rame\".",
    "dn19:79": "\"Saddahāmi ahaṁ bhoto,yaṁ tvaṁ govinda bhāsasi;Amanussavaco sutvā,kathaṁ vattetha aññathā.",
    "dn19:80": "Te taṁ anuvattissāma,satthā govinda no bhavaṁ;Maṇi yathā veḷuriyo,akāco vimalo subho;Evaṁ suddhā carissāma,govindassānusāsaneti.",
    "dn19:81": "Sace bhavaṁ govindo agārasmā anagāriyaṁ pabbajissati, mayampi agārasmā anagāriyaṁ pabbajissāma. Atha yā te gati, sā no gati bhavissatī\"ti.",
    "dn19:82": "Atha kho, bho, mahāgovindo brāhmaṇo yena te cha khattiyā tenupasaṅkami; upasaṅkamitvā te cha khattiye etadavoca: \"aññaṁ dāni bhavanto purohitaṁ pariyesantu, yo bhavantānaṁ rajje anusāsissati. Icchāmahaṁ, bho, agārasmā anagāriyaṁ pabbajituṁ. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṁ ajjhāvasatā. Pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti. Atha kho, bho, te cha khattiyā ekamantaṁ apakkamma evaṁ samacintesuṁ: \"ime kho brāhmaṇā nāma dhanaluddhā; yannūna mayaṁ mahāgovindaṁ brāhmaṇaṁ dhanena sikkheyyāmā\"ti. Te mahāgovindaṁ brāhmaṇaṁ upasaṅkamitvā evamāhaṁsu: \"saṁvijjati kho, bho, imesu sattasu rajjesu pahūtaṁ sāpateyyaṁ, tato bhoto yāvatakena attho, tāvatakaṁ āharīyatan\"ti. \"Alaṁ, bho, mamapidaṁ pahūtaṁ sāpateyyaṁ bhavantānaṁyeva vāhasā. Tamahaṁ sabbaṁ pahāya agārasmā anagāriyaṁ pabbajissāmi. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṁ ajjhāvasatā, pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti.",
    "dn19:83": "\"Sace bhavaṁ govindo agārasmā anagāriyaṁ pabbajissati, mayampi agārasmā anagāriyaṁ pabbajissāma, atha yā te gati, sā no gati bhavissatī\"ti.",
    "dn19:84": "\"Sace jahatha kāmāni,yattha satto puthujjano;Ārambhavho daḷhā hotha,khantībalasamāhitā.",
    "dn19:85": "Esa maggo ujumaggo,esa maggo anuttaro;Saddhammo sabbhi rakkhito,brahmalokūpapattiyā\"ti.",
    "dn19:86": "\"Tena hi bhavaṁ govindo satta vassāni āgametu. Sattannaṁ vassānaṁ accayena mayampi agārasmā anagāriyaṁ pabbajissāma, atha yā te gati, sā no gati bhavissatī\"ti.",
    "dn19:87": "\"Aticiraṁ kho, bho, satta vassāni, nāhaṁ sakkomi, bhavante, satta vassāni āgametuṁ. Ko nu kho pana, bho, jānāti jīvitānaṁ. Gamanīyo samparāyo,mantāyaṁboddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇaṁ. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṁ ajjhāvasatā, pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti.",
    "dn19:88": "\"Aticiraṁ kho, bho, ekaṁ vassaṁ, nāhaṁ sakkomi bhavante ekaṁ vassaṁ āgametuṁ. Ko nu kho pana, bho, jānāti jīvitānaṁ. Gamanīyo samparāyo, mantāyaṁ boddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇaṁ. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṁ ajjhāvasatā, pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti. \"Tena hi bhavaṁ govindo satta māsāni āgametu, sattannaṁ māsānaṁ accayena mayampi agārasmā anagāriyaṁ pabbajissāma, atha yā te gati, sā no gati bhavissatī\"ti.",
    "dn19:89": "\"Aticiraṁ kho, bho, satta māsāni, nāhaṁ sakkomi bhavante satta māsāni āgametuṁ. Ko nu kho pana, bho, jānāti jīvitānaṁ. Gamanīyo samparāyo, mantāyaṁ boddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇaṁ. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṁ ajjhāvasatā, pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti.",
    "dn19:90": "\"Tena hi bhavaṁ govindo cha māsāni āgametu … pe … pañca māsāni āgametu … cattāri māsāni āgametu … tīṇi māsāni āgametu … dve māsāni āgametu … ekaṁ māsaṁ āgametu … addhamāsaṁ āgametu, addhamāsassa accayena mayampi agārasmā anagāriyaṁ pabbajissāma, atha yā te gati, sā no gati bhavissatī\"ti.",
    "dn19:91": "\"Aticiraṁ kho, bho, addhamāso, nāhaṁ sakkomi bhavante addhamāsaṁ āgametuṁ. Ko nu kho pana, bho, jānāti jīvitānaṁ. Gamanīyo samparāyo, mantāyaṁ boddhabbaṁ, kattabbaṁ kusalaṁ, caritabbaṁ brahmacariyaṁ, natthi jātassa amaraṇaṁ. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṁ ajjhāvasatā, pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti. \"Tena hi bhavaṁ govindo sattāhaṁ āgametu, yāva mayaṁ sake puttabhātarorajjenaanusāsissāma, sattāhassa accayena mayampi agārasmā anagāriyaṁ pabbajissāma, atha yā te gati, sā no gati bhavissatī\"ti. \"Na ciraṁ kho, bho, sattāhaṁ, āgamessāmahaṁ bhavante sattāhan\"ti.",
    "dn19:92": "Atha kho, bho, mahāgovindo brāhmaṇo yena te satta ca brāhmaṇamahāsālā satta ca nhātakasatāni tenupasaṅkami; upasaṅkamitvā te satta ca brāhmaṇamahāsāle satta ca nhātakasatāni etadavoca: \"aññaṁ dāni bhavanto ācariyaṁ pariyesantu, yo bhavantānaṁ mante vācessati. Icchāmahaṁ, bho, agārasmā anagāriyaṁ pabbajituṁ. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa. Te na sunimmadayā agāraṁ ajjhāvasatā, pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti. \"Mā bhavaṁ govindo agārasmā anagāriyaṁ pabbaji. Pabbajjā, bho, appesakkhā ca appalābhā ca; brahmaññaṁ mahesakkhañca mahālābhañcā\"ti. \"Mā bhavanto evaṁ avacuttha: 'pabbajjā appesakkhā ca appalābhā ca, brahmaññaṁ mahesakkhañca mahālābhañcā'ti. Ko nu kho, bho, aññatra mayā mahesakkhataro vā mahālābhataro vā. Ahañhi, bho, etarahi rājāva raññaṁ brahmāvabrāhmaṇānaṁdevatāva gahapatikānaṁ. Tamahaṁ sabbaṁ pahāya agārasmā anagāriyaṁ pabbajissāmi. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṁ ajjhāvasatā. Pabbajissāmahaṁ, bho, agārasmā anagāriyan\"ti. \"Sace bhavaṁ govindo agārasmā anagāriyaṁ pabbajissati, mayampi agārasmā anagāriyaṁ pabbajissāma, atha yā te gati, sā no gati bhavissatī\"ti.",
    "dn19:93": "Atha kho, bho, mahāgovindo brāhmaṇo yena cattārīsā bhariyā sādisiyo tenupasaṅkami; upasaṅkamitvā cattārīsā bhariyā sādisiyo etadavoca: \"yā bhotīnaṁ icchati, sakāni vā ñātikulāni gacchatu aññaṁ vā bhattāraṁ pariyesatu. Icchāmahaṁ, bhotī, agārasmā anagāriyaṁ pabbajituṁ. Yathā kho pana me sutaṁ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṁ ajjhāvasatā. Pabbajissāmahaṁ, bhotī, agārasmā anagāriyan\"ti. \"Tvaññeva no ñāti ñātikāmānaṁ, tvaṁ pana bhattā bhattukāmānaṁ. Sace bhavaṁ govindo agārasmā anagāriyaṁ pabbajissati, mayampi agārasmā anagāriyaṁ pabbajissāma, atha yā te gati, sā no gati bhavissatī\"ti.",
    "dn19:94": "Atha kho, bho, mahāgovindo brāhmaṇo tassa sattāhassa accayena kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbaji. Pabbajitaṁ pana mahāgovindaṁ brāhmaṇaṁ satta ca rājāno khattiyā muddhāvasittā satta ca brāhmaṇamahāsālā satta ca nhātakasatāni cattārīsā ca bhariyā sādisiyo anekāni ca khattiyasahassāni anekāni ca brāhmaṇasahassāni anekāni ca gahapatisahassāni anekehi ca itthāgārehi itthiyo kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā mahāgovindaṁ brāhmaṇaṁ agārasmā anagāriyaṁ pabbajitaṁ anupabbajiṁsu.",
    "dn19:95": "Mahāgovindo, bho, brāhmaṇo mettāsahagatena cetasā ekaṁ disaṁ pharitvā vihāsi, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihāsi. Karuṇāsahagatena cetasā … pe … muditāsahagatena cetasā … pe … upekkhāsahagatena cetasā … pe … abyāpajjena pharitvā vihāsi. Sāvakānañca brahmalokasahabyatāya maggaṁ desesi.",
    "dn19:96": "Ye kho pana, bho, tena samayena mahāgovindassa brāhmaṇassa sāvakā sabbenasabbaṁ sāsanaṁ ājāniṁsu. Te kāyassa bhedā paraṁ maraṇā sugatiṁ brahmalokaṁ upapajjiṁsu. Ye na sabbenasabbaṁ sāsanaṁ ājāniṁsu, te kāyassa bhedā paraṁ maraṇā appekacce paranimmitavasavattīnaṁ devānaṁ sahabyataṁ upapajjiṁsu; appekacce nimmānaratīnaṁ devānaṁ sahabyataṁ upapajjiṁsu; appekacce tusitānaṁ devānaṁ sahabyataṁ upapajjiṁsu; appekacce yāmānaṁ devānaṁ sahabyataṁ upapajjiṁsu; appekacce tāvatiṁsānaṁ devānaṁ sahabyataṁ upapajjiṁsu; appekacce cātumahārājikānaṁ devānaṁ sahabyataṁ upapajjiṁsu; ye sabbanihīnaṁ kāyaṁ paripūresuṁ te gandhabbakāyaṁ paripūresuṁ. Iti kho,bho, sabbesaṁyeva tesaṁ kulaputtānaṁ amoghā pabbajjā ahosi avañjhā saphalā saudrayā'ti. Sarati taṁ bhagavā\"ti?",
    "dn19:97": "\"Sarāmahaṁ, pañcasikha. Ahaṁ tena samayena mahāgovindo brāhmaṇo ahosiṁ. Ahaṁ tesaṁ sāvakānaṁ brahmalokasahabyatāya maggaṁ desesiṁ. Taṁ kho pana me, pañcasikha, brahmacariyaṁ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṁvattati, yāvadeva brahmalokūpapattiyā.",
    "dn19:98": "Idaṁ kho pana me, pañcasikha, brahmacariyaṁ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati. Katamañca taṁ, pañcasikha, brahmacariyaṁ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati? Ayameva ariyo aṭṭhaṅgiko maggo. Seyyathidaṁ—sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Idaṁ kho taṁ, pañcasikha, brahmacariyaṁ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati.",
    "dn19:99": "Ye kho pana me, pañcasikha, sāvakā sabbenasabbaṁ sāsanaṁ ājānanti, te āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharanti; ye na sabbenasabbaṁ sāsanaṁ ājānanti, te pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātikā honti tattha parinibbāyino anāvattidhammā tasmā lokā. Ye na sabbenasabbaṁ sāsanaṁ ājānanti, appekacce tiṇṇaṁ saṁyojanānaṁ parikkhayā rāgadosamohānaṁ tanuttā sakadāgāmino honti sakideva imaṁ lokaṁ āgantvā dukkhassantaṁkarissanti. Ye na sabbenasabbaṁ sāsanaṁ ājānanti, appekacce tiṇṇaṁ saṁyojanānaṁ parikkhayā sotāpannā honti avinipātadhammā niyatā sambodhiparāyaṇā. Iti kho, pañcasikha, sabbesaṁyeva imesaṁ kulaputtānaṁ amoghāpabbajjāavañjhā saphalā saudrayā\"ti.",
    "dn19:100": "Idamavoca bhagavā. Attamano pañcasikho gandhabbaputto bhagavato bhāsitaṁ abhinanditvā anumoditvā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā tatthevantaradhāyīti."
}