{
    "dn21:1": "Evaṁ me sutaṁ—​ ekaṁ samayaṁ bhagavā magadhesu viharati, pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate indasālaguhāyaṁ. Tena kho pana samayena sakkassa devānamindassa ussukkaṁ udapādi bhagavantaṁ dassanāya. Atha kho sakkassa devānamindassa etadahosi: \"kahaṁ nu kho bhagavā etarahi viharati arahaṁ sammāsambuddho\"ti? Addasā kho sakko devānamindo bhagavantaṁ magadhesu viharantaṁ pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate indasālaguhāyaṁ. Disvāna deve tāvatiṁse āmantesi: \"Ayaṁ, mārisā, bhagavā magadhesu viharati, pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate indasālaguhāyaṁ. Yadi pana, mārisā, mayaṁ taṁ bhagavantaṁ dassanāya upasaṅkameyyāma arahantaṁ sammāsambuddhan\"ti? \"Evaṁ, bhaddantavā\"ti kho devā tāvatiṁsā sakkassa devānamindassa paccassosuṁ.",
    "dn21:2": "Atha kho sakko devānamindo pañcasikhaṁgandhabbadevaputtaṁāmantesi: \"Ayaṁ, tāta pañcasikha, bhagavā magadhesu viharati pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate indasālaguhāyaṁ. Yadi pana, tāta pañcasikha, mayaṁ taṁ bhagavantaṁ dassanāya upasaṅkameyyāma arahantaṁ sammāsambuddhan\"ti? \"Evaṁ, bhaddantavā\"ti kho pañcasikho gandhabbadevaputto sakkassa devānamindassa paṭissutvā beluvapaṇḍuvīṇaṁ ādāya sakkassa devānamindassa anucariyaṁ upāgami.",
    "dn21:3": "Atha kho sakko devānamindo devehi tāvatiṁsehi parivuto pañcasikhena gandhabbadevaputtena purakkhato—seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya pasāritaṁ vā bāhaṁ samiñjeyya; evameva—devesu tāvatiṁsesu antarahito magadhesu pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate paccuṭṭhāsi.",
    "dn21:4": "Atha kho sakko devānamindo pañcasikhaṁ gandhabbadevaputtaṁ āmantesi: \"durupasaṅkamā kho, tāta pañcasikha, tathāgatā mādisena, jhāyī jhānaratā,tadantaraṁpaṭisallīnā. Yadi pana tvaṁ, tāta pañcasikha, bhagavantaṁ paṭhamaṁ pasādeyyāsi, tayā, tāta, paṭhamaṁ pasāditaṁ pacchā mayaṁ taṁ bhagavantaṁ dassanāya upasaṅkameyyāma arahantaṁ sammāsambuddhan\"ti. \"Evaṁ, bhaddantavā\"ti kho pañcasikho gandhabbadevaputto sakkassa devānamindassa paṭissutvā beluvapaṇḍuvīṇaṁ ādāya yena indasālaguhā tenupasaṅkami; upasaṅkamitvā: \"ettāvatā me bhagavā neva atidūre bhavissati nāccāsanne, saddañca me sossatī\"ti—ekamantaṁ aṭṭhāsi.",
    "dn21:5": "Ekamantaṁ ṭhito kho pañcasikho gandhabbadevaputtobeluvapaṇḍuvīṇaṁassāvesi, imā ca gāthā abhāsi buddhūpasañhitā dhammūpasañhitā saṁghūpasañhitā arahantūpasañhitā kāmūpasañhitā:",
    "dn21:6": "\"Vande te pitaraṁ bhadde,timbaruṁ sūriyavacchase;Yena jātāsi kalyāṇī,ānandajananī mama.",
    "dn21:7": "Vātova sedataṁ kanto,pānīyaṁva pipāsato;Aṅgīrasi piyāmesi,dhammo arahatāmiva.",
    "dn21:8": "Āturasseva bhesajjaṁ,bhojanaṁva jighacchato;Parinibbāpaya maṁ bhadde,jalantamiva vārinā.",
    "dn21:9": "Sītodakaṁ pokkharaṇiṁ,yuttaṁ kiñjakkhareṇunā;Nāgo ghammābhitattova,ogāhe te thanūdaraṁ.",
    "dn21:10": "Accaṅkusova nāgova,jitaṁ me tuttatomaraṁ;Kāraṇaṁ nappajānāmi,sammatto lakkhaṇūruyā.",
    "dn21:11": "Tayi gedhitacittosmi,cittaṁ vipariṇāmitaṁ;Paṭigantuṁ na sakkomi,vaṅkaghastova ambujo.",
    "dn21:12": "Vāmūru saja maṁ bhadde,saja maṁ mandalocane;Palissaja maṁ kalyāṇi,etaṁ me abhipatthitaṁ.",
    "dn21:13": "Appako vata me santo,kāmo vellitakesiyā;Anekabhāvo samuppādi,arahanteva dakkhiṇā.",
    "dn21:14": "Yaṁ me atthi kataṁ puññaṁ,arahantesu tādisu;Taṁ me sabbaṅgakalyāṇi,tayā saddhiṁ vipaccataṁ.",
    "dn21:15": "Yaṁ me atthi kataṁ puññaṁ,asmiṁ pathavimaṇḍale;Taṁ me sabbaṅgakalyāṇi,tayā saddhiṁ vipaccataṁ.",
    "dn21:16": "Sakyaputtova jhānena,ekodi nipako sato;Amataṁ munijigīsāno,tamahaṁ sūriyavacchase.",
    "dn21:17": "Yathāpi muni nandeyya,patvā sambodhimuttamaṁ;Evaṁ nandeyyaṁ kalyāṇi,missībhāvaṁ gato tayā.",
    "dn21:18": "Sakko ce me varaṁ dajjā,tāvatiṁsānamissaro;Tāhaṁ bhadde vareyyāhe,evaṁ kāmo daḷho mama.",
    "dn21:19": "Sālaṁva na ciraṁ phullaṁ,pitaraṁ te sumedhase;Vandamāno namassāmi,yassāsetādisī pajā\"ti.",
    "dn21:20": "Evaṁ vutte, bhagavā pañcasikhaṁ gandhabbadevaputtaṁ etadavoca: \"saṁsandati kho te, pañcasikha, tantissaro gītassarena, gītassaro ca tantissarena;na ca panate, pañcasikha, tantissaro gītassaraṁ ativattati, gītassaro ca tantissaraṁ. Kadā saṁyūḷhā pana te, pañcasikha, imā gāthā buddhūpasañhitā dhammūpasañhitā saṁghūpasañhitā arahantūpasañhitā kāmūpasañhitā\"ti? \"Ekamidaṁ, bhante, samayaṁ bhagavā uruvelāyaṁ viharati najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Tena kho panāhaṁ, bhante, samayena bhaddā nāma sūriyavacchasā timbaruno gandhabbarañño dhītā, tamabhikaṅkhāmi. Sā kho pana, bhante, bhaginī parakāminī hoti; sikhaṇḍī nāma mātalissa saṅgāhakassa putto, tamabhikaṅkhati. Yato kho ahaṁ, bhante, taṁ bhaginiṁ nālatthaṁ kenaci pariyāyena. Athāhaṁ beluvapaṇḍuvīṇaṁ ādāya yena timbaruno gandhabbarañño nivesanaṁ tenupasaṅkamiṁ; upasaṅkamitvā beluvapaṇḍuvīṇaṁ assāvesiṁ, imā ca gāthā abhāsiṁ buddhūpasañhitā dhammūpasañhitā saṁghūpasañhitā arahantūpasañhitā kāmūpasañhitā –",
    "dn21:21": "Vande te pitaraṁ bhadde,timbaruṁ sūriyavacchase;Yena jātāsi kalyāṇī,ānandajananī mama.",
    "dn21:22": "Sālaṁva na ciraṁ phullaṁ,pitaraṁ te sumedhase;Vandamāno namassāmi,yassāsetādisī pajāti.",
    "dn21:23": "Evaṁ vutte, bhante, bhaddā sūriyavacchasā maṁ etadavoca: 'na kho me, mārisa, so bhagavā sammukhā diṭṭho, api ca sutoyeva me so bhagavā devānaṁ tāvatiṁsānaṁ sudhammāyaṁ sabhāyaṁ upanaccantiyā. Yato kho tvaṁ, mārisa, taṁ bhagavantaṁ kittesi, hotu no ajja samāgamo'ti. Soyeva no, bhante, tassā bhaginiyā saddhiṁ samāgamo ahosi. Na ca dāni tato pacchā\"ti.",
    "dn21:24": "Atha kho sakkassa devānamindassa etadahosi: \"paṭisammodati pañcasikho gandhabbadevaputto bhagavatā, bhagavā ca pañcasikhenā\"ti. Atha kho sakko devānamindo pañcasikhaṁ gandhabbadevaputtaṁ āmantesi: \"abhivādehi me tvaṁ, tāta pañcasikha, bhagavantaṁ: 'sakko, bhante, devānamindo sāmacco saparijano bhagavato pāde sirasā vandatī'\"ti. \"Evaṁ, bhaddantavā\"ti kho pañcasikho gandhabbadevaputto sakkassa devānamindassa paṭissutvā bhagavantaṁ abhivādeti: \"sakko, bhante, devānamindo sāmacco saparijano bhagavato pāde sirasā vandatī\"ti. \"Evaṁ sukhī hotu, pañcasikha, sakko devānamindo sāmacco saparijano; sukhakāmā hi devā manussā asurā nāgā gandhabbā ye caññe santi puthukāyā\"ti.",
    "dn21:25": "Evañca pana tathāgatā evarūpe mahesakkhe yakkhe abhivadanti. Abhivadito sakko devānamindo bhagavato indasālaguhaṁ pavisitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Devāpi tāvatiṁsā indasālaguhaṁ pavisitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhaṁsu. Pañcasikhopi gandhabbadevaputto indasālaguhaṁ pavisitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi.",
    "dn21:26": "Tena kho pana samayena indasālaguhā visamā santī samā samapādi, sambādhā santīurundāsamapādi, andhakāro guhāyaṁ antaradhāyi, āloko udapādi yathā taṁ devānaṁ devānubhāvena.",
    "dn21:27": "Atha kho bhagavā sakkaṁ devānamindaṁ etadavoca: \"acchariyamidaṁ āyasmato kosiyassa, abbhutamidaṁ āyasmato kosiyassa tāva bahukiccassa bahukaraṇīyassa yadidaṁ idhāgamanan\"ti. \"Cirapaṭikāhaṁ, bhante, bhagavantaṁ dassanāya upasaṅkamitukāmo; api ca devānaṁ tāvatiṁsānaṁ kehicikehicikiccakaraṇīyehi byāvaṭo; evāhaṁ nāsakkhiṁ bhagavantaṁ dassanāya upasaṅkamituṁ. Ekamidaṁ, bhante, samayaṁ bhagavā sāvatthiyaṁ viharati salaḷāgārake. Atha khvāhaṁ, bhante, sāvatthiṁ agamāsiṁ bhagavantaṁ dassanāya.",
    "dn21:28": "Idheva, bhante, kapilavatthusmiṁ gopikā nāma sakyadhītā ahosi buddhe pasannā dhamme pasannā saṁghe pasannā sīlesu paripūrakārinī. Sāitthittaṁvirājetvāpurisattaṁbhāvetvā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā. Devānaṁ tāvatiṁsānaṁ sahabyataṁ amhākaṁ puttattaṁ ajjhupagatā. Tatrapi naṁ evaṁ jānanti: 'gopako devaputto, gopako devaputto'ti. Aññepi, bhante, tayo bhikkhū bhagavati brahmacariyaṁ caritvā hīnaṁ gandhabbakāyaṁ upapannā. Te pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārayamānā amhākaṁ upaṭṭhānaṁ āgacchanti amhākaṁ pāricariyaṁ. Te amhākaṁ upaṭṭhānaṁ āgate amhākaṁ pāricariyaṁ gopako devaputto paṭicodesi: 'kutomukhā nāma tumhe, mārisā, tassa bhagavato dhammaṁassuttha—ahañhi nāma itthikā samānā buddhe pasannā dhamme pasannā saṁghe pasannā sīlesu paripūrakārinī itthittaṁ virājetvā purisattaṁ bhāvetvā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā, devānaṁ tāvatiṁsānaṁ sahabyataṁ sakkassa devānamindassa puttattaṁ ajjhupagatā. Idhāpi maṁ evaṁ jānanti: \"gopako devaputto gopako devaputto\"ti. Tumhe pana, mārisā, bhagavati brahmacariyaṁ caritvā hīnaṁ gandhabbakāyaṁ upapannā. Duddiṭṭharūpaṁ vata bho addasāma, ye mayaṁ addasāma sahadhammike hīnaṁ gandhabbakāyaṁ upapanne'ti. Tesaṁ, bhante, gopakena devaputtena paṭicoditānaṁ dve devā diṭṭheva dhamme satiṁ paṭilabhiṁsu kāyaṁ brahmapurohitaṁ, eko pana devo kāme ajjhāvasi.",
    "dn21:29": "'Upāsikā cakkhumato ahosiṁ,Nāmampi mayhaṁ ahu \"gopikā\"ti;Buddhe ca dhamme ca abhippasannā,Saṅghañcupaṭṭhāsiṁ pasannacittā.",
    "dn21:30": "Tasseva buddhassa sudhammatāya,Sakkassa puttomhi mahānubhāvo;Mahājutīko tidivūpapanno,Jānanti maṁ idhāpi \"gopako\"ti.",
    "dn21:31": "Athaddasaṁ bhikkhavo diṭṭhapubbe,Gandhabbakāyūpagate vasīne;Imehi te gotamasāvakāse,Ye ca mayaṁ pubbe manussabhūtā.",
    "dn21:32": "Annena pānena upaṭṭhahimhā,Pādūpasaṅgayha sake nivesane;Kutomukhā nāma ime bhavanto,Buddhassa dhammāni paṭiggahesuṁ.",
    "dn21:33": "Paccattaṁ veditabbo hi dhammo,Sudesito cakkhumatānubuddho;Ahañhi tumheva upāsamāno,Sutvāna ariyāna subhāsitāni.",
    "dn21:34": "Sakkassa puttomhi mahānubhāvo,Mahājutīko tidivūpapanno;Tumhe pana seṭṭhamupāsamānā,Anuttaraṁ brahmacariyaṁ caritvā.",
    "dn21:35": "Hīnaṁ kāyaṁ upapannā bhavanto,Anānulomā bhavatūpapatti;Duddiṭṭharūpaṁ vata addasāma,Sahadhammike hīnakāyūpapanne.",
    "dn21:36": "Gandhabbakāyūpagatā bhavanto,Devānamāgacchatha pāricariyaṁ;Agāre vasato mayhaṁ,Imaṁ passa visesataṁ.",
    "dn21:37": "Itthī hutvā svajja pumomhi devo,Dibbehi kāmehi samaṅgibhūto';Te coditā gotamasāvakena,Saṁvegamāpādu samecca gopakaṁ.",
    "dn21:38": "'Handaviyāyāmabyāyāma,Mā no mayaṁ parapessā ahumhā';Tesaṁ duve vīriyamārabhiṁsu,Anussaraṁ gotamasāsanāni.",
    "dn21:39": "Idheva cittāni virājayitvā,Kāmesu ādīnavamaddasaṁsu;Te kāmasaṁyojanabandhanāni,Pāpimayogāni duraccayāni.",
    "dn21:40": "Nāgovasannāni guṇānichetvā,Deve tāvatiṁse atikkamiṁsu;Saindā devā sapajāpatikā,Sabbe sudhammāya sabhāyupaviṭṭhā.",
    "dn21:41": "Tesaṁ nisinnānaṁ abhikkamiṁsu,Vīrā virāgā virajaṁ karontā;Te disvā saṁvegamakāsi vāsavo,Devābhibhū devagaṇassa majjhe.",
    "dn21:42": "'Imehi te hīnakāyūpapannā,Deve tāvatiṁse abhikkamanti';Saṁvegajātassa vaco nisamma,So gopako vāsavamajjhabhāsi.",
    "dn21:43": "'Buddho janindatthi manussaloke,Kāmābhibhū sakyamunīti ñāyati;Tasseva te puttā satiyā vihīnā,Coditā mayā te satimajjhalatthuṁ'.",
    "dn21:44": "Tiṇṇaṁ tesaṁāvasinetthaeko,Gandhabbakāyūpagato vasīno;Dve ca sambodhipathānusārino,Devepi hīḷenti samāhitattā.",
    "dn21:45": "Etādisī dhammappakāsanettha,Na tattha kinkaṅkhati koci sāvako;Nitiṇṇaoghaṁ vicikicchachinnaṁ,Buddhaṁ namassāma jinaṁ janindaṁ.",
    "dn21:46": "Yaṁ te dhammaṁ idhaññāya,visesaṁajjhagaṁsute;Kāyaṁ brahmapurohitaṁ,duve tesaṁ visesagū.",
    "dn21:47": "Tassa dhammassa pattiyā,āgatamhāsi mārisa;Katāvakāsā bhagavatā,pañhaṁ pucchemu mārisā\"ti.",
    "dn21:48": "Atha kho bhagavato etadahosi: \"dīgharattaṁ visuddho kho ayaṁyakkho, yaṁ kiñci maṁ pañhaṁ pucchissati, sabbaṁ taṁ atthasañhitaṁyeva pucchissati, no anatthasañhitaṁ. Yañcassāhaṁ puṭṭho byākarissāmi, taṁ khippameva ājānissatī\"ti.",
    "dn21:49": "Atha kho bhagavā sakkaṁ devānamindaṁ gāthāya ajjhabhāsi:",
    "dn21:50": "\"Puccha vāsava maṁ pañhaṁ,yaṁ kiñci manasicchasi;Tassa tasseva pañhassa,ahaṁ antaṁ karomi te\"ti.",
    "dn21:51": "Katāvakāso sakkodevānamindo bhagavatā imaṁ bhagavantaṁpaṭhamaṁ pañhaṁ apucchi:",
    "dn21:52": "\"Kiṁsaṁyojanā nu kho, mārisa, devā manussā asurā nāgā gandhabbā ye caññe santi puthukāyā, te: 'averā adaṇḍā asapattā abyāpajjā viharemu averino'ti iti ca nesaṁ hoti, atha ca pana saverā sadaṇḍā sasapattā sabyāpajjā viharanti saverino\"ti? Itthaṁ sakko devānamindobhagavantaṁ pañhaṁapucchi. Tassa bhagavā pañhaṁ puṭṭho byākāsi:",
    "dn21:53": "\"Issāmacchariyasaṁyojanā kho, devānaminda, devā manussā asurā nāgā gandhabbā ye caññe santi puthukāyā, te: 'averā adaṇḍā asapattā abyāpajjā viharemu averino'ti iti ca nesaṁ hoti, atha ca pana saverā sadaṇḍā sasapattā sabyāpajjā viharanti saverino\"ti. Itthaṁ bhagavā sakkassa devānamindassa pañhaṁ puṭṭho byākāsi. Attamano sakko devānamindo bhagavato bhāsitaṁ abhinandi anumodi: \"evametaṁ, bhagavā, evametaṁ, sugata. Tiṇṇā mettha kaṅkhā vigatā kathaṅkathā bhagavato pañhaveyyākaraṇaṁ sutvā\"ti.",
    "dn21:54": "Itiha sakko devānamindo bhagavato bhāsitaṁ abhinanditvā anumoditvā bhagavantaṁuttaripañhaṁ apucchi:",
    "dn21:55": "\"Issāmacchariyaṁ pana, mārisa, kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ; kismiṁ sati issāmacchariyaṁ hoti; kismiṁ asati issāmacchariyaṁ na hotī\"ti? \"Issāmacchariyaṁ kho, devānaminda, piyāppiyanidānaṁ piyāppiyasamudayaṁ piyāppiyajātikaṁ piyāppiyapabhavaṁ; piyāppiye sati issāmacchariyaṁ hoti, piyāppiye asati issāmacchariyaṁ na hotī\"ti.",
    "dn21:56": "\"Piyāppiyaṁpana, mārisa, kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ; kismiṁ sati piyāppiyaṁ hoti; kismiṁ asati piyāppiyaṁ na hotī\"ti? \"Piyāppiyaṁ kho, devānaminda, chandanidānaṁ chandasamudayaṁ chandajātikaṁ chandapabhavaṁ; chande sati piyāppiyaṁ hoti; chande asati piyāppiyaṁ na hotī\"ti.",
    "dn21:57": "\"Chando pana, mārisa, kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo; kismiṁ sati chando hoti; kismiṁ asati chando na hotī\"ti? \"Chando kho, devānaminda, vitakkanidāno vitakkasamudayo vitakkajātiko vitakkapabhavo; vitakke sati chando hoti; vitakke asati chando na hotī\"ti.",
    "dn21:58": "\"Vitakko pana, mārisa, kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo; kismiṁ sati vitakko hoti; kismiṁ asati vitakko na hotī\"ti?",
    "dn21:59": "\"Kathaṁ paṭipanno pana, mārisa, bhikkhu papañcasaññāsaṅkhānirodhasāruppagāminiṁ paṭipadaṁ paṭipanno hotī\"ti?",
    "dn21:60": "\"Somanassampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampi. Domanassampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampi. Upekkhampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampi.",
    "dn21:61": "Somanassampāhaṁ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti iti kho panetaṁ vuttaṁ, kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā somanassaṁ 'imaṁ kho me somanassaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī'ti, evarūpaṁ somanassaṁ na sevitabbaṁ. Tattha yaṁ jaññā somanassaṁ 'imaṁ kho me somanassaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī'ti, evarūpaṁ somanassaṁ sevitabbaṁ. Tattha yañce savitakkaṁ savicāraṁ, yañce avitakkaṁ avicāraṁ, ye avitakke avicāre,tepaṇītatare. Somanassampāhaṁ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti. Iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "dn21:62": "Domanassampāhaṁ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti iti kho panetaṁ vuttaṁ, kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā domanassaṁ 'imaṁ kho me domanassaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī'ti, evarūpaṁ domanassaṁ na sevitabbaṁ. Tattha yaṁ jaññā domanassaṁ 'imaṁ kho me domanassaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī'ti, evarūpaṁ domanassaṁ sevitabbaṁ. Tattha yañce savitakkaṁ savicāraṁ, yañce avitakkaṁ avicāraṁ, ye avitakke avicāre, te paṇītatare. Domanassampāhaṁ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "dn21:63": "Upekkhampāhaṁ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti iti kho panetaṁ vuttaṁ, kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā upekkhaṁ 'imaṁ kho me upekkhaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī'ti, evarūpā upekkhā na sevitabbā. Tattha yaṁ jaññā upekkhaṁ 'imaṁ kho me upekkhaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī'ti, evarūpā upekkhā sevitabbā. Tattha yañce savitakkaṁ savicāraṁ, yañce avitakkaṁ avicāraṁ, ye avitakke avicāre, te paṇītatare. Upekkhampāhaṁ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "dn21:64": "Evaṁ paṭipanno kho, devānaminda, bhikkhu papañcasaññāsaṅkhānirodhasāruppagāminiṁ paṭipadaṁ paṭipanno hotī\"ti. Itthaṁ bhagavā sakkassa devānamindassa pañhaṁ puṭṭho byākāsi. Attamano sakko devānamindo bhagavato bhāsitaṁ abhinandi anumodi: \"evametaṁ, bhagavā, evametaṁ, sugata.",
    "dn21:65": "Itiha sakko devānamindo bhagavato bhāsitaṁ abhinanditvā anumoditvā bhagavantaṁ uttari pañhaṁ apucchi:",
    "dn21:66": "\"Kathaṁ paṭipanno pana, mārisa, bhikkhu pātimokkhasaṁvarāya paṭipanno hotī\"ti? \" Kāyasamācārampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampi. Vacīsamācārampāhaṁ, devānaminda, duvidhena vadāmi –  sevitabbampi, asevitabbampi. Pariyesanaṁpāhaṁ, devānaminda, duvidhena vadāmi –  sevitabbampi, asevitabbampi.",
    "dn21:67": "Kāyasamācārampāhaṁ, devānaminda, duvidhena vadāmi sevitabbampi asevitabbampīti iti kho panetaṁ vuttaṁ, kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā kāyasamācāraṁ 'imaṁ kho me kāyasamācāraṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī'ti, evarūpo kāyasamācāro na sevitabbo. Tattha yaṁ jaññā kāyasamācāraṁ 'imaṁ kho me kāyasamācāraṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī'ti, evarūpo kāyasamācāro sevitabbo. Kāyasamācārampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampīti iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "dn21:68": "Vacīsamācārampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampīti iti kho panetaṁ vuttaṁ, kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā vacīsamācāraṁ 'imaṁ kho me vacīsamācāraṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī'ti, evarūpo vacīsamācāro na sevitabbo. Tattha yaṁ jaññā vacīsamācāraṁ 'imaṁ kho me vacīsamācāraṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī'ti, evarūpo vacīsamācāro sevitabbo. Vacīsamācārampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampīti iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "dn21:69": "Pariyesanaṁpāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampīti iti kho panetaṁ vuttaṁ, kiñcetaṁ paṭicca vuttaṁ? Tattha yaṁ jaññā pariyesanaṁ 'imaṁ kho me pariyesanaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī'ti, evarūpā pariyesanā na sevitabbā. Tattha yaṁ jaññā pariyesanaṁ 'imaṁ kho me pariyesanaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī'ti, evarūpā pariyesanā sevitabbā. Pariyesanaṁpāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampīti iti yaṁ taṁ vuttaṁ, idametaṁ paṭicca vuttaṁ.",
    "dn21:70": "Evaṁ paṭipanno kho, devānaminda, bhikkhu pātimokkhasaṁvarāya paṭipanno hotī\"ti. Itthaṁ bhagavā sakkassa devānamindassa pañhaṁ puṭṭho byākāsi. Attamano sakko devānamindo bhagavato bhāsitaṁ abhinandi anumodi: \"evametaṁ, bhagavā, evametaṁ, sugata.",
    "dn21:71": "Itiha sakko devānamindo bhagavato bhāsitaṁ abhinanditvā anumoditvā bhagavantaṁ uttari pañhaṁ apucchi:",
    "dn21:72": "\"Kathaṁ paṭipanno pana, mārisa, bhikkhu indriyasaṁvarāya paṭipanno hotī\"ti? \"Cakkhuviññeyyaṁ rūpampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampi. Sotaviññeyyaṁ saddampāhaṁ, devānaminda, duvidhena vadāmi –  sevitabbampi, asevitabbampi. Ghānaviññeyyaṁ gandhampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampi. Jivhāviññeyyaṁ rasampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampi. Kāyaviññeyyaṁ phoṭṭhabbampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampi. Manoviññeyyaṁ dhammampāhaṁ, devānaminda, duvidhena vadāmi—sevitabbampi, asevitabbampī\"ti.",
    "dn21:73": "Evaṁ vutte, sakko devānamindo bhagavantaṁ etadavoca:",
    "dn21:74": "\"Imassa kho ahaṁ, bhante, bhagavatā saṅkhittena bhāsitassa evaṁ vitthārena atthaṁ ājānāmi. Yathārūpaṁ, bhante, cakkhuviññeyyaṁ rūpaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṁ cakkhuviññeyyaṁ rūpaṁ na sevitabbaṁ. Yathārūpañca kho, bhante, cakkhuviññeyyaṁ rūpaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpaṁ cakkhuviññeyyaṁ rūpaṁ sevitabbaṁ. Yathārūpañca kho, bhante, sotaviññeyyaṁ saddaṁ sevato … pe … ghānaviññeyyaṁ gandhaṁ sevato … jivhāviññeyyaṁ rasaṁ sevato … kāyaviññeyyaṁ phoṭṭhabbaṁ sevato … manoviññeyyaṁ dhammaṁ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpo manoviññeyyo dhammo na sevitabbo. Yathārūpañca kho, bhante, manoviññeyyaṁ dhammaṁ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpo manoviññeyyo dhammo sevitabbo.",
    "dn21:75": "Imassa kho me, bhante, bhagavatā saṅkhittena bhāsitassa evaṁ vitthārena atthaṁ ājānato tiṇṇā mettha kaṅkhā vigatā kathaṅkathā bhagavato pañhaveyyākaraṇaṁ sutvā\"ti.",
    "dn21:76": "Itiha sakko devānamindo bhagavato bhāsitaṁ abhinanditvā anumoditvā bhagavantaṁ uttari pañhaṁ apucchi:",
    "dn21:77": "\"Sabbeva nu kho, mārisa, samaṇabrāhmaṇā ekantavādā ekantasīlā ekantachandā ekantaajjhosānā\"ti? \"Na kho, devānaminda, sabbe samaṇabrāhmaṇā ekantavādā ekantasīlā ekantachandā ekantaajjhosānā\"ti.",
    "dn21:78": "\"Kasmā pana, mārisa, na sabbe samaṇabrāhmaṇā ekantavādā ekantasīlā ekantachandā ekantaajjhosānā\"ti? \"Anekadhātu nānādhātu kho, devānaminda, loko. Tasmiṁ anekadhātunānādhātusmiṁ loke yaṁ yadeva sattā dhātuṁ abhinivisanti, taṁ tadeva thāmasā parāmāsā abhinivissa voharanti: 'idameva saccaṁ moghamaññan'ti. Tasmā na sabbe samaṇabrāhmaṇā ekantavādā ekantasīlā ekantachandā ekantaajjhosānā\"ti.",
    "dn21:79": "\"Sabbeva nu kho, mārisa, samaṇabrāhmaṇā accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā\"ti? \"Na kho, devānaminda, sabbe samaṇabrāhmaṇā accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā\"ti.",
    "dn21:80": "\"Kasmā pana, mārisa, na sabbe samaṇabrāhmaṇā accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā\"ti? \"Ye kho, devānaminda, bhikkhū taṇhāsaṅkhayavimuttā te accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā. Tasmā na sabbe samaṇabrāhmaṇā accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā\"ti.",
    "dn21:81": "Itthaṁ bhagavā sakkassa devānamindassa pañhaṁ puṭṭho byākāsi. Attamano sakko devānamindo bhagavato bhāsitaṁ abhinandi anumodi: \"evametaṁ, bhagavā, evametaṁ, sugata. Tiṇṇā mettha kaṅkhā vigatā kathaṅkathā bhagavato pañhaveyyākaraṇaṁ sutvā\"ti.",
    "dn21:82": "Itiha sakko devānamindo bhagavato bhāsitaṁ abhinanditvā anumoditvā bhagavantaṁ etadavoca:",
    "dn21:83": "\"Ejā, bhante, rogo, ejā gaṇḍo, ejā sallaṁ, ejā imaṁ purisaṁ parikaḍḍhati tassa tasseva bhavassa abhinibbattiyā. Tasmā ayaṁ puriso uccāvacamāpajjati. Yesāhaṁ, bhante, pañhānaṁ ito bahiddhā aññesu samaṇabrāhmaṇesu okāsakammampi nālatthaṁ, te me bhagavatā byākatā. Dīgharattānusayitañcapaname vicikicchākathaṁkathāsallaṁ, tañca bhagavatā abbuḷhan\"ti.",
    "dn21:84": "\"Abhijānāsi no tvaṁ, devānaminda, ime pañhe aññe samaṇabrāhmaṇe pucchitā\"ti? \"Abhijānāmahaṁ, bhante, ime pañhe aññe samaṇabrāhmaṇe pucchitā\"ti. \"Yathā kathaṁ pana te, devānaminda, byākaṁsu? Sace te agaru bhāsassū\"ti. \"Na kho me, bhante, garu yatthassa bhagavā nisinno bhagavantarūpo vā\"ti. \"Tena hi, devānaminda, bhāsassū\"ti. \"Yesvāhaṁ, bhante, maññāmi samaṇabrāhmaṇā āraññikā pantasenāsanāti, tyāhaṁ upasaṅkamitvā ime pañhe pucchāmi, te mayā puṭṭhā na sampāyanti, asampāyantā mamaṁyeva paṭipucchanti: 'ko nāmo āyasmā'ti? Tesāhaṁ puṭṭho byākaromi: 'ahaṁ kho, mārisa, sakko devānamindo'ti. Te mamaṁyeva uttari paṭipucchanti: 'kiṁ panāyasmā,devānaminda, kammaṁ katvā imaṁ ṭhānaṁ patto'ti? Tesāhaṁ yathāsutaṁ yathāpariyattaṁ dhammaṁ desemi. Te tāvatakeneva attamanā honti: 'sakko ca no devānamindo diṭṭho, yañca no apucchimhā, tañca no byākāsī'ti. Te aññadatthu mamaṁyeva sāvakā sampajjanti, na cāhaṁ tesaṁ. Ahaṁ kho pana, bhante, bhagavato sāvako sotāpanno avinipātadhammo niyato sambodhiparāyaṇo\"ti.",
    "dn21:85": "\"Abhijānāsi no tvaṁ, devānaminda, ito pubbe evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhan\"ti? \"Abhijānāmahaṁ, bhante, ito pubbe evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhan\"ti. \"Yathā kathaṁ pana tvaṁ, devānaminda, abhijānāsi ito pubbe evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhan\"ti?",
    "dn21:86": "\"Bhūtapubbaṁ, bhante, devāsurasaṅgāmosamupabyūḷhoahosi. Tasmiṁ kho pana, bhante, saṅgāme devā jiniṁsu, asurāparājayiṁsu. Tassa mayhaṁ, bhante, taṁ saṅgāmaṁ abhivijinitvā vijitasaṅgāmassa etadahosi: 'yā ceva dāni dibbā ojā yā ca asurā ojā,ubhayametaṁdevā paribhuñjissantī'ti. So kho pana me, bhante, vedapaṭilābho somanassapaṭilābho sadaṇḍāvacaro sasatthāvacaro na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṁvattati. Yo kho pana me ayaṁ, bhante, bhagavato dhammaṁ sutvā vedapaṭilābho somanassapaṭilābho, so adaṇḍāvacaro asatthāvacaro ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattatī\"ti.",
    "dn21:87": "\"Kiṁ pana tvaṁ, devānaminda, atthavasaṁ sampassamāno evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhaṁ pavedesī\"ti? \"Cha kho ahaṁ, bhante, atthavase sampassamāno evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhaṁ pavedemi.",
    "dn21:88": "Idheva tiṭṭhamānassa,devabhūtassa me sato;Punarāyu ca me laddho,evaṁ jānāhi mārisa.",
    "dn21:89": "Imaṁ kho ahaṁ, bhante, paṭhamaṁ atthavasaṁ sampassamāno evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhaṁ pavedemi.",
    "dn21:90": "Cutāhaṁ diviyā kāyā,āyuṁ hitvā amānusaṁ;Amūḷho gabbhamessāmi,yattha me ramatī mano.",
    "dn21:91": "Imaṁ kho ahaṁ, bhante, dutiyaṁ atthavasaṁ sampassamāno evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhaṁ pavedemi.",
    "dn21:92": "Svāhaṁamūḷhapaññassa,viharaṁ sāsane rato;Ñāyena viharissāmi,sampajāno paṭissato.",
    "dn21:93": "Imaṁ kho ahaṁ, bhante, tatiyaṁ atthavasaṁ sampassamāno evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhaṁ pavedemi.",
    "dn21:94": "Ñāyena me carato ca,sambodhi ce bhavissati;Aññātā viharissāmi,sveva anto bhavissati.",
    "dn21:95": "Imaṁ kho ahaṁ, bhante, catutthaṁ atthavasaṁ sampassamāno evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhaṁ pavedemi.",
    "dn21:96": "Cutāhaṁ mānusā kāyā,āyuṁ hitvāna mānusaṁ;Puna devo bhavissāmi,devalokamhi uttamo.",
    "dn21:97": "Imaṁ kho ahaṁ, bhante, pañcamaṁ atthavasaṁ sampassamāno evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhaṁ pavedemi.",
    "dn21:98": "Tepaṇītatarā devā,akaniṭṭhā yasassino;Antime vattamānamhi,so nivāso bhavissati.",
    "dn21:99": "Imaṁ kho ahaṁ, bhante, chaṭṭhaṁ atthavasaṁ sampassamāno evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhaṁ pavedemi.",
    "dn21:100": "Ime kho ahaṁ, bhante, cha atthavase sampassamāno evarūpaṁ vedapaṭilābhaṁ somanassapaṭilābhaṁ pavedemi.",
    "dn21:101": "Apariyositasaṅkappo,vicikiccho kathaṅkathī;Vicariṁ dīghamaddhānaṁ,anvesanto tathāgataṁ.",
    "dn21:102": "Yassu maññāmi samaṇe,pavivittavihārino;Sambuddhā iti maññāno,gacchāmi te upāsituṁ.",
    "dn21:103": "'Kathaṁ ārādhanā hoti,kathaṁ hoti virādhanā';Iti puṭṭhā nasampāyanti,magge paṭipadāsu ca.",
    "dn21:104": "Tyassu yadā maṁ jānanti,sakko devānamāgato;Tyassu mameva pucchanti,'kiṁ katvā pāpuṇī idaṁ'.",
    "dn21:105": "Tesaṁ yathāsutaṁ dhammaṁ,desayāmijane sutaṁ;Tena attamanā honti,'diṭṭho no vāsavoti ca'.",
    "dn21:106": "Yadā ca buddhamaddakkhiṁ,vicikicchāvitāraṇaṁ;Somhi vītabhayo ajja,sambuddhaṁpayirupāsiya.",
    "dn21:107": "Taṇhāsallassa hantāraṁ,buddhaṁ appaṭipuggalaṁ;Ahaṁ vande mahāvīraṁ,buddhamādiccabandhunaṁ.",
    "dn21:108": "Yaṁ karomasi brahmuno,samaṁ devehi mārisa;Tadajja tuyhaṁkassāma,handa sāmaṁ karoma te.",
    "dn21:109": "Tvameva asisambuddho,tuvaṁ satthā anuttaro;Sadevakasmiṁ lokasmiṁ,natthi te paṭipuggalo\"ti.",
    "dn21:110": "Atha kho sakko devānamindo pañcasikhaṁ gandhabbaputtaṁ āmantesi: \"bahūpakāro kho mesi tvaṁ, tāta pañcasikha, yaṁ tvaṁ bhagavantaṁ paṭhamaṁ pasādesi. Tayā, tāta, paṭhamaṁ pasāditaṁ pacchā mayaṁ taṁ bhagavantaṁ dassanāya upasaṅkamimhā arahantaṁ sammāsambuddhaṁ. Pettike vā ṭhāne ṭhapayissāmi, gandhabbarājā bhavissasi, bhaddañca te sūriyavacchasaṁ dammi, sā hi te abhipatthitā\"ti.",
    "dn21:111": "Atha kho sakko devānamindo pāṇinā pathaviṁ parāmasitvā tikkhattuṁ udānaṁ udānesi:",
    "dn21:112": "\"Namo tassa bhagavato arahato sammāsambuddhassa.",
    "dn21:113": "Namo tassa bhagavato arahato sammāsambuddhassa.",
    "dn21:114": "Namo tassa bhagavato arahato sammāsambuddhassā\"ti.",
    "dn21:115": "Imasmiñca pana veyyākaraṇasmiṁ bhaññamāne sakkassa devānamindassa virajaṁ vītamalaṁ dhammacakkhuṁ udapādi: \"yaṁ kiñci samudayadhammaṁ sabbaṁ taṁ nirodhadhamman\"ti. Aññesañca asītiyā devatāsahassānaṁ;"
}