{
    "dn23:1": "Evaṁ me sutaṁ—​ ekaṁ samayaṁ āyasmā kumārakassapo kosalesu cārikaṁ caramāno mahatā bhikkhusaṁghena saddhiṁ pañcamattehi bhikkhusatehi yena setabyā nāma kosalānaṁ nagaraṁ tadavasari. Tatra sudaṁ āyasmā kumārakassapo setabyāyaṁ viharati uttarena setabyaṁsiṁsapāvane. Tena kho pana samayena pāyāsi rājañño setabyaṁ ajjhāvasati sattussadaṁ satiṇakaṭṭhodakaṁ sadhaññaṁ rājabhoggaṁ raññā pasenadinā kosalena dinnaṁ rājadāyaṁ brahmadeyyaṁ.",
    "dn23:2": "Tena kho pana samayena pāyāsissa rājaññassa evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ hoti: \"itipi natthi paro loko, natthi sattā opapātikā, natthisukatadukkaṭānaṁkammānaṁ phalaṁ vipāko\"ti. Assosuṁ kho setabyakā brāhmaṇagahapatikā: \"Samaṇo khalu bho kumārakassapo samaṇassa gotamassa sāvako kosalesu cārikaṁ caramāno mahatā bhikkhusaṁghena saddhiṁ pañcamattehi bhikkhusatehi setabyaṁ anuppatto setabyāyaṁ viharati uttarena setabyaṁ siṁsapāvane. Taṁ kho pana bhavantaṁ kumārakassapaṁ evaṁ kalyāṇo kittisaddo abbhuggato: 'paṇḍito byatto medhāvī bahussuto cittakathī kalyāṇapaṭibhānovuddhoceva arahā ca. Sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī'\"ti. Atha kho setabyakā brāhmaṇagahapatikā setabyāya nikkhamitvā saṅghasaṅghī gaṇībhūtā uttarenamukhā gacchantiyena siṁsapāvanaṁ.",
    "dn23:3": "Tena kho pana samayena pāyāsi rājañño uparipāsāde divāseyyaṁ upagato hoti. Addasā kho pāyāsi rājañño setabyake brāhmaṇagahapatike setabyāya nikkhamitvā saṅghasaṅghī gaṇībhūte uttarenamukhe gacchanteyena siṁsapāvanaṁ, disvā khattaṁ āmantesi: \"Kiṁ nu kho, bho khatte, setabyakā brāhmaṇagahapatikā setabyāya nikkhamitvā saṅghasaṅghī gaṇībhūtā uttarenamukhā gacchanti yena siṁsapāvanan\"ti?",
    "dn23:4": "\"Atthi kho, bho, samaṇo kumārakassapo, samaṇassa gotamassa sāvako kosalesu cārikaṁ caramāno mahatā bhikkhusaṁghena saddhiṁ pañcamattehi bhikkhusatehi setabyaṁ anuppatto setabyāyaṁ viharati uttarena setabyaṁ siṁsapāvane. Taṁ kho pana bhavantaṁ kumārakassapaṁ evaṁ kalyāṇo kittisaddo abbhuggato: 'paṇḍito byatto medhāvī bahussuto cittakathī kalyāṇapaṭibhāno vuddho cevaarahā cā'ti.Tametebhavantaṁ kumārakassapaṁ dassanāya upasaṅkamantī\"ti. \"Tena hi, bho khatte, yena setabyakā brāhmaṇagahapatikā tenupasaṅkama; upasaṅkamitvā setabyake brāhmaṇagahapatike evaṁ vadehi: 'pāyāsi, bho, rājañño evamāha –  āgamentu kira bhavanto, pāyāsipi rājañño samaṇaṁ kumārakassapaṁ dassanāya upasaṅkamissatī'ti. Purā samaṇo kumārakassapo setabyake brāhmaṇagahapatike bāle abyatte saññāpeti: 'itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'ti. Natthi hi, bho khatte, paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko\"ti. \"Evaṁ, bho\"ti kho so khattā pāyāsissa rājaññassa paṭissutvā yena setabyakā brāhmaṇagahapatikā tenupasaṅkami; upasaṅkamitvā setabyake brāhmaṇagahapatike etadavoca: \"pāyāsi, bho, rājañño evamāha, āgamentu kira bhavanto, pāyāsipi rājañño samaṇaṁ kumārakassapaṁ dassanāya upasaṅkamissatī\"ti.",
    "dn23:5": "Atha kho pāyāsi rājañño setabyakehi brāhmaṇagahapatikehi parivuto yena siṁsapāvanaṁ yenāyasmā kumārakassapo tenupasaṅkami; upasaṅkamitvā āyasmatā kumārakassapena saddhiṁ sammodi, sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Setabyakāpi kho brāhmaṇagahapatikā appekacce āyasmantaṁ kumārakassapaṁ abhivādetvā ekamantaṁ nisīdiṁsu; appekacce āyasmatā kumārakassapena saddhiṁ sammodiṁsu; sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Appekacce yenāyasmā kumārakassapo tenañjaliṁ paṇāmetvā ekamantaṁ nisīdiṁsu. Appekacce nāmagottaṁ sāvetvā ekamantaṁ nisīdiṁsu. Appekacce tuṇhībhūtā ekamantaṁ nisīdiṁsu.",
    "dn23:6": "Ekamantaṁ nisinno kho pāyāsi rājañño āyasmantaṁ kumārakassapaṁ etadavoca: \"ahañhi, bho kassapa, evaṁvādī evaṁdiṭṭhī: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti. \"Nāhaṁ, rājañña, evaṁvādiṁ evaṁdiṭṭhiṁ addasaṁ vā assosiṁ vā. Kathañhi nāma evaṁ vadeyya: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'ti?",
    "dn23:7": "Tena hi, rājañña, taññevettha paṭipucchissāmi, yathā te khameyya, tathā naṁ byākareyyāsi. Taṁ kiṁ maññasi, rājañña, ime candimasūriyā imasmiṁ vā loke parasmiṁ vā, devā vā te manussā vā\"ti?",
    "dn23:8": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho evaṁ me ettha hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti. \"Atthi pana, rājañña, pariyāyo, yena te pariyāyena evaṁ hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti?",
    "dn23:9": "\"Tena hi, rājañña, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṁ byākareyyāsi. Taṁ kiṁ maññasi, rājañña, idha te purisā coraṁ āgucāriṁ gahetvā dasseyyuṁ: 'ayaṁ te, bhante, coro āgucārī; imassa yaṁ icchasi, taṁ daṇḍaṁ paṇehī'ti. Te tvaṁ evaṁ vadeyyāsi: 'tena hi, bho, imaṁ purisaṁ daḷhāya rajjuyā pacchābāhaṁ gāḷhabandhanaṁ bandhitvā khuramuṇḍaṁkaritvākharassarena paṇavenarathikāya rathikaṁsiṅghāṭakena siṅghāṭakaṁ parinetvā dakkhiṇena dvārena nikkhamitvā dakkhiṇato nagarassa āghātane sīsaṁ chindathā'ti. Te 'sādhū'ti paṭissutvā taṁ purisaṁ daḷhāya rajjuyā pacchābāhaṁ gāḷhabandhanaṁ bandhitvā khuramuṇḍaṁ karitvā kharassarena paṇavena rathikāya rathikaṁ siṅghāṭakena siṅghāṭakaṁ parinetvā dakkhiṇena dvārena nikkhamitvā dakkhiṇato nagarassa āghātane nisīdāpeyyuṁ. Labheyya nu kho so coro coraghātesu: 'āgamentu tāva bhavanto coraghātā, amukasmiṁ me gāme vā nigame vā mittāmaccā ñātisālohitā, yāvāhaṁ tesaṁ uddisitvā āgacchāmī'ti, udāhu vippalapantasseva coraghātā sīsaṁ chindeyyun\"ti? \"Na hi so, bho kassapa, coro labheyya coraghātesu: 'āgamentu tāva bhavanto coraghātā amukasmiṁ me gāme vā nigame vā mittāmaccā ñātisālohitā, yāvāhaṁ tesaṁ uddisitvā āgacchāmī'ti. Atha kho naṁ vippalapantasseva coraghātā sīsaṁ chindeyyun\"ti.",
    "dn23:10": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho evaṁ me ettha hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti. \"Atthi pana, rājañña, pariyāyo yena te pariyāyena evaṁ hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti?",
    "dn23:11": "\"Tena hi, rājañña, upamaṁ te karissāmi.Upamāya midhekacceviññū purisā bhāsitassa atthaṁ ājānanti. Seyyathāpi, rājañña, puriso gūthakūpesasīsakaṁnimuggo assa. Atha tvaṁ purise āṇāpeyyāsi: 'tena hi, bho, taṁ purisaṁ tamhā gūthakūpā uddharathā'ti. Te 'sādhū'ti paṭissutvā taṁ purisaṁ tamhā gūthakūpā uddhareyyuṁ. Te tvaṁ evaṁ vadeyyāsi: 'tena hi, bho, tassa purisassa kāyā veḷupesikāhi gūthaṁ sunimmajjitaṁ nimmajjathā'ti. Te 'sādhū'ti paṭissutvā tassa purisassa kāyā veḷupesikāhi gūthaṁ sunimmajjitaṁ nimmajjeyyuṁ. Te tvaṁ evaṁ vadeyyāsi: 'tena hi, bho, tassa purisassa kāyaṁ paṇḍumattikāya tikkhattuṁsubbaṭṭitaṁ ubbaṭṭethā'ti. Te tassa purisassa kāyaṁ paṇḍumattikāya tikkhattuṁ subbaṭṭitaṁ ubbaṭṭeyyuṁ. Te tvaṁ evaṁ vadeyyāsi: 'tena hi, bho, taṁ purisaṁ telena abbhañjitvā sukhumena cuṇṇena tikkhattuṁ suppadhotaṁ karothā'ti. Te taṁ purisaṁ telena abbhañjitvā sukhumena cuṇṇena tikkhattuṁ suppadhotaṁ kareyyuṁ. Te tvaṁ evaṁ vadeyyāsi: 'tena hi, bho, tassa purisassa kesamassuṁ kappethā'ti. Te tassa purisassa kesamassuṁ kappeyyuṁ. Te tvaṁ evaṁ vadeyyāsi: 'tena hi, bho, tassa purisassa mahagghañca mālaṁ mahagghañca vilepanaṁ mahagghāni ca vatthāni upāhārathā'ti. Te tassa purisassa mahagghañca mālaṁ mahagghañca vilepanaṁ mahagghāni ca vatthāni upahareyyuṁ. Te tvaṁ evaṁ vadeyyāsi: 'tena hi, bho, taṁ purisaṁ pāsādaṁ āropetvā pañcakāmaguṇāni upaṭṭhāpethā'ti. Te taṁ purisaṁ pāsādaṁ āropetvā pañcakāmaguṇāni upaṭṭhāpeyyuṁ.",
    "dn23:12": "Taṁ kiṁ maññasi, rājañña, api nu tassa purisassa sunhātassa suvilittassa sukappitakesamassussa āmukkamālābharaṇassa odātavatthavasanassa uparipāsādavaragatassa pañcahi kāmaguṇehi samappitassa samaṅgībhūtassa paricārayamānassa punadeva tasmiṁ gūthakūpenimujjitukāmatāassā\"ti? \"No hidaṁ, bho kassapa\". \"Taṁ kissa hetu\"? \"Asuci, bho kassapa, gūthakūpo asuci ceva asucisaṅkhāto ca duggandho ca duggandhasaṅkhāto ca jeguccho ca jegucchasaṅkhāto ca paṭikūlo ca paṭikūlasaṅkhāto cā\"ti.",
    "dn23:13": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho evaṁ me ettha hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti. \"Atthi pana, rājañña, pariyāyo … pe … \"atthi, bho kassapa, pariyāyo … pe … yathā kathaṁ viya, rājaññāti?",
    "dn23:14": "\"Tena hi, rājañña, taññevettha paṭipucchissāmi; yathā te khameyya, tathā naṁ byākareyyāsi. Yaṁ kho pana, rājañña,mānussakaṁvassasataṁ, devānaṁ tāvatiṁsānaṁ eso ekorattindivo, tāya rattiyā tiṁsarattiyo māso, tena māsena dvādasamāsiyo saṁvaccharo, tena saṁvaccharena dibbaṁ vassasahassaṁ devānaṁ tāvatiṁsānaṁ āyuppamāṇaṁ. Ye te mittāmaccā ñātisālohitā pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā surāmerayamajjapamādaṭṭhānā paṭiviratā, te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā devānaṁ tāvatiṁsānaṁ sahabyataṁ. Sace pana tesaṁ evaṁ bhavissati: 'yāva mayaṁ dve vā tīṇi vā rattindivā dibbehi pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārema, atha mayaṁ pāyāsissa rājaññassa gantvā āroceyyāma: \"itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko\"ti. Api nu te āgantvā āroceyyuṁ—itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti? \"No hidaṁ, bho kassapa. Api hi mayaṁ, bho kassapa, ciraṁ kālaṅkatāpi bhaveyyāma. Ko panetaṁ bhoto kassapassa āroceti: 'atthi devā tāvatiṁsā'ti vā 'evaṁdīghāyukā devā tāvatiṁsā'ti vā. Na mayaṁ bhoto kassapassa saddahāma: 'atthi devā tāvatiṁsā'ti vā 'evaṁdīghāyukā devā tāvatiṁsā'ti vā\"ti.",
    "dn23:15": "\"Seyyathāpi, rājañña, jaccandho puriso na passeyya kaṇha—sukkāni rūpāni, na passeyya nīlakāni rūpāni, na passeyya pītakāni rūpāni, na passeyya lohitakāni rūpāni, na passeyyamañjiṭṭhakānirūpāni, na passeyya samavisamaṁ, na passeyya tārakāni rūpāni, na passeyya candimasūriye. So evaṁ vadeyya: 'natthi kaṇhasukkāni rūpāni, natthi kaṇhasukkānaṁ rūpānaṁ dassāvī. Natthi nīlakāni rūpāni, natthi nīlakānaṁ rūpānaṁ dassāvī. Natthi pītakāni rūpāni, natthi pītakānaṁ rūpānaṁ dassāvī. Natthi lohitakāni rūpāni, natthi lohitakānaṁ rūpānaṁ dassāvī. Natthi mañjiṭṭhakāni rūpāni, natthi mañjiṭṭhakānaṁ rūpānaṁ dassāvī. Natthi samavisamaṁ, natthi samavisamassa dassāvī. Natthi tārakāni rūpāni, natthi tārakānaṁ rūpānaṁ dassāvī. Natthi candimasūriyā, natthi candimasūriyānaṁ dassāvī. Ahametaṁ na jānāmi, ahametaṁ na passāmi, tasmā taṁ natthī'ti. Sammā nu kho so, rājañña, vadamāno vadeyyā\"ti? \"No hidaṁ, bho kassapa. Atthi kaṇhasukkāni rūpāni, atthi kaṇhasukkānaṁ rūpānaṁ dassāvī. Atthi nīlakāni rūpāni, atthi nīlakānaṁ rūpānaṁ dassāvī … pe … atthi samavisamaṁ, atthi samavisamassa dassāvī. Atthi tārakāni rūpāni, atthi tārakānaṁ rūpānaṁ dassāvī. Atthi candimasūriyā, atthi candimasūriyānaṁ dassāvī. 'Ahametaṁ na jānāmi, ahametaṁ na passāmi, tasmā taṁ natthī'ti. Na hi so, bho kassapa, sammā vadamāno vadeyyā\"ti.",
    "dn23:16": "\"Evameva kho tvaṁ, rājañña, jaccandhūpamo maññe paṭibhāsi yaṁ maṁ tvaṁ evaṁ vadesi. Ko panetaṁ bhoto kassapassa āroceti: 'atthi devā tāvatiṁsā'ti vā, 'evaṁdīghāyukā devā tāvatiṁsā'ti vā? Na mayaṁ bhoto kassapassa saddahāma: 'atthi devā tāvatiṁsā'ti vā 'evaṁdīghāyukā devā tāvatiṁsā'ti vā\"ti. \"Na kho, rājañña, evaṁ paro loko daṭṭhabbo, yathā tvaṁ maññasi iminā maṁsacakkhunā. Ye kho te, rājañña, samaṇabrāhmaṇā araññavanapatthāni pantāni senāsanāni paṭisevanti, te tattha appamattā ātāpino pahitattā viharantā dibbacakkhuṁ visodhenti. Te dibbena cakkhunā visuddhena atikkantamānusakena imañceva lokaṁ passanti parañca satte ca opapātike. Evañca kho, rājañña, paro loko daṭṭhabbo; na tveva yathā tvaṁ maññasi iminā maṁsacakkhunā. Imināpi kho te, rājañña, pariyāyena evaṁ hotu: 'itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti.",
    "dn23:17": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho evaṁ me ettha hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti. \"Atthi pana, rājañña, pariyāyo … pe … atthi, bho kassapa, pariyāyo … pe … yathā kathaṁ viya, rājaññā\"ti?",
    "dn23:18": "\"Tena hi, rājañña, upamaṁ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Bhūtapubbaṁ, rājañña, aññatarassa brāhmaṇassa dve pajāpatiyo ahesuṁ. Ekissā putto ahosi dasavassuddesiko vā dvādasavassuddesiko vā, ekā gabbhinī upavijaññā. Atha kho so brāhmaṇo kālamakāsi. Atha kho so māṇavakomātusapattiṁetadavoca: 'yamidaṁ, bhoti, dhanaṁ vā dhaññaṁ vā rajataṁ vā jātarūpaṁ vā, sabbaṁ taṁ mayhaṁ; natthi tuyhettha kiñci. Pitume, bhoti, dāyajjaṁniyyādehī'ti. Evaṁ vutte, sā brāhmaṇī taṁ māṇavakaṁ etadavoca: 'āgamehi tāva, tāta, yāva vijāyāmi. Sace kumārako bhavissati, tassapi ekadeso bhavissati; sace kumārikā bhavissati, sāpi teopabhoggābhavissatī'ti. Dutiyampi kho so māṇavako mātusapattiṁ etadavoca: 'yamidaṁ, bhoti, dhanaṁ vā dhaññaṁ vā rajataṁ vā jātarūpaṁ vā, sabbaṁ taṁ mayhaṁ; natthi tuyhettha kiñci. Pitu me, bhoti, dāyajjaṁ niyyādehī'ti. Dutiyampi kho sā brāhmaṇī taṁ māṇavakaṁ etadavoca: 'āgamehi tāva, tāta, yāva vijāyāmi. Sace kumārako bhavissati, tassapi ekadeso bhavissati; sace kumārikā bhavissati sāpi teopabhoggābhavissatī'ti. Tatiyampi kho so māṇavako mātusapattiṁ etadavoca: 'yamidaṁ, bhoti, dhanaṁ vā dhaññaṁ vā rajataṁ vā jātarūpaṁ vā, sabbaṁ taṁ mayhaṁ; natthi tuyhettha kiñci. Pitu me, bhoti, dāyajjaṁ niyyādehī'ti.",
    "dn23:19": "Atha kho sā brāhmaṇī satthaṁ gahetvā ovarakaṁ pavisitvā udaraṁopādesi: 'yāva vijāyāmi yadi vā kumārako yadi vā kumārikā'ti. Sā attānañceva jīvitañca gabbhañca sāpateyyañca vināsesi. Yathā taṁ bālā abyattā anayabyasanaṁ āpannā ayoniso dāyajjaṁ gavesantī, evameva kho tvaṁ, rājañña, bālo abyatto anayabyasanaṁ āpajjissasi ayoniso paralokaṁ gavesanto; seyyathāpi sā brāhmaṇī bālā abyattā anayabyasanaṁ āpannā ayoniso dāyajjaṁ gavesantī. Na kho, rājañña, samaṇabrāhmaṇā sīlavanto kalyāṇadhammā apakkaṁ paripācenti; api ca paripākaṁ āgamenti. Paṇḍitānaṁ attho hi, rājañña, samaṇabrāhmaṇānaṁ sīlavantānaṁ kalyāṇadhammānaṁ jīvitena. Yathā yathā kho, rājañña, samaṇabrāhmaṇā sīlavanto kalyāṇadhammā ciraṁ dīghamaddhānaṁ tiṭṭhanti tathā tathā bahuṁ puññaṁ pasavanti, bahujanahitāya ca paṭipajjanti bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṁ. Imināpi kho te, rājañña, pariyāyena evaṁ hotu: 'itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti.",
    "dn23:20": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho evaṁ me ettha hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti. \"Atthi pana, rājañña, pariyāyo … pe … atthi, bho kassapa, pariyāyo … pe … yathā kathaṁ viya, rājaññā\"ti?",
    "dn23:21": "\"Tena hi, rājañña, taññevettha paṭipucchissāmi, yathā te khameyya, tathā naṁ byākareyyāsi. Abhijānāsi no tvaṁ, rājañña, divā seyyaṁ upagato supinakaṁ passitā ārāmarāmaṇeyyakaṁ vanarāmaṇeyyakaṁ bhūmirāmaṇeyyakaṁ pokkharaṇīrāmaṇeyyakan\"ti? \"Abhijānāmahaṁ, bho kassapa, divāseyyaṁ upagato supinakaṁ passitā ārāmarāmaṇeyyakaṁ vanarāmaṇeyyakaṁ bhūmirāmaṇeyyakaṁ pokkharaṇīrāmaṇeyyakan\"ti. \"Rakkhanti taṁ tamhi samaye khujjāpi vāmanakāpivelāsikāpikomārikāpī\"ti? \"Evaṁ, bho kassapa, rakkhanti maṁ tamhi samaye khujjāpi vāmanakāpivelāsikāpikomārikāpī\"ti. \"Api nu tā tuyhaṁ jīvaṁ passanti pavisantaṁ vā nikkhamantaṁ vā\"ti? \"No hidaṁ, bho kassapa\". \"Tā hi nāma, rājañña, tuyhaṁ jīvantassa jīvantiyo jīvaṁ na passissanti pavisantaṁ vā nikkhamantaṁ vā. Kiṁ pana tvaṁ kālaṅkatassa jīvaṁ passissasi pavisantaṁ vā nikkhamantaṁ vā. Imināpi kho te, rājañña, pariyāyena evaṁ hotu: 'itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti.",
    "dn23:22": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho evaṁ me ettha hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti. \"Atthi pana, rājañña, pariyāyo … pe … \"atthi, bho kassapa, pariyāyo … pe … yathā kathaṁ viya, rājaññā\"ti?",
    "dn23:23": "\"Tena hi, rājañña, upamaṁ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Seyyathāpi, rājañña, puriso divasaṁ santattaṁ ayoguḷaṁ ādittaṁ sampajjalitaṁ sajotibhūtaṁ tulāya tuleyya. Tamenaṁ aparena samayena sītaṁ nibbutaṁ tulāya tuleyya. Kadā nu kho so ayoguḷo lahutaro vā hoti mudutaro vā kammaññataro vā, yadā vā āditto sampajjalito sajotibhūto, yadā vā sīto nibbuto\"ti? \"Yadā so, bho kassapa, ayoguḷo tejosahagato ca hoti vāyosahagato ca āditto sampajjalito sajotibhūto, tadā lahutaro ca hoti mudutaro ca kammaññataro ca. Yadā pana so ayoguḷo neva tejosahagato hoti na vāyosahagato sīto nibbuto, tadā garutaro ca hoti patthinnataro ca akammaññataro cā\"ti. \"Evameva kho, rājañña, yadāyaṁ kāyo āyusahagato ca hoti usmāsahagato ca viññāṇasahagato ca, tadā lahutaro ca hoti mudutaro ca kammaññataro ca. Yadā panāyaṁ kāyo neva āyusahagato hoti na usmāsahagato na viññāṇasahagato tadā garutaro ca hoti patthinnataro ca akammaññataro ca. Imināpi kho te, rājañña, pariyāyena evaṁ hotu: 'itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti.",
    "dn23:24": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho evaṁ me ettha hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti. \"Atthi pana, rājañña, pariyāyo … pe … atthi, bho kassapa, pariyāyo … pe … yathā kathaṁ viya, rājaññā\"ti?",
    "dn23:25": "\"Tena hi, rājañña, upamaṁ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Bhūtapubbaṁ, rājañña, aññataro saṅkhadhamo saṅkhaṁ ādāya paccantimaṁ janapadaṁ agamāsi. So yena aññataro gāmo tenupasaṅkami; upasaṅkamitvā majjhe gāmassa ṭhito tikkhattuṁ saṅkhaṁ upalāpetvā saṅkhaṁ bhūmiyaṁ nikkhipitvā ekamantaṁ nisīdi. Atha kho, rājañña, tesaṁpaccantajanapadānaṁmanussānaṁ etadahosi: 'ambho kassa nu khoeso saddo evaṁrajanīyo evaṁkamanīyo evaṁmadanīyo evambandhanīyo evaṁmucchanīyo'ti. Sannipatitvā taṁ saṅkhadhamaṁ etadavocuṁ: 'ambho, kassa nu kho eso saddo evaṁrajanīyo evaṁkamanīyo evaṁmadanīyo evambandhanīyo evaṁmucchanīyo'ti. 'Eso kho, bho, saṅkho nāma yasseso saddo evaṁrajanīyo evaṁkamanīyo evaṁmadanīyo evambandhanīyo evaṁmucchanīyo'ti. Te taṁ saṅkhaṁ uttānaṁ nipātesuṁ: 'vadehi, bho saṅkha, vadehi, bho saṅkhā'ti. Neva so saṅkho saddamakāsi. Te taṁ saṅkhaṁ avakujjaṁ nipātesuṁ, passena nipātesuṁ, dutiyena passena nipātesuṁ, uddhaṁ ṭhapesuṁ, omuddhakaṁ ṭhapesuṁ, pāṇinā ākoṭesuṁ, leḍḍunā ākoṭesuṁ, daṇḍena ākoṭesuṁ, satthena ākoṭesuṁ, odhuniṁsu sandhuniṁsu niddhuniṁsu: 'vadehi, bho saṅkha, vadehi, bho saṅkhā'ti. Neva so saṅkho saddamakāsi.",
    "dn23:26": "Atha kho, rājañña, tassa saṅkhadhamassa etadahosi: 'yāva bālā ime paccantajanapadā manussā, kathañhi nāma ayoniso saṅkhasaddaṁ gavesissantī'ti. Tesaṁ pekkhamānānaṁ saṅkhaṁ gahetvā tikkhattuṁ saṅkhaṁ upalāpetvā saṅkhaṁ ādāya pakkāmi. Atha kho, rājañña, tesaṁ paccantajanapadānaṁ manussānaṁ etadahosi: 'yadā kira, bho, ayaṁ saṅkho nāma purisasahagato ca hotivāyāmasahagatoca vāyusahagato ca, tadāyaṁ saṅkho saddaṁ karoti, yadā panāyaṁ saṅkho neva purisasahagato hoti na vāyāmasahagato na vāyusahagato, nāyaṁ saṅkho saddaṁ karotī'ti. Evameva kho, rājañña, yadāyaṁ kāyo āyusahagato ca hoti usmāsahagato ca viññāṇasahagato ca, tadā abhikkamatipi paṭikkamatipi tiṭṭhatipi nisīdatipi seyyampi kappeti, cakkhunāpi rūpaṁ passati, sotenapi saddaṁ suṇāti, ghānenapi gandhaṁ ghāyati, jivhāyapi rasaṁ sāyati, kāyenapi phoṭṭhabbaṁ phusati, manasāpi dhammaṁ vijānāti. Yadā panāyaṁ kāyo neva āyusahagato hoti, na usmāsahagato, na viññāṇasahagato, tadā neva abhikkamati na paṭikkamati na tiṭṭhati na nisīdati na seyyaṁ kappeti, cakkhunāpi rūpaṁ na passati, sotenapi saddaṁ na suṇāti, ghānenapi gandhaṁ na ghāyati, jivhāyapi rasaṁ na sāyati, kāyenapi phoṭṭhabbaṁ na phusati, manasāpi dhammaṁ na vijānāti. Imināpi kho te, rājañña, pariyāyena evaṁ hotu: 'itipi atthi paro loko, atthi sattā opapātikā, atthisukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti.",
    "dn23:27": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho evaṁ me ettha hoti: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti. \"Atthi pana, rājañña, pariyāyo … pe … atthi, bho kassapa, pariyāyo … pe … yathā kathaṁ viya, rājaññā\"ti?",
    "dn23:28": "\"Tena hi, rājañña, upamaṁ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Bhūtapubbaṁ, rājañña, aññataro aggiko jaṭilo araññāyatane paṇṇakuṭiyāsammati. Atha kho, rājañña, aññatarojanapade satthovuṭṭhāsi. Atha kho sosatthotassa aggikassa jaṭilassa assamassa sāmantā ekarattiṁ vasitvā pakkāmi. Atha kho, rājañña, tassa aggikassa jaṭilassa etadahosi: 'yannūnāhaṁ yena so satthavāso tenupasaṅkameyyaṁ, appeva nāmettha kiñci upakaraṇaṁ adhigaccheyyan'ti. Atha kho so aggiko jaṭilo kālasseva vuṭṭhāya yena so satthavāso tenupasaṅkami; upasaṅkamitvā addasa tasmiṁ satthavāse dāhāraṁ kumāraṁ mandaṁ uttānaseyyakaṁ chaḍḍitaṁ. Disvānassa etadahosi: 'na kho me taṁ patirūpaṁ yaṁ me pekkhamānassa manussabhūto kālaṁkareyya; yannūnāhaṁ imaṁ dārakaṁ assamaṁ netvā āpādeyyaṁ poseyyaṁ vaḍḍheyyan'ti. Atha kho so aggiko jaṭilo taṁ dārakaṁ assamaṁ netvā āpādesi posesi vaḍḍhesi. Yadā so dārako dasavassuddesiko vāhotidvādasavassuddesiko vā, atha kho tassa aggikassa jaṭilassa janapade kañcideva karaṇīyaṁ uppajji. Atha kho so aggiko jaṭilo taṁ dārakaṁ etadavoca: 'icchāmahaṁ, tāta,janapadaṁgantuṁ; aggiṁ, tāta, paricareyyāsi. Mā ca te aggi nibbāyi. Sace ca te aggi nibbāyeyya, ayaṁ vāsī imāni kaṭṭhāni idaṁ araṇisahitaṁ, aggiṁ nibbattetvā aggiṁ paricareyyāsī'ti. Atha kho so aggiko jaṭilo taṁ dārakaṁ evaṁ anusāsitvā janapadaṁ agamāsi. Tassa khiḍḍāpasutassa aggi nibbāyi.",
    "dn23:29": "Atha kho tassa dārakassa etadahosi: 'pitā kho maṁ evaṁ avaca: \"aggiṁ, tāta, paricareyyāsi. Mā ca te aggi nibbāyi. Sace ca te aggi nibbāyeyya, ayaṁ vāsī imāni kaṭṭhāni idaṁ araṇisahitaṁ, aggiṁ nibbattetvā aggiṁ paricareyyāsī\"ti. Yannūnāhaṁ aggiṁ nibbattetvā aggiṁ paricareyyan'ti. Atha kho so dārako araṇisahitaṁ vāsiyā tacchi: 'appeva nāma aggiṁ adhigaccheyyan'ti. Neva so aggiṁ adhigacchi. Araṇisahitaṁ dvidhā phālesi, tidhā phālesi, catudhā phālesi, pañcadhā phālesi, dasadhā phālesi,satadhāphālesi, sakalikaṁ sakalikaṁ akāsi, sakalikaṁ sakalikaṁ karitvā udukkhale koṭṭesi, udukkhale koṭṭetvā mahāvāteopuni: 'appeva nāma aggiṁ adhigaccheyyan'ti. Neva so aggiṁ adhigacchi.",
    "dn23:30": "Atha kho so aggiko jaṭilo janapade taṁ karaṇīyaṁ tīretvā yena sako assamo tenupasaṅkami; upasaṅkamitvā taṁ dārakaṁ etadavoca: 'kacci te, tāta, aggi na nibbuto'ti? 'Idha me, tāta, khiḍḍāpasutassa aggi nibbāyi. Tassa me etadahosi: \"pitā kho maṁ evaṁ avaca aggiṁ, tāta, paricareyyāsi. Mā ca te, tāta, aggi nibbāyi. Sace ca te aggi nibbāyeyya, ayaṁ vāsī imāni kaṭṭhāni idaṁ araṇisahitaṁ, aggiṁ nibbattetvā aggiṁ paricareyyāsīti. Yannūnāhaṁ aggiṁ nibbattetvā aggiṁ paricareyyan\"ti. Atha khvāhaṁ, tāta, araṇisahitaṁ vāsiyā tacchiṁ: \"appeva nāma aggiṁ adhigaccheyyan\"ti. Nevāhaṁ aggiṁ adhigacchiṁ. Araṇisahitaṁ dvidhā phālesiṁ, tidhā phālesiṁ, catudhā phālesiṁ, pañcadhā phālesiṁ, dasadhā phālesiṁ, satadhā phālesiṁ, sakalikaṁ sakalikaṁ akāsiṁ, sakalikaṁ sakalikaṁ karitvā udukkhale koṭṭesiṁ, udukkhale koṭṭetvā mahāvāte opuniṁ: \"appeva nāma aggiṁ adhigaccheyyan\"ti. Nevāhaṁ aggiṁ adhigacchin'ti. Atha kho tassa aggikassa jaṭilassa etadahosi: 'yāva bālo ayaṁ dārako abyatto, kathañhi nāma ayoniso aggiṁ gavesissatī'ti. Tassa pekkhamānassa araṇisahitaṁ gahetvā aggiṁ nibbattetvā taṁ dārakaṁ etadavoca: 'evaṁ kho, tāta, aggi nibbattetabbo. Na tveva yathā tvaṁ bālo abyatto ayoniso aggiṁ gavesī'ti. Evameva kho tvaṁ, rājañña, bālo abyatto ayoniso paralokaṁ gavesissasi. Paṭinissajjetaṁ, rājañña, pāpakaṁ diṭṭhigataṁ, paṭinissajjetaṁ, rājañña, pāpakaṁ diṭṭhigataṁ, mā te ahosi dīgharattaṁ ahitāya dukkhāyā\"ti.",
    "dn23:31": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho nevāhaṁ sakkomi idaṁ pāpakaṁ diṭṭhigataṁ paṭinissajjituṁ. Rājāpi maṁ pasenadi kosalo jānāti tirorājānopi: 'pāyāsi rājañño evaṁvādī evaṁdiṭṭhī: \"itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko\"'ti. Sacāhaṁ, bho kassapa, idaṁ pāpakaṁ diṭṭhigataṁ paṭinissajjissāmi, bhavissanti me vattāro: 'yāva bālo pāyāsi rājañño abyatto duggahitagāhī'ti. Kopenapi naṁ harissāmi, makkhenapi naṁ harissāmi, palāsenapi naṁ harissāmī\"ti.",
    "dn23:32": "\"Tena hi, rājañña, upamaṁ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Bhūtapubbaṁ, rājañña, mahāsakaṭasattho sakaṭasahassaṁ puratthimā janapadā pacchimaṁ janapadaṁ agamāsi. So yena yena gacchi, khippaṁyeva pariyādiyati tiṇakaṭṭhodakaṁ haritakapaṇṇaṁ. Tasmiṁ kho pana satthe dve satthavāhā ahesuṁ eko pañcannaṁ sakaṭasatānaṁ, eko pañcannaṁ sakaṭasatānaṁ. Atha kho tesaṁ satthavāhānaṁ etadahosi: 'ayaṁ kho mahāsakaṭasattho sakaṭasahassaṁ; te mayaṁ yena yena gacchāma, khippameva pariyādiyati tiṇakaṭṭhodakaṁ haritakapaṇṇaṁ. Yannūna mayaṁ imaṁ satthaṁ dvidhā vibhajeyyāma—ekato pañca sakaṭasatāni ekato pañca sakaṭasatānī'ti. Te taṁ satthaṁ dvidhāvibhajiṁsuekato pañca sakaṭasatāni, ekato pañca sakaṭasatāni. Eko satthavāho bahuṁ tiṇañca kaṭṭhañca udakañca āropetvā satthaṁpayāpesi. Dvīhatīhapayāto kho pana so sattho addasa purisaṁ kāḷaṁlohitakkhaṁsannaddhakalāpaṁkumudamāliṁ allavatthaṁ allakesaṁ kaddamamakkhitehi cakkehi bhadrena rathena paṭipathaṁ āgacchantaṁ, disvā etadavoca: 'kuto, bho, āgacchasī'ti? 'Amukamhā janapadā'ti. 'Kuhiṁ gamissasī'ti? 'Amukaṁ nāma janapadan'ti. 'Kacci, bho, purato kantāre mahāmegho abhippavuṭṭho'ti? 'Evaṁ, bho, purato kantāre mahāmegho abhippavuṭṭho, āsittodakāni vaṭumāni, bahu tiṇañca kaṭṭhañca udakañca. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi sīghaṁ sīghaṁ gacchatha, mā yoggāni kilamitthā'ti.",
    "dn23:33": "Atha kho so satthavāho satthike āmantesi: 'ayaṁ, bho, puriso evamāha: \"purato kantāre mahāmegho abhippavuṭṭho, āsittodakāni vaṭumāni, bahu tiṇañca kaṭṭhañca udakañca. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi sīghaṁ sīghaṁ gacchatha, mā yoggāni kilamitthā\"ti. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi satthaṁ payāpethā'ti. 'Evaṁ, bho'ti kho te satthikā tassa satthavāhassa paṭissutvā chaḍḍetvā purāṇāni tiṇāni kaṭṭhāni udakāni lahubhārehi sakaṭehi satthaṁ payāpesuṁ. Te paṭhamepi satthavāse na addasaṁsu tiṇaṁ vā kaṭṭhaṁ vā udakaṁ vā. Dutiyepi satthavāse … tatiyepi satthavāse … catutthepi satthavāse … pañcamepi satthavāse … chaṭṭhepi satthavāse … sattamepi satthavāse na addasaṁsu tiṇaṁ vā kaṭṭhaṁ vā udakaṁ vā. Sabbeva anayabyasanaṁ āpajjiṁsu. Ye ca tasmiṁ satthe ahesuṁ manussā vā pasū vā, sabbe so yakkho amanusso bhakkhesi. Aṭṭhikāneva sesāni.",
    "dn23:34": "Yadā aññāsi dutiyo satthavāho: 'bahunikkhanto kho, bho, dāni so sattho'ti bahuṁ tiṇañca kaṭṭhañca udakañca āropetvā satthaṁ payāpesi. Dvīhatīhapayāto kho pana so sattho addasa purisaṁ kāḷaṁ lohitakkhaṁ sannaddhakalāpaṁ kumudamāliṁ allavatthaṁ allakesaṁ kaddamamakkhitehi cakkehi bhadrena rathena paṭipathaṁ āgacchantaṁ, disvā etadavoca: 'kuto, bho, āgacchasī'ti? 'Amukamhā janapadā'ti. 'Kuhiṁ gamissasī'ti? 'Amukaṁ nāma janapadan'ti. 'Kacci, bho, purato kantāre mahāmegho abhippavuṭṭho'ti? 'Evaṁ, bho, purato kantāre mahāmegho abhippavuṭṭho. Āsittodakāni vaṭumāni, bahu tiṇañca kaṭṭhañca udakañca. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi sīghaṁ sīghaṁ gacchatha, mā yoggāni kilamitthā'ti.",
    "dn23:35": "Atha kho so satthavāho satthike āmantesi: 'ayaṁ, bho, puriso evamāha: \"purato kantāre mahāmegho abhippavuṭṭho, āsittodakāni vaṭumāni, bahu tiṇañca kaṭṭhañca udakañca. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi sīghaṁ sīghaṁ gacchatha; mā yoggāni kilamitthā\"ti. Ayaṁ bho puriso neva amhākaṁ mitto, na ñātisālohito, kathaṁ mayaṁ imassa saddhāya gamissāma. Na vo chaḍḍetabbāni purāṇāni tiṇāni kaṭṭhāni udakāni, yathābhatena bhaṇḍena satthaṁ payāpetha. Na no purāṇaṁ chaḍḍessāmā'ti. 'Evaṁ, bho'ti kho te satthikā tassa satthavāhassa paṭissutvā yathābhatena bhaṇḍena satthaṁ payāpesuṁ. Te paṭhamepi satthavāse na addasaṁsu tiṇaṁ vā kaṭṭhaṁ vā udakaṁ vā. Dutiyepi satthavāse … tatiyepi satthavāse … catutthepi satthavāse … pañcamepi satthavāse … chaṭṭhepi satthavāse … sattamepi satthavāse na addasaṁsu tiṇaṁ vā kaṭṭhaṁ vā udakaṁ vā. Tañca satthaṁ addasaṁsu anayabyasanaṁ āpannaṁ. Ye ca tasmiṁ satthepi ahesuṁ manussā vā pasū vā, tesañca aṭṭhikāneva addasaṁsu tena yakkhena amanussena bhakkhitānaṁ.",
    "dn23:36": "Atha kho so satthavāho satthike āmantesi: 'ayaṁ kho, bho, sattho anayabyasanaṁ āpanno, yathā taṁ tena bālena satthavāhena pariṇāyakena. Tena hi, bho, yānamhākaṁ satthe appasārāni paṇiyāni, tāni chaḍḍetvā, yāni imasmiṁ satthe mahāsārāni paṇiyāni, tāni ādiyathā'ti. 'Evaṁ, bho'ti kho te satthikā tassa satthavāhassa paṭissutvā yāni sakasmiṁ satthe appasārāni paṇiyāni, tāni chaḍḍetvā yāni tasmiṁ satthe mahāsārāni paṇiyāni, tāni ādiyitvā sotthinā taṁ kantāraṁ nitthariṁsu, yathā taṁ paṇḍitena satthavāhena pariṇāyakena.",
    "dn23:37": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho nevāhaṁ sakkomi idaṁ pāpakaṁ diṭṭhigataṁ paṭinissajjituṁ. Rājāpi maṁ pasenadi kosalo jānāti tirorājānopi: 'pāyāsi rājañño evaṁvādī evaṁdiṭṭhī: \"itipi natthi paro loko … pe … vipāko\"'ti. Sacāhaṁ, bho kassapa, idaṁ pāpakaṁ diṭṭhigataṁ paṭinissajjissāmi, bhavissanti me vattāro: 'yāva bālo pāyāsi rājañño, abyatto duggahitagāhī'ti. Kopenapi naṁ harissāmi, makkhenapi naṁ harissāmi, palāsenapi naṁ harissāmī\"ti.",
    "dn23:38": "\"Tena hi, rājañña, upamaṁ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Bhūtapubbaṁ, rājañña, aññataro sūkaraposako puriso sakamhā gāmā aññaṁ gāmaṁ agamāsi. Tattha addasa pahūtaṁ sukkhagūthaṁ chaḍḍitaṁ. Disvānassa etadahosi: 'ayaṁ kho pahūto sukkhagūtho chaḍḍito, mama casūkarabhattaṁ; yannūnāhaṁ ito sukkhagūthaṁ hareyyan'ti. So uttarāsaṅgaṁ pattharitvā pahūtaṁ sukkhagūthaṁ ākiritvā bhaṇḍikaṁ bandhitvā sīseubbāhetvāagamāsi. Tassa antarāmagge mahāakālamegho pāvassi. So uggharantaṁ paggharantaṁ yāva agganakhā gūthena makkhito gūthabhāraṁ ādāya agamāsi. Tamenaṁ manussā disvā evamāhaṁsu: 'kacci no tvaṁ, bhaṇe, ummatto, kacci viceto, kathañhi nāma uggharantaṁ paggharantaṁ yāva agganakhā gūthena makkhito gūthabhāraṁ harissasī'ti. 'Tumhe khvettha, bhaṇe, ummattā, tumhe vicetā, tathā hi pana me sūkarabhattan'ti. Evameva kho tvaṁ, rājañña,gūthabhārikūpamomaññe paṭibhāsi. Paṭinissajjetaṁ, rājañña, pāpakaṁ diṭṭhigataṁ. Paṭinissajjetaṁ, rājañña, pāpakaṁ diṭṭhigataṁ. Mā te ahosi dīgharattaṁ ahitāya dukkhāyā\"ti.",
    "dn23:39": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho nevāhaṁ sakkomi idaṁ pāpakaṁ diṭṭhigataṁ paṭinissajjituṁ. Rājāpi maṁ pasenadi kosalo jānāti tirorājānopi: 'pāyāsi rājañño evaṁvādī evaṁdiṭṭhī: \"itipi natthi paro loko … pe … vipāko\"'ti. Sacāhaṁ, bho kassapa, idaṁ pāpakaṁ diṭṭhigataṁ paṭinissajjissāmi, bhavissanti me vattāro: 'yāva bālo pāyāsi rājañño abyatto duggahitagāhī'ti. Kopenapi naṁ harissāmi, makkhenapi naṁ harissāmi, palāsenapi naṁ harissāmī\"ti.",
    "dn23:40": "\"Tena hi, rājañña, upamaṁ te karissāmi, upamāya midhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Bhūtapubbaṁ, rājañña, dve akkhadhuttā akkhehi dibbiṁsu. Eko akkhadhutto āgatāgataṁ kaliṁ gilati. Addasā kho dutiyo akkhadhutto taṁ akkhadhuttaṁ āgatāgataṁ kaliṁ gilantaṁ, disvā taṁ akkhadhuttaṁ etadavoca: 'tvaṁ kho, samma, ekantikena jināsi, dehi me, samma, akkhe pajohissāmī'ti. 'Evaṁ, sammā'ti kho so akkhadhutto tassa akkhadhuttassa akkhe pādāsi. Atha kho so akkhadhutto akkhe visena paribhāvetvā taṁ akkhadhuttaṁ etadavoca: 'ehi kho, samma, akkhehi dibbissāmā'ti. 'Evaṁ, sammā'ti kho so akkhadhutto tassa akkhadhuttassa paccassosi. Dutiyampi kho te akkhadhuttā akkhehi dibbiṁsu. Dutiyampi kho so akkhadhutto āgatāgataṁ kaliṁ gilati. Addasā kho dutiyo akkhadhutto taṁ akkhadhuttaṁ dutiyampi āgatāgataṁ kaliṁ gilantaṁ, disvā taṁ akkhadhuttaṁ etadavoca:",
    "dn23:41": "'Littaṁ paramena tejasā,Gilamakkhaṁ puriso na bujjhati;Gila regila pāpadhuttaka,Pacchāte kaṭukaṁ bhavissatī'ti.",
    "dn23:42": "Evameva kho tvaṁ, rājañña, akkhadhuttakūpamo maññe paṭibhāsi. Paṭinissajjetaṁ, rājañña, pāpakaṁ diṭṭhigataṁ; paṭinissajjetaṁ, rājañña, pāpakaṁ diṭṭhigataṁ. Mā te ahosi dīgharattaṁ ahitāya dukkhāyā\"ti.",
    "dn23:43": "\"Kiñcāpi bhavaṁ kassapo evamāha, atha kho nevāhaṁ sakkomi idaṁ pāpakaṁ diṭṭhigataṁ paṭinissajjituṁ. Rājāpi maṁ pasenadi kosalo jānāti tirorājānopi: 'pāyāsi rājañño evaṁvādī evaṁdiṭṭhī: \"itipi natthi paro loko … pe … vipāko\"'ti. Sacāhaṁ, bho kassapa, idaṁ pāpakaṁ diṭṭhigataṁ paṭinissajjissāmi, bhavissanti me vattāro: 'yāva bālo pāyāsi rājañño abyatto duggahitagāhī'ti. Kopenapi naṁ harissāmi, makkhenapi naṁ harissāmi, palāsenapi naṁ harissāmī\"ti.",
    "dn23:44": "\"Tena hi, rājañña, upamaṁ te karissāmi, upamāya midhekacce viññū purisā bhāsitassa atthaṁ ājānanti. Bhūtapubbaṁ, rājañña, aññataro janapado vuṭṭhāsi. Atha kho sahāyako sahāyakaṁ āmantesi: 'āyāma, samma, yena so janapado tenupasaṅkamissāma, appeva nāmettha kiñci dhanaṁ adhigaccheyyāmā'ti. 'Evaṁ, sammā'ti kho sahāyako sahāyakassa paccassosi. Te yena so janapado, yena aññataraṁgāmapaṭṭaṁtenupasaṅkamiṁsu, tattha addasaṁsu pahūtaṁ sāṇaṁ chaḍḍitaṁ, disvā sahāyako sahāyakaṁ āmantesi: 'idaṁ kho, samma, pahūtaṁ sāṇaṁ chaḍḍitaṁ, tena hi, samma, tvañca sāṇabhāraṁ bandha, ahañca sāṇabhāraṁ bandhissāmi, ubho sāṇabhāraṁ ādāya gamissāmā'ti. 'Evaṁ, sammā'ti kho sahāyako sahāyakassa paṭissutvā sāṇabhāraṁ bandhitvā te ubho sāṇabhāraṁ ādāya yena aññataraṁ gāmapaṭṭaṁ tenupasaṅkamiṁsu. Tattha addasaṁsu pahūtaṁ sāṇasuttaṁ chaḍḍitaṁ, disvā sahāyako sahāyakaṁ āmantesi: 'yassa kho, samma, atthāya iccheyyāma sāṇaṁ, idaṁ pahūtaṁ sāṇasuttaṁ chaḍḍitaṁ. Tena hi, samma, tvañca sāṇabhāraṁ chaḍḍehi, ahañca sāṇabhāraṁ chaḍḍessāmi, ubho sāṇasuttabhāraṁ ādāya gamissāmā'ti. 'Ayaṁ kho me, samma, sāṇabhāro dūrābhato ca susannaddho ca, alaṁ me, tvaṁ pajānāhī'ti. Atha kho so sahāyako sāṇabhāraṁ chaḍḍetvā sāṇasuttabhāraṁ ādiyi.",
    "dn23:45": "Te yena aññataraṁ gāmapaṭṭaṁ tenupasaṅkamiṁsu. Tattha addasaṁsu pahūtā sāṇiyo chaḍḍitā, disvā sahāyako sahāyakaṁ āmantesi: 'yassa kho, samma, atthāya iccheyyāma sāṇaṁ vā sāṇasuttaṁ vā, imā pahūtā sāṇiyo chaḍḍitā. Tena hi, samma, tvañca sāṇabhāraṁ chaḍḍehi, ahañca sāṇasuttabhāraṁ chaḍḍessāmi, ubho sāṇibhāraṁ ādāya gamissāmā'ti. 'Ayaṁ kho me, samma, sāṇabhāro dūrābhato ca susannaddho ca, alaṁ me, tvaṁ pajānāhī'ti. Atha kho so sahāyako sāṇasuttabhāraṁ chaḍḍetvā sāṇibhāraṁ ādiyi.",
    "dn23:46": "Te yena aññataraṁ gāmapaṭṭaṁ tenupasaṅkamiṁsu. Tattha addasaṁsu pahūtaṁ khomaṁ chaḍḍitaṁ, disvā … pe … pahūtaṁ khomasuttaṁ chaḍḍitaṁ, disvā … pahūtaṁ khomadussaṁ chaḍḍitaṁ, disvā … pahūtaṁ kappāsaṁ chaḍḍitaṁ, disvā … pahūtaṁ kappāsikasuttaṁ chaḍḍitaṁ, disvā … pahūtaṁ kappāsikadussaṁ chaḍḍitaṁ, disvā … pahūtaṁayaṁchaḍḍitaṁ, disvā … pahūtaṁ lohaṁ chaḍḍitaṁ, disvā … pahūtaṁ tipuṁ chaḍḍitaṁ, disvā … pahūtaṁ sīsaṁ chaḍḍitaṁ, disvā … pahūtaṁsajjhaṁchaḍḍitaṁ, disvā … pahūtaṁ suvaṇṇaṁ chaḍḍitaṁ, disvā sahāyako sahāyakaṁ āmantesi: 'yassa kho, samma, atthāya iccheyyāma sāṇaṁ vā sāṇasuttaṁ vā sāṇiyo vā khomaṁ vā khomasuttaṁ vā khomadussaṁ vā kappāsaṁ vā kappāsikasuttaṁ vā kappāsikadussaṁ vā ayaṁ vā lohaṁ vā tipuṁ vā sīsaṁ vā sajjhaṁ vā, idaṁ pahūtaṁ suvaṇṇaṁ chaḍḍitaṁ. Tena hi, samma, tvañca sāṇabhāraṁ chaḍḍehi, ahañcasajjhabhāraṁchaḍḍessāmi, ubho suvaṇṇabhāraṁ ādāya gamissāmā'ti. 'Ayaṁ kho me, samma, sāṇabhāro dūrābhato ca susannaddho ca, alaṁ me tvaṁ pajānāhī'ti. Atha kho so sahāyako sajjhabhāraṁ chaḍḍetvā suvaṇṇabhāraṁ ādiyi.",
    "dn23:47": "Te yena sako gāmo tenupasaṅkamiṁsu. Tattha yo so sahāyako sāṇabhāraṁ ādāya agamāsi, tassa neva mātāpitaro abhinandiṁsu, na puttadārā abhinandiṁsu, na mittāmaccā abhinandiṁsu, na ca tatonidānaṁ sukhaṁ somanassaṁ adhigacchi. Yo pana so sahāyako suvaṇṇabhāraṁ ādāya agamāsi, tassa mātāpitaropi abhinandiṁsu, puttadārāpi abhinandiṁsu, mittāmaccāpi abhinandiṁsu, tatonidānañca sukhaṁ somanassaṁ adhigacchi.",
    "dn23:48": "\"Purimeneva ahaṁ opammena bhoto kassapassa attamano abhiraddho. Api cāhaṁ imāni vicitrāni pañhāpaṭibhānāni sotukāmo evāhaṁ bhavantaṁ kassapaṁ paccanīkaṁ kātabbaṁ amaññissaṁ. Abhikkantaṁ, bho kassapa, abhikkantaṁ, bho kassapa. Seyyathāpi, bho kassapa, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: 'cakkhumanto rūpāni dakkhantī'ti; evamevaṁ bhotā kassapena anekapariyāyena dhammo pakāsito. Esāhaṁ, bho kassapa, taṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi, dhammañca, bhikkhusaṅghañca. Upāsakaṁ maṁ bhavaṁ kassapo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gataṁ.",
    "dn23:49": "Icchāmi cāhaṁ, bho kassapa, mahāyaññaṁ yajituṁ, anusāsatu maṁ bhavaṁ kassapo, yaṁ mamassa dīgharattaṁ hitāya sukhāyā\"ti.",
    "dn23:50": "\"Yathārūpe kho, rājañña, yaññe gāvo vā haññanti ajeḷakā vā haññanti, kukkuṭasūkarā vā haññanti, vividhā vā pāṇā saṅghātaṁ āpajjanti, paṭiggāhakā ca honti micchādiṭṭhī micchāsaṅkappā micchāvācā micchākammantā micchāājīvā micchāvāyāmā micchāsatī micchāsamādhī, evarūpo kho, rājañña, yañño na mahapphalo hoti na mahānisaṁso na mahājutiko na mahāvipphāro. Seyyathāpi, rājañña, kassako bījanaṅgalaṁ ādāya vanaṁ paviseyya. So tattha dukkhette dubbhūme avihatakhāṇukaṇṭake bījāni patiṭṭhāpeyya khaṇḍāni pūtīni vātātapahatāni asāradāni asukhasayitāni. Devo ca na kālena kālaṁ sammādhāraṁ anuppaveccheyya. Api nu tāni bījāni vuddhiṁvirūḷhiṁvepullaṁ āpajjeyyuṁ, kassako vā vipulaṁ phalaṁ adhigaccheyyā\"ti? \"Nohidaṁ, bho kassapa\".",
    "dn23:51": "\"Evameva kho, rājañña, yathārūpe yaññe gāvo vā haññanti, ajeḷakā vā haññanti, kukkuṭasūkarā vā haññanti, vividhā vā pāṇā saṅghātaṁ āpajjanti, paṭiggāhakā ca honti micchādiṭṭhī micchāsaṅkappā micchāvācā micchākammantā micchāājīvā micchāvāyāmā micchāsatī micchāsamādhī, evarūpo kho, rājañña, yañño na mahapphalo hoti na mahānisaṁso na mahājutiko na mahāvipphāro.",
    "dn23:52": "Yathārūpe ca kho, rājañña, yaññe neva gāvo haññanti, na ajeḷakā haññanti, na kukkuṭasūkarā haññanti, na vividhā vā pāṇā saṅghātaṁ āpajjanti, paṭiggāhakā ca honti sammādiṭṭhī sammāsaṅkappā sammāvācā sammākammantā sammāājīvā sammāvāyāmā sammāsatī sammāsamādhī, evarūpo kho, rājañña, yañño mahapphalo hoti mahānisaṁso mahājutiko mahāvipphāro. Seyyathāpi, rājañña, kassako bījanaṅgalaṁ ādāya vanaṁ paviseyya. So tattha sukhette subhūme suvihatakhāṇukaṇṭake bījāni patiṭṭhapeyya akhaṇḍāni apūtīni avātātapahatāni sāradāni sukhasayitāni. Devo ca kālena kālaṁ sammādhāraṁ anuppaveccheyya. Api nu tāni bījāni vuddhiṁ virūḷhiṁ vepullaṁ āpajjeyyuṁ, kassako vā vipulaṁ phalaṁ adhigaccheyyā\"ti? \"Evaṁ, bho kassapa\".",
    "dn23:53": "Atha kho pāyāsi rājañño dānaṁ paṭṭhapesi samaṇabrāhmaṇakapaṇaddhikavaṇibbakayācakānaṁ. Tasmiṁ kho pana dāne evarūpaṁ bhojanaṁ dīyati kaṇājakaṁ bilaṅgadutiyaṁ,dhorakānica vatthāniguḷavālakāni. Tasmiṁ kho pana dāne uttaro nāma māṇavovāvaṭoahosi. So dānaṁ datvā evaṁ anuddisati: \"imināhaṁ dānena pāyāsiṁ rājaññameva imasmiṁ loke samāgacchiṁ, mā parasmin\"ti.",
    "dn23:54": "Atha kho pāyāsi rājañño asakkaccaṁ dānaṁ datvā asahatthā dānaṁ datvāacittīkataṁdānaṁ datvā apaviddhaṁ dānaṁ datvā kāyassa bhedā paraṁ maraṇā cātumahārājikānaṁ devānaṁ sahabyataṁ upapajji suññaṁ serīsakaṁ vimānaṁ. Yo pana tassa dāne vāvaṭo ahosi uttaro nāma māṇavo. So sakkaccaṁ dānaṁ datvā sahatthā dānaṁ datvā cittīkataṁ dānaṁ datvā anapaviddhaṁ dānaṁ datvā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajji devānaṁ tāvatiṁsānaṁ sahabyataṁ.",
    "dn23:55": "Tena kho pana samayena āyasmā gavampati abhikkhaṇaṁ suññaṁ serīsakaṁ vimānaṁ divāvihāraṁ gacchati. Atha kho pāyāsi devaputto yenāyasmā gavampati tenupasaṅkami; upasaṅkamitvā āyasmantaṁ gavampatiṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitaṁ kho pāyāsiṁ devaputtaṁ āyasmā gavampati etadavoca: \"kosi tvaṁ, āvuso\"ti? \"Ahaṁ, bhante, pāyāsi rājañño\"ti. \"Nanu tvaṁ, āvuso, evaṁdiṭṭhiko ahosi: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'\"ti? \"Saccāhaṁ, bhante, evaṁdiṭṭhiko ahosiṁ: 'itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko'ti. Api cāhaṁ ayyena kumārakassapena etasmā pāpakā diṭṭhigatā vivecito\"ti. \"Yo pana te, āvuso, dāne vāvaṭo ahosi uttaro nāma māṇavo, so kuhiṁ upapanno\"ti?",
    "dn23:56": "Atha kho āyasmā gavampati manussalokaṁ āgantvā evamārocesi: \"sakkaccaṁ dānaṁ detha, sahatthā dānaṁ detha, cittīkataṁ dānaṁ detha, anapaviddhaṁ dānaṁ detha. Pāyāsi rājañño asakkaccaṁ dānaṁ datvā asahatthā dānaṁ datvā acittīkataṁ dānaṁ datvā apaviddhaṁ dānaṁ datvā kāyassa bhedā paraṁ maraṇā cātumahārājikānaṁ devānaṁ sahabyataṁ upapanno suññaṁ serīsakaṁ vimānaṁ. Yo pana tassa dāne vāvaṭo ahosi uttaro nāma māṇavo, so sakkaccaṁ dānaṁ datvā sahatthā dānaṁ datvā cittīkataṁ dānaṁ datvā anapaviddhaṁ dānaṁ datvā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapanno devānaṁ tāvatiṁsānaṁ sahabyatan\"ti.",
    "dn23:57": "Mahāpadāna nidānaṁ,nibbānañca sudassanaṁ;Janavasabha govindaṁ,samayaṁ sakkapañhakaṁ;Mahāsatipaṭṭhānañca,pāyāsi dasamaṁ bhave."
}