{
    "dn31:1": "Evaṁ me sutaṁ—​ ekaṁ samayaṁ bhagavā rājagahe viharati veḷuvane kalandakanivāpe.",
    "dn31:2": "Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya rājagahaṁ piṇḍāya pāvisi. Addasā kho bhagavā siṅgālakaṁ gahapatiputtaṁ kālasseva vuṭṭhāya rājagahā nikkhamitvā allavatthaṁ allakesaṁ pañjalikaṁ puthudisā namassantaṁ – puratthimaṁ disaṁ dakkhiṇaṁ disaṁ pacchimaṁ disaṁ uttaraṁ disaṁ heṭṭhimaṁ disaṁ uparimaṁ disaṁ. Disvā siṅgālakaṁ gahapatiputtaṁ etadavoca:  \"Kiṁ nu kho tvaṁ, gahapatiputta, kālasseva vuṭṭhāya rājagahā nikkhamitvā allavattho allakeso pañjaliko puthudisā namassasi – puratthimaṁ disaṁ dakkhiṇaṁ disaṁ pacchimaṁ disaṁ uttaraṁ disaṁ heṭṭhimaṁ disaṁ uparimaṁ disan\"ti?",
    "dn31:3": "\"Na kho, gahapatiputta, ariyassa vinaye evaṁ chadisānamassitabbā\"ti.",
    "dn31:4": "\"Tena hi, gahapatiputta, suṇohi sādhukaṁ manasikarohi bhāsissāmī\"ti.",
    "dn31:5": "\"Yato kho, gahapatiputta, ariyasāvakassa cattāro kammakilesā pahīnā honti, catūhi ca ṭhānehi pāpakammaṁ na karoti, cha ca bhogānaṁ apāyamukhāni na sevati, so evaṁ cuddasa pāpakāpagatochaddisāpaṭicchādīubholokavijayāya paṭipanno hoti. Tassa ayañceva loko āraddho hoti paro ca loko. So kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati.",
    "dn31:6": "Katamassa cattāro kammakilesā pahīnā honti? Pāṇātipāto kho, gahapatiputta, kammakileso, adinnādānaṁ kammakileso, kāmesumicchācāro kammakileso, musāvādo kammakileso. Imassa cattāro kammakilesā pahīnā hontī\"ti.",
    "dn31:7": "\"Pāṇātipāto adinnādānaṁ,Musāvādo ca vuccati;Paradāragamanañceva,Nappasaṁsanti paṇḍitā\"ti.",
    "dn31:8": "\"Katamehi catūhi ṭhānehi pāpakammaṁ na karoti? Chandāgatiṁ gacchanto pāpakammaṁ karoti, dosāgatiṁ gacchanto pāpakammaṁ karoti, mohāgatiṁ gacchanto pāpakammaṁ karoti, bhayāgatiṁ gacchanto pāpakammaṁ karoti. Yato kho, gahapatiputta, ariyasāvako neva chandāgatiṁ gacchati, na dosāgatiṁ gacchati, na mohāgatiṁ gacchati, na bhayāgatiṁ gacchati; imehi catūhi ṭhānehi pāpakammaṁ na karotī\"ti.",
    "dn31:9": "\"Chandādosā bhayā mohā,yo dhammaṁ ativattati;Nihīyati yasotassa,kāḷapakkheva candimā.",
    "dn31:10": "Chandā dosā bhayā mohā,yo dhammaṁ nātivattati;Āpūrati yasotassa,sukkapakkhevacandimā\"ti.",
    "dn31:11": "\"Katamāni cha bhogānaṁ apāyamukhāni na sevati? surāmerayamajjappamādaṭṭhānānuyogo kho, gahapatiputta, bhogānaṁ apāyamukhaṁ, vikālavisikhācariyānuyogo bhogānaṁ apāyamukhaṁ, samajjābhicaraṇaṁ bhogānaṁ apāyamukhaṁ, jūtappamādaṭṭhānānuyogo bhogānaṁ apāyamukhaṁ, pāpamittānuyogo bhogānaṁ apāyamukhaṁ,ālasyānuyogobhogānaṁ apāyamukhaṁ.",
    "dn31:12": "Cha khome, gahapatiputta, ādīnavā surāmerayamajjappamādaṭṭhānānuyoge. Sandiṭṭhikādhanajāni, kalahappavaḍḍhanī, rogānaṁ āyatanaṁ, akittisañjananī, kopīnanidaṁsanī, paññāya dubbalikaraṇītveva chaṭṭhaṁ padaṁ bhavati. Ime kho, gahapatiputta, cha ādīnavā surāmerayamajjappamādaṭṭhānānuyoge.",
    "dn31:13": "Cha khome, gahapatiputta, ādīnavā vikālavisikhācariyānuyoge. Attāpissa agutto arakkhito hoti, puttadāropissa agutto arakkhito hoti, sāpateyyampissa aguttaṁ arakkhitaṁ hoti, saṅkiyo ca hoti pāpakesuṭhānesu, abhūtavacanañca tasmiṁ rūhati, bahūnañca dukkhadhammānaṁ purakkhato hoti. Ime kho, gahapatiputta, cha ādīnavā vikālavisikhācariyānuyoge.",
    "dn31:14": "Cha khome, gahapatiputta, ādīnavā samajjābhicaraṇe.Kvanaccaṁ, kva gītaṁ, kva vāditaṁ, kva akkhānaṁ, kva pāṇissaraṁ, kva kumbhathunanti. Ime kho, gahapatiputta, cha ādīnavā samajjābhicaraṇe.",
    "dn31:15": "Cha khome, gahapatiputta, ādīnavā jūtappamādaṭṭhānānuyoge. Jayaṁ veraṁ pasavati, jino vittamanusocati, sandiṭṭhikā dhanajāni,sabhāgatassavacanaṁ na rūhati, mittāmaccānaṁ paribhūto hoti, āvāhavivāhakānaṁ apatthito hoti:  'akkhadhutto ayaṁ purisapuggalo nālaṁ dārabharaṇāyā'ti. Ime kho, gahapatiputta, cha ādīnavā jūtappamādaṭṭhānānuyoge.",
    "dn31:16": "Cha khome, gahapatiputta, ādīnavā pāpamittānuyoge. Ye dhuttā, ye soṇḍā, ye pipāsā, ye nekatikā, ye vañcanikā, ye sāhasikā. Tyāssa mittā honti te sahāyā. Ime kho, gahapatiputta, cha ādīnavā pāpamittānuyoge.",
    "dn31:17": "Cha khome, gahapatiputta, ādīnavā ālasyānuyoge. Atisītanti kammaṁ na karoti, atiuṇhanti kammaṁ na karoti, atisāyanti kammaṁ na karoti, atipātoti kammaṁ na karoti, atichātosmīti kammaṁ na karoti, atidhātosmīti kammaṁ na karoti. Tassa evaṁ kiccāpadesabahulassa viharato anuppannā ceva bhogā nuppajjanti, uppannā ca bhogā parikkhayaṁ gacchanti. Ime kho, gahapatiputta, cha ādīnavā ālasyānuyoge\"ti.",
    "dn31:18": "Idamavoca bhagavā. Idaṁ vatvāna sugato athāparaṁ etadavoca satthā:",
    "dn31:19": "\"Hoti pānasakhā nāma,hoti sammiyasammiyo;Yo ca atthesu jātesu,sahāyo hoti so sakhā.",
    "dn31:20": "Ussūraseyyā paradārasevanā,Verappasavoca anatthatā ca;Pāpā ca mittā sukadariyatā ca,Ete cha ṭhānā purisaṁ dhaṁsayanti.",
    "dn31:21": "Pāpamitto pāpasakho,pāpaācāragocaro;Asmā lokā paramhā ca,ubhayā dhaṁsate naro.",
    "dn31:22": "Akkhitthiyo vāruṇī naccagītaṁ,Divā soppaṁ pāricariyā akāle;Pāpā ca mittā sukadariyatā ca,Ete cha ṭhānā purisaṁ dhaṁsayanti.",
    "dn31:23": "Akkhehi dibbanti suraṁ pivanti,Yantitthiyo pāṇasamā paresaṁ;Nihīnasevī na cavuddhasevī,Nihīyate kāḷapakkheva cando.",
    "dn31:24": "Yo vāruṇī addhano akiñcano,Pipāso pivaṁpapāgato;Udakamiva iṇaṁ vigāhati,Akulaṁkāhiti khippamattano.",
    "dn31:25": "Na divā soppasīlena,rattimuṭṭhānadessinā;Niccaṁ mattena soṇḍena,sakkā āvasituṁ gharaṁ.",
    "dn31:26": "Atisītaṁ atiuṇhaṁ,atisāyamidaṁ ahu;Iti vissaṭṭhakammante,atthā accenti māṇave.",
    "dn31:27": "Yodha sītañca uṇhañca,tiṇā bhiyyo na maññati;Karaṁ purisakiccāni,sosukhaṁna vihāyatī\"ti.",
    "dn31:28": "\"Cattārome, gahapatiputta, amittā mittapatirūpakā veditabbā. Aññadatthuharo amitto mittapatirūpako veditabbo, vacīparamo amitto mittapatirūpako veditabbo, anuppiyabhāṇī amitto mittapatirūpako veditabbo, apāyasahāyo amitto mittapatirūpako veditabbo.",
    "dn31:29": "Catūhi kho, gahapatiputta, ṭhānehi aññadatthuharo amitto mittapatirūpako veditabbo.",
    "dn31:30": "Aññadatthuharo hoti,appena bahumicchati;Bhayassa kiccaṁ karoti,sevati atthakāraṇā.",
    "dn31:31": "Imehi kho, gahapatiputta, catūhi ṭhānehi aññadatthuharo amitto mittapatirūpako veditabbo.",
    "dn31:32": "Catūhi kho, gahapatiputta, ṭhānehi vacīparamo amitto mittapatirūpako veditabbo. Atītenapaṭisantharati, anāgatena paṭisantharati, niratthakena saṅgaṇhāti, paccuppannesu kiccesu byasanaṁ dasseti. Imehi kho, gahapatiputta, catūhi ṭhānehi vacīparamo amitto mittapatirūpako veditabbo.",
    "dn31:33": "Catūhi kho, gahapatiputta, ṭhānehi anuppiyabhāṇī amitto mittapatirūpako veditabbo.Pāpakampissaanujānāti, kalyāṇampissa anujānāti, sammukhāssa vaṇṇaṁ bhāsati, parammukhāssa avaṇṇaṁ bhāsati. Imehi kho, gahapatiputta, catūhi ṭhānehi anuppiyabhāṇī amitto mittapatirūpako veditabbo.",
    "dn31:34": "Catūhi kho, gahapatiputta, ṭhānehi apāyasahāyo amitto mittapatirūpako veditabbo. Surāmerayamajjappamādaṭṭhānānuyoge sahāyo hoti, vikālavisikhācariyānuyoge sahāyo hoti, samajjābhicaraṇe sahāyo hoti, jūtappamādaṭṭhānānuyoge sahāyo hoti. Imehi kho, gahapatiputta, catūhi ṭhānehi apāyasahāyo amitto mittapatirūpako veditabbo\"ti.",
    "dn31:35": "Idamavoca bhagavā. Idaṁ vatvāna sugato athāparaṁ etadavoca satthā:",
    "dn31:36": "\"Aññadatthuharo mitto,yo ca mittovacīparo;Anuppiyañca yo āha,apāyesu ca yo sakhā.",
    "dn31:37": "Ete amitte cattāro,iti viññāya paṇḍito;Ārakā parivajjeyya,maggaṁ paṭibhayaṁ yathā\"ti.",
    "dn31:38": "\"Cattārome, gahapatiputta, mittā suhadā veditabbā.Upakāromitto suhado veditabbo, samānasukhadukkho mitto suhado veditabbo, atthakkhāyī mitto suhado veditabbo, anukampako mitto suhado veditabbo.",
    "dn31:39": "Catūhi kho, gahapatiputta, ṭhānehi upakāro mitto suhado veditabbo. Pamattaṁ rakkhati, pamattassa sāpateyyaṁ rakkhati, bhītassa saraṇaṁ hoti, uppannesu kiccakaraṇīyesu taddiguṇaṁ bhogaṁ anuppadeti. Imehi kho, gahapatiputta, catūhi ṭhānehi upakāro mitto suhado veditabbo.",
    "dn31:40": "Catūhi kho, gahapatiputta, ṭhānehi samānasukhadukkho mitto suhado veditabbo. Guyhamassa ācikkhati, guyhamassa parigūhati, āpadāsu na vijahati, jīvitaṁpissa atthāya pariccattaṁ hoti. Imehi kho, gahapatiputta, catūhi ṭhānehi samānasukhadukkho mitto suhado veditabbo.",
    "dn31:41": "Catūhi kho, gahapatiputta, ṭhānehi atthakkhāyī mitto suhado veditabbo. Pāpā nivāreti, kalyāṇe niveseti, assutaṁ sāveti, saggassa maggaṁ ācikkhati. Imehi kho, gahapatiputta, catūhi ṭhānehi atthakkhāyī mitto suhado veditabbo.",
    "dn31:42": "Catūhi kho, gahapatiputta, ṭhānehi anukampako mitto suhado veditabbo. Abhavenassa na nandati, bhavenassa nandati, avaṇṇaṁ bhaṇamānaṁ nivāreti, vaṇṇaṁ bhaṇamānaṁ pasaṁsati. Imehi kho, gahapatiputta, catūhi ṭhānehi anukampako mitto suhado veditabbo\"ti.",
    "dn31:43": "Idamavoca bhagavā. Idaṁ vatvāna sugato athāparaṁ etadavoca satthā:",
    "dn31:44": "\"Upakāro ca yo mitto,sukhedukkheca yosakhā;Atthakkhāyī ca yo mitto,yo ca mittānukampako.",
    "dn31:45": "Etepi mitte cattāro,iti viññāya paṇḍito;Sakkaccaṁ payirupāseyya,mātā puttaṁva orasaṁ;Paṇḍito sīlasampanno,jalaṁ aggīva bhāsati.",
    "dn31:46": "Bhoge saṁharamānassa,bhamarasseva irīyato;Bhogā sannicayaṁ yanti,vammikovupacīyati.",
    "dn31:47": "Evaṁ bhogesamāhatvā,alamatto kule gihī;Catudhā vibhaje bhoge,sa ve mittāni ganthati.",
    "dn31:48": "Ekena bhoge bhuñjeyya,dvīhi kammaṁ payojaye;Catutthañca nidhāpeyya,āpadāsu bhavissatī\"ti.",
    "dn31:49": "\"Kathañca, gahapatiputta, ariyasāvako chaddisāpaṭicchādī hoti? Cha imā, gahapatiputta, disā veditabbā. Puratthimā disā mātāpitaro veditabbā, dakkhiṇā disā ācariyā veditabbā, pacchimā disā puttadārā veditabbā, uttarā disā mittāmaccā veditabbā, heṭṭhimā disā dāsakammakarā veditabbā, uparimā disā samaṇabrāhmaṇā veditabbā.",
    "dn31:50": "Pañcahi kho, gahapatiputta, ṭhānehi puttena puratthimā disā mātāpitaro paccupaṭṭhātabbā – bhatonebharissāmi, kiccaṁ nesaṁ karissāmi, kulavaṁsaṁ ṭhapessāmi, dāyajjaṁ paṭipajjāmi, atha vā pana petānaṁ kālaṅkatānaṁ dakkhiṇaṁ anuppadassāmīti.",
    "dn31:51": "Pañcahi kho, gahapatiputta, ṭhānehi antevāsinā dakkhiṇā disā ācariyā paccupaṭṭhātabbā – uṭṭhānena upaṭṭhānenasussusāyapāricariyāya sakkaccaṁsippapaṭiggahaṇena.",
    "dn31:52": "Pañcahi kho, gahapatiputta, ṭhānehi sāmikena pacchimā disā bhariyā paccupaṭṭhātabbā – sammānanāyaanavamānanāyaanaticariyāya issariyavossaggena alaṅkārānuppadānena.",
    "dn31:53": "Pañcahi kho, gahapatiputta, ṭhānehi kulaputtena uttarā disā mittāmaccā paccupaṭṭhātabbā – dānenapeyyavajjenakho, gahapatiputta, pañcahi ṭhānehi kulaputtena uttarā disā mittāmaccā paccupaṭṭhitā pañcahi ṭhānehi kulaputtaṁ anukampanti – pamattaṁ rakkhanti, pamattassa sāpateyyaṁ rakkhanti, bhītassa saraṇaṁ honti, āpadāsu na vijahanti, aparapajā cassa paṭipūjenti.",
    "dn31:54": "Pañcahi kho, gahapatiputta, ṭhānehiayyirakenaheṭṭhimā disā dāsakammakarā paccupaṭṭhātabbā – yathābalaṁ kammantasaṁvidhānena bhattavetanānuppadānena gilānupaṭṭhānena acchariyānaṁ rasānaṁ saṁvibhāgena samaye vossaggena.",
    "dn31:55": "Pañcahi kho, gahapatiputta, ṭhānehi kulaputtena uparimā disā samaṇabrāhmaṇā paccupaṭṭhātabbā – mettena kāyakammena mettena vacīkammena mettena manokammena anāvaṭadvāratāya āmisānuppadānena.",
    "dn31:56": "Idamavoca bhagavā. Idaṁ vatvāna sugato athāparaṁ etadavoca satthā:",
    "dn31:57": "\"Mātāpitā disā pubbā,ācariyā dakkhiṇā disā;Puttadārā disā pacchā,mittāmaccā ca uttarā.",
    "dn31:58": "Dāsakammakarā heṭṭhā,uddhaṁ samaṇabrāhmaṇā;Etā disā namasseyya,alamatto kule gihī.",
    "dn31:59": "Paṇḍito sīlasampanno,saṇho ca paṭibhānavā;Nivātavutti atthaddho,tādiso labhate yasaṁ.",
    "dn31:60": "Uṭṭhānako analaso,āpadāsu na vedhati;Acchinnavutti medhāvī,tādiso labhate yasaṁ.",
    "dn31:61": "Saṅgāhako mittakaro,vadaññū vītamaccharo;Netā vinetā anunetā,tādiso labhate yasaṁ.",
    "dn31:62": "Dānañcapeyyavajjañca,atthacariyā ca yā idha;Samānattatā ca dhammesu,tattha tattha yathārahaṁ;Ete kho saṅgahā loke,rathassāṇīva yāyato.",
    "dn31:63": "Ete ca saṅgahā nāssu,na mātā puttakāraṇā;Labhetha mānaṁ pūjaṁ vā,pitā vā puttakāraṇā.",
    "dn31:64": "Yasmā casaṅgahāete,sammapekkhantipaṇḍitā;Tasmā mahattaṁ papponti,pāsaṁsā ca bhavanti te\"ti.",
    "dn31:65": "Evaṁ vutte, siṅgālako gahapatiputto bhagavantaṁ etadavoca:"
}