{
    "dn3:1": "Evaṁ me sutaṁ—​ ekaṁ samayaṁ bhagavā kosalesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi yena icchānaṅgalaṁ nāma kosalānaṁ brāhmaṇagāmo tadavasari. Tatra sudaṁ bhagavā icchānaṅgale viharati icchānaṅgalavanasaṇḍe.",
    "dn3:2": "Tena kho pana samayena brāhmaṇopokkharasātiukkaṭṭhaṁ ajjhāvasati sattussadaṁ satiṇakaṭṭhodakaṁ sadhaññaṁ rājabhoggaṁ raññā pasenadinā kosalena dinnaṁ rājadāyaṁ brahmadeyyaṁ.",
    "dn3:3": "Tena kho pana samayena brāhmaṇassa pokkharasātissa ambaṭṭho nāma māṇavo antevāsī hoti ajjhāyako mantadharo tiṇṇaṁvedānaṁpāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo anuññātapaṭiññāto sake ācariyake tevijjake pāvacane: \"yamahaṁ jānāmi taṁ tvaṁ jānāsi; yaṁ tvaṁ jānāsi tamahaṁ jānāmī\"ti.",
    "dn3:4": "Atha kho brāhmaṇo pokkharasāti ambaṭṭhaṁ māṇavaṁ āmantesi: \"Ayaṁ, tāta ambaṭṭha, samaṇo gotamo sakyaputto sakyakulā pabbajito kosalesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi icchānaṅgalaṁ anuppatto icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: 'itipi so bhagavā, arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ, sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. Sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī'ti. Ehi tvaṁ, tāta ambaṭṭha, yena samaṇo gotamo tenupasaṅkama; upasaṅkamitvā samaṇaṁ gotamaṁ jānāhi, yadi vā taṁ bhavantaṁ gotamaṁ tathāsantaṁyeva saddo abbhuggato, yadi vā no tathā. Yadi vā so bhavaṁ gotamo tādiso, yadi vā na tādiso, tathā mayaṁ taṁ bhavantaṁ gotamaṁ vedissāmā\"ti.",
    "dn3:5": "\"Yathā kathaṁ panāhaṁ, bho, taṁ bhavantaṁ gotamaṁ jānissāmi: 'yadi vā taṁ bhavantaṁ gotamaṁ tathāsantaṁyeva saddo abbhuggato, yadi vā no tathā.",
    "dn3:6": "\"Āgatāni kho, tāta ambaṭṭha, amhākaṁ mantesu dvattiṁsa mahāpurisalakkhaṇāni, yehi samannāgatassa mahāpurisassa dveyeva gatiyo bhavanti anaññā. Sace agāraṁ ajjhāvasati, rājā hoti cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni satta ratanāni bhavanti. Seyyathidaṁ—cakkaratanaṁ, hatthiratanaṁ, assaratanaṁ, maṇiratanaṁ, itthiratanaṁ, gahapatiratanaṁ, pariṇāyakaratanameva sattamaṁ. Parosahassaṁ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṁ pathaviṁ sāgarapariyantaṁ adaṇḍena asatthena dhammena abhivijiya ajjhāvasati. Sace kho pana agārasmā anagāriyaṁ pabbajati, arahaṁ hoti sammāsambuddho loke vivaṭṭacchado. Ahaṁ kho pana, tāta ambaṭṭha, mantānaṁ dātā; tvaṁ mantānaṁ paṭiggahetā\"ti.",
    "dn3:7": "\"Evaṁ, bho\"ti kho ambaṭṭho māṇavo brāhmaṇassa pokkharasātissa paṭissutvā uṭṭhāyāsanā brāhmaṇaṁ pokkharasātiṁ abhivādetvā padakkhiṇaṁ katvā vaḷavārathamāruyha sambahulehi māṇavakehi saddhiṁ yena icchānaṅgalavanasaṇḍo tena pāyāsi. Yāvatikā yānassa bhūmi yānena gantvā yānā paccorohitvā pattikova ārāmaṁ pāvisi.",
    "dn3:8": "Atha kho tesaṁ bhikkhūnaṁ etadahosi: \"Ayaṁ kho ambaṭṭho māṇavo abhiññātakolañño ceva abhiññātassa ca brāhmaṇassa pokkharasātissa antevāsī. Agaru kho pana bhagavato evarūpehi kulaputtehi saddhiṁ kathāsallāpo hotī\"ti. Te ambaṭṭhaṁ māṇavaṁ etadavocuṁ: \"eso, ambaṭṭha, vihāro saṁvutadvāro, tena appasaddo upasaṅkamitvā ataramāno āḷindaṁ pavisitvā ukkāsitvā aggaḷaṁ ākoṭehi, vivarissati te bhagavā dvāran\"ti.",
    "dn3:9": "Atha kho ambaṭṭho māṇavo yena so vihāro saṁvutadvāro, tena appasaddo upasaṅkamitvā ataramāno āḷindaṁ pavisitvā ukkāsitvā aggaḷaṁ ākoṭesi. Vivari bhagavā dvāraṁ. Pāvisi ambaṭṭho māṇavo. Māṇavakāpi pavisitvā bhagavatā saddhiṁ sammodiṁsu, sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ambaṭṭho pana māṇavo caṅkamantopi nisinnena bhagavatākañci kañcikathaṁ sāraṇīyaṁ vītisāreti, ṭhitopi nisinnena bhagavatā kañci kañci kathaṁ sāraṇīyaṁ vītisāreti.",
    "dn3:10": "Atha kho bhagavā ambaṭṭhaṁ māṇavaṁ etadavoca: \"evaṁ nu te, ambaṭṭha, brāhmaṇehi vuddhehi mahallakehi ācariyapācariyehi saddhiṁ kathāsallāpo hoti, yathayidaṁ caraṁ tiṭṭhaṁ nisinnena mayā kiñci kiñci kathaṁ sāraṇīyaṁ vītisāretī\"ti?",
    "dn3:11": "\"No hidaṁ, bho gotama. Gacchanto vā hi, bho gotama, gacchantena brāhmaṇo brāhmaṇena saddhiṁ sallapitumarahati, ṭhito vā hi, bho gotama, ṭhitena brāhmaṇo brāhmaṇena saddhiṁ sallapitumarahati, nisinno vā hi, bho gotama, nisinnena brāhmaṇo brāhmaṇena saddhiṁ sallapitumarahati, sayāno vā hi, bho gotama, sayānena brāhmaṇo brāhmaṇena saddhiṁ sallapitumarahati. Ye ca kho te, bho gotama, muṇḍakā samaṇakā ibbhākaṇhābandhupādāpaccā, tehipi me saddhiṁ evaṁ kathāsallāpo hoti, yathariva bhotā gotamenā\"ti.",
    "dn3:12": "Atha kho ambaṭṭho māṇavo bhagavatā avusitavādena vuccamāno kupito anattamano bhagavantaṁyeva khuṁsento bhagavantaṁyeva vambhento bhagavantaṁyeva upavadamāno: \"Samaṇo ca me bho gotamo pāpito bhavissatī\"ti bhagavantaṁ etadavoca: \"caṇḍā, bho gotama, sakyajāti; pharusā, bho gotama, sakyajāti; lahusā, bho gotama, sakyajāti; bhassā, bho gotama, sakyajāti; ibbhā santā ibbhā samānā na brāhmaṇe sakkaronti, na brāhmaṇegaruṁ karonti, na brāhmaṇe mānenti, na brāhmaṇe pūjenti, na brāhmaṇe apacāyanti. Tayidaṁ, bho gotama, nacchannaṁ, tayidaṁ nappatirūpaṁ, yadime sakyā ibbhā santā ibbhā samānā na brāhmaṇe sakkaronti, na brāhmaṇe garuṁ karonti, na brāhmaṇe mānenti, na brāhmaṇe pūjenti, na brāhmaṇe apacāyantī\"ti.",
    "dn3:13": "\"Kiṁ pana te, ambaṭṭha, sakyā aparaddhun\"ti?",
    "dn3:14": "\"Laṭukikāpi kho, ambaṭṭha, sakuṇikā sake kulāvake kāmalāpinī hoti. Sakaṁ kho panetaṁ, ambaṭṭha, sakyānaṁ yadidaṁ kapilavatthuṁ, nārahatāyasmā ambaṭṭho imāya appamattāya abhisajjitun\"ti.",
    "dn3:15": "Atha kho bhagavato etadahosi: \"atibāḷhaṁ kho ayaṁ ambaṭṭho māṇavo sakyesu ibbhavādena nimmādeti, yannūnāhaṁ gottaṁ puccheyyan\"ti. Atha kho bhagavā ambaṭṭhaṁ māṇavaṁ etadavoca:",
    "dn3:16": "Bhūtapubbaṁ, ambaṭṭha, rājā okkāko yā sā mahesī piyā manāpā, tassā puttassa rajjaṁ pariṇāmetukāmo jeṭṭhakumāre raṭṭhasmā pabbājesi—okkāmukhaṁkarakaṇḍaṁhatthinikaṁsinisūraṁ. Te raṭṭhasmā pabbājitā himavantapasse pokkharaṇiyā tīre mahāsākasaṇḍo, tattha vāsaṁ kappesuṁ. Te jātisambhedabhayā sakāhi bhaginīhi saddhiṁ saṁvāsaṁ kappesuṁ.",
    "dn3:17": "Atha kho, ambaṭṭha, rājā okkāko amacce pārisajje āmantesi: 'kahaṁ nu kho, bho, etarahi kumārā sammantī'ti?",
    "dn3:18": "Rañño kho pana, ambaṭṭha, okkākassa disā nāma dāsī ahosi. Sākaṇhaṁ nāmajanesi. Jāto kaṇho pabyāhāsi: 'dhovatha maṁ, amma, nahāpetha maṁ amma, imasmā maṁ asucismā parimocetha, atthāya vo bhavissāmī'ti.",
    "dn3:19": "Evaṁ vutte, te māṇavakā bhagavantaṁ etadavocuṁ: \"mā bhavaṁ gotamo ambaṭṭhaṁ atibāḷhaṁ dāsiputtavādena nimmādesi. Sujāto ca, bho gotama, ambaṭṭho māṇavo, kulaputto ca ambaṭṭho māṇavo, bahussuto ca ambaṭṭho māṇavo, kalyāṇavākkaraṇo ca ambaṭṭho māṇavo, paṇḍito ca ambaṭṭho māṇavo, pahoti ca ambaṭṭho māṇavo bhotā gotamena saddhiṁ asmiṁ vacane paṭimantetun\"ti.",
    "dn3:20": "Atha kho bhagavā te māṇavake etadavoca: \"Sace kho tumhākaṁ māṇavakānaṁ evaṁ hoti: 'dujjāto ca ambaṭṭho māṇavo, akulaputto ca ambaṭṭho māṇavo, appassuto ca ambaṭṭho māṇavo, akalyāṇavākkaraṇo ca ambaṭṭho māṇavo, duppañño ca ambaṭṭho māṇavo, na ca pahoti ambaṭṭho māṇavo samaṇena gotamena saddhiṁ asmiṁ vacane paṭimantetun'ti, tiṭṭhatu ambaṭṭho māṇavo, tumhe mayā saddhiṁmantavhoasmiṁ vacane. Sace pana tumhākaṁ māṇavakānaṁ evaṁ hoti: 'sujāto ca ambaṭṭho māṇavo, kulaputto ca ambaṭṭho māṇavo, bahussuto ca ambaṭṭho māṇavo, kalyāṇavākkaraṇo ca ambaṭṭho māṇavo, paṇḍito ca ambaṭṭho māṇavo, pahoti ca ambaṭṭho māṇavo samaṇena gotamena saddhiṁ asmiṁ vacane paṭimantetun'ti, tiṭṭhatha tumhe; ambaṭṭho māṇavo mayā saddhiṁ paṭimantetū\"ti.",
    "dn3:21": "\"Sujāto ca, bho gotama, ambaṭṭho māṇavo, kulaputto ca ambaṭṭho māṇavo, bahussuto ca ambaṭṭho māṇavo, kalyāṇavākkaraṇo ca ambaṭṭho māṇavo, paṇḍito ca ambaṭṭho māṇavo, pahoti ca ambaṭṭho māṇavo bhotā gotamena saddhiṁ asmiṁ vacane paṭimantetuṁ, tuṇhī mayaṁ bhavissāma, ambaṭṭho māṇavo bhotā gotamena saddhiṁ asmiṁ vacane paṭimantetū\"ti.",
    "dn3:22": "Atha kho bhagavā ambaṭṭhaṁ māṇavaṁ etadavoca: \"Ayaṁ kho pana te, ambaṭṭha, sahadhammiko pañho āgacchati, akāmā byākātabbo. Sace tvaṁ na byākarissasi, aññena vā aññaṁ paṭicarissasi, tuṇhī vā bhavissasi, pakkamissasi vā ettheva te sattadhā muddhā phalissati. Taṁ kiṁ maññasi, ambaṭṭha, kinti te sutaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ kutopabhutikā kaṇhāyanā, ko ca kaṇhāyanānaṁ pubbapuriso\"ti?",
    "dn3:23": "Evaṁ vutte, ambaṭṭho māṇavo tuṇhī ahosi. Dutiyampi kho bhagavā ambaṭṭhaṁ māṇavaṁ etadavoca: \"taṁ kiṁ maññasi, ambaṭṭha, kinti te sutaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ kutopabhutikā kaṇhāyanā, ko ca kaṇhāyanānaṁ pubbapuriso\"ti? Dutiyampi kho ambaṭṭho māṇavo tuṇhī ahosi. Atha kho bhagavā ambaṭṭhaṁ māṇavaṁ etadavoca: \"byākarohi dāni, ambaṭṭha, na dāni, te tuṇhībhāvassa kālo. Yo kho, ambaṭṭha, tathāgatena yāvatatiyakaṁ sahadhammikaṁ pañhaṁ puṭṭho na byākaroti, etthevassa sattadhā muddhā phalissatī\"ti.",
    "dn3:24": "Tena kho pana samayena vajirapāṇī yakkho mahantaṁ ayokūṭaṁ ādāya ādittaṁ sampajjalitaṁsajotibhūtaṁambaṭṭhassa māṇavassa upari vehāsaṁ ṭhito hoti: \"sacāyaṁ ambaṭṭho māṇavo bhagavatā yāvatatiyakaṁ sahadhammikaṁ pañhaṁ puṭṭho na byākarissati, etthevassa sattadhā muddhaṁ phālessāmī\"ti. Taṁ kho pana vajirapāṇiṁ yakkhaṁ bhagavā ceva passati ambaṭṭho ca māṇavo.",
    "dn3:25": "Atha kho ambaṭṭho māṇavo bhīto saṁviggo lomahaṭṭhajāto bhagavantaṁyeva tāṇaṁ gavesī bhagavantaṁyeva leṇaṁ gavesī bhagavantaṁyeva saraṇaṁ gavesī upanisīditvā bhagavantaṁ etadavoca: \"kimetaṁbhavaṁ gotamo āha? Punabhavaṁ gotamobravitū\"ti.",
    "dn3:26": "\"Taṁ kiṁ maññasi, ambaṭṭha, kinti te sutaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ kutopabhutikā kaṇhāyanā, ko ca kaṇhāyanānaṁ pubbapuriso\"ti?",
    "dn3:27": "Evaṁ vutte, te māṇavakā unnādino uccāsaddamahāsaddā ahesuṁ: \"dujjāto kira, bho, ambaṭṭho māṇavo; akulaputto kira, bho, ambaṭṭho māṇavo; dāsiputto kira, bho, ambaṭṭho māṇavo sakyānaṁ. Ayyaputtā kira, bho, ambaṭṭhassa māṇavassa sakyā bhavanti. Dhammavādiṁyeva kira mayaṁ samaṇaṁ gotamaṁ apasādetabbaṁ amaññimhā\"ti.",
    "dn3:28": "Atha kho bhagavato etadahosi: \"atibāḷhaṁ kho ime māṇavakā ambaṭṭhaṁ māṇavaṁ dāsiputtavādena nimmādenti, yannūnāhaṁ parimoceyyan\"ti. Atha kho bhagavā te māṇavake etadavoca: \"Mā kho tumhe, māṇavakā, ambaṭṭhaṁ māṇavaṁ atibāḷhaṁ dāsiputtavādena nimmādetha. Uḷāro so kaṇho isi ahosi. So dakkhiṇajanapadaṁ gantvā brahmamante adhīyitvā rājānaṁ okkākaṁ upasaṅkamitvā maddarūpiṁ dhītaraṁ yāci. Tassa rājā okkāko: 'ko nevaṁ re ayaṁ mayhaṁ dāsiputto samāno maddarūpiṁ dhītaraṁ yācatī'ti, kupito anattamano khurappaṁsannayhi. So taṁ khurappaṁ neva asakkhi muñcituṁ, no paṭisaṁharituṁ.",
    "dn3:29": "Atha kho, māṇavakā, amaccā pārisajjā kaṇhaṁ isiṁ upasaṅkamitvā etadavocuṁ: 'sotthi,bhaddante, hotu rañño; sotthi, bhaddante, hotu rañño'ti.",
    "dn3:30": "Atha kho bhagavā ambaṭṭhaṁ māṇavaṁ āmantesi: \"taṁ kiṁ maññasi, ambaṭṭha, idha khattiyakumāro brāhmaṇakaññāya saddhiṁ saṁvāsaṁ kappeyya, tesaṁ saṁvāsamanvāya putto jāyetha. Yo so khattiyakumārena brāhmaṇakaññāya putto uppanno, api nu so labhetha brāhmaṇesu āsanaṁ vā udakaṁ vā\"ti?",
    "dn3:31": "\"Taṁ kiṁ maññasi, ambaṭṭha, idha brāhmaṇakumāro khattiyakaññāya saddhiṁ saṁvāsaṁ kappeyya, tesaṁ saṁvāsamanvāya putto jāyetha. Yo so brāhmaṇakumārena khattiyakaññāya putto uppanno, api nu so labhetha brāhmaṇesu āsanaṁ vā udakaṁ vā\"ti?",
    "dn3:32": "\"Iti kho, ambaṭṭha, itthiyā vā itthiṁ karitvā purisena vā purisaṁ karitvā khattiyāva seṭṭhā, hīnā brāhmaṇā.",
    "dn3:33": "\"Taṁ kiṁ maññasi, ambaṭṭha, idha khattiyā khattiyaṁ kismiñcideva pakaraṇe khuramuṇḍaṁ karitvā bhassapuṭena vadhitvā raṭṭhā vā nagarā vā pabbājeyyuṁ. Api nu so labhetha brāhmaṇesu āsanaṁ vā udakaṁ vā\"ti?",
    "dn3:34": "\"Ettāvatā kho, ambaṭṭha, khattiyo paramanihīnataṁ patto hoti, yadeva naṁ khattiyā khuramuṇḍaṁ karitvā bhassapuṭena vadhitvā raṭṭhā vā nagarā vā pabbājenti. Iti kho, ambaṭṭha, yadā khattiyo paramanihīnataṁ patto hoti, tadāpi khattiyāva seṭṭhā, hīnā brāhmaṇā.",
    "dn3:35": "'Khattiyo seṭṭho janetasmiṁ,ye gottapaṭisārino;Vijjācaraṇasampanno,so seṭṭho devamānuse'ti.",
    "dn3:36": "Sā kho panesā, ambaṭṭha, brahmunā sanaṅkumārena gāthā sugītā no duggītā, subhāsitā no dubbhāsitā, atthasaṁhitā no anatthasaṁhitā, anumatā mayā. Ahampi hi, ambaṭṭha, evaṁ vadāmi –",
    "dn3:37": "Khattiyo seṭṭho janetasmiṁ,ye gottapaṭisārino;Vijjācaraṇasampanno,so seṭṭho devamānuse\"ti.",
    "dn3:38": "\"Katamaṁ pana taṁ, bho gotama, caraṇaṁ, katamā ca pana sā vijjā\"ti?",
    "dn3:39": "\"Katamaṁ pana taṁ, bho gotama, caraṇaṁ, katamā ca sā vijjā\"ti?",
    "dn3:40": "So vivicceva kāmehi, vivicca akusalehi dhammehi, savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati … pe … idampissa hoti caraṇasmiṁ.",
    "dn3:41": "Puna caparaṁ, ambaṭṭha, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati … pe … idampissa hoti caraṇasmiṁ.",
    "dn3:42": "Puna caparaṁ, ambaṭṭha, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: 'upekkhako satimā sukhavihārī'ti, tatiyaṁ jhānaṁ upasampajja viharati … pe … idampissa hoti caraṇasmiṁ.",
    "dn3:43": "Puna caparaṁ, ambaṭṭha, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati … pe … idampissa hoti caraṇasmiṁ. Idaṁ kho taṁ, ambaṭṭha, caraṇaṁ.",
    "dn3:44": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṁ abhinīharati abhininnāmeti … pe … idampissa hoti vijjāya … pe … nāparaṁ itthattāyāti pajānāti, idampissa hoti vijjāya. Ayaṁ kho sā, ambaṭṭha, vijjā.",
    "dn3:45": "Ayaṁ vuccati, ambaṭṭha, bhikkhu 'vijjāsampanno' itipi, 'caraṇasampanno' itipi, 'vijjācaraṇasampanno' itipi. Imāya ca, ambaṭṭha, vijjāsampadāya caraṇasampadāya ca aññā vijjāsampadā ca caraṇasampadā ca uttaritarā vā paṇītatarā vā natthi.",
    "dn3:46": "Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya cattāri apāyamukhāni bhavanti. Katamāni cattāri?",
    "dn3:47": "Puna caparaṁ, ambaṭṭha, idhekacco samaṇo vā brāhmaṇo vā imañceva anuttaraṁ vijjācaraṇasampadaṁ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamānokudālapiṭakaṁādāya araññavanaṁ ajjhogāhati: 'kandamūlaphalabhojano bhavissāmī'ti. So aññadatthu vijjācaraṇasampannasseva paricārako sampajjati. Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya idaṁ dutiyaṁ apāyamukhaṁ bhavati.",
    "dn3:48": "Puna caparaṁ, ambaṭṭha, idhekacco samaṇo vā brāhmaṇo vā imañceva anuttaraṁ vijjācaraṇasampadaṁ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamānokandamūlaphalabhojanatañcaanabhisambhuṇamāno gāmasāmantaṁ vā nigamasāmantaṁ vā agyāgāraṁ karitvā aggiṁ paricaranto acchati. So aññadatthu vijjācaraṇasampannasseva paricārako sampajjati. Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya idaṁ tatiyaṁ apāyamukhaṁ bhavati.",
    "dn3:49": "Puna caparaṁ, ambaṭṭha, idhekacco samaṇo vā brāhmaṇo vā imaṁ ceva anuttaraṁ vijjācaraṇasampadaṁ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kandamūlaphalabhojanatañca anabhisambhuṇamāno aggipāricariyañca anabhisambhuṇamāno cātumahāpathe catudvāraṁ agāraṁ karitvā acchati: 'yo imāhi catūhi disāhi āgamissati samaṇo vā brāhmaṇo vā, tamahaṁ yathāsatti yathābalaṁ paṭipūjessāmī'ti. So aññadatthu vijjācaraṇasampannasseva paricārako sampajjati. Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya idaṁ catutthaṁ apāyamukhaṁ bhavati.",
    "dn3:50": "Taṁ kiṁ maññasi, ambaṭṭha, api nu tvaṁ imāya anuttarāya vijjācaraṇasampadāya sandissasi sācariyako\"ti?",
    "dn3:51": "\"Taṁ kiṁ maññasi, ambaṭṭha, api nu tvaṁ imañceva anuttaraṁ vijjācaraṇasampadaṁ anabhisambhuṇamāno khārividhamādāya araññavanamajjhogāhasi sācariyako: 'pavattaphalabhojano bhavissāmī'\"ti?",
    "dn3:52": "\"Taṁ kiṁ maññasi, ambaṭṭha, api nu tvaṁ imañceva anuttaraṁ vijjācaraṇasampadaṁ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kudālapiṭakaṁ ādāya araññavanamajjhogāhasi sācariyako: 'kandamūlaphalabhojano bhavissāmī'\"ti?",
    "dn3:53": "\"Taṁ kiṁ maññasi, ambaṭṭha, api nu tvaṁ imañceva anuttaraṁ vijjācaraṇasampadaṁ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kandamūlaphalabhojanatañca anabhisambhuṇamāno gāmasāmantaṁ vā nigamasāmantaṁ vā agyāgāraṁ karitvā aggiṁ paricaranto acchasi sācariyako\"ti?",
    "dn3:54": "\"Taṁ kiṁ maññasi, ambaṭṭha, api nu tvaṁ imañceva anuttaraṁ vijjācaraṇasampadaṁ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kandamūlaphalabhojanatañca anabhisambhuṇamāno aggipāricariyañca anabhisambhuṇamāno cātumahāpathe catudvāraṁ agāraṁ karitvā acchasi sācariyako: 'yo imāhi catūhi disāhi āgamissati samaṇo vā brāhmaṇo vā, taṁ mayaṁ yathāsatti yathābalaṁ paṭipūjessāmā'\"ti?",
    "dn3:55": "\"Iti kho, ambaṭṭha, imāya ceva tvaṁ anuttarāya vijjācaraṇasampadāya parihīno sācariyako. Ye cime anuttarāya vijjācaraṇasampadāya cattāri apāyamukhāni bhavanti, tato ca tvaṁ parihīno sācariyako. Bhāsitā kho pana te esā, ambaṭṭha, ācariyena brāhmaṇena pokkharasātinā vācā: 'ke ca muṇḍakā samaṇakā ibbhā kaṇhā bandhupādāpaccā, kā ca tevijjānaṁ brāhmaṇānaṁ sākacchā'ti attanā āpāyikopi aparipūramāno. Passa, ambaṭṭha, yāva aparaddhañca te idaṁ ācariyassa brāhmaṇassa pokkharasātissa.",
    "dn3:56": "Brāhmaṇo kho pana, ambaṭṭha, pokkharasāti rañño pasenadissa kosalassa dattikaṁ bhuñjati. Tassa rājā pasenadi kosalo sammukhībhāvampi na dadāti. Yadāpi tena manteti, tirodussantena manteti. Yassa kho pana, ambaṭṭha, dhammikaṁ payātaṁ bhikkhaṁ paṭiggaṇheyya, kathaṁ tassa rājā pasenadi kosalo sammukhībhāvampi na dadeyya. Passa, ambaṭṭha, yāva aparaddhañca te idaṁ ācariyassa brāhmaṇassa pokkharasātissa.",
    "dn3:57": "Taṁ kiṁ maññasi, ambaṭṭha, idha rājā pasenadi kosalo hatthigīvāya vā nisinno assapiṭṭhe vā nisinno rathūpatthare vā ṭhito uggehi vā rājaññehi vā kiñcideva mantanaṁ manteyya. So tamhā padesā apakkamma ekamantaṁ tiṭṭheyya. Atha āgaccheyya suddo vā suddadāso vā, tasmiṁ padese ṭhito tadeva mantanaṁ manteyya: 'evampi rājā pasenadi kosalo āha, evampi rājā pasenadi kosalo āhā'ti. Api nu so rājabhaṇitaṁ vā bhaṇati rājamantanaṁ vā manteti? Ettāvatā so assa rājā vā rājamatto vā\"ti?",
    "dn3:58": "\"Evameva kho tvaṁ, ambaṭṭha, ye te ahesuṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti tadanubhāsanti bhāsitamanubhāsanti vācitamanuvācenti, seyyathidaṁ— aṭṭhako vāmako vāmadevo vessāmittoyamataggiaṅgīraso bhāradvājo vāseṭṭho kassapo bhagu: 'tyāhaṁ mante adhiyāmi sācariyako'ti, tāvatā tvaṁ bhavissasi isi vā isitthāya vā paṭipannoti netaṁ\nṭhānaṁ vijjati.",
    "dn3:59": "Taṁ kiṁ maññasi, ambaṭṭha, kinti te sutaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ—ye te ahesuṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti tadanubhāsanti bhāsitamanubhāsanti vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, evaṁ su te sunhātā suvilittā kappitakesamassūāmukkamaṇikuṇḍalābharaṇāodātavatthavasanā pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārenti, seyyathāpi tvaṁ etarahi sācariyako\"ti?",
    "dn3:60": "\" … pe … Evaṁ su te sālīnaṁ odanaṁ sucimaṁsūpasecanaṁ vicitakāḷakaṁ anekasūpaṁ anekabyañjanaṁ paribhuñjanti, seyyathāpi tvaṁ etarahi sācariyako\"ti?",
    "dn3:61": "\" … pe … Evaṁ su te veṭhakanatapassāhi nārīhi paricārenti, seyyathāpi tvaṁ etarahi sācariyako\"ti?",
    "dn3:62": "\" … pe … Evaṁ su te kuttavālehi vaḷavārathehi dīghāhi patodalaṭṭhīhi vāhane vitudentā vipariyāyanti, seyyathāpi tvaṁ etarahi sācariyako\"ti?",
    "dn3:63": "\" … pe … Evaṁ su te ukkiṇṇaparikhāsu okkhittapalighāsu nagarūpakārikāsudīghāsivudhehipurisehi rakkhāpenti, seyyathāpi tvaṁ etarahi sācariyako\"ti?",
    "dn3:64": "\"Iti kho, ambaṭṭha, neva tvaṁ isi na isitthāya paṭipanno sācariyako. Yassa kho pana, ambaṭṭha, mayi kaṅkhā vā vimati vā so maṁ pañhena, ahaṁ veyyākaraṇena sodhissāmī\"ti.",
    "dn3:65": "Atha kho bhagavā vihārā nikkhamma caṅkamaṁ abbhuṭṭhāsi. Ambaṭṭhopi māṇavo vihārā nikkhamma caṅkamaṁ abbhuṭṭhāsi. Atha kho ambaṭṭho māṇavo bhagavantaṁ caṅkamantaṁ anucaṅkamamāno bhagavato kāye dvattiṁsamahāpurisalakkhaṇāni samannesi. Addasā kho ambaṭṭho māṇavo bhagavato kāye dvattiṁsamahāpurisalakkhaṇāni yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati—kosohite ca vatthaguyhe pahūtajivhatāya ca.",
    "dn3:66": "Atha kho bhagavato etadahosi: \"passati kho me ayaṁ ambaṭṭho māṇavo dvattiṁsamahāpurisalakkhaṇāni yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati – kosohite ca vatthaguyhe pahūtajivhatāya cā\"ti. Atha kho bhagavā tathārūpaṁ iddhābhisaṅkhāraṁ abhisaṅkhāsi. Yathā addasa ambaṭṭho māṇavo bhagavato kosohitaṁ vatthaguyhaṁ. Atha kho bhagavā jivhaṁ ninnāmetvā ubhopi kaṇṇasotāni anumasi paṭimasi, ubhopi nāsikasotāni anumasi paṭimasi, kevalampi nalāṭamaṇḍalaṁ jivhāya chādesi. Atha kho ambaṭṭhassa māṇavassa etadahosi:",
    "dn3:67": "Tena kho pana samayena brāhmaṇo pokkharasāti ukkaṭṭhāya nikkhamitvā mahatā brāhmaṇagaṇena saddhiṁ sake ārāme nisinno hoti ambaṭṭhaṁyeva māṇavaṁ paṭimānento. Atha kho ambaṭṭho māṇavo yena sako ārāmo tena pāyāsi. Yāvatikā yānassa bhūmi, yānena gantvā yānā paccorohitvā pattikova yena brāhmaṇo pokkharasāti tenupasaṅkami; upasaṅkamitvā brāhmaṇaṁ pokkharasātiṁ abhivādetvā ekamantaṁ nisīdi.",
    "dn3:68": "Ekamantaṁ nisinnaṁ kho ambaṭṭhaṁ māṇavaṁ brāhmaṇo pokkharasāti etadavoca:",
    "dn3:69": "Evaṁ vutte, brāhmaṇo pokkharasāti ambaṭṭhaṁ māṇavaṁ etadavoca: \"aho vata re amhākaṁ, paṇḍitaka, aho vata re amhākaṁ, bahussutaka, aho vata re amhākaṁ,tevijjaka, evarūpena kira, bho, puriso atthacarakena kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyya. Yadeva kho tvaṁ, ambaṭṭha, taṁ bhavantaṁ gotamaṁ evaṁ āsajja āsajja avacāsi, atha kho so bhavaṁ gotamo amhepi evaṁ upaneyya upaneyya avaca. Aho vata re amhākaṁ, paṇḍitaka, aho vata re amhākaṁ, bahussutaka, aho vata re amhākaṁ, tevijjaka, evarūpena kira, bho, puriso atthacarakena kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyyā\"ti,kupitoanattamano ambaṭṭhaṁ māṇavaṁ padasāyeva pavattesi. Icchati ca tāvadeva bhagavantaṁ dassanāya upasaṅkamituṁ.",
    "dn3:70": "Atha kho te brāhmaṇā brāhmaṇaṁ pokkharasātiṁ etadavocuṁ: \"ativikālo kho, bho, ajja samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ.Svedānibhavaṁ pokkharasāti samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī\"ti.",
    "dn3:71": "Ekamantaṁ nisinno kho brāhmaṇo pokkharasāti bhagavantaṁ etadavoca:",
    "dn3:72": "Atha kho brāhmaṇo pokkharasāti bhagavato kāye dvattiṁsamahāpurisalakkhaṇāni samannesi. Addasā kho brāhmaṇo pokkharasāti bhagavato kāye dvattiṁsamahāpurisalakkhaṇāni yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati—kosohite ca vatthaguyhe pahūtajivhatāya ca.",
    "dn3:73": "Atha kho bhagavato etadahosi: \"passati kho me ayaṁ brāhmaṇo pokkharasāti dvattiṁsamahāpurisalakkhaṇāni yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati – kosohite ca vatthaguyhe pahūtajivhatāya cā\"ti. Atha kho bhagavā tathārūpaṁ iddhābhisaṅkhāraṁ abhisaṅkhāsi yathā addasa brāhmaṇo pokkharasāti bhagavato kosohitaṁ vatthaguyhaṁ. Atha kho bhagavā jivhaṁ ninnāmetvā ubhopi kaṇṇasotāni anumasi paṭimasi, ubhopi nāsikasotāni anumasi paṭimasi, kevalampi nalāṭamaṇḍalaṁ jivhāya chādesi.",
    "dn3:74": "Atha kho brāhmaṇassa pokkharasātissa etadahosi: \"samannāgato kho samaṇo gotamo dvattiṁsamahāpurisalakkhaṇehi paripuṇṇehi no aparipuṇṇehī\"ti. Bhagavantaṁ etadavoca: \"adhivāsetu me bhavaṁ gotamo ajjatanāya bhattaṁ saddhiṁ bhikkhusaṅghenā\"ti. Adhivāsesi bhagavā tuṇhībhāvena.",
    "dn3:75": "Atha kho brāhmaṇo pokkharasāti bhagavato adhivāsanaṁ viditvā bhagavato kālaṁ ārocesi: \"kālo, bho gotama, niṭṭhitaṁ bhattan\"ti. Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya saddhiṁ bhikkhusaṅghena yena brāhmaṇassa pokkharasātissa nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho brāhmaṇo pokkharasāti bhagavantaṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi, māṇavakāpi bhikkhusaṅghaṁ. Atha kho brāhmaṇo pokkharasāti bhagavantaṁ bhuttāviṁ onītapattapāṇiṁ aññataraṁ nīcaṁ āsanaṁ gahetvā ekamantaṁ nisīdi.",
    "dn3:76": "Ekamantaṁ nisinnassa kho brāhmaṇassa pokkharasātissa bhagavā anupubbiṁ kathaṁ kathesi, seyyathidaṁ—dānakathaṁ sīlakathaṁ saggakathaṁ; kāmānaṁ ādīnavaṁ okāraṁ saṅkilesaṁ, nekkhamme ānisaṁsaṁ pakāsesi. Yadā bhagavā aññāsi brāhmaṇaṁ pokkharasātiṁ kallacittaṁ muducittaṁ vinīvaraṇacittaṁ udaggacittaṁ pasannacittaṁ, atha yā buddhānaṁ sāmukkaṁsikā dhammadesanā, taṁ pakāsesi – dukkhaṁ samudayaṁ nirodhaṁ maggaṁ. Seyyathāpi nāma suddhaṁ vatthaṁ apagatakāḷakaṁ sammadeva rajanaṁ paṭiggaṇheyya; evameva brāhmaṇassa pokkharasātissa tasmiññeva āsane virajaṁ vītamalaṁ dhammacakkhuṁ udapādi: \"yaṁ kiñci samudayadhammaṁ sabbaṁ taṁ nirodhadhamman\"ti.",
    "dn3:77": "Atha kho brāhmaṇo pokkharasāti diṭṭhadhammo pattadhammo viditadhammo pariyogāḷhadhammo tiṇṇavicikiccho vigatakathaṁkatho vesārajjappatto aparappaccayo satthusāsane bhagavantaṁ etadavoca:"
}