{
    "dn9:1": "Evaṁ me sutaṁ—​ ekaṁ samayaṁ bhagavā sāvatthiyaṁ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena poṭṭhapādo paribbājako samayappavādake tindukācīre ekasālake mallikāya ārāme paṭivasati mahatiyā paribbājakaparisāya saddhiṁ tiṁsamattehi paribbājakasatehi. Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya sāvatthiṁ piṇḍāya pāvisi.",
    "dn9:2": "Atha kho bhagavato etadahosi: \"atippago kho tāva sāvatthiyaṁ piṇḍāya carituṁ. Yannūnāhaṁ yena samayappavādako tindukācīro ekasālako mallikāya ārāmo, yena poṭṭhapādo paribbājako tenupasaṅkameyyan\"ti. Atha kho bhagavā yena samayappavādako tindukācīro ekasālako mallikāya ārāmo tenupasaṅkami.",
    "dn9:3": "Tena kho pana samayena poṭṭhapādo paribbājako mahatiyā paribbājakaparisāya saddhiṁ nisinno hoti unnādiniyā uccāsaddamahāsaddāya anekavihitaṁ tiracchānakathaṁ kathentiyā. Seyyathidaṁ—rājakathaṁ corakathaṁ mahāmattakathaṁ senākathaṁ bhayakathaṁ yuddhakathaṁ annakathaṁ pānakathaṁ vatthakathaṁ sayanakathaṁ mālākathaṁ gandhakathaṁ ñātikathaṁ yānakathaṁ gāmakathaṁ nigamakathaṁ nagarakathaṁ janapadakathaṁ itthikathaṁ sūrakathaṁ visikhākathaṁ kumbhaṭṭhānakathaṁ pubbapetakathaṁ nānattakathaṁ lokakkhāyikaṁ samuddakkhāyikaṁ itibhavābhavakathaṁ iti vā.",
    "dn9:4": "Addasā kho poṭṭhapādo paribbājako bhagavantaṁ dūratova āgacchantaṁ; disvāna sakaṁ parisaṁ saṇṭhapesi: \"appasaddā bhonto hontu, mā bhonto saddamakattha. Ayaṁ samaṇo gotamo āgacchati. Appasaddakāmo kho so āyasmā appasaddassa vaṇṇavādī. Appeva nāma appasaddaṁ parisaṁ viditvā upasaṅkamitabbaṁ maññeyyā\"ti. Evaṁ vutte, te paribbājakā tuṇhī ahesuṁ.",
    "dn9:5": "Atha kho bhagavā yena poṭṭhapādo paribbājako tenupasaṅkami. Atha kho poṭṭhapādo paribbājako bhagavantaṁ etadavoca: \"etu kho, bhante, bhagavā. Svāgataṁ, bhante, bhagavato. Cirassaṁ kho, bhante, bhagavā imaṁ pariyāyamakāsi, yadidaṁ idhāgamanāya. Nisīdatu, bhante, bhagavā, idaṁ āsanaṁ paññattan\"ti.",
    "dn9:6": "Nisīdi bhagavā paññatte āsane. Poṭṭhapādopi kho paribbājako aññataraṁ nīcaṁ āsanaṁ gahetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho poṭṭhapādaṁ paribbājakaṁ bhagavā etadavoca: \"kāya nuttha, poṭṭhapāda, etarahi kathāya sannisinnā, kā ca pana vo antarākathā vippakatā\"ti?",
    "dn9:7": "Evaṁ vutte, poṭṭhapādo paribbājako bhagavantaṁ etadavoca: \"tiṭṭhatesā, bhante, kathā, yāya mayaṁ etarahi kathāya sannisinnā. Nesā, bhante, kathā bhagavato dullabhā bhavissati pacchāpi savanāya. Purimāni, bhante, divasāni purimatarāni, nānātitthiyānaṁ samaṇabrāhmaṇānaṁ kotūhalasālāya sannisinnānaṁ sannipatitānaṁ abhisaññānirodhe kathā udapādi: 'kathaṁ nu kho, bho, abhisaññānirodho hotī'ti? Tatrekacce evamāhaṁsu: 'ahetū appaccayā purisassa saññā uppajjantipi nirujjhantipi. Yasmiṁ samaye uppajjanti, saññī tasmiṁ samaye hoti. Yasmiṁ samaye nirujjhanti, asaññī tasmiṁ samaye hotī'ti. Ittheke abhisaññānirodhaṁ paññapenti.(1)",
    "dn9:8": "Tamañño evamāha: 'na khopana metaṁ, bho, evaṁ bhavissati. Saññā hi, bho, purisassa attā. Sā ca kho upetipi apetipi. Yasmiṁ samaye upeti, saññī tasmiṁ samaye hoti. Yasmiṁ samaye apeti, asaññī tasmiṁ samaye hotī'ti. Ittheke abhisaññānirodhaṁ paññapenti.(2)",
    "dn9:9": "Tamañño evamāha: 'na kho pana metaṁ, bho, evaṁ bhavissati. Santi hi, bho, samaṇabrāhmaṇā mahiddhikā mahānubhāvā. Te imassa purisassa saññaṁ upakaḍḍhantipi apakaḍḍhantipi. Yasmiṁ samaye upakaḍḍhanti, saññī tasmiṁ samaye hoti. Yasmiṁ samaye apakaḍḍhanti, asaññī tasmiṁ samaye hotī'ti. Ittheke abhisaññānirodhaṁ paññapenti.(3)",
    "dn9:10": "Tamañño evamāha: 'na kho pana metaṁ, bho, evaṁ bhavissati. Santi hi, bho, devatā mahiddhikā mahānubhāvā. Tā imassa purisassa saññaṁ upakaḍḍhantipi apakaḍḍhantipi. Yasmiṁ samaye upakaḍḍhanti, saññī tasmiṁ samaye hoti. Yasmiṁ samaye apakaḍḍhanti, asaññī tasmiṁ samaye hotī'ti. Ittheke abhisaññānirodhaṁ paññapenti.(4)",
    "dn9:11": "Tassa mayhaṁ, bhante, bhagavantaṁyeva ārabbha sati udapādi: 'aho nūna bhagavā, aho nūna sugato, yo imesaṁ dhammānaṁ sukusalo'ti. Bhagavā, bhante, kusalo, bhagavā pakataññū abhisaññānirodhassa. Kathaṁ nu kho, bhante, abhisaññānirodho hotī\"ti?",
    "dn9:12": "\"Tatra, poṭṭhapāda, ye te samaṇabrāhmaṇā evamāhaṁsu: 'ahetū appaccayā purisassa saññā uppajjantipi nirujjhantipī'ti, āditova tesaṁ aparaddhaṁ. Taṁ kissa hetu? Sahetū hi, poṭṭhapāda, sappaccayā purisassa saññā uppajjantipi nirujjhantipi. Sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati.",
    "dn9:13": "Kā ca sikkhā\"ti? Bhagavā avoca. \"Idha, poṭṭhapāda, tathāgato loke uppajjati arahaṁ, sammāsambuddho… pe …Evaṁ kho, poṭṭhapāda, bhikkhu sīlasampanno hoti … pe … tassime pañcanīvaraṇe pahīne attani samanupassato pāmojjaṁ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṁ vedeti, sukhino cittaṁ samādhiyati. So vivicceva kāmehi, vivicca akusalehi dhammehi, savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. Tassa yā purimā kāmasaññā, sā nirujjhati. Vivekajapītisukhasukhumasaccasaññā tasmiṁ samaye hoti, vivekajapītisukhasukhumasaccasaññīyeva tasmiṁ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayaṁ sikkhā\"ti bhagavā avoca.",
    "dn9:14": "\"Puna caparaṁ, poṭṭhapāda, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. Tassa yā purimā vivekajapītisukhasukhumasaccasaññā, sā nirujjhati. Samādhijapītisukhasukhumasaccasaññā tasmiṁ samaye hoti, samādhijapītisukhasukhumasaccasaññīyeva tasmiṁ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā\"ti bhagavā avoca.",
    "dn9:15": "\"Puna caparaṁ, poṭṭhapāda, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: 'upekkhako satimā sukhavihārī'ti, tatiyaṁ jhānaṁ upasampajja viharati. Tassa yā purimā samādhijapītisukhasukhumasaccasaññā, sā nirujjhati. Upekkhāsukhasukhumasaccasaññā tasmiṁ samaye hoti, upekkhāsukhasukhumasaccasaññīyeva tasmiṁ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā\"ti bhagavā avoca.",
    "dn9:16": "\"Puna caparaṁ, poṭṭhapāda, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. Tassa yā purimā upekkhāsukhasukhumasaccasaññā, sā nirujjhati. Adukkhamasukhasukhumasaccasaññā tasmiṁ samaye hoti, adukkhamasukhasukhumasaccasaññīyeva tasmiṁ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā\"ti bhagavā avoca.",
    "dn9:17": "\"Puna caparaṁ, poṭṭhapāda, bhikkhu sabbaso rūpasaññānaṁ samatikkamā paṭighasaññānaṁ atthaṅgamā nānattasaññānaṁ amanasikārā 'ananto ākāso'ti ākāsānañcāyatanaṁ upasampajja viharati. Tassa yāpurimā rūpasaññā, sā nirujjhati. Ākāsānañcāyatanasukhumasaccasaññā tasmiṁ samaye hoti, ākāsānañcāyatanasukhumasaccasaññīyeva tasmiṁ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā\"ti bhagavā avoca.",
    "dn9:18": "\"Puna caparaṁ, poṭṭhapāda, bhikkhu sabbaso ākāsānañcāyatanaṁ samatikkamma 'anantaṁ viññāṇan'ti viññāṇañcāyatanaṁ upasampajja viharati. Tassa yā purimā ākāsānañcāyatanasukhumasaccasaññā, sā nirujjhati. Viññāṇañcāyatanasukhumasaccasaññā tasmiṁ samaye hoti, viññāṇañcāyatanasukhumasaccasaññīyeva tasmiṁ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā\"ti bhagavā avoca.",
    "dn9:19": "\"Puna caparaṁ, poṭṭhapāda, bhikkhu sabbaso viññāṇañcāyatanaṁ samatikkamma 'natthi kiñcī'ti ākiñcaññāyatanaṁ upasampajja viharati. Tassa yā purimā viññāṇañcāyatanasukhumasaccasaññā, sā nirujjhati. Ākiñcaññāyatanasukhumasaccasaññā tasmiṁ samaye hoti, ākiñcaññāyatanasukhumasaccasaññīyeva tasmiṁ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā\"ti bhagavā avoca.",
    "dn9:20": "\"Yato kho, poṭṭhapāda, bhikkhu idha sakasaññī hoti, so tato amutra tato amutra anupubbena saññaggaṁ phusati. Tassa saññagge ṭhitassa evaṁ hoti: 'cetayamānassa me pāpiyo, acetayamānassa me seyyo. Ahañceva kho pana ceteyyaṁ, abhisaṅkhareyyaṁ, imā ca me saññā nirujjheyyuṁ, aññā ca oḷārikā saññā uppajjeyyuṁ; yannūnāhaṁ na ceva ceteyyaṁ na ca abhisaṅkhareyyan'ti. So na ceva ceteti, na ca abhisaṅkharoti. Tassa acetayato anabhisaṅkharoto tā ceva saññā nirujjhanti, aññā ca oḷārikā saññā na uppajjanti. So nirodhaṁ phusati. Evaṁ kho, poṭṭhapāda, anupubbābhisaññānirodhasampajānasamāpatti hoti.",
    "dn9:21": "Taṁ kiṁ maññasi, poṭṭhapāda, api nu te ito pubbe evarūpā anupubbābhisaññānirodhasampajānasamāpatti sutapubbā\"ti? \"No hetaṁ, bhante. Evaṁ kho ahaṁ, bhante, bhagavato bhāsitaṁ ājānāmi: 'yato kho, poṭṭhapāda, bhikkhu idha sakasaññī hoti, so tato amutra tato amutra anupubbena saññaggaṁ phusati, tassa saññagge ṭhitassa evaṁ hoti: \"cetayamānassa me pāpiyo, acetayamānassa me seyyo. Ahañceva kho pana ceteyyaṁ abhisaṅkhareyyaṁ, imā ca me saññā nirujjheyyuṁ, aññā ca oḷārikā saññā uppajjeyyuṁ; yannūnāhaṁ na ceva ceteyyaṁ, na ca abhisaṅkhareyyan\"ti. So na ceva ceteti, na cābhisaṅkharoti, tassa acetayato anabhisaṅkharoto tā ceva saññā nirujjhanti, aññā ca oḷārikā saññā na uppajjanti. So nirodhaṁ phusati. Evaṁ kho, poṭṭhapāda, anupubbābhisaññānirodhasampajānasamāpatti hotī'\"ti. \"Evaṁ, poṭṭhapādā\"ti.",
    "dn9:22": "\"Ekaññeva nu kho, bhante, bhagavā saññaggaṁ paññapeti, udāhu puthūpi saññagge paññapetī\"ti? \"Ekampi kho ahaṁ, poṭṭhapāda, saññaggaṁ paññapemi, puthūpi saññagge paññapemī\"ti. \"Yathā kathaṁ pana, bhante, bhagavā ekampi saññaggaṁ paññapeti, puthūpi saññagge paññapetī\"ti? \"Yathā yathā kho, poṭṭhapāda, nirodhaṁ phusati tathā tathāhaṁ saññaggaṁ paññapemi. Evaṁ kho ahaṁ, poṭṭhapāda, ekampi saññaggaṁ paññapemi, puthūpi saññagge paññapemī\"ti.",
    "dn9:23": "\"Saññā nu kho, bhante, paṭhamaṁ uppajjati, pacchā ñāṇaṁ, udāhu ñāṇaṁ paṭhamaṁ uppajjati, pacchā saññā, udāhu saññā ca ñāṇañca apubbaṁ acarimaṁ uppajjantī\"ti? \"Saññā kho, poṭṭhapāda, paṭhamaṁ uppajjati, pacchā ñāṇaṁ, saññuppādā ca pana ñāṇuppādo hoti. So evaṁ pajānāti: 'idappaccayā kira me ñāṇaṁ udapādī'ti. Iminā kho etaṁ, poṭṭhapāda, pariyāyena veditabbaṁ—yathā saññā paṭhamaṁ uppajjati, pacchā ñāṇaṁ, saññuppādā ca pana ñāṇuppādo hotī\"ti.",
    "dn9:24": "\"Saññā nu kho, bhante, purisassa attā, udāhu aññā saññā añño attā\"ti? \"Kaṁ pana tvaṁ, poṭṭhapāda, attānaṁ paccesī\"ti? \"Oḷārikaṁ kho ahaṁ, bhante, attānaṁ paccemi rūpiṁ cātumahābhūtikaṁkabaḷīkārāhārabhakkhan\"ti. \"Oḷāriko ca hi te, poṭṭhapāda, attā abhavissa rūpī cātumahābhūtiko kabaḷīkārāhārabhakkho. Evaṁ santaṁ kho te, poṭṭhapāda, aññāva saññā bhavissati añño attā. Tadamināpetaṁ, poṭṭhapāda, pariyāyena veditabbaṁ yathā aññāva saññā bhavissati añño attā.Tiṭṭhateva sāyaṁ, poṭṭhapāda, oḷāriko attā rūpī cātumahābhūtiko kabaḷīkārāhārabhakkho, atha imassa purisassa aññā ca saññā uppajjanti, aññā ca saññā nirujjhanti. Iminā kho etaṁ, poṭṭhapāda, pariyāyena veditabbaṁ yathā aññāva saññā bhavissati añño attā\"ti.",
    "dn9:25": "\"Manomayaṁ kho ahaṁ, bhante, attānaṁ paccemi sabbaṅgapaccangiṁ ahīnindriyan\"ti. \"Manomayo ca hi te, poṭṭhapāda, attā abhavissa sabbaṅgapaccangī ahīnindriyo, evaṁ santampi kho te, poṭṭhapāda, aññāva saññā bhavissati añño attā. Tadamināpetaṁ, poṭṭhapāda, pariyāyena veditabbaṁ yathā aññāva saññā bhavissati añño attā. Tiṭṭhateva sāyaṁ, poṭṭhapāda, manomayo attā sabbaṅgapaccangī ahīnindriyo, atha imassa purisassa aññā ca saññā uppajjanti, aññā ca saññā nirujjhanti. Imināpi kho etaṁ, poṭṭhapāda, pariyāyena veditabbaṁ yathā aññāva saññā bhavissati añño attā\"ti.",
    "dn9:26": "\"Arūpiṁ kho ahaṁ, bhante, attānaṁ paccemi saññāmayan\"ti. \"Arūpī ca hi te, poṭṭhapāda, attā abhavissa saññāmayo, evaṁ santampi kho te, poṭṭhapāda, aññāva saññā bhavissati añño attā. Tadamināpetaṁ, poṭṭhapāda, pariyāyena veditabbaṁ yathā aññāva saññā bhavissati añño attā. Tiṭṭhateva sāyaṁ, poṭṭhapāda, arūpī attā saññāmayo, atha imassa purisassa aññā ca saññā uppajjanti, aññā ca saññā nirujjhanti. Imināpi kho etaṁ, poṭṭhapāda, pariyāyena veditabbaṁ yathā aññāva saññā bhavissati añño attā\"ti.",
    "dn9:27": "\"Sakkā panetaṁ, bhante, mayā ñātuṁ: 'saññā purisassa attā'ti vā 'aññāva saññā añño attā'ti vā\"ti? \"Dujjānaṁ khoetaṁ, poṭṭhapāda, tayā aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena: 'saññā purisassa attā'ti vā, 'aññāva saññā añño attāti' vā\"ti.",
    "dn9:28": "\"Sacetaṁ, bhante, mayā dujjānaṁ aññadiṭṭhikena aññakhantikena aññarucikenaaññatrāyogenaaññatrācariyakena: 'saññā purisassa attā'ti vā, 'aññāva saññā añño attā'ti vā; kiṁ pana, bhante, 'sassato loko, idameva saccaṁ moghamaññan'\"ti? \"Abyākataṁ kho etaṁ, poṭṭhapāda, mayā: 'sassato loko, idameva saccaṁ moghamaññan'\"ti.",
    "dn9:29": "\"Kiṁ pana, bhante, 'asassato loko, idameva saccaṁ moghamaññan'\"ti? \"Etampi kho, poṭṭhapāda, mayā abyākataṁ: 'asassato loko, idameva saccaṁ moghamaññan'\"ti.",
    "dn9:30": "\"Kiṁ pana, bhante, 'antavā loko … pe … 'anantavā loko … 'taṁ jīvaṁ taṁ sarīraṁ … 'aññaṁ jīvaṁ aññaṁ sarīraṁ … 'hoti tathāgato paraṁ maraṇā … 'na hoti tathāgato paraṁ maraṇā … 'hoti ca na ca hoti tathāgato paraṁ maraṇā … 'neva hoti na na hoti tathāgato paraṁ maraṇā, idameva saccaṁ moghamaññan'\"ti? \"Etampi kho, poṭṭhapāda, mayā abyākataṁ: 'neva hoti na na hoti tathāgato paraṁ maraṇā, idameva saccaṁ moghamaññan'\"ti.",
    "dn9:31": "\"Kasmā panetaṁ, bhante, bhagavatā abyākatan\"ti? \"Na hetaṁ, poṭṭhapāda, atthasaṁhitaṁ na dhammasaṁhitaṁ nādibrahmacariyakaṁ, na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṁvattati, tasmā etaṁ mayā abyākatan\"ti.",
    "dn9:32": "\"Kiṁ pana, bhante, bhagavatā byākatan\"ti? \"Idaṁ dukkhanti kho, poṭṭhapāda, mayā byākataṁ. Ayaṁ dukkhasamudayoti kho, poṭṭhapāda, mayā byākataṁ. Ayaṁ dukkhanirodhoti kho, poṭṭhapāda, mayā byākataṁ. Ayaṁ dukkhanirodhagāminī paṭipadāti kho, poṭṭhapāda, mayā byākatan\"ti.",
    "dn9:33": "\"Kasmā panetaṁ, bhante, bhagavatā byākatan\"ti? \"Etañhi, poṭṭhapāda, atthasaṁhitaṁ, etaṁ dhammasaṁhitaṁ, etaṁ ādibrahmacariyakaṁ, etaṁ nibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattati; tasmā etaṁ mayā byākatan\"ti.",
    "dn9:34": "Atha kho te paribbājakā acirapakkantassa bhagavato poṭṭhapādaṁ paribbājakaṁ samantatovācāsannitodakena sañjhabbharimakaṁsu: \"evameva panāyaṁ bhavaṁ poṭṭhapādo yaññadeva samaṇo gotamo bhāsati, taṁ tadevassa abbhanumodati: 'evametaṁ, bhagavā, evametaṁ, sugatā'ti. Na kho pana mayaṁ kiñci samaṇassa gotamassa ekaṁsikaṁ dhammaṁ desitaṁ ājānāma: 'sassato loko'ti vā, 'asassato loko'ti vā, 'antavā loko'ti vā, 'anantavā loko'ti vā, 'taṁ jīvaṁ taṁ sarīran'ti vā, 'aññaṁ jīvaṁ aññaṁ sarīran'ti vā, 'hoti tathāgato paraṁ maraṇā'ti vā, 'na hoti tathāgato paraṁ maraṇā'ti vā, 'hoti ca na ca hoti tathāgato paraṁ maraṇā'ti vā, 'neva hoti na na hoti tathāgato paraṁ maraṇā'ti vā\"ti.",
    "dn9:35": "Evaṁ vutte, poṭṭhapādo paribbājako te paribbājake etadavoca: \"ahampi kho, bho, na kiñci samaṇassa gotamassa ekaṁsikaṁ dhammaṁ desitaṁ ājānāmi: 'sassato loko'ti vā, 'asassato loko'ti vā … pe … 'neva hoti na na hoti tathāgato paraṁ maraṇā'ti vā; api ca samaṇo gotamo bhūtaṁ tacchaṁ tathaṁ paṭipadaṁ paññapeti dhammaṭṭhitataṁ dhammaniyāmataṁ. Bhūtaṁ kho pana tacchaṁ tathaṁ paṭipadaṁ paññapentassa dhammaṭṭhitataṁ dhammaniyāmataṁ, kathañhi nāma mādiso viññū samaṇassa gotamassa subhāsitaṁ subhāsitato nābbhanumodeyyā\"ti?",
    "dn9:36": "Atha kho dvīhatīhassa accayena citto ca hatthisāriputto poṭṭhapādo ca paribbājako yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā citto hatthisāriputto bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Poṭṭhapādo pana paribbājako bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho poṭṭhapādo paribbājako bhagavantaṁ etadavoca: \"tadā maṁ, bhante, te paribbājakā acirapakkantassa bhagavato samantato vācāsannitodakena sañjhabbharimakaṁsu: 'evameva panāyaṁ bhavaṁ poṭṭhapādo yaññadeva samaṇo gotamo bhāsati, taṁ tadevassa abbhanumodati: \"evametaṁ, bhagavā, evametaṁ, sugatā\"ti. Na kho pana mayaṁ kiñci samaṇassa gotamassa ekaṁsikaṁ dhammaṁ desitaṁ ājānāma: \"sassato loko\"ti vā, \"asassato loko\"ti vā, \"antavā loko\"ti vā, \"anantavā loko\"ti vā, \"taṁ jīvaṁ taṁ sarīran\"ti vā, \"aññaṁ jīvaṁ aññaṁ sarīran\"ti vā, \"hoti tathāgato paraṁ maraṇā\"ti vā, \"na hoti tathāgato paraṁ maraṇā\"ti vā, \"hoti ca na ca hoti tathāgato paraṁ maraṇā\"ti vā, \"neva hoti na na hoti tathāgato paraṁ maraṇā\"ti vā'ti. Evaṁ vuttāhaṁ, bhante, te paribbājake etadavocaṁ: 'ahampi kho, bho, na kiñci samaṇassa gotamassa ekaṁsikaṁ dhammaṁ desitaṁ ājānāmi: \"sassato loko\"ti vā, \"asassato loko\"ti vā … pe … \"neva hoti na na hoti tathāgato paraṁ maraṇā\"ti vā; api ca samaṇo gotamo bhūtaṁ tacchaṁ tathaṁ paṭipadaṁ paññapeti dhammaṭṭhitataṁ dhammaniyāmataṁ. Bhūtaṁ kho pana tacchaṁ tathaṁ paṭipadaṁ paññapentassa dhammaṭṭhitataṁ dhammaniyāmataṁ, kathañhi nāma mādiso viññū samaṇassa gotamassa subhāsitaṁ subhāsitato nābbhanumodeyyā'\"ti?",
    "dn9:37": "\"Sabbeva kho ete, poṭṭhapāda, paribbājakā andhā acakkhukā; tvaṁyeva nesaṁ eko cakkhumā. Ekaṁsikāpi hi kho, poṭṭhapāda, mayā dhammā desitā paññattā; anekaṁsikāpi hi kho, poṭṭhapāda, mayā dhammā desitā paññattā.",
    "dn9:38": "Katame ca te, poṭṭhapāda, mayā anekaṁsikā dhammā desitā paññattā? 'Sassatoloko'tikho, poṭṭhapāda, mayā anekaṁsiko dhammo desito paññatto; 'asassatoloko'tikho, poṭṭhapāda, mayā anekaṁsiko dhammo desito paññatto; 'antavāloko'tikho, poṭṭhapāda … pe … 'anantavāloko'tikho, poṭṭhapāda … 'taṁ jīvaṁ taṁ sarīran'ti kho, poṭṭhapāda … 'aññaṁ jīvaṁ aññaṁ sarīran'ti kho, poṭṭhapāda … 'hoti tathāgato paraṁ maraṇā'ti kho, poṭṭhapāda … na hoti tathāgato paraṁ maraṇā'ti kho, poṭṭhapāda … 'hoti ca na ca hoti tathāgato paraṁ maraṇā'ti kho, poṭṭhapāda … 'neva hoti na na hoti tathāgato paraṁ maraṇā'ti kho, poṭṭhapāda, mayā anekaṁsiko dhammo desito paññatto.",
    "dn9:39": "Kasmā ca te, poṭṭhapāda, mayā anekaṁsikā dhammā desitā paññattā? Na hete, poṭṭhapāda, atthasaṁhitā na dhammasaṁhitā na ādibrahmacariyakā na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṁvattanti. Tasmā te mayā anekaṁsikā dhammā desitā paññattā.",
    "dn9:40": "Katame ca te, poṭṭhapāda, mayā ekaṁsikā dhammā desitā paññattā? Idaṁ dukkhanti kho, poṭṭhapāda, mayā ekaṁsiko dhammo desito paññatto. Ayaṁ dukkhasamudayoti kho, poṭṭhapāda, mayā ekaṁsiko dhammo desito paññatto. Ayaṁ dukkhanirodhoti kho, poṭṭhapāda, mayā ekaṁsiko dhammo desito paññatto. Ayaṁ dukkhanirodhagāminī paṭipadāti kho, poṭṭhapāda, mayā ekaṁsiko dhammo desito paññatto.",
    "dn9:41": "Kasmā ca te, poṭṭhapāda, mayā ekaṁsikā dhammā desitā paññattā? Ete hi, poṭṭhapāda, atthasaṁhitā, ete dhammasaṁhitā, ete ādibrahmacariyakā ete nibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṁvattanti. Tasmā te mayā ekaṁsikā dhammā desitā paññattā.",
    "dn9:42": "Santi, poṭṭhapāda, eke samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: 'ekantasukhī attā hoti arogo paraṁ maraṇā'ti. Tyāhaṁ upasaṅkamitvā evaṁ vadāmi: 'saccaṁ kira tumhe āyasmanto evaṁvādino evaṁdiṭṭhino: \"ekantasukhī attā hoti arogo paraṁ maraṇā\"'ti? Te ce me evaṁ puṭṭhā 'āmā'ti paṭijānanti. Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto ekantasukhaṁ lokaṁ jānaṁ passaṁ viharathā'ti? Iti puṭṭhā\n'no'ti vadanti.",
    "dn9:43": "Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto ekaṁ vā rattiṁ ekaṁ vā divasaṁ upaḍḍhaṁ vā rattiṁ upaḍḍhaṁ vā divasaṁ ekantasukhiṁ attānaṁsañjānāthā'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:44": "Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto jānātha: \"Ayaṁ maggo ayaṁ paṭipadā ekantasukhassa lokassa sacchikiriyāyā\"'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:45": "Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto yā tā devatā ekantasukhaṁ lokaṁ upapannā, tāsaṁ bhāsamānānaṁ saddaṁ suṇātha: \"suppaṭipannāttha, mārisā, ujuppaṭipannāttha, mārisā, ekantasukhassa lokassa sacchikiriyāya; mayampi hi, mārisā, evaṁpaṭipannā ekantasukhaṁ lokaṁ upapannā\"'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:46": "Taṁ kiṁ maññasi, poṭṭhapāda, nanu evaṁ sante tesaṁ samaṇabrāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bhante, evaṁ sante tesaṁ samaṇabrāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn9:47": "\"Seyyathāpi, poṭṭhapāda, puriso evaṁ vadeyya: 'ahaṁ yā imasmiṁ janapade janapadakalyāṇī, taṁ icchāmi taṁ kāmemī'ti. Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa, yaṁ tvaṁ janapadakalyāṇiṁ icchasi kāmesi, jānāsi taṁ janapadakalyāṇiṁ khattiyī vā brāhmaṇī vā vessī vā suddī vā'ti? Iti puṭṭho 'no'ti vadeyya. Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa, yaṁ tvaṁ janapadakalyāṇiṁ icchasi kāmesi, jānāsi taṁ janapadakalyāṇiṁ evaṁnāmā evaṅgottāti vā, dīghā vā rassā vā majjhimā vā kāḷī vā sāmā vā maṅguracchavī vāti, amukasmiṁ gāme vā nigame vā nagare vā'ti? Iti puṭṭho 'no'ti vadeyya. Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa, yaṁ tvaṁ na jānāsi na passasi, taṁ tvaṁ icchasi kāmesī'ti? Iti puṭṭho 'āmā'ti vadeyya.",
    "dn9:48": "Taṁ kiṁ maññasi, poṭṭhapāda, nanu evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bhante, evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn9:49": "\"Evameva kho, poṭṭhapāda, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: 'ekantasukhī attā hoti arogo paraṁ maraṇā'ti. Tyāhaṁ upasaṅkamitvā evaṁ vadāmi: 'saccaṁ kira tumhe āyasmanto evaṁvādino evaṁdiṭṭhino: \"ekantasukhī attā hoti arogo paraṁ maraṇā\"'ti? Te ce me evaṁ puṭṭhā 'āmā'ti paṭijānanti. Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto ekantasukhaṁ lokaṁ jānaṁ passaṁ viharathā'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:50": "Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto ekaṁ vā rattiṁ ekaṁ vā divasaṁ upaḍḍhaṁ vā rattiṁ upaḍḍhaṁ vā divasaṁ ekantasukhiṁ attānaṁ sañjānāthā'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:51": "Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto jānātha: \"Ayaṁ maggo ayaṁ paṭipadā ekantasukhassa lokassa sacchikiriyāyā\"'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:52": "Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto yā tā devatā ekantasukhaṁ lokaṁ upapannā, tāsaṁ bhāsamānānaṁ saddaṁ suṇātha: \"suppaṭipannāttha, mārisā, ujuppaṭipannāttha, mārisā, ekantasukhassa lokassa sacchikiriyāya; mayampi hi, mārisā, evaṁpaṭipannā ekantasukhaṁ lokaṁ upapannā\"'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:53": "Taṁ kiṁ maññasi, poṭṭhapāda, nanu evaṁ sante tesaṁ samaṇabrāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bhante, evaṁ sante tesaṁ samaṇabrāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn9:54": "\"Seyyathāpi, poṭṭhapāda, puriso cātumahāpathe nisseṇiṁ kareyya pāsādassa ārohaṇāya. Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa,yassa tvaṁpāsādassa ārohaṇāya nisseṇiṁ karosi, jānāsi taṁ pāsādaṁ puratthimāya vā disāya dakkhiṇāya vā disāya pacchimāya vā disāya uttarāya vā disāya ucco vā nīco vā majjhimo vā'ti? Iti puṭṭho 'no'ti vadeyya. Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa, yaṁ tvaṁ na jānāsi na passasi, tassa tvaṁ pāsādassa ārohaṇāya nisseṇiṁ karosī'ti? Iti puṭṭho 'āmā'ti vadeyya.",
    "dn9:55": "Taṁ kiṁ maññasi, poṭṭhapāda, nanu evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bhante, evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn9:56": "\"Evameva kho, poṭṭhapāda, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: 'ekantasukhī attā hoti arogo paraṁ maraṇā'ti. Tyāhaṁ upasaṅkamitvā evaṁ vadāmi: 'saccaṁ kira tumhe āyasmanto evaṁvādino evaṁdiṭṭhino: \"ekantasukhī attā hoti arogo paraṁ maraṇā\"'ti? Te ce me evaṁ puṭṭhā 'āmā'ti paṭijānanti. Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto ekantasukhaṁ lokaṁ jānaṁ passaṁ viharathā'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:57": "Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto ekaṁ vā rattiṁ ekaṁ vā divasaṁ upaḍḍhaṁ vā rattiṁ upaḍḍhaṁ vā divasaṁ ekantasukhiṁ attānaṁ sañjānāthā'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:58": "Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto jānātha ayaṁ maggo ayaṁ paṭipadā ekantasukhassa lokassa sacchikiriyāyā'ti? Iti puṭṭhā 'no'ti vadanti.",
    "dn9:59": "Tyāhaṁ evaṁ vadāmi: 'api pana tumhe āyasmanto yā tā devatā ekantasukhaṁ lokaṁ upapannā tāsaṁ devatānaṁ bhāsamānānaṁ saddaṁ suṇātha: \"suppaṭipannāttha, mārisā, ujuppaṭipannāttha, mārisā, ekantasukhassa lokassa sacchikiriyāya; mayampi hi, mārisā, evaṁ paṭipannā ekantasukhaṁ lokaṁ upapannā\"'ti? Iti puṭṭhā\n'no'ti vadanti.",
    "dn9:60": "Taṁ kiṁ maññasi, poṭṭhapāda, nanu evaṁ sante tesaṁ samaṇabrāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bhante, evaṁ sante tesaṁ samaṇabrāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn9:61": "\"Tayo kho me, poṭṭhapāda, attapaṭilābhā—oḷāriko attapaṭilābho, manomayo attapaṭilābho, arūpo attapaṭilābho. Katamo ca, poṭṭhapāda, oḷāriko attapaṭilābho? Rūpī cātumahābhūtikokabaḷīkārāhārabhakkho, ayaṁ oḷāriko attapaṭilābho. Katamo manomayo attapaṭilābho? Rūpī manomayo sabbaṅgapaccangī ahīnindriyo, ayaṁ manomayo attapaṭilābho. Katamo arūpo attapaṭilābho? Arūpī saññāmayo, ayaṁ arūpo attapaṭilābho.",
    "dn9:62": "Oḷārikassapi kho ahaṁ, poṭṭhapāda, attapaṭilābhassa pahānāya dhammaṁ desemi: 'yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti. Siyā kho pana te, poṭṭhapāda, evamassa: 'saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissati, dukkho ca kho vihāro'ti. Na kho panetaṁ, poṭṭhapāda, evaṁ daṭṭhabbaṁ. Saṅkilesikā ceva dhammā pahīyissanti, vodāniyā ca dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissati, pāmujjañceva bhavissati pīti ca passaddhi ca sati ca sampajaññañca sukho ca vihāro.",
    "dn9:63": "Manomayassapi kho ahaṁ, poṭṭhapāda, attapaṭilābhassa pahānāya dhammaṁ desemi: 'yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti. Siyā kho pana te, poṭṭhapāda, evamassa: 'saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissati, dukkho ca kho vihāro'ti. Na kho panetaṁ, poṭṭhapāda, evaṁ daṭṭhabbaṁ. Saṅkilesikā ceva dhammā pahīyissanti, vodāniyā ca dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissati, pāmujjañceva bhavissati pīti ca passaddhi ca sati ca sampajaññañca sukho ca vihāro.",
    "dn9:64": "Arūpassapi kho ahaṁ, poṭṭhapāda, attapaṭilābhassa pahānāya dhammaṁ desemi: 'yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti. Siyā kho pana te, poṭṭhapāda, evamassa: 'saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissati, dukkho ca kho vihāro'ti. Na kho panetaṁ, poṭṭhapāda, evaṁ daṭṭhabbaṁ. Saṅkilesikā ceva dhammā pahīyissanti, vodāniyā ca dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissati, pāmujjañceva bhavissati pīti ca passaddhi ca sati ca sampajaññañca sukho ca vihāro.",
    "dn9:65": "Pare ce, poṭṭhapāda, amhe evaṁ puccheyyuṁ: 'katamo pana so, āvuso, oḷāriko attapaṭilābho, yassa tumhe pahānāya dhammaṁ desetha, yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti, tesaṁ mayaṁ evaṁ puṭṭhā evaṁ byākareyyāma: 'ayaṁ vā so, āvuso, oḷāriko attapaṭilābho, yassa mayaṁ pahānāya dhammaṁ desema, yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti.",
    "dn9:66": "Pare ce, poṭṭhapāda, amhe evaṁ puccheyyuṁ: 'katamo pana so, āvuso, manomayo attapaṭilābho, yassa tumhe pahānāya dhammaṁ desetha, yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti? Tesaṁ mayaṁ evaṁ puṭṭhā evaṁ byākareyyāma: 'ayaṁ vā so, āvuso, manomayo attapaṭilābho yassa mayaṁ pahānāya dhammaṁ desema, yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti.",
    "dn9:67": "Pare ce, poṭṭhapāda, amhe evaṁ puccheyyuṁ: 'katamo pana so, āvuso, arūpo attapaṭilābho, yassa tumhe pahānāya dhammaṁ desetha, yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti? Tesaṁ mayaṁ evaṁ puṭṭhā evaṁ byākareyyāma: 'ayaṁ vā so, āvuso, arūpo attapaṭilābho yassa mayaṁ pahānāya dhammaṁ desema, yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti.",
    "dn9:68": "Taṁ kiṁ maññasi, poṭṭhapāda, nanu evaṁ sante sappāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bhante, evaṁ sante sappāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn9:69": "\"Seyyathāpi, poṭṭhapāda, puriso nisseṇiṁ kareyya pāsādassa ārohaṇāya tasseva pāsādassa heṭṭhā. Tamenaṁ evaṁ vadeyyuṁ: 'ambho purisa, yassa tvaṁ pāsādassa ārohaṇāya nisseṇiṁ karosi, jānāsi taṁ pāsādaṁ, puratthimāya vā disāya dakkhiṇāya vā disāya pacchimāya vā disāya uttarāya vā disāya ucco vā nīco vā majjhimo vā'ti? So evaṁ vadeyya: 'ayaṁ vā so, āvuso, pāsādo, yassāhaṁ ārohaṇāya nisseṇiṁ karomi, tasseva pāsādassa heṭṭhā'ti.",
    "dn9:70": "Taṁ kiṁ maññasi, poṭṭhapāda, nanu evaṁ sante tassa purisassa sappāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bhante, evaṁ sante tassa purisassa sappāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn9:71": "\"Evameva kho, poṭṭhapāda, pare ce amhe evaṁ puccheyyuṁ: 'katamo pana so, āvuso, oḷāriko attapaṭilābho … pe … katamo pana so, āvuso, manomayo attapaṭilābho … pe … katamo pana so, āvuso, arūpo attapaṭilābho, yassa tumhe pahānāya dhammaṁ desetha, yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti? Tesaṁ mayaṁ evaṁ puṭṭhā evaṁ byākareyyāma: 'ayaṁ vā so, āvuso, arūpo attapaṭilābho, yassa mayaṁ pahānāya dhammaṁ desema, yathāpaṭipannānaṁ vo saṅkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṁ vepullattañca diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharissathā'ti.",
    "dn9:72": "Taṁ kiṁ maññasi, poṭṭhapāda, nanu evaṁ sante sappāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti? \"Addhā kho, bhante, evaṁ sante sappāṭihīrakataṁ bhāsitaṁ sampajjatī\"ti.",
    "dn9:73": "Evaṁ vutte, citto hatthisāriputto bhagavantaṁ etadavoca: \"yasmiṁ, bhante, samaye oḷāriko attapaṭilābho hoti, moghassa tasmiṁ samaye manomayo attapaṭilābho hoti, mogho arūpo attapaṭilābho hoti; oḷāriko vāssa attapaṭilābho tasmiṁ samaye sacco hoti. Yasmiṁ, bhante, samaye manomayo attapaṭilābho hoti, moghassa tasmiṁ samaye oḷāriko attapaṭilābho hoti, mogho arūpo attapaṭilābho hoti; manomayo vāssa attapaṭilābho tasmiṁ samaye sacco hoti. Yasmiṁ, bhante, samaye arūpo attapaṭilābho hoti, moghassa tasmiṁ samaye oḷāriko attapaṭilābho hoti, mogho manomayo attapaṭilābho hoti; arūpo vāssa attapaṭilābho tasmiṁ samaye sacco hotī\"ti.",
    "dn9:74": "\"Yasmiṁ, citta, samaye oḷāriko attapaṭilābho hoti, neva tasmiṁ samaye manomayo attapaṭilābhoti saṅkhaṁ gacchati, na arūpo attapaṭilābhoti saṅkhaṁ gacchati; oḷāriko attapaṭilābhotveva tasmiṁ samaye saṅkhaṁ gacchati. Yasmiṁ, citta, samaye manomayo attapaṭilābho hoti, neva tasmiṁ samaye oḷāriko attapaṭilābhoti saṅkhaṁ gacchati, na arūpo attapaṭilābhoti saṅkhaṁ gacchati; manomayo attapaṭilābhotveva tasmiṁ samaye saṅkhaṁ gacchati. Yasmiṁ, citta, samaye arūpo attapaṭilābho hoti, neva tasmiṁ samaye oḷāriko attapaṭilābhoti saṅkhaṁ gacchati, na manomayo attapaṭilābhoti saṅkhaṁ gacchati; arūpo attapaṭilābhotveva tasmiṁ samaye saṅkhaṁ gacchati.",
    "dn9:75": "Sace taṁ, citta, evaṁ puccheyyuṁ: 'ahosi tvaṁ atītamaddhānaṁ, na tvaṁ nāhosi; bhavissasi tvaṁ anāgatamaddhānaṁ, na tvaṁ na bhavissasi; atthi tvaṁ etarahi, na tvaṁ natthī'ti. Evaṁ puṭṭho tvaṁ, citta, kinti byākareyyāsī\"ti?",
    "dn9:76": "\"Sace maṁ, bhante, evaṁ puccheyyuṁ: 'ahosi tvaṁ atītamaddhānaṁ, na tvaṁ na ahosi; bhavissasi tvaṁ anāgatamaddhānaṁ, na tvaṁ na bhavissasi; atthi tvaṁ etarahi, na tvaṁ natthī'ti. Evaṁ puṭṭho ahaṁ, bhante, evaṁ byākareyyaṁ: 'ahosāhaṁ atītamaddhānaṁ, nāhaṁ na ahosiṁ; bhavissāmahaṁ anāgatamaddhānaṁ, nāhaṁ na bhavissāmi; atthāhaṁ etarahi, nāhaṁ natthī'ti. Evaṁ puṭṭho ahaṁ, bhante, evaṁ byākareyyan\"ti.",
    "dn9:77": "\"Sace pana taṁ, citta, evaṁ puccheyyuṁ: 'yo te ahosi atīto attapaṭilābho,sovate attapaṭilābho sacco, mogho anāgato, mogho paccuppanno?Yote bhavissati anāgato attapaṭilābho, sova te attapaṭilābho sacco, mogho atīto, mogho paccuppanno?Yote etarahi paccuppanno attapaṭilābho,sovate attapaṭilābho sacco, mogho atīto, mogho anāgato'ti. Evaṁ puṭṭho tvaṁ, citta, kinti byākareyyāsī\"ti?",
    "dn9:78": "\"Sace pana maṁ, bhante, evaṁ puccheyyuṁ: 'yo te ahosi atīto attapaṭilābho, sova te attapaṭilābho sacco, mogho anāgato, mogho paccuppanno. Yo te bhavissati anāgato attapaṭilābho, sova te attapaṭilābho sacco, mogho atīto, mogho paccuppanno. Yo te etarahi paccuppanno attapaṭilābho, sova te attapaṭilābho sacco, mogho atīto, mogho anāgato'ti. Evaṁ puṭṭho ahaṁ, bhante, evaṁ byākareyyaṁ: 'yo me ahosi atīto attapaṭilābho, sova me attapaṭilābho tasmiṁ samaye sacco ahosi, mogho anāgato, mogho paccuppanno. Yo me bhavissati anāgato attapaṭilābho, sova me attapaṭilābho tasmiṁ samaye sacco bhavissati, mogho atīto, mogho paccuppanno. Yo me etarahi paccuppanno attapaṭilābho, sova me attapaṭilābho sacco, mogho atīto, mogho anāgato'ti. Evaṁ puṭṭho ahaṁ, bhante, evaṁ byākareyyan\"ti.",
    "dn9:79": "\"Evameva kho, citta, yasmiṁ samaye oḷāriko attapaṭilābho hoti, neva tasmiṁ samaye manomayo attapaṭilābhoti saṅkhaṁ gacchati, na arūpo attapaṭilābhoti saṅkhaṁ gacchati. Oḷāriko attapaṭilābhotveva tasmiṁ samaye saṅkhaṁ gacchati. Yasmiṁ, citta, samaye manomayo attapaṭilābho hoti … pe … yasmiṁ, citta, samaye arūpo attapaṭilābho hoti, neva tasmiṁ samaye oḷāriko attapaṭilābhoti saṅkhaṁ gacchati, na manomayo attapaṭilābhoti saṅkhaṁ gacchati; arūpo attapaṭilābhotveva tasmiṁ samaye saṅkhaṁ gacchati.",
    "dn9:80": "Seyyathāpi, citta, gavā khīraṁ, khīramhā dadhi, dadhimhā navanītaṁ, navanītamhā sappi, sappimhā sappimaṇḍo. Yasmiṁ samaye khīraṁ hoti, neva tasmiṁ samaye dadhīti saṅkhaṁ gacchati, na navanītanti saṅkhaṁ gacchati, na sappīti saṅkhaṁ gacchati, na sappimaṇḍoti saṅkhaṁ gacchati; khīrantveva tasmiṁ samaye saṅkhaṁ gacchati. Yasmiṁ samaye dadhi hoti … pe … navanītaṁ hoti … sappi hoti … sappimaṇḍo hoti, neva tasmiṁ samaye khīranti saṅkhaṁ gacchati, na dadhīti saṅkhaṁ gacchati, na navanītanti saṅkhaṁ gacchati, na sappīti saṅkhaṁ gacchati; sappimaṇḍotveva tasmiṁ samaye saṅkhaṁ gacchati.",
    "dn9:81": "Evaṁ vutte, poṭṭhapādo paribbājako bhagavantaṁ etadavoca: \"Abhikkantaṁ, bhante, abhikkantaṁ, bhante. Seyyathāpi, bhante, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: 'cakkhumanto rūpāni dakkhantī'ti; evamevaṁ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṁ, bhante, bhagavantaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṁ maṁ bhagavā dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti.",
    "dn9:82": "Citto pana hatthisāriputto bhagavantaṁ etadavoca: \"Abhikkantaṁ, bhante, abhikkantaṁ, bhante. Seyyathāpi, bhante, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: 'cakkhumanto rūpāni dakkhantī'ti; evamevaṁ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṁ, bhante, bhagavantaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Labheyyāhaṁ, bhante, bhagavato santike pabbajjaṁ, labheyyaṁ upasampadan\"ti.",
    "dn9:83": "Alattha kho citto hatthisāriputto bhagavato santike pabbajjaṁ, alattha upasampadaṁ. Acirūpasampanno kho panāyasmā citto hatthisāriputto eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto na cirasseva—yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ— brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāsi. \"Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā\"ti—abbhaññāsi."
}