{
    "dhp209-220:209": "Giving himself to things to be shunned and not exerting where exertion is needed, a seeker after pleasures, having given up his true welfare, envies those intent upon theirs.",
    "dhp209-220:210": "Seek no intimacy with the beloved and also not with the unloved, for not to see the beloved and to see the unloved, both are painful.",
    "dhp209-220:211": "Therefore hold nothing dear, for separation from the dear is painful. There are no bonds for those who have nothing beloved or unloved.",
    "dhp209-220:212": "From endearment springs grief, from endearment springs fear. For one who is wholly free from endearment there is no grief, whence then fear?",
    "dhp209-220:213": "From affection springs grief, from affection springs fear. For one who is wholly free from affection there is no grief, whence then fear?",
    "dhp209-220:214": "From attachment springs grief, from attachment springs fear. For one who is wholly free from attachment there is no grief, whence then fear?",
    "dhp209-220:215": "From lust springs grief, from lust springs fear. For one who is wholly free from craving there is no grief; whence then fear?",
    "dhp209-220:216": "From craving springs grief, from craving springs fear. For one who is wholly free from craving there is no grief; whence then fear?",
    "dhp209-220:217": "People hold dear him who embodies virtue and insight, who is principled, has realized the truth, and who himself does what he ought to be doing.",
    "dhp209-220:218": "One who is intent upon the Ineffable (Nibbāna), dwells with mind inspired (by supramundane wisdom), and is no more bound by sense pleasures—such a man is called \"One Bound Upstream.\"",
    "dhp209-220:219": "When, after a long absence, a man safely returns from afar, his relatives, friends and well-wishers welcome him home on arrival.",
    "dhp209-220:220": "As kinsmen welcome a dear one on arrival, even so his own good deeds will welcome the doer of good who has gone from this world to the next."
}