{
    "an1.188-197:1": "(88) \"Bhikkhus, the foremost of my bhikkhu disciples in seniority is Aññākoṇḍañña.\"[n.74] He was the first to understand the four noble truths at the Buddha’s first discourse, and the first to request admission to the Saṅgha. SeeSN56., andKhandaka .",
    "an1.188-197:2": "(189) \" … among those with great wisdom is Sāriputta.\"[n.75] For more detailed biographical accounts of Sāriputta, Mahāmoggallāna, Mahākassapa, Anuruddha, and Mahākaccāna, seeNyanaponika and Hecker 003, chaps. 1, , 3, 5, and 6, respectively.",
    "an1.188-197:3": "(190) \" … among those with psychic potency is Mahāmoggallāna.\"[n.76] By psychic potency(iddhi)is meant the supernormal powers described inAN.60,AN.101, and elsewhere.",
    "an1.188-197:4": "(191) \" … among those who expound the ascetic practices is Mahākassapa.\"[n.77] The ascetic practices(dhuta,dhutaṅga)are often observed by monks for the sake of fewness of desires, being easy to support, and self-restraint. They include living in the forest, at the foot of a tree, in the open air, or in a charnel ground; using only three robes; wearing \"rag-robes\" made from pieces of discarded cloth; eating only food obtained on alms round; and sleeping in the sitting posture. SeeAN1.378-393,AN5.181. The standard thirteen ascetic practices are discussed in Vism chap. 2.",
    "an1.188-197:5": "(192) \" … among those with the divine eye is Anuruddha.\"[n.78] The divine eye(dibbacakkhu)is the ability to see objects at remote distances, including distant world systems; to see other realms of existence; and to see beings dying and being reborn in accordance with their kamma.",
    "an1.188-197:6": "(193) \" … among those from eminent families is Bhaddiya Kāḷigodhāyaputta.\"[n.79] He was the son of Kāḷigodhā, a senior Sakyan lady, and a close friend of Anuruddha, with whom he went forth. A story about him is inUd 2:10. His verses are atTh 842-85.",
    "an1.188-197:7": "(194) \" … among those with a sweet voice is Lakuṇṭaka Bhaddiya.\"[n.80] Born to a wealthy family of Sāvatthī, he was given the sobriquetlakuṇṭaka(dwarf) due to his small stature. His attainment of arahantship is recounted inUd :1. He is praised inUd :2,Ud :5, andSN21.6.His verses are atTh 466–42.",
    "an1.188-197:8": "(195) \" … among those with the lion's roar is Piṇḍola Bhāradvāja.\"[n.1] He was the son of the chaplain of King Udena of Kosambī. When he visited Rājagaha and saw the gains that accrued to the bhikkhus, he decided to become a monk. In his early days as a bhikkhu he was gluttonous, but the Buddha taught him to be moderate in eating. He soon attained arahantship with the six direct knowledges. He was rebuked by the Buddha for using his psychic powers to win a sandalwood bowlKhandaka 15. He converses with King Udena about sense restraint atSN35.127. He is praised inUd 4.6. His verses are atTh 123–124.",
    "an1.188-197:9": "(16) \" … among those who speak on the Dhamma is Puṇṇa Mantāṇiputta.\"[n.82] A nephew of Aññākoṇḍañña, he was from a brahmin family that lived near Kapilavatthu, the Buddha’s native city. After he attained arahantship he went to see the Buddha in Sāvatthī. Sāriputta met him and they had a discussion on the Dhamma, preserved inMN24. He was praised by Ānanda for his skill as a teacher atSN22.83.",
    "an1.188-197:10": "(197) \" … among those who explain in detail the meaning of what has been stated in brief is Mahākaccāna.\""
}