{
    "an1.258-267:1": "(258) \"Bhikkhus, the foremost of my female lay followers in being the first to go for refuge is Sujātā, daughter of Senānī.\"[n.39] She offered the bodhisatta his last meal before his enlightenment.Mpidentifies her as the mother of Yasa (seeVin I 5–8), but this seems improbable. Sujātā was from Uruvelā, near present-day Bodhgayā, whereas Yasa is said to have been from distant Bārāṇasī.",
    "an1.258-267:2": "(59) \" … among donors is Visākhā Migāramātā.\"[n.140] She was the Buddha’s chief female patron. A biographical sketch is inNyanaponika and Hecker 003: 47–55. The Buddha gives discourses to her inAN3.70,AN8.43,AN8.47, andAN8.49.",
    "an1.258-267:3": "(260) \" … among those who are learned is Khujjuttarā.\"[n.141] The servant of Sāmāvatī, she would go to hear the Buddha preach and repeat the discourses to the ladies of the court. The Itivuttaka is said to be the record of these teachings. In2.1and at4.176she is held up, along with Veḷukaṇṭakī Nandamātā, as the ideal model for a female lay follower. She is also praised inSN17.24.",
    "an1.258-267:4": "(261) \" … among those who dwell in loving-kindness is Sāmāvatī.\"[n.12] Orphaned as a girl, she became the wife of King Udena of Kosambī. Together with the women of the court, she died when her jealous co-wife, Māgandiyā, had the women's quarters set on fire. The story is inUd 7.10, 79. Her biographical sketch is inNyanaponika and Hecker 2003: 285–93.",
    "an1.258-267:5": "(262) \" … among meditators is Uttarā Nandamātā.\"[n.143] She is probably identical with Veḷukaṇṭakī Nandamātā, who, while held up elsewhere as an ideal laywoman, is not mentioned in this list. Veḷukaṇṭakī Nandamātā is praised along with Khujjuttarā in2.133and at4.176. InAN7.3she speaks about her seven astounding qualities.",
    "an1.258-267:6": "(23) \" … among those who give what is excellent is Suppavāsā the Koliyan daughter.\"[n.144] She was the mother of Sīvalī. The story of her long pregnancy is inUd 2.8. The Buddha instructs her about the efficacy of giving food inAN4.57.",
    "an1.258-267:7": "(264) \" … among those who attend on the sick is the female lay follower Suppiyā.\"[n.145] She sliced flesh from her own thigh to feed a sick bhikkhu who needed meat. This caused the Buddha to prohibit the bhikkhus from consuming human flesh, even if willingly given. SeeKhandaka 6 verse 0.",
    "an1.258-267:8": "(265) \" … among those with unwavering confidence is Kātiyānī.\"[n.146]Mpsays that she was a close friend of Kāḷī of Kuraraghara. One day, while she was listening to a Dhamma discourse, thieves came to rob her house. She did not show any concern about the robbery but continued listening to the discourse. Her reaction caused the thieves to repent. With her help, they became monks and attained arahantship.",
    "an1.258-267:9": "(266) \" … among those who are intimate is the housewife Nakulamātā.\"[n.147] She was the wife of Nakulapitā. She reveals her virtues inAN6.16and receives a personal discourse from the Buddha inAN8.48.",
    "an1.258-267:10": "(267) \" … among those whose confidence is based on hearsay is the female lay follower Kāḷī of Kuraraghara.\"[n.148] A supporter of Mahākaccāna, she converses with him inAN.26.Mpsays that she gained trust when she heard two yakkhas (spirits) speaking praise of the Three Jewels while traveling through the sky. She thereupon attained the fruit of stream-entry."
}