{
    "an1.209-218:1": "(209) \"Bhikkhus, the foremost of my bhikkhu disciples among those who desire the training is Rāhula.\"[n.92] The Buddha’s son. His first encounter with his father, when he was seven, is related at Vin I 82,8–3. The Buddha addresses the following discourses to him:MN6,MN62,MN47;SN8:–8:22;SN22:9to22:92;SN35:2(same as MN47); andSn2:.",
    "an1.209-218:2": "(10) \" … among those who have gone forth out of faith is Raṭṭhapāla.\"[n.93] His story and his discourse on the Dhamma are atMN8. His verses are atTh 350–54.",
    "an1.209-218:3": "(211) \" … among those who are first to take meal tickets is Kuṇḍadhāna.\"[n.94]Paṭhamaṁ salākaṁ gaṇhantānaṁ. This refers to a method of assigning meals by choosing lots. He seldom appears in the Nikāyas but has a verse atTh 15(= SN1:5, I , ascribed to the Buddha).",
    "an1.209-218:4": "(212) \" … among those who compose inspired verse is Vangīsa.\"[n.95] A whole chapter about him, including his verses, isSN chap. 8. See tooAN2.12. His verses,Th 1218–88, make up the largest section in the Theragāthā.",
    "an1.209-218:5": "(213) \" … among those who inspire confidence in all respects is Upasena Vangantaputta.\"[n.96] A younger brother of Sāriputta, he rejoices in his achievements inUd 4:9. An account of his death by snakebite is inSN3:69. His verses are atTh 77–86.",
    "an1.209-218:6": "(214) \" … among those who assign lodgings is Dabba Mallaputta.\"[n.97] He is said to have attained arahantship at the age of seven. He was selected by the Saṅgha to be the appointer of lodgings and assigner of meals but was subsequently calumnied by a group of evil-minded bhikkhus (at Vin III 158–3 and again at Vin III 1–7; see too Vin II 74–80, 124–2). He is maligned by the same group at Vin IV 37–38. The story of his passing away is inUd 8:9–10, 92–93. He has a single verse at Th 5.",
    "an1.209-218:7": "(215) \" … among those pleasing and agreeable to the deities is Piḷindavaccha.\"[n.98] He had been a brahmin in five hundred past lives and even after his ordination and attainment of arahantship, by force of habit he still referred to other bhikkhus by the derogatory termvasala. The Buddha exonerated him of wrongdoing (inUd 3:6, ¶4–6). His supernormal powers are described at Vin I 206–9; III 6,9–1; III 248–51. He has a single verse atTh  9(identical with Angulimāla's verse atTh 885).",
    "an1.209-218:8": "(216) \" … among those who quickly attain direct knowledge is Bāhiya Dārucīriya.\"[n.99] His story is told inUd 1:10. Before he met the Buddha, he had lived as an ascetic, convinced he was an arahant until a benevolent deity disabused him of this notion. He hastened to visit the Buddha in Sāvatthī. Upon receiving the Buddha’s teaching he immediately attained arahantship. He was killed by a cow shortly after his attainment. Though he did not receive formal ordination, he is still considered a bhikkhu.",
    "an1.209-218:9": "(217) \" … among those with variegated speech is Kumārakassapa.\"[n.100] He was the son of a woman who became a bhikkhunī while unknowingly pregnant with him. He went forth at the age of seven. He appears inDN 23andMN 23. His verses are atTh 201–2.Mpsays that he was designated foremost among those of variegated speech(cittakathikānaṁ aggo)because he adorned his Dhamma talks with many similes and reasons.",
    "an1.209-218:10": "(218) \" … among those who have attained the analytical knowledges is Mahākoṭṭhita.\"[n.1] He appears in numerous suttas, usually questioning Sāriputta:MN 43; SN12:67; SN22:122; SN22:127–35;SN 35:232; SN44:3–6. At SN35:162–63 he receives instructions directly from the Buddha. On the analytical knowledges(paṭisambhidā), seeAN4.172."
}