{
    "an1.296:1": "\"Bhikkhus, there is one thing that, when developed and cultivated, leads exclusively to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to nibbāna.[n.60]Mp:\"Disenchantment(nibbidā)is dissatisfaction with the round (of rebirths);dispassion(virāga)is the fading away of the round, or the fading away of such defilements as lust(rāga);cessation(nirodha)is the ceasing of lust, etc., or the ceasing of the round;peace(upasama)is the stilling of defilements;direct knowledge(abhiññā)is directly knowing the three characteristics;enlightenment(sambodha)is awakening to the four truths; andnibbānais the realization of the non-conditioned nibbāna.\"What is that one thing? Recollection of the Buddha.[n.6] Recollection of the Buddha(buddhānussati)is the first of the six recollections described more fully atAN6.0and elaborated at Vism 97–23, Ppn 7.–67. Here isMp(abridged): \"Recollection of the Buddha serves two purposes: giving joy to the mind and promoting insight(cittasampahaṁsanatthañ c’eva vipassanatthañca). How? When a bhikkhu develops a meditation subject like unattractiveness (of the body), his mind may be disturbed, dissatisfied, and joyless. It does not remain on track but roams around like a wild bull. On that occasion, he should put aside his basic meditation subject and recollect the excellent qualities of the Tathāgata. As he recollects the Buddha, his mind becomes placid and free from hindrances. He can then return to his basic meditation object, develop insight, and reach the plane of the noble ones. Thus recollection of the Buddha gives joy to the mind. But one can also use this meditation subject directly for the purpose of developing insight. After recollecting the Buddha, one dissects the act of recollection into the five aggregates and defines them thus: ‘These five aggregates are, in brief, the truth of suffering. The craving that produced them is the truth of the origin. The cessation of craving is the truth of cessation; and the practice that understands cessation is the truth of the path.’ Thus one has defined the four truths in the preliminary portionthe stage of insightand one step by step reaches the stage of the noble ones.\"This is that one thing that, when developed and cultivated, leads exclusively to disenchantment … to nibbāna.\""
}