{
    "an1.198-208:1": "(98) \"Bhikkhus, the foremost of my bhikkhu disciples among those who create a mind-made body is Cullapanthaka.\"[n.83] His story is told at Vism 387–89, Ppn 2.60–66. Because he was born by a roadside(pantha), he was given the name Panthaka. He is praised inUd5.0. His verses are atTh 557–66.",
    "an1.198-208:2": "(199) \" … among those skilled in mental transformation is Cullapanthaka.\"",
    "an1.198-208:3": "(200) \" … among those skilled in the transformation of perception is Mahāpanthaka.\"[n.84] He was the elder brother of Cullapanthaka, also born by a roadside. Being elder, when his brother was born he was called Mahā (large, great) and his brother Culla (small). His verses are atTh 510–17.Mpsays that Cullapanthaka was particularly skilled in concentration and was therefore the foremost in mental transformation(cetovivaṭṭa). Mahāpanthaka was particularly skilled in insight and was therefore foremost in the transformation of perception(saññāvivaṭṭa). Mp-ṭ explains the difference thus: \"One skilled in mental transformation is an attainer of the form-sphere jhānas who, in regard to a single object, is able to transform the mind of concentration(samādhicittaṁ)from successively lower jhānas to successively higher ones. One skilled in transformation of perception is skilled in transforming the aforesaid jhānas under the heading of perception, passing beyond the perceptions of form and moving from (the perception) associated with the base of the infinity of space to that associated with the base of neither-perception-nor-non-perception. Similarly, he is able to transform the mind from the perception of women and men, etc., and from the perception of permanence, etc., toward mere form and formless phenomena and, especially, toward the unconditioned nibbāna. Such a one is accustomed to the contemplation of emptiness(suññatānupassanābahulo).\"",
    "an1.198-208:4": "(201) \" … among those who dwell without conflict is Subhūti.\"[n.85] He was Anāthapiṇḍika's younger brother, who went forth on the day the Jetavana monastery was dedicated to the Buddha. He attained arahantship by developing insight based on the meditation of loving-kindness. Before teaching the Dhamma and when receiving almsfood, he would first enter jhāna through loving-kindness and then emerge. The Buddha explains to him the manifestations of faith atAN11.1. His skill in meditation is praised inUd 6:7. His verse is atTh 1. Subhūti figures prominently in the (Mahāyāna) Prajñāpāramitā sūtras as chief exponent of the perfection of wisdom.",
    "an1.198-208:5": "(202) \" … among those worthy of gifts is Subhūti.\"",
    "an1.198-208:6": "(203) \" … among forest dwellers is Revata Khadiravaniya.\"[n.8] He was Sāriputta's youngest brother. Compelled by his mother to marry when still young, he ran away and received ordination. His verses are atTh 45–58.",
    "an1.198-208:7": "(204) \" … among meditators is Kankhārevata.\"[n.8] He was from a very wealthy family of Sāvatthī. His conception of the ideal bhikkhu is atMN32. He is praised inUd 5:. He has his own verse atTh 3.",
    "an1.198-208:8": "(205) \" … among those who arouse energy is Soṇa Koḷivīsa.\"[n.] The story of his awakening is atAN6.55, told more elaborately atKhandaka 5, where it leads to the Buddha’s granting permission to the bhikkhus to wear sandals. His verses are atTh 632–44.",
    "an1.198-208:9": "(206) \" … among those who are excellent speakers is Soṇa Kuṭikaṇṇa.\"[n.8] He was from Avantī, the son of Kāḷī (seeAN1.267) and a pupil of Mahākaccāna. His story is told inUd5.6. He traveled to Sāvatthī to see the Buddha. The Buddha invited him to spend the night in his cottage and praised him for his recitation of the Aṭṭhakavagga. His verses are atTh 365–6."
}