{
    "an1.402-405:1": "\" … (402) dwells contemplating the body in the body,[n.97] The Pāli phrasekāye kāyānupassī viharatiis usually translated either as I have rendered it here or as \"(he) dwells contemplating the bodyas a body.\" The question is sometimes raised which of these two is more accurate. I believe thatAN7.6, IV 3–5, supports my rendering here. We there readekacco puggalo sabbasaṅkhāresu aniccānupassī viharati, and in the following suttas:sabbasaṅkhāresu dukkhānupassī viharati,sabbadhammesu anattānupassī viharati, andnibbāne sukhānupassī viharati. These are best rendered: \"Some person dwells contemplating impermanence in all conditioned phenomena,\" \"dwells contemplating suffering in all conditioned phenomena,\" \"dwells contemplating non-self in all phenomena,\" and \"dwells contemplating happiness in nibbāna.\" They couldnotbe rendered: \"Some person dwells contemplating impermanence as all conditioned phenomena\" … \"contemplating happiness as nibbāna.\" In each case, the word conjoined withanupassīis the aspect that is contemplated, and the word in the locative case is the sphere in relation to which that aspect is contemplated. Analogously, inkāye kāyānupassī viharati, thekāyaconjoined withanupassīis the aspect that is contemplated (the \"bodiness\" of the body) and the locativekāyeis the domain in relation to which that aspect is contemplated. Strictly speakingkāyānupassīdoes not actually mean \"contemplating the body,\" but \"a body-contemplator.\" Thus a very literal translation of the phrase would be: \"He dwells as a body-contemplator in relation to the body.\" Since such a rendering would sound awkward in English, I fall back on the familiar \"contemplating the body in the body.\" Similar considerations apply to the other threesatipaṭṭhānas.ardent, clearly comprehending, mindful, having removed longing and dejection in regard to the world … (403) dwells contemplating feelings in feelings … (404) dwells contemplating mind in mind … (405) dwells contemplating phenomena in phenomena, ardent, clearly comprehending, mindful, having removed longing and dejection in regard to the world … \""
}