{
    "an1.17:1": "\"Bhikkhus, I do not see even one other thing on account of which unarisen ill will does not arise and arisen ill will is abandoned so much as the liberation of the mind by loving-kindness.[n.3]Mettācetovimutti.Mp:\"Loving-kindness pervades all beings with (the wish for) their welfare. Since the mind associated with it is liberated from the opposed states such as the hindrances, it is called liberation of mind(cetovimutti). Specifically, this ‘liberation of mind’ is liberated from obsession by ill will. Here, what is intended by ‘liberation of mind’ is absorption(appanā)by three or four jhānas (depending on whether the fourfold or fivefold scheme of jhānas is used).\" Mp-ṭ: \"(This is said) because there is no thorough liberating (of the mind) by loving-kindness until one attains absorption.\" AtAN6.3loving-kindness is taught as the escape from ill will. AtAN9.andAN9.3, it is recommended for abandoning ill will.AN8.63teaches different approaches to developing the liberation of the mind by loving-kindness, andAN8.andAN.5explain, respectively, eight and eleven benefits of mastering the liberation of the mind by loving-kindness. The fourfold scheme of jhānas is typical of the Nikāyas; the fivefold scheme appears in the Abhidhamma by dividing the second jhāna into two: the second with examination but without thought, the third without thought and examination.For one who attends carefully to the liberation of the mind by loving-kindness, unarisen ill will does not arise and arisen ill will is abandoned.\"[n.32]Mpmentions six things that lead to the abandoning of ill will: learning the meditation on loving-kindness, cultivating meditation on loving-kindness, reviewing ownership of kamma, abundant reflection, good friendship, and suitable conversation. On \"reviewing ownership of kamma,\"Mpsays that one should reflect thus: \"If you get angry with another person, what can you do? Can you destroy his virtuous behavior, etc.? Didn’t you come into this world on account of your own kamma and won’t you depart through your own kamma? Getting angry with another person is like taking hold of a hot flameless coal or an iron stake smeared with excrement in order to strike someone. If he gets angry with you, what can he do? Can he destroy your virtuous behavior, etc.? Didn’t he come into this world on account of his own kamma and won’t he depart through his own kamma? Just like an offering of a cake that is refused, or like a fist full of dust thrown against the wind, his anger will remain with him.\" For more ways of overcoming anger, see Vism 298–306, Ppn 9:4–39."
}