{
    "an10.94:1": "On one occasion the Blessed One was dwelling at Campā on a bank of the Gaggarā Lotus Pond. Then the householder Vajjiyamāhita left Campā in the middle of the day to see the Blessed One. It then occurred to him: \"It is not the proper time to see the Blessed One, who is in seclusion, nor to see the esteemed bhikkhus, who are also in seclusion. Let me go to the park of the wanderers of other sects.\"",
    "an10.94:2": "Then the householder Vajjiyamāhita went to the park of the wanderers of other sects. Now on that occasion the wanderers of other sects had assembled and were making an uproar as they loudly and boisterously sat discussing various pointless topics.",
    "an10.94:3": "The wanderers saw the householder Vajjiyamāhita coming in the distance and silenced one another: \"Sirs, be quiet. Sirs, do not make any noise. Here comes the householder Vajjiyamāhita, a disciple of the ascetic Gotama, one among the ascetic Gotama's white-robed lay disciples who reside in Sāvatthī. Now these venerable ones are fond of quiet, disciplined in quiet, and speak in praise of quiet. Perhaps if he finds that our assembly is quiet, he will think to approach us.\"",
    "an10.94:4": "Then those wanderers of other sects became silent.",
    "an10.94:5": "When this was said, a wanderer said to the householder Vajjiyamāhita: \"Wait a moment, householder! That ascetic Gotama whom you are praising is an abolitionist who refrains from making definite declarations.\"",
    "an10.94:6": "When this was said, those wandererssat silenced, disconcerted, hunched over, downcast, glum, and speechless. Then the householder Vajjiyamāhita, having understood that those wandererssatsilenced … and speechless, rose from his seat and went to the Blessed One. He paid homage to the Blessed One, sat down to one side, and reported to the Blessed One his entire conversation with those wanderers of other sects.",
    "an10.94:7": "The Blessed One said:\"Good, good, householder! It is in such a way that those hollow men should from time to time be thoroughly refuted with reasoned argument.\"",
    "an10.94:8": "(1) –(2) \"If, householder, when one practices a particular austerity, unwholesome qualities increase and wholesome qualities decline, then, I say, one should not practice such austerity. But if, when one practices a particular austerity, unwholesome qualities decline and wholesomequalities increase, then, I say, one should practice such austerity.",
    "an10.94:9": "(3) –(4) \"If, householder, when one undertakes a particular observance, unwholesome qualities increase and wholesome qualities decline, then, I say, one should not undertake such an observance. But if, when one undertakes a particular observance, unwholesome qualities decline and wholesome qualities increase, then, I say, one should undertake such an observance.",
    "an10.94:10": "(5) –(6) \"If, householder, when one strives in a particular way, unwholesome qualities increase and wholesome qualities decline, then, I say, one should not strive in such a way. But if, when one strives in a particular way, unwholesome qualities decline and wholesome qualities increase, then, I say, one should strive in such a way.",
    "an10.94:11": "(7) –(8) \"If, householder, when one relinquishes something, unwholesome qualities increase and wholesome qualities decline, then, I say, one should not make such a relinquishment. But if, when one relinquishes something, unwholesome qualities decline and wholesome qualities increase, then, I say, one should make such a relinquishment.",
    "an10.94:12": "(9) –(10) \"If, householder, when one attains a particular liberation, unwholesome qualities increase and wholesome qualities decline, then, I say, one should not attain such a liberation. But if, when one attains a particular liberation, unwholesome qualities decline and wholesome qualities increase, then, I say, one should attain such a liberation.\"",
    "an10.94:13": "Then, when the householder Vajjiyamāhita had been instructed, encouraged, inspired, and gladdened by the Blessed One with a Dhamma talk, he rose from his seat, paid homage to the Blessed One, circumambulated him keeping the right side toward him, and departed.",
    "an10.94:14": "Then, not long after the householder Vajjiyamāhita had left, the Blessed One addressed the bhikkhus: \"Bhikkhus, if any bhikkhu, even one who has long had little dust in his eyes regarding this Dhamma and discipline, would thoroughly refute with reasoned argument the wanderers of other sects, he would refute them in just such a way as the householder Vajjiyamāhita has done.\""
}