{
    "an10.3:1": "\"Bhikkhus, () for an immoral person, for one deficient in virtuous behavior, (2) non-regret lacks its proximate cause. When there is no non-regret, for one deficient in non-regret, (3) joy lacks its proximate cause. When there is no joy, for one deficient in joy, (4) rapture lacks its proximate cause. When there is no rapture, for one deficient in rapture, (5) tranquility lacks its proximate cause. When there is no tranquility, for one deficient in tranquility, (6) pleasure lacks its proximate cause. When there is no pleasure, for one deficient in pleasure, (7) right concentration lacks its proximate cause. When there is no right concentration, for one deficient in right concentration, (8) the knowledge and vision of things as they really are lacks its proximate cause. When there is no knowledge and vision of things as they really are, for one deficient in the knowledge and vision of things as they really are, (9) disenchantment and dispassion lack their proximate cause. When there is no disenchantment and dispassion, for one deficient in disenchantment and dispassion, (0) the knowledge and vision of liberation lacks its proximate cause.",
    "an10.3:2": "\"Bhikkhus, (1) for a virtuous person, for one whose behavior is virtuous, () non-regret possesses its proximate cause. When there is non-regret, for one possessing non-regret, (3) joy possesses its proximate cause. When there is joy, for one possessing joy, (4) rapture possesses its proximate cause. When there is rapture, for one possessing rapture, (5) tranquility possesses its proximate cause. When there is tranquility, for one possessing tranquility, (6) pleasure possesses its proximate cause. When there is pleasure, for one possessing pleasure, (7) right concentration possesses its proximate cause.When there is right concentration, for one possessing right concentration, (8) the knowledge and vision of things as they really are possesses its proximate cause. When there is the knowledge and vision of things as they really are, for one possessing the knowledge and vision of things as they really are, (9) disenchantment and dispassion possess their proximate cause. When there is disenchantment and dispassion, for one possessing disenchantment and dispassion, (10) the knowledge and vision of liberation possesses its proximate cause."
}