{
    "an10.54:1": "\"Bhikkhus, a bhikkhu who is not skilled in the ways of others’ mindsshould train: ‘I will be skilled in the ways of my own mind.’ It is in this way that you should train yourselves.",
    "an10.54:2": "\"And how is a bhikkhu skilled in the ways of his own mind? It is just as if a woman or a man—young, youthful, and fond of ornaments—would look at her or his own facial reflection in a clean bright mirror or in a bowl of clear water. If they see any dust or blemish there, they will make an effort to remove it. But if they do not see any dust or blemish there, they will be glad about it,and their wish fulfilled, they will think, ‘How fortunate for me that I’m clean!’",
    "an10.54:3": "(1) \"If, by such self-examination, a bhikkhu knows: ‘I gain internal serenity of mind but not the higher wisdom of insight into phenomena,’ he should base himself on internal serenity of mind and make an effort to gain the higher wisdom of insight into phenomena. Then, some time later, he gains both internal serenity of mind and the higher wisdom of insight into phenomena.",
    "an10.54:4": "(2) \"But if, by such self-examination, he knows: ‘I gain the higher wisdom of insight into phenomena but not internal serenity of mind,’ he should base himself on the higher wisdom of insight into phenomena and make an effort to gain internal serenity of mind. Then, some time later, he gains both the higher wisdom of insight into phenomena and internal serenity of mind.",
    "an10.54:5": "(3) \"But if, by such self-examination, he knows: ‘I gain neither internal serenity of mind nor the higher wisdom of insight into phenomena,’ he should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to obtain both those wholesome qualities. Just as one whose clothes or head had caught fire would put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to extinguishthe fire onhis clothes or head, so that bhikkhu should put forth extraordinary desire,effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to obtain both those wholesome qualities. Then, some time later, he gains both internal serenity of mind and the higher wisdom of insight into phenomena.",
    "an10.54:6": "(4) \"But if, by such self-examination, he knows: ‘I gain both internal serenity of mind and the higher wisdom of insight into phenomena,’ he should base himself on those same wholesome qualities and make a further effort to reach the destruction of the taints.",
    "an10.54:7": "\"Robes, I say, are twofold: to be used and those not to be used.[n.2064] This portion of the sutta is modeled uponAN9.6, but it takes associating with a person last and does not treat it in as much detail.Almsfood too, I say, is twofold: that to be used and that not to be used. Lodgings too, I say, are twofold: those to be used and those not to be used. Villages or towns too, I say, are twofold: those to be resorted to and those not to be resorted to. Countries or regions too, I say, are twofold: those to be resorted to and those not to be resorted to. Persons too, I say, are twofold: those to be associated with and those not to be associated with.",
    "an10.54:8": "(5) \"When it was said: ‘Robes, I say, are twofold: those to be used and those not to be used,’ for what reason was this said? If one knows of a robe: ‘When I use this robe, unwholesome qualities increase in me and wholesome qualities decline,’ one should not use such a robe. But if one knows of a robe: ‘When I use this robe, unwholesome qualities decline in me and wholesome qualities increase,’ one should use such a robe. When it was said: ‘Robes, I say, are twofold: to be used and not to be used,’ it is because of this that this was said.",
    "an10.54:9": "(6) \"When it was said: ‘Almsfood too, I say, is twofold: that to be used and that not to be used,’ for what reason was this said? If one knows of some almsfood: ‘When I use this almsfood, unwholesome qualities increase in me and wholesomequalities decline,’ one should not use such almsfood. But if one knows of some almsfood: ‘When I use this almsfood, unwholesome qualities decline in me and wholesome qualities increase,’ one should use such almsfood. When it was said: ‘Almsfood too, I say, is twofold: that to be used and that not to be used,’ it is because of this that this was said.",
    "an10.54:10": "(7) \"When it was said: ‘Lodgings too, I say, are twofold: those to be used and those not to be used,’ for what reason was this said? If one knows of a lodging: ‘When I use this lodging, unwholesome qualities increase in me and wholesome qualities decline,’ one should not use such a lodging. But if one knows of a lodging: ‘When I use this lodging, unwholesome qualities decline in me and wholesome qualities increase,’ one should use such a lodging. When it was said: ‘Lodgings too, I say, are twofold: those to be used and those not to be used,’ it is because of this that this was said.",
    "an10.54:11": "(8) \"When it was said: ‘Villages or towns too, I say, are twofold: those to be resorted to and those not to be resorted to,’ for what reason was this said? If one knows of a village or town: ‘When I resort to this village or town, unwholesome qualities increase in me and wholesome qualities decline,’ one should not resort to such a village or town. But if one knows of a village or town: ‘When I resort to this village or town, unwholesome qualities decline in me and wholesome qualities increase,’ one should resort to such a village or town. When it was said: ‘Villages or towns too, I say, are twofold: those to be resorted to and those not to be resorted to,’ it is because of this that this was said.",
    "an10.54:12": "(9) \"When it was said: ‘Countries or regions too, I say, are twofold: those to be resorted to and those not to be resorted to,’ for what reason was this said? If one knows of a country or region: ‘When I resort to this country or region, unwholesome qualities increase in meand wholesome qualities decline,’ one should not resort to such a country or region. But if one knows of a country or region: ‘When I resort to this country or region, unwholesome qualities decline in me and wholesome qualities increase,’ one should resort to such a country or region. When it was said: ‘Countries or regions too, I say, are twofold: those to be resorted to and those not to be resorted to,’ it is because of this that this was said.\"",
    "an10.54:13": "(10) \"When it was said: ‘Persons too, I say, are twofold: those to be associated with and those not to be associated with,’ for what reason was this said? If one knows of a person: ‘When I associate with this person, unwholesome qualities increase in me and wholesome qualities decline,’ one should not associate with such a person. But if one knows of a person: ‘When I associate with this person, unwholesome qualities decline in me and wholesome qualities increase,’ one should associate with such a person. When it was said: ‘Persons too, I say, are twofold: those to be associated with and those not to be associated with,’ it is because of this that this was said.\""
}