{
    "an10.14:1": "\"Bhikkhus, if any bhikkhu or bhikkhunī has not abandoned five kinds of mental barrenness and eradicated five bondages of the mind, then, whether night or day comes, only deterioration in wholesome qualities and not growth is to be expected for this person.",
    "an10.14:2": "\"What are the five kinds of mental barrenness that he has not abandoned?",
    "an10.14:3": "(2) –(5) \"Again, a bhikkhu is perplexed about the Dhamma … perplexed about the Saṅgha … perplexed about the training … is irritated by his fellow monks, displeased with them, aggressive toward them, ill disposed toward them. When a bhikkhu is irritated by his fellow monks, displeased with them, aggressive toward them, ill disposed toward them, his mind does not incline to ardor, effort, perseverance, and striving. Since his mind does not incline to ardor … and striving, this is the fifth kind of mental barrenness that he has not abandoned.",
    "an10.14:4": "\"What are the five bondages of the mind that he has not eradicated?",
    "an10.14:5": "(7) –(10) \"Again, a bhikkhu is not devoid of lust for the body, not devoid of desire, affection, thirst, passion, and craving for it …. He is not devoid of lust for form, not devoid of desire, affection, thirst, passion, and craving for it …. Having eaten as much as he wants until his belly is full, he is intent upon the pleasure of rest, the pleasure of sloth, the pleasure of sleep … he lives the spiritual life aspiring forrebirth ina certain order of devas,thinking: ‘By this virtuous behavior, observance, austerity, or spiritual life I will be a deva or onein the retinueof the devas.’ When he lives the spiritual life aspiring forrebirth ina certain order of devas … his mind does not inclineto ardor, effort, perseverance, and striving. Since his mind does not incline to ardor … and striving, this is the fifth bondage of the mind that he has not eradicated.",
    "an10.14:6": "\"If any bhikkhu or bhikkhunī has not abandoned these five kinds of mental barrenness and eradicated these five bondages of the mind, then, whether night or day comes, only deterioration and not growth in wholesome qualities is to be expected for that person.",
    "an10.14:7": "Just as during the dark fortnight, whether night or day comes, the moon only deteriorates in beauty, roundness, and brightness, in diameter and circumference, so too, if any bhikkhu or bhikkhunī has not abandoned these five kinds of mental barrenness … only deterioration … is to be expected for that person.",
    "an10.14:8": "\"Bhikkhus, if any bhikkhu or bhikkhunī has abandoned five kinds of mental barrenness and eradicated five bondages of the mind,[n.1976] Perhaps, withBe,we should readsusamucchinnāhere, but I follow Ce and Ee, which have simplysamucchinnāhere, thoughsusamucchinnābelow.then, whether night or day comes, only growth in wholesome qualities and not deterioration is to be expected for that person.",
    "an10.14:11": "\"What are the five bondages of the mind that he has well eradicated?",
    "an10.14:12": "(7) –(10) \"Again, a bhikkhu is devoid of lust for the body, devoid of desire, affection, thirst, passion, and craving for it …. He is devoid of lust for form, devoid of desire, affection, thirst, passion, and craving for it …. He does not eat as much as he wants until his belly is full nor is he intent upon the pleasure of rest, the pleasure of sloth, the pleasure of sleep …. He does not live the spiritual life aspiring forrebirth ina certain order of devas,thinking: ‘By this virtuous behavior, observance, austerity, or spiritual life I will be a deva or onein the retinueof the devas.’ Since he does not live the spiritual life aspiring forrebirth ina certain order of devas … his mind inclines to ardor, effort, perseverance, and striving. Since his mind inclines to ardor … and striving, this is the fifth bondage of the mind that he has well eradicated.",
    "an10.14:13": "\"If any bhikkhu or bhikkhunī has abandoned these five kinds of mental barrenness and well eradicated these five bondages of the mind,then, whether night or day comes, only growth in wholesome qualities and not deterioration is to be expected for that person.",
    "an10.14:14": "Just as during the bright fortnight, whether night or day comes, the moon only increases in beauty, roundness, and brightness, in diameter and circumference, so too, if any bhikkhu or bhikkhunī has abandoned these five kinds of mental barrenness and well eradicated these five bondages of the mind, then, whether night or day comes, only growth in wholesome qualities and not deterioration is to be expected for that person.\""
}