{
    "an10.18:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\"—\"Venerable sir,\" they replied. The Blessed One said this:",
    "an10.18:2": "(1) \"Here, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them.Having considered:‘This bhikkhu is truly virtuous …. Having undertaken the training rules, he trains in them,’ the elder bhikkhus,those of middle standing, and the junior bhikkhus think he should be corrected and instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This is a quality that serves as a protector.",
    "an10.18:3": "(2) \"Again, a bhikkhu has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning … with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally, investigated mentally, and penetrated well by view.Having considered:‘This bhikkhu has truly learned much … and penetrated well by view,’ the elder bhikkhus, those of middle standing, and the junior bhikkhus think he should be corrected and instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This, too, is a quality that serves as a protector.",
    "an10.18:4": "(3) \"Again, a bhikkhu has good friends, good companions, good comrades.Having considered:‘This bhikkhu truly has good friends, good companions, good comrades,’ the elder bhikkhus, those of middle standing, and the junior bhikkhus think he should be corrected and instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This, too, is a quality that serves as a protector.",
    "an10.18:5": "(4) \"Again, a bhikkhu is easy to correct and possesses qualities that make him easy to correct; he is patient and receives instruction respectfully.Having considered:‘This bhikkhu is truly easy to correct and possesses qualities that make him easy to correct; he is patient and receives instruction respectfully,’ the elder bhikkhus,those of middle standing, and the junior bhikkhus think he should be corrected and instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This, too, is a quality that serves as a protector.",
    "an10.18:6": "(5) \"Again, a bhikkhu is skillful and diligent in attending to the diverse chores that are to be done for his fellow monks; he possesses sound judgment about them in order to carry out and arrange them properly.Having considered:‘This bhikkhu is truly skillful and diligent … in order to carry out and arrange them properly,’ the elder bhikkhus, those of middle standing, and the junior bhikkhus think he should be corrected and instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This, too, is a quality that serves as a protector.",
    "an10.18:7": "(6) \"Again, a bhikkhu loves the Dhamma and is pleasing in his assertions, filled with a lofty joy pertaining to the Dhamma and discipline.Having considered:‘This bhikkhu truly loves the Dhamma and is pleasing in his assertions, filled with a lofty joy pertaining to the Dhamma and discipline,’ the elder bhikkhus, those of middle standing, and the junior bhikkhus think he should be corrected and instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This, too, is a quality that serves as a protector.",
    "an10.18:8": "(7) \"Again, a bhikkhu has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities.Having considered:‘This bhikkhu truly has aroused energy …… not casting off the duty of cultivating wholesome qualities,’ the elder bhikkhus, those of middle standing, and the junior bhikkhus think he should be corrected and instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This, too, is a quality that serves as a protector.",
    "an10.18:9": "(8) \"Again, a bhikkhu is content with any kind of robe, almsfood, lodging, and medicines and provisions for the sick.Having considered:‘This bhikkhu truly is content with any kind of robe, almsfood, lodging, and medicines and provisions for the sick,’ the elder bhikkhus, those of middle standing, and the junior bhikkhus think he should be corrected and instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This, too, is a quality that serves as a protector.",
    "an10.18:10": "(9) \"Again, a bhikkhu is mindful, possessing supreme mindfulness and alertness, one who remembers and recollects what was done and said long ago.Having considered:‘This bhikkhu truly is mindful, possessing supreme mindfulness and alertness, one who remembers and recollects what was done and said long ago,’ the elder bhikkhus, those of middle standing, and the junior bhikkhus think he should be corrected and instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This, too, is a quality that serves as a protector.",
    "an10.18:11": "(10) \"Again, a bhikkhu is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering.Having considered:‘This bhikkhu truly is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering,’ the elder bhikkhus, those of middle standing, and the junior bhikkhus think he should be correctedand instructed. Since they all have compassion for him, only growth in wholesome qualities and not decline is to be expected for him. This, too, is a quality that serves as a protector.",
    "an10.18:12": "\"Bhikkhus, live under a protector, not without a protector. One without a protector lives in suffering. These are the ten qualities that serve as a protector.\""
}