{
    "an10.60:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the Venerable Girimānanda was sick, afflicted, and gravely ill.[n.2074] Apart from this text there is no further information about Girimānanda in the Nikāyas. In Theravāda Buddhist countries this sutta has achieved the status of aparitta, a \"protective discourse,\" which bhikkhus often recite to people afflicted with illness.Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an10.60:2": "\"Bhante, the Venerable Girimānanda is sick, afflicted, and gravely ill. It would be good if the Blessed One would visit him out of compassion.\"",
    "an10.60:3": "What are the ten?",
    "an10.60:4": "(1) \"And what, Ānanda, is the perception of impermanence? Here, having gone to the forest, to the foot of a tree, or to an empty hut, a bhikkhu reflects thus: ‘Form is impermanent, feeling is impermanent, perception is impermanent, volitional activities are impermanent, consciousness is impermanent.’ Thus he dwells contemplating impermanence in these five aggregates subject to clinging. This is called the perception of impermanence.",
    "an10.60:5": "(2) \"And what, Ānanda, is the perception of non-self? Here, having gone to the forest, to the foot of a tree, or to an empty hut, a bhikkhu reflects thus: ‘The eye is non-self, forms are non-self; the ear is non-self, sounds are non-self; the nose is non-self, odours are non-self; the tongue is non-self, tastes are non-self; the body is non-self, tactile objects are non-self; the mind is non-self, mental phenomena are non-self.’ Thus he dwells contemplating non-self in these six internal and external sense bases. This is called the perception of non-self.",
    "an10.60:6": "(3) \"And what, Ānanda, is the perception of unattractiveness? Here, a bhikkhu reviews this very body upward from the soles of the feet and downward from the tips of the hairs, enclosed in skin, as full of many kinds of impurities: ‘There are in this body hair of the head, hair of the body, nails, teeth, skin, flesh, sinews, bones, bone marrow, kidneys, heart, liver, pleura, spleen, lungs, intestines, mesentery, stomach, excrement, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, snot, fluid of the joints, urine.’ Thus he dwells contemplating unattractiveness in this body. This is called the perception of unattractiveness.",
    "an10.60:7": "(4) \"And what, Ānanda, is the perception of danger? Here, having gone to the forest, to the foot of a tree, or to an empty hut, a bhikkhu reflects thus: ‘This body is the source of much painand danger; for all sorts of afflictions arise in this body, that is, eye-disease, disease of the inner ear, nose-disease, tongue-disease, body-disease, head-disease, disease of the external ear, mouth-disease, tooth-disease,[n.205] In Be only,oṭṭharogo, lip disease, is betweendantarogoandkāso.cough, asthma, catarrh, pyrexia, fever, stomach ache, fainting, dysentery, gripes, cholera, leprosy, boils, eczema, tuberculosis, epilepsy, ringworm, itch, scab, chickenpox, scabies, hemorrhage, diabetes, hemorrhoids, cancer, fistula; illnesses originating from bile, phlegm, wind, or their combination; illnesses produced by change of climate; illnesses produced by careless behavior; illnesses produced by assault; or illnesses produced as the result of kamma; and cold, heat, hunger, thirst, defecation, and urination.’ Thus he dwells contemplating danger in this body. This is called the perception of danger.",
    "an10.60:8": "(5) \"And what, Ānanda, is the perception of abandoning? Here, a bhikkhu does not tolerate an arisen sensual thought; he abandons it, dispels it, terminates it, and obliterates it. He does not tolerate an arisen thought of ill will … an arisen thought of harming … bad unwholesome states whenever they arise; he abandons them, dispels them, terminates them, and obliterates them. This is called the perception of abandoning.",
    "an10.60:9": "(6) \"And what, Ānanda, is the perception of dispassion? Here, having gone to the forest, to the root of a tree, or to an empty hut, a bhikkhu reflects thus: ‘This is peaceful, this is sublime, that is, the stilling of all activities, the relinquishment of all acquisitions, the destruction of craving, dispassion, nibbāna.’ This is called the perception of dispassion.[n.2076] Both this and the following perception are reflective contemplations on nibbāna. In the classical scheme of forty meditation subjects, they can be subsumed under the \"recollection of peace\"(upasamānussati), explained at Vism 23–4, Ppn 8:245–51.",
    "an10.60:10": "(7) \"And what, Ānanda, is the perception of cessation? Here, having gone to the forest, to the root of a tree, or to an empty hut, a bhikkhu reflects thus: ‘This is peaceful,this is sublime, that is, the stilling of all activities, the relinquishment of all acquisitions, the destruction of craving, cessation, nibbāna.’ This is called the perception of cessation.",
    "an10.60:11": "(8) \"And what, Ānanda, is the perception of non-delight in the entire world? Here, a bhikkhu refrains from[n.2077] WhereCeand Ee readpajahanto viramati anupādiyanto, Be haspajahanto viharati anupādiyanto.Mpoffers no clarification.any engagement and clinging, mental standpoints, adherences, and underlying tendencies in regard to the world, abandoning them without clinging to them. This is called the perception of non-delight in the entire world.",
    "an10.60:12": "(9) \"And what, Ānanda, is the perception of impermanence in all conditioned phenomena? Here, a bhikkhu is repelled, humiliated, and disgusted by all conditioned phenomena. This is called the perception of impermanence in all conditioned phenomena.[n.2078] It is hard to see exactly how the explanation is connected to the theme of impermanence. Some manuscripts read this perception assabbasaṅkhāresu anicchāsaññā,\"perception of wishlessness (or desirelessness) in regard to all conditioned phenomena,\" which seems to tie up better with the definition.",
    "an10.60:13": "(10) \"And what, Ānanda, is mindfulness of breathing? Here, a bhikkhu, having gone to the forest, to the foot of a tree, or to an empty hut, sits down. Having folded his legs crosswise, straightened his body, and established mindfulness in front of him, just mindful he breathes in, mindful he breathes out.",
    "an10.60:14": "\"If, Ānanda, you visit the bhikkhu Girimānanda and speak to him about these ten perceptions, it is possible that on hearing about them he will immediately recover from his affliction.\"",
    "an10.60:15": "Then, when the Venerable Ānanda had learned these ten perceptions from the Blessed One, he went to the Venerable Girimānanda and spoke to him about them. When the Venerable Girimānanda heard about these ten perceptions, his affliction immediately subsided. The Venerable Girimānanda recovered from that affliction, and that is how he was cured of his affliction."
}