{
    "an10.216:1": "\"Bhikkhus, I will teach you an exposition of the Dhamma on creeping.[n.277]Saṁsappanīyapariyāyaṁ vo bhikkhave dhammapariyāyaṁ desessāmi.Mp:\"An exposition of the Dhamma that has ‘creeping’ as its subject matter.\"Listen and attend closely. I will speak.\"",
    "an10.216:2": "\"And what, bhikkhus, is that exposition of the Dhamma on creeping? Bhikkhus, beings are the owners of their kamma, the heirs of their kamma; they have kamma as their origin, kamma as their relative, kamma as their resort; whatever kamma they do, good or bad, they are its heirs.",
    "an10.216:3": "(1) \"Here, someone destroys life; he is murderous, bloody-handed, given to blows and violence, merciless to living beings. He creeps along by body, speech, and mind.[n.2178]Mp:\"In doing that action he creeps forward, creeps around, wriggles around.\"His bodily kamma is crooked; his verbal kamma is crooked; his mental kamma is crooked. His destination is crooked; his rebirth is crooked.",
    "an10.216:4": "But for one with a crooked destination and rebirth, I say, there is one of two destinations: either the exclusively painful hells or a species of creeping animal. And what are the species of creeping animals? The snake, the scorpion, the centipede, the mongoose, the cat, the mouse, and the owl,[n.2179]Ulūkā. The owl may have been included here because it operates furtively. The Chinese counterpart atT I 273c27–28mentions only four animals: the snake, the mouse, the cat, and the fox.or any other animals that creep away when they see people. Thus a being is reborn from a being; one is reborn through one's deeds. When one has been reborn, contacts affect one. It is in this way, I say, that beings are the heirs of their kamma.",
    "an10.216:5-6": "(2) \"Someone takes what is not given … (3) … engages in sexual misconduct … (4) … speaks falsehood … (5) … speaks divisively … (6) … speaks harshly … (7) … indulges in idle chatter … (8) … is full of longing … (9) … has a mind of ill will and intentions of hate … (10) … holds wrong view and has an incorrect perspective thus: ‘There is nothing given … there are in the world no ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’ He creeps along by body, speech, and mind. His bodily kamma is crooked … His destination is crooked;his rebirth is crooked …. Thus a being is reborn from a being; one is reborn through one's deeds. When one has been reborn, contacts affect one. It is in this way, I say, that beings are the heirs of their kamma.",
    "an10.216:7": "(1) \"Here, having abandoned the destruction of life, someone abstains from the destruction of life; with the rod and weapon laid aside, conscientious and kindly, he dwells compassionate toward all living beings. He does not creep along by body, speech, and mind. His bodily kamma is straight; his verbal kamma is straight; his mental kamma is straight. His destination is straight; his rebirth is straight.",
    "an10.216:8": "But for one with a straight destination and rebirth, I say, there is one of two destinations: either the exclusively pleasant heavens or eminent families, such as those of affluent khattiyas, affluent brahmins, or affluent householders,families that arerich, with great wealth and property, abundant gold and silver, abundant treasures and belongings, abundant wealth and grain. Thus a being is reborn from a being; one is reborn through one's deeds. When one has been reborn, contacts affect one. It is in this way, I say, that beings are the heirs of their kamma.",
    "an10.216:9-10": "(2) \"Having abandoned the taking of what is not given, someone abstains from taking what is not given … (3) … abstains from sexual misconduct …(4) … abstains from false speech … (5) … abstains from divisive speech … (6) … abstains from harsh speech … (7) … abstains from idle chatter … (8) … is without longing … (9) … is of good will … (10) … holds right view and has a correct perspective thus: ‘There is what is given … there are in the world ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’ He does not creep along by body, speech, and mind. His bodily kamma is straight … His destination is straight; his rebirth is straight …. Thus a being is reborn from a being; one is reborn through one's deeds. When one has been reborn, contacts affect one. It is in this way, I say, that beings are the heirs of their kamma.",
    "an10.216:11": "\"Bhikkhus, beings are the owners of their kamma, the heirs of their kamma; they have kamma as their origin, kamma as their relative, kamma as their resort; whatever kamma they do, good or bad, they are its heirs."
}