{
    "an10.119:1-2": "Now on that occasion, on the uposatha day, the brahmin Jāṇussoṇī stood to one side not far from the Blessed One, with his head washed, wearing a new pair of linen clothes, holding a handful of wetkusagrass. The Blessed One saw him standing there and said to him:",
    "an10.119:3": "\"But how do the brahmins observe thepaccorohaṇīfestival?\"",
    "an10.119:4": "\"Thepaccorohaṇīfestival in the Noble One's discipline, brahmin, is quite different from thepaccorohaṇīfestival of the brahmins.\"",
    "an10.119:5": "\"Well then, brahmin, listen and attend closely. I will speak.\"",
    "an10.119:6": "(1) \"Here, brahmin, the noble disciple reflects thus: ‘The result of wrong view is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong view; he descends from wrong view.",
    "an10.119:7": "(2) \" … ‘The result of wrong intention is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong intention; he descends from wrong intention.",
    "an10.119:8": "(3) \" … ‘The result of wrong speech is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong speech; he descends from wrong speech.",
    "an10.119:9": "(4) \" … ‘The result of wrong action is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong action; he descends from wrong action.",
    "an10.119:10": "(5) \" … ‘The result of wrong livelihood is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong livelihood; he descends from wrong livelihood.",
    "an10.119:11": "(6) \" … ‘The result of wrong effort is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong effort; he descends from wrong effort.",
    "an10.119:12": "(7) \" … ‘The result of wrong mindfulness is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong mindfulness; he descends from wrong mindfulness.",
    "an10.119:13": "(8) \" … ‘The result of wrong concentration is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong concentration; he descends from wrong concentration.",
    "an10.119:14": "(9) \" … ‘The result of wrong knowledge is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong knowledge; he descends from wrong knowledge.",
    "an10.119:15": "(10) \" … ‘The result of wrong liberation is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong liberation; he descends from wrong liberation.",
    "an10.119:16": "\"Thepaccorohaṇīfestival in the Noble One's discipline, Master Gotama, is quite different from thepaccorohaṇīfestival of the brahmins. And thepaccorohaṇīfestival of the brahmins is not worth a sixteenth part of thepaccorohaṇīfestival in the Noble One's discipline."
}