{
    "an10.107:1": "\"Bhikkhus, there is a country in the south named Dhovana[n.246]Mpexplains that in this country, people do not cremate their dead relatives but bury them. After their bodies have decayed, they excavate the bones, wash them, arrange them in order, and worship them with scents and garlands. When an (auspicious) constellation arrives, they take the bones and wail and lament, after which they play (the game of) constellation.‘Washing’, where there is food, drink, victuals, comestibles, refreshments, tonics, dancing, singing, and music. There is this ‘Washing,’ bhikkhus; that I do not deny. Yet this ‘Washing’ is low, common, for worldlings, ignoble, unbeneficial; it does not lead to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to nibbāna.",
    "an10.107:2": "\"But I will teach, bhikkhus, a noble washing that leads exclusively to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to nibbāna. In dependence on this washing, beings subject to birth are freed from birth; beings subject to old age are freed from old age; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, dejection, and anguish are freed from sorrow, lamentation, pain, dejection, and anguish. Listen and attend closely. I will speak.\"",
    "an10.107:3": "\"And what, bhikkhus, is that noble washing?",
    "an10.107:4": "(1) \"For one of right view, wrong view is washed away, and the numerous bad unwholesome qualities that originate with wrong view as condition are also washed away, and with right view as condition, numerous wholesome qualities reach fulfillment by development.",
    "an10.107:5": "(2) –(9) \"For one of right intention, wrong intention is washed away … For one of right speech, wrong speech is washed away … For one of right action, wrong action is washed away … For one of right livelihood, wrong livelihood is washed away … For one of right effort, wrong effort is washed away … For one of right mindfulness, wrong mindfulness is washed away … For one of right concentration, wrong concentration is washed away … For one of right knowledge, wrong knowledge is washed away …",
    "an10.107:6": "(10) \"For one of right liberation, wrong liberation is washed away, and the numerous bad unwholesome qualities that originate with wrong liberation as condition are also washed away, and with right liberation as condition, numerous wholesome qualities reach fulfillment by development."
}