{
    "an10.26:1": "On one occasion the Venerable Mahākaccāna was dwelling among the people of Avantī on Mount Pavatta at Kuraraghara. Then the female lay follower Kāḷī of Kuraraghara approached him, paid homage to him, sat down to one side, and said to him:[n.997] AtAN.267Kāḷī is called the \"foremost of those whose confidence is based on hearsay.\" Apparently she never met the Buddha but based her trust in him on what she heard from others.",
    "an10.26:2": "\"‘Having conquered the army of the pleasant and agreeable,meditating alone, I discovered bliss,the attainment of the goal, the peace of the heart.Therefore I don’t form intimate ties with people,nor does intimacy with anyone get a chance with me.’",
    "an10.26:3": "\"How, Bhante, is the meaning of this statement that the Blessed One spoke in brief to be seen in detail?\"",
    "an10.26:4": "\"Some ascetics and brahmins, sister, for whom the attainment of the earthkasiṇais supreme, generated it as their goal.[n.1999]Ceand Ee:atthābhinibbattesuṁ. Be:attho ti abhinibbattesuṁ.Mp:\"They generated it, thinking the attainment of the earthkasiṇais supreme, taking it as the ultimate goal.\"The Blessed One directly knew to what extent the attainment of the earthkasiṇais supreme. Having directly known this, he saw the beginning,[n.2000] Ce and Eeādimaddasa; Beassādamaddasa. TheCeand Ee reading here is unusual. The standard triad is gratification, danger, and escape(assāda,ādīnava,nissaraṇa), which we find here in Be. The Chinese parallel SĀ 59 (T II 13a2–b17) provides a check on the two alternatives. Though SĀ 59 differs in some respects, the list of insights regarding thekasiṇasreads: \"(He) saw its origin, saw the danger, saw cessation, saw the path to cessation\". The Chinese charactercorresponds to Pāliādi, not toassāda, thus supporting Ce and Ee against Be, which may have normalized the reading. The Ce and Be readings ofMpdiffer with respect to the same word.the danger, and the escape, and he saw the knowledge and vision of the path and the non-path. By seeing the beginning, the danger, and the escape, and by seeing the knowledge and vision of the path and the non-path, he knew the attainment of the goal, the peace of the heart.",
    "an10.26:5": "\"Some ascetics and brahmins, sister, for whom the attainment of the waterkasiṇa… the firekasiṇa… the airkasiṇa… the bluekasiṇa… the yellowkasiṇa… the redkasiṇa… the whitekasiṇa… the spacekasiṇa… the consciousnesskasiṇais supreme, generated it as their goal. The Blessed One directly knew to what extent the attainment of the consciousnesskasiṇais supreme. Having directly known this, he saw the beginning, the danger, and the escape, and he saw the knowledge and vision of the path and the non-path. By seeing the beginning, the danger, and the escape, and by seeing the knowledge and vision of the path and the non-path, he knew the attainment of the goal, the peace of the heart.",
    "an10.26:6": "\"‘Having conquered the army of the pleasant and agreeable,meditating alone, I discovered bliss,the attainment of the goal, the peace of the heart.Therefore I don’t form intimate ties with people,nor does intimacy with anyone succeed in my case.’\""
}