{
    "an10.72:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood together with a number of very well-known elder disciples: the Venerable Cāla, the Venerable Upacāla, the Venerable Kakkaṭa, the Venerable Kaṭimbha, the Venerable Kaṭa, the Venerable Kaṭissaṅga, and other very well-known elder disciples.",
    "an10.72:2": "Now on that occasion a number of very well-known Licchavis had entered the Great Wood in order to see the Blessed One, and as they followed one another in their finest carriages they made an uproar and a racket. It then occurred to those venerable ones: \"A number of very well-known Licchavis have entered the Great Wood in order to see the Blessed One, and as they follow one another in their finest carriages they are making an uproar and a racket. Now the Blessed One has called noise a thorn to the jhānas. Let us go to the Gosiṅga Sal Woods.There we can dwell at ease, without noise and without any crowds.\" Then those venerable ones went to the Gosiṅga Sal Woods, where they dwelt at ease, without noise and crowds.",
    "an10.72:3": "Then the Blessed One addressed the bhikkhus: \"Bhikkhus, where is Cāla? Where is Upacāla? Where is Kakkaṭa? Where is Kaṭimbha? Where is Kaṭa? Where is Kaṭissaṅga? Where have those elder disciples gone?\"",
    "an10.72:4": "\"Bhante, it occurred to those venerable ones: ‘A number of very well-known Licchavis … are making an uproar and a racket …. Let us go to the Gosiṅga Sal Woods, where we can dwell at ease, without noise and crowds.’ So they went to the Gosiṅga Sal Woods, where they dwell at ease, without noise and crowds.\"",
    "an10.72:5": "\"Good, good, bhikkhus! Those great disciples spoke rightly when they said that I have called noise a thorn to the jhānas.",
    "an10.72:6": "There are, bhikkhus, these ten thorns. What ten? (1) Delight in company is a thorn to one who delights in solitude. (2) Pursuit of an attractive object is a thorn to one intent on meditation on the mark of the unattractive. (3) An unsuitable show is a thorn to one guarding the doors of the sense faculties. (4) Keeping company with women is a thorn to the celibate life.(5) Noise is a thorn to the first jhāna. () Thought and examination are a thorn to the second jhāna. (7) Rapture is a thorn to the third jhāna. (8) In-and-out breathing is a thorn to the fourth jhāna. (9) Perception and feeling are a thorn to the attainment of the cessation of perception and feeling. (10) Lust is a thorn, hatred is a thorn, and delusion is a thorn.",
    "an10.72:7": "Dwell thornless, bhikkhus! Dwell without thorns! The arahants are thornless. The arahants are without thorns. The arahants are thornless and without thorns.\""
}