{
    "an10.53:1": "\"Bhikkhus, I do not praise even a standstill in wholesome qualities, much less decline. I praise only growth in wholesome qualities, not a standstill or deterioration.[n.2062] I use \"decline\" to renderparihāniand \"deterioration\" to renderhāni. The two are virtually synonymous.",
    "an10.53:2": "\"And how is there deterioration—not a standstill or growth—in wholesome qualities? Here, a bhikkhu has a certain degree of faith, virtuous behavior, learning, renunciation, wisdom, and discernment. Those qualities of his do not remain the same or increase. This, I say, is deterioration rather than a standstill or growth in wholesome qualities. Thus there is deterioration—not a standstill or growth—in wholesome qualities.",
    "an10.53:3": "\"And how is there a standstill—not deterioration or growth—in wholesome qualities? Here, a bhikkhu has a certain degree of faith, virtuous behavior, learning, renunciation, wisdom, and discernment. Those qualities of his do not deteriorate or increase. This, I say, is a standstill rather than deterioration or growth in wholesome qualities. Thus there is a standstill—not deterioration or growth—in wholesome qualities.",
    "an10.53:4": "\"And how is there growth—not a stand still or deterioration—in wholesome qualities? Here, a bhikkhu has a certain degree of faith, virtuous behavior, learning, renunciation, wisdom, and discernment. Those qualities of his do not remain the same or deteriorate. This, I say, is growth rather than a standstill or deterioration in wholesome qualities. Thus there is growth—not a standstill or deterioration—in wholesome qualities.",
    "an10.53:5": "\"Bhikkhus, a bhikkhu who is not skilled in the ways of others’ mindsshould train: ‘I will be skilled in the ways of my own mind.’ It is in this way that you should train yourselves.",
    "an10.53:6": "\"And how is a bhikkhu skilled in the ways of his own mind? It is just as if a woman or a man—young, youthful, and fond of ornaments—would look at her or his own facial reflection in a clean bright mirror or in a bowl of clear water. If they see any dust or blemish there, they will make an effort to remove it. But if they do not see any dust or blemish there, they will be glad about it; and their wish fulfilled, they will think, ‘How fortunate that I’m clean!’[n.203]Ceparipuṇṇaṁshould be corrected toparisuddhaṁas in Be and Ee. Ce readsparisuddhaṁin the parallel passage occurring in the later suttas of the chapter, so it is clear thatparipuṇṇaṁis a typographical error.So too, self-examination is very helpful for a bhikkhuto growin wholesome qualities.",
    "an10.53:7": "\"If, by such self-examination, a bhikkhu knows: ‘I am often given to longing, given to ill will, overcome by dullness and drowsiness, restless, plagued by doubt, angry, defiled in mind, agitated in body, lazy, and unconcentrated,’ he should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those same bad unwholesome qualities. Just as one whose clothes or head had caught fire would put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to extinguishthe fire onhis clothes or head, so too that bhikkhu should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those same bad unwholesome qualities.",
    "an10.53:8": "\"But if, by such self-examination, a bhikkhu knows: ‘I am often without longing, without ill will, free from dullness and drowsiness, calm, free from doubt, without anger, undefiled in mind, unagitated in body, energetic, and concentrated,’ he should base himself on those same wholesome qualities and make a further effort to reach the destruction of the taints.\""
}