{
    "an10.86:1": "On one occasion the Venerable Mahākassapa was dwelling at Rājagaha in the Bamboo Grove, the squirrel sanctuary. There the VenerableMahākassapa addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an10.86:2": "\"Here, friends, a bhikkhu declares final knowledge thus: ‘I understand: \"Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.\"’",
    "an10.86:3": "\"The Tathāgata or his disciple who is a jhāna-attainer … encompasses his mind with his own mind and considers: ‘Why does this venerable one declare final knowledge thus: \"I understand: ‘Destroyed is birth … there is no more coming back to any state of being’\"?’",
    "an10.86:4": "The Tathāgata or his disciple, having encompassed his mind with his own mind, understands:",
    "an10.86:5": "‘This venerable one overestimates himself, imagines that his estimate of himself is valid, thinks that he has attained what he has not attained, accomplished what he has not accomplished, and achieved what he has not achieved, and by overestimation of himself he declares final knowledge thus: \"I understand: ‘Destroyed is birth … there is no more coming back to any state of being.’\"’",
    "an10.86:6": "\"The Tathāgata or his disciple who is a jhāna-attainer … encompasses his mind with his own mind and considers: ‘Why does this venerable one overestimate himself and imagine that his estimate of himself is valid; why does he think that he has attained what he has not attained, accomplished what he has not accomplished, and achieved what he has not achieved; and why, by overestimation of himself, does he declare final knowledge thus: \"I understand: ‘Destroyed isbirth … there is no more coming back to any state of being’\"?’",
    "an10.86:7": "\"The Tathāgata or his disciple who is a jhāna-attainer … having encompassed his mind with his own mind, understands:",
    "an10.86:8": "‘This venerable one has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally, investigated mentally, and penetrated well by view. Therefore this venerable one overestimates himself and imagines that his estimate of himself is valid; he thinks that he has attained what he has not attained, accomplished what he has not accomplished, and achieved what he has not achieved; and by overestimation of himself he declares final knowledge thus: \"I understand: ‘Destroyed is birth … there is no more coming back to any state of being.’\"’",
    "an10.86:9": "\"The Tathāgata or his disciple who is a jhāna-attainer … having encompassed his mind with his own mind, understands:",
    "an10.86:10": "(1) \"‘This venerable one is full of longing and his mind is often obsessed by longing. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by longing is a case of decline.",
    "an10.86:11": "(2) \"‘This venerable one is full of ill will and his mind is often obsessed by ill will. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by ill will is a case of decline.",
    "an10.86:12": "(3) \"‘This venerable one is given to dullness and drowsiness and his mind is often obsessed by dullness and drowsiness. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by dullness and drowsiness is a case of decline.",
    "an10.86:13": "(4) \"‘This venerable one is restless and his mind is often obsessed by restlessness. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by restlessness is a case of decline.",
    "an10.86:14": "(5) \"‘This venerable one is given to doubt and his mind is often obsessed by doubt. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by doubt is a case of decline.",
    "an10.86:15": "(6) \"‘This venerable one delights in work, takes delight in work, is devoted to delight in work.But in the Dhamma and discipline proclaimed by the Tathāgata, delight in work is a case of decline.",
    "an10.86:16": "(7) \"‘This venerable one delights in talk, takes delight in talk, is devoted to delight in talk. But in the Dhamma and discipline proclaimed by the Tathāgata, delight in talk is a case of decline.",
    "an10.86:17": "(8) \"‘This venerable one delights in sleep, takes delight in sleep, is devoted to delight in sleep. But in the Dhamma and discipline proclaimed by the Tathāgata, delight in sleep is a case of decline.",
    "an10.86:18": "(9) \"‘This venerable one delights in company, takes delight in company, is devoted to delight in company. But in the Dhamma and discipline proclaimed by the Tathāgata, delight in company is a case of decline.",
    "an10.86:19": "(10) \"‘When there is something further to be done,[n.2104] As withAN10.84§10, I prefer theBereading.this venerable one comes to a stop along the way on account of some lower achievement of distinction. But in the Dhamma and discipline proclaimed by the Tathāgata, coming to a stop along the way is a case of decline.’",
    "an10.86:20": "\"Truly, friends, it is impossible for a bhikkhu who has not abandoned these ten things to achieve growth, progress, and maturity in this Dhamma and discipline. But it is possible for a bhikkhu who has abandoned these ten things to achieve growth, progress, and maturity in this Dhamma and discipline.\""
}