{
    "an10.45:1": "\"Bhikkhus, there are these ten dangers in entering the king's inner palace. What ten?",
    "an10.45:2": "() \"Again, when the king has been busy, engaged with much work, he has had intercourse with one of the women but does not remember this, and because of their relations she has become pregnant. The king thinks: ‘No oneelse has entered here except the monk. Could this be the monk's work?’ This is the second danger in entering the king's inner palace.",
    "an10.45:3": "() \"Again, a gem has been lost in the king's inner palace. The king thinks: ‘No one else has entered here except the monk. Could this be the monk's work?’ This is the third danger in entering the king's inner palace.",
    "an10.45:4": "() \"Again, the secret deliberations of the king's inner palace have spread to others.[n.205]Ceguyhavantāshould be corrected toguyhamantā, as in Be and Ee. Hereguyhamantāalmost certainly means \"secret deliberations,\" not \"secret mantras.\"The king thinks: ‘No one else has entered here except the monk. Could this be the monk's work?’ This is the fourth danger in entering the king's inner palace.",
    "an10.45:5": "() \"Again, in the king's inner palace a father longs for his son, or a son longs for his father.[n.2046]Mpglossespatthetiwithmāretuṁ icchati, \"wishes to kill.\" I do not see how a desire to kill can be derived from the Pāli and thus prefer to takepatthetiin its usual sense, as simply \"to wish, to long for.\" My guess as to its relevance here is that a man who has fathered a son through one of the concubines wants to see his son, and a concubine's son who learns that he was sired by a man other than the king wants to meet his real father, and the king suspects the monk of being the go-between.They think: ‘No one else has entered here except the monk. Could this be the monk's work?’ This is the fifth danger in entering the king's inner palace.",
    "an10.45:6": "() \"Again, the king promotes someone. Those who are upset by this think: ‘The king has close ties with the monk. Could this be the monk's work?’ This is the sixth danger in entering the king's inner palace.",
    "an10.45:7": "() \"Again, the king demotes someone. Those who are upset by this think: ‘The king has close ties with the monk. Could this be the monk's work?’ This is the seventh danger in entering the king's inner palace.",
    "an10.45:8": "() \"Again, the king dispatches his army at an improper time. Those who are upset by this think: ‘The king has close ties with the monk. Could this be the monk's work?’ This is the eighth danger in entering the king's inner palace.",
    "an10.45:9": "() \"Again, after dispatching his army at a proper time, the king orders it to turn back while en route. Those who are upset by this think:‘The king has close ties with the monk. Could this be the monk's work?’ This is the ninth danger in entering the king's inner palace.",
    "an10.45:10": "() \"Again, in the king's inner palace there is the trampling of elephants,[n.2047] Ce and Be readhatthisammaddaṁ; Ee hashatthisammadaṁin the text, but–sammaddaṁand–sambādhaṁas alternative readings.MpBe readshatthisambādhaṁ, resolved ashatthīhi sambādhaṁ(\"crowded with elephants\"). Mp Ce allows this reading too, though its text seems corrupted. Both editions of Mp recognize the alternativehatthisammaddaṁ.horses, and chariots, as well as tantalizing forms, sounds, odours, tastes, and tactile objects that are not suitable for a monk. This is the tenth danger in entering the king's inner palace."
}