{
    "an10.48:1": "\"Bhikkhus, there are these ten things that one who has gone forth should often reflect upon. What ten?",
    "an10.48:2": "(1) \"One who has gone forth should often reflect: ‘I have entered upon a classless condition.’[n.053]Vevaṇṇiy’amhi ajjhupagato. The four main classes of Indian society in the Buddha’s time were referred to asvaṇṇa, lit., \"color,\" and thus the privative form,vivaṇṇa, should mean \"without class\" or \"classless.\"Vevaṇṇiyais the abstract noun, \"classlessness,\" implying that those who go forth give up their prior status as brahmin, khattiya, vessa, sudda, or outcast, and become known simply as ascetics following the Sakyan son (seeAN8.19§4). By the time of the commentaries the original meaning seems to have been forgotten, and thusMptakes the word in the sense of \"plain\" or \"without adornment\": \"Vevaṇṇiyais twofold: with respect to body and with respect to articles of use.Vevaṇṇiyawith respect to body means shaving off the hair and beard.Vevaṇṇiyawith respect to articles of use means wearing ochre robes made from stitched-together pieces of cloth; eating food mixed together with water in an iron or clay bowl; sleeping at the foot of a tree, etc., and lying down on mats made of reeds and grass, etc.; sitting on a strip of leather or cloth, etc.; and using fermented cow's urine, etc., for medicine. When one reflects thus, anger and conceit are abandoned.\"",
    "an10.48:3": "(2) \"One who has gone forth should often reflect: ‘My living is dependent upon others.’[n.2054]Parapaṭibaddhā me jīvikā. Monastics do not work at salaried jobs to earn money with which to purchase their requisites but receive all their material supports—robes, almsfood, lodgings, and medicines—as offerings from the lay community. One does not make use of the four requisites without having reflected upon them.",
    "an10.48:4": "(3) \"One who has gone forth should often reflect: ‘My deportment should be different.’[n.2055]Añño me ākappo karaṇīyo.Mp:\"Laypeople walk by swelling up their chest, lifting their heads high, in a playful manner, with disorderly steps. But my manner must be different. I must walk with calm sense faculties, with a calm mind, with slow and measured steps, like a cart passing through water or a rough place.\"",
    "an10.48:5": "(4) \"One who has gone forth should often reflect: ‘Do I reproach myself in regard to virtuous behavior?’[n.206] Here and in the next reflection the intended sense is conveyed more clearly in English ifnais not translated.",
    "an10.48:6": "(5) \"One who has gone forth should often reflect: ‘Do my wise fellow monks, having investigated, reproach me in regard to virtuous behavior?’",
    "an10.48:7": "(6) \"One who has gone forth should often reflect: ‘I must be parted and separated from everyone and everything dear and agreeable to me.’[n.205] This and the following reflection are inAN5.5.",
    "an10.48:8": "(7) \"One who has gone forth should often reflect: ‘I am the owner of my kamma, the heir of my kamma; I have kamma as my origin, kamma as my relative, kamma as my resort; I will be the heir of whatever kamma, good or bad, that I do.’",
    "an10.48:9": "(8) \"One who has gone forth should often reflect: ‘How am I spending my nights and days?’",
    "an10.48:10": "(9) \"One who has gone forth should often reflect: ‘Do I take delight in empty huts?’",
    "an10.48:11": "(10) \"One who has gone forth should often reflect: ‘Have I attained any superhuman distinction in knowledge and vision worthy of the noble ones, so that in my last days, when I am questioned by my fellow monks, I will not be embarrassed?’",
    "an10.48:12": "\"These, bhikkhus, are the ten things that one who has gone forth should often reflect upon.\""
}