{
    "an10.218:1": "\"Bhikkhus, I do not say that there is a termination of volitional kamma that has been done and accumulated so long as one has not experiencedits results, and that may be in this very life, or in thenextrebirth, or on some subsequent occasion. But I do not say that there is making an end of suffering so long as one has not experiencedthe results ofvolitional kamma that has been done and accumulated.",
    "an10.218:2": "\"As to this, bhikkhus, there is a threefold corruption and failure of bodily kamma, arisen from unwholesome volition, having a painful outcome and result; a fourfold corruption and failure of verbal kamma, arisen from unwholesome volition, having a painful outcome and result; and a threefold corruption and failure of mental kamma, arisen from unwholesome volition, having a painful outcome and result.",
    "an10.218:3-5": "(1) –(10) \"And how, bhikkhus, is there a threefold corruption and failure of bodily kamma … a fourfold corruption and failure of verbal kamma …… a threefold corruption and failure of mental kamma? …all as in 10:217… having a painful outcome and result.",
    "an10.218:6": "\"It is, bhikkhus, because of the threefold corruption and failure of bodily kamma, arisen from unwholesome volition … or it is because of the fourfold corruption and failure of verbal kamma, arisen from unwholesome volition … or it is because of the threefold corruption and failure of mental kamma, arisen from unwholesome volition, that with the breakup of the body, after death, beings are reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an10.218:7": "\"Bhikkhus, I do not say that there is a termination of volitional kamma that has been done and accumulated so long as one has not experiencedits results, and that may be in this very life, or in thenextrebirth, or on some subsequent occasion. But I do not say that there is making an end of suffering so long as one has not experiencedthe results ofvolitional kamma that has been done and accumulated.",
    "an10.218:8": "\"As to this, bhikkhus, there is a threefold success of bodily kamma, arisen from wholesome volition, having a pleasant outcome and result. There is a fourfold success of verbal kamma, arisen from wholesome volition, having a pleasant outcome and result. There is a threefold success of mental kamma, arisen from wholesome volition, having a pleasant outcome and result.",
    "an10.218:9-11": "(1) –(10) \"And how, bhikkhus, is there a threefold success of bodily kamma … a fourfold success of verbal kamma …… a threefold success of mental kamma? …all as in 10:217… having a painful outcome and result.",
    "an10.218:12": "\"Bhikkhus, I do not say that there is a termination of volitional kamma that has been done and accumulated so long as one has not experiencedits results, and that may be in this very life, or in thenextrebirth, or on some subsequent occasion. But I do not say that there is making an end of suffering so long as one has not experiencedthe results ofvolitional kamma that has been done and accumulated.\""
}