{
    "an10.93:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then the householder Anāthapiṇḍika left Sāvatthī in the middle of the day in order to see the Blessed One. It then occurred to him: \"It is not the proper time to see the Blessed One, who is in seclusion, nor to see the esteemed bhikkhus, who are also in seclusion. Let me go to the park of the wanderers of other sects.\"",
    "an10.93:2": "Then the householder Anāthapiṇḍika went to the park of the wanderers of other sects. Now on that occasion the wanderers of other sects had assembled and were making an uproar as they loudly and boisterously sat discussing various pointless topics. The wanderers saw the householder Anāthapiṇḍika coming in the distance and silenced one another: \"Sirs, be quiet. Sirs, do not make any noise.",
    "an10.93:3": "Then those wanderers of other sects became silent.",
    "an10.93:4": "\"So, householder, you say you don’t know the ascetic Gotama's view in its entirety. Then tell us, what is the bhikkhus’ view?\"",
    "an10.93:5": "\"So, householder, you say you don’t know the ascetic Gotama's view in its entirety and you also don’t know the bhikkhus’ view in its entirety. Then tell us, what is your view?\"",
    "an10.93:6": "When this was said, one wanderer said to the householder Anāthapiṇḍika: (1) \"‘The world is eternal; this alone is true, anything else is wrong’: such is my view, householder.\"",
    "an10.93:7": "(2) Another wanderer said: \"‘The world is non-eternal; this alone is true, anything else is wrong’: such is my view, householder.\"",
    "an10.93:8": "(3) –(4) Still another said: \"‘The world is finite’ … ‘The world is infinite’ … (5) –(6) ‘The soul and the body are the same’ … ‘The soul is one thing, the body another’ … (7) –(10) ‘The Tathāgata exists after death’ … ‘The Tathāgata does not exist after death’ … ‘The Tathāgata both exists and does not exist after death’ … ‘The Tathāgata neither exists nor does not exist after death’; this alone is true, anything else is wrong: such is my view, householder.\"[n.2124] This sutta is probably included in the Tens because of the ten views.",
    "an10.93:9": "When this was said, the householder Anāthapiṇḍika said to those wanderers: \"Bhante, this venerable one said thus: ‘\"The world is eternal; this alone is true, anything else is wrong\": such is my view,householder.’ This view of his has arisen because of his own careless attention or conditioned by someone else's utterance. Now this view has come into being and is conditioned, a product of volition, dependently originated. But whatever has come into being and is conditioned, a product of volition, dependently originated, is impermanent. Whatever is impermanent is suffering. It is just suffering that he is attached to and holds to.",
    "an10.93:10": "\"Bhante, this (other) venerable one said thus: ‘\"The world is non-eternal; this alone is true, anything else is wrong\": such is my view, householder.’ This view of his has also arisen because of his own careless attention or conditioned by someone else's utterance. Now this view has come into being and is conditioned, a product of volition, dependently originated. But whatever has come into being and is conditioned, a product of volition, dependently originated, is impermanent. Whatever is impermanent is suffering. It is just suffering that he is attached to and holds to.",
    "an10.93:11": "\"Bhante, this venerable one said thus: ‘\"The world is finite\" … \"The world is infinite\" … \"The soul and the body are the same\" … \"The soul is one thing, the body another\" … \"The Tathāgata exists after death\" … \"The Tathāgata does not exist after death\" … \"The Tathāgata both exists and does not exist after death\" … \"The Tathāgata neither exists nor does not exist after death\"; this alone is true, anything else is wrong: such is my view, householder.’ This view of his has also arisen because of his own careless attention or conditioned by someone else's utterance. Now this view has come into being and is conditioned, a product of volition, dependently originated. But whatever has come into being and is conditioned, a product of volition, dependently originated, is impermanent. Whatever is impermanent is suffering. It is just suffering that he is attached to and holds to.\"",
    "an10.93:12": "When this was said, those wanderers said to the householder Anāthapiṇḍika: \"We have each explained our own views, householder. Now tell us your view.\"",
    "an10.93:13": "\"Householder, whatever has come into being and is conditioned, a product of volition, dependently originated, is impermanent. Whatever is impermanent is suffering. It is just suffering that you are attached to and hold to.\"",
    "an10.93:14": "\"Bhante, whatever has come into being and is conditioned, a product of volition, dependently originated, is impermanent. Whatever is impermanent is suffering. Having clearly seen what is suffering as it really is with correct wisdom thus: ‘This is not mine; I am not this; this is not my self,’ I understand as it really is the superior escape from it.\"",
    "an10.93:15": "When this was said, those wanderers sat silenced, disconcerted, hunched over, downcast, glum, and speechless. Then the householder Anāthapiṇḍika, having understood that those wanderers (sat) silenced … and speechless, rose from his seat and went to the Blessed One. He paid homage to the Blessed One, sat down to one side, and reported to the Blessed One his entire conversation with those wanderers.",
    "an10.93:16": "Then the Blessed One instructed, encouraged, inspired, and gladdened the householder Anāthapiṇḍika with a Dhamma talk. Then, when the householder Anāthapiṇḍika had been instructed, encouraged, inspired, and gladdened by the Blessed One with a Dhamma talk,he rose from his seat, paid homage to the Blessed One, circumambulated him keeping the right side toward him, and departed.",
    "an10.93:17": "Then, not long after the householder Anāthapiṇḍika had left, the Blessed One addressed the bhikkhus: \"Bhikkhus, if any bhikkhu, even one ordained for a hundred years in this Dhamma and discipline, would thoroughly refute with reasoned argument the wanderers of other sects, he would refute them just as the householder Anāthapiṇḍika has done.\""
}