{
    "an10.20:1": "On one occasion the Blessed One was dwelling among the Kurus near the Kuru town named Kammāsadamma.There the Blessed One addressed the bhikkhus …. The Blessed One said this:",
    "an10.20:2": "\"Bhikkhus, there are these ten abodes of the noble ones in which the noble ones abide in the past, present, or future. What ten?",
    "an10.20:3": "(1) \"And how has a bhikkhu abandoned five factors? Here, a bhikkhu has abandoned sensual desire, ill will, dullness and drowsiness, restlessness and remorse, and doubt. It is in this way that a bhikkhu has abandoned five factors.",
    "an10.20:4": "(2) \"And how does a bhikkhu possess six factors? Here, having seen a form with the eye, a bhikkhu is neither joyful nor saddened, but dwells equanimous, mindful and clearly comprehending. Having heard a sound with the ear … Having smelled an odour with the nose … Having experienced a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, a bhikkhu is neither joyful nor saddened, but dwells equanimous, mindful and clearly comprehending.[n.1982] As atAN6.1.It is in this way that a bhikkhu possesses six factors.",
    "an10.20:5": "(3) \"And how does a bhikkhu have a single guard? Here, a bhikkhu possesses a mind guarded by mindfulness. It is in this way that a bhikkhu has a single guard.",
    "an10.20:6": "(4) \"And how does a bhikkhu have four supports? Here, having reflected, a bhikkhu uses some things, patiently endures other things, avoids still other things, and dispels still other things. It is in this way that a bhikkhu has four supports.",
    "an10.20:7": "(5) \"And how has a bhikkhu dispelled personal truths? Here, whatever ordinary personal truths may be held by ordinary ascetics and brahmins—that is, ‘The world is eternal’ or ‘The world is not eternal’; ‘The world is finite’ or ‘The world is infinite’; ‘The soul and the body are the same’ or ‘The soul is one thing and the body another’; ‘The Tathāgata exists after death’ or ‘The Tathāgata does not exist after death’ or ‘The Tathāgata both exists and does not exist after death’ or ‘The Tathāgata neither exists nor does not exist after death’—a bhikkhu has discarded and dispelled them all, given them up, rejected them, let go of them, abandoned and relinquished them. It is in this way that a bhikkhu has dispelled personal truths.",
    "an10.20:8": "(6) \"And how has a bhikkhu totally renounced seeking? Here, a bhikkhu has abandoned the search for sensual pleasures and the search for existence and has allayed the search for a spiritual life. It is in this way that a bhikkhu has totally renounced seeking.",
    "an10.20:9": "(7) \"And how has a bhikkhu purified his intentions? Here, a bhikkhu has abandoned sensual intention, intention of ill will, and intention of harming. It is in this way that a bhikkhu has purified his intentions.",
    "an10.20:10": "(8) \"And how has a bhikkhu tranquilized bodily activity? Here, with the abandoning of pleasure and pain, and with the previous passing away of joy and dejection, a bhikkhu enters and dwells in the fourth jhāna, neither painful nor pleasant, which has purification of mindfulness by equanimity. It is in this way that a bhikkhu has tranquilized bodily activity.",
    "an10.20:11": "(9) \"And how is a bhikkhu well liberated in mind? Here, a bhikkhu's mind is liberated from lust, hatred, and delusion. It is in this way that a bhikkhu is well liberated in mind.",
    "an10.20:12": "(10) \"And how is a bhikkhu well liberated by wisdom?Here, a bhikkhu understands: ‘I have abandoned lust, cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising; I have abandoned hatred … abandoned delusion, cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising.’ It is in this way that a bhikkhu is well liberated by wisdom.",
    "an10.20:13": "\"Bhikkhus, whatever noble ones in the past abided in noble abodes, all abided in these same ten noble abodes. Whatever noble ones in the future will abide in noble abodes, all will abide in these same ten noble abodes. Whatever noble ones at present abide in noble abodes, all abide in these same ten noble abodes."
}