{
    "an10.75:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the morning, the Venerable Ānanda dressed, took his bowl and robe, and went to the house of the female lay follower Migasālā, where he sat down on the seat prepared for him. Then the female lay disciple Migasālā approached the Venerable Ānanda, paid homage to him, sat down to one side, and said:",
    "an10.75:2": "\"Bhante Ānanda, just how should thisteaching of the Blessed One be understood, where one who is celibate and one who is not celibate both have exactly the same destination in their future life? My father Purāṇa was celibate, living apart, abstaining from sexual intercourse, the common person's practice. When he died, the Blessed One declared: ‘He attained to the state of a once-returner and has been reborn in the Tusita groupof devas.’ My paternal uncle Isidatta[n.09]Cepettā pi yo; Bepitāmaho, Eepettā piyo. PED explainspitāmahā(underpitar)as \"grandfather,\" which seems unlikely here. PED, underpettāpiya(epic Sktpitṛvya), gives \"father's brother, paternal uncle,\" which can thus support Ce and Ee if the spaces are eliminated. See too pp. 1758–59, note 1330.was not celibate but lived a contented married life. When he died, the Blessed One also declared: ‘He attained to the state of a once-returner and has been reborn in the Tusita groupof devas.’",
    "an10.75:3": "Bhante Ānanda, just how should this teaching of the Blessed One be understood, where one who is celibate and one who is not celibate both have exactly the same destination in their future life?\"",
    "an10.75:4-7": "Then, when the Venerable Ānanda had received almsfood at Migasālā's house, he rose from his seat and departed. After his meal, on returning from his alms round, he went to the Blessed One, paid homage to him, sat down to one side, and said: \"Here, Bhante, in the morning, I dressed, took my bowl and robe, and went to the house of the female lay follower Migasālā ….all as above, down to… When she asked me this, I replied: ‘It was just in this way, sister, that the Blessed One declared it.’\"",
    "an10.75:8": "The Blessed One said:\"Who, indeed, is the female lay follower Migasālā, a foolish, incompetent woman with a woman's intellect? And who are thosewho havethe knowledge of other persons as superior and inferior?[n.2093] I takeCe–ñāṇohere to be a misprint for–ñāṇe, which occurs in the repetition of the statement toward the end of the sutta. InAN6.44, Ce has–ñāṇein both places.",
    "an10.75:9": "\"There are, Ānanda, these ten types of persons found existing in the world. What ten?",
    "an10.75:10": "(2) \"Then, Ānanda, there is one person who is immoral yet understands as it really is that liberation of mind, liberation by wisdom,where that immorality of his ceases without remainder. And he has listenedto the teachings, become learnedin them, penetratedthemby view, and he attains temporary liberation. With the breakup of the body, after death, he heads for distinction, not for deterioration; he is one going to distinction, not to deterioration.",
    "an10.75:11": "\"Ānanda, those who are judgmental will pass such judgment on them: ‘This one has the same qualities as the other. Why should one be inferior and the other superior?’ Thatjudgmentof theirs will indeed lead to their harm and suffering for a long time.",
    "an10.75:12": "\"Between them, Ānanda, the person who is immoral, and who understands as it really is that liberation of mind, liberation by wisdom, where that immorality of his ceases without remainder; who has listenedto the teachings, become learnedin them, penetratedthemby view, and who attains temporary liberation, surpasses and excels the other person. For what reason? Because the Dhamma-stream carries him along. But who can know this difference except the Tathāgata?",
    "an10.75:13": "(3) \"Then, Ānanda, there is one person who is virtuous yet does not understand as it really is that liberation of mind, liberation by wisdom, where that virtuous behavior of his ceases without remainder. And he has not listenedto the teachings… he does not attain temporary liberation. With the breakup of the body, after death, he heads for deterioration, not for distinction; he is one going to deterioration, not to distinction.",
    "an10.75:14": "(4) \"Then, Ānanda, there is one person who is virtuous and understands as it really is that liberation of mind, liberation by wisdom, where that virtuous behavior of his ceases without remainder. And he has listenedto the teachings… and he attains temporary liberation. With the breakup of the body, after death, he heads for distinction, not for deterioration; he is one going to distinction, not to deterioration.",
    "an10.75:15": "\"Ānanda, those who are judgmental will pass such judgment on them … I alone, or one like me, may pass judgment on people.",
    "an10.75:16": "(5) \"Then, Ānanda, there is one person who is strongly prone to lust and does not understand as it really is that liberation of mind, liberation by wisdom, where that lust of his ceases without remainder. And he has not listenedto the teachings… he does not attain temporary liberation. With the breakup of the body, after death, he heads for deterioration, not for distinction; he is one going to deterioration, not to distinction.",
    "an10.75:17": "(6) \"Then, Ānanda, there is one person who is strongly prone to lust yet understands as it really is that liberation of mind, liberation by wisdom, where that lust of his ceases without remainder. And he has listenedto the teachings… and he attains temporary liberation.With the breakup of the body, after death, he heads for distinction, not for deterioration; he is one going to distinction, not to deterioration.",
    "an10.75:18": "\"Ānanda, those who are judgmental will pass such judgment on them …. I alone, or one like me, may pass judgment on people.",
    "an10.75:19": "(7) \"Then, Ānanda, there is one person who is prone to anger and does not understand as it really is that liberation of mind, liberation by wisdom, where that anger of his ceases without remainder. And he has not listenedto the teachings… he does not attain temporary liberation. With the breakup of the body, after death, he heads for deterioration, not for distinction; he is one going to deterioration, not to distinction.",
    "an10.75:20": "(8) \"Then, Ānanda, there is one person who is prone to anger yet understands as it really is that liberation of mind, liberation by wisdom, where that anger of his ceases without remainder. And he has listenedto the teachings… he attains temporary liberation. With the breakup of the body, after death, he heads for distinction, not for deterioration; he is one going to distinction, not to deterioration.",
    "an10.75:21": "\"Ānanda, those who are judgmental will pass such judgment on them …. I alone, or one like me, may pass judgment on people.",
    "an10.75:22": "(9) \"Then, Ānanda, there is one person who is restless and does not understand as it really is that liberation of mind, liberation by wisdom, where that restlessness of his ceases without remainder. And he has not listenedto the teachings… he does not attain temporary liberation. With the breakup of the body, after death, he heads for deterioration, not for distinction; he is one going to deterioration, not to distinction.",
    "an10.75:23": "(10) \"Then, Ānanda, there is one person who is restless yet understands as it really is that liberation of mind, liberation by wisdom, where that restlessness of his ceases without remainder. And he has listenedto the teachings, become learnedin them, penetratedthemby view,and he attains temporary liberation. With the breakup of the body, after death, he heads for distinction, not for deterioration; he is one going to distinction, not to deterioration.",
    "an10.75:24": "\"Ānanda, those who are judgmental will pass such judgment on them: ‘This one has the same qualities as the other. Why should one be inferior and the other superior?’ Thatjudgmentof theirs will indeed lead to their harm and suffering for a long time.",
    "an10.75:25": "\"Between them, Ānanda, the person who is restless, and who understands as it really is that liberation of mind, liberation by wisdom, where that restlessness of his ceases without remainder; who has listenedto the teachings, become learnedin them, penetratedthemby view, and who attains temporary liberation, surpasses and excels the other person. For what reason? Because the Dhamma-stream carries him along. But who can know this difference except the Tathāgata?",
    "an10.75:26": "\"Who, indeed, is the female lay follower Migasālā, a foolish, incompetent woman with a woman's intellect? And who are thosewho havethe knowledge of other persons as superior and inferior?",
    "an10.75:27": "\"Ānanda, if Isidatta had possessed the same kind of virtuous behavior that Purāṇa had, Purāṇa could not have even known his destination.And if Purāṇa had possessed the same kind of wisdom that Isidatta had, Isidatta could not have even known his destination. In this way, Ānanda, these two persons were each deficient in one respect.\""
}