{
    "an10.30:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion King Pasenadi of Kosala had returned from the war front, victorious in battle, his purpose having been achieved.[n.2027]Mpexplains the historical background: When King Kosala the Great (Pasenadi's father) presented his daughter in marriage to Bimbisāra (the king of Magadha), he gave her the village of Kāsi (between the two kingdoms) as a wedding gift. Years later, after Ajātasattu killed his father Bimbisāra, his mother died of grief. Pasenadi decided: \"Since Ajātasattu killed his parents, the village belongs to my father.\" Ajātasattu, too, thought: \"It belongs to my mother.\" The two, uncle and nephew, fought a war over Kāsi. Pasenadi was twice defeated by Ajātasattu and had to flee the battle, but on the third occasion he captured Ajātasattu. This was the purpose of which it is said \"his purpose having been achieved\"(laddhādhippāyo).Then King Pasenadi of Kosala set out for the park. He went by carriage as far as the ground was suitable for a carriage, and then he dismounted from his carriage and entered the park on foot. Now on that occasion a number of bhikkhus were walking back and forth in the open air. Then King Pasenadi of Kosala approached those bhikkhus and asked them:",
    "an10.30:2": "Then, King Pasenadi of Kosala went quietly up to the dwelling with the closed door. Without hurrying, he entered the porch, cleared his throat, and tapped on the bolt. The Blessed One opened the door.",
    "an10.30:3": "\"But, great king, what reasons do you have for showing such supreme honor to this body and displaying such an offering of loving-kindness?\"",
    "an10.30:4": "(1) \"For, Bhante, the Blessed One is practicing for the welfare of many people, for the happiness of many people; he has established many people in the noble method, that is, in the way of the good Dhamma, in the way of the wholesome Dhamma.[n.2029]Bahuno janassa ariye ñāye patiṭṭhāpitā yadidaṁ kalyāṇadhammatāya kusaladhammatāya.Mpglosses \"in the noble method\" as \"in the path along with insight\"(sahavipassanake magge). I follow PED in takingpatiṭṭhāpitāto be an agent noun in the nominative singular.This is one reason I show such supreme honor toward the Blessed One and display such an offering of loving-kindness to him.",
    "an10.30:5": "(2) \"Again, Bhante, the Blessed One is virtuous, of mature behavior, of noble behavior, of wholesome behavior, possessing wholesome behavior. This is another reason I show such supreme honor toward the Blessed One ….",
    "an10.30:6": "(3) \"Again, Bhante, for a long time the Blessed One has been a forest-dweller who resorts to remote lodgings in forests and jungle groves. Since that isso, this is another reason I show such supreme honor toward the Blessed One ….",
    "an10.30:7": "(4) \"Again, Bhante, the Blessed One is content with any kind of robe, almsfood, lodging, and medicines and provisions for the sick. This is another reason I show such supreme honor toward the Blessed One ….",
    "an10.30:8": "(5) \"Again, Bhante, the Blessed One is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. This is another reason I show such supreme honor toward the Blessed One ….",
    "an10.30:9": "(6) \"Again, Bhante, the Blessed One gets to hear at will, without trouble or difficulty, talk concerned with the austere life that leads to the eliminationof defilements, that is conducive to opening up the heart, that is, talk on fewness of desires, on contentment, on solitude, on not getting bound upwith others, on arousing energy, on virtuous behavior, on concentration, on wisdom, on liberation, on the knowledge and vision of liberation. This is another reason I show such supreme honor toward the Blessed One ….",
    "an10.30:10": "(7) \"Again, Bhante, the Blessed One gains at will, without trouble or difficulty, the four jhānas that constitute the higher mind and are pleasant dwellings in this very life.This is another reason I show such supreme honor toward the Blessed One ….",
    "an10.30:11": "(8) \"Again, Bhante, the Blessed One recollects his manifold past abodes, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of world-dissolution, many eons of world-evolution, many eons of world-dissolution and world-evolution thus: ‘There I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn elsewhere, and there too I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn here.’ Thus he recollects his manifold past abodes with their aspects and details. Since that is so, this is another reason I show such supreme honor toward the Blessed One ….",
    "an10.30:12": "(9) \"Again, Bhante, with the divine eye, which is purified and surpasses the human, the Blessed One sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare in accordance with their kamma thus: ‘These beings who engaged in misconduct by body, speech, and mind, who reviled the noble ones,held wrong view, and undertook kamma based on wrong view, with the breakup of the body, after death, have been reborn in the plane of misery, in a bad destination, in the lower world, in hell; but these beings who engaged in good conduct by body, speech, and mind, who did not revile the noble ones, who held right view, and undertook kamma based on right view, with the breakup of the body, after death, have been reborn in a good destination, in the heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare in accordance with their kamma. Since that is so, this is another reason I show such supreme honor toward the Blessed One ….",
    "an10.30:13": "(10) \"Again, Bhante, with the destruction of the taints, the Blessed One has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. Since that is so, this is another reason I show such supreme honor toward the Blessed One and display such an offering of loving-kindness to him.",
    "an10.30:14": "\"And now, Bhante, we must be going. We are busy and have much to do.\""
}