{
    "an10.91:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then the householder Anāthapiṇḍika approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "an10.91:2": "\"Householder, there are these ten kinds of persons who enjoy sensual pleasures found existing in the world. What ten?[n.11] The three variables of the pattern to be elaborated are: (i) how wealth is acquired, whether unrighteously, righteously, or both; (ii) whether or not it is used for one's own benefit; and (iii) whether or not it is used to benefit others. Those who rank positively on all three will be further divided into those who are attached to their wealth and those who are unattached to it.I. ExpositionA. Those Who Seek Wealth Unrighteously",
    "an10.91:3": "(2) \"Someone else who enjoys sensual pleasures seeks wealth unrighteously, by violence. Having done so, he makes himself happy and pleased, but he does not share the wealth and do meritorious deeds.",
    "an10.91:4": "(3) \"And still someone else who enjoys sensual pleasures seeks wealth unrighteously, by violence. Having done so, he makes himself happy and pleased, and he shares the wealth and does meritorious deeds.B. Those Who Seek Wealth Both Righteously and Unrighteously",
    "an10.91:5": "(4) \"Next, householder, someone who enjoys sensual pleasures seeks wealth both righteously and unrighteously, both by violence and without violence. Having done so, he does not make himself happy and pleased, nor does he share the wealth and do meritorious deeds.",
    "an10.91:6": "(5) \"Someone else who enjoys sensual pleasures seeks wealth both righteously and unrighteously, both by violence and without violence. Having done so, he makes himself happy and pleased, but he does not share the wealth and do meritorious deeds.",
    "an10.91:7": "(6) \"And still someone else who enjoys sensual pleasures seeks wealth both righteously and unrighteously, both by violence and without violence. Having done so, he makes himself happy and pleased, and he shares the wealth and does meritorious deeds.C. Those Who Seek Wealth Righteously",
    "an10.91:8": "(7) \"Next, householder, someone who enjoys sensual pleasures seeks wealth righteously, without violence. Having done so, he does not make himself happy and pleased, nor does he share the wealth and do meritorious deeds.",
    "an10.91:9": "(8) \"Someone else who enjoys sensual pleasures seeks wealth righteously, without violence. Having done so,he makes himself happy and pleased, but he does not share the wealth and do meritorious deeds.",
    "an10.91:10": "(9) \"And still someone else who enjoys sensual pleasures seeks wealth righteously, without violence. Having done so, he makes himself happy and pleased, and he shares the wealth and does meritorious deeds. But he uses his wealth while being tied to it, infatuated with it, and blindly absorbed in it, not seeing the danger in it and understanding the escape.",
    "an10.91:11": "(10) \"And still someone else who enjoys sensual pleasures seeks wealth righteously, without violence. Having done so, he makes himself happy and pleased, and he shares the wealth and does meritorious deeds. And he uses his wealth without being tied to it, infatuated with it, and blindly absorbed in it, seeing the danger in it and understanding the escape.II. EvaluationA. Those Who Seek Wealth Unrighteously",
    "an10.91:12": "(1) \"The one enjoying sensual pleasures who seeks wealth unrighteously, by violence, and does not make himself happy and pleased, and does not share the wealth and do meritorious deeds, may be criticized on three grounds. The first ground on which he may be criticized is that he seeks wealth unrighteously, by violence. The second ground on which he may be criticized is that he does not make himself happy and pleased. The third ground on which he may be criticized is that he does not share the wealth and do meritorious deeds. This one enjoying sensual pleasures may be criticized on these three grounds.",
    "an10.91:13": "(2) \"The one enjoying sensual pleasures who seeks wealth unrighteously, by violence, and makes himself happy and pleased, but does not share the wealth and do meritorious deeds, may be criticized on two grounds and praised on one ground. The first ground on which he may be criticized is that he seeks wealth unrighteously, by violence. The one ground on which he may be praised is that he makes himself happy and pleased. The second ground on which he may be criticized is that he does not share the wealth and do meritorious deeds. This one enjoying sensual pleasures may be criticized on these two grounds and praised on this one ground.",
    "an10.91:14": "(3) \"The one enjoying sensual pleasures who seeks wealth unrighteously, by violence, and makes himself happy and pleased, and shares the wealth and does meritorious deeds, may be criticized on one ground and praised on two grounds. The one ground on which he may be criticized is that he seeks wealth unrighteously, by violence. The first ground on which he may be praised is that he makes himself happy and pleased. The second ground on which he may be praised is that he shares the wealth and does meritorious deeds. This one enjoying sensual pleasures may be criticized on this one ground and praised on these two grounds.B. Those Who Seek Wealth Righteously and Unrighteously",
    "an10.91:15": "(4) \"Next, householder, the one enjoying sensual pleasures who seeks wealth both righteously and unrighteously, both by violence and without violence, and does not make himself happy and pleased, and does not share the wealth and do meritorious deeds, may be praised on one ground and criticized on three grounds. The one ground on which he may be praised is that he seeks wealth righteously, without violence. The first ground on which he may be criticized is that he seeks wealth unrighteously, by violence. The second ground on which he may be criticized is that he does not make himself happy and pleased. The third ground on which he may be criticized is that he does not share the wealth and do meritorious deeds. This one enjoying sensual pleasures may be praised on this one ground and criticized on these three grounds.",
    "an10.91:16": "(5) \"The one enjoying sensual pleasures who seeks wealth both righteously and unrighteously, both by violence and without violence, and makes himself happy and pleased, but does not share the wealth and do meritorious deeds, may be praised on two grounds and criticized on two grounds. The first ground on which he may be praised is that he seeks wealth righteously, without violence. The first ground on which he may be criticized is that he seeks wealth unrighteously, by violence. The second ground on which he may be praised is that he makes himself happy and pleased. The second ground on which he may be criticized is that he does not share the wealth and do meritorious deeds.This one enjoying sensual pleasures may be praised on these two grounds and criticized on these two grounds.",
    "an10.91:17": "(6) \"The one enjoying sensual pleasures who seeks wealth both righteously and unrighteously, both by violence and without violence, and makes himself happy and pleased, and shares the wealth and does meritorious deeds, may be praised on three grounds and criticized on one ground. The first ground on which he may be praised is that he seeks wealth righteously, without violence. The one ground on which he may be criticized is that he seeks wealth unrighteously, by violence. The second ground on which he may be praised is that he makes himself happy and pleased. The third ground on which he may be praised is that he shares the wealth and does meritorious deeds. This one enjoying sensual pleasures may be praised on these three grounds and criticized on this one ground.C. Those Who Seek Wealth Righteously",
    "an10.91:18": "(7)\"Next, householder, the one enjoying sensual pleasure swho seeks wealth righteously, without violence, and does not make himself happy and pleased, and does not share the wealth and do meritorious deeds, may be praised on one ground and criticized on two grounds. The one ground on which he may be praised is that he seeks wealth righteously, without violence. The first ground on which he may be criticized is that he does not make himself happy and pleased. The second ground on which he may be criticized is that he does not share the wealth and do meritorious deeds. This one enjoying sensual pleasures may be praised on this one ground and criticized on these two grounds.",
    "an10.91:19": "(8) \"The one enjoying sensual pleasures who seeks wealth righteously, without violence, and makes himself happy and pleased, but does not share the wealth and do meritorious deeds, may be praised on two grounds and criticized on one ground. The first ground on which he may be praised is that he seeks wealth righteously, without violence. The second ground on which he may be praised is that he makes himself happy and pleased. The one ground on which he may be criticized is that he does not share the wealth and do meritorious deeds.This one enjoying sensual pleasures may be praised on these two grounds and criticized on this one ground.",
    "an10.91:20": "(9) \"The one enjoying sensual pleasures who seeks wealth righteously, without violence, and makes himself happy and pleased, and shares it and does meritorious deeds, but uses that wealth while being tied to it, infatuated with it, and blindly absorbed in it, not seeing the danger in it and understanding the escape—he may be praised on three grounds and criticized on one ground. The first ground on which he may be praised is that he seeks wealth righteously, without violence. The second ground on which he may be praised is that he makes himself happy and pleased. The third ground on which he may be praised is that he shares the wealth and does meritorious deeds. The one ground on which he may be criticized is that he uses that wealth while being tied to it, infatuated with it, and blindly absorbed in it, not seeing the danger in it and understanding the escape. This one enjoying sensual pleasures may be praised on these three grounds and criticized on this one ground.",
    "an10.91:21": "(10) \"The one enjoying sensual pleasures who seeks wealth righteously, without violence, and makes himself happy and pleased, and shares it and does meritorious deeds, and uses that wealth without being tied to it, infatuated with it, and blindly absorbed in it, seeing the danger in it and understanding the escape—he may be praised on four grounds. The first ground on which he may be praised is that he seeks wealth righteously, without violence. The second ground on which he may be praised is that he makes himself happy and pleased. The third ground on which he may be praised is that he shares the wealth and does meritorious deeds. The fourth ground on which he may be praised is that he uses that wealth without being tied to it, infatuated with it, and blindly absorbed in it, seeing the danger in it and understanding the escape. This one enjoying sensual pleasures may be praised on these four grounds.Conclusion",
    "an10.91:22": "\"These, householder, are the ten kinds of persons who enjoy sensual pleasures found existing in the world. Of these ten,the foremost, the best, the preeminent, the supreme, and the finest is the one enjoying sensual pleasures who seeks wealth righteously, without violence, and having obtained it, makes himself happy and pleased; and shares the wealth and does meritorious deeds; and uses that wealth without being tied to it, infatuated with it, and blindly absorbed in it, seeing the danger in it and understanding the escape.",
    "an10.91:23": "Just as from a cow comes milk, from milk curd, from curd butter, from butter ghee, and from ghee comes cream-of-ghee, which is reckoned the foremost of all these, so too, of these ten kinds of persons who enjoy sensual pleasures, the foremost, the best, the preeminent, the supreme, and the finest is the one who seeks wealth righteously, without violence, and having obtained it, makes himself happy and pleased; and shares the wealth and does meritorious deeds; and uses that wealth without being tied to it, infatuated with it, and blindly absorbed in it, seeing the danger in it and understanding the escape.\""
}