{
    "an10.92:1": "Then the householder Anāthapiṇḍika approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "an10.92:2": "\"Householder, when a noble disciple has eliminated five perils and enmities, possesses the four factors of stream-entry, and has clearly seen and thoroughly penetrated with wisdom the noble method, he might, if he so wished, declare of himself: ‘I am one finished with hell, the animal realm, and the sphere of afflicted spirits; finished with the plane of misery, the bad destination, the lower world; I am a stream-enterer, no longer subject torebirth inthe lower world, fixed in destiny, heading for enlightenment.’",
    "an10.92:3": "\"What are the five perils and enmities that have been eliminated?(1) Householder, one who destroys life, with the destruction of life as condition, creates peril and enmity pertaining to the present life and peril and enmity pertaining to future lives, and he also experiences mental pain and dejection. One who abstains from the destruction of life does not create such peril and enmity pertaining to the present life or such peril and enmity pertaining to future lives, nor does he experience mental pain and dejection. For one who abstains from the destruction of life, that peril and enmity has thus been eliminated.",
    "an10.92:4": "(2) \"One who takes what is not given … (3) One who engages in sexual misconduct … () One who speaks falsely … (5) One who indulges in liquor, wine, and intoxicants, the basis for heedlessness, with indulgence in liquor, wine, and intoxicants as condition, creates peril and enmity pertaining to the present life and peril and enmity pertaining to future lives, and he also experiences mental pain and dejection. One who abstains from liquor, wine, and intoxicants, the basis for heedlessness, does not create such peril and enmity pertaining to the present life or such peril and enmity pertaining to future lives, nor does he experience mental pain and dejection. For one who abstains from liquor, wine, and intoxicants, the basis for heedlessness, that peril and enmity has thus been eliminated.",
    "an10.92:5": "\"And what are the four factors of stream-entry that he possesses? (6) Here, householder, a noble disciple possesses unwavering confidence in the Buddha thus: ‘The Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’ (7) He possesses unwavering confidence in the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’ (8) He possesses unwavering confidence in the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practicing the good way, practicing the straight way, practicing the true way, practicing the proper way; that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’ (9) He possesses the virtuous behavior loved by the noble ones,unbroken, flawless, unblemished, unblotched, freeing, praised by the wise, ungrasped, leading to concentration. These are the four factors of stream-entry that he possesses.",
    "an10.92:6": "\"And what is the noble method that he has clearly seen and thoroughly penetrated with wisdom?[n.2123]Mp:\"The noble method(ariya ñāya)is the path together with insight.\"(10) Here, householder, the noble disciple reflects thus: ‘When this exists, that comes to be; with the arising of this, that arises. When this does not exist, that does not come to be; with the cessation of this, that ceases. That is, with ignorance as condition, volitional activitiescome to be; with volitional activities as condition, consciousness; with consciousness as condition, name-and-form; with name-and-form as condition, the six sense bases; with the six sense bases as condition, contact; with contact as condition, feeling; with feeling as condition, craving; with craving as condition, clinging; with clinging as condition, existence; with existence as condition, birth; with birth as condition, old age and death, sorrow, lamentation, pain, dejection, and anguish come to be. Such is the origin of this whole mass of suffering.",
    "an10.92:7": "\"Householder, when a noble disciple has eliminated these five perils and enmities, and he possesses these four factors of stream-entry, and he has clearly seen and thoroughly penetrated with wisdom this noble method, he might, if he so wished, declare of himself: ‘I am one finished with hell, the animal realm, and the sphere of afflicted spirits; finished with the plane of misery, the bad destination, the lower world; I am a stream-enterer, no longer subject torebirth inthe lower world, fixed in destiny, heading for enlightenment.’\""
}