{
    "an10.219:1": "\"Bhikkhus, I do not say that there is a termination of volitional kamma that has been done and accumulated so long as one has not experiencedits results, and that may be in this very life, or in thenextrebirth, or on some subsequent occasion. But I do not say that there is making an end of suffering so long as one has not experiencedthe results ofvolitional kamma that has been done and accumulated.[n.285] Although the text of the sutta (in the three editions) does not include apeyyālahere, indicating an elision, it was probably right here that the sutta originally included the passage on the ten courses of kamma (as in the preceding two suttas). Only in this way would its inclusion in the Tens make sense. Further, the transition tosa kho so … ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷhoin the next paragraph, with the reference to a definite subject, implies that it had been preceded by a passage that already spoke about the noble disciple. We find the full passage, in fact, in the Chinese parallel, MĀ 5, which is a synthesis of0:27–8and the present sutta.The structure ofMĀ5 is as follows: Following the opening statement, the Buddha defines the ten kinds of unwholesome kamma of body, speech, and mind. He then says that an instructed noble disciple discards the threefold unwholesome types of kamma (bodily, verbal, and mental) and cultivates the threefold wholesome types. At this point \"thatinstructed noble disciple\" (), possessing such energy and virtue, has purified his kamma of body, speech, and mind. He is without anger and hostility, has dispelled drowsiness, eliminated restlessness and arrogance, abandoned doubt, and gone beyond conceit. He is mindful, possesses clear comprehension, and is unconfused. He then pervades the ten directions and the entire world with a mind of loving-kindness and the other three immeasurables.",
    "an10.219:2": "\"This noble disciple, bhikkhus, who is thus devoid of longing, devoid of ill will, unconfused, clearly comprehending, ever mindful, dwells pervading one quarter with a mind imbued with loving-kindness, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with loving-kindness, vast, exalted, measureless, without enmity, without ill will.",
    "an10.219:3": "He understands thus: ‘Previously, my mind was limited and undeveloped, but now it is measureless and well developed. No measurable kamma remains or persists there.’[n.2186]Yaṁ kho pana kiñci pamāṇakataṁ kammaṁ,na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati.Mpidentifies \"measurable kamma\" with sense-sphere kamma(kāmāvacarakamma), that is, kamma due to produce its results in the sense sphere. Since the disciple being described is presumably a non-returner (or one bound to become a non-returner), he or she will take rebirth in the form realm and never again descend to the sense sphere. Thus the sense-sphere kamma cannot find an opportunity to ripen.",
    "an10.219:4": "\"What do you think, bhikkhus, if a youth were to develop the liberation of mind by loving-kindness from his childhood on, would he do a bad deed?\"[n.2187] As pointed out earlier, the Pāli wordkammabears two senses often difficult to distinguish: the etymological sense, simply an action or deed, and the soteriological sense, a deed considered as a moral force that can bring retributive consequences. It is strange that the text says unequivocally that one who develops the liberation of mind by loving-kindness can do no bad deed. It seems to me that although such a person might not commit bad deeds motivated by hatred and ill will, they could still do bad deeds, even minor ones, motivated by greed and delusion.",
    "an10.219:5": "\"Could suffering affect him if he does no bad deed?\" \"No, Bhante. For on what account could suffering affect one who does no bad deed?\"[n.2188] This statement, too, seems counterintuitive. Those who do no bad deeds in this life certainly can suffer the kammic effects of bad deeds done in previous lives. Thus Moggallāna was assassinated and the Buddha himself was badly injured by a sharp stone that broke off from the boulder hurled at him by Devadatta. Virtuous people who are not arahants might also undergo psychological suffering, and not merely physical pain, as a consequence of undesirable situations. For example, Ānanda, a virtuous monk, felt grief and worry when the Buddha fell ill and Visākhā, a stream-enterer, lamented the death of her grandchild.",
    "an10.219:6": "\"A woman or a man should develop this liberation of mind by loving-kindness. A woman or a man cannot take this body with them when they go. Mortals have mind as their core.[n.2189]Cittantaro ayaṁ bhikkhave macco.Mp:\"They have mind as their cause, or their interior is due to mind(cittakāraṇo, atha vā citten’eva antariko). For with the mind at rebirth that follows without interval the mind at death, one becomes a deva, a hell-being, or an animal.\"",
    "an10.219:7": "\"This noble disciple, bhikkhus, who is thus devoid of longing, devoid of ill will, unconfused, clearly comprehending, ever mindful, dwells pervading one quarter with a mind imbued with compassion … with a mind imbued with altruistic joy … with a mind imbued with equanimity, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with equanimity, vast, exalted, measureless, without enmity, without ill will.",
    "an10.219:8": "He understands thus: ‘Previously, my mind was limited and undeveloped, but now it is measureless and well developed. No measurablekamma remains or persists there.’",
    "an10.219:9": "\"What do you think, bhikkhus, if a youth would develop the liberation of mind by equanimity, from his childhood on, would he do a bad deed?\"",
    "an10.219:10": "\"Could suffering affect him if he does no bad deed?\"",
    "an10.219:11": "\"A woman or a man should develop this liberation of mind by equanimity. A woman or a man cannot take this body with them when they go. Mortals have mind as their core."
}