{
    "an10.217:1": "\"Bhikkhus, I do not say that there is a termination of volitional kamma[n.280] The text has the genitive pluralsañcetanikānaṁ kammānaṁ. Out of deference to established English usage, I have used the singular \"kamma.\" In view of the fact thatkammais by definition volitional(cetanā ‘haṁ bhikkhave kammaṁ vadāmi), \"volitional kamma\" sounds redundant, but I follow the Pāli. Apparently the text is playing off two meanings ofkamma, the literal meaning of \"deed, action\" and the extended meaning of a deed with the capacity to produce ethically determined fruits. The former meaning, perhaps, is accentuated bykata, \"done,\" the latter byupacita, \"accumulated, stored up\" as well as by the reference to the time periods when it can ripen.that has been done and accumulated so long as one has not experiencedits results, and that may be in this very life, or in thenextrebirth, or on some subsequent occasion. But I do not say that there is making an end of suffering so long as one has not experiencedthe results ofvolitional kamma that has been done and accumulated.[n.28] On the threefold ripening of kamma, see note372. The Buddha’s statement that there is no termination of volitional kamma so long as one has not experienced its results seems to contradict one of the main premises of his teaching, namely, that to attain liberation—”to make an end of suffering”—one need not experience the results of all the kamma one has accumulated in the past. This tenet (at least according to the Nikāyas) was proposed by the Jains, as stated atMN 4.7, I 92,35–93,0;MN 0.0, II 28,–2. However, since the cycle of rebirths is “without discoverable beginning”(anamatagga saṃsāra),and in this long stretch we have all accumulated an immensity of kamma, it would virtually require infinite time to exhaust such kamma by experiencing its results. The Buddha taught that the key to liberation was not the eradication of past kamma (whether by experiencing its results or by austerities) but the elimination of the defilements. Arahants, by terminating the defilements, extinguish the potential for ripening of all their past kamma beyond the residue that might ripen in their final life. Mp explains the text’s statement as having an implicit meaning: “This is intended to show that as long as saṃsāra continues, if there is kamma that has acquired the capacity to ripen(paṭiladdhavipākārahakamma)‘there is no place on earth where one might escape an evil deed’” (the citation,na vijjati so jagatippadeso, yatthaṭṭhito mucceyya pāpakammā,is fromDhp 27). The point, in other words, is not that all kamma created will have to ripen, but that any kamma created and accumulated retains the potential to ripen as long as one wanders on in the cycle of rebirths.A Chinese parallel ofAN0.29,MĀ 5(T I 437b24–438b), opens with a similar declaration asAN0.27. The statement (at T I 437b26 — 28) reads in translation: \"If one has done a past kamma, I say that one must experience its result: one experiences it either in the present life or in a future life. But if one has not done a past kamma, I say that one will not experience its result\" (). The Chinese parallel offers only two alternatives for the time of ripening and lacks anything corresponding to the problematic assertion, \"I do not say that there is making an end of suffering so long as one has not experienced (the results of) volitional kamma that has been done and accumulated.\"",
    "an10.217:2": "\"As to this, bhikkhus, there is a threefold corruption and failure of bodily kamma,[n.18]Kāyakammantasandosabyāpatti.Mpglosses as \"a fault consisting in bodily action\"(kāyakammantasaṅkhātā vipatti). Apparently,Mpunderstandssandosaandbyāpattito convey the same meaning, glossed byvipatti, but I take the compound to be advanda: \"corruptionandfailure.\"arisen from unwholesome volition, having a painful outcome and result; a fourfold corruption and failure of verbal kamma, arisen from unwholesome volition, having a painful outcome and result; and a threefold corruption and failure of mental kamma, arisen from unwholesome volition, having a painful outcome and result.",
    "an10.217:3": "\"And how, bhikkhus, is there a threefold corruption and failure of bodily kamma, arisen from unwholesome volition, having a painful outcome and result?",
    "an10.217:4": "(2) \"He takes what is not given. He steals the wealth and property of others in the village or forest.",
    "an10.217:5": "(3) \"He engages in sexual misconduct. He has sexual relations with women who are protected by their mother, father, mother and father, brother, sister, or relatives; who are protected by their Dhamma; who have a husband; whose violation entails a penalty; or even with one already engaged.",
    "an10.217:6": "\"It is in this way that there is a threefold corruption and failure of bodily kamma, arisen from unwholesome volition, having a painful outcome and result.",
    "an10.217:7": "\"And how, bhikkhus, is there a fourfold corruption and failure of verbal kamma, arisen from unwholesome volition, having a painful outcome and result?",
    "an10.217:8": "(5) \"He speaks divisively. Having heard something here, he repeats it elsewhere in order to dividethose peoplefrom these; or having heard something elsewhere, he repeats it to these people in order to dividethemfrom those. Thus he is one who divides those who are united, a creator of divisions, one who enjoys factions, rejoices in factions, delights in factions, a speaker of words that create factions.",
    "an10.217:9": "(6) \"He speaks harshly. He utters such words as are rough, hard, hurtful to others, offensive to others, bordering on anger, unconducive to concentration.",
    "an10.217:10": "(7) \"He indulges in idle chatter. He speaks at an improper time, speaks falsely, speaks what is unbeneficial, speaks contrary to the Dhamma and the discipline; at an improper time he speaks such words as are worthless, unreasonable, rambling, and unbeneficial.",
    "an10.217:11": "\"It is in this way that there is a fourfold corruption and failure of verbal kamma, arisen from unwholesome volition, having a painful outcome and result.",
    "an10.217:12": "\"And how, bhikkhus, is there a threefold corruption and failure of mental kamma, arisen from unwholesome volition, having a painful outcome and result?",
    "an10.217:13": "(9) \"He has a mind of ill will and intentions of hate thus: ‘May these beings be slain, slaughtered, cut off, destroyed, or annihilated!’",
    "an10.217:14": "(10) \"He holds wrong view and has an incorrect perspective thus: ‘There is nothing given, nothing sacrificed, nothing offered; there is no fruit or result of good and bad actions; there is no this world, no other world; there is no mother, no father; there are no beings spontaneously reborn;there are in the world no ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’",
    "an10.217:15": "\"It is in this way that there is a threefold corruption and failure of mental kamma, arisen from unwholesome volition, having a painful outcome and result.",
    "an10.217:16": "\"It is, bhikkhus, because of the threefold corruption and failure of bodily kamma, arisen from unwholesome volition, that with the breakup of the body, after death, beings are reborn in the plane of misery, in a bad destination, in the lower world, in hell; or it is because of the fourfold corruption and failure of verbal kamma, arisen from unwholesome volition, that with the breakup of the body, after death, beings are reborn in the plane of misery, in a bad destination, in the lower world, in hell; or it is because of the threefold corruption and failure of mental kamma, arisen from unwholesome volition, that with the breakup of the body, after death, beings are reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an10.217:17": "Just as dice, when thrown upward, will rest firmly wherever they fall,[n.2183] SeeAN3, n. 582.so too, it is because of the threefold corruption and failure of bodily kamma … or it is because of the fourfold corruption and failure of verbal kamma … or it is because of the threefold corruption and failure of mental kamma, arisen from unwholesome volition, that with the breakup of the body, after death, beings are reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an10.217:18": "\"Bhikkhus, I do not say that there is a termination of volitional kamma that has been done and accumulated so long as one has not experiencedits results, and that may be in this very life, or in thenextrebirth, or on some subsequent occasion. But I do not say that there is making an end of suffering so long as one has not experiencedthe results ofvolitional kamma that has been done and accumulated.",
    "an10.217:19": "\"As to this, bhikkhus, there is a threefold success of bodily kamma, arisen from wholesome volition, having a pleasant outcome and result; a fourfold success of verbal kamma, arisen from wholesome volition, having a pleasant outcome and result; and a threefold success of mental kamma,arisen from wholesome volition, having a pleasant outcome and result.",
    "an10.217:20": "\"And how, bhikkhus, is there a threefold success of bodily kamma, arisen from wholesome volition, having a pleasant outcome and result?",
    "an10.217:21": "(2) \"Having abandoned the taking of what is not given, he abstains from taking what is not given. He does not steal the wealth and property of others in the village or in the forest.",
    "an10.217:22": "(3) \"Having abandoned sexual misconduct, he abstains from sexual misconduct. He does not have sexual relations with women who are protected by their mother, father, mother and father, brother, sister, or relatives; who are protected by their Dhamma; who have a husband; whose violation entails a penalty; or even with one already engaged.",
    "an10.217:23": "\"It is in this way that there is a threefold success of bodily kamma, arisen from wholesome volition, having a pleasant outcome and result.",
    "an10.217:24": "\"And how, bhikkhus, is there a fourfold success of verbal kamma, arisen from wholesome volition, having a pleasant outcome and result?",
    "an10.217:25": "(5) \"Having abandoned divisive speech, he abstains from divisive speech. Having heard something here, he does not repeat it elsewhere in order to dividethose peoplefrom these; or having heard something elsewhere, he does not repeat it to these people in order to dividethemfrom those. Thus he is one who reunites those who are divided,a promoter of unity, who enjoys concord, rejoices in concord, delights in concord, a speaker of words that promote concord.",
    "an10.217:26": "(6) \"Having abandoned harsh speech, he abstains from harsh speech. He speaks such words as are gentle, pleasing to the ear, and lovable, as go to the heart, are courteous, desired by many, and agreeable to many.",
    "an10.217:27": "(7) \"Having abandoned idle chatter, he abstains from idle chatter. He speaks at a proper time, speaks truth, speaks what is beneficial, speaks on the Dhamma and the discipline; at a proper time he speaks such words as are worth recording, reasonable, succinct, and beneficial.",
    "an10.217:28": "\"It is in this way that there is a fourfold success of verbal kamma, arisen from wholesome volition, having a pleasant outcome and result.",
    "an10.217:29": "\"And how, bhikkhus, is there a threefold success of mental kamma, arisen from wholesome volition, having a pleasant outcome and result?",
    "an10.217:30": "(9) \"He is of good will and his intentions are free of hate thus: ‘May these beings live happily, free from enmity, affliction, and anxiety!’",
    "an10.217:31": "(10) \"He holds right view and has a correct perspective thus: ‘There is what is given, sacrificed, and offered; there is fruit and result of good and bad actions; there is this world and the other world; there is mother and father; there are beings spontaneously reborn; there are in the world ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’",
    "an10.217:32": "\"It is in this way that there is a threefold success of mental kamma, arisen from wholesome volition, having a pleasant outcome and result.",
    "an10.217:33": "\"It is, bhikkhus, because of the threefold success of bodily kamma, arisen from wholesome volition, that with the breakup of the body, after death, beings are reborn in a good destination, in a heavenly world; or it is because of the fourfold success of verbal kamma, arisen from wholesome volition, that with the breakup of the body, after death, beings are reborn in a good destination, in a heavenly world; or it is because of the threefold success of mental kamma, arisen from wholesome volition, that with the breakup of the body, after death, beings are reborn in a good destination, in a heavenly world.",
    "an10.217:34": "Just as dice, when thrown upward, will rest firmly wherever they fall, so too, it is because of the threefold success of bodily kamma …… or it is because of the fourfold success of verbal kamma … or it is because of the threefold success of mental kamma, arisen from wholesome volition, that with the breakup of the body, after death, beings are reborn in a good destination, in a heavenly world."
}