{
    "an10.87:1": "There the Blessed One addressed the bhikkhus with reference to the bhikkhu Kalandaka:[n.205] This is the name inCe. Ee readskālakaṁ, which could also be taken as a proper name. But Be haskālakataṁ, which means \"one who has died.\"\"Bhikkhus!\"",
    "an10.87:2": "(1) \"Here, a bhikkhu is a maker of disciplinary issues and he does not speak in praise of the settlement of disciplinary issues. When a bhikkhu is a maker of disciplinary issues and does not speak in praise of the settlement of disciplinary issues, this is a quality that does not lead to affection, respect, esteem, accord, or unity.[n.106]Ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṁvattati.Mpglossesna sāmaññāyawithna samaṇadhammabhāvāya\"nor to the state (or duty) of an ascetic.\"Mpobviously takessāmaññato be derived fromsamaṇa. However, the wordsāmaññāis also an abstract noun fromsamāna, meaning \"the same\" or \"similar,\" and I believe this is the sense intended here. I translate it as \"accord,\" which agrees well with the next word,ekībhāvāya. See tooAN8., n. 163.Mpdoes not glossbhāvanāya, but in commenting onAN8.it allows two alternatives, \"meditative development\" and \"esteem for virtues.\" In this context I have taken the latter to be intended. A Chinese parallel, MĀ 94, at T I 576a3–5, has forbhāvanāya, \"nor to meditative development\"; and forsāmaññā,, \"nor to obtaining the ascetic state.\" Despite this agreement betweenMpand MĀ 94, I still think it possible that the words were misunderstood at an early period and prefer my rendering.",
    "an10.87:3": "(2) \"Again, a bhikkhu does not desire training and he does not speak in praise of undertaking the training. When a bhikkhu does not desire training … this, too, is a quality that does not lead to … unity.",
    "an10.87:4": "(3) \"Again, a bhikkhu has evil desires and he does not speak in praise of the removal of desire. When a bhikkhu has evil desires … this, too, is a quality that does not lead to … unity.",
    "an10.87:5": "(4) \"Again, a bhikkhu is prone to anger and he does not speak in praise of the removal of anger. When a bhikkhu is prone to anger … this, too, is a quality that does not lead to … unity.",
    "an10.87:6": "(5) \"Again, a bhikkhu is one who denigratesothersand he does not speak in praise of the removal of denigration. When a bhikkhu is one who denigrates … this, too, is a quality that does not lead to … unity.",
    "an10.87:7": "(6) \"Again, a bhikkhu is crafty and he does not speak in praise of the removal of craftiness. When a bhikkhu is crafty … this, too, is a quality that does not lead to … unity.",
    "an10.87:8": "(7) \"Again, a bhikkhu is deceitful and he does not speak in praise of the removal of deceitfulness. When a bhikkhu is deceitful … this, too, is a quality that does not lead to … unity.",
    "an10.87:9": "(8) \"Again, a bhikkhu is not inclined to pay attention to teachings and he does not speak in praise of paying attention to teachings. When a bhikkhu is not inclined to pay attention to teachings … this, too, is a quality that does not lead to … unity.",
    "an10.87:10": "(9) \"Again, a bhikkhu is not inclined to seclusion and he does not speak in praise of seclusion. When a bhikkhu is not inclined to seclusion … this, too, is a quality that does not lead to … unity.",
    "an10.87:11": "(10) \"Again, a bhikkhu does not show hospitality to his fellow monks and he does not speak in praise of one who shows hospitality. When a bhikkhu does not show hospitality to his fellow monks and he does not speak in praise of one who shows hospitality, this, too, is a quality that does not lead to affection, respect, esteem, accord, or unity.",
    "an10.87:12": "\"Although such a bhikkhu might wish: ‘Oh, if only my fellow monks would honor, respect, esteem, and venerate me!’ yet his fellow monks do not honor, respect, esteem, and venerate him. For what reason? Because his wise fellow monks see that he has not abandoned those bad unwholesome qualities.",
    "an10.87:13": "\"Suppose a wild colt would wish: ‘Oh, if only people would assign me a thoroughbred's place, feed me a thoroughbred's food, and give me a thoroughbred's grooming!’ yet people do not assign him a thoroughbred's place, feed him a thoroughbred's food, and give him a thoroughbred's grooming.For what reason? Because wise people see that he has not abandoned his tricks, ploys, gambits, and wiles. So too, although such a bhikkhu might wish: ‘Oh, if only my fellow monks would honor, respect, esteem, and venerate me!’ yet his fellow monks do not honor, respect, esteem, and venerate him. For what reason? Because his wise fellow monks see that he has not abandoned those bad unwholesome qualities.",
    "an10.87:14": "(1) \"But a bhikkhu is not a maker of disciplinary issues and he speaks in praise of the settlement of disciplinary issues. When a bhikkhu is not a maker of disciplinary issues and speaks in praise of the settlement of disciplinary issues, this is a quality that leads to affection, respect, esteem, accord, and unity.",
    "an10.87:15": "(2) \"Again, a bhikkhu desires training and he speaks in praise of undertaking the training. When a bhikkhu desires training … this, too, is a quality that leads to … unity.",
    "an10.87:16": "(3) \"Again, a bhikkhu has few desires and he speaks in praise of the removal of desire. When a bhikkhu has few desires … this, too, is a quality that leads to … unity.",
    "an10.87:17": "(4) \"Again, a bhikkhu is not prone to anger and he speaks in praise of the removal of anger. When a bhikkhu is not prone to anger … this, too, is a quality that leads to … unity.",
    "an10.87:18": "(5) \"Again, a bhikkhu is not one who denigratesothersand he speaks in praise of the removal of denigration. When a bhikkhu is not one who denigratesothers… this, too, is a quality that leads to … unity.",
    "an10.87:19": "(6) \"Again, a bhikkhu is not crafty and he speaks in praise of the removal of craftiness. When a bhikkhu is not crafty … this, too, is a quality that leads to … unity.",
    "an10.87:20": "(7) \"Again, a bhikkhu is not deceitful and he speaks in praise of the removal of deceitfulness. When a bhikkhu is not deceitful … this, too, is a quality that leads to … unity.",
    "an10.87:21": "(8) \"Again, a bhikkhu is inclined to attend to teachings and he speaks in praise of attending to teachings. When a bhikkhu is inclined to attend to teachings … this, too, is a quality that leads to … unity.",
    "an10.87:22": "(9) \"Again, a bhikkhu is inclined to seclusion and he speaks in praise of seclusion. When a bhikkhu is inclined to seclusion … this, too, is a quality that leads to … unity.",
    "an10.87:23": "(10) \"Again, a bhikkhu shows hospitality to his fellow monks and he speaks in praise of one who shows hospitality. When a bhikkhu shows hospitality to his fellow monks and he speaks in praise of one who shows hospitality, this, too, is a quality that leads to affection, respect, esteem, accord, and unity.",
    "an10.87:24": "\"Although such a bhikkhu might not wish: ‘Oh, if only my fellow monks would honor, respect, esteem, and venerate me!’ yet his fellow monks honor, respect, esteem, and venerate him. For what reason? Because his wise fellow monks see that he has abandoned those bad unwholesome qualities.",
    "an10.87:25": "\"Suppose an excellent thoroughbred horse would not wish: ‘Oh, if only people would assign me a thoroughbred's place, feed me a thoroughbred's food, and give me a thoroughbred's grooming!’ yet people assign him a thoroughbred's place, feed him a thoroughbred's food,and give him a thoroughbred's grooming. For what reason? Because wise people see that he has abandoned his tricks, ploys, gambits, and wiles.",
    "an10.87:26": "So too, although such a bhikkhu might not wish: ‘Oh, if only my fellow monks would honor, respect, esteem, and venerate me!’ yet his fellow monks honor, respect, esteem, and venerate him. For what reason? Because his wise fellow monks see that he has abandoned those bad unwholesome qualities.\""
}