{
    "an10.27:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the morning, a number of bhikkhus dressed, took their bowls and robes, and entered Sāvatthī for alms. Then it occurred to those bhikkhus: \"It is still too early to walk for alms in Sāvatthī. Let us go to the park of the wanderers of other sects.\"",
    "an10.27:2": "Then those bhikkhus went to the park of the wanderers of other sects. They exchanged greetings with those wanderers and, when they had concluded their greetings and cordial talk, sat down to one side. Those wanderers then said to them:",
    "an10.27:3": "\"Friends, the ascetic Gotama teaches the Dhamma to his disciples in such a way as this: ‘Come, bhikkhus, directly know all phenomena.[n.2001]Sabbaṁ dhammaṁ. I understand the singular to be doing service for the pluralsabbe dhamme.Dwell having directly known all phenomena.’[n.2002]Ceand Eesabbaṁ dhammaṁ abhiññāya abhiññāya. Be lacks the repetition.We too teach the Dhamma to our disciples in such a way as this: ‘Come, friends, directly know all phenomena. Dwell having directly known all phenomena.’ What now is the distinction, the disparity, the difference between the ascetic Gotama'steaching of the Dhamma and our teaching, between his instruction and our instruction?\"",
    "an10.27:4": "Then those bhikkhus neither applauded nor rejected the statement of those wanderers. Without applauding it, without rejecting it, they rose from their seats and left,thinking: \"We shall find out what the Blessed One has to say about this statement.\"",
    "an10.27:5-8": "Then, when those bhikkhus had walked for alms in Sāvatthī, after their meal, on returning from their alms round, they approached the Blessed One, paid homage to him, sat down to one side, and said: \"Here, Bhante, in the morning, we dressed, took our bowls and robes, and entered Sāvatthī for alms ….They here report the entire course of events, down to:We rose from our seats and left,thinking: ‘We shall find out what the Blessed One has to say about this statement.’\"",
    "an10.27:9": "\"Bhikkhus, when wanderers of other sects speak thus, they should be answered in this way: ‘A question about one, a concise statement about one, an explanation of one.[n.2003] Despite the grammatical form of the sentences, I believe that this rendering does better justice to the sense than a literal translation, \"One question, one concise statement, one explanation.\" The \"twos\" and higher numbers do not present \"two questions, etc.,\" \"three questions, etc.,\" and so forth, but a questionabouttwo items, a questionaboutthree items, and so forth.A question about two, a concise statement about two, an explanation of two. A question about three, a concise statement about three, an explanation of three. A question about four, a concise statement about four, an explanation of four. A question about five, a concise statement about five, an explanation of five. A question about six, a concise statement about six, an explanation of six. A question about seven, a concise statement about seven, an explanation of seven. A question about eight, a concise statement about eight, an explanation of eight. A question about nine, a concise statement about nine, an explanation of nine. A question about ten, a concise statement about ten, an explanation of ten. If wanderers of other sects were questioned thus, they would not be able to reply and, further, they would meet with distress. For what reason? Because that would not be within their domain. I do not see anyone, bhikkhus, in the world with its devas, Māra, and Brahmā, in this population with its ascetics and brahmins, its devas and humans, who could satisfy the mind with an answer to these questions apart from the Tathāgata or a disciple of the Tathāgata or one who has heard it from them.",
    "an10.27:10": "(1) \"When it was said: ‘A question about one, a concise statement about one, an explanation of one,’ with reference to what was this said?[n.2004] The Chinese parallel atEĀ46.8 (T II 778b17) provides some interesting points of contrast. The Pāli version is more cogent with respect to certain items, particularly the fours, fives, sixes, and tens; here EĀ 46.8 has the four noble truths, the five spiritual faculties, the six principles of communal harmony, and the ten kinds of mindfulness (the six recollections, mindfulness of the body, of death, of breathing, and of peace). EĀ 46.8 provides explanations of the items in each group, which calls our attention to what is missing in the Pāli version. While the Pāli version announces three categories for each number—the question(pañha), the concise statement(uddesa), and the explanation(veyyākaraṇa)—the sutta presents only two, the question and the concise statement, but not the explanation. The Kumārapañha section of the Khuddakapāṭha (§4) partly overlaps this list, but since the latter simply lists items to be remembered, without reference to disenchantment and dispassion, it includes positive sets: the four noble truths, the seven enlightenment factors, the eightfold path, and the ten factors of an arahant.When a bhikkhu is completely disenchanted with one thing, completely dispassionate toward it, completely liberated from it, completely sees its delimitations, and completely breaks through its meaning, in this very life he makes an end of suffering. What one thing? All beings exist through nutriment.[n.2005]Sabbe sattā āhāraṭṭhitikā.When a bhikkhu is completely disenchanted with this one thing, completely dispassionate toward it, completely liberated from it, completely sees its delimitations, and completely breaks through its meaning, in this very life he makes an end of suffering.",
    "an10.27:11": "(2) \"When it was said: ‘A question about two, a concise statement about two, an explanation of two,’ with reference to what was this said? When a bhikkhu is completely disenchanted with two things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering. What two things? Name and form. When a bhikkhu is completely disenchanted with these two things … in this very life he makes an end of suffering.",
    "an10.27:12": "(3) \"When it was said: ‘A question about three, a concise statement about three, an explanation of three,’ with reference to what was this said? When a bhikkhu is completely disenchanted with three things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering. What three things? The three kinds of feelings.[n.2006] Pleasant feeling, painful feeling, and feeling that is neither painful nor pleasant.When a bhikkhu is completely disenchanted with these three things … in this very life he makes an end of suffering.",
    "an10.27:13": "(4) \"When it was said: ‘A question about four, a concise statement about four, an explanation of four,’ with reference to what was this said?When a bhikkhu is completely disenchanted with four things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering. What four things? The four kinds of nutriment.[n.2007] Edible food, contact, mental volition, and consciousness. These are called nutriment(āhāra)in the sense that they sustain the continuity of existence.When a bhikkhu is completely disenchanted with these four things … in this very life he makes an end of suffering.",
    "an10.27:14": "(5) \"When it was said: ‘A question about five, a concise statement about five, an explanation of five,’ with reference to what was this said? When a bhikkhu is completely disenchanted with five things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering. What five things? The five aggregates subject to clinging. When a bhikkhu is completely disenchanted with these five things … in this very life he makes an end of suffering.",
    "an10.27:15": "(6) \"When it was said: ‘A question about six, a concise statement about six, an explanation of six,’ with reference to what was this said? When a bhikkhu is completely disenchanted with six things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering. What six things? The six internal sense bases. When a bhikkhu is completely disenchanted with these six things … in this very life he makes an end of suffering.",
    "an10.27:16": "(7) \"When it was said: ‘A question about seven, a concise statement about seven, an explanation of seven,’ with reference to what was this said? When a bhikkhu is completely disenchanted with seven things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering. What seven things? The seven stations for consciousness.[n.2008] SeeAN7.44.When a bhikkhu is completely disenchanted with these seven things … in this very life he makes an end of suffering.",
    "an10.27:17": "(8) \"When it was said: ‘A question about eight, a concise statement about eight, an explanation of eight,’ with reference to what was this said? When a bhikkhu is completely disenchanted with eight things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering. What eight things? The eight worldly conditions.[n.2009] SeeAN8.6.When a bhikkhu is completely disenchanted with these eight things … in this very life he makes an end of suffering.",
    "an10.27:18": "(9) \"When it was said: ‘A question about nine, a concise statement about nine, an explanation of nine,’ with reference to what was this said? When a bhikkhu is completely disenchanted with nine things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering. What nine things? The nine abodes of beings.[n.2010] SeeAN9.24.When a bhikkhu is completely disenchanted with these nine things … in this very life he makes an end of suffering.",
    "an10.27:19": "(10) \"When it was said: ‘A question about ten, a concise statement about ten, an explanation of ten,’ with reference to what was this said? When a bhikkhu is completely disenchanted with ten things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering. What ten things? The ten unwholesome courses of kamma.[n.2011] I followBeand Eedasasu akusalesu kammapathesu, as against Cedasasu akusalesu dhammesu. Ce hasdasasu kusalesu kammapathesuatAN10.28§10.When a bhikkhu is completely disenchanted with these ten things, completely dispassionate toward them, completely liberated from them, completely sees their delimitations, and completely breaks through their meaning, in this very life he makes an end of suffering."
}