{
    "an10.116:1": "Then the wanderer Ajita approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one sideand said to the Blessed One:",
    "an10.116:2": "\"Master Gotama, I have a fellow ascetic named Paṇḍita.[n.151]Paṇḍita. The word means \"wise one, learned one.\" I am uncertain whether this was a proper name or a sobriquet.He has thought out five hundred arguments[n.15]Cittaṭṭhānasatāni.Mpglosses withcittuppādasatāni. It seems to me that readingcintain place ofcitta- would be more appropriate to the context. One Burmese manuscript referred to in the notes to Ee does in fact have this reading.by which those of other sects, when rebutted, know: ‘We’ve been rebutted.’\"",
    "an10.116:3": "Then the Blessed One addressed the bhikkhus: \"Do you remember, bhikkhus, Paṇḍita's cases?\"",
    "an10.116:4": "\"Well then, bhikkhus, listen and attend closely. I will speak.\"",
    "an10.116:5": "\"Here, someone refutes and disproves a doctrine contrary to the Dhamma with a doctrine contrary to the Dhamma. In this way, he delights an assembly contrary to the Dhamma. For this reason, the assembly contrary to the Dhamma becomes loud and boisterous, exclaiming: ‘He is truly wise, sir! He is truly wise, sir!’[n.213]Paṇḍito vata bho paṇḍito vata bho. This refers back to the name of the ascetic sophist.",
    "an10.116:6": "\"Someone refutes and disproves a doctrine that accords with the Dhamma by means of a doctrine contrary to the Dhamma. In this way, he delights an assembly contrary to the Dhamma. For this reason, the assembly contrary to the Dhamma becomes loud and boisterous, exclaiming: ‘He is truly wise, sir! He is truly wise, sir!’",
    "an10.116:7": "\"Someone refutes and disproves both a doctrine that accords with the Dhamma and a doctrine contrary to the Dhamma by means of a doctrine contrary to the Dhamma. In this way, he delights an assembly contrary to the Dhamma. For this reason, the assembly contrary to the Dhamma becomes loud and boisterous, exclaiming: ‘He is truly wise, sir! He is truly wise, sir!’[n.2154] These first three cases are common toCe,Be, and Ee. Be ends here, but Ce adds two further paragraphs, and Ee one paragraph, unique to that edition.\"Someone refutes and disproves both a doctrine that accords with the Dhamma and a doctrine contrary to the Dhamma by means of a doctrine that accords with the Dhamma. In this way, he delights an assembly contrary to the Dhamma. For that reason, the assembly contrary to the Dhamma becomes loud and boisterous, exclaiming: ‘He is truly wise, sir! He is truly wise, sir!’\"Someone refutes and disproves a doctrine that accords with the Dhamma with a doctrine that accords with the Dhamma. In this way, he delights an assembly that accords with the Dhamma. For this reason, the assembly that accords with the Dhamma becomes loud and boisterous, exclaiming: ‘He is truly wise, sir! He is truly wise, sir!’[n.2155] In place of these two paragraphs inCe,Ee has a paragraph that reads as follows: \"Someone refutes and disproves a doctrine contrary to the Dhamma with a doctrine that accords with the Dhamma. In this way,he delights an assembly that accords with the Dhamma. For this reason, the assembly that accords with the Dhamma becomes loud and boisterous, exclaiming: ‘He is truly wise, sir! He is truly wise, sir!’\" It is quite normal, even expected, for a doctrine that accords with the Dhamma to prevail over a doctrine contrary to the Dhamma, but again it seems incongruous for an assembly that accords with the Dhamma to become \"loud and boisterous.\"",
    "an10.116:8": "\"Bhikkhus, what is non-Dhamma and what is the Dhamma should be understood, and what is harmful and what is beneficial should be understood. Having understood what is non-Dhamma and what is the Dhamma, and what is harmful and what is beneficial, one should practice in accordance with the Dhamma and with what is beneficial.",
    "an10.116:9": "\"And what, bhikkhus, is non-Dhamma and what is the Dhamma? And what is harmful and what is beneficial?",
    "an10.116:10": "(2) \"Wrong intention is non-Dhamma; right intention is the Dhamma … wrong speech is non-Dhamma; right speech is the Dhamma … wrong action is non-Dhamma; right action is the Dhamma … wrong livelihood is non-Dhamma; right livelihood is the Dhamma … wrong effort is non-Dhamma; right effort is the Dhamma … wrong mindfulness is non-Dhamma; right mindfulness is the Dhamma, wrong concentration is non-Dhamma; right concentration is the Dhamma … wrong knowledge is non-Dhamma; right knowledge is the Dhamma.11() \"Wrong liberation is non-Dhamma; right liberation is the Dhamma. The numerous bad unwholesome qualities that originate with wrong liberation as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right liberation as condition: these are beneficial.12\"When it was said: ‘Bhikkhus, what is non-Dhamma and what is the Dhamma should be understood, and what is harmful and what is beneficial should be understood. Having understood what is non-Dhamma and what is the Dhamma,and what is harmful and what is beneficial, one should practice in accordance with the Dhamma and with what is beneficial,’ it is with reference to this that this was said.\"",
    "an10.116:11": "(10) \"Wrong liberation is non-Dhamma; right liberation is the Dhamma. The numerous bad unwholesome qualities that originate with wrong liberation as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right liberation as condition: these are beneficial.",
    "an10.116:12": "\"When it was said: ‘Bhikkhus, what is non-Dhamma and what is the Dhamma should be understood, and what is harmful and what is beneficial should be understood. Having understood what is non-Dhamma and what is the Dhamma,and what is harmful and what is beneficial, one should practice in accordance with the Dhamma and with what is beneficial,’ it is with reference to this that this was said.\""
}