{
    "an10.114:1": "\"Bhikkhus, what is non-Dhamma and what is the Dhamma should be understood, and what is harmful and what is beneficial should also be understood. Having understood what is non-Dhamma and what is the Dhamma, and also what is harmful and what is beneficial, one should practice in accordance with the Dhamma and with what is beneficial.",
    "an10.114:2": "\"And what, bhikkhus, is non-Dhamma and what is the Dhamma? And what is harmful and what is beneficial?",
    "an10.114:3": "(1) \"Wrong view is non-Dhamma; right view is the Dhamma. The numerous bad unwholesome qualities that originate with wrong view as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right view as condition: these are beneficial.",
    "an10.114:4": "(2) \"Wrong intention is non-Dhamma; right intention is the Dhamma. The numerous bad unwholesome qualities that originate with wrong intention as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right intention as condition: these are beneficial.",
    "an10.114:5": "(3) \"Wrong speech is non-Dhamma; right speech is the Dhamma. The numerous bad unwholesome qualities that originate with wrong speech as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right speech as condition: these are beneficial.",
    "an10.114:6": "(4) \"Wrong action is non-Dhamma; right action is the Dhamma. The numerous bad unwholesome qualities that originate with wrong action as condition:these are harmful. The numerous wholesome qualities that reach fulfillment by development with right action as condition: these are beneficial.",
    "an10.114:7": "(5) \"Wrong livelihood is non-Dhamma; right livelihood is the Dhamma. The numerous bad unwholesome qualities that originate with wrong livelihood as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right livelihood as condition: these are beneficial.",
    "an10.114:8": "(6) \"Wrong effort is non-Dhamma; right effort is the Dhamma. The numerous bad unwholesome qualities that originate with wrong effort as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right effort as condition: these are beneficial.",
    "an10.114:9": "(7) \"Wrong mindfulness is non-Dhamma; right mindfulness is the Dhamma. The numerous bad unwholesome qualities that originate with wrong mindfulness as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right mindfulness as condition: these are beneficial.",
    "an10.114:10": "(8) \"Wrong concentration is non-Dhamma; right concentration is the Dhamma. The numerous bad unwholesome qualities that originate with wrong concentration as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right concentration as condition: these are beneficial.",
    "an10.114:11": "(9) \"Wrong knowledge is non-Dhamma; right knowledge is the Dhamma. The numerous bad unwholesome qualities that originate with wrong knowledge as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right knowledge as condition: these are beneficial.",
    "an10.114:12": "(10) \"Wrong liberation is non-Dhamma; right liberation is the Dhamma. The numerous bad unwholesome qualities that originate with wrong liberation as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right liberation as condition: these are beneficial.",
    "an10.114:13": "\"When it was said: ‘Bhikkhus, what is non-Dhamma and what is the Dhamma should be understood, and what is harmful and what is beneficial should also be understood. Having understood what is non-Dhamma and what is the Dhamma, and also what is harmful and what is beneficial, one should practice in accordance with the Dhamma and with what is beneficial,’ it is with reference to this that this was said.\""
}