{
    "an10.84:1": "There the Venerable Mahāmoggallāna addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an10.84:2": "\"Here, friends, a bhikkhu declares final knowledge thus: ‘I understand: \"Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.\"’ The Tathāgataor his disciple who is a jhāna-attainer—skilled in attainment, skilled in others’ minds, skilled in the ways of others’ minds—questions him, interrogates him, and cross-examines him. When he is being questioned, interrogated, and cross-examined by the Tathāgata or his disciple, he comes to an impasse and is flustered. He meets with calamity, meets with disaster, meets with calamity and disaster.",
    "an10.84:3": "\"The Tathāgata or his disciple who is a jhāna-attainer … encompasses his mind with his own mind and considers: ‘Why does this venerable one declare final knowledge thus: \"I understand: ‘Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.’\"?’",
    "an10.84:4": "The Tathāgata or his disciple, having encompassed his mind with his own mind, understands:",
    "an10.84:5": "(1) \"‘This venerable one is prone to anger and his mind is often obsessed by anger. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by anger is a case of decline.",
    "an10.84:6": "(2) \"‘This venerable one is hostile and his mind is often obsessed by hostility. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by hostility is a case of decline.",
    "an10.84:7": "(3) \"‘This venerable one is prone to denigration and his mind is often obsessed by denigration. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by denigration is a case of decline.",
    "an10.84:8": "(4) \"‘This venerable one is insolent and his mind is often obsessed by insolence. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by insolence is a case of decline.",
    "an10.84:9": "(5) \"‘This venerable one is envious and his mind is often obsessed by envy. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by envy is a case of decline.",
    "an10.84:10": "(6) \"‘This venerable one is miserly and his mind is often obsessed by miserliness.But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by miserliness is a case of decline.",
    "an10.84:11": "(7) \"‘This venerable one is crafty and his mind is often obsessed by craftiness. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by craftiness is a case of decline.",
    "an10.84:12": "(8) \"‘This venerable one is deceitful and his mind is often obsessed by deceitfulness. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by deceitfulness is a case of decline.",
    "an10.84:13": "(9) \"‘This venerable one has evil desires and his mind is often obsessed by desire. But in the Dhamma and discipline proclaimed by the Tathāgata, obsession by desire is a case of decline.",
    "an10.84:14": "(10) \"‘When there is something further to be done,[n.2102] I here read withBeSati kho pana ayamāyasmā uttari karaṇīye, as against Ce and EeMuṭṭhassati kho pana ayamāyasmā uttari karaṇīye, \"This venerable one, who is muddle-minded, when there is something further to be done … \" In Besatiis a present participle used in a locative absolute construction; it is totally unrelated to the nounsatimeaning mindfulness. Possibly the readingmuṭṭhassatiarose through the influence ofAN10.85§7 below.this venerable one comes to a stop along the way on account of some lower achievement of distinction. But in the Dhamma and discipline proclaimed by the Tathāgata, coming to a stop along the way is a case of decline.’",
    "an10.84:15": "\"Truly, friends, it is impossible for a bhikkhu who has not abandoned these ten things to achieve growth, progress, and maturity in this Dhamma and discipline. But it is possible for a bhikkhu who has abandoned these ten things to achieve growth, progress, and maturity in this Dhamma and discipline.\""
}