{
    "an10.50:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion,after their meal, on returning from their alms round, a number of bhikkhus assembled in the assembly hall and were sitting together when they took to arguing and quarreling and fell into a dispute, stabbing each other with piercing words.",
    "an10.50:2": "Then, in the evening, the Blessed One emerged from seclusion and went to the assembly hall, where he sat down on the prepared seat. The Blessed One then addressed the bhikkhus:",
    "an10.50:3": "\"Here, Bhante, after our meal, on returning from our alms round, we assembled in the assembly hall and were sitting together when we took to arguing and quarreling and fell into a dispute, stabbing each other with piercing words.\"",
    "an10.50:4": "\"There are, bhikkhus, these ten principles of cordiality that create affection and respect and conduce to cohesiveness, to non-dispute, to concord, and to unity.[n.2059] The formula is the same as that atAN6.12, though the content is different. The ten principles are the same as the \"ten qualities that make for a protector\" atAN10.18.What ten?",
    "an10.50:5": "(2) \"Again, a bhikkhu has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally,investigated mentally, and penetrated well by view. Since a bhikkhu has learned much … this is a principle of cordiality that creates affection and respect and conduces … to unity.",
    "an10.50:6": "(3) \"Again, a bhikkhu has good friends, good companions, good comrades. Since a bhikkhu has good friends … this is a principle of cordiality that creates affection and respect and conduces … to unity.",
    "an10.50:7": "(4) \"Again, a bhikkhu is easy to correct and possesses qualities that make him easy to correct; he is patient and receives instruction respectfully. Since a bhikkhu is easy to correct … this is a principle of cordiality that creates affection and respect and conduces … to unity.",
    "an10.50:8": "(5) \"Again, a bhikkhu is skillful and diligent in attending to the diverse chores that are to be done for his fellow monks; he possesses appropriate investigation there, and he is able to carry out and arrange everything properly. Since a bhikkhu is skillful and diligent … this is a principle of cordiality that creates affection and respect and conduces … to unity.",
    "an10.50:9": "(6) \"Again, a bhikkhu loves the Dhamma and is pleasing in his assertions, filled with a lofty joy pertaining to the Dhamma and discipline. Since a bhikkhu loves the Dhamma … this is a principle of cordiality that creates affection and respect and conduces … to unity.",
    "an10.50:10": "(7) \"Again, a bhikkhu has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. Since a bhikkhu has aroused energy …… this is a principle of cordiality that creates affection and respect and conduces … to unity.",
    "an10.50:11": "(8) \"Again, a bhikkhu is content with any kind of robe, almsfood, lodging, and medicines and provisions for the sick. Since a bhikkhu is content with any kind of robe … this is a principle of cordiality that creates affection and respect and conduces … to unity.",
    "an10.50:12": "(9) \"Again, a bhikkhu is mindful, possessing supreme mindfulness and alertness, one who remembers and recollects what was done and said long ago. Since a bhikkhu is mindful … this is a principle of cordiality that creates affection and respect and conduces … to unity.",
    "an10.50:13": "(10) \"Again, a bhikkhu is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering. Since a bhikkhu is wise … this is a principle of cordiality that creates affection and respect and conduces … to unity.",
    "an10.50:14": "\"These, bhikkhus, are the ten principles of cordiality that create affection and respect and conduce to cohesiveness, to non-dispute, to concord, and to unity.\""
}