{
    "an10.29:1": "() \"Bhikkhus, as far as Kāsi and Kosala extend, as far as the realm of King Pasenadi of Kosala extends, there King Pasenadi of Kosala ranks as the foremost. But even for King Pasenadi there is alteration; there is change. Seeing this thus, the instructed noble disciple becomes disenchanted with it; being disenchanted, he becomes dispassionate toward the foremost, not to speak of what is inferior.",
    "an10.29:2": "() \"Bhikkhus, as far as sun and moon revolve and light up the quarters with their brightness, so far the thousandfold world system extends.[n.016] This cosmology is also atAN3.80.In that thousandfold world system there are a thousand moons, a thousand suns, a thousand Sinerus king of mountains, a thousand Jambudīpas, a thousand Aparagoyānas, a thousand Uttarakurus, a thousand Pubbavidehas, and a thousand four great oceans; a thousand four great kings, a thousandheavens ruled bythe four great kings, a thousand Tāvatiṁsaheavens, a thousand Yāmaheavens, a thousand Tusitaheavens, a thousandheavensof devas who delight in creation, a thousandheavensof devas who control what is created by others, a thousand brahmā worlds. As far, bhikkhus, as this thousandfold world system extends, Mahābrahmāthere ranks as the foremost. But even for Mahābrahmā there is alteration; there is change. Seeing this thus, the instructed noble disciple becomes disenchanted with it; being disenchanted, he becomes dispassionate toward the foremost, not to speak of what is inferior.",
    "an10.29:3": "() \"There comes a time, bhikkhus, when this world dissolves. When the world is dissolving, beings for the most part migrate to the devas of streaming radiance.[n.2017]Yebhuyyena sattā ābhassarasaṁvattanikā bhavanti. This seems to mean that they are reborn among theābhassaradevas, the highest plane corresponding to the second jhāna. It remains while all the lower planes of existence undergo dissolution.There they exist mind-made, feeding on rapture, self-luminous, moving through the skies, living in glory, and they remain thus for a very long time. When the world is dissolving, the devas of streaming radiance rank as the foremost. But even for these devas there is alteration; there is change. Seeing this thus, the instructed noble disciple becomes disenchanted with it; being disenchanted, he becomes dispassionate toward the foremost, not to speak of what is inferior.",
    "an10.29:4": "() \"Bhikkhus, there are these tenkasiṇabases.[n.2018] As above atAN10.25.What ten? One person perceives the earthkasiṇaabove, below, across, undivided, measureless. One person perceives the waterkasiṇa… the firekasiṇa… the airkasiṇa… the bluekasiṇa… the yellowkasiṇa… the redkasiṇa… the whitekasiṇa… the spacekasiṇa… the consciousnesskasiṇaabove, below, across, undivided, measureless. These are the tenkasiṇabases.",
    "an10.29:5": "Of these tenkasiṇabases, this is the foremost, namely, when one perceives the consciousnesskasiṇaabove, below, across, undivided, measureless. There are beings who are percipient in such a way. But even for beings who are percipient in such a way there is alteration; there is change. Seeing this thus,bhikkhus, the instructed noble disciple becomes disenchanted with it; being disenchanted, he becomes dispassionate toward the foremost, not to speak of what is inferior.",
    "an10.29:6": "(5) \"Bhikkhus, there are these eight bases of overcoming.[n.2019] As atAN8.5.What eight?i\"One percipient of forms internally sees forms externally, limited, beautiful or ugly. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the first basis of overcoming.",
    "an10.29:7": "ii\"One percipient of forms internally sees forms externally, measureless, beautiful or ugly. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the second basis of overcoming.",
    "an10.29:8": "iii\"One not percipient of forms internally sees forms externally, limited, beautiful or ugly. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the third basis of overcoming.",
    "an10.29:9": "iv\"One not percipient of forms internally sees forms externally, measureless, beautiful or ugly. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the fourth basis of overcoming.",
    "an10.29:10": "v\"One not percipient of forms internally sees forms externally, blue ones, blue in color, with a blue hue, with a blue tint. Just as the flax flower is blue, blue in color, with a blue hue, with a blue tint, or just as Bārāṇasī cloth, smoothened on both sides, might be blue, blue in color, with a blue hue, with a blue tint, so too, one not percipient of forms internally sees forms externally, blue ones …. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the fifth basis of overcoming.",
    "an10.29:11": "vi\"One not percipient of forms internally sees forms externally, yellow ones, with a yellow hue, with a yellow tint. Just as thekaṇikāraflower is yellow, yellow in color, with a yellow hue, with a yellow tint, or just as Bārāṇasī cloth,smoothened on both sides, might be yellow, yellow in color, with a yellow hue, with a yellow tint, so too, one not percipient of forms internally sees forms externally, yellow ones …. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the sixth basis of overcoming.",
    "an10.29:12": "vii\"One not percipient of forms internally sees forms externally, red ones, with a red hue, with a red tint. Just as thebandhujīvakaflower is red, red in color, with a red hue, with a red tint, or just as Bārāṇasī cloth, smoothened on both sides, might be red, red in color with a red hue, with a red tint, so too, one not percipient of forms internally sees forms externally, red ones …. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the seventh basis of overcoming.",
    "an10.29:13": "viii\"One not percipient of forms internally sees forms externally, white ones, white in color, with a white hue, with a white tint. Just as the morning star is white, white in color, with a white hue, with a white tint, or just as Bārāṇasī cloth, smoothened on both sides, might be white, white in color, with a white hue, with a white tint, so too, one not percipient of forms internally sees forms externally, white ones …. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the eighth basis of overcoming.",
    "an10.29:14": "\"These are the eight bases of overcoming. Of these eight bases of overcoming, this is the foremost, namely, that one not percipient of forms internally sees forms externally, white ones, white in color with a white hue, with a white tint, and having overcome them, he is percipient thus: ‘I know, I see.’ There are beings who are percipient in such a way. But even for beings who are percipient in such a way there isalteration; there is change. Seeing this thus, the instructed noble disciple becomes disenchanted with it; being disenchanted, he becomes dispassionate toward the foremost, not to speak of what is inferior.",
    "an10.29:15": "(6) \"Bhikkhus, there are these four modes of practice.[n.2020] As atAN4.161–62.What four? Practice that is painful with sluggish direct knowledge; practice that is painful with quick direct knowledge; practice that is pleasant with sluggish direct knowledge; and practice that is pleasant with quick direct knowledge. These are the four modes of practice.",
    "an10.29:16": "Of these four modes of practice, this is the foremost, namely, practice that is pleasant with quick direct knowledge. There are beings who practice in such a way. But even for beings who practice in such a way there is alteration; there is change. Seeing this thus, the instructed noble disciple becomes disenchanted with it; being disenchanted, he becomes dispassionate toward the foremost, not to speak of what is inferior.",
    "an10.29:17": "(7) \"Bhikkhus, there are these four modes of perception. What four? One person perceives what is limited; another perceives what is exalted; another perceives what is measureless; and still another,perceiving‘There is nothing,’ perceives the base of nothingness.[n.2021]Mpdoes not comment, but I assume these four perceptions are sense-sphere perception, perception in the four jhānas, perception in the first two formless attainments, and perception in the base of nothingness.These are the four modes of perception.",
    "an10.29:18": "Of these four modes of perception, this is the foremost, namely, when,perceiving‘There is nothing,’ one perceives the base of nothingness. There are beings who perceive in such a way. But even for beings who perceive in such a way there is alteration; there is change. Seeing this thus, the instructed noble disciple becomes disenchanted with it; being disenchanted, he becomes dispassionate toward the foremost, not to speak of what is inferior.",
    "an10.29:19": "(8) \"Bhikkhus, of the speculative views held by outsiders, this is the foremost, namely: ‘I might not be and it might not be mine; I shall not be,andit will not be mine.’[n.2022] See note1532.For it can be expected that one who holds such a view will not be unrepelled by existenceand will not be repelled by the cessation of existence.[n.2023]Yā cāyaṁ bhave appaṭikulyatā, sā c’assa na bhavissati, yā cāyaṁ bhavanirodhe pāṭikulyatā, sā c’assa na bhavissati. The point, it seems, is that because annihilationism arises from aversion toward continued personal existence, the annihilationist welcomes the cessation of existence, though from the Buddha’s perspective annihilationism goestoo farby misinterpreting such cessation as the annihilation of a real self or existent person. See It §49, 43–44.There are beings who hold such a view. But even for beings who hold such a view there is alteration; there is change. Seeing this thus, the instructed noble disciple becomes disenchanted with it; being disenchanted, he becomes dispassionate toward the foremost, not to speak of what is inferior.",
    "an10.29:20": "(9) \"Bhikkhus, there are some ascetics and brahmins who proclaim supreme purification.[n.24]Paramatthavisuddhim paññāpenti.Mp:\"This is a designation for the base of neither-perception-nor-non-perception. For the base of nothingness is highest as the foundation for insight, but the base of neither-perception-nor-non-perception is highest in terms of long lifespan.\"Of those who proclaim supreme purification, this is the foremost, namely, by completely surmounting the base of nothingness, one enters and dwells in the base of neither-perception-nor-non-perception. They teach their Dhamma for the direct knowledge and realization of this. There are beings who assert thus. But even for those who assert thus, there is alteration; there is change. Seeing this thus, the instructed noble disciple becomes disenchanted with it; being disenchanted, he becomes dispassionate toward the foremost, not to speak of what is inferior.",
    "an10.29:21": "(10) \"Bhikkhus, there are some ascetics and brahmins who proclaim supreme nibbāna in this very life.[n.2025]Paramadiṭṭhadhammaṁ nibbānaṁ paññāpenti. SeeDN 1.160, I 36–38, where five views of \"supreme nibbāna in this very life\" are examined. These hold that supreme nibbāna is the unrestrained enjoyment of the five kinds of sensual pleasure or each of the four jhānas (taken individually). The Buddha opposes these here with the assertion that supreme nibbāna is attained by fully understanding the six sense bases for contact. The same is said atDN 1.162.Of those who proclaim supreme nibbāna in this very life, this is the foremost, namely, emancipation through non-clinging after one has seen as they really are the origin and passing away, the gratification, danger, and escape in regard to the six bases for contact."
}