{
    "an10.6:1": "\"Bhante, could a bhikkhu obtain such a state of concentration that () he would not be percipient of earth in relation to earth;[n.968]Mp:\"He would not take earth as object and be percipient through an arisen perception ‘earth.’\" It seems that what is being denied here is a jhāna based on the earthkasiṇa. The same holds below for water, fire, and air. This is confirmed by the next four steps, which negate the four formless bases. In other words, this concentration is not a jhāna based on thekasiṇasor formless attainments.(2) of water in relation to water; (3) of fire in relation to fire; (4) of air in relation to air; (5) of the base of the infinity of space in relation to the base of the infinity of space; (6) of the base of the infinity of consciousness in relation to the base of the infinity of consciousness; (7) of the base of nothingness in relation to the base of nothingness; (8) of the base of neither-perception-nor-non-perception in relation to the base of neither-perception-nor-non-perception; (9) of this world in relation to this world; (0) of the other world in relation to the other world, but he would still be percipient?\"",
    "an10.6:2": "\"But how, Bhante, could he obtain such a state of concentration?\"",
    "an10.6:3": "\"Here, Ānanda, a bhikkhu is percipient thus: ‘This is peaceful, this is sublime, that is, the stilling of all activities, the relinquishing of all acquisitions, the destruction of craving, dispassion, cessation, nibbāna.’[n.1969]Mpidentifies this with the concentration of fruition attainment(phalasamāpattisamādhi). This attainment is not the fruition that occurs for a few moments immediately following the path, but a special meditative state accessible only to those who have already attained one of the four paths and its subsequent fruition. The attainment, as shown in this sutta, does not take any of the mundane, conditioned meditation objects as its support; its support is the unconditioned nibbāna, experienced directly and immediately. The commentaries hold that this attainment is graded as fourfold according to the four stages of realization (from stream-entry to arahantship).It is in this way, Ānanda, that a bhikkhu could obtain such a state of concentration that he would not be percipient of earth in relation to earth; of water in relation to water; of fire in relation to fire; of air in relation to air; of the base of the infinity of space in relation to the base of the infinity of space; of the base of the infinity of consciousness in relation to the base of the infinity of consciousness; of the base of nothingness in relation to the base of nothingness; of the base of neither-perception-nor-non-perception in relation to the base of neither-perception-nor-non-perception; of this world in relation to this world; of the other world in relation to the other world, but he would still be percipient.\""
}