{
    "an10.97:1": "\"Bhikkhus, possessing ten qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What ten?",
    "an10.97:2": "(1) \"Here, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them.",
    "an10.97:3": "(2) \"He has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaningand phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally, investigated mentally, and penetrated well by view.",
    "an10.97:4": "(3) \"He has good friends, good companions, good comrades.",
    "an10.97:5": "(4) \"He holds right view and has a correct perspective.",
    "an10.97:6": "(5) \"He wields the various kinds of psychic potency: having been one, he becomes many; having been many, he becomes one; he appears and vanishes; he goes unhindered through a wall, through a rampart, through a mountain as though through space; he dives in and out of the earth as though it were water; he walks on water without sinking as though it were earth; seated cross-legged, he travels in space like a bird; with his hand he touches and strokes the moon and sun so powerful and mighty; he exercises mastery with the body as far as the brahmā world.",
    "an10.97:7": "(6) \"With the divine ear element, which is purified and surpasses the human, he hears both kinds of sounds, the divine and human, those that are far as well as near.",
    "an10.97:8": "(7) \"He understands the minds of other beings and persons, having encompassed them with his own mind. He understands a mind with lust as a mind with lust, and a mind without lust as a mind without lust; a mind with hatred as a mind with hatred, and a mind without hatred as a mind without hatred; a mind with delusion as a mind with delusion, and a mind without delusion as a mind without delusion; a contracted mind as contracted and a distracted mind as distracted; an exalted mind as exalted and an unexalted mind as unexalted; a surpassable mind as surpassable and an unsurpassable mind as unsurpassable; a concentrated mind as concentrated and an unconcentrated mind as unconcentrated; a liberated mind as liberated and an unliberated mind as unliberated.[n.2132] I followBe,whose reading of this stock passage conforms to the sequence found elsewhere in AN. Ce and Ee invert the order of the \"exalted,\" \"concentrated,\" and \"liberated\" dyads, so that the superior consistently follows the inferior state. The Ce and Ee readings of all the earlier AN suttas use the sequence of the Be reading, and there seems no reason here for this sequence to be inverted.",
    "an10.97:9": "(8) \"He recollects his manifold past abodes, that is, one birth, two births, three births, four births,five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of world-dissolution, many eons of world-evolution, many eons of world-dissolution and world-evolution thus: ‘There I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn elsewhere, and there too I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn here.’ Thus he recollects his manifold past abodes with their aspects and details.",
    "an10.97:10": "(9) \"With the divine eye, which is purified and surpasses the human, he sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare in accordance with their kamma thus: ‘These beings who engaged in misconduct by body, speech, and mind, who reviled the noble ones, held wrong view, and undertook kamma based on wrong view, with the breakup of the body, after death, have been reborn in the plane of misery, in a bad destination, in the lower world, in hell; but these beings who engaged in good conduct by body, speech, and mind, who did not revile the noble ones, who held right view, and undertook kamma based on right view, with the breakup of the body, after death, have been reborn in a good destination, in a heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare in accordance with their kamma.",
    "an10.97:11": "(10) \"With the destruction of the taints, he has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it.",
    "an10.97:12": "\"Possessing these ten qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.\""
}