{
    "an10.212:1": "\"Bhikkhus, possessing ten qualities, one is deposited in hell as if brought there. What ten?[n.276] Except for the abridgment I do not detect any difference between this sutta and the previous one. I have translated the text just as it is, additionally abridging only the descriptions of wrong view and right view. None of the editions says anything about this.Mpdoes not comment on the first five suttas in this vagga, stating that their meaning is clear.",
    "an10.212:2": "() He takes what is not given … (3) He engages in sexual misconduct … (4) He speaks falsehood … (5) He speaks divisively … (6) He speaks harshly… (7) He indulges in idle chatter … (8) He is full of longing … (9) He has a mind of ill will and intentions of hate … (10) He holds wrong view and has an incorrect perspective thus: ‘There is nothing given … there are in the world no ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’ One possessing these ten qualities is deposited in hell as if brought there.",
    "an10.212:3": "\"Bhikkhus, one possessing ten qualities is deposited in heaven as if brought there. What ten?",
    "an10.212:4": "(2) Having abandoned the taking of what is not given, he abstains from taking what is not given … (3) Having abandoned sexual misconduct, he abstains from sexual misconduct … () Having abandoned false speech, he abstains from false speech … (5) Having abandoned divisive speech, he abstains from divisive speech … (6) Having abandoned harsh speech, he abstains from harsh speech … (7) Having abandoned idle chatter, he abstains from idle chatter … (8) He is without longing … (9) He is of good will … (10) He holds right view and has a correct perspective thus: ‘There is what is given … there are in the world ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’ One possessing these ten qualities is deposited in heaven as if brought there.\""
}