{
    "an10.68:1": "On one occasion the Blessed One was wandering on tour among the Kosalans together with a large Saṅgha of bhikkhus when he reached the Kosalan town named Naḷakapāna. There at Naḷakapāna the Blessed One dwelled in a Judas tree grove. Now on that occasion, on the day of the uposatha, the Blessed One was sitting surrounded by the Saṅgha of bhikkhus. Having instructed, encouraged, inspired, and gladdened the Saṅgha of bhikkhus with a Dhamma talk for much of the night, and having surveyed the utterly silent Saṅgha of bhikkhus, the Blessed One addressed the Venerable Sāriputta:",
    "an10.68:2": "\"The Saṅgha of bhikkhus is free from dullness and drowsiness, Sāriputta. Give aDhamma talk to the bhikkhus. My back is aching, so I will stretch it.\"",
    "an10.68:3": "Then the Blessed One folded his outer robe in four and lay down on his right side in the lion's posture, with one foot overlapping the other, mindful and clearly comprehending, after noting in his mind the idea of rising.",
    "an10.68:4": "\"Friends, for one (1) who does not have faith incultivatingwholesome qualities, (2) who does not have a sense of moral shame … (3) who does not have moral dread … () who does not have energy … (5) who does not have wisdom … (6) who does not lend an ear … (7) who does not retain the Dhamma in mind … (8) who does not examine the meaning … (9) who does not practice in accordance with the Dhamma … (10) who is not heedful incultivatingwholesome qualities, whether night or day comes, only deterioration and not growth in wholesome qualities is to be expected. Just as, during the dark fortnight, whether night or day comes, the moon only deteriorates in beauty, roundness, and brightness, in diameter and circumference, so too, for one who does not have faith incultivatingwholesome qualities … for one who is not heedful incultivatingwholesome qualities, whether night or day comes, only deterioration and not growth in wholesome qualities is to be expected.",
    "an10.68:5": "\"Friends, for one (1) who has faith incultivatingwholesome qualities, (2) who has a sense of moral shame … (3) who has moral dread … (4) who has energy … () who has wisdom … (6) who lends an ear … (7) who retains the Dhamma in mind … (8) who examines the meaning … (9) who practices in accordance with the Dhamma … (10) who is heedfulcultivatingwholesome qualities, whether night or day comes, only growth and not deterioration in wholesome qualities is to be expected. Just as,during the bright fortnight, whether night or day comes, the moon only increases in beauty, roundness, and brightness, in diameter and circumference, so too, for one who has faith incultivatingwholesome qualities … heedfulness incultivatingwholesome qualities, whether night or day comes, only growth and not deterioration in wholesome qualities is to be expected.\"",
    "an10.68:6–7": "Then the Blessed One got up and addressed the Venerable Sāriputta: \"Good, good, Sāriputta! Sāriputta, for one who does not have faith incultivatingwholesome qualities …the Buddha here repeats Sāriputta's entire discourse down to:… whether night or day comes, only growth and not deterioration in wholesome qualities is to be expected.\""
}