{
    "an10.211:1": "\"Bhikkhus, possessing ten qualities, one is deposited in hell as if brought there. What ten?",
    "an10.211:2": "() \"He takes what is not given; he steals the wealth and property of others in the village or forest.",
    "an10.211:3": "()\"He engages in sexual misconduct; he has sexual relations with women who are protected by their mother, father, mother and father, brother, sister, or relatives; who are protected by their Dhamma; who have a husband; whose violation entails a penalty; or even with one already engaged.",
    "an10.211:4": "() \"He speaks falsehood. If he is summoned to a council, to an assembly, to his relatives’ presence, to his guild, or to the court, and questioned as a witness thus: ‘So, good man, tell what you know,’ then, not knowing, he says, ‘I know,’ or knowing, he says, ‘I do not know’; not seeing, he says, ‘I see,’ or seeing, he says, ‘I do not see.’ Thus he consciously speaks falsehood for his own ends, or for another's ends, or for some trifling worldly end.",
    "an10.211:5": "() \"He speaks divisively. Having heard something here, he repeats it elsewhere in order to dividethose peoplefrom these; or having heard something elsewhere, he repeats it to these people in order to dividethemfrom those. Thus he is one who divides those who are united, a creator of divisions, one who enjoys factions, rejoices in factions, delights in factions, a speaker of words that create factions.",
    "an10.211:6": "() \"He speaks harshly. He utters such words as are rough, hard, hurtful to others, offensive to others, bordering on anger, unconducive to concentration.",
    "an10.211:7": "() \"He indulges in idle chatter. He speaks at an improper time, speaks falsely, speaks what is unbeneficial, speaks contrary to the Dhamma and the discipline; at an improper time he speaks such words as are worthless, unreasonable, rambling, and unbeneficial.",
    "an10.211:8": "()\"He is full of longing. He longs for the wealth and property of others thus: ‘Oh, may what belongs to another be mine!’",
    "an10.211:9": "() \"He has a mind of ill will and intentions of hate thus: ‘May these beings be slain, slaughtered, cut off, destroyed, or annihilated!’",
    "an10.211:10-11": "(10) \"He holds wrong view and has an incorrect perspective thus: ‘There is nothing given, nothing sacrificed, nothing offered; there is no fruit or result of good and bad actions; there is no this world, no other world; there is no mother, no father; there are no beings spontaneously reborn; there are in the world no ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’",
    "an10.211:12": "\"Bhikkhus, one possessing ten qualities is deposited in heaven as if brought there. What ten?",
    "an10.211:13": "(2) \"Having abandoned the taking of what is not given, he abstains from taking what is not given. He does not steal the wealth and property of others in the village or in the forest.",
    "an10.211:14": "(3) \"Having abandoned sexual misconduct, he abstains from sexual misconduct. He does not have sexual relations with women who are protected by their mother, father, mother and father, brother, sister, or relatives; who are protected by their Dhamma; who have a husband; whose violation entails a penalty; or even with one already engaged.",
    "an10.211:15": "(4) \"Having abandoned false speech, he abstains from false speech. If he is summoned to a council, to an assembly, to his relatives’ presence, to his guild, or to the court, and questioned as a witness thus: ‘So, good man, tell what you know,’ then, not knowing, he says, ‘I do not know,’ or knowing, he says, ‘I know’; not seeing, he says, ‘I do not see,’ or seeing, he says, ‘I see.’ Thus he does not consciously speak falsehood for his own ends, or for another's ends, or for some trifling worldly end.",
    "an10.211:16": "(5) \"Having abandoned divisive speech, he abstains from divisive speech. Having heard something here, he does not repeat it elsewhere in order to dividethose peoplefrom these; or having heard something elsewhere, he does not repeat it to these people in order to dividethemfrom those. Thus he is one who reunites those who are divided, a promoter of unity, who enjoys concord, rejoices in concord, delights in concord, a speaker of words that promote concord.",
    "an10.211:17": "(6) \"Having abandoned harsh speech, he abstains from harsh speech. He speaks such words as are gentle, pleasing to the ear, and lovable, as go to the heart, are courteous, desired by many, and agreeable to many.",
    "an10.211:18": "(7) \"Having abandoned idle chatter, he abstains from idle chatter. He speaks at a proper time, speaks truth, speaks what is beneficial, speaks on the Dhamma and the discipline; at a proper time he speaks such words as are worth recording, reasonable, succinct, and beneficial.",
    "an10.211:19": "(8) \"He is without longing. He does not long for the wealth and property of others thus: ‘Oh, may what belongs to another be mine!’",
    "an10.211:20": "(9) \"He is of good will and his intentions are free of hate thus: ‘May these beings live happily, free from enmity, affliction, and anxiety!’",
    "an10.211:21": "(10) \"He holds right view and has a correct perspective thus: ‘There is what is given, sacrificed, and offered; there is fruit and result of good and bad actions; there is this world and the other world; there is mother and father; there are beings spontaneously reborn; there are in the world ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’",
    "an10.211:22": "\"One possessing these ten qualities is deposited in heaven as if brought there.\""
}