{
    "an10.67:1": "On one occasion the Blessed One was wandering on tour among the Kosalans together with a large Saṅgha of bhikkhus when he reached the Kosalan town named Naḷakapāna. There at Naḷakapāna the Blessed One dwelled in a Judas tree grove. Now on that occasion, on the day of the uposatha, the Blessed One was sitting surrounded by the Saṅgha of bhikkhus. Having instructed, encouraged, inspired, and gladdened the Saṅgha of bhikkhus with a Dhamma talk for much of the night, and having surveyed the utterly silent Saṅgha of bhikkhus, the Blessed One addressed the Venerable Sāriputta:",
    "an10.67:2": "\"The Saṅgha of bhikkhus is free from dullness and drowsiness, Sāriputta. Give aDhamma talk to the bhikkhus. My back is aching, so I will stretch it.\"",
    "an10.67:3": "Then the Blessed One folded his outer robe in four and lay down on his right side in the lion's posture, with one foot overlapping the other, mindful and clearly comprehending, after noting in his mind the idea of rising. The Venerable Sāriputta then addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an10.67:4": "\"Friends, for one who does not have faith incultivatingwholesome qualities, who does not have a sense of moral shame … who does not have moral dread … who does not have energy … who does not have wisdom incultivatingwholesome qualities, whether night or day comes, only deterioration and not growth in wholesome qualities is to be expected. Just as, during the dark fortnight, whether night or day comes, the moon only deteriorates in beauty, roundness, and brightness, in diameter and circumference, so too, for one who does not have faith … wisdom incultivatingwholesome qualities, whether night or day comes, only deterioration and not growth in wholesome qualities is to be expected.",
    "an10.67:5": "(1) \"‘A person without faith,’ friends: this is a case of decline. (2) ‘A morally shameless person’ … (3) ‘A morally reckless person’ … (4) ‘A lazy person’ … () ‘An unwise person’ … (6) ‘An angry person’ … (7) ‘A hostile person’ … (8) ‘A person of evil desires’ … (9) ‘A person with bad friends’ … (10) ‘A person who holds wrong view’: this is a case of decline.",
    "an10.67:6": "\"Friends, for one who has faith incultivatingwholesome qualities, for one who has a sense of moral shame … for one who has moral dread … for one who has energy …for one who has wisdom incultivatingwholesome qualities, whether night or day comes, only growth and not deterioration in wholesome qualities is to be expected. Just as, during the bright fortnight, whether night or day comes, the moon only increases in beauty, roundness, and brightness, in diameter and circumference, so too, for one who has faith … wisdom incultivatingwholesome qualities, whether night or day comes, only growth and not deterioration in wholesome qualities is to be expected.",
    "an10.67:7": "(1) \"‘A person with faith,’ friends: this is a case of non-decline. (2) ‘A person with a sense of moral shame’ … (3) ‘A person with moral dread’ … (4) ‘An energetic person’ … (5) ‘A wise person’ … (6) ‘A person without anger’ … () ‘A person without hostility’ … (8) ‘A person without evil desires’ … (9) ‘A person with good friends’ … (10) ‘A person who holds right view’: this is a case of non-decline.\"",
    "an10.67:8": "Then the Blessed One got up and addressed the Venerable Sāriputta: \"Good, good, Sāriputta! Sāriputta, for one who does not have faith incultivatingwholesome qualities …the Buddha here repeats Sāriputta's entire discourse:… (10) ‘A person who holds right view’: this is a case of non-decline.\""
}