{
    "an10.73:1": "\"Bhikkhus, there are these ten things that are wished for, desired, agreeable, and rarely gained in the world. What ten? () Wealth is wished for, desired, agreeable, and rarely gained in the world. (2) Beauty … (3) Health … (4) Virtuous behavior … (5) Celibacy … (6) Friends … (7) Learning … (8) Wisdom … (9) Good qualities … (0) The heavens are wished for, desired, agreeable, and rarely gained in the world.These are the ten things that are wished for, desired, agreeable, and rarely gained in the world.",
    "an10.73:2": "\"There are tenotherthings, bhikkhus, that are obstructions to these ten things that are wished for, desired, agreeable, and rarely gained in the world. (1) Indolence and lack of initiative are obstructions tothe acquisition ofwealth. () Not adorning and beautifying oneself are obstructions to beauty. (3) Doing what is unbeneficial is an obstruction to health. (4) Bad friendship is an obstruction to virtuous behavior. (5) Non-restraint of the sense faculties is an obstruction to celibacy. (6) Duplicity is an obstruction to friendships. (7) Non-recitation is an obstruction to learning. (8) Unwillingness to listen and not asking questions are obstructions to wisdom. (9) Not applying oneself and lack of reflection are obstructions to good qualities. (10) Wrong practice is an obstruction to the heavens. These are the tenotherthings that are obstructions to those ten things that are wished for, desired, agreeable, and rarely gained in the world.",
    "an10.73:3": "\"There are tenotherthings, bhikkhus, that are nutriments for these ten things that are wished for, desired, agreeable, and rarely gained in the world. (1) Diligence and initiative are nutriments forthe acquisition ofwealth. (2) Adorning and beautifying oneself are nutriments for beauty. () Doing what is beneficial is a nutriment for health. (4) Good friendship is a nutriment for virtuous behavior. (5) Restraint of the sense faculties is a nutriment for celibacy. (6) Sincerity is a nutriment for friendships. (7) Recitation is a nutriment for learning. (8) Willingness to listen and asking questions are nutriments for wisdom. (9) Applying oneself and reflection are nutriments for good qualities. (10) Right practice is a nutriment for the heavens. These are the tenotherthings that are nutriments for those ten things that are wished for, desired, agreeable, and rarely gained in the world.\""
}