{
    "an10.105:1": "\"Bhikkhus, ignorance—accompanied by moral shamelessness and moral recklessness—is the forerunner in entering upon unwholesome qualities.[n.243] The same sutta, but only as far asmicchāsamādhiandsammāsamādhi, isSN 45:, V –2.Mpdoes not offer any substantial comment here, butSpkIII 6,5–6, commenting on the same sentence in SN 45:, explains that ignorance is a forerunner(pubbaṅgama)in two ways, as co-arisen condition(sahajāta, a condition for simultaneously arisen phenomena) and as decisive-support condition(upanissaya, a strong condition for subsequently arisen phenomena). Spk-pṭ II 03 (VRI ed.) adds that ignorance is a co-arisen forerunner when it makes simultaneous states conform to its own confusion about the object, so that they grasp impermanent phenomena as permanent, etc. It is both a co-arisen and decisive-support forerunner when a person overcome by delusion, not seeing the danger, takes life, steals, commits sexual misconduct, speaks falsely, and engages in other immoral actions.() For a foolish person immersed in ignorance, wrong view originates. (2) For one of wrong view, wrong intention originates. (3) For one of wrong intention, wrong speech originates. (4) For one of wrong speech, wrong action originates. (5) For one of wrong action, wrong livelihood originates. (6) For one of wrong livelihood, wrong effort originates. (7) For one of wrong effort, wrong mindfulness originates. (8) For one of wrong mindfulness, wrong concentration originates. (9) For one of wrong concentration, wrong knowledge originates. (0) For one of wrong knowledge, wrong liberation originates.",
    "an10.105:2": "\"Bhikkhus, true knowledge—accompanied by a sense of moral shame and moral dread—is the forerunner in entering upon wholesome qualities. (1) For a wise person who has arrived at true knowledge, right view originates. () For one of right view, right intention originates. (3) For one of right intention, right speech originates. (4) For one of right speech, right action originates. (5) For one of right action, right livelihood originates. (6) For one of right livelihood, right effort originates. (7) For one of right effort, right mindfulness originates. (8) For one of right mindfulness, right concentration originates. (9) For one of right concentration, right knowledge originates. (10) For one of right knowledge, right liberation originates.\"[n.144] AtSpkIII 117,7–31it is said that these do not occur all together in the mundane path but occur together in the world-transcending path. Even in the development of the mundane path it would be a mistake to suppose the eight factors follow in sequence. Right view is the guide for the other path factors and the direct condition for right intention. Right view and right intention jointly condition right speech, right action, and right livelihood. These in turn are the basis for right effort and right mindfulness. Right concentration results from the interplay of right effort and right mindfulness. Right knowledge(sammā ñāṇa)is the wisdom of the path of arahantship, and right liberation(sammā vimutti)is the liberation from theāsavasthat occurs through right knowledge. Its culmination is the arahant'sanāsava cetovimutti paññāvimutti(\"taintless liberation of mind, liberation by wisdom\")."
}