{
    "an10.76:1": "\"Bhikkhus, if these three things[n.2095] I translate on the basis ofCeand Be, which readtayo me. Ee consistently reads onlytayo, withoutme.were not found in the world, the Tathāgata, the Arahant, the Perfectly Enlightened One would not arise in the world, and the Dhamma and discipline proclaimed by him would not shine in the world. What three? Birth, old age, and death. If these three things were not found in the world, the Tathāgata, the Arahant, the Perfectly Enlightened One would not arise in the world, and the Dhamma and discipline proclaimed by him would not shine in the world. But because these three things are found in the world, the Tathāgata, the Arahant, the Perfectly Enlightened One arises in the world, and the Dhamma and discipline proclaimed by him shines in the world.",
    "an10.76:2": "(1) \"Without having abandoned these three things, one is incapable of abandoning birth, old age, and death. What three? Lust, hatred, and delusion. Without having abandoned these three things, one is incapable of abandoning birth, old age, and death.",
    "an10.76:3": "(2) \"Without having abandoned these three things, one is incapable of abandoning lust, hatred, and delusion. What three? Personal-existence view, doubt, and wrong grasp of behavior and observances. Without having abandoned these three things, one is incapable of abandoning lust, hatred, and delusion.",
    "an10.76:4": "(3) \"Without having abandoned these three things, one is incapable of abandoning personal-existence view, doubt, and wrong grasp of behavior and observances. What three? Careless attention, following a wrong path, and mental sluggishness. Without having abandoned these three things, one is incapable of abandoning personal-existence view, doubt, and wrong grasp of behavior and observances.",
    "an10.76:5": "(4) \"Without having abandoned these three things, one is incapable of abandoning careless attention, following a wrong path, and mental sluggishness. What three? Muddle-mindedness, lack of clear comprehension, and mental distraction. Without having abandoned these three things, one is incapable of abandoning careless attention, following a wrong path, and mental sluggishness.",
    "an10.76:6": "(5) \"Without having abandoned these three things, one is incapable of abandoning muddle-mindedness, lack of clear comprehension, and mental distraction. What three? Lack of desire to see the noble ones, lack of desire to hear the noble Dhamma, and a mind bent on criticism. Without having abandoned these three things, one is incapable of abandoning muddle-mindedness, lack of clear comprehension, and mental distraction.",
    "an10.76:7": "(6) \"Without having abandoned these three things, one is incapable of abandoning lack of desire to see the noble ones, lack of desire to hear the noble Dhamma, and a mind bent on criticism. What three? Restlessness, non-restraint, and immorality. Without having abandoned these three things, one is incapable of abandoning lack of desire to see the noble ones, lack of desire to hear the noble Dhamma, and a mind bent on criticism.",
    "an10.76:8": "(7) \"Without having abandoned these three things, one is incapable of abandoning restlessness, non-restraint, and immorality. What three? Lack of faith, uncharitableness, and laziness. Without having abandoned these three things, one is incapable of abandoning restlessness, non-restraint, and immorality.",
    "an10.76:9": "(8) \"Without having abandoned these three things, one is incapable of abandoning lack of faith, uncharitableness, and laziness. What three? Disrespect, being difficult to correct, and bad friendship. Without having abandoned these three things, one is incapable of abandoning lack of faith, uncharitableness, and laziness.",
    "an10.76:10": "(9) \"Without having abandoned these three things, one is incapable of abandoning disrespect, being difficult to correct, and bad friendship. What three? Moral shamelessness, moral recklessness, and heedlessness. Without having abandoned these three things, one is incapable of abandoning disrespect, being difficult to correct, and bad friendship.",
    "an10.76:11": "(10) \"Bhikkhus, one who is morally shameless and morally reckless is heedless. One who is heedless is incapable of abandoning disrespect, being difficult to correct, and bad friendship. One who has bad friends is incapable of abandoning lack of faith, uncharitableness, and laziness. One who is lazy is incapable of abandoning restlessness, non-restraint, and immorality. One who is immoral is incapable of abandoning lack of desire to see the noble ones, lack of desire to hear the noble Dhamma, and a mind bent on criticism. One who has a mind bent on criticism is incapable of abandoning muddle-mindedness, lack of clear comprehension, and mental distraction. One who ismentally distracted is incapable of abandoning careless attention, following a wrong path, and mental sluggishness. One who is mentally sluggish is incapable of abandoning personal-existence view, doubt, and wrong grasp of behavior and observances. One who has doubt is incapable of abandoning lust, hatred, and delusion. Without having abandoned lust, hatred, and delusion, one is incapable of abandoning birth, old age, and death.",
    "an10.76:12": "(1) \"Bhikkhus, having abandoned these three things, one is capable of abandoning birth, old age, and death. What three? Lust, hatred, and delusion. Having abandoned these three things, one is capable of abandoning birth, old age, and death.",
    "an10.76:13": "(2) \"Having abandoned these three things, one is capable of abandoning lust, hatred, and delusion. What three? Personal-existence view, doubt, and wrong grasp of behavior and observances. Having abandoned these three things, one is capable of abandoning lust, hatred, and delusion.",
    "an10.76:14": "(3) \"Having abandoned these three things, one is capable of abandoning personal-existence view, doubt, and wrong grasp of behavior and observances. What three? Careless attention, following a wrong path, and mental sluggishness. Having abandoned these three things, one is capable of abandoning personal-existence view, doubt, and wrong grasp of behavior and observances.",
    "an10.76:15": "(4) \"Having abandoned these three things, one is capable of abandoning careless attention, following a wrong path, and mental sluggishness. What three? Muddle-mindedness, lack of clear comprehension, and mental distraction. Having abandoned these three things, one is capable of abandoning careless attention, following a wrong path, and mental sluggishness.",
    "an10.76:16": "(5) \"Having abandoned these three things, one is capable of abandoning muddle-mindedness, lack of clear comprehension, and mental distraction. What three? Lack of desire to see the noble ones, lack of desire to hear the noble Dhamma, and a mind bent on criticism. Having abandoned these three things, one is capable of abandoning muddle-mindedness, lack of clear comprehension, and mental distraction.",
    "an10.76:17": "(6) \"Having abandoned these three things, one is capable of abandoning lack of desire to see the noble ones, lack of desire to hear the noble Dhamma, and a mind bent on criticism. What three? Restlessness, non-restraint, and immorality. Having abandoned these three things, one is capable of abandoning lack of desire to see the noble ones, lack of desire to hear the noble Dhamma, and a mind bent on criticism.",
    "an10.76:18": "(7) \"Having abandoned these three things, one is capable of abandoning restlessness, non-restraint, and immorality. What three? Lack of faith, uncharitableness, and laziness. Having abandoned these three things, one is capable of abandoning restlessness, non-restraint, and immorality.",
    "an10.76:19": "(8) \"Having abandoned these three things, one is capable of abandoning lack of faith, uncharitableness, and laziness. What three? Disrespect, being difficult to correct, and bad friendship. Having abandoned these three things, one is capable of abandoning lack of faith, uncharitableness, and laziness.",
    "an10.76:20": "(9) \"Having abandoned these three things, one is capable of abandoning disrespect, being difficult to correct, and bad friendship. What three? Moral shamelessness, moral recklessness, and heedlessness. Having abandoned these three things, one is capable of abandoning disrespect, being difficult to correct, and bad friendship.",
    "an10.76:21": "(10) \"Bhikkhus, one who has a sense of moral shame and moral dread is heedful. One who is heedful is capable of abandoning disrespect, being difficult to speak to, and bad friendship. One who has good friendsis capable of abandoning lack of faith, uncharitableness, and laziness. One who is energetic is capable of abandoning restlessness, non-restraint, and immorality. One who is virtuous is capable of abandoning lack of desire to see the noble ones, lack of desire to hear the noble Dhamma, and a mind bent on criticism. One whose mind is not bent on criticism is capable of abandoning muddle-mindedness, lack of clear comprehension, and mental distraction. One who has an undistracted mind is capable of abandoning careless attention, following a wrong path, and mental sluggishness. One who has an unsluggish mind is capable of abandoning personal-existence view, doubt, and wrong grasp of behavior and observances. One without doubt is capable of abandoning lust, hatred, and delusion. Having abandoned lust, hatred, and delusion, one is capable of abandoning birth, old age, and death.\""
}