{
    "an10.176:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Pāvā in the mango grove of Cunda, the smith's son.[n.265] It was this Cunda that offered the Buddha his final meal. SeeDN  6.59, II 27.Then Cunda, the smith's son, approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "an10.176:2": "\"And how, Cunda, do the brahmins of the west prescribe their rites of purity?\"",
    "an10.176:3": "\"Cunda, purification in the Noble One's discipline is quite different from the rites of purity prescribed by the brahmins of the west who carry around waterpots, wear garlands of water plants, tend the sacred fire, and immerse themselves in water.\"",
    "an10.176:4": "\"Well then, Cunda, listen and attend closely. I will speak.\"",
    "an10.176:5": "\"Impurity by body, Cunda, is threefold. Impurity by speech is fourfold. Impurity by mind is threefold.",
    "an10.176:6": "\"And how, Cunda, is impurity by body threefold?",
    "an10.176:7": "(2) \"He takes what is not given. He steals the wealth and property of others in the village or forest.",
    "an10.176:8": "(3) \"He engages in sexual misconduct. He has sexual relations with women who are protected by their mother, father, mother and father, brother, sister, or relatives; who are protected by their Dhamma; who have a husband; whose violation entails a penalty; or even with one already engaged.[n.2167] The last four refer respectively to: (1) a woman protected by her co-religionists, (2) one already married or even promised to a husband at birth or in childhood, (3) one with whom sexual relations entail punishment, and (4) a girl who has been garlanded by a man as a sign of engagement.",
    "an10.176:9": "\"It is in this way that impurity by body is threefold.",
    "an10.176:10": "\"And how, Cunda, is impurity by speech fourfold?",
    "an10.176:11": "(5) \"He speaks divisively. Having heard something here, he repeats it elsewhere in order to dividethose peoplefrom these; or having heard something elsewhere, he repeats it to these people in order to dividethemfrom those. Thus he is one who divides those who are united, a creator of divisions, one who enjoys factions, rejoices in factions, delights in factions, a speaker of words that create factions.",
    "an10.176:12": "(6) \"He speaks harshly. He utters such words as are rough, hard, hurtful to others, offensive to others, bordering on anger, unconducive to concentration.",
    "an10.176:13": "(7) \"He indulges in idle chatter. He speaks at an improper time, speaks falsely, speaks what is unbeneficial, speaks contrary to the Dhamma and the discipline; at an improper time he speaks such words as are worthless, unreasonable, rambling, and unbeneficial.",
    "an10.176:14": "\"And how, Cunda, is impurity by mind threefold?",
    "an10.176:15": "(9) \"He has a mind of ill will and intentions of hate thus: ‘May these beings be slain, slaughtered,[n.2168] All three editions here readbajjhantu, \"let them be bound.\"Mpprovides no gloss but at MN I 287,11we findvajjhantu, glossed by Ps II 332,16asvadhaṁ pāpuṇantu, \"let them be slaughtered,\" and by Ps-pṭ II 230 (VRI ed.) asmaraṇaṁ pāpuṇantu, \"let them die.\" I thus takevajjhantuto be the correct reading.cut off, destroyed, or annihilated!’",
    "an10.176:16": "(10) \"He holds wrong view and has an incorrect perspective thus: ‘There is nothing given, nothing sacrificed, nothing offered; there is no fruit or result of good and bad actions; there is no this world, no other world; there is no mother, no father; there are no beings spontaneously reborn; there are in the world no ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’",
    "an10.176:17": "\"These, Cunda, are the ten courses of unwholesome kamma. If one engages in these ten courses of unwholesome kamma, then, if one gets up early and strokes the ground from one's bed, one is impure, and if one doesn’t stroke the ground, one is impure.",
    "an10.176:18": "If one strokes wet cow dung, one is impure, and if one doesn’t stroke wet cow dung, one is impure.",
    "an10.176:19": "If one strokes green grass, one is impure, and if one doesn’t stroke green grass, one is impure.",
    "an10.176:20": "If one tends the sacred fire, one is impure, and if one doesn’t tend the sacred fire, one is impure.",
    "an10.176:21": "If one pays homage to the sun with reverential salutation, one is impure, and if one doesn’t pay homage to the sun with reverential salutation, one is impure.",
    "an10.176:22": "If one immerses oneself in water three times including the evening, one is impure, and if one doesn’t immerse oneself in water three times including the evening, one is impure.",
    "an10.176:23": "It is because people engage in these ten courses of unwholesome kamma that hell, the animal realm, the sphere of afflicted spirits, and other bad destinations are seen.",
    "an10.176:24": "\"Purity by body, Cunda, is threefold. Purity by speech is fourfold. Purity by mind is threefold.",
    "an10.176:28": "\"It is in this way that purity by body is threefold.",
    "an10.176:29": "\"And how, Cunda, is purity by speech fourfold?",
    "an10.176:30": "(5) \"Having abandoned divisive speech, he abstains from divisive speech. Having heard something here, he does not repeat it elsewhere in order to dividethose peoplefrom these; or having heard something elsewhere, he does not repeat it to these people in order to dividethemfrom those. Thus he is one who reunites those who are divided, a promoter of unity, who enjoys concord, rejoices in concord, delights in concord, a speaker of words that promote concord.",
    "an10.176:31": "(6) \"Having abandoned harsh speech, he abstains from harsh speech. He speaks such words as are gentle, pleasing to the ear, and lovable, as go to the heart, are courteous, desired by many, and agreeable to many.",
    "an10.176:32": "(7) \"Having abandoned idle chatter, he abstains from idle chatter. He speaks at a proper time, speaks truth, speaks what is beneficial, speaks on the Dhamma and the discipline; at a proper time he speaks such words as are worth recording, reasonable, succinct, and beneficial.",
    "an10.176:33": "\"It is in this way that purity by speech is fourfold.",
    "an10.176:34": "\"And how, Cunda, is purity by mind threefold?",
    "an10.176:35": "(9) \"He is of good will and his intentions are free of hate thus: ‘May these beings live happily, free from enmity, affliction, and anxiety!’",
    "an10.176:36": "(10) \"He holds right viewand has a correct perspective thus: ‘There is what is given, sacrificed, and offered; there is fruit and result of good and bad actions; there is this world and the other world; there is mother and father; there are beings spontaneously reborn; there are in the world ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’",
    "an10.176:37": "\"It is in this way that purity by mind is threefold.\"",
    "an10.176:38": "\"These, Cunda, are the ten courses of wholesome kamma. If one engages in these ten courses of wholesome kamma, then, if one gets up early and strokes the ground from one's bed, one is pure, and if one doesn’t stroke the ground, one is pure.",
    "an10.176:39": "If one strokes wet cow dung, one is pure, and if one doesn’t stroke wet cow dung, one is pure.",
    "an10.176:40": "If one strokes green grass, one is pure, and if one doesn’t stroke green grass, one is pure.",
    "an10.176:41": "If one tends the sacred fire, one is pure, and if one doesn’t tend the sacred fire, one is pure.",
    "an10.176:42": "If one pays homage to the sun with reverential salutation, one is pure, and if one doesn’t pay homage to the sun with reverential salutation, one is pure.",
    "an10.176:43": "If one immerses oneself in water three times including the evening, one is pure, and if one doesn’t immerse oneself in water three times including the evening, one is pure.",
    "an10.176:44": "It is because people engage in these ten courses of wholesome kamma that the devas, human beings, and other good destinations are seen.\"",
    "an10.176:45": "When this was said, Cunda, the smith's son, said to the Blessed One: \"Excellent, Bhante! … Let the Blessed One accept me as a lay follower who from today has gone for refuge for life.\""
}