{
    "an10.99:1": "Then the Venerable Upāli approached the Blessed One, paid homage to him, sat down to one side,and said: \"Bhante, I wish to resort to remote lodgings in forests and jungle groves.\"",
    "an10.99:2": "\"Remote lodgings in forests and jungle groves are hard to endure, Upāli. Solitude is hard to undertake and hard to delight in. When he is alone, the woods steal the mind of a bhikkhu who does not gain concentration. It can be expected that one who says ‘I do not gain concentration, yet I will resort to remote lodgings in forests and jungle groves’ will either sink or float away.[n.133]Mp:\"He willsink(saṁsīdissati)because of sensual thoughts, orfloat away(uplavissati)because of thoughts of ill will and harming.\"",
    "an10.99:3": "\"Suppose, Upāli, there was a large lake, and a bull elephant seven or eight cubits in size would come along. He might think: ‘Let me enter this lake and playfully wash my ears and back. I will bathe and drink, come out, and set off wherever I want.’ He then enters the lake and playfully washes his ears and back. He bathes and drinks, comes out, and sets off wherever he wants. How so? Because his large body finds a footing in the depths.",
    "an10.99:4": "\"Then a hare or a cat comes along. It might think: ‘How is a bull elephant different from myself? I’ll enter this lake and playfully wash my ears and back.I will bathe and drink, come out, and set off wherever I want.’ Then, without reflecting, it hastily enters the deep lake. It can be expected that it will either sink or float away. Why so? Because its small body does not find a footing in the depths. So too, it can be expected that one who would say: ‘I do not gain concentration, yet I will resort to remote lodgings in forests and jungle groves,’ will either sink or float away.",
    "an10.99:5": "\"Suppose, Upāli, a young infant boy, lying on his back, would play with his own urine and feces. What do you think, isn’t that a completely foolish type of amusement?\"",
    "an10.99:6": "\"Sometime later, when that boy grows up and his faculties mature, he would play the games that are typical for boys—games with toy plows, stick games, somersaults, games with pinwheels, games with measures made of leaves, games with toy chariots, games with toy bows. What do you think, isn’t this amusement more excellent and sublime than the former kind?\"",
    "an10.99:7": "\"At a still later time, as that boy continues to grow up and his faculties mature still more, he enjoys himself furnished and endowed with the five objects of sensual pleasure: with forms cognizable by the eye that are wished for, desired, agreeable, pleasing, connected with sensual pleasure, tantalizing; with sounds cognizable by the ear … with odours cognizable by the nose … with tastes cognizable by the tongue … with tactile objects cognizable by the bodythat are wished for, desired, agreeable, pleasing, connected with sensual pleasure, tantalizing. What do you think, isn’t this amusement more excellent and sublime than the former kind?\"",
    "an10.99:8": "\"Here, Upāli, the Tathāgata arises in the world,[n.2134] Much of the following comes from the standard sequence on the progressive training, already atAN4.19.an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One. Having realized with his own direct knowledge this world with its devas, Māra, and Brahmā, this population with its ascetics and brahmins, with its devas and humans, he makes it known to others. He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; he reveals the perfectly complete and pure spiritual life.",
    "an10.99:9": "\"A householder or householder's son or one born in some other clan hears this Dhamma. He then acquires faith in the Tathāgata and considers thus: ‘Household life is crowded and dusty; life gone forth is wide open. It is not easy, while living at home, to lead the spiritual life that is utterly perfect and pure as a polished conch shell. Suppose I shave off my hair and beard, put on ochre robes, and go forth from the household life into homelessness.’",
    "an10.99:10": "On a later occasion, having abandoned a small or a large fortune, having abandoned a small or a large circle of relatives, he shaves off his hair and beard, puts on ochre robes, and goes forth from the household life into homelessness.",
    "an10.99:11": "\"Having thus gone forth and possessing the bhikkhus’ training and way of life, having abandoned the destruction of life, he abstains from the destruction of life; with the rod and weapon laid aside, conscientious and kindly, he dwells compassionate toward all living beings.",
    "an10.99:12": "Having abandoned taking what is not given, he abstains from taking what is not given; he takes only what is given, expects only what is given, and dwells honestly without thoughts of theft.",
    "an10.99:13": "Having abandoned sexual activity, he observes celibacy,living apart, abstaining from sexual intercourse, the common person's practice.",
    "an10.99:14": "\"Having abandoned false speech, he abstains from false speech; he speaks truth, adheres to truth; he is trustworthy and reliable, no deceiver of the world.",
    "an10.99:15": "Having abandoned divisive speech, he abstains from divisive speech; he does not repeat elsewhere what he has heard here in order to dividethose peoplefrom these, nor does he repeat to these what he has heard elsewhere in order to dividethese peoplefrom those; thus he is one who reunites those who are divided, a promoter of unity, who enjoys concord, rejoices in concord, delights in concord, a speaker of words that promote concord.",
    "an10.99:16": "Having abandoned harsh speech, he abstains from harsh speech; he speaks words that are gentle, pleasing to the ear, lovable, words that go to the heart, courteous words that are desired by many people and agreeable to many people.",
    "an10.99:17": "Having abandoned idle chatter, he abstains from idle chatter; he speaks at a proper time, speaks what is fact, speaks on what is beneficial, speaks on the Dhamma and the discipline; at the proper time he speaks words that are worth recording, reasonable, succinct, and beneficial.",
    "an10.99:18": "\"He abstains from injuring seeds and plants. He eats once a day, abstaining from eating at night and outside the proper time. He abstains from dancing, singing, instrumental music, and unsuitable shows. He abstains from adorning and beautifying himself by wearing garlands and applying scents and unguents. He abstains from high and large beds. He abstains from accepting gold and silver, raw grain, raw meat, women and girls, men and women slaves, goats and sheep, fowl and pigs, elephants, cattle, horses, and mares, fields and land. He abstains from going on errands and running messages; from buying and selling; from cheating with weights, metals, and measures;from accepting bribes, deceiving, defrauding, and trickery. He abstains from wounding, murdering, binding, brigandage, plunder, and violence.",
    "an10.99:19": "\"He is content with robes to protect his body and almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Just as a bird, wherever it goes, flies with its wings as its only burden, so too, a bhikkhu is content with robes to protect his body and almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Possessing this aggregate of noble virtuous behavior, he experiences blameless bliss within himself.",
    "an10.99:20": "\"Having seen a form with the eye, he does not grasp at its marks and features. Since, if he left the eye faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the eye faculty, he undertakes the restraint of the eye faculty. Having heard a sound with the ear … Having smelled an odour with the nose … Having tasted a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, he does not grasp at its marks and features. Since, if he left the mind faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the mind faculty, he undertakes the restraint of the mind faculty. Possessing this noble restraint of the faculties, he experiences unsullied bliss within himself.",
    "an10.99:21": "\"He acts with clear comprehension when going forward and returning; he acts with clear comprehension when looking ahead and looking away; he acts with clear comprehension when bending and stretching his limbs; he acts with clear comprehension when wearing his robes and carrying his outer robe and bowl; he acts with clear comprehension when eating, drinking, consuming food, and tasting; he acts with clear comprehension when defecating and urinating; he acts with clear comprehension when walking, standing, sitting, falling asleep, waking up, talking, and keeping silent.",
    "an10.99:22": "\"Possessing this aggregate of noble virtuous behavior, and thisnoble restraint of the faculties, and this noble mindfulness and clear comprehension, he resorts to a secluded lodging: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw.",
    "an10.99:23": "\"Having gone to the forest, to the foot of a tree, or to an empty hut, he sits down, folding his legs crosswise, straightening his body, and establishing mindfulness in front of him. Having abandoned longing for the world, he dwells with a mind free from longing; he purifies his mind from longing. Having abandoned ill will and hatred, he dwells with a mind free from ill will, compassionate for the welfare of all living beings; he purifies his mind from ill will and hatred. Having abandoned dullness and drowsiness, he dwells free from dullness and drowsiness, percipient of light, mindful and clearly comprehending; he purifies his mind from dullness and drowsiness. Having abandoned restlessness and remorse, he dwells without agitation, with a mind inwardly peaceful; he purifies his mind from restlessness and remorse. Having abandoned doubt, he dwells having gone beyond doubt, unperplexed about wholesome qualities; he purifies his mind from doubt.",
    "an10.99:24": "(1) \"Having thus abandoned these five hindrances, defilements of the mind, qualities that weaken wisdom, secluded from sensual pleasures, secluded from unwholesome states, he enters upon and dwells in the first jhāna, which consists of rapture and pleasure born of seclusion, accompanied by thought and examination. What do you think, isn’t this dwelling more excellent and sublime than those that precede it?\"",
    "an10.99:25": "\"It is when they see this quality within themselves that my disciples resort to remote lodgings in forests and jungle groves. But they still haven’t attained their own goal.[n.2135]No ca kho tāva anuppattasadatthā viharanti. The stock formula for the arahant, atAN3.37andAN6.49, describes the arahant as one who has \"reached his own goal\"(anuppattasadattho). ThusMpII 235,14–15, andMpIII 380,17–18, commenting on the formula, identifysadatthawith arahantship.",
    "an10.99:26": "(2) \"Again, Upāli, with the subsiding of thought and examination, the bhikkhu enters and dwells in the second jhāna …. What do you think, isn’t this dwelling more excellent and sublime than those that precede it?\"",
    "an10.99:27": "\"It is when they see this quality, too, within themselvesthat my disciples resort to remote lodgings in forests and jungle groves. But they still haven’t attained their own goal.",
    "an10.99:28": "(3) \"Again, Upāli, with the fading away as well of rapture … he enters and dwells in the third jhāna …. What do you think, isn’t this dwelling more excellent and sublime than those that precede it?\"",
    "an10.99:29": "\"It is when they see this quality, too, within themselves that my disciples resort to remote lodgings in forests and jungle groves. But they still haven’t attained their own goal.",
    "an10.99:30": "(4) \"Again, Upāli, with the abandoning of pleasure and pain … he enters and dwells in the fourth jhāna …. What do you think, isn’t this dwelling more excellent and sublime than those that precede it?\"",
    "an10.99:31": "(5) \"Again, Upāli, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving‘space is infinite,’ the bhikkhu enters and dwells in the base of the infinity of space. What do you think, isn’t this dwelling more excellent and sublime than those that precede it?\"",
    "an10.99:32": "\"It is when they see this quality, too, within themselves that my disciples resort to remote lodgings in forests and jungle groves. But they still haven’t attained their own goal.",
    "an10.99:33": "(6) \"Again, Upāli, by completely surmounting the base of the infinity of space,perceiving‘consciousness is infinite,’ he enters and dwells in the base of the infinity of consciousness. What do you think, isn’t this dwelling more excellent and sublime than those that precede it?\"",
    "an10.99:34": "(7) \"Again, Upāli, by completely surmounting the base of the infinity of consciousness,perceiving‘there is nothing,’ he enters and dwells in the base of nothingness. What do you think, Upāli, isn’t this dwelling more excellent and sublime than those that precede it?\"",
    "an10.99:35": "(8) \"Again, Upāli, by completely surmounting the base of nothingness,perceiving‘this is peaceful, this is sublime,’he enters and dwells in the base of neither-perception-nor-nonperception. What do you think, isn’t this dwelling more excellent and sublime than those that precede it?\"",
    "an10.99:36": "\"It is when they see this quality, too, within themselves that my disciples resort to remote lodgings in forests and jungle groves. But they still haven’t attained their own goal.",
    "an10.99:37": "(9) \"Again, Upāli, by completely surmounting the base of neither-perception-nor-non-perception, he enters and dwells in the cessation of perception and feeling. (10) And having seen with wisdom, his taints are utterly destroyed. What do you think, isn’t this dwelling more excellent and sublime than those that precede it?\"",
    "an10.99:38": "\"It is when they see this quality, too, within themselves that my disciples resort to remote lodgings in forests and jungle groves. And they dwell having attained their own goal.[n.2136] I read withBeanuppattasadatthā ca viharanti, which seems necessary. Ce and Ee have, as in the earlier passages,no ca kho tāva anuppattasadatthā viharanti, \"but they still have not attained their own goal.\" Since only nine meditative attainments are mentioned, it is unclear what justifies the inclusion of this sutta in the Tens. To obtain ten stages, I have divided the last stage into two parts, but I am unsure this was the original intention."
}