{
    "an10.106:1": "\"Bhikkhus, there are these ten cases of wearing away.[n.245]Nijjarā. The \"wearing away\" of old kamma through austerities was a fundamental Jain concept. The Buddha borrows the word but gives it a new meaning. See tooAN3.74for three kinds of \"wearing away\" taught by the Buddha.What ten?",
    "an10.106:2": "() \"For one of right intention, wrong intention is worn away, and the numerous bad unwholesome qualities that originate with wrong intention as condition are also worn away, and with right intention as condition, numerous wholesome qualities reach fulfillment by development.",
    "an10.106:3": "() \"For one of right speech, wrong speech is worn away, and the numerous bad unwholesome qualities that originate with wrong speech as condition are also worn away, and with right speech as condition, numerous wholesome qualities reach fulfillment by development.",
    "an10.106:4": "() \"For one of right action, wrong action is worn away, and the numerous bad unwholesome qualities that originate with wrong action as condition are also worn away, and with right action as condition, numerous wholesome qualities reach fulfillment by development.",
    "an10.106:5": "() \"For one of right livelihood, wrong livelihood is worn away, and the numerous bad unwholesome qualities that originate with wrong livelihood as condition are also worn away, and with right livelihood as condition, numerous wholesome qualities reach fulfillment by development.",
    "an10.106:6": "() \"For one of right effort, wrong effort is worn away, and the numerous bad unwholesome qualities that originate with wrong effort as condition are also worn away, and with right effort as condition, numerous wholesome qualities reach fulfillment by development.",
    "an10.106:7": "() \"For one of right mindfulness, wrong mindfulness is worn away, and the numerous bad unwholesome qualities that originate with wrong mindfulness as condition are also worn away, and with right mindfulness as condition, numerous wholesome qualities reach fulfillment by development.",
    "an10.106:8": "() \"For one of right concentration, wrong concentration is worn away, and the numerous bad unwholesome qualities that originate with wrong concentration as condition are also worn away, and with right concentration as condition, numerouswholesome qualities reach fulfillment by development.",
    "an10.106:9": "() \"For one of right knowledge, wrong knowledge is worn away, and the numerous bad unwholesome qualities that originate with wrong knowledge as condition are also worn away, and with right knowledge as condition, numerous wholesome qualities reach fulfillment by development.",
    "an10.106:10": "() \"For one of right liberation, wrong liberation is worn away, and the numerous bad unwholesome qualities that originate with wrong liberation as condition are also worn away, and with right liberation as condition, numerous wholesome qualities reach fulfillment by development.",
    "an10.106:11": "\"These are the ten cases of wearing away.\""
}