{
    "an10.83:1": "Then the Venerable Puṇṇiya approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an10.83:2": "(1) \"When, Puṇṇiya, a bhikkhu is endowed with faith but does not approach him, the Tathāgata is not disposed to teach the Dhamma. () But when a bhikkhu is endowed with faith and approaches him, the Tathāgata is disposed to teach.",
    "an10.83:3": "() \"When, Puṇṇiya, a bhikkhu is endowed with faith and approaches him, but he does not attend on him … (4) When he attends on him but does not ask questions … (5) When he asks questions but does not listen to the Dhamma with eager ears … (6) When he listens to the Dhamma with eager ears, but having heard it, does not retain it in mind … (7) When, having heard it, he retains it in mind but does not examine the meaning of the teachings that have been retained in mind … (8) When he examines the meaning of the teachings that have been retained in mind but does notunderstand the meaning and the Dhamma and then practice in accordance with the Dhamma … (9) When he understands the meaning and the Dhamma and then practices in accordance with the Dhamma, but he is not a good speaker with a good delivery, one gifted with speech that is polished, clear, articulate, expressive of the meaning … (10) When he is a good speaker with a good delivery, one gifted with speech that is polished, clear, articulate, expressive of the meaning, but he does not instruct, encourage, inspire, and gladden his fellow monks, the Tathāgata is not disposed to teach the Dhamma.",
    "an10.83:4": "\"But, Puṇṇiya, (1) when a bhikkhu is endowed with faith, (2) approachesthe Tathāgata, (3) attends onthe Tathāgata, () asks questions, and (5) listens to the Dhamma with eager ears; and (6) having heard the Dhamma, he retains it in mind, (7) examines the meaning of the teachings he has retained in mind, and (8) understands the meaning and the Dhamma and then practices in accordance with the Dhamma; and (9) he is a good speaker with a good delivery, one gifted with speech that is polished, clear, articulate, expressive of the meaning; and (10) he instructs, encourages, inspires, and gladdens his fellow monks, the Tathāgata is disposed to teach the Dhamma. When, Puṇṇiya, one possesses these ten qualities, the Tathāgata is entirely disposed to teach the Dhamma.\""
}