{
    "an10.59:1": "\"Therefore, bhikkhus, you should train yourselves thus: ‘Our minds will be strengthened in accordance withthe spirit ofour going forth, and arisen bad unwholesome qualities will not obsess our minds.[n.2070]Na c’uppannā pāpakā akusalā dhammā cittaṁ pariyādāya ṭhassanti. As phrased, the text seems to be saying that such bad unwholesome qualities do arise but do not gain control over the bhikkhu's mind. However, it is possible the intent of the statement is that such bad unwholesome qualitiesdo notarise and gain control over his mind.() Our minds will be strengthened in the perception of impermanence. (2) Our minds will be strengthened in the perception of non-self. (3) Our minds will be strengthened in the perception of unattractiveness. (4) Our minds will be strengthened in the perception of danger. (5) We will know the even and uneven ways of the world,[n.207]Lokassa samañca visamañca.Mp:\"Good conduct and misconduct in the world of beings\"(sattalokassa sucaritaduccaritāni).and our minds will be strengthened in this perception. (6) We will know the coming into being and extermination of the world,[n.2072]Lokassa bhavañca vibhavañca.Mpglosses as \"its growth and destruction, also success and failure.\"and our minds will be strengthened in this perception. (7) We will know the origination and passing away of the world, and our minds will be strengthened in this perception. (8) Our minds will be strengthened in the perception of abandoning. (9) Our minds will be strengthened in the perception of dispassion. (0) Our minds will be strengthened in the perception of cessation.’[n.2073] Perceptions §§8–0 will be explained just below inAN0.60.It is in such a way that you should you train yourselves.",
    "an10.59:2": "\"When a bhikkhu's mind has been strengthened in accordance withthe spirit ofhis going forth, and arisen bad unwholesome qualities do not obsess his mind—when his mind has been strengthened in the perception of impermanence … when his mind has been strengthened in the perception of cessation—one of two fruits is to be expected for him: either final knowledge in this very life or, if there is a residue remaining, the state of non-returning.\""
}