{
    "an10.85:1": "On one occasion the Venerable Mahācunda was dwelling among the Cetis at Sahajāti. There the Venerable Mahācunda addressed the bhikkhus:",
    "an10.85:2": "\"Here, friends, a bhikkhu is a boaster, one who brags about achievements: ‘I attain and emerge from the first jhāna. I attain and emerge from the second jhāna … the third jhāna … the fourth jhāna …… the base of the infinity of space … the base of the infinity of consciousness … the base of nothingness … the base of neither-perception-nor-non-perception. I attain and emerge from the cessation of feeling and perception.’",
    "an10.85:3": "The Tathāgata or his disciple who is a jhāna-attainer—skilled in attainment, skilled in others’ minds, skilled in the ways of others’ minds—questions him, interrogates him, and cross-examines him. When he is being questioned, interrogated, and cross-examined by the Tathāgata or by his disciple, he comes to an impasse and is flustered. He meets with calamity, meets with disaster, meets with calamity and disaster.",
    "an10.85:4": "\"The Tathāgata or his disciple who is a jhāna-attainer … encompasses his mind with his own mind and considers: ‘Why is this venerable one a boaster, one who brags about achievements: \"I attain and emerge from the first jhāna … I attain and emerge from the cessation of feeling and perception\"?’",
    "an10.85:5": "The Tathāgata or his disciple, having encompassed his mind with his own mind, understands:",
    "an10.85:6": "(1) \"‘For a long time this venerable one's conduct has been broken, flawed, blemished, and blotched, and he does not consistently observe and follow virtuous behavior. This venerable one is immoral. But in the Dhamma and discipline proclaimed by the Tathāgata, immorality is a case of decline.",
    "an10.85:7": "(2) \"‘This venerable one is without faith. But in the Dhamma and discipline proclaimed by the Tathāgata, lack of faith is a case of decline.",
    "an10.85:8": "(3) \"‘This venerable one is of little learning and without proper conduct. But in the Dhamma and discipline proclaimed by the Tathāgata, little learning is a case of decline.",
    "an10.85:9": "(4) \"‘This venerable one is difficult to correct. But in the Dhamma and discipline proclaimed by the Tathāgata, being difficult to correct is a case of decline.",
    "an10.85:10": "(5) \"‘This venerable one has bad friends. But in the Dhamma and discipline proclaimed by the Tathāgata, bad friendship is a case of decline.",
    "an10.85:11": "(6) \"‘This venerable one is lazy. But in the Dhamma and discipline proclaimed by the Tathāgata, laziness is a case of decline.",
    "an10.85:12": "(7) \"‘This venerable one is muddle-minded. But in the Dhamma and discipline proclaimed by the Tathāgata, muddlemindedness is a case of decline.",
    "an10.85:13": "(8) \"‘This venerable one is a deceiver. But in the Dhamma and discipline proclaimed by the Tathāgata, deceitfulness is a case of decline.",
    "an10.85:14": "(9) \"‘This venerable one is difficult to support. But in the Dhamma and discipline proclaimed by the Tathāgata, being difficult to support is a case of decline.",
    "an10.85:15": "(10) \"‘This venerable one is unwise. But in the Dhamma and discipline proclaimed by the Tathāgata, lack of wisdom is a case of decline.’",
    "an10.85:16": "\"Suppose, friends, that one man would say to his companion: ‘Whenever you need money for anything, my friend, just ask me and I’ll give it to you.’ When the companion has need of money, he says to his friend: ‘I need money, friend. Give me some.’ The other says: ‘In that case, friend, dig here.’ He digs there but doesn’t find anything. He then says: ‘You lied to me, friend, you spoke falsely when you told me to dig here.’ The other says: ‘I didn’t lie to you, friend, I didn’t speak falsely. Rather, dig there.’ He digs there as well but doesn’t find anything. Again, he says: ‘You lied to me, friend, you spoke falsely when you told me to dig there.’ The other says: ‘I didn’t lie to you, friend, I didn’t speak falsely.Rather, dig there.’ He digs there as well but doesn’t find anything. He then says: ‘You lied to me, friend, you spoke falsely when you told me to dig there.’[n.2103]Cerepeats the exchange here once more, with the trickster telling his companion to dig still again. I follow Be and Ee, which omit this repetition.The other says: ‘I didn’t lie to you, friend, I didn’t speak falsely. I was insane, out of my mind.’",
    "an10.85:17-30": "\"So too, friends, a bhikkhu is a boaster, one who brags about achievements: ‘I attain and emerge from the first jhāna.’ …all as above down to:… (10) ‘This venerable one is unwise. But in the Dhamma and discipline proclaimed by the Tathāgata, lack of wisdom is a case of decline.’",
    "an10.85:31": "\"Truly, friends, it is impossible for a bhikkhu who has not abandoned these ten things to achieve growth, progress, and maturity in this Dhamma and discipline. But it is possible for a bhikkhu who has abandoned these ten things to achieve growth, progress, and maturity in this Dhamma and discipline.\""
}