{
    "an10.44:1": "On one occasion the Blessed One was dwelling at Kusinārāā, in the forest thicket of oblations. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an10.44:2": "\"Bhikkhus, a bhikkhu who wishes to reprove another person should examine himself with respect to five things and establish five things in himself before he reproves the other person.[n.044] This sutta combines two fivefold sets and can thus be considered a composite ten.With respect to what five things should he examine himself?",
    "an10.44:3": "(2) \"Again, a bhikkhu who wishes to reprove another should examine himself thus: ‘Is my verbal behavior pure? Do I possess verbal behavior that is pure, flawless, and irreproachable? Does this quality exist in me or not?’ If the bhikkhu's verbal behavior is not pure, and he does not possess verbal behavior that is pure, flawless, and irreproachable, there will be those who say to him: ‘Please first train yourself verbally.’ There will be those who say this to him.",
    "an10.44:4": "(3) \"Again, a bhikkhu who wishes to reprove another should examine himself thus: ‘Have I established a mind of loving-kindness without resentment toward my fellow monks? Does this quality exist in me or not?’ If the bhikkhu has not established a mind of loving-kindness without resentment toward his fellow monks, there will be those who say to him: ‘Please first establish a mind of loving-kindness toward your fellow monks.’ There will be those who say this to him.",
    "an10.44:5": "(4) \"Again, a bhikkhu who wishes to reprove another should examine himself thus: ‘Am I learned, and do I retain and preserve what I have learned? Have I learned much of those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life? Have I retained them in mind, recited them verbally, mentally investigated them, and penetrated them well by view? Does this quality exist in me or not?’ If the bhikkhu is not learned … and has not penetrated them well by view, there will be those who say to him: ‘Please first learn the heritage.’ There will be those who say this to him.",
    "an10.44:6": "(5) \"Again, a bhikkhu who wishes to reprove another should examine himself thus: ‘Have both Pāṭimokkhas been well transmitted to me in detail, well analyzed, well mastered, well determined in terms of the rules and their detailed explication? Does there exist in me this quality or not?’ If both Pāṭimokkhashave not been well transmitted to him in detail … in terms of the rules and their detailed explication, and if, when asked: ‘Where did the Blessed One state this?’ he is unable to reply, there will be those who say to him: ‘Please first learn the discipline.’ There will be those who say this to him."
}