{
    "an10.89:1": "Then the bhikkhu Kokālika approached the Blessed One, paid homage to him, sat down to one side, and said: \"Bhante, Sāriputta and Moggallāna have evil desires and have come under the control of evil desires.\"The Blessed One replied:\"Do not say so, Kokālika! Do not say so, Kokālika![n.20]Mā h’evaṁ Kokālika, mā h’evaṁ Kokālika.Sn p. 24has the same reading, butSN I 50,7–8reads:mā h’evaṁ Kokālika avaca, mā h’evaṁ Kokālika avaca.Place confidence in Sāriputta and Moggallāna, Kokālika. Sāriputta and Moggallāna are well behaved.\"",
    "an10.89:2": "A second time the bhikkhu Kokālika said to the Blessed One: \"Bhante, although I consider the Blessed One worthy of faith and trust,I still say thatSāriputta and Moggallāna have evil desires and have come under the control of evil desires.\"",
    "an10.89:3": "A third time the bhikkhu Kokālika said to the Blessed One: \"Bhante, although I consider the Blessed One worthy of faith and trust,I still say thatSāriputta and Moggallāna have evil desires and have come under the control of evil desires.\"",
    "an10.89:4": "Then the bhikkhu Kokālika rose from his seat, paid homage to the Blessed One, circumambulated the Blessed One keeping the right side toward him, and departed. Not long after the bhikkhu Kokālika had left, his entire body became covered with boils the size of mustard seeds. These then grew to the size of mung beans; then to the size of chickpeas; then to the size of jujube pits; then to the size of jujube fruits; then to the size of myrobalans; then to the size of unripebellifruits;[n.2111] The unripebellifruit is about the size of a peach, the ripe fruit the size of a pomegranate.then to the size of ripebellifruits. When they had grown to the size of ripebellifruits, they burst open,exuding pus and blood. He then just lay on banana leaves like a fish that had swallowed poison.",
    "an10.89:5": "Then the independent brahmā Tudu approached the bhikkhu Kokālika,[n.2112] The sutta refers to Tudu as apaccekabrahmā. NeitherMpnor Mp-ṭ define the term, but Spk-pṭ I 213 (VRI ed.), commenting on its occurrence atSN I 146,26–27, explains it as a brahmā who travels about alone, not as a member of an assembly(paccekabrahmā ti ca ekacārī brahmā, na parisacārī brahmāti attho).Mpsays that in his past life he had been Kokālika's preceptor. He passed away as a non-returner and was reborn in the brahmā world. When he heard that Kokālika was slandering Sāriputta and Moggallāna, he came to request him to place confidence in them.stood in the air, and said to him: \"Place confidence in Sāriputta and Moggallāna, Kokālika. Sāriputta and Moggallāna are well behaved.\"",
    "an10.89:6": "Then the independent brahmā Tudu addressed the bhikkhu Kokālika in verse:",
    "an10.89:7": "\"When a person has taken birthan axe is born inside his mouthwith which the fool cuts himselfby uttering wrongful speech.",
    "an10.89:8": "\"He who praises one deserving blame[n.2114] The following three verses are atAN4.3.or blames one deserving praisecasts with his mouth an unlucky throwby which he finds no happiness.",
    "an10.89:9": "\"Slight is the unlucky throw at dicethat results in the loss of one's wealth,the lossof all, oneself included;much worse is this unlucky throwof harboring hate against the holy ones.",
    "an10.89:10": "\"For a hundred thousandand thirty-sixnirabbudas, plus fiveabbudas,[n.2115] In the Indian numbering system onekoṭi= ten million; akoṭiofkoṭis= onepakoṭi; akoṭiofpakoṭis= onekoṭipakoṭi; akoṭiofkoṭipakoṭis= onenahuta; akoṭiofnahutas= oneninnahuta; akoṭiofninnahutas= oneabbuda; twentyabbudas= onenirabbuda.the slanderer of noble ones goes to hell,having defamed them with evil speech and mind.\"",
    "an10.89:11": "Then the bhikkhu Kokālika died on account of that illness, and because of his resentment against Sāriputta and Moggallāna, after death he was reborn in the red-lotus hell.[n.26]Mpstates that the red-lotus(paduma)hell is not a separate hell realm but a particular place in the greatavīcihell where the duration of the torment is measured by units ofpadumas. The same applies to theabbudahell, etc., mentioned below.",
    "an10.89:12": "Then, when the night had advanced, Brahmā Sahampati, of stunning beauty, illuminating the entire Jeta's Grove, approached the Blessed One, paid homage to him, stood to one side, and said to him: \"Bhante, the bhikkhu Kokālika has died, and because of his resentment against Sāriputta and Moggallāna, after death he has been reborn in the red-lotus hell.\" This is what Brahmā Sahampati said. He then paid homage to the Blessed One, circumambulated him keeping the right side toward him, and disappeared right there.",
    "an10.89:13": "Then, when the night had passed, the Blessed One addressed the bhikkhus: \"Bhikkhus, last night, when the night had advanced, Brahmā Sahampati approached me and said to me …as above… He then paid homage to me, circumambulated me keeping the right side toward me, and disappeared right there.\"",
    "an10.89:14": "When this was said, a certain bhikkhu said to the Blessed One: \"How long, Bhante, is the life span in the red-lotus hell?\"[n.2117]Ceshould be corrected by bringing the worddīghaṁdown a line. Thus the paragraph begins withevaṁ vutteand the question withkīva dīghaṁ nu kho bhante. The mistake is in both the printed and electronic versions of Ce.",
    "an10.89:15": "\"Then is it possible, Bhante, to give a simile?\"",
    "an10.89:16": "\"When a person has taken birthan axe is born inside his mouthwith which the fool cuts himselfby uttering wrongful speech.",
    "an10.89:17": "\"He who praises one deserving blame[n.2118] The following three verses are atAN4.3.or blames one deserving praisecasts with his mouth an unlucky throwby which he finds no happiness.",
    "an10.89:18": "\"Slight is the unlucky throw at dicethat results in the loss of one's wealth,the lossof all, oneself included;much worse is this unlucky throwof harboring hate against the holy ones.",
    "an10.89:19": "\"For a hundred thousandand thirty-sixnirabbudas, plus fiveabbudas,[n.21] In the Indian numbering system onekoṭi= ten million; akoṭiofkoṭis= onepakoṭi; akoṭiofpakoṭis= onekoṭipakoṭi; akoṭiofkoṭipakoṭis= onenahuta; akoṭiofnahutas= oneninnahuta; akoṭiofninnahutas= oneabbuda; twentyabbudas= onenirabbuda.the slanderer of noble ones goes to hell,having defamed them with evil speech and mind.\""
}