{
    "an10.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an10.1:2": "\"Bhante, what is the purpose and benefit of wholesome virtuous behavior?\"\"Ānanda, the purpose and benefit of wholesome virtuous behavior is non-regret.\"",
    "an10.1:3": "\"And what, Bhante, is the purpose and benefit of non-regret?\"\"The purpose and benefit of non-regret is joy.\"",
    "an10.1:4": "\"And what, Bhante, is the purpose and benefit of joy?\"\"The purpose and benefit of joy is rapture.\"",
    "an10.1:5": "\"And what, Bhante, is the purpose and benefit of rapture?\"\"The purpose and benefit of rapture is tranquility.\"",
    "an10.1:6": "\"And what, Bhante, is the purpose and benefit of tranquility?\"\"The purpose and benefit of tranquility is pleasure.\"",
    "an10.1:7": "\"And what, Bhante, is the purpose and benefit of pleasure?\"\"The purpose and benefit of pleasureis concentration.\"",
    "an10.1:8": "\"And what, Bhante, is the purpose and benefit of concentration?\"\"The purpose and benefit of concentration is the knowledge and vision of things as they really are.\"",
    "an10.1:9": "\"And what, Bhante, is the purpose and benefit of the knowledge and vision of things as they really are?\"\"The purpose and benefit of the knowledge and vision of things as they really are is disenchantment and dispassion.\"",
    "an10.1:10": "\"And what, Bhante, is the purpose and benefit of disenchantment and dispassion?\"\"The purpose and benefit of disenchantment and dispassion is the knowledge and vision of liberation.",
    "an10.1:11": "\"Thus, Ānanda, (1) –(2) the purpose and benefit of wholesome virtuous behavior is non-regret; (3) the purpose and benefit of non-regret is joy; (4) the purpose and benefit of joy is rapture; (5) the purpose and benefit of rapture is tranquility; (6) the purpose and benefit of tranquility is pleasure; (7) the purpose and benefit of pleasure is concentration; (8) the purpose and benefit of concentration is the knowledge and vision of things as they really are; (9) the purpose and benefit of the knowledge and vision of things as they really are is disenchantment and dispassion; and (10) the purpose and benefit of disenchantment and dispassion is the knowledge and vision of liberation. Thus, Ānanda, wholesome virtuous behavior progressively leads to the foremost.\"[n.1964]Iti kho, Ānanda, kusalāni sīlāni anupubbena aggāya parenti.Mpglossesaggāyawitharahattatthāya."
}