{
    "an10.172:1": "\"Bhikkhus, what is non-Dhamma and what is the Dhamma should be understood, and what is harmful and what is beneficial should also be understood. Having understood what is non-Dhamma and what is the Dhamma, and also what is harmful and what is beneficial, one should practice in accordance with the Dhamma and with what is beneficial.\"",
    "an10.172:2": "Then, soon after the Blessed One had left, the bhikkhus considered: \"Friends, the Blessed One taught this brief synopsis: ‘Bhikkhus, what is non-Dhamma and what is the Dhamma should be understood … one should practice in accordance with the Dhamma and with what is beneficial.’ Then he rose from his seat and entered his dwelling without expounding its meaning in detail. Now who will expound its meaning in detail?’",
    "an10.172:3": "Then it occurred to them: \"The Venerable Mahākaccāna is praised by the Teacher and esteemed by his wise fellow monks; he is capable of expounding the detailed meaning of this brief synopsis. Let us approach the Venerable Mahākaccāna and ask him the meaning of this. We will retain it in mind as he explains it to us.\"",
    "an10.172:4-7": "Then those bhikkhus approached the Venerable Mahākaccāna and exchanged greetings with him, after which they sat down to one side and said: \"Friend Mahākaccāna, the Blessed One taught this brief synopsis ….… Then he rose from his seat and entered his dwelling without expounding the meaning in detail. Soon after he left, we considered: ‘Friends, the Blessed One taught this brief synopsis ….all as above down to:… Let us approach the Venerable Mahākaccāna and ask him the meaning of this. We will retain it in mind as he explains it to us.’ Let the Venerable Mahākaccāna expound it to us.\"",
    "an10.172:8": "The Venerable Mahākaccāna replied:\"Friends, it is as though a man needing heartwood, seeking heartwood, wandering in search of heartwood, would pass over the root and trunk of a great tree possessed of heartwood, thinking that heartwood should be sought among the branches and foliage. And so it is with you. When you were face to face with the Teacher you passed by the Blessed One, thinking to ask me about the meaning. For, friends, knowing, the Blessed One knows; seeing, he sees; he has become vision, he has become knowledge, he has become the Dhamma, he has become Brahmā; he is the expounder, the proclaimer, the elucidator of meaning, the giver of the deathless, the lord of the Dhamma, the Tathāgata. That was the time when youshould have approached the Blessed One and asked him about the meaning. You should have retained it in mind as he would have explained it to you.\"",
    "an10.172:9": "\"Surely, friend Kaccāna, knowing, the Blessed One knows; seeing, he sees; he has become vision … the Tathāgata. That was the time when we should have approached the Blessed One and asked him about the meaning, and we should have retained it in mind as he would have explained it to us. Yet the Venerable Mahākaccāna is praised by the Teacher and esteemed by his wise fellow monks. He is capable of expounding the detailed meaning of this synopsis. Let the Venerable Mahākaccāna expound it without finding it troublesome.\"",
    "an10.172:10": "\"Then listen, friends, and attend closely. I will speak.\"",
    "an10.172:11": "\"Friends, the Blessed One taught this brief synopsis without expounding the detailed meaning: ‘Bhikkhus, what is non-Dhamma and what is the Dhamma should be understood, and what is harmful and what is beneficial should also be understood. Having understood what is non-Dhamma and what is the Dhamma, and also what is harmful and what is beneficial, one should practice in accordance with the Dhamma and with what is beneficial.’",
    "an10.172:12": "Now what, friends, is non-Dhamma and what is the Dhamma? And what is harmful and what is beneficial?",
    "an10.172:13": "(2) \"Taking what is not given is non-Dhamma; abstention from taking what is not given is the Dhamma.The numerous bad unwholesome qualities that originate with taking what is not given as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with abstention from taking what is not given as condition: these are beneficial.",
    "an10.172:14": "(3) \"Sexual misconduct is non-Dhamma; abstention from sexual misconduct is the Dhamma. The numerous bad unwholesome qualities that originate with sexual misconduct as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with abstention from sexual misconduct as condition: these are beneficial.",
    "an10.172:15": "(4) \"False speech is non-Dhamma; abstention from false speech is the Dhamma. The numerous bad unwholesome qualities that originate with false speech as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with abstention from false speech as condition: these are beneficial.",
    "an10.172:16": "(5) \"Divisive speech is non-Dhamma; abstention from divisive speech is the Dhamma. The numerous bad unwholesome qualities that originate with divisive speech as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with abstention from divisive speech as condition: these are beneficial.",
    "an10.172:17": "(6) \"Harsh speech is non-Dhamma; abstention from harsh speech is the Dhamma. The numerous bad unwholesome qualities that originate with harsh speech as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with abstention from harsh speech as condition: these are beneficial.",
    "an10.172:18": "(7) \"Idle chatter is non-Dhamma; abstention from idle chatter is the Dhamma. The numerous bad unwholesome qualities that originate with idle chatter as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with abstention from idle chatter as condition: these are beneficial.",
    "an10.172:19": "(8) \"Longing is non-Dhamma; non-longing is the Dhamma. The numerous bad unwholesome qualities that originate with longing as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with non-longing as condition: these are beneficial.",
    "an10.172:20": "(9) \"Ill will is non-Dhamma; good will is the Dhamma. The numerous bad unwholesome qualities that originate with ill will as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with good will as condition: these are beneficial.",
    "an10.172:21": "(10) \"Wrong view is non-Dhamma; right view is the Dhamma. The numerous bad unwholesome qualities that originate with wrong view as condition: these are harmful. The numerous wholesome qualities that reach fulfillment by development with right view as condition: these are beneficial.",
    "an10.172:22": "\"Friends,it is in this way that I understand the detailed meaning of the Blessed One's brief synopsis. Now, if you wish, you may go to the Blessed One himself and ask him about the meaning of this. You should retain it in mind as the Blessed One explains it to you.\"",
    "an10.172:23-27": "\"Yes, friend,\" those bhikkhus replied, and having delighted and rejoiced in the Venerable Mahākaccāna's statement, they rose from their seats and went to the Blessed One. After paying homage to him, they sat down to one side and said to the Blessed One: \"Bhante, the Blessed One taught this synopsis ….they here relate all that had taken place, adding:… Then, Bhante, we approached the Venerable Mahākaccāna and asked him about the meaning. The Venerable Mahākaccāna expounded the meaning to us in these ways, in these terms and phrases.\"",
    "an10.172:28": "\"Good, good, bhikkhus! Mahākaccāna is wise. Mahākaccāna has great wisdom. If you had approached me and asked me the meaning of this, I would have explained it to you in the same way as Mahākaccāna. Such is the meaning of this, and so you should retain it in mind.\""
}