{
    "an10.71:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an10.71:2": "\"Bhikkhus, be observant of virtuous behavior and observant of the Pāṭimokkha. Dwell restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken them, train in the training rules.",
    "an10.71:3": "(1) \"If a bhikkhu should wish: ‘May I be pleasing and agreeable to my fellow monks, respected and esteemed by them,’ let him fulfill virtuous behavior, be devoted to internal serenity of mind, not neglect the jhānas, be possessed of insight, and resort to empty huts.",
    "an10.71:4": "(2) \"If a bhikkhu should wish: ‘May I gain robes, almsfood, lodging, and medicines and provisions for the sick,’ let him fulfill virtuous behavior … and resort to empty huts.",
    "an10.71:5": "(3) \"If a bhikkhu should wish: ‘May the services of those whose robes, almsfood, lodging, and medicines and provisions for the sick I use be of great fruit and benefit to them,’ let him fulfill virtuous behavior … and resort to empty huts.",
    "an10.71:6": "(4) \"If a bhikkhu should wish:‘When my deceased relatives and family members, after passing away, remember me with confidence in their minds, may this be of great fruit and benefit to them,’ let him fulfill virtuous behavior … and resort to empty huts.",
    "an10.71:7": "(5) \"If a bhikkhu should wish: ‘May I be content with any kind of robe, almsfood, lodging, and medicines and provisions for the sick,’ let him fulfill virtuous behavior … and resort to empty huts.",
    "an10.71:8": "(6) \"If a bhikkhu should wish: ‘May I patiently endure cold and heat; hunger and thirst; contact with flies, mosquitoes, wind, the burning sun, and serpents; and rude and offensive ways of speech. May I be able to bear up with arisen bodily feelings that are painful, racking, sharp, piercing, harrowing, disagreeable, sapping one's vitality,’ let him fulfill virtuous behavior … and resort to empty huts.",
    "an10.71:9": "(7) \"If a bhikkhu should wish: ‘May I become one who vanquishes discontent and delight, and may discontent and delight not vanquish me. May I overcome discontent and delight whenever they arise,’ let him fulfill virtuous behavior … and resort to empty huts.",
    "an10.71:10": "(8) \"If a bhikkhu should wish: ‘May I become one who vanquishes fear and terror, and may fear and terror not vanquish me. May I overcome fear and terror whenever they arise,’ let him fulfill virtuous behavior … and resort to empty huts.",
    "an10.71:11": "(9) \"If a bhikkhu should wish: ‘May I gain at will, without trouble or difficulty, the four jhānas that constitute the higher mind and are pleasant dwellings in this very life,’ let him fulfill virtuous behavior … and resort to empty huts.",
    "an10.71:12": "(10) \"If a bhikkhu should wish: ‘May I, with the destruction of the taints, realize for myself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom,and having entered upon it, dwell in it,’ let him fulfill virtuous behavior, be devoted to internal serenity of mind, not neglect the jhānas, be possessed of insight, and resort to empty huts.",
    "an10.71:13": "\"When it was said: ‘Bhikkhus, be observant of virtuous behavior and observant of the Pāṭimokkha; dwell restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults; having undertaken them, train in the training rules,’ it is because of this that this was said.\""
}