{
    "an10.17:1": "\"Bhikkhus, live under a protector, not without a protector. One without a protector lives in suffering. There are these ten qualities that serve as a protector.[n.979]Nāthakaraṇā dhammā.Mp:\"They act as protectors for oneself, meaning that they act as supports\"(attano sanāthabhāvakarā patiṭṭhākarā ti attho).What ten?",
    "an10.17:2": "() \"Again, a bhikkhu has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally, investigated mentally, and penetrated well by view. Since a bhikkhu has learned much … and penetrated well by view, this, too, is a quality that serves as a protector.",
    "an10.17:3": "() \"Again, a bhikkhu has good friends,good companions, good comrades. Since a bhikkhu has good friends, good companions, good comrades, this, too, is a quality that serves as a protector.",
    "an10.17:4": "() \"Again, a bhikkhu is easy to correct and possesses qualities that make him easy to correct; he is patient and receives instruction respectfully. Since a bhikkhu is easy to correct … and receives instruction respectfully, this, too, is a quality that serves as a protector.",
    "an10.17:5": "() \"Again, a bhikkhu is skillful and diligent in attending to the diverse chores that are to be done for his fellow monks; he possesses sound judgment about them in order to carry out and arrange them properly. Since a bhikkhu is skillful and diligent … this, too, is a quality that serves as a protector.",
    "an10.17:6": "() \"Again, a bhikkhu loves the Dhamma and is pleasing in his assertions, filled with a lofty joy pertaining to the Dhamma and discipline.[n.1980]Mponpiyasamudāhāro: \"He listens carefully when another is teaching, and he himself desires to teach others.\" I understandabhidhammeandabhivinayesimply in the referential sense, as explained innote 108. Mp, however, distinguishes betweendhammaas the Sutta Piṭaka andabhidhammaas the seven treatises (of the Abhidhamma Piṭaka); andvinayaas the twofold Suttavibhaṅga andabhivinayaas the Khandhakas and Parivāra. This type of explanation presupposes the existence of texts that had probably been compiled several generations after the Buddha’s passing.Since a bhikkhu loves the Dhamma … this, too, is a quality that serves as a protector.",
    "an10.17:7": "() \"Again, a bhikkhu has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. Since a bhikkhu has aroused energy … not casting off the duty of cultivating wholesome qualities, this, too, is a quality that serves as a protector.",
    "an10.17:8": "() \"Again, a bhikkhu is content with any kind of robe, almsfood, lodging, and medicines and provisions for the sick. Since a bhikkhu is content with any kind of … provisions for the sick, this, too, is a quality that serves as a protector.",
    "an10.17:9": "() \"Again, a bhikkhu is mindful, possessing supreme mindfulness and alertness, one who remembers and recollects what was done and said long ago. Since a bhikkhu is mindful … and recollects what was done and said long ago, this, too, is a quality that serves as a protector.",
    "an10.17:10": "() \"Again, a bhikkhu is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering. Since a bhikkhu is wise … this, too, is a quality that serves as a protector.",
    "an10.17:11": "\"Bhikkhus, live under a protector, not without a protector. One without a protector lives in suffering. These are the ten qualities that serve as a protector.\""
}