{
    "an10.96:1": "On one occasion the Venerable Ānanda was dwelling at Rājagaha in the Hot Springs Park. Then, as the night was receding, the Venerable Ānanda rose and went to the hot springs to bathe. Having bathed in the hot springs and come back out, he stood in one robe drying his limbs. The wanderer Kokanada, too, rose as the night was receding and went to the hot springs to bathe.",
    "an10.96:2": "He saw the Venerable Ānanda from a distance and said to him:",
    "an10.96:3": "\"From which group of bhikkhus, friend?\"",
    "an10.96:4": "\"If you could take the time to answer my question, I would like to ask you about a certain point.\"",
    "an10.96:5": "\"How is it, sir, do you hold the view: (1) ‘The world is eternal; this alone is true, anything else is wrong’?\"",
    "an10.96:6": "\"Then do you hold the view: (2) ‘The world is not eternal; this alone is true, anything else is wrong’?\"",
    "an10.96:7": "\"Do you hold the view: (3) –(4) ‘The world is finite’ … ‘The world is infinite’ … (5) –(6) ‘The soul and the body are the same’ … ‘The soul is one thing, the body another’ … () –(10) ‘The Tathāgata exists after death’ … ‘The Tathāgata does not exist after death’ … ‘The Tathāgata both exists anddoes not exist after death’ … ‘The Tathāgata neither exists nor does not exist after death; this alone is true, anything else is wrong’?\"",
    "an10.96:8": "\"Could it then be that you do not know and see?\"",
    "an10.96:9": "\"When I asked you: ‘How is it, sir, do you hold the view: \"The world is eternal; this alone is true, anything else is wrong\"?’ you said: ‘I don’t hold such a view, friend.’",
    "an10.96:10": "But when I asked you: ‘Then do you hold the view: \"The world is not eternal; this alone is true, anything else is wrong\"?’ you said: ‘I don’t hold such a view, friend.’",
    "an10.96:11": "When I asked you: ‘Do you hold the view: \"The world is finite\" … \"The Tathāgata neither exists nor does not exist after death; this alone is true, anything else is wrong\"?’ you said: ‘I don’t hold such a view, friend.’",
    "an10.96:12": "Then when I asked you: ‘Could it then be that you do not know and see?’ you said: ‘It isn’t the case, friend, that I do not know and see. I know and see.’ How, friend, should the meaning of this statement be understood?\"",
    "an10.96:13": "\"‘The world is eternal; this alone is true, anything else is wrong,’ friend: this is a speculative view. ‘The world is not eternal; this alone is true, anything else is wrong’: this is a speculative view. ‘The world is finite’ … ‘The world is infinite’ … ‘The soul and the body are the same’ … ‘The soul is one thing, the body another’ … ‘The Tathāgata exists after death’ … ‘The Tathāgata does not exist after death’ … ‘The Tathāgata both exists and does not exist after death’ … ‘The Tathāgata neither exists nor does not exist after death; this alone is true,anything else is wrong’: this is a speculative view.",
    "an10.96:14": "\"To the extent, friend, that there is a speculative view, a basis for views,[n.2131] AtAN4.38andAN6.54, I renderdiṭṭhiṭṭhānaas \"viewpoint,\" but here as \"basis for view.\" I followMp,which glosses the word in its earlier occurrences as meaning views themselves, but here as \"causes for views\"(diṭṭhikāraṇa).Mpmentions eight such causes: the aggregates, ignorance, contact, perception, thought, careless attention, bad friends, and another person's utterance(khandhā,avijjā,phasso,saññā,vitakko,ayoniso manasikāro,pāpamittā,paraghoso).a foundation for views, obsession with views, the origination of views, and the uprooting of views, I know and see this. When I know and see this, why should I say: ‘I do not know and see.’ I know, friend, I see.\"",
    "an10.96:15": "\"What is your name? And how are you known by your fellow monks?\""
}