{
    "an10.21:1": "\"Bhikkhus, in the evening the lion, the king of beasts, comes out from his lair, stretches his body, surveys the four quarters all around,and roars his lion's roar three times. Then he sets out in search of game. For what reason?With the thought:‘Let me not cause harm to small creatures that might cross my track.’",
    "an10.21:2": "\"‘The lion,’ bhikkhus, is a designation for the Tathāgata, the Arahant, the Perfectly Enlightened One. When the Tathāgata teaches the Dhamma to an assembly, this is his lion's roar.",
    "an10.21:3": "\"Bhikkhus, there are these ten Tathāgata's powers that the Tathāgata has, possessing which he claims the place of the chief bull, roars his lion's roar in the assemblies, and sets in motion the brahma wheel.[n.198] From this point on the text is an expanded parallel ofAN6.64. See the latter for notes on the first, second, and seventh powers here. The ten Tathāgata powers are also inMN 12.9–20, I 69–71 and are analyzed in detail at Vibh 6–44 (Be §§809–1).What ten?",
    "an10.21:4": "(2) \"Again, the Tathāgata understands as it really is the result of the undertaking of kamma past, future, and present in terms of possibilities and causes. Since the Tathāgata understands as it really is … the result of the undertaking of kamma … this too is a Tathāgata's power that the Tathāgata has, on account of which he … sets in motion the brahma wheel.",
    "an10.21:5": "(3) \"Again, the Tathāgata understands as it really is the ways leading everywhere.[n.1984]Sabbatthagāminiṁ paṭipadaṁ yathābhūtaṁ ñāṇaṁ. Vibh 339 (Be §811) identifies this with the Buddha’s knowledge of the paths leading to hell, the animal realm, the spirit world, the human world, the deva world, and nibbāna. SeeMN 12.37–43, I 74–77.Since the Tathāgata understands as it really is the ways leading everywhere, this too is a Tathāgata's power that the Tathāgata has, on account of which he … sets in motion the brahma wheel.",
    "an10.21:6": "(4) \"Again, the Tathāgataunderstands as it really is the world with its numerous and diverse elements.[n.1985]Anekadhātunānādhātulokaṁ yathābhūtaṁ ñāṇaṁ. Vibh 339 (Be §812) defines this as the Buddha’s knowledge of the diversity in the aggregates, sense bases, and elements.Since the Tathāgata understands as it really is the world with its numerous and diverse elements, this too is a Tathāgata's power that the Tathāgata has, on account of which … he sets in motion the brahma wheel.",
    "an10.21:7": "(5) \"Again, the Tathāgata understands as it really is the diversity in the dispositions of beings.[n.1986]Sattānaṁ nānādhimuttikataṁ yathābhūtaṁ ñāṇaṁ. Vibh 339 (§813) explains this as the Buddha’s knowledge of beings as having inferior or superior dispositions, and his understanding of how those with similar dispositions come together and meet.Since the Tathāgata understands as it really is the diversity in the dispositions of beings, this too is a Tathāgata's power that the Tathāgata has, on account of which … he sets in motion the brahma wheel.",
    "an10.21:8": "(6) \"Again, the Tathāgata understands as it really is the superior or inferior condition of the faculties of other beings and persons.[n.197]Parasattānaṁ parapuggalānaṁ indriyaparopariyattaṁ yathābhūtaṁ ñāṇaṁ. Vibh 340–42 (§§14–27) explains this as the Buddha’s knowledge of the condition of sentient beings’ diverse inclinations, underlying tendencies, temperaments, dispositions, intelligence, faculties, characters, receptivity, and potentiality. The terms are all explicated in detail.Mpis more concise, defining it simply as the Buddha’s knowledge of whether the five faculties of beings (their faith, etc.) are increasing or declining.Since the Tathāgata understands as it really is the superior or inferior condition of the faculties of other beings and persons, this too is a Tathāgata's power that the Tathāgata has, on account of which … he sets in motion the brahma wheel.",
    "an10.21:9": "(7) \"Again, the Tathāgata understands as it really is the defilement, the cleansing, and the emergence in regard to the jhānas, emancipations, concentrations, and meditative attainments. Since the Tathāgata understands as it really is the defilement, the cleansing, and the emergence in regard to the jhānas … this too is a Tathāgata's power that the Tathāgata has, on account of which … he sets in motion the brahma wheel.",
    "an10.21:10": "(8) \"Again, the Tathāgata recollects his manifold past abodes, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, fortybirths, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of world-dissolution, many eons of world-evolution, many eons of world-dissolution and world-evolution thus: ‘There I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn elsewhere, and there too I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn here.’ Thus he recollects his manifold past abodes with their aspects and details. Since the Tathāgata recollects his manifold past abodes … with their aspects and details, this too is a Tathāgata's power that the Tathāgata has, on account of which … he sets in motion the brahma wheel.",
    "an10.21:11": "(9) \"Again, with the divine eye, which is purified and surpasses the human, the Tathāgata sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare in accordance with their kamma thus: ‘These beings who engaged in misconduct by body, speech, and mind, who reviled the noble ones, held wrong view, and undertook kamma based on wrong view, with the breakup of the body, after death, have been reborn in the plane of misery, in a bad destination, in the lower world, in hell; but these beings who engaged in good conduct by body, speech, and mind, who did not revile the noble ones, who held right view, and undertook kamma based on right view, with the breakup of the body, after death, have been reborn in a good destination, in a heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare in accordance with their kamma.Since the Tathāgata … understands how beings fare in accordance with their kamma, this too is a Tathāgata's power that the Tathāgata has, on account of which … he sets in motion the brahma wheel.",
    "an10.21:12": "(10) \"Again, with the destruction of the taints, the Tathāgata has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. Since the Tathāgata has realized for himself … the taintless liberation of mind, liberation by wisdom … this too is a Tathāgata's power that the Tathāgata has, on account of which he claims the place of the chief bull, roars his lion's roar in the assemblies, and sets in motion the brahma wheel.",
    "an10.21:13": "\"These, bhikkhus, are the ten Tathāgata's powers that the Tathāgata has, possessing which he claims the place of the chief bull, roars his lion's roar in the assemblies, and sets in motion the brahma wheel.\""
}