{
    "an10.104:1": "\"Bhikkhus, for a person of wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation, whatever bodily kamma, verbal kamma, and mental kamma he instigates and undertakes in accordance with that view, and whatever his volition, yearning, inclination, and volitional activities, all lead to what is unwished for, undesired, and disagreeable, to harm and suffering. For what reason? Because the view is bad.",
    "an10.104:2": "\"Suppose, bhikkhus, a seed of neem, bitter cucumber, or bitter gourd were planted in moist soil.Whatever nutrients it would take up from the soil and from the water would all lead to its bitter, pungent, and disagreeable flavor. For what reason? Because the seed is bad. So too, for a person of wrong view … and wrong liberation, whatever bodily kamma, verbal kamma, and mental kamma he instigates and undertakes in accordance with that view, and whatever his volition, yearning, inclination, and volitional activities, all lead to what is unwished for, undesired, and disagreeable, to harm and suffering. For what reason? Because the view is bad.",
    "an10.104:3": "\"Bhikkhus, for a person of right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation, whatever bodily kamma, verbal kamma, and mental kamma he instigates and undertakes in accordance with that view, and whatever his volition, yearning, inclination, and volitional activities, all lead to what is wished for, desired, and agreeable, to well-being and happiness. For what reason? Because the view is good.",
    "an10.104:4": "\"Suppose, bhikkhus, a seed of sugar cane, hill rice, or grape were planted in moist soil. Whatever nutrients it would take up from the soil and from the water would all lead to its agreeable, sweet, and delectable flavor. For what reason? Because the seed is good. So too, for a person of right view …… and right liberation, whatever bodily kamma, verbal kamma, and mental kamma he instigates and undertakes in accordance with that view, and whatever his volition, yearning, inclination, and volitional activities, all lead to what is wished for, desired, and agreeable, to well-being and happiness. For what reason? Because the view is good.\""
}