{
    "an10.23:1": "\"Bhikkhus, there are things to be abandoned by body, not by speech. There are things to be abandoned by speech, not by body. There are things to be abandoned neither by body nor by speech but by having repeatedly seen with wisdom.[n.990]Ceand Ee readpaññāya disvā disvā. Be does not repeatdisvā, butMpBe seems to support the reading of Ce and Ee with its gloss:sahavipassanāya maggapaññāya passitvā passitvā pahātabbā(\"To be abandoned after having repeatedly seen with path wisdom together with insight wisdom\").",
    "an10.23:2": "\"And what, bhikkhus, are the things to be abandoned by body, not by speech? Here, a bhikkhu has committed a particular unwholesome deed with the body. His wise fellow monks investigate him and say thus: ‘You have committed a particular unwholesome deed with the body. It would really be good if you would abandon bodily misconduct and develop bodily good conduct.’ When his wise fellow monks investigate him and speak to him, he abandons bodily misconduct and develops bodily good conduct. These are called things to be abandoned by body, not by speech.",
    "an10.23:3": "\"And what are the things to be abandoned by speech, not by body? Here, a bhikkhu has committed a particular unwholesome deed by speech. His wise fellow monks investigate him and say thus: ‘You have committed a particular unwholesome deed by speech. It would really be good if you would abandon verbal misconduct and develop verbal good conduct.’ When his wise fellow monks investigate him and speak to him, he abandons verbal misconduct and develops verbal good conduct. These are called things to be abandoned by speech, not by body.",
    "an10.23:4": "\"And what are the things to be abandoned neither by body nor by speech but by having repeatedly seen with wisdom? Greed is to be abandoned neither by body nor by speech but by having repeatedly seen with wisdom. Hatred … Delusion … Anger … Hostility … Denigration … Insolence… Miserliness is to be abandoned neither by body nor by speech but by having repeatedly seen with wisdom.",
    "an10.23:5": "\"Evil envy,[n.1991]Pāpikā issā. It is hard to account for the adjectivepāpikā, since there are no instances in the texts of a benign type of envy.bhikkhus, is to be abandoned neither by body nor by speech but by having repeatedly seen with wisdom. And what is evil envy? Here, a householder or householder's son is prospering in wealth or grain, in silver or gold. A slave or dependent might think of him: ‘Oh, may this householder or householder's son not prosper in wealth or grain, in silver or gold!’ Or else an ascetic or brahmin gains robes, almsfood, lodging, and medicines and provisions for the sick. Another ascetic or brahmin might think of him: ‘Oh, may this venerable one not gain robes, almsfood, lodging, and medicines and provisions for the sick!’ This is called evil envy. Evil envy is to be abandoned neither by body nor by speech but by having repeatedly seen with wisdom.",
    "an10.23:6": "\"Evil desire, bhikkhus, is to be abandoned neither by body nor by speech but by having repeatedly seen with wisdom. And what is evil desire? Here, one without faith desires: ‘Let them know me as one endowed with faith.’ An immoral person desires: ‘Let them know me as virtuous.’ One with little learning desires: ‘Let them know me as learned.’ One who delights in company desires: ‘Let them know me as solitary.’ One who is lazy desires: ‘Let them know me as energetic.’ One who is muddle-minded desires: ‘Let them know me as mindful.’ One who is unconcentrated desires: ‘Let them know me as concentrated.’ One who is unwise desires: ‘Let them know me as wise.’ One whose taints are not destroyed desires: ‘Let them know me as one whose taints are destroyed.’This is called evil desire. Evil desire is to be abandoned neither by body nor by speech but by having repeatedly seen with wisdom.",
    "an10.23:7": "\"If, bhikkhus, greed overcomes that bhikkhu and continues on; if hatred … delusion … anger … hostility … denigration … insolence … miserliness … evil envy … evil desire overcomes that bhikkhu and continues on,[n.1992]Abhibhuyya iriyati, glossed byMpwithvattati.he should be understood thus: ‘This venerable one does not understand in such a way that he would have no greed; thus greed overcomes him and continues on. This venerable one does not understand in such a way that he would have no hatred … no delusion … no anger … no hostility … no denigration … no insolence … no miserliness … no evil envy … no evil desire; thus evil desire overcomes him and continues on.’",
    "an10.23:8": "\"If, bhikkhus, greed does not overcome that bhikkhu and continue on; if hatred … delusion … anger … hostility … denigration … insolence … miserliness … evil envy … evil desire does not overcome that bhikkhu and continue on, he should be understood thus: ‘This venerable one understands in such a way that he would have no greed; thus greed does not overcome him and continue on. This venerable one understands in such a way that he would have no hatred … no delusion … no anger … no hostility … no denigration … no insolence … no miserliness … no evil envy … no evil desire; thus evil desire does not overcome him and continue on.’\""
}