{
    "an10.70:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion, after their meal, on returning from their alms round, a number of bhikkhus had assembled in the assembly hall and were sitting together engaging in various kinds of pointless talk, that is: talk about kings, thieves, and ministers of state … talk about becoming this or that.[n.2088]Eeomits this passage, though acknowledging its presence in the manuscripts it drew upon. Ce and Be both include it. The transition to the Buddha’s talk on the ten grounds of praise is unclear, unless we assume that, as in the preceding sutta, the Buddha had visited the monks and reproached them for engaging in pointless talk.",
    "an10.70:2": "\"Bhikkhus, there are these ten grounds for praise. What ten?",
    "an10.70:3": "(2) \"He is himself content and speaks to the bhikkhus on contentment. This is a ground for praise: ‘The bhikkhu is himself content ….’",
    "an10.70:4": "(3) \"He is himself given to solitude and speaks to the bhikkhus on solitude. This is a ground for praise: ‘The bhikkhu is himself given to solitude ….’",
    "an10.70:5": "(4) \"He is himself not bound up with others and speaks to the bhikkhus on not being bound up with others. This is a ground for praise: ‘The bhikkhu is himself not bound up with others ….’",
    "an10.70:6": "(5) \"He is himself energetic and speaks to the bhikkhus on arousing energy. This is a ground for praise: ‘The bhikkhu is himself energetic ….’",
    "an10.70:7": "(6) \"He is himself accomplished in virtuous behavior and speaks to the bhikkhus on accomplishment in virtuous behavior. This is a ground for praise: ‘The bhikkhu is himself accomplished in virtuous behavior ….’",
    "an10.70:8": "(7) \"He is himself accomplished in concentration and speaks to the bhikkhus on accomplishment in concentration. This is a ground for praise: ‘The bhikkhu is himself accomplished in concentration ….’",
    "an10.70:9": "(8) \"He is himself accomplished in wisdom and speaks to the bhikkhus on accomplishment in wisdom. This is a ground for praise: ‘The bhikkhu is himself accomplished in wisdom ….’",
    "an10.70:10": "(9) \"He is himself accomplished in liberation and speaks to the bhikkhus on accomplishment in liberation. This is a ground for praise: ‘The bhikkhu is himself accomplished in liberation ….’",
    "an10.70:11": "(10) \"He is himself accomplished in the knowledge and vision of liberation and speaks to the bhikkhus on accomplishment in the knowledge and vision of liberation. This is a ground for praise: ‘The bhikkhu is himself accomplished in the knowledge and vision of liberation and speaks to the bhikkhus on accomplishment in the knowledge and vision of liberation.’",
    "an10.70:12": "\"These, bhikkhus, are the ten grounds for praise.\""
}