{
    "an10.167:1": "Now on that occasion, on the uposatha day, the brahmin Jāṇussoṇī stood to one side not far from the Blessed One, with his head washed, wearing a new pair of linen clothes, holding a handful of wetkusagrass. The Blessed One saw him standing there and said to him:",
    "an10.167:3": "\"But how, brahmin, do the brahmins observe thepaccorohaṇīfestival?\"",
    "an10.167:4": "\"Thepaccorohaṇīfestival in the Noble One's discipline, brahmin, is quite different from thepaccorohaṇīfestival of the brahmins.\"",
    "an10.167:5": "\"Well then, brahmin, listen and attend closely. I will speak.\"",
    "an10.167:6": "(1) \"Here, brahmin, the noble disciple reflects thus: ‘The result of the destruction of life is bad both in this present life and in future lives.’ Having reflected thus, he abandons the destruction of life; he descends from the destruction of life.",
    "an10.167:7": "(2) \" … ‘The result of taking what is not given is bad both in this present life and in future lives.’ Having reflected thus, he abandons taking what is not given; he descends from taking what is not given.",
    "an10.167:8": "(3) \" … ‘The result of sexual misconduct is bad both in this present life and in future lives.’ Having reflected thus, he abandons sexual misconduct; he descends from sexual misconduct.",
    "an10.167:9": "(4) \" … ‘The result of false speech is bad both in this present life and in future lives.’Having reflected thus, he abandons false speech; he descends from false speech.",
    "an10.167:10": "(5) \" … ‘The result of divisive speech is bad both in this present life and in future lives.’ Having reflected thus, he abandons divisive speech; he descends from divisive speech.",
    "an10.167:11": "(6) \" … ‘The result of harsh speech is bad both in this present life and in future lives.’ Having reflected thus, he abandons harsh speech; he descends from harsh speech.",
    "an10.167:12": "(7) \" … ‘The result of idle chatter is bad both in this present life and in future lives.’ Having reflected thus, he abandons idle chatter; he descends from idle chatter.",
    "an10.167:13": "(8) \" … ‘The result of longing is bad both in this present life and in future lives.’ Having reflected thus, he abandons longing; he descends from longing.",
    "an10.167:14": "(9) \" … ‘The result of ill will is bad both in this present life and in future lives.’ Having reflected thus, he abandons ill will; he descends from ill will.",
    "an10.167:15": "(10) \" … ‘The result of wrong view is bad both in this present life and in future lives.’ Having reflected thus, he abandons wrong view; he descends from wrong view.",
    "an10.167:16": "\"Thepaccorohaṇīfestival in the Noble One's discipline, Master Gotama, is quite different from thepaccorohaṇīfestival of the brahmins. And thepaccorohaṇīfestival of the brahmins is not worth a sixteenth part of thepaccorohaṇīfestival in the Noble One's discipline."
}