{
    "an11.2:1": "() –(2) \"Bhikkhus, for a virtuous person, one whose behavior is virtuous, no volition need be exerted: ‘Let non-regret arise in me.’ It is natural that non-regret arises in one who is virtuous, one whose behavior is virtuous.",
    "an11.2:2": "(3) \"For one without regret no volition need be exerted: ‘Let joy arise in me.’ It is natural that joy arises in one without regret.",
    "an11.2:3": "(4) \"For one who is joyful no volition need be exerted: ‘Let rapture arise in me.’ It is natural that rapture arises in one who is joyful.",
    "an11.2:4": "(5) \"For one with a rapturous mind no volition need be exerted: ‘Let my body become tranquil.’ It is natural that the body of one with a rapturous mind is tranquil.",
    "an11.2:5": "(6) \"For one tranquil in body no volition need be exerted: ‘Let me feel pleasure.’ It is natural that one tranquil in body feels pleasure.",
    "an11.2:6": "(7) \"For one feeling pleasure no volition need be exerted: ‘Let my mind be concentrated.’ It is natural that the mind of one feeling pleasure is concentrated.",
    "an11.2:7": "(8) \"For one who is concentrated no volition need be exerted: ‘Let me know and see things as they really are.’ It is naturalthat one who is concentrated knows and sees things as they really are.",
    "an11.2:8": "(9) \"For one who knows and sees things as they really are no volition need be exerted: ‘Let me be disenchanted.’ It is natural that one who knows and sees things as they really are is disenchanted.",
    "an11.2:9": "(10) \"For one who is disenchanted no volition need be exerted: ‘Let me become dispassionate.’ It is natural that one who is disenchanted becomes dispassionate.",
    "an11.2:10": "(11) \"For one who is dispassionate no volition need be exerted: ‘Let me realize the knowledge and vision of liberation.’ It is natural that one who is dispassionate realizes the knowledge and vision of liberation.",
    "an11.2:11": "\"Thus, bhikkhus, () –(10) the knowledge and vision of liberation is the purpose and benefit of dispassion; (9) dispassion is the purpose and benefit of disenchantment; (8) disenchantment is the purpose and benefit of the knowledge and vision of things as they really are; (7) the knowledge and vision of things as they really are is the purpose and benefit of concentration; (6) concentration is the purpose and benefit of pleasure; (5) pleasure is the purpose and benefit of tranquility; (4) tranquility is the purpose and benefit of rapture; (3) rapture is the purpose and benefit of joy; (2) joy is the purpose and benefit of non-regret; and (1) non-regret is the purpose and benefit of virtuous behavior."
}