{
    "an11.12:1": "A part-parallel of 6:0.On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Banyan Tree Park. Now on that occasion a number of bhikkhus were making a robe for the Blessed One, thinking that with his robe completed, at the end of the three monthsof the rains residence, the Blessed One would set out wandering.",
    "an11.12:2": "Mahānāma the Sakyan heard about this, approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an11.12:3": "\"Good, good, Mahānāma! It is fitting for you clansmen to approach the Tathāgata and ask: ‘Bhante, with all our various engagements, how should we dwell?’",
    "an11.12:4": "(6) \"Here, Mahānāma, you should recollect the Tathāgata thus: ‘The Blessed One is … the Enlightened One, the Blessed One.’ When a noble disciple recollects the Tathāgata, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight, based on the Tathāgata. A noble disciple whose mind is straight gains inspiration in the meaning, gains inspiration in the Dhamma, gains joy connected with the Dhamma. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. Mahānāma, you should develop this recollection of the Buddha while walking, standing, sitting, and lying down. You should develop it while engaged in work and while living at home in a house full of children.",
    "an11.12:5": "(7) \"Again, Mahānāma you should recollect the Dhamma … (8) … the Saṅgha … (9) … your own virtuous behavior … (10) … your own generosity … (11) … the deities thus …. When a noble disciple recollects the faith, virtuous behavior, learning, generosity, and wisdom in himself and in those deities, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight, based on the deities. A noble disciple whose mind is straight gains inspiration in the meaning, gains inspiration in the Dhamma, gains joy connected with the Dhamma. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. Mahānāma, you should develop this recollection of the deities while walking, standing, sitting, and lying down. You should develop it while engaged in work and while living at home in a house full of children.\""
}