{
    "an11.14:1": "Then the Venerable Subhūti together with the bhikkhu Saddha approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to the Venerable Subhūti:",
    "an11.14:2": "\"I hope that this son of a male lay follower endowed with faith, the bhikkhu Saddha, who has gone forth from the household life into homelessness out of faith, exhibits the manifestations of faith.\"[n.1]Saddhāpadānesu.Mp:\"In the manifestation, the characteristics, of persons endowed with faith\"(saddhānaṁ puggalānaṁ apadānesu lakkhaṇesu).",
    "an11.14:3": "\"Then listen, Subhūti, and attend closely. I will speak.\"",
    "an11.14:4": "(1) \"Here, Subhūti, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them. This is a manifestation of faith in one endowed with faith.",
    "an11.14:5": "(2) \"Again, a bhikkhu has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally, mentally investigated, and penetrated well by view. This, too, is a manifestation of faith in one endowed with faith.",
    "an11.14:6": "(3) \"Again, a bhikkhu has good friends, good companions, good comrades. This, too, is a manifestation of faith in one endowed with faith.",
    "an11.14:7": "(4) \"Again, a bhikkhu is easy to correct and possesses qualities that make him easy to correct; he is patient and receives instruction respectfully. This, too, is a manifestation of faith in one endowed with faith.",
    "an11.14:10": "(7) \"Again, a bhikkhu has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. This, too, is a manifestation of faith in one endowed with faith.",
    "an11.14:11": "(8) \"Again, a bhikkhu gains at will, without trouble or difficulty, the four jhānas that constitute the higher mind and are pleasant dwellings in this very life. This, too, is a manifestation of faith in one endowed with faith.",
    "an11.14:12": "(9) \"Again, a bhikkhu recollects his manifold past abodes …as in6:2§4… Thus he recollects his manifold past abodes with their aspects and details.This, too, is a manifestation of faith in one endowed with faith.",
    "an11.14:13": "(10) \"Again, with the divine eye, which is purified and surpasses the human, a bhikkhu sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate …as in6:2§5… and he understands how beings fare in accordance with their kamma. This, too, is a manifestation of faith in one endowed with faith.",
    "an11.14:14": "(11) \"Again, with the destruction of the taints, a bhikkhu has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. This, too, is a manifestation of faith in one endowed with faith.\"",
    "an11.14:15": "When this was said, the Venerable Subhūti said to the Blessed One: \"Bhante, these manifestations of faith in one endowed with faith that the Blessed One has spoken of are seen in this bhikkhu, and he does exhibit them.",
    "an11.14:16": "(1) \"This bhikkhu, Bhante, is virtuous …he trains in them.",
    "an11.14:17": "(2) \"He has learned much … and penetrated well by view.",
    "an11.14:18": "(3) \"He has good friends, good companions, good comrades.",
    "an11.14:19": "(4) \"He is easy to correct and possesses qualities that make him easy to correct; he is patient and receives instruction respectfully.",
    "an11.14:20": "(5) \"He is skillful and diligent … in order to carry out and arrange them properly.",
    "an11.14:21": "(6) \"He loves the Dhamma … in regard to the Dhamma and discipline.",
    "an11.14:22": "(7) \"He has aroused energy … not casting off the duty of cultivating wholesome qualities.",
    "an11.14:23": "(8) \"He gains at will, without trouble or difficulty, the four jhānas … in this very life.",
    "an11.14:24": "(9) \"He recollects his manifold past abodes … with their aspects and details.",
    "an11.14:25": "(10) \"He sees beings passing away and being reborn … and he understands how beings fare in accordance with their kamma.",
    "an11.14:26": "(11) \"With the destruction of the taints, this bhikkhu has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it.",
    "an11.14:27": "\"Good, good, Subhūti! In that case, Subhūti, you may dwell together with this bhikkhu Saddha, and when you want to see the Tathāgata, you may bring him along.\""
}