{
    "an11.17:1": "\"Bhikkhus, possessing eleven factors, a cowherd is incapable of keeping and rearing a herd of cattle. What eleven? Here, () a cowherd has no knowledge of form; (2) he is unskilled in characteristics; (3) he fails to pick out flies’ eggs; (4) he fails to dress wounds; (5) he fails to smoke out the sheds; (6) he does not know the watering place; (7) he does not know what it is to have drunk; (8) he does not know the road; (9) he is unskilled in pastures; (0) he milks dry; and () he shows no extra veneration to those bulls who are fathers and leaders of the herd. Possessing these eleven factors, a cowherd is incapable of keeping and rearing a herd of cattle.",
    "an11.17:2": "\"So too, bhikkhus, possessing eleven qualities, a bhikkhu is incapable of growth, progress, and fulfillment in this Dhamma and discipline. What eleven?Here, (1) a bhikkhu has no knowledge of form; () he is unskilled in characteristics; (3) he fails to pick out flies’ eggs; (4) he fails to dress wounds; (5) he fails to smoke out the sheds; (6) he does not know the watering place; (7) he does not know what it is to have drunk; (8) he does not know the road; (9) he is unskilled in pastures; (10) he milks dry; and (11) he shows no extra veneration to those elder bhikkhus of long-standing who have long gone forth, the fathers and leaders of the Saṅgha.",
    "an11.17:3": "(1) \"And how has a bhikkhu no knowledge of form? Here, a bhikkhu does not understand as it really is: ‘All form of whatever kind is the four great elements and the form derived from the four great elements.’ It is in this way that a bhikkhu has no knowledge of form.",
    "an11.17:4": "(2) \"And how is a bhikkhu unskilled in characteristics? Here, a bhikkhu does not understand as it really is thus: ‘A fool is characterized by his actions; a wise person is characterized by his actions.’ It is in this way that a bhikkhu is unskilled in characteristics.",
    "an11.17:5": "(3) \"And how does a bhikkhu fail to pick out flies’ eggs? Here, a bhikkhu tolerates an arisen thought of sensual desire; he does not abandon it, dispel it, terminate it, and obliterate it. He tolerates an arisen thought of ill will … an arisen thought of harming … bad unwholesome states whenever they arise; he does not abandon them, dispel them, terminate them, and obliterate them. It is in this way that a bhikkhu fails to pick out flies’ eggs.",
    "an11.17:6": "(4) \"And how does a bhikkhu fail to dress wounds? Here, having seen a form with the eye, a bhikkhu grasps at its marks and features. Even though, when he leaves the eye faculty unguarded, bad unwholesome states of longing and dejection might invade him, he does not practice restraint over it; he does not guard the eye faculty; he does not undertake the restraint of the eye faculty. Having heard a sound with the ear …… Having smelled an odour with the nose … Having tasted a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, he grasps at its marks and features. Even though, when he leaves the mind faculty unguarded, bad unwholesome states of longing and dejection might invade him, he does not practice restraint over it; he does not guard the mind faculty; he does not undertake the restraint of the mind faculty. It is in this way that a bhikkhu fails to dress wounds.",
    "an11.17:7": "(5) \"And how does a bhikkhu fail to smoke out the sheds? Here, a bhikkhu does not teach the Dhamma to others in detail as he has heard it and learned it. It is in this way that a bhikkhu fails to smoke out the sheds.",
    "an11.17:8": "(6) \"And how does a bhikkhu not know the watering place? Here, a bhikkhu does not from time to time approach those bhikkhus who are learned, heirs to the heritage, experts on the Dhamma, experts on the discipline, experts on the outlines, and inquire of them: ‘How is this, Bhante? What is the meaning of this?’ Those venerable ones do not then disclose to him what has not been disclosed, clear up what is obscure, and dispel his perplexity about numerous perplexing points. It is in this way that a bhikkhu does not know the watering place.",
    "an11.17:9": "(7) \"And how does a bhikkhu not know what it is to have drunk? Here, when the Dhamma and discipline proclaimed by the Tathāgata is being taught, a bhikkhu does not gain inspiration in the meaning, does not gain inspiration in the Dhamma, does not gain joy connected with the Dhamma. It is in this way that a bhikkhu does not know what it is to have drunk.",
    "an11.17:10": "(8) \"And how does a bhikkhu not know the road? Here, a bhikkhu does not understand the noble eightfold path as it really is. It is in this way that a bhikkhu does not know the road.",
    "an11.17:11": "(9) \"And how is a bhikkhu unskilled in pastures?Here, a bhikkhu does not understand the four establishments of mindfulness as they really are. It is in this way that a bhikkhu is unskilled in pastures.[n.2231] At SN47:6, V 148,1–2, the four establishments of mindfulness are called the pasture(gocara)of a bhikkhu, that is, the proper sphere of his attention.",
    "an11.17:12": "(10) \"And how does a bhikkhu milk dry? Here, when faithful householders invite a bhikkhu to take robes, almsfood, lodgings, and medicines and provisions for the sick, a bhikkhu accepts without moderation. It is in this way that a bhikkhu milks dry.",
    "an11.17:13": "(11) \"And how does a bhikkhu show no extra veneration to those elder bhikkhus of long-standing who have long gone forth, the fathers and leaders of the Saṅgha? Here, a bhikkhu does not maintain bodily, verbal, and mental acts of loving-kindness both openly and privately toward those elder bhikkhus of long-standing who have long gone forth, the fathers and leaders of the Saṅgha. It is in this way that a bhikkhu shows no extra veneration to those elder bhikkhus of long-standing who have long gone forth, the fathers and leaders of the Saṅgha.",
    "an11.17:14": "\"Possessing these eleven qualities, a bhikkhu is incapable of growth, progress, and fulfillment in this Dhamma and discipline.",
    "an11.17:15": "\"Bhikkhus, possessing eleven factors, a cowherd is capable of keeping and rearing a herd of cattle. What eleven? Here, (1) a cowherd has knowledge of form; (2) he is skilled in characteristics; (3) he picks out flies’ eggs; (4) he dresses wounds; (5) he smokes out the sheds; (6) he knows the watering place; (7) he knows what it is to have drunk; (8) he knows the road; (9) he is skilled in pastures; (10) he does not milk dry; and (11) he shows extra veneration to those bulls who are fathers and leaders of the herd. Possessing these eleven factors, a cowherd is capable of keeping and rearing a herd of cattle.",
    "an11.17:16": "\"So too, bhikkhus, possessing eleven qualities, a bhikkhu is capable of growth, progress, and fulfillment in this Dhamma and discipline. What eleven?Here, (1) a bhikkhu has knowledge of form; (2) he is skilled in characteristics; (3) he picks out flies’ eggs; (4) he dresses wounds; (5) he smokes out the sheds; (6) he knows the watering place; (7) he knows what it is to have drunk; (8) he knows the road; (9) he is skilled in pastures; (10) he does not milk dry; and (11) he shows extra veneration to those elder bhikkhus of long-standing who have long gone forth, the fathers and leaders of the Saṅgha.",
    "an11.17:17": "(1) \"And how does a bhikkhu have knowledge of form? Here, a bhikkhu understands as it really is thus: ‘All form of whatever kind is the four great elements and the form derived from the four great elements.’ It is in this way that a bhikkhu has knowledge of form.",
    "an11.17:18": "(2) \"And how is a bhikkhu skilled in characteristics? Here, a bhikkhu understands as it really is thus: ‘A fool is characterized by his actions; a wise person is characterized by his actions.’ It is in this way that a bhikkhu is skilled in characteristics.",
    "an11.17:19": "(3) \"And how does a bhikkhu pick out flies’ eggs? Here, a bhikkhu does not tolerate an arisen thought of sensual desire; he abandons it, dispels it, terminates it, and obliterates it. He does not tolerate an arisen thought of ill will … an arisen thought of harming … bad unwholesome states whenever they arise; he abandons them, dispels them, terminates them, and obliterates them. It is in this way that a bhikkhu picks out flies’ eggs.",
    "an11.17:20": "(4) \"And how does a bhikkhu dress wounds? Here, having seen a form with the eye, a bhikkhu does not grasp at its marks and features. Since, if he left the eye faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the eye faculty; he undertakes the restraint of the eye faculty. Having heard a sound with the ear … Having smelled an odour with the nose … Having tasted a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, he does not grasp at its marks and features. Since, if he left the mind faculty unrestrained, bad unwholesome states of longing and dejection might invade him,he practices restraint over it; he guards the mind faculty; he undertakes the restraint of the mind faculty. It is in this way that a bhikkhu dresses wounds.",
    "an11.17:21": "(5) \"And how does a bhikkhu smoke out the sheds? Here, a bhikkhu teaches the Dhamma to others in detail as he has heard it and learned it. It is in this way that a bhikkhu smokes out the sheds.",
    "an11.17:22": "(6) \"And how does a bhikkhu know the watering place? Here, from time to time a bhikkhu approaches those bhikkhus who are learned, heirs to the heritage, experts on the Dhamma, experts on the discipline, experts on the outlines, and inquires of them: ‘How is this, Bhante? What is the meaning of this?’ Those venerable ones then disclose to him what has not been disclosed, clear up what is obscure, and dispel his perplexity about numerous perplexing points. It is in this way that a bhikkhu knows the watering place.",
    "an11.17:23": "(7) \"And how does a bhikkhu know what it is to have drunk?",
    "an11.17:24": "(8) \"And how does a bhikkhu know the road? Here, a bhikkhu understands the noble eightfold path as it really is. It is in this way that a bhikkhu knows the road.",
    "an11.17:25": "(9) \"And how is a bhikkhu skilled in pastures? Here, a bhikkhu understands the four establishments of mindfulness as they really are. It is in this way that a bhikkhu is skilled in pastures.",
    "an11.17:26": "(10) \"And how does a bhikkhu not milk dry? Here, when faithful householders invite a bhikkhu to take robes, almsfood, lodgings, and medicines and provisions for the sick, a bhikkhu is moderate in accepting.It is in this way that a bhikkhu does not milk dry.",
    "an11.17:27": "(11) \"And how does a bhikkhu show extra veneration to those elder bhikkhus of long-standing who have long gone forth, the fathers and leaders of the Saṅgha? Here, a bhikkhu maintains bodily, verbal, and mental acts of loving-kindness both openly and privately toward those elder bhikkhus of long-standing who have long gone forth, the fathers and leaders of the Saṅgha. It is in this way that a bhikkhu shows extra veneration to those elder bhikkhus of long-standing who have long gone forth, the fathers and leaders of the Saṅgha.",
    "an11.17:28": "\"Possessing these eleven qualities, a bhikkhu is capable of growth, progress, and fulfillment in this Dhamma and discipline.\""
}