{
    "an11.16:1": "On one occasion the Venerable Ānanda was living at Beluvagāmaka near Vesālī. Now on that occasion the householder Dasama of Aṭṭhakanagara[n.2225] The householder is described asgahapati aṭṭhakanāgara, where –nāgarameans \"a citizen of (such and such) a city.\" The word for city itself isnagara. This is analogous to calling a person from New York a New Yorker, one from Paris a Parisian, etc.had arrived at Pāṭaliputta on a business matter.",
    "an11.16:2": "Then he approached a certain bhikkhu in the Cock's Park and asked him: \"Bhante, where is the Venerable Ānanda staying now? I want to see him.\"",
    "an11.16:3": "When the householder Dasama had completed his business at Pāṭaliputta, he went to the Venerable Ānanda at Beluvagāmaka near Vesālī. He paid homage to the Venerable Ānanda, sat down to one side,and said to him:",
    "an11.16:4": "\"And what is it?\"",
    "an11.16:5": "(2) \"Again, householder, with the subsiding of thought and examination a bhikkhu enters and dwells in the second jhāna … (3) … the third jhāna … (4) … the fourth jhāna …. He considers this and understands it thus: ‘This fourth jhāna is constructed and produced by volition. But whatever is constructed and produced by volition is impermanent, subject to cessation.’ If he is firm in this, he attains the destruction of the taints. But if he does not attain the destruction of the taints because of that lust for the Dhamma, because of that delight in the Dhamma, then, with the utter destruction of the five lower fetters, he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an11.16:6": "(5) \"Again, householder, a bhikkhu dwells pervading one quarter with a mind imbued with loving-kindness, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with loving-kindness, vast, exalted, measureless, without enmity, without ill will. He considers this and understands it thus: ‘This liberation of the mind by loving-kindness is constructed and produced by volition. But whatever is constructed and produced by volition is impermanent, subject to cessation.’ If he is firm in this, he attains the destruction of the taints. But if he does not attain the destruction of the taints because of that lust for the Dhamma, because of that delight in the Dhamma, then, with the utter destruction of the five lower fetters, he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an11.16:7": "(6) \"Again, householder, a bhikkhu dwells pervading one quarter with a mind imbued with compassion … () … with a mind imbued with altruistic joy … (8) … with a mind imbued with equanimity, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with equanimity, vast, exalted, measureless, without enmity, without ill will. He considers this and understands it thus: ‘This liberation of the mind by equanimity is constructed and produced by volition. But whatever is constructed and produced by volition is impermanent, subject to cessation.’ If he is firm in this, he attains the destruction of the taints. But if he does not attain the destruction of the taints because of that lust for the Dhamma, because of that delight in the Dhamma, then, with the utter destruction of the five lower fetters, he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an11.16:8": "(9) \"Again, householder, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity, (perceiving) ‘space is infinite,’ a bhikkhu enters and dwells in the base of the infinity of space. He considers this and understands it thus: ‘This attainment of the base of the infinity of space is constructed and produced by volition. But whatever is constructed and produced by volition is impermanent, subject to cessation.’ If he is firm in this, he attains the destruction of the taints. But if he does notattain the destruction of the taints because of that lust for the Dhamma, because of that delight in the Dhamma, then, with the utter destruction of the five lower fetters, he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an11.16:9": "(10) \"Again, householder, by completely surmounting the base of the infinity of space, (perceiving) ‘consciousness is infinite,’ he enters and dwells in the base of the infinity of consciousness … (11) … by completely surmounting the base of the infinity of consciousness, (perceiving) ‘there is nothing,’ he enters and dwells in the base of nothingness. He considers this and understands it thus: ‘This attainment of the base of nothingness is constructed and produced by volition. But whatever is constructed and produced by volition is impermanent, subject to cessation.’ If he is firm in this, he attains the destruction of the taints. But if he does not attain the destruction of the taints because of that lust for the Dhamma, because of that delight in the Dhamma, then, with the utter destruction of the five lower fetters, he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an11.16:10": "When this was said, the householder Dasama of Aṭṭhakanagara said to the Venerable Ānanda: \"Bhante Ānanda, just as if a man seeking one entrance to a hidden treasure all at once found eleven entrances to that treasure, so too, while I was seeking one door to the deathless, I have all at once gotten to hear eleven doors to the deathless.[n.2228] The eleven \"doors to the deathless\" are the four jhānas, the four immeasurables, and the lower three formless attainments. They are used as bases to develop insight and attain arahantship.Just as if a man had a house with eleven doorsand when that house caught on fire, he could flee to safety through any of these eleven doors, so I can flee to safety through any of these eleven doors to the deathless. Bhante, these members of other sects seek a fee for their teachers, so why shouldn’t I make an offering to the Venerable Ānanda?\"",
    "an11.16:11": "Then the householder Dasama of Aṭṭhakanagara assembled the Saṅgha of bhikkhus from Pāṭaliputta and Vesālī, and with his own hands he served and satisfied them with various kinds of good food. He presented a pair of cloths to each bhikkhu and a set of three robes to the Venerable Ānanda. And he had a dwelling worth five hundred[n.2229] That is, five hundredkahāpaṇas.built for the Venerable Ānanda."
}