{
    "an11.10:1": "On one occasion the Blessed One was dwelling at Rājagaha at the wanderers’ park, the peacock sanctuary. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an11.10:2": "\"Bhikkhus, possessing three qualities, a bhikkhu is best among devas and humans: one who has reached the ultimate conclusion, won ultimate security from bondage, lived the ultimate spiritual life, and gained the ultimate consummation. What three? (1) The aggregate of virtuous behavior of one beyond training, () the aggregate of concentration of one beyond training, and (3) the aggregate of wisdom of one beyond training. Possessing these three qualities, a bhikkhuis best among devas and humans: one who has … gained the ultimate consummation.",
    "an11.10:3": "\"Bhikkhus, possessing another three qualities, a bhikkhu is best among devas and humans: one who has … gained the ultimate consummation. What three? (4) The wonder of psychic potency, (5) the wonder of mind-reading, and (6) the wonder of instruction. Possessing these three qualities, a bhikkhu is best among devas and humans: one who has … gained the ultimate consummation.",
    "an11.10:4": "\"Bhikkhus, possessing another three qualities, a bhikkhu is best among devas and humans: one who has … gained the ultimate consummation. What three? (7) Right view, (8) right knowledge, and (9) right liberation. Possessing these three qualities, a bhikkhu is best among devas and humans: one who has … gained the ultimate consummation.",
    "an11.10:5": "\"Bhikkhus, possessing two qualities, a bhikkhu is best among devas and humans: one who has … gained the ultimate consummation. What two? (10) True knowledge and (11) conduct. Possessing these two qualities, a bhikkhu is best among devas and humans: one who has reached the ultimate conclusion, won ultimate security from bondage, lived the ultimate spiritual life, and gained the ultimate consummation.",
    "an11.10:6": "\"‘The khattiya is the best among peoplefor those whose standard is the clan,but one accomplished in true knowledge and conductis best among devas and humans.’",
    "an11.10:7": "\"This verse, bhikkhus, was well recited by Brahmā Sanaṁkumāra, not badly recited; it was well spoken, not badly spoken;it is beneficial, not harmful, and I approved of it. I too say thus:",
    "an11.10:8": "\"‘The khattiya is the best among peoplefor those whose standard is the clan,but one accomplished in true knowledge and conductis best among devas and humans.’\""
}