{
    "an11.9:1": "On one occasion the Blessed One was dwelling at Nādikain the brick hall. Then the Venerable Sandha[n.2208] Be has the name as Saddha.approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "an11.9:2": "\"Meditate like a thoroughbred, Sandha, not like a wild colt. And how does a wild colt meditate? When a wild colt is tied up near the feeding trough he meditates: ‘Fodder, fodder!’ For what reason? Because when a wild colt is tied up by the feeding trough, he does not ask himself: ‘Now what task will my trainer set for me today? What can I do to satisfy him?’ Tied up by the feeding trough, he just meditates: ‘Fodder, fodder!’ So too, Sandha, a person who is like a wild colt, when gone to the forest, to the foot of a tree, or to an empty hut, dwells with a mind obsessed and oppressed by sensual lust, and he does not understand as it really is the escape from arisen sensual lust. Harboring sensual lust within, he meditates, cogitates, ponders, and ruminates.[n.09]Jhāyati pajjhāyati nijjhāyati avajjhāyati. As inAN6.46, III 354,8–10, the tone is derisive.He dwells with a mind obsessed and oppressed by ill will … by dullness and drowsiness … by restlessness and remorse … by doubt, and he does not understand as it really is the escape from arisen doubt. Harboring doubt within, he meditates, cogitates,ponders, and ruminates.",
    "an11.9:3": "\"And how, Sandha, does a thoroughbred meditate? When an excellent thoroughbred horse is tied up near the feeding trough he does not meditate: ‘Fodder, fodder!’ For what reason? Because when an excellent thoroughbred horse is tied up by the feeding trough, he asks himself: ‘Now what task will my trainer set for me today? What can I do to satisfy him?’ Tied up by the feeding trough, he does not meditate: ‘Fodder, fodder!’ For that excellent thoroughbred horse regards the application of the goad as a debt, a bond, a loss, and failure. So too, an excellent thoroughbred person, when gone to the forest, to the foot of a tree, or to an empty hut, does not dwell with a mind obsessed and oppressed by sensual lust, and he understands as it really is the escape from arisen sensual lust. He does not dwell with a mind obsessed and oppressed by ill will … by dullness and drowsiness … by restlessness and remorse … by doubt, and he understands as it really is the escape from arisen doubt.",
    "an11.9:4": "\"‘Homage to you, O thoroughbred person!Homage to you, O supreme person!We ourselves do not understandWhat you meditate in dependence on.’\"[n.2210]Yassa te nābhijānāma, yampi nissāya jhāyasi. SeeMN 22.55, I 10,1–7: \"When the devas with Indra, Brahmā, and Pajāpati, search for a monk thus liberated in mind, they do not find that on which the consciousness of one who has thus attained is dependent. Why so? I say that one who has thus attained is untraceable even in this very life\"(evaṁ vimuttacittaṁ kho, bhikkhave, bhikkhuṁ sa-indā devā sabrahmakā sapajāpatikā anvesaṁ nādhigacchanti ‘idaṁ nissitaṁ tathāgatassa viññāṇan’ ti. Taṁ kissa hetu? Diṭṭh’evāhaṁ, bhikkhave, dhamme tathāgataṁ ananuvijjo ti vadāmi).",
    "an11.9:5": "When this was said, the Venerable Sandha said to the Blessed One: \"But how, Bhante, does an excellent thoroughbred person meditate? If he does not meditate in dependence on earth … in dependence on what is seen, heard, sensed, cognized, reached, sought after, and examined by the mind, and yet he meditates, just how does he meditate so that the devas … worship the excellent thoroughbred person from afar, saying:",
    "an11.9:6": "\"‘Homage to you, O thoroughbred person! …What you meditate in dependence on’?\"",
    "an11.9:7": "\"Here, Sandha, for an excellent thoroughbred person, the perception of earth has disappeared in relation to earth,[n.2211]Paṭhaviyaṁ paṭhavisaññā vibhūtā hoti.Mpglossesvibhūtahere with \"evident\"(pākaṭa), explaining: \"The perceptions of the four or five jhānas arisen with earth, etc., as object are evident … because they have been seen with insight as impermanent, suffering, and non-self.\"Mptries to support its interpretation with a citation it says is from a sutta:vibhūtā, bhante, rūpasaññā avibhūtā aṭṭhikasaññā. However, a search through CST 4.0 fails to locate these words anywhere in the Nikāyas. To my knowledge, in the Nikāyasvibhūtaalways means \"disappeared, vanished.\" See the expressionsvibhūtasaññīatSn 84, andvibhūtarūpasaññissaatSn 1113, where in both casesvibhūtacan only mean \"disappeared.\" There seems no reason to ascribe a later meaning to it here. A Chinese parallel, SĀ 926 (at T II 235c26–236b11), supports this conclusion. Taking earth as an example (at II 236a2), it reads: \"A bhikkhu is able to suppress the perception of earth in relation to the perception of earth\"(). Could the middlehere be gratuitous so that we should read?the perception of the base of nothingness has disappeared in relation to the base of nothingness, the perception of the base of neither-perception-nor-non-perception has disappeared in relation to the base of neither-perception-nor-non-perception, the perception of this world has disappeared in relation to this world, the perception of the other world has disappeared in relation to the other world; perception has disappeared in relation to whatever is seen, heard, sensed, cognized, reached, sought after, and examined by the mind.",
    "an11.9:8": "\"‘Homage to you, O thoroughbred person!Homage to you, O supreme person!We ourselves do not understandWhat you meditate in dependence on.’\""
}