{
    "an11.8:1": "Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an11.8:2": "\"Bhante, could a bhikkhu obtain such a state of concentration that he would not attend to the eye and forms, the ear and sounds, the nose and odours, the tongue and tastes, the body and tactile objects; that (1) he would not attend to earth,[n.07] By counting the sense faculties and their objects, this sutta includes more than eleven items. But to maintain the elevenfold scheme, I begin numbering the relevant items with \"earth.\"() water, (3) fire, (4) or air; (5) he would not attend to the base of the infinity of space, (6) the base of the infinity of consciousness, (7) the base of nothingness, (8) or the base of neither-perception-nor-non-perception; (9) he would not attend to this world; (10) he would not attend to the other world; (11) he would not attend to anything seen, heard, sensed, cognized, reached, sought after, and examined by the mind, but he would still be attentive?\"",
    "an11.8:3": "\"He could, Ānanda.\"",
    "an11.8:4": "\"But how, Bhante, could he obtain such a state of concentration?\"",
    "an11.8:5": "\"Here, Ānanda, a bhikkhu would attend thus: ‘This is peaceful, this is sublime, that is, the stilling of all activities, the relinquishing of all acquisitions, the destruction of craving, dispassion, cessation, nibbāna.’ It is in this way, Ānanda, that a bhikkhu could obtain such a state of concentration that he would not attend to the eye and forms, the ear and sounds, the nose and odours, the tongue and tastes, the body and tactile objects; that he would not attend to earth, water, fire, or air; he would not attend to the base of the infinity of space, the base of the infinity of consciousness, the base of nothingness, or the base of neither-perception-nor-non-perception; he would not attend to this world; he would not attend to the other world; he would not attend to anything seen, heard, sensed, cognized, reached, sought after, and examined by the mind, but he would still be attentive.\""
}