{
    "an11.13:1": "On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Banyan Tree Park. Now on that occasion the Blessed One wanted to enter upon the rains residence in Sāvatthī.",
    "an11.13:2": "Nandiya the Sakyan heard about this and it thenoccurred to him: \"I will also enter upon the rains residence in Sāvatthī.[n.16] Brahmāli writes: \"It is worth noting that a layperson speaks of entering upon the rains residence. Perhaps this was a common phenomenon in northern India, and not just restricted tosamaṇas. Maybe it was generally too difficult to travel.\"There I will engage in business and from time to time get to see the Blessed One.\"",
    "an11.13:3": "Then the Blessed One entered upon the rains residence in Sāvatthī. Nandiya the Sakyan also entered upon the rains residence in Sāvatthī, where he engaged in business and from time to time got to see the Blessed One. Now on that occasion a number of bhikkhus were making a robe for the Blessed One, thinking that with his robe completed, at the end of the three monthsof the rains residence, the Blessed One would set out wandering. Nandiya the Sakyan heard about this, approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an11.13:4": "\"Bhante, I have heard: ‘A number of bhikkhus are making a robe for the Blessed One, thinking that with his robe completed, at the end of the three monthsof the rains residence, the Blessed One will set out wandering.’ Bhante, with all our various engagements, how should we dwell?\"",
    "an11.13:5": "\"Good, good, Nandiya! It is fitting for you clansmen to approach the Tathāgata and ask: ‘Bhante, with all our various engagements, how should we dwell?’",
    "an11.13:6": "(7) \"Here, Nandiya, you should recollect the Tathāgata thus:‘The Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’ Thus you should establish mindfulness internally based on the Tathāgata.",
    "an11.13:7": "(8) \"Again, Nandiya, you should recollect the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’ Thus you should establish mindfulness internally based on the Dhamma.",
    "an11.13:8": "(9) \"Again, Nandiya, you should recollect good friends thus: ‘It is truly my good fortune and gain that I have good friends who take compassion on me, who desire my good, who exhort and instruct me.’ Thus you should establish mindfulness internally based on good friends.",
    "an11.13:9": "(10) \"Again, Nandiya, you should recollect your own generosity thus: ‘It is truly my good fortune and gain that in a population obsessed by the stain of miserliness, I dwell at home with a mind devoid of the stain of miserliness, freely generous, openhanded, delighting in relinquishment, devoted to charity, delighting in giving and sharing.’ Thus you should establish mindfulness internally based on generosity.",
    "an11.13:10": "(11) \"Again, Nandiya, you should recollect the deities thus: ‘Those deities that have been reborn in a mind-made body in companionship with the devas who transcend those subsisting on edible food do not see in themselves anything still to be done orany needto increase what has been done. Just as a permanently liberated bhikkhu does not see in himself anything still to be done orany needto increase what has been done,[n.2217]Mpidentifies theasamayavimuttowith the arahant. In relation to the expression inAN6.55, \"does not see in himself anything still to be done or (any need) to increase what has been done\"(asamayavimutto karaṇīyaṁ attano na samanupassati katassa vā paticayaṁ),Mphas glossedpaṭicayaṁwith \"progress by repeatedly doing\"(punappunaṁ karaṇena vaḍḍhiṁ).so it is with those deities that have been reborn in a mind-made body in companionship with the devas who transcend those subsisting on edible food.’[n.2218] NeitherCenor Be use atito signal the end of a direct quotation, and thus on their readings it is not easy to determine exactly where the meditation formula ends. Ee insertstihere, which signifies that the formula ends here and that it includes the simile and the repetition. The devas that subsist on edible food belong to the sense sphere. Those that have been reborn in a mind-made body belong to the form sphere. It is not clear why it is said that they \"do not see in themselves anything still to be done or (any need) to increase what has been done\"(tā karaṇīyaṁ attano na samanupassanti katassa vā paticayaṁ). This phrase is normally reserved for the arahant. I can only surmise that the text is alluding to those devas that have attained arahantship.Thus you should establish mindfulness internally based on the deities.",
    "an11.13:11": "\"Nandiya, a noble disciple who possesses these eleven qualities abandons bad unwholesome qualities and does not take them up. Just as a pot turned upside down does not receive back the water that has been poured out, and just as a fire that has gotten out of control[n.2219] I read withBeand Eeaggi mutto, as against Ceaggimukko.advances burning up a dry woodland and does not return to what it has burnt, so too, a noble disciple who possesses these eleven qualities abandons bad unwholesome qualities and does not take them up.\""
}