{
    "an11.11:1": "On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Banyan Tree Park. Now on that occasion a number of bhikkhus were making a robe for the Blessed One, thinking that with his robe completed, at the end of the three monthsof the rains residence, the Blessed One would set out wandering. Mahānāma the Sakyan heard about this, approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an11.11:3": "\"Good, good, Mahānāma! It is fitting for you clansmen to approach the Tathāgata and ask: ‘Bhante, with all our various engagements, how should we dwell?’",
    "an11.11:4": "(7) \"Again, Mahānāma, you should recollect the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’ When a noble disciple recollects the Dhamma, on that occasion his mind is not obsessed by lust,hatred, or delusion; on that occasion his mind is simply straight, based on the Dhamma. A noble disciple whose mind is straight gains inspiration in the meaning, gains inspiration in the Dhamma, gains joy connected with the Dhamma. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. This is called a noble disciple who dwells in balance amid an unbalanced population, who dwells unafflicted amid an afflicted population. As one who has entered the stream of the Dhamma, he develops recollection of the Dhamma.",
    "an11.11:5": "(8) \"Again, Mahānāma, you should recollect the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practicing the good way, practicing the straight way, practicing the true way, practicing the proper way; that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’ When a noble disciple recollects the Saṅgha, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight, based on the Saṅgha. A noble disciple whose mind is straight gains inspiration in the meaning, gains inspiration in the Dhamma, gains joy connected with the Dhamma. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. This is called a noble disciple who dwells in balance amid an unbalanced population, who dwells unafflicted amid an afflicted population. As one who has entered the stream of the Dhamma, he develops recollection of the Saṅgha.",
    "an11.11:6": "(9) \"Again, Mahānāma, you should recollect your own virtuous behavior as unbroken, flawless, unblemished, unblotched, freeing, praised by the wise, ungrasped, leading to concentration. When a noble disciple recollects his virtuous behavior, on that occasion his mind is not obsessed by lust, hatred, ordelusion; on that occasion his mind is simply straight, based on virtuous behavior. A noble disciple whose mind is straight gains inspiration in the meaning, gains inspiration in the Dhamma, gains joy connected with the Dhamma. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. This is called a noble disciple who dwells in balance amid an unbalanced population, who dwells unafflicted amid an afflicted population. As one who has entered the stream of the Dhamma, he develops recollection of virtuous behavior.",
    "an11.11:7": "(10) \"Again, Mahānāma, you should recollect your own generosity thus: ‘It is truly my good fortune and gain that in a population obsessed by the stain of miserliness, I dwell at home with a mind devoid of the stain of miserliness, freely generous, openhanded, delighting in relinquishment, devoted to charity, delighting in giving and sharing.’ When a noble disciple recollects his generosity, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight, based on generosity. A noble disciple whose mind is straight gains inspiration in the meaning, gains inspiration in the Dhamma, gains joy connected with the Dhamma. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. This is called a noble disciple who dwells in balance amid an unbalanced population, who dwells unafflicted amid an afflicted population. As one who has entered the stream of the Dhamma, he develops recollection of generosity.",
    "an11.11:8": "(11) \"Again, Mahānāma, you should recollect the deities thus: ‘There are devasruled bythe four great kings, Tāvatiṁsa devas, Yāma devas, Tusita devas, devas who delight in creation, devas who control what is created by others, devas of Brahmā's company, and devas still higher than these. There exists in me too such faith as those deities possessed because of which, when they passed away here,they were reborn there; there exists in me too such virtuous behavior … such learning … such generosity … such wisdom as those deities possessed because of which, when they passed away here, they were reborn there.’ When a noble disciple recollects the faith, virtuous behavior, learning, generosity, and wisdom in himself and in those deities, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight, based on the deities. A noble disciple whose mind is straight gains inspiration in the meaning, gains inspiration in the Dhamma, gains joy connected with the Dhamma. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. This is called a noble disciple who dwells in balance amid an unbalanced population, who dwells unafflicted amid an afflicted population. As one who has entered the stream of the Dhamma, he develops recollection of the deities.\""
}