{
    "an2.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an2.1:2": "\"Bhikkhus, there are these two faults. What two? The fault pertaining to the present life and the fault pertaining to the future life.",
    "an2.1:3": "\"It occurs to him: ‘When kings have arrested a robber, a criminal, they subject him to various punishments because of his bad deeds: they have him flogged with whips … they have his head cut off with a sword. Now if I were to commit such a bad deed, and if kings were to arrest me, they would subject me to the same punishments. They would have me flogged with whips … they would have my head cut off with a sword.’ Afraid of the fault pertaining to the present life, he does not plunder the belongings of others.[n.217]Mp:\"Even if a bundle of a thousand (gold pieces) had fallen along the road, he would not steal it thinking to support himself with it, but he would turn it over with his heel and go his way, thinking: ‘What need do I have with this?’\"This is called the fault pertaining to the present life.",
    "an2.1:4": "\"And what is the fault pertaining to the future life? Here, someone reflects thus: ‘Bodily misconduct has a bad, painful result[n.218] BothCeand Be readpāpako dukkho vipākohere, as against Eepāpako vipāko.in the future life; verbal misconduct has a bad, painful result in the future life; mental misconduct has a bad, painful result in the future life. Now if I were to engage in misconduct by body, speech, and mind, then, with the breakup of the body, after death, I would be reborn in the plane of misery, in a bad destination, in the lower world, in hell!’Afraid of the fault pertaining to the future life, he abandons bodily misconduct and develops bodily good conduct; he abandons verbal misconduct and develops verbal good conduct; he abandons mental misconduct and develops mental good conduct; he maintains himself in purity. This is called the fault pertaining to the future life."
}