{
    "an2.37:1": "Thus have I heard. On one occasion the Venerable Mahākaccāna was dwelling at Varaṇā on a bank of the Kaddama Lake.Then the brahmin Ārāmadaṇḍa approached the Venerable Mahākaccāna and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to him: \"Why is it, Master Kaccāna, that khattiyas fight with khattiyas, brahmins with brahmins, and householders with householders?\"",
    "an2.37:2": "\"Why is it, Master Kaccāna, that ascetics fight with ascetics?\"",
    "an2.37:3": "\"Is there then anyone in the world who has overcome this adherence to lust for sensual pleasures … holding firmlyto it, and this adherence to lust for views … holding firmlyto it?\"",
    "an2.37:4": "\"And who is that?\"",
    "an2.37:5": "When this was said, the brahmin Ārāmadaṇḍa rose from his seat, arranged his upper robe over one shoulder, lowered his right knee to the ground, reverently saluted in the direction of the Blessed One, and uttered this inspired utterance three times:",
    "an2.37:6": "\"Homage to the Blessed One, the Arahant, the Perfectly Enlightened One.",
    "an2.37:7": "Homage to the Blessed One, the Arahant, the Perfectly Enlightened One.",
    "an2.37:8": "Homage to the Blessed One, the Arahant, the Perfectly Enlightened One.",
    "an2.37:9": "Indeed, that Blessed One has overcome this adherence to lust for sensual pleasures, bondageto it, fixationon it, obsessionby it, holding firmlyto it, and he has overcome this adherence to lust for views, bondageto it, fixationon it, obsessionby it, holding firmlyto it.",
    "an2.37:10": "\"Excellent, Master Kaccāna! Excellent, Master Kaccāna! Master Kaccāna has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the darkness so those with good eyesight can see forms. Master Kaccāna, I now go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. Let Master Kaccāna consider me a lay follower who from today has gone for refuge for life.\""
}