{
    "an2.36:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the Venerable Sāriputta was dwelling at Sāvatthī in Migāramātā's Mansion in the Eastern Park. There the Venerable Sāriputta addressed the bhikkhus: \"Friends, bhikkhus!\"[n.255]Mphas a long preamble to its commentary on this sutta, explaining how throngs of lay devotees from Sāvatthī spontaneously assembled at the Eastern Park to hear Sāriputta speak. The devas, too, realizing that Sāriputta was about to delIV. Untameda momentous discourse, arrIV. Untamedfrom multiple celestial realms and from thousands of world systems to listen. Sāriputta exercised a feat of psychic power such that even those at the back of the crowd, and the devas at the far edge of the world system, could clearly see him and hear his voice.",
    "an2.36:2": "\"And who, friends, is the person fettered internally? Here, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them. With the breakup of the body, after death, he is reborn in a certain order of devas. Passing away from there, he is a returner, one who returns to this state of being. This is called the person fettered internally, who is a returner, one who returns to this state of being.[n.57]Mp:\"Who returns to this state of being(āgantā itthattaṁ): He returns to this state of the human five aggregates. Or else, he is not reborn in that heavenly realm or in some higher realm, but he comes back to a lower realm. By this factor, what is discussed are the lower two paths and fruits (of stream-entry and once-returning) attained by a bhikkhu who is a dry-insight meditator using the elements as meditation subject(sukkhavipassakassa dhātukammaṭṭhānikabhikkhuno).\"",
    "an2.36:3": "\"And who, friends, is the person fettered externally? Here, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them. Having entered upon a certain peaceful liberation of mind, he dwells in it.[n.258]Mp:\"A certain peaceful liberation of mind(aññataraṁ santaṁ cetovimuttiṁ): the fourth jhāna among the eight meditative attainments; for that is peaceful because it stills the opposing defilements, and it is a liberation of mind because it is liberated from those defilements.\"With the breakup of the body, after death, he is reborn in a certain order of devas. Passing away from there, he is a non-returner, one who does not return to this state of being. This is called the person fettered externally, who is a non-returner, one who does not return to this state of being.[n.259]Mp:\"He is reborn in an order of devas among the pure abodes(suddhāvāsa). He does not return to this state of the human five aggregates, nor is he reborn in a lower realm. Either he is reborn in a higher realm or he attains final nibbāna right there. By this factor, what is discussed are the three paths and fruits (up to non-returning) of a bhikkhu working at concentration(samādhikammikassa bhikkhuno).\"",
    "an2.36:4": "\"Again, friends, a bhikkhu is virtuous …. Having undertaken the training rules, he trains in them. He is practicing for disenchantment with sensual pleasures, dispassion toward them, and for their cessation.[n.260]Mp:\"At this point, what is discussed is the stream-enterer's and once-returner's insight (undertaken) to destroy lust for the five objects of sensual pleasure and (to reach) the path of non-returning(anāgāmimaggavipassanā).\"He is practicing for disenchantment with states of existence, for dispassion toward them, and for their cessation.[n.261]Mp:\"By this, what is discussed is the non-returner's insight (undertaken) to destroy lust for existence and (to reach) the path of arahantship(arahattamaggavipassanā).\"He is practicing for the destruction of craving. He is practicing for the destruction of greed.[n.262]Mpsees the practice for the destruction of craving(taṇhākkhaya)as again referring to the stream-enterer's and once-returner's insight to reach the path of non-returning, and the practice for the destruction of greed(lobhakkhaya)as again referring to the non-returner's insight to reach the path of arahantship. It would be peculiar for such a distinction to be intended here. Since both craving(taṇhā)and greed(lobha)can refer to the desire for continued existence(bhavataṇhā,bhavarāga), and since it seems improbable that, after alluding to the highest realization, Sāriputta would then revert to a lower level, this sentence may simply be continuing the description of one practicing to attain arahantship.With the breakup of the body, after death, he is reborn in a certain order of devas. Passing away from there, he is a non-returner, one who does not return to this state of being. This is called a person fettered externally, who is a non-returner, one who does not return to this state of being.\"[n.263]Mp:\"(Sāriputta) has discussed insight under six headings: (1) the lower two paths and fruits of the dry-insight meditator who uses the elements as his meditation subject; (2) the three paths and fruits of one who works at concentration; (3) the stream-enterer's and once-returner's insight to destroy sensual lust (and reach) the path of non-returning; () the non-returner's insight to destroy lust for existence (and reach) the path of arahantship; (5) the stream-enterer's and once-returner's insight for ‘the destruction of craving’—that is, craving for sensual pleasure—and to reach the path of non-returning; and (6) the non-returner's insight for ‘the destruction of greed’—that is, greed for existence—and (to reach) the path of arahantship. At the conclusion of the discourse, deities numbering hundreds of thousand ofkoṭis(akoṭi= ten million) attained arahantship, and there was no counting the number of those who became stream-enterers and so forth.\"",
    "an2.36:5": "Then a number of same-minded deities[n.264]Mpexplainssamacittāto mean \"with the same mind,\" thereby resolving an ambiguity in the Pāli term. Though in Skt the difference betweenśama= \"peace\" andsama= \"same, equal\" would have been clear, in most dialects of Middle Indo-Aryan (including Pāli) the two words would be indistinguishable and thus their meanings could be conflated.Mpconstruessamaas equivalent to Sktsama, \"same, equal\": \"They are called ‘sameminded’ because of the similarity in the subtlety of their mind(cittassa sukhumabhāvasamatāya samacittā); for they had created their own bodies with minds of similar subtlety(sukhume cittasarikkhake katvā).\"MpgIV. Untamedother explanations ofsamacittā, but all assume the meaning is \"with the same mind.\" The Chinese parallel (at T I 449b1) reads\"same-minded deities,\" thus agreeing with Mp. This indicates that the original on which the Chinese translation was based either hadsamacittāin a language that made a distinction betweenśamaandsama, or, if preserved in a language that did not make such a distinction, had been accompanied by an explanation of the term as meaning \"sameminded.\" However, the expressionssantindriyāandsantamānasātoward the end of the sutta, both related to the Sktśama, suggest that the original meaning could have been \"peaceful minded,\" unless ambivalence was deliberate.approached the Blessed One, paid homage to him, stood to one side, and said to him: \"Bhante, at Migāramātā's Mansion in the Eastern Park, Venerable Sāriputta is teaching the bhikkhus about the person fettered internally and the person fettered externally. The assembly is thrilled. It would be good, Bhante, if the Blessed One would approach the Venerable Sāriputta out of compassion.\"[n.26]Anukampaṁ upādāya.Mp:\"Not out of compassion for Sāriputta, for on that occasion there was no need to show compassion for the elder (Sāriputta) … who had already reached the perfection of a disciple's knowledge. Rather, they ask the Blessed One to go out of compassion for the other devas and humans who had assembled there.\" Despite the commentary, it may be the case that the devas actually wanted the Buddha to approach Sāriputta for his own sake. Sāriputta probably did not have the supernormal ability to see the hosts of devas that had assembled to hear him speak and thus the Buddha had to inform him of this. AtUd 40, Sāriputta says that he does not even see a mud sprite(mayaṁ pan’etarahi paṁsupisācakampi na passāma).The Blessed One consented by silence.",
    "an2.36:6": "\"Here, Sāriputta, a number of same-minded deities approached me, paid homage to me, stood to one side, and said: ‘Bhante, at Migāramātā's Mansion in the Eastern Park, Venerable Sāriputta is teaching the bhikkhus about the person fettered internally and the person fettered externally. The assembly is thrilled. It would be good, Bhante, if the Blessed One would approach the Venerable Sāriputta out of compassion.’"
}