{
    "an3.33:1": "Then the Venerable Sāriputta approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "an3.33:2": "\"Therefore, Sāriputta, you should train yourselves thus: (1) ‘There will be no I-making, mine-making, and underlying tendency to conceit in regard to this conscious body; () there will be no I-making, mine-making, and underlying tendency to conceit in regard to all external objects; and (3) we will enter and dwell in that liberation of mind, liberation by wisdom, through which there is no more I-making, mine-making, and underlying tendency to conceit for one who enters and dwells in it.’ It is in this way, Sāriputta, that you should train yourselves.",
    "an3.33:3": "\"When, Sāriputta, a bhikkhuhas no I-making, mine-making, and underlying tendency to conceit in regard to this conscious body; when he has no I-making, mine-making, and underlying tendency to conceit in regard to all external objects; and when he enters and dwells in that liberation of mind, liberation by wisdom, through which there is no more I-making, mine-making, and underlying tendency to conceit for one who enters and dwells in it, he is called a bhikkhu who has cut off craving, stripped off the fetter, and, by completely breaking through conceit, has made an end of suffering. And it was with reference to this that I said in the Pārāyana, in ‘The Questions of Udaya’:[n.69]Sn 1106–7.",
    "an3.33:4": "\"The abandoning of bothsensual perceptions and dejection;the dispelling of dullness,the warding off of remorse;[n.370] This is an allusion to the abandoning of the five hindrances, of which four are mentioned here.",
    "an3.33:5": "\"purified equanimity and mindfulnesspreceded by reflection on the Dhamma:this, I say, is emancipation by final knowledge,the breaking up of ignorance.\"[n.371]Mptakes this to be the fruit of arahantship based on the fourth jhāna, which is suggested by the lineupekkhāsatisaṁsuddhaṁ, echoing the stock formula for the fourth jhāṇa."
}