{
    "an3.90:1": "\"Bhikkhus, there are these three trainings. What three? The training in the higher virtuous behavior, the training in the higher mind, and the training in the higher wisdom.",
    "an3.90:2": "\"And what, bhikkhus, is the training in the higher virtuous behavior? Here, a bhikkhu is virtuous …. Having undertaken the training rules, he trains in them. This is called the training in the higher virtuous behavior.",
    "an3.90:3": "\"And what, bhikkhus, is the training in the higher mind? Here, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna …the fourth jhāna …. This is called the training in the higher mind.",
    "an3.90:4": "\"And what, bhikkhus, is the training in the higher wisdom? Here, with the destruction of the taints, a bhikkhu realizes for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it.",
    "an3.90:5": "Energetic, strong, and resolute,meditative, mindful, the faculties guarded,one should practice the higher virtue,the higher mind, and the higher wisdom.",
    "an3.90:6": "As before, so after;as after, so before;as below, so above;as above, so below;",
    "an3.90:7": "as by day, so at night;as at night, so by day,having overcome all quarters,with measureless concentration.[n.528]Mp, commenting on this verse and the previous one, says: \"As before, so after: as earlier one trains in the three trainings, so one trains in them afterward; and so for the second line.As below, so above: as one sees the lower part of the body as unattractive, one extends this to the upper part; and inversely for the second line.As by day, so at night: as one trains in the three trainings by day, so one trains in them at night; and inversely for the second line.Having overcome all quartersby way of the object,with measureless concentration, with the concentration of the path of arahantship.\"",
    "an3.90:8": "They call him a trainee on the path,whose conduct has been well purified.They call him enlightened in the world,a wise one who has fulfilled the practice.[n.529] I read withBeand Eedhīraṁ paṭipadantaguṁ.Ce hasvīraṁ.Mpglosses: \"A wise one endowed with wisdom; one who is wise in terms of the aggregates, wise in terms of the sense bases, gone to the end of the practice\"(khandhadhīra-āyatanadhīravasena dhīraṁ dhitisampannaṁ paṭipattiyā antaṁ gataṁ).",
    "an3.90:9": "For one freed by craving's destruction,with the cessation of consciousnessthe emancipation of the mindis like the extinguishing of a lamp.[n.530]Mp:\"This is the arahant's emancipation of mind, occurring with the ceasing of the final consciousness. It is like the full extinguishing of a lamp. No place where it has gone is discerned; there is only arrival at the indiscernible state(apaṇṇattikabhāvūpagamano yeva hoti).\""
}