{
    "an3.72:1": "On one occasion the Venerable Ānanda was dwelling at Kosambī in Ghosita's Park. Then a certain householder, a disciple of the Ājīvakas,[n.490] The school of Makkhali Gosāla, which taught strict determinism and emphasized extreme austerities.approached the Venerable Ānanda, paid homage to him, sat down to one side, and said to him:",
    "an3.72:2": "(1) \"Bhante Ānanda, whose Dhamma is well expounded? () Who in the world are practicing the good way? (3) Who in the world are the fortunate ones?\"[n.491] Here and below the pluralsugatāis used. Thus in this context the word has a wider raṅge than merely the Buddha, its usual application.",
    "an3.72:3": "(2) \"What do you think, householder? Are those practicing for the abandoning of lust, hatred, and delusion practicing the good way in the world or not, or how do you take it?\"",
    "an3.72:4": "(3) \"What do you think, householder? Are those who have abandoned lust, hatred, and delusion, cut them off at the root, made them like a palm stump, obliterated them so that they are no more subject to future arising fortunate ones in the world or not, or how do you take it?.",
    "an3.72:5": "\"Thus, householder, you have declared: ‘The Dhamma of those who teach the abandoning of lust, hatred, and delusion is well expounded.’ You have declared: ‘Those practicing for the abandoning of lust, hatred, and delusion are practicing the good way in the world.’ And you have declared: ‘Those who have abandoned lust, hatred, and delusion, cut them off at the root, made them like a palm stump, obliterated them so that they are no more subject to future arising are fortunate ones in the world.’\"",
    "an3.72:6": "\"It is astounding and amazing, Bhante, that there is no extolling of one's own Dhamma nor any denigration of the Dhamma of others, but just the teaching of the Dhamma in its own sphere. The meaning is stated, but one does not bring oneself into the picture.[n.492]Attho ca vutto, attā ca anupanīto. There is a word play here betweenattho, \"meaning,\"andattā, \"self.\"",
    "an3.72:7": "\"Excellent, Bhante! Excellent, Bhante! The noble Ānanda has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the darkness so those with good eyesight can see forms. Bhante Ānanda, I now go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha of bhikkhus. Let the Noble Ānanda consider me a lay follower who from today has gone for refuge for life.\""
}