{
    "an3.20:1": "\"Bhikkhus, possessing three factors, a shopkeeper soon attains vast and abundant wealth. What three? Here, a shopkeeper has keen eyes, is responsible, and has benefactors.",
    "an3.20:2": "() \"And how is a shopkeeper responsible? Here, a shopkeeper is skilled in buying and selling goods. It is in this way that a shopkeeper is responsible.",
    "an3.20:3": "() \"And how does a shopkeeper have benefactors?Here, rich, wealthy, affluent householders and householders’ sons know him thus: ‘This good shopkeeper has keen eyes and is responsible; he is able to support his wife and children and pay us back from time to time.’ So they deposit wealth with him, saying: ‘Having earned wealth with this, friend shopkeeper, support your wife and children and pay us back from time to time.’ It is in this way that a shopkeeper has benefactors.",
    "an3.20:4": "\"So too, bhikkhus, possessing three qualities, a bhikkhu soon attains vast and abundant wholesome qualities. What three? Here, a bhikkhu has keen eyes, is responsible, and has benefactors.",
    "an3.20:5": "(2) \"And how is a bhikkhu responsible? Here, a bhikkhu has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. It is in this way that a bhikkhu is responsible.",
    "an3.20:6": "(3) \"And how does a bhikkhu have benefactors? Here, from time to time a bhikkhu approaches those bhikkhus who are learned, heirs to the heritage, experts on the Dhamma, experts on the discipline, experts on the outlines,[n.354]Mātikādharā.Mpglosses this as \"experts on the two outlines\"(dvemātikādharā), which Mp-ṭ identifies as the bhikkhu and bhikkhunīmātikās(the Pāṭimokkhas for monks and nuns) or themātikāsof the Vinaya and Abhidhamma. Themātikāswere lists of principles and practices that systematically represent the Dhamma. Themātikādharāare mentioned once in DN, twice in MN (in one sutta), not at all in SN, and twelve times in AN, which suggests that the suttas that refer to them are relatively late, or at least had been modified to accommodate them. On their nature and role, see   218–24.and inquires: ‘How is this, Bhante? What is the meaning of this?’ Those venerable ones then disclose to him what has not been disclosed, clear up what is obscure, and dispel his perplexity about numerous perplexing points. It is in this way that a bhikkhu has benefactors."
}