{
    "an3.91:1": "On one occasion the Blessed One was wandering on tour among the Kosalans together with a large Saṅgha of bhikkhus when he reached the Kosalan town of Pankadhā. He then dwelled near Pankadhā.",
    "an3.91:2": "Then, not long after the Blessed One had left, the bhikkhu Kassapagotta was filled with remorse and regret, (thinking): \"It is my misfortune and loss that when the Blessed One was instructing, encouraging, inspiring, and gladdening the bhikkhus with a Dhamma talk connected with the training rules, I became impatient and bitter, (thinking): ‘This ascetic is too stringent.’ Let me now go to the Blessed One and confess my transgression to him..",
    "an3.91:3": "\"Bhante, on one occasion the Blessed One was dwelling at the Kosalan town of Pankadhā. There the Blessed One instructed, encouraged, inspired, and gladdened the bhikkhus with a Dhamma talk connected with the training rules. While he was instructing … and gladdening them, I became impatient and bitter, thinking: ‘This ascetic is too stringent.’ Then, having dwelled at Pankadhā as long as he wanted, the Blessed One set out on tour for Rājagaha. Not long after he left, I was filled with remorse and regret, thinking: ‘It is my misfortune and loss that when the Blessed One was instructing … and gladdening the bhikkhus with a Dhamma talk connected with the training rules, I became impatient and bitter, thinking: \"This ascetic is too stringent.\" Let me now go to the Blessed One and confess my transgression to him.’",
    "an3.91:4": "\"Surely, Kassapa, you have committed a transgression in that, when I was instructing, encouraging, inspiring, and gladdening the bhikkhus with a talk on the Dhamma connected with the training rules, you so foolishly, stupidly, and unskillfully became impatient and bitter, thinking: ‘This ascetic is too stringent.’ But since you see your transgression as a transgression and make amends for it in accordance with the Dhamma, we accept it. For it is growth in the Noble One's discipline that one sees one's transgression as a transgression, makes amends for it in accordance with the Dhamma, and undertakes future restraint.",
    "an3.91:5": "(1) \"If, Kassapa, an elder bhikkhu[n.32] The sutta itself does not specify a triad, but I assume it is the distinction between elder, middling, and junior bhikkhus that warrants including this sutta in the Threes.does not desire to train and does not speak praise of undertaking the training; if he does not encourage in the training other bhikkhus who do not desire to train; and if he does not speak genuine, real, and timely praise of those bhikkhus who desire to train, I do not speak praise of such an elder bhikkhu. For what reason? Because other bhikkhus, (hearing): ‘The Teacher speaks praise of him,’ might associate with him, and those who associate with him might follow his example. If they follow his example, this would lead to their harm and suffering for a long time. Therefore I do not speak praise of such an elder bhikkhu.",
    "an3.91:6": "(2) \"If, Kassapa, a bhikkhu of middle standing … (3) If a junior bhikkhu does not desire to train and does not speak praise of undertaking the training; if he does not encourage in the training other bhikkhus who do not desire to train; and if he does not speak genuine, real, and timely praise of those bhikkhus who desire to train, I do not speak praise of such a junior bhikkhu. For what reason? Because other bhikkhus, (hearing): ‘The Teacher speaks praise of him,’ might associate with him, and those who associate with himmight follow his example. If they follow his example, this would lead to their harm and suffering for a long time. Therefore I do not speak praise of such a junior bhikkhu.",
    "an3.91:7": "(1) \"If, Kassapa, an elder bhikkhu desires to train and speaks praise of undertaking the training; if he encourages in the training other bhikkhus who do not desire to train; and if he speaks genuine, real, and timely praise of those bhikkhus who desire to train, I speak praise of such an elder bhikkhu. For what reason? Because other bhikkhus, (hearing): ‘The Teacher speaks praise of him,’ might associate with him, and those who associate with him might follow his example. If they follow his example, this would lead to their welfare and happiness for a long time. Therefore I speak praise of such an elder bhikkhu.",
    "an3.91:8": "(2) \"If, Kassapa, a bhikkhu of middle standing … (3) If a junior bhikkhu desires to train and speaks praise of undertaking the training; if he encourages in the training other bhikkhus who do not desire to train; and if he speaks genuine, real, and timely praise of those bhikkhus who desire to train, I speak praise of such a junior bhikkhu. For what reason? Because other bhikkhus, (hearing): ‘The Teacher speaks praise of him,’ might associate with him, and those who associate with him might follow his example. If they follow his example, this would lead to their welfare and happiness for a long time. Therefore I speak praise of such a junior bhikkhu.\""
}