{
    "an3.56:1": "Then a certain affluent brahmin approached the Blessed One … and said to him.",
    "an3.56:2": "(1) \"At present, brahmin, people are excited by illicit lust, overcome by unrighteous greed, afflicted by wrong Dhamma.[n.414]Mp:\"Illicit lust(adhammarāga): Lust is exclusively contrary to the Dhamma(adhamma), but it is not ‘illicit lust’ when it arises in relation to one's own possessions. It is only ‘illicit lust’ when it arises in regard to the possessions of others.Unrighteous greed(visamalobha): Though greed is never actually righteous, greed arisen for an object that belongs to oneself is called righteous greed. The greed arisen for an object belonging to another is called unrighteous greed.Wrong Dhamma(micchādhamma): indulgence in what is not a base.\" Mp-ṭ: \"Indulgence in some base of lust(rāgassa vatthuṭṭhānaṁ)other than that considered good by the world's standards.\"As a result, they take up weapons and slay one another. Hence many people die. This is a reason why at present the number of people has declined, depopulation is seen, and villages, towns, cities, and districts have vanished.",
    "an3.56:3": "(2) \"Again, at present people are excited by illicit lust, overcome by unrighteous greed, afflicted by wrong Dhamma. When this happens, sufficient rain does not fall. As a result, there is a famine, a scarcity of grain; the crops become blighted and turn to straw. Hence many people die. This is another reason why at present the number of people has declined, depopulation is seen, and villages, towns, cities, and districts have vanished.",
    "an3.56:4": "(3) \"Again, at present people are excited by illicit lust, overcome by unrighteous greed, afflicted by wrong Dhamma. When this happens, the yakkhas release wild spirits.[n.15] I read with Be, Ee, andMp(Ce and Be):yakkhā vāḷe amanusse ossajjanti. Ce of AN hasmanusseforamanusse. Yakkhas are demonic spirits, sometimes depicted as killing human beings and devouring their flesh, but also capable of goodness and even realization of the Dhamma.Mp:\"‘Yakkhas’ are the ruling yakkhas. They release fierce yakkhas on the paths of humans, and when these (yakkhas) get the chance, they deprive the people of their lives\"(yakkhāti yakkhādhipatino.Vāḷe amanusse ossajjantīti caṇḍayakkhe manussapathe vissajjenti, te laddhokāsā mahājanaṁ jīvitakkhayaṁ pāpenti). Though I followMp,I wonder if a more original reading of the text would construe the verb as passive and put all the substantives in nominative plural:yakkhā vāḷā amanussā ossajjanti. \"Yakkhas—wild, nonhuman—are released.\"Hence many people die. This is yet another reason why at present the number of people has declined, depopulation is seen, and villages, towns, cities, and districts have vanished.\"",
    "an3.56:5": "\"Excellent, Master Gotama! … Let Master Gotama consider me a lay follower who from today has gone for refuge for life.\""
}