{
    "an3.86:1": "\"Bhikkhus, every half-month more than a hundred and fifty training rules come up for recitation; clansmen who desire their own good train in these. These are all comprised within these three trainings. What three? The training in the higher virtuous behavior, the training in the higher mind, and the training in the higher wisdom. These are the three trainings in which all this is comprised.",
    "an3.86:2": "\"Here, bhikkhus, a bhikkhu fulfills virtuous behavior, but cultivates concentration and wisdom only to a moderate extent. He falls into offenses in regard to the lesser and minor training rules and rehabilitates himself.[n.5]Khuddānukhuddakāni sikkhāpadāni. AtDN16, shortly before his passing, the Buddha permitted the bhikkhus, if they so desired, to abolish these rules. However, in the Vinaya account of the first Buddhist council, the monks were uncertain about which rules were minor and therefore decided to retain them all (Khandaka 1 (Cv11)).Mp,commenting on the present sutta, says: \"The teachers who specialize in the Great Aṅguttara Nikāya say, ‘Apart from the fourpārājikas(offenses entailing expulsion), all the rest are lesser and minor’\"(ime pana aṅguttaramahānikāyavaḷañjanaka-ācariyā ‘cattāri parajikani ṭhapetvā sesāni sabbānipi khuddānukhuddakāni’).For what reason? Because I have not said that he is incapable of this.[n.53]Na hi m’ettha, bhikkhave, abhabbatā vuttā.Mpparaphrases: \"Bhikkhus, I have not stated that it is impossible for a noble person to fall into such an offense and to be rehabilitated\"(bhikkhave na hi mayā ettha evarūpaṁ āpattiṁ āpajjane ca vuṭṭhāne ca ariyapuggalassa abhabbatā kathitā).But in regard to those training rules that are fundamental to the spiritual life, in conformity with the spiritual life,[n.54]Tāni ādibrahmacariyikāni brahmacariyasāruppāni.Mp:\"Those training rules that are fundamental to the spiritual life: these are the four major training rules fundamental to the spiritual life of the path.In conformity with the spiritual life: these same (rules) are in conformity with, fitting for, the spiritual life of the four paths\"(ādibrahmacariyikānīti maggabrahmacariyassa ādibhūtāni cattāri mahāsīlasikkhāpadāni;brahmacariyasāruppānīti tāni yeva catumaggabrahmacariyassa sāruppāni anucchavikāni).his behavior is constant and steadfast. Having undertaken the training rules, he trains in them. With the utter destruction of three fetters,he is a stream-enterer, no longer subject torebirth inthe lower world, fixed in destiny, with enlightenment as his destination.",
    "an3.86:3": "\"Another bhikkhu fulfills virtuous behavior, but cultivates concentration and wisdom only to a moderate extent. He falls into offenses in regard to the lesser and minor training rules and rehabilitates himself. For what reason? Because I have not said that he is incapable of this. But in regard to those training rules that are fundamental to the spiritual life, in conformity with the spiritual life, his behavior is constant and steadfast. Having undertaken the training rules, he trains in them. With the utter destruction of three fetters and with the diminishing of greed, hatred, and delusion, he is a once-returner who, after coming back to this world only one more time, will make an end of suffering.",
    "an3.86:4": "\"Another bhikkhu fulfills virtuous behavior and concentration, but cultivates wisdom only to a moderate extent. He falls into offenses in regard to the lesser and minor training rules and rehabilitates himself. For what reason? Because I have not said that he is incapable of this. But in regard to those training rules that are fundamental to the spiritual life, in conformity with the spiritual life, his behavior is constant and steadfast. Having undertaken the training rules, he trains in them. With the utter destruction of the five lower fetters, he is one of spontaneous birth, due to attain final nibbāna there without returning from that world.",
    "an3.86:5": "\"Another bhikkhu fulfills virtuous behavior, concentration, and wisdom. He falls into offenses in regard to the lesser and minor training rules and rehabilitates himself. For what reason? Because I have not said that he is incapable of this. But in regard to those training rules that are fundamental to the spiritual life, in conformity with the spiritual life, his behavior is constant and steadfast. Having undertaken the training rules, he trains in them. With the destruction of the taints, he realizes for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it.",
    "an3.86:6": "\"Thus, bhikkhus, one who cultivates in part succeeds in part; one who cultivates fully reaches fulfillment. These training rules, I say, are not barren.\""
}