{
    "an3.32:1": "Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an3.32:2": "\"Bhante, could a bhikkhu obtain such a state of concentration that (1) he would have no I-making, mine-making, and underlying tendency to conceit in regard to this conscious body; () he would have no I-making, mine-making, and underlying tendency to conceit in regard to all external objects; and (3) he would enter and dwell in that liberation of mind, liberation by wisdom, through which there is no more I-making, mine-making, and underlying tendency to conceit for one who enters and dwells in it?\"[n.365]Mpexplains the compoundahaṅkāramamaṅkāramānānusayāas \"I-making by views, mine-making by craving, and the underlying tendency to conceit. These are the defilements in relation to oneself and others.\" Mp explainsbahiddhā ca sabbanimittesu(\"and all external objects\") as the five sense objects, the eternalist (and other) views, the person, and Dhamma. It calls thissamādhithe fruition attainment of arahantship(arahattaphalasamāpatti).",
    "an3.32:3": "\"But how, Bhante, could he obtain such a state of concentration?\"",
    "an3.32:4": "\"Here, Ānanda, a bhikkhu thinks thus: ‘This is peaceful, this is sublime, that is, the stilling of all activities, the relinquishing of all acquisitions, the destruction of craving, dispassion, cessation, nibbāna.’ In this way, Ānanda, a bhikkhu could obtain such a state of concentration that he would have no I-making, mine-making, and underlying tendency to conceit in regard to this conscious body; he would have no I-making, mine-making, and underlying tendency to conceit in regard to all external objects; and he would enter and dwell in that liberation of mind, liberation by wisdom, through which there is no more I-making, mine-making, and underlying tendency to conceit for one who enters and dwells in it.",
    "an3.32:5": "And it was with reference to this that I said in the Pārāyana, in ‘The Questions of Puṇṇaka’:[n.366]Sn 1048. The Pārāyana, the fifth and final chapter of the Suttanipāta, consists of a framing story and sixteen sections in each of which the Buddha answers the questions of the students of the elder brahmin Bāvāri. Verses from the Pārāyana are cited and explained elsewhere in AN and other Nikāyas, which testifies to its antiquity. It must have existed as an independent work before being incorporated into Sn. The Pārāyana is the subject of an ancient canonical commentary, the Cūḷaniddesa, included in the Khuddaka Nikāya.",
    "an3.32:6": "\"Having comprehended the highs and lows in the world,he is not perturbed by anything in the world.Peaceful, fumeless, untroubled, wishless,he has, I say, crossed over birth and old age.\""
}