{
    "an3.58:1": "Then the brahmin Tikaṇṇa approached the Blessed One and exchanged greetings with him …. Then, sitting to one side, the brahmin Tikaṇṇa, in the presence of the Blessed One, spoke praise of the brahmins who had mastered the threefold knowledge: \"Such are the brahmins who are masters of the threefold knowledge; thus are the brahmins who are masters of the threefold knowledge.\"",
    "an3.58:2": "The Blessed One said:\"But how, brahmin, do the brahmins describe a brahmin who is a master of the threefold knowledge?.",
    "an3.58:3": "\"Brahmin, a master of the threefold knowledge in the Noble One's discipline is quite different from a brahmin who is a master of the threefold knowledge as the brahmins describe him..",
    "an3.58:4": "\"Here, brahmin, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna, which consists of rapture and pleasure born of seclusion, accompanied by thought and examination. With the subsiding of thought and examination, he enters and dwells in the second jhāna, which has internal placidity and unification of mind and consists of rapture and pleasure born of concentration, without thought and examination. With the fading away as well of rapture, he dwells equanimous and, mindful and clearly comprehending, he experiences pleasure with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ With the abandoning of pleasure and pain, and with the previous passing away of joy and dejection,he enters and dwells in the fourth jhāna, neither painful nor pleasant, which has purification of mindfulness by equanimity.",
    "an3.58:5": "(1) \"When his mind is thus concentrated, purified, cleansed, unblemished, rid of defilement, malleable, wieldy, steady, and attained to imperturbability, he directs it to the knowledge of the recollection of past abodes. He recollects his manifold past abodes, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of world-dissolution, many eons of world-evolution, many eons of world-dissolution and world-evolution, thus: ‘There I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn elsewhere, and there too I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn here.’ Thus he recollects his manifold past abodes with their aspects and details.",
    "an3.58:6": "(2) \"When his mind is thus concentrated, purified, cleansed, unblemished, rid of defilement, malleable, wieldy, steady, and attained to imperturbability, he directs it to the knowledge of the passing away and rebirth of beings. With the divine eye, which is purified and surpasses the human, he sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare in accordance with their kamma thus: ‘These beings who engaged in misconduct by body, speech, and mind, who reviled the noble ones, held wrong view, and undertook kamma based on wrong view, with the breakup of the body, after death, have been reborn in the plane of misery, in a bad destination, in the lower world, in hell; but these beings who engaged in good conduct by body, speech, and mind, who did not revile the noble ones, who held rightview, and undertook kamma based on right view, with the breakup of the body, after death, have been reborn in a good destination, in a heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare in accordance with their kamma.",
    "an3.58:7": "(3) \"When his mind is thus concentrated, purified, cleansed, unblemished, rid of defilement, malleable, wieldy, steady, and attained to imperturbability, he directs it to the knowledge of the destruction of the taints. He understands as it really is: ‘This is suffering’; he understands as it really is: ‘This is the origin of suffering’; he understands as it really is: ‘This is the cessation of suffering’; he understands as it really is: ‘This is the way leading to the cessation of suffering.’ He understands as it really is: ‘These are the taints’; he understands as it really is: ‘This is the origin of the taints’; he understands as it really is: ‘This is the cessation of the taints’; he understands as it really is: ‘This is the way leading to the cessation of the taints.’",
    "an3.58:8": "\"He whose virtue has no vacillation,who is alert and meditative,whose mind has been mastered,one-pointed, well concentrated;",
    "an3.58:9": "\"the wise one, dispeller of darkness,the triple-knowledge bearer, victor over death;the one they call an abandoner of all,benefactor of devas and humans;",
    "an3.58:10": "\"the one possessing the three knowledges,who dwells without delusion;they worship him, the BuddhaGotama, bearing his final body.",
    "an3.58:11": "\"One who knows his past abodes,who sees heaven and the plane of misery,and has reached the destruction of birthis a sage consummate in direct knowledge.[n.419] The verse, which also occurs asDhp 423a–d, alludes to the three knowledges.",
    "an3.58:12": "\"Through these three kinds of knowledgeone is a triple-knowledge brahmin.I call him a triple-knowledge master,not the other who utters incantations.",
    "an3.58:13": "\"It is in this way, brahmin, that one is a master of the threefold knowledge in the Noble One's discipline..",
    "an3.58:14": "\"Excellent, Master Gotama! … Let Master Gotama consider me a lay follower who from today has gone for refuge for life.\""
}