{
    "an3.30:1": "\"Bhikkhus, there are these three kinds of persons found existing in the world. What three? The person with inverted wisdom, the person with lap-like wisdom, and the person with wide wisdom.",
    "an3.30:2": "() \"And what is the person with lap-like wisdom? Here, some person often goes to the monastery to listen to the Dhamma from the bhikkhus. The bhikkhus teach him the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; they reveal the perfectly complete and pure spiritual life. While he is sitting in his seat, he attends to that talk at the beginning, in the middle, and at the end. But after he has risen from his seat, he does not attend to that talk at the beginning, in the middle, or at the end. Just as, when a person has various food stuffs strewn over his lap—sesamum seeds, rice grains, cakes, and jujubes—if he loses his mindfulness when rising from that seat,he would scatter them all over, so too, some person often goes to the monastery to listen to the Dhamma from the bhikkhus …. But after he has risen from his seat, he does not attend to that talk at the beginning, in the middle, or at the end. This is called the person with lap-like wisdom.",
    "an3.30:3": "() \"And what is the person with wide wisdom? Here, some person often goes to the monastery to listen to the Dhamma from the bhikkhus. The bhikkhus teach him the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; they reveal the perfectly complete and pure spiritual life. While he is sitting in his seat, he attends to that talk at the beginning, in the middle, and at the end. After he has risen from his seat, again he attends to that talk at the beginning, in the middle, and at the end. Just as, when a pot is kept upright, the water that had been poured into it stays there and does not run off, so too, some person often goes to the monastery to listen to the Dhamma from the bhikkhus …. After he has risen from his seat, again he attends to that talk at the beginning, in the middle, and at the end. This is called the person with wide wisdom.",
    "an3.30:4": "The person with inverted wisdom,stupid and undiscerning,often goes to visit bhikkhusto hear them teach the Dhamma.",
    "an3.30:5": "Yet this person cannot graspanything from the talk,at its beginning, middle, and end,for he utterly lacks wisdom.",
    "an3.30:6": "The person with lap-like wisdomis said to be better than the former.He too often goes to visit bhikkhusto hear them teach the Dhamma.",
    "an3.30:7": "While sitting in his seat,he grasps the phrasing of the talk,at its beginning, middle, and end.But after rising, he no longer understands,but forgets what he had learned.",
    "an3.30:8": "The person with wide wisdomis said to be the best of these.He too often goes to visit bhikkhusto hear them teach the Dhamma.",
    "an3.30:9": "While sitting in his seat,he comprehends the phrasing,at the beginning, middle, and endof the talkgiven by the bhikkhu.",
    "an3.30:10": "This person of the best intentions,his mind undivided, retainswhat he hears.Practicing in accordance with the Dhamma,he can make an end of suffering."
}