{
    "an3.183:1": "\"Bhikkhus, for direct knowledge of lust, three things[n.66] With Be and Ee, I read simplytayo dhammārather thanime tayo dhammāwith Ce.are to be developed. What three? Emptiness concentration, markless concentration, and wishless concentration.[n.67]Suññato samādhi, animitto samādhi, appaṇihito samādhi.Mpsays only that \"insight is explained by means of them(tīhipi samādhīhi vipasssanā va kathitā).\" The three are mentioned as a set atDN III 29,2–22, again without explanation, but Sv III 003–4 comments: \"The explanation is threefold, by way of arrival(āgamanato), by way of quality(saguṇato), and by way of object(ārammaṇato). ()By way of arrival, (i) one bhikkhu interprets in terms of non-self, sees in terms of non-self, and reaches the path by (contemplation of) non-self; for him, insight is called ‘emptiness.’ Why? Because of the absence of the defilements responsible for (the idea of) self or non-emptiness. The concentration of the path(maggasamādhi), being reached by insight, is called emptiness; and the concentration of the fruit(phalasamādhi), being reached by the path, is also called emptiness. (ii) Another interprets in terms of impermanence, sees in terms of impermanence, and reaches the path by (contemplation of) impermanence; for him, insight is called ‘mark-less.’ Why? Because of the absence of the defilements responsible for marks. The concentration of the path, being reached by insight, is called mark-less; and the concentration of the fruit, being reached by this path, is also called markless. (iii) Another interprets in terms of suffering, sees in terms of suffering, and reaches the path by (contemplation of) suffering; for him, insight is called ‘wishless.’ Why? Because of the absence of the defilements responsible for wishes. The concentration of the path, being reached by insight, is called wishless; and the concentration of the fruit, being reached by this path, is also called wishless. (2)By way of quality: The concentration of the path is empty because it is empty of lust, etc.; it is mark-less, because the marks of lust, etc., are absent; and it is wishless because wishes caused by lust, etc., are absent. (3)By way of object: Nibbāna is emptiness because it is empty of lust, etc.; it is markless and wishless, because it is without the marks of lust, etc., and without wishes caused by lust, etc.\" Vism 657,3–259,0, Ppn 2.66–73, discusses the three \"gateways to liberation\"(vimuttimukha)under the same three names.For direct knowledge of lust, these three things are to be developed.\""
}