{
    "an3.14:1": "\"Bhikkhus, even a wheel-turning monarch, a righteous king who rules by the Dhamma, does not turn the wheel without a king above him..",
    "an3.14:2": "Again, a wheel-turning monarch, a righteous king who rules by the Dhamma, relying just on the Dhamma, honoring, respecting, and venerating the Dhamma, taking the Dhamma as his standard, banner, and authority, provides righteous protection, shelter, and guard for his khattiya vassals, his army,brahmins and householders, the people of town and countryside, ascetics and brahmins, and the animals and birds. Having provided such righteous protection, shelter, and guard for all these beings, that wheel-turning monarch, a righteous king who rules by the Dhamma, turns the wheel solely through the Dhamma,[n.347]Mp:\"He sets in motion the wheel just by means of the Dhamma of the ten courses of wholesome kamma.\" Ce and Be read the verb here asvatteti, but below, in relation to the Buddha, aspavatteti; Ee haspavattetiin relation to both. Ifvattetiis the original reading, the change in verbs may be intended to suggest that a wheel-turning monarch does not initiate the rule of righteousness but continues the heritage of his forefathers, whereas a Buddha sets in motion the wheel of Dhamma previously unknown.a wheel that cannot be turned back by any hostile human being.[n.348]Kenaci manussabhūtena paccatthikena pāṇinā. Lit. \"by any hostile living being that has become human.\"Mp:\"The deities, it is said, can do whatever they want. Therefore they are not included, but ‘human being’ is mentioned.\" This is in contrast with the Buddha, whose wheel cannot be turned back by any beings including the deities.",
    "an3.14:3": "(1) \"So too, bhikkhu, the Tathāgata, the Arahant, the Perfectly Enlightened One, the righteous king of the Dhamma, relying just on the Dhamma, honoring, respecting, and venerating the Dhamma, taking the Dhamma as his standard, banner, and authority, provides righteous protection, shelter, and guard in regard to bodily action, saying: ‘Such bodily action should be cultivated; such bodily action should not be cultivated.’",
    "an3.14:4": "(2) \"Again, the Tathāgata, the Arahant, the Perfectly Enlightened One, the righteous king of the Dhamma, relying just on the Dhamma, honoring, respecting, and venerating the Dhamma, taking the Dhamma as his standard, banner, and authority, provides righteous protection, shelter, and guard in regard to verbal action, saying: ‘Such verbal action should be cultivated; such verbal action should not be cultivated..",
    "an3.14:5": "\"Having provided such righteous protection, shelter, and guard in regard to bodily action, verbal action, and mental action, the Tathāgata, the Arahant, the Perfectly Enlightened One, the righteous king of the Dhamma, sets in motion the unsurpassed wheel of the Dhamma solely through the Dhamma, a wheel that cannot be turned back by any ascetic, brahmin, deva, Māra, or Brahmā, or by anyone in the world.\""
}