{
    "an3.67:1": "\"Bhikkhus, there are these three bases of talk. What three? () Referring to the past, one would say: ‘So it was in the past.’ (2) Referring to the future, one would say: ‘So it will be in the future.’ (3) Referring to the present, one would say: ‘So it is now, at present.’",
    "an3.67:2": "\"It is in relation to talk, bhikkhus, that a person may be understood as either fit to talk or unfit to talk. If this person is asked a question that should be answered categorically and he does not answer it categorically;if he is askeda question that should be answered after making a distinction and he answers it without making a distinction;if he is askeda question that should be answered with a counter-question and he answers it without asking a counter-question;if he is askeda question that should be set aside and he does not set it aside, in such a case this person is unfit to talk.[n.464] These are the four methods of formulating questions; seeAN4.4.Mp:\"(1) Aquestion that should be answered categorically(ekaṁsavyākaṇanīya pañha)is, for example, ‘Is the eye impermanent?’ which should be answered categorically with ‘Yes, it is impermanent.’ () Aquestion that should be answered after making a distinction(vibhajjavyākaraṇīya pañha)is, for example, ‘Is the impermanent the eye?’ which should be answered by making a distinction: ‘Not only the eye, but the ear, nose, etc., are also impermanent.’ (3) A question that should be answered with a counter-question(paṭipucchāvyākaraṇīya pañha)is, for example, ‘Does the eye have the same nature as the ear?’ One should answer this by asking, ‘With respect to what?’ If they reply, ‘With respect to seeing,’ one should answer no. If they reply, ‘With respect to impermanence,’ one should answer yes. (4) A question that should be set aside(ṭhapanīya pañha)is, for example, ‘Is the soul the same as the body?’ This should be set aside without answering it, saying, ‘This has not been declared by the Tathāgata.’\" In my opinion, better examples of \"a question that should be answered after making a distinction\" are the Buddha’s response to Subha atMN 99.4, II 197,9–18; his response to the brahmin Ujjaya atAN4.39, II 4,14–8; and the householder Vajjiyamāhita's response to the wanderers atAN10.94, V 190,14–0.",
    "an3.67:3": "\"It is in relation to talk, bhikkhus, that a person should be understood as either fit to talk or unfit to talk. If this person is asked a question and he does not stand firm in regard to his position and the opposing position; if he does not stand firm in his stratagem; if he does notstand firm in an assertion about what is known; if he does not stand firm in the procedure, in such a case this person is unfit to talk.[n.465] \"He does not stand firm in the procedure(paṭipadāya na saṇṭhāti): Not having understood the rule(vattaṁ ajānitvā), he asks under circumstances when a question should not be asked. If a question is asked in the courtyard of a memorial shrine(cetiyangana), one should not answer it. So too,one should not answeron the way to the alms round; when walking for alms in the village; when sitting in the meeting hall; when sitting and taking porridge or a meal; when sitting after the meal; and when going to the place where one passes the day. However, when one is sitting in one's day quarters, if someone asks permission and then poses a question, it should be answered; but one should not answer if they do not ask permission. Such is what is meant by: ‘Asking a question without having understood the rule, he does not stand firm in the procedure.’\"",
    "an3.67:4": "\"It is in relation to talk, bhikkhus, that a person should be understood as either fit to talk or unfit to talk. If this person is asked a question and he answers evasively, diverts the discussion to an irrelevant subject, and displays anger, hatred, and bitterness, in such a case this person is unfit to talk.",
    "an3.67:5": "\"It is in relation to talk, bhikkhus, that a person should be understood as either fit to talk or unfit to talk. If this person is asked a question and he overwhelmsthe questioner, crushes him, ridicules him, and seizes upon a slight error,[n.466] That is, he seizes upon a slight mistake on the other's part as a pretext for criticizing him.in such a case this person is unfit to talk.",
    "an3.67:6": "\"It is in relation to talk, bhikkhus, that a person should be understood as either having a supporting condition or not having a supporting condition. One who does not lend an ear does not have a supporting condition; one who lends an ear has a supporting condition. One who has a supporting condition directly knows one thing, fully understands one thing, abandons one thing, and realizes one thing. Directly knowing one thing, fully understanding one thing, abandoning one thing, and realizing one thing, he reaches right liberation.[n.47]Mp:\"He directly knows one thing, a wholesome Dhamma, the noble path. He fully understands one thing, the truth of suffering. He abandons one thing, all unwholesome qualities. He realizes one thing, the fruit of arahantship orthe truth ofcessation. By means of knowledge he reaches right liberation, emancipation by the fruit of arahantship.\"",
    "an3.67:7": "Those who speak with quarrelsome intent,settled in their opinions, swollen with pride,ignoble, having assailed virtues,[n.468]Anariyaguṇam āsajja. The line is problematic. As printed, it would be translated: \"Having attacked ignoble qualities.\" Butguṇausually means virtuous qualities.Mpgives an unconvincing explanation: \"They give a talk using ignoble qualities to attack qualities.\" I translate on the supposition that the correct reading of the line should beanariyā guṇam āsajja, \"the ignoble ones assail (good) qualities.\" A Chinese parallel, MĀ 119 at T I 609a8–b29, closely matches the Pāli in regard to the verses, and the corresponding line (609b15) accords with my interpretation:(\"ignoble, they criticize (each others’) virtues\").look for openingsto attackone another.",
    "an3.67:8": "They mutually delight when their opponentspeaks badly and makes a mistake,they rejoicein his bewilderment and defeat;but noble ones don’t engage in such talk.",
    "an3.67:9": "If a wise person wants to talk,having known the time is right,without quarrelsomeness or pride,the sagely person should utterthe speech that the noble ones practice,which is connected with the Dhamma and meaning.[n.46]Dhammaṭṭhapaṭisaṁyuttā yā ariyācaritā kathā.Mpexplainsdhammaṭṭhapaṭisaṁyuttāthus: \"The talk is made by one established in the Dhamma, thus it is established in the Dhamma; and (the talk) is connected with the Dhamma, so it is established in and connected with the Dhamma.\" Mp thus takesdhammaṭṭhato be a compound ofdhamme ṭhita. I translate, however, on the assumption thatdhammaṭṭhapaṭisaṁyuttācontains advandacompound that should be resolveddhammena ca aṭṭhena ca paṭisaṁyuttā. In explanations of right speech, it is often said that the virtuous person isatthavādī dhammavādī, \"one who speaks what is beneficial (or ‘meaningful’), one who speaks on the Dhamma\"; seeAN3.6, I 204,4;AN10.176§7, V 267,22. It is unusual—but not exceptional—to findaṭṭhain place ofatthawith the sense of \"meaning\" or \"benefit\"; it would be more unusual to find the terminationṭhaembedded inside a compound and followed by a past participle. The Chinese parallel, which I discovered only after I had made my translation, supports my understanding here. At T I 60b1we read:\"talk that has Dhamma and that has meaning: all the talk of the noble ones is like this.\" The character, like Pāliattha, means both \"good\" and \"meaning,\" andcan mean either \"beneficial\" or \"meaningful.\"",
    "an3.67:10": "Not being insolent or aggressive,with a mind not elated,[n.470] I read here with Beanunnatena manasā, as against Ce and Eeanupādinnena manasā.Mp(both Ce and Be) glosses withanuddhatena cetasā, which supportsanunnatena manasā.he speaks free from envyon the basis of right knowledge.He should approve of what is well expressedbut should not attack what is badly stated.",
    "an3.67:12-13": "He should not train in faultfindingnor seize on the other's mistakes;he should not overwhelm and crush his opponent,nor speak mendacious words.Truly, a discussion among the goodis for the sake of knowledge and confidence.",
    "an3.67:13": "Such is the way the noble discuss things;this is the discussion of the noble ones.Having understood this, the wise personshould not swell up but should discuss things."
}