{
    "an3.99:1": "\"Bhikkhus, when it is new, cloth made of bark fabric[n.54] I translatepotthakobased onMp'sglossvākamayavatthaṁ.is ugly, uncomfortable, and of little value. When it has been worn,[n.542] Text usesmajjhimo, lit. \"of middle age.\"cloth made of bark fabric is ugly, uncomfortable, and of little value. When it is old, cloth made of bark fabric is still ugly, uncomfortable, and of little value. They use old cloth made of bark fabric for cleaning pots or they discard it on a rubbish heap.",
    "an3.99:2": "(1) (i)[n.543] There are two triads in this sutta. Both the immoral and the virtuous monk are distinguished into the junior, the one of middle standing, and the elder, and this distinction forms a triad. Yet under each type, three statements are made—about the monk himself, his effect on those who associate with him, and the merit gained by gifts to him—which also constitute a triad. I indicate the major triad with Arabic numerals and the minor one with small Roman numerals.\"So too, bhikkhus, if a junior bhikkhu is immoral, of bad character, this, I say, counts as his ugliness.Just as cloth made of bark fabric is ugly, so, I say, this person is similar.",
    "an3.99:3": "\"If such an elder bhikkhu speaks in the midst of the Saṅgha, the bhikkhus say to him: ‘What gives you, an incompetent fool, the right to speak? Do you think you too are entitled to speak?’ He then becomes angry and displeased and utters speech on account of which the Saṅgha expels him, as ifdiscardingthe clothing made of bark fabric on the rubbish heap.[n.544] InEe, this sentence marks the end of this sutta and the next paragraph the beginning of a new one. I follow Ce and Be, which treat the passage on the cloth from Kāsi as a continuation of the same sutta. My numbering will now exceed that of Ee by one.",
    "an3.99:4": "\"When it is new, bhikkhus, cloth from Kāsi is beautiful, comfortable, and of great value. When it has been worn,cloth from Kāsi is beautiful, comfortable, and of great value. When it is old, cloth from Kāsi is beautiful, comfortable, and of great value. They use old cloth from Kāsi as a wrapping for gems or they deposit it in a fragrant casket.",
    "an3.99:5": "(1) (i) \"So too, if a junior bhikkhu is virtuous, of good character, this, I say, counts as his beauty. Just as cloth from Kāsi is beautiful, so, I say, this person is similar.ii\"For those who associate with him, resort to him, attend on him, and follow his example, this leads to their welfare and happiness for a long time. This, I say, counts as his comfortableness. Just as cloth from Kāsi is comfortable, so, I say, this person is similar.iii\"When he accepts a robe, almsfood, lodging, and medicines and provisions for the sick, thisacceptanceis of great fruit and benefit for thosewho offer such things. This, I say, counts as his being of great value. Just as cloth from Kāsi is of great value, so, I say, this person is similar.",
    "an3.99:6": "\"If such an elder bhikkhu speaks in the midst of the Saṅgha,the bhikkhus say: ‘Please let the venerable ones be quiet. An elder bhikkhu is speaking on the Dhamma and the discipline.’ Those words of his should be preserved, just as they deposit a cloth from Kāsi in a fragrant casket.[n.545]Tassa taṁ vacanaṁ ādheyyaṁ gacchati gandhakaraṇḍake va naṁ kāsikavatthaṁ nikkhipanti. This last sentence is included in Ee, in brackets, but not in Ce or Be. However, Pp 34,37–35,1, ontayo kāsikavatthūpamā puggalā, includes this sentence (but withoutnikkhipanti). I include it because the simile is a fitting counterpart to the one just above about expelling an immoral elder."
}