{
    "an3.39:1": "\"Bhikkhus, I was delicately nurtured, most delicately nurtured, extremely delicately nurtured. At my father's residence lotus ponds were made just for my enjoyment: in one of them blue lotuses bloomed, in another red lotuses, and in a third white lotuses.[n.389]Mpdefinespadumaas a white lotus(paṇḍarapadumaṁ)andpuṇḍarīkaas a red lotus(rattapadumaṁ). SED, however, definespuṇḍarīkaas \"a lotus flower (esp. a white lotus),\" adding that the word is used to mean \"white\" in general. Numerous websites I consulted also definepuṇḍarīkaas a white lotus.I used no sandalwood unless it came from Kāsi and my headdress, jacket, lower garment, and upper garment were made of cloth from Kāsi.[n.390] Kāsi was one of the sixteen great states of India, with its capital at Bārāṇasī.By day and by night a white canopy was held over me so that cold and heat, dust, grass, and dew would not settle on me.",
    "an3.39:2": "\"I had three mansions: one for the winter, one for the summer, and one for the rainy season.[n.391] These are the three seasons of northern India: the winter lasts roughly from November to March, the hot season from March to July, and the rainy season from July to November.Mpsays that the winter mansion had nine stories, which were low in order to retain heat; the summer mansion had five stories, which were high in order to allow the air to cool; and the rains mansion had seven stories, which were neither high nor low in order to establish a medium temperature.I spent the four months of the rains in the rainy-season mansion, being entertained by musicians, none of whom were male,[n.39]Nippurisehi.Mpsays that not only the musicians but all the posts in the palaces were occupied by women(itthiyo). Thus for four months another man did not get to see him.and I did not leave the mansion. While in other people's homes slaves, workers, and servants are given broken rice together with sour gruel for their meals, in my father's residence they were given choice hill rice, meat, and boiled rice.",
    "an3.39:3": "(1) \"Amid such splendor and a delicate life, it occurred to me: ‘An uninstructed worldling, though himself subject to old age, not exempt from old age, feels repelled, humiliated, and disgusted when he sees another who is old, overlooking his own situation.[n.9]Attānaṁyeva atisitvā.Atisitvāis absolutive ofatisarati. SeeDOPsvatisarati.Now I too am subject to old age and am not exempt from old age. Such being the case, if I were to feel repelled, humiliated,and disgusted when seeing another who is old, that would not be proper for me.’ When I reflected thus, my intoxication with youth was completely abandoned.",
    "an3.39:4": "(2) \"Again, it occurred to me:‘An uninstructed worldling, though himself subject to illness, not exempt from illness, feels repelled, humiliated, and disgusted when he sees another who is ill, overlooking his own situation. Now I too am subject to illness and am not exempt from illness. Such being the case, if I were to feel repelled, humiliated, and disgusted when seeing another who is ill, that would not be proper for me.’ When I reflected thus, my intoxication with health was completely abandoned.",
    "an3.39:5": "(3) \"Again, it occurred to me:‘An uninstructed worldling, though himself subject to death, not exempt from death, feels repelled, humiliated, and disgusted when he sees another who has died, overlooking his own situation. Now I too am subject to death and am not exempt from death. Such being the case, if I were to feel repelled, humiliated, and disgusted when seeing another who has died, that would not be proper for me.’ When I reflected thus, my intoxication with life was completely abandoned.",
    "an3.39:6": "\"There are, bhikkhus, these three kinds of intoxication.[n.394]Eetakes this sentence to mark the beginning of a new sutta,AN3.39in its numbering. But Ce and Be, which I follow, treat this passage as a continuation of the sutta that began with the Buddha’s recollection of his delicate upbringing. In Ce and Be, this entire sutta isAN3.39, so that at this point the numbering in all three editions coincides.What three? Intoxication with youth, intoxication with health, and intoxication with life. (1) An uninstructed worldling, intoxicated with youth, engages in misconduct by body, speech, and mind. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell. (2) An uninstructed worldling, intoxicated with health, engages in misconduct by body, speech, and mind. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell. (3) An uninstructed worldling, intoxicated with life, engages in misconduct by body,speech, and mind. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an3.39:7": "\"Intoxicated with youth, a bhikkhu gives up the training and reverts to the lower life; or intoxicated with health, he gives up the training and reverts to the lower life; or intoxicated with life, he gives up the training and reverts to the lower life.",
    "an3.39:8": "\"Worldlings subject to illness,old age, and death, are disgustedby other peoplewho existin accordance with their nature.[n.395] The third pāda is obscure:yathā dhammā tathā santā. I translate it literally. In explaining the fourth pāda,Mpaddsparapuggalaṁas an object of the verbjigucchanti.",
    "an3.39:9": "\"If I were to become disgustedwith beings who have such a nature,that would not be proper for mesince I too have the same nature.",
    "an3.39:10": "\"While I was dwelling thus,having known the state without acquisitions,I overcame all intoxications—intoxication with health,",
    "an3.39:11": "with youth, and with life—having seen security in renunciation.[n.396] Ce and Be readnekkhamme daṭṭhu khemataṁ. Ee hasnekkhammaṁ daṭṭhu khematoas its primary reading but mentions the Ce and Be variants in its notes.Mp(both Ce and Be) uses the Ce and Be reading as the lemma, which it glossesnibbāne khemabhāvaṁ disvā, but it then cites the Ee reading as a variant, glossednibbānaṁ khemato disvā. Thus here Ee has chosen the variant as the primary reading.\"Zeal then arose in meas I clearly saw nibbāna.",
    "an3.39:12": "Now I am incapableof indulging in sensual pleasures.Relying on the spiritual life,never will I turn back.\"[n.397]Mpsays that these verses refer to his own energy as it arose while he was sitting beneath the bodhi tree."
}