{
    "an3.22:1": "\"Bhikkhus, there are these three kinds of patients found existing in the world. What three? () Here, one patient will not recover from his illness whether or not he gets suitable food, suitable medicine,and a competent attendant.",
    "an3.22:2": "() Another patient will recover from his illness whether or not he gets suitable food, suitable medicine, and a competent attendant.",
    "an3.22:3": "() Still another patient will recover from his illness only if he gets suitable food, not if he fails to get it; only if he gets suitable medicine, not if he fails to get it; and only if he gets a competent attendant, not if he fails to get one.",
    "an3.22:4": "\"Food and medicine and a competent attendant are prescribed particularly for the sake of the patient who will recover from his illness only if he gets suitable food, not if he fails to get it; only if he gets suitable medicine, not if he fails to get it; and only if he gets a competent attendant, not if he fails to get one. But because of this patient, the other patients should also be served. These are the three kinds of patients found existing in the world.",
    "an3.22:5": "\"So too, bhikkhus, there are these three kinds of persons similar to patients found existing in the world. What three? (1) Here, some person will not enter upon the fixed courseconsisting inrightness in wholesome qualities whether or not he gets to see the Tathāgata and whether or not he gets to hear the Dhamma and discipline proclaimed by the Tathāgata.[n.38]Okkamati niyāmaṁ kusalesu dhammesu sammattaṁ. This is a technical expression denoting entry upon the world-transcending path.Mp:\"The fixed course[consisting in]rightness in wholesome qualities: rightness in wholesome qualities consisting in entry upon the path.\" Though \"rightness in wholesome qualities\" sounds redundant, what is intended is the harmony and strength of the wholesome qualities needed to enter the path of stream-entry. For more on this expression in AN, seeAN.11–3 andAN6.86–88. See tooSN 2.1–10, III 22–28, which says that by entering the \"fixed course of rightness\"(sammattaniyāma)one enters the noble plane and becomes either adhammānusārīor asaddhānusārī.",
    "an3.22:6": "(2) Then another person will enter upon the fixed courseconsisting inrightness in wholesome qualities whether or not he gets to see the Tathāgata and whether or not he gets to hear the Dhamma and discipline proclaimed by the Tathāgata.",
    "an3.22:7": "(3) And still another person will enter upon the fixed courseconsisting inrightness in wholesome qualities only if he gets to see the Tathāgata, not if he fails to see him; only if he gets to hear the Dhamma and discipline proclaimed by the Tathāgata, not if he fails to hear it.",
    "an3.22:8": "\"The teaching of the Dhamma is prescribed particularly for the sake of the person who will enter upon the fixed courseconsisting inrightness in wholesome qualities only if he gets to see the Tathāgata, not if he fails to see him; only if he gets to hear the Dhamma and discipline proclaimed by the Tathāgata, not if he fails to hear it. But because of this person, the Dhamma should also be taught to the others. These are the three kinds of persons similar to patients found existing in the world.\""
}