{
    "an3.128:1": "On one occasion the Blessed One was dwelling in Bārāṇasī at the deer park in Isipatana. Then, in the morning, the Blessed One dressed, took his bowl and robe, and entered Bārāṇasī for alms.While walking for alms near the cattle-yoking fig tree,[n.592]Goyogapilakkhasmiṁ.Mp:\"Near the fig tree that had grown up at the place for selling cattle.\" PED explainspilakkhaas a wavy-leaved fig tree.the Blessed One saw a dissatisfied bhikkhu,seekinggratification outwardly,[n.593]Rittassādaṁ bāhirassādaṁ.Mp:\"Dissatisfied: lacking the pleasure of the jhānas. [Seeking]gratification outwardly: the gratification of sensual pleasure.\" The Chinese parallel, SĀ 08 (T II 283a20– 283b26) says (at 283a23) that \"he had given rise to an unwholesome thought connected with evil craving\" ().muddle-minded, without clear comprehension, unconcentrated, with a wandering mind and loose sense faculties. Having seen him, he said to that bhikkhu:",
    "an3.128:2": "\"Bhikkhu, bhikkhu! Do not pollute yourself.[n.594]Mā kho tvaṁ attānaṁ kaṭuviyam akāsi.Mpglosseskaṭuviyaṁsimply asucchiṭṭhaṁ, \"left over\" food, without further explanation. DOP defines the word as \"what isleft over; (what is) polluted, impure.\"It is inevitable, bhikkhu, that flies will pursue and attack one who has polluted himself and been tainted by a stench.\"[n.595] Beāmagandhena; Ce and Eeāmagandhe. See Āmagandha-sutta,Sn 39–5.Mp:\"The foul odour consisting in anger.\"",
    "an3.128:3": "\"Bhikkhus, this morning I dressed, took my bowl and robe, and entered Bārāṇasī for alms. While walking for alms near the cattle-yoking fig tree, I saw a dissatisfied bhikkhuseekinggratification outwardly, muddle-minded, without clear comprehension, unconcentrated, with a wandering mind and loose sense faculties. Having seen him, I said to that bhikkhu:",
    "an3.128:4": "‘Bhikkhu, bhikkhu! Do not pollute yourself. It is inevitable, bhikkhu, that flies will pursue and attack one who has polluted himself and been tainted by a stench.’ Then, being exhorted thus by me, that bhikkhu acquired a sense of urgency.\"",
    "an3.128:5": "(1) \"Longing, bhikkhu, is what is meant by ‘pollution.’ (2) Ill will is the ‘stench.’ (3) Bad unwholesome thoughts are the ‘flies.’ It is inevitable that flies will pursue and attack one who has polluted himself and been tainted by a stench.\"",
    "an3.128:6": "The flies—thoughts based on lust—will run in pursuit of oneunrestrained in the sense faculties,unguarded in the eye and ear.",
    "an3.128:7": "A bhikkhu who is polluted,tainted by a stench,is far from nibbānaand reaps only distress.",
    "an3.128:8": "Whether in the village or the forest,the unwise foolish person,not having gained peace for himself,goes around followed by flies.[n.597]Cereads pāda baladdhā samamattano; Bealaddhā samathamattano; Eesammamattano. I prefer the Ce reading. All three editions read the verb in pāda c aspareti, whichMpglosses withgacchati.",
    "an3.128:9": "But those accomplished in virtuous behaviorwho delight in wisdom and peace,those peaceful ones live happily,having destroyed the flies.[n.58]Nāsayitvāna makkhikā. The absolutive is from the verbnāseti, \"to destroy.\""
}