{
    "an3.13:1": "\"Bhikkhus, there are these three kinds of persons found existing in the world. What three? The one without expectation, the one full of expectation, and the one who has overcome expectation.",
    "an3.13:2": "() \"And what is the person full of expectation?Here, the eldest son of a head-anointed khattiya king, one due to be anointed but not yet anointed, has attained the unshaken.[n.345] Ce readsmacalappatto; Ee–macalapatto; Beacalappatto. InAN4.87§1 we findsamaṇamacalo, on which seeAN4.87, n. 778. HereMpexplains: \"When the eldest—one due to be anointed but not yet anointed—is still an infant, he does not form any wish to be anointed. But when he reaches the age of sixteen and his beard begins to grow, he is called ‘one who has attained the unshaken.’ He is able to reign over a large realm, therefore (the Buddha) says ‘one who has attained the unshaken.’\"He hears: ‘The khattiyas have anointed such and such a khattiya.’ It occurs to him: ‘When will the khattiyas anoint me too?’ This is called the person full of expectation.",
    "an3.13:3": "() \"And what is the person who has overcome expectation? Here, a head-anointed khattiya king hears: ‘Such and such a khattiya has been anointed by the khattiyas.’ It does not occur to him: ‘When will the khattiyas anoint me too?’ For what reason? Because his past expectation of anointment subsided when he was anointed. This is called the person who has overcome expectation.",
    "an3.13:4": "\"So too, bhikkhus, there are three kinds of persons found existing among the bhikkhus. What three? The one without expectation, the one full of expectation, and the one who has overcome expectation.",
    "an3.13:5": "(2) \"And what is the person full of expectation? Here, a bhikkhu is virtuous, of good character. Hehears: ‘Such and such a bhikkhu, with the destruction of the taints, has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it.’ It occurs to him: ‘When will I, too, with the destruction of the taints, realize for myself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwell in it?’ This is called the person full of expectation.",
    "an3.13:6": "(3) \"And what is the person who has overcome expectation? Here, a bhikkhu is an arahant, one whose taints are destroyed. He hears: ‘Such and such a bhikkhu, with the destruction of the taints, has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it.’ It does not occur to him: ‘When will I, too, with the destruction of the taints, realize for myself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwell in it?’ For what reason? Because his past expectation of liberation subsided when he was liberated. This is called the person who has overcome expectation."
}