{
    "an3.125:1": "On one occasion the Blessed One was dwelling at Vesālī at the Gotamaka Shrine.[n.586]Mp:\"In the first twenty years after the enlightenment, the Tathāgata often stayed among the deva communities(devakulesuyeva): sometimes at the Cāpāla Shrine, sometimes at the Sārandada, sometimes at the Bahuputta, and sometimes at the Gotamaka. Since he was living at Vesālī at this time, he stayed at the abode of the Gotamaka spirit.\"Mpexplains that this sutta was spoken as a sequel to the Mūlapariyāya Sutta (MN). The background story, told in the commentary, relates that a group of brahmins had taken ordination under the Buddha and quickly mastered his teachings. Filled with pride on account of their learning, they no longer went to listen to the Dhamma. The Buddha spoke the Mūlapariyāya Sutta to cut down their pride. Unable to understand it, they were humbled and apologized to the Buddha. Sometime later the Buddha spoke this Gotamaka Sutta to guide them to arahantship.There the Blessed One addressed the bhikkhus …",
    "an3.125:2": "\"Bhikkhus, (1) I teach the Dhamma through direct knowledge, not without direct knowledge. () I teach the Dhamma with a basis, not without a basis. (3) I teach the Dhamma that is antidotal, not one without antidotes.[n.587] The termsappāṭihāriyais problematic. Elsewherepāṭihāryais used in the sense of a wonder or miracle, as inAN3.60which speaks of the three \"wonders\": of psychic potency, thought-reading, and instruction. PED, svpāṭihārya, seessappāṭihāriyaas derived from this usage and suggests, in contexts related to the Dhamma, \"wonderful, extraordinary, sublime.\" I find it hard, however, to agree that such a meaning is intended in this context. The verbpaṭiharatimeans \"to strike back,\" and the causativepaṭihāreti\"to repel, to avoid.\" I believe that this sense is relevant both to its use here and in relation to miracles. A miracle \"strikes against\" the mind's fixed conceptual premises and opens it to the reality of the wondrous. But the Dhamma strikes in a different way. It \"strikes against\" distorted views and defilements, and thus it is counteractive or antidotal. This interpretation is supported byAN8.70(IV 310–11), where the Buddha states that his disciples \"can thoroughly refute in reasoned ways the current tenets of others and teach thesappāṭihāriyaDhamma\"(uppannaṁ parappavādaṁ sahadhammena suniggahitaṁ niggahetvā sappāṭihāriyaṁ dhammaṁ desessanti). Here thesappāṭihāriyacharacter of the Dhamma must be related, not to miracles, but to its ability to counteract opposed tenets. Thus \"antidotal\" or \"counteractive\" would render the sense well.Since I teach the Dhamma through direct knowledge, not without direct knowledge; since I teach the Dhamma with a basis, not without a basis; since I teach the Dhamma that is antidotal, not one without antidotes, my exhortation should be acted upon, my instructions should be acted upon. It is enough for you to rejoice, enough for you to be elated, enough for you to be joyful: ‘The Blessed One is perfectly enlightened! The Dhamma is well expounded by the Blessed One! The Saṅgha is practicing the good path!’\"",
    "an3.125:3": "This is what the Blessed One said. Elated, those bhikkhus delighted in the Blessed One's statement. And while this discourse was being spoken, the thousandfold world system shook."
}