{
    "an3.64:1": "On one occasion the Blessed One was dwelling at Rājagaha on Mount Vulture Peak. Now on that occasion a wanderer named Sarabha had recently left this Dhamma and discipline.[n.446]Mpexplains that he had been commissioned by the wanderers in his own community to take ordination with the bhikkhus, learn the secret of their success (which they believed to be a kind of magic they used to attract followers), and then return and share it with them. After his ordination he concluded that the Pāṭimokkha was the key to their success. Having learned the Pāṭimokkha, he returned to the wanderers and reported that he had learned the Dhamma of the Buddha’s followers. The background story is similar to that of the Susīma Sutta (SN2:70, II 9–28) but has a different outcome.He had been telling an assembly in Rājagaha: \"I have learned the Dhamma of the ascetics who follow the Sakyan son. After I learned their Dhamma, I left that Dhamma and discipline..",
    "an3.64:2": "When those bhikkhus had walked for alms in Rājagaha, after their meal, when they returned from their alms round, they approached the Blessed One, paid homage to him, sat down to one side, and said to him.",
    "an3.64:3": "Then, in the evening, the Blessed One emerged from seclusion and went to the wanderers’ park on the bank of the Sappinikā (river). He approached the wanderer Sarabha, sat down on the seat that was preparedfor him, and said to him: \"Is it true, Sarabha, that you have been saying: ‘I have learned the Dhamma of the ascetics who follow the Sakyan son. After I learned their Dhamma, I left that Dhamma and discipline’?\" When this was said, the wanderer Sarabha was silent.",
    "an3.64:4": "A second time the Blessed One said to the wanderer Sarabha: \"Tell me, Sarabha, how have you learned the Dhamma of the ascetics who follow the Sakyan son? If you have not learned it completely, I will complete it. But if you have learned it completely, I will rejoice.\" But a second time the wanderer Sarabha was silent.",
    "an3.64:5": "A third time the Blessed One said to the wanderer Sarabha:[n.447]Eehas an additional line here:mayā kho Sarabha paññāyati samaṇānaṁ Sakyaputtiyānaṁ dhammo: \"Sarabha, the Dhamma of the ascetics who follow the Sakyan son has been seen by me.\" Be has a variant on this line in parentheses but Ce does not have anything corresponding to it.\"Tell me, Sarabha, how have you learned the Dhamma of the ascetics who follow the Sakyan son? If you have not learned it completely, I will complete it. But if you have learned it completely, I will rejoice.\" But a third time the wanderer Sarabha was silent.[n.448] AtMN 3.11, I 231,27–28, 32–3, it is said: \"If anyone, when asked a reasonable question up to the third time by the Tathāgata, still does not answer, his head splits into seven pieces then and there.\" Here, however, Sarabha fails to answer the Buddha’s question after it has been posed three times, yet his head remains intact and no threat is raised against him.",
    "an3.64:6": "Then those wanderers said to the wanderer Sarabha: \"The ascetic Gotama has offered to give you whatever you might ask him for, friend Sarabha. Speak, friend Sarabha! How have you learned the Dhamma of the ascetics who follow the Sakyan son? If you have not learned it completely, the ascetic Gotama will complete it for you. But if you have learned it completely, he will rejoice.\" When this was said, the wanderer Sarabha sat silenced, disconcerted, hunched over, downcast, glum, and speechless.",
    "an3.64:7": "Then the Blessed One, having understood that the wanderer Sarabha (sat) silenced, disconcerted, hunched over, downcast, glum, and speechless, said to those wanderers:",
    "an3.64:8": "(1) \"Wanderers, if anyone should say about me: ‘Though you claim to be perfectly enlightened, you are not fully enlightened about these things,’I might question him closely about this matter, interrogate him, and cross-examine him.[n.449] This is the first of the Buddha’s four kinds of self-confidence(vesārajja), on which seeAN4.. The second claim, just below, refers to the second kind of self-confidence, and the third claim to the fourth kind of self-confidence. The third kind of self-confidence is not included here.When he is being closely questioned by me, interrogated, and cross-examined, it is impossible and inconceivable that he would not incur one or another of three consequences: he would either answer evasively and divert the discussion to an irrelevant subject; (or) display anger, hatred, and bitterness; or would sit silenced, disconcerted, hunched over, downcast, glum, and speechless, just like the wanderer Sarabha.[n.450] From the Pāli, it is unclear what the three alternatives are in this statement. In Ce the disjunctivevāoccurs only twice in this sentence, suggesting only two alternatives. Ee has three occurrences ofvā, buttuṇhībhūto vā maṅkubhūto vādivides two terms that normally belong to a single alternative. Be has only onevā, which leaves the question of the alternatives even more obscure. I have chosen to separate \"he would answer evasively … \" and \"display anger, hatred, and bitterness,\" even though we often find the sequence without a disjunction:aññenaññaṁ paṭicarati, bahiddhā kathaṁ apanāmeti, kopañca dosañca appaccayañca pātukaroti. In this respect, I have followed the divisions of the Chinese parallel, SĀ 970, which at T II 250b21–23does offer three distinct alternatives:: “He would divert the discussion to an outside subject, or (), overcome by anger and conceit, would unreasonably display hostility and impatience, or () would silently harbor shame, his head lowered, privately reflecting.”",
    "an3.64:9": "(2) \"If, wanderers, anyone should say about me: ‘Though you claim to be one whose taints are destroyed, you have not fully destroyed these taints,’ I might question him closely about this matter, interrogate him, and cross-examine him. When he is being closely questioned by me, interrogated, and cross-examined, it is impossible and inconceivable that he would not incur one or another of three consequences: he would either answer evasively and divert the discussion to an irrelevant subject; (or) display anger, hatred, and bitterness; or would sit silenced, disconcerted, hunched over, downcast, glum, and speechless, just like the wanderer Sarabha.",
    "an3.64:10": "(3) \"If, wanderers, anyone should say about me: ‘The Dhamma does not lead one who practices it to the complete destruction of suffering, the goal for the sake of which you teach it,’[n.451]Yassa kho pana te atthāya dhammo desito so na niyyāti takkarassa sammā dukkhakkhayāyā ti.Mptakesyassa atthāyato mean “the purpose for which” the Dhamma is taught, identified as the destruction of lust, etc., and “the Dhamma” to be meditation on unattractiveness, etc. The verbniyyātimeans “goes out” (to the complete destruction of suffering).Takkarassais likely to be asandhiformation:takkaro assa.I have been able to track down two Chinese versions of the phrase (there may be more): (1)EĀ27.6 (T II 645c–11) reads(\"It is impossible that this outward-going Dharma of the noble ones does not go out to the complete end of suffering\"). (2) EĀ 46.4 (T II 776c28– 777a2) has(\"By this Dharma taught by me the noble ones go out correctly to the complete end of suffering. It is impossible that any ascetic (etc.) could come and say: ‘(They) have not reached the complete end of suffering’\").I might question him closely about this matter, interrogate him, and cross-examine him. When he is being closely questioned by me, interrogated, and cross-examined, it is impossible and inconceivable that he would not incur one or another of three consequences: he would either answer evasively and divert the discussion to an irrelevant subject, (or) display anger, hatred, and bitterness, or would sit silenced, disconcerted, hunched over, downcast, glum, and speechless, just like the wanderer Sarabha.\"",
    "an3.64:11": "Then, soon after the Blessed One had left, those wanderers gave the wanderer Sarabha a thorough verbal lashing,[n.453]Vācāya sattitodakena sañjambharim akaṁsu.Beand Ee havesannitodakenafor Cesattitodakena. The Chinese counterpart at T II 250c8says simply: \"they reproached him and censured him to his face\" ().(saying:) \"Just as an old jackal in a huge forest might think: ‘I will roar a lion's roar,’ and yet would only howl and yelp like a jackal, so, friend Sarabha, claiming in the absence of the ascetic Gotama: ‘I will roar a lion's roar,’you only howled and yelped like a jackal. Just as, friend Sarabha, a chick might think: ‘I will sing like a cock,’ and yet would only sing like a chick, so, friend Sarabha, claiming in the absence of the ascetic Gotama: ‘I will sing like a cock,’ you only sang like a chick.[n.454]Seyyathāpi, āvuso sarabha, ambakamaddari ‘phussakaravitaṁ ravissāmī’ ti ambakamaddariravitaṁyeva ravati. Be hasambukasañcārīfor Ce and Eeambakamaddariandpurisakaforphussaka. I have taken some liberty in rendering the obscure names of these birds in order to bring out the sense.MpCe glossesambakamaddarias a small chicken(khuddakakukkuṭikā)andphussakaas a large chicken(mahākukkuṭa). The Chinese parallel, at T II 250c3, has: \"Just as a woman might try to make the sound of a man but only makes the sound of a woman\" (). Pālipurisakaravitaṁmight be understood as the crying out of a man, andambakaas a woman, but in the absence of a clear and simple contrast betweenambakaandpurisain the same edition, I follow Mp's gloss.Just as, friend Sarabha, a bull might think to bellow deeply in an empty cow shed, so, friend Sarabha, in the absence of the ascetic Gotama you thought you could bellow deeply.\" (In this way) those wanderers gave the wanderer Sarabha a thorough verbal lashing."
}