{
    "an3.141:1": "\"Bhikkhus, I will teach you the three kinds of good horses and the three kinds of persons who are like good horses.[n.606]Ceand Eetayo ca assasadasse…tayo ca purisasadasse. Lit., \"the three kinds of good horses among horses and the three kinds of good horses among men.\"Listen …",
    "an3.141:2": "\"And what, bhikkhus, are the three kinds of good horses? (1) Here, one kind of good horse possesses speed but not beauty or the right proportions. () Another kind of good horse possesses speed and beauty but not the right proportions. (3) Still another kind of good horse possesses speed, beauty, and the right proportions. These are the three kinds of good horses.",
    "an3.141:3": "\"And what, bhikkhus, are the three kinds of persons who are like good horses? (1) Here, one kind of person who is like a good horse possesses speed but not beauty or the right proportions. (2) Another kind of person who is like a good horse possesses speed and beauty but not the right proportions. () Still another kind of person who is like a good horse possesses speed, beauty, and the right proportions.",
    "an3.141:4": "(1) \"And how does a person who is like a good horse possess speed but not beauty or the right proportions? Here, with the utter destruction of the five lower fetters, a bhikkhu becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world. This, I say, is his speed. But when asked a question pertaining to the Dhamma or the discipline, he falters and does not answer. This, I say, is his lack of beauty. And he does not gain robes, almsfood, lodgings, and medicines and provisions for the sick. This, I say, is his lack of the right proportions. In this way a person who is like a good horse possesses speed but not beauty or the right proportions.",
    "an3.141:5": "(2) \"And how does a person who is like a good horse possess speed and beauty but not the right proportions? Here, with the utter destruction of the five lower fetters, a bhikkhu becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world. This, I say, is his speed. And when asked a question pertaining to the Dhamma or the discipline, he answers and does not falter. This, I say, is his beauty. But he does not gain robes … and provisions for the sick. This, I say, is his lack of the right proportions. In this way a person who is like a good horse possesses speed and beauty but not the right proportions.",
    "an3.141:6": "(3) \"And how does a person who is like a good horse possess speed, beauty, and the right proportions? Here, with the utter destruction of the five lower fetters, a bhikkhu becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world. This, I say, is his speed. And when asked a question pertaining to the Dhamma or the discipline, he answers and does not falter. This, I say, is his beauty. And he gains robes … and provisions for the sick. This, I say, is his right proportions. In this way a person who is like a good horse possesses speed, beauty, and the right proportions."
}