{
    "an3.16:1": "\"Bhikkhus, possessing three qualities, a bhikkhu is practicing the unmistaken way and has laid the groundwork for the destruction of the taints.[n.352]Apaṇṇakapaṭipadaṁ.Mpgives a series of synonyms: \"the unmistaken way, the definite way, the emancipating way, the causal way, the essential way, the exquisite way, the unopposed way, the conducive way, the way in accord with the Dhamma\"(aviraddhapaṭipadaṁ ekaṁsapaṭipadaṁ niyyānikapaṭipadaṁ kāraṇapaṭipadaṁ sārapaṭipadaṁ maṇḍapaṭipadaṁ apaccaṇīkapaṭipadaṁ anulomapaṭipadaṁ dhammānudhammapaṭipadaṁ).Apaṇṇaka, in a similar sense, is found in AN atAN4.7,AN4.72, andAN0.46. It also occurs as the title ofMN 60. In relation toyoni c’assa āraddhā hoti āsavānaṁ khayāya, Mp explains thatyonican mean a section of the aggregates, a cause, or the vagina(khandhakoṭṭhāsa,kāraṇa,passāvamagga). Here, a cause is intended.What three? Here, a bhikkhu guards the doors of the sense faculties, observes moderation in eating, and is intent on wakefulness.[n.353] At SN35:239, IV 75,26–30, too, it is said that by these three practices \"one has laid the groundwork for the destruction of the taints.\"",
    "an3.16:2": "(1) \"And how, bhikkhus, does a bhikkhu guard the doors of the sense faculties? Here, having seen a form with the eye, a bhikkhu does not grasp its marks and features. Since, if he left the eye faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the eye faculty, he undertakes the restraint of the eye faculty. Having heard a sound with the ear … Having smelled an odour with the nose … Having tasted a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, a bhikkhu does not grasp its marks and features. Since, if he left the mind faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the mind faculty, he undertakes the restraint of the mind faculty. It is in this way that a bhikkhu guards the doors of the sense faculties.",
    "an3.16:3": "(2) \"And how does a bhikkhu observe moderation in eating? Here, reflecting carefully, a bhikkhu consumes food neither for amusement nor for intoxication nor for the sake of physical beauty and attractiveness, but only for the support and maintenance of this body, for avoiding harm, and for assisting the spiritual life, considering: ‘Thus I shall terminate the old feeling and not arouse a new feeling, and I shall be healthy and blameless and dwell at ease.’ It is in this way that a bhikkhu observes moderation in eating.",
    "an3.16:4": "(3) \"And how is a bhikkhu intent on wakefulness? Here, during the day, while walking back and forth and sitting, a bhikkhu purifies his mind of obstructive qualities. In the first watch of the night, while walking back and forth and sitting, he purifies his mind of obstructive qualities. In the middle watch of the night he lies down on the right side in the lion's posture, with one foot overlapping the other, mindful and clearly comprehending, after noting in his mind the idea of rising. After rising, in the last watch of the night, while walking back and forth and sitting, he purifies his mind of obstructive qualities. It is in this way that a bhikkhu is intent on wakefulness."
}