{
    "an3.133:1": "\"Bhikkhus, possessing three factors, a warrior is worthy of a king, an accessory of a king, and reckoned a factor of kingship. What three? Here, a warrior is a long-distance shooter, a sharp-shooter, and one who splits a great body. Possessing these three factors, a warrior is worthy of a king, an accessory of a king, and reckoned a factor of kingship. So too, possessing three factors, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What three? Here, a bhikkhu is a long-distance shooter, a sharp-shooter, and one who splits a great body.",
    "an3.133:2": "(1) \"And how is a bhikkhu a long-distance shooter? Here, any kind of form whatsoever—whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near—a bhikkhu sees all form as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ Any kind of feeling whatsoever …… Any kind of perception whatsoever … Any kind of volitional activities whatsoever … Any kind of consciousness whatsoever—whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near—a bhikkhu sees all consciousness as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ It is in this way that a bhikkhu is a long-distance shooter.",
    "an3.133:3": "(2) \"And how is a bhikkhu a sharp-shooter? Here, a bhikkhu understands as it really is: ‘This is suffering.’ He understands as it really is: ‘This is the origin of suffering.’ He understands as it really is: ‘This is the cessation of suffering.’ He understands as it really is: ‘This is the way leading to the cessation of suffering.’ It is in this way that a bhikkhu is a sharp-shooter.",
    "an3.133:4": "(3) \"And how is a bhikkhu one who splits a great body? Here, a bhikkhu splits the great mass of ignorance. It is in this way that a bhikkhu is one who splits a great body."
}