{
    "an3.36:1": "\"Bhikkhus, there are these three divine messengers.[n.380]Mp:\"The old person, the sick one, and the corpse are called ‘divine messengers’(devadūta)because they inspire a sense of urgency, as if warning one: ‘Now you must go into the presence of death.’\"What three?",
    "an3.36:2": "(1) \"Then King Yama questions, interrogates, and cross-examines him about the first divine messenger: ‘Good man, didn’t you see the first divine messenger that appeared among human beings?’ And he replies: ‘No, lord, I didn’t see him.’",
    "an3.36:3": "\"Then King Yama says to him: ‘But, good man, didn’t you ever see among human beings a man or a woman, eighty, ninety or a hundred years of age, frail, bent like a roof bracket, crooked, wobbling as they go along leaning on a stick, ailing, youth gone, with broken teeth, with grey and scanty hair or bald, with wrinkled skin and blotched limbs?’ And the man replies: ‘Yes, lord, I have seen this.’",
    "an3.36:4": "\"Then King Yama says to him: ‘Good man, didn’t it occur to you, an intelligent and mature person: \"I too am subject to old age, I am not exempt from old age. Let me now do good by body, speech, and mind\"?’– ‘No, lord, I could not. I was heedless.’",
    "an3.36:5": "\"Then King Yama says: ‘Through heedlessness, good man, you failed to do good by body, speech, or mind. Surely, they will treat you in a way that fits your heedlessness. That bad kamma of yours was not done by your mother or father, nor by your brother or sister, nor by your friends and companions, nor by your relatives and family members, nor by the deities, nor by ascetics and brahmins. Rather, you were the one who did that bad kamma, and you yourself will have to experience its result.’",
    "an3.36:6": "(2) \"When King Yama has questioned, interrogated, and cross-examined him about the first divine messenger, he again questions, interrogates, and cross-examines him about the second divine messenger: ‘Good man, didn’t you see the second divine messenger that appeared among human beings?’ And he replies: ‘No, lord, I didn’t see him.\"",
    "an3.36:7": "\"Then King Yama says to him: ‘Good man, didn’t it occur to you, an intelligent and mature person: \"I too am subject to illness, I am not exempt from illness. Let me now do good by body, speech, and mind\"?’ – ‘No, lord, I could not. I was heedless.’",
    "an3.36:8": "\"Then King Yama says:‘Through heedlessness, good man, you failed to do good by body, speech, or mind. Surely, they will treat you in a way that fits your heedlessness. That bad kamma of yours was not done by your mother or father, nor by your brother or sister, nor by your friends and companions, nor by your relatives and family members, nor by the deities, nor by ascetics and brahmins. Rather, you were the one who did that bad kamma, and you yourself will have to experience its result.’",
    "an3.36:9": "(3) \"When King Yama has questioned, interrogated, and cross-examined him about the second divine messenger, he again questions, interrogates, and cross-examines him about the third divine messenger: ‘Good man, didn’t you see the third divine messenger that appeared among human beings?’ And he replies: ‘No, lord, I didn’t see him.’",
    "an3.36:10": "\"Then King Yama says to him: ‘But, good man, didn’t you ever see among human beings a man or a woman, one, two, or three days dead, the corpse bloated, livid, and festering?’ And he replies: ‘Yes, lord, I have seen this.’",
    "an3.36:11": "\"Then King Yama says to him: ‘Good man, didn’t it occur to you, an intelligent and mature person: \"I too am subject to death, I am not exempt from death. Let me now do good by body, speech, and mind\"?’ – ‘No, lord, I could not. I was heedless.’",
    "an3.36:12": "\"Then King Yama says: ‘Through heedlessness, good man, you failed to do good by body, speech, or mind. Surely, they will treat you in a way that fits your heedlessness. That bad kamma of yours was not done by your mother or father, nor by your brother or sister, nor by your friends and companions, nor by your relatives and family members, nor by the deities, nor by ascetics and brahmins. Rather, you were the one who did that bad kamma, and you yourself will have to experience its result.’",
    "an3.36:13": "\"When, bhikkhus, King Yama has questioned, interrogated, and cross-examined him about the third divine messenger, he falls silent.Then the wardens of hell torture him with the fivefold transfixing. They drive a red-hot iron stake through one hand and another red-hot iron stake through the other hand; they drive a red-hot iron stake through one foot and another red-hot iron stake through the other foot; they drive a red-hot iron stake through the middle of his chest. There he feels painful, racking, piercing feelings,[n.382] Reading withCedukkhā tibbā khaṭukā vedanā. Be and Ee add a fourth adjective,kharā.yet he does not die so long as that bad kamma is not exhausted.",
    "an3.36:15": "Next the wardens of hell turn him upside down and pare him with adzes …. Next the wardens of hell harness him to a chariot and drive him back and forth across ground that is burning, blazing, and glowing …. Next the wardens of hell make him climb up and down a great mound of coals that are burning, blazing, and glowing …. Next the wardens of hell turn him upside down and plunge him into a red-hot copper cauldron that is burning, blazing, and glowing. He is cooked there in a swirl of foam. And as he is being cooked there in a swirl of foam, he is swept now up, now down, and now across. There he feels painful, racking, piercing feelings, yet he does not die so long as that bad kamma is not exhausted.",
    "an3.36:16": "\"It has four corners and four doorsand is divided into separate compartments;it is surrounded by iron rampartsand shut in with an iron roof.",
    "an3.36:17": "\"Its floor as well is made of ironand heated till it glows with fire.The raṅge is a full hundredyojanaswhich it ever covers pervasively.",
    "an3.36:18": "\"Once, bhikkhus, in the past King Yama thought: ‘Those in the world who do evil deeds are punished with such diverse tortures. Oh, that I might attain the human state! That a Tathāgata, Arahant, Perfectly Enlightened One might arise in the world! That I might attend upon that Blessed One! That the Blessed One might teach me the Dhamma, and that I might come to understand his Dhamma!.",
    "an3.36:19": "Though warned by the divine messengers,those people who remain heedlesssorrow for a long time,having fared on to a lower realm.",
    "an3.36:20": "But those good people here who,when warned by the divine messengers,never become heedlessin regard to the noble Dhamma;",
    "an3.36:21": "who, having seen the peril in clingingas the origin of birth and death,are liberated by non-clingingin the extinction of birth and death:",
    "an3.36:22": "those happy ones have attained security;[n.383] I read withEete khemappattā sukhitā. Cete khoppattā sukhitāand Bete appamattā sukhinoare both faulty.they have reached nibbāna in this very life.Having overcome all enmity and peril,they have transcended all suffering."
}