{
    "an3.27:1": "\"Bhikkhus, there are these three kinds of persons found existing in the world. What three? () There is a person who is to be looked upon with disgust, not to be associated with, followed, and served; (2) a person who is to be looked upon with equanimity, not to be associated with, followed, and served; and (3) a person who is to be associated with, followed, and served.",
    "an3.27:2": "() \"And what kind of person is to be looked upon with equanimity, not to be associated with, followed, and served? Here, some person is prone to angerand easily exasperated. Even if he is criticized slightly he loses his temper and becomes irritated, hostile, and stubborn; he displays irritation, hatred, and bitterness. Just as a festering sore, if struck by a stick or a shard, will discharge even more matter, so too … Just as a firebrand of thetindukatree, if struck by a stick or shard, will sizzle and crackle even more, so too … Just as a pit of feces, if struck by a stick or a shard, becomes even more foul-smelling, so too some person here is prone to anger and … displays irritation, hatred, and bitterness. Such a person is to be looked upon with equanimity, not to be associated with, followed, and served. For what reason?With the thought:‘He might insult me, revile me, and do me harm.’ Therefore such a person is to be looked upon with equanimity, not to be associated with, followed, and served.",
    "an3.27:3": "() \"And what kind of person is to be associated with, followed, and served? Here, some person is virtuous and of good character. Such a person is to be associated with, followed, and served. For what reason? Even though one does not follow the example of such a person, a good report still circulates about oneself: ‘He has good friends, good companions, good comrades.’ Therefore such a person is to be associated with, followed, and served.",
    "an3.27:4": "One who associates with an inferior person declines;one who associates with an equal does not decline;attending on a superior person one develops quickly;therefore you should follow one superior to yourself."
}