{
    "an3.53:1": "Then a certain brahmin approached the Blessed One … and said to him.",
    "an3.53:2": "(1) \"Brahmin, one excited by lust, overcome by lust, with mind obsessed by it,intends for his own affliction, for the affliction of others, and for the affliction of both, and he experiences mental suffering and dejection. But when lust is abandoned, he does not intend for his own affliction, for the affliction of others, or for the affliction of both, and he does not experience mental suffering and dejection. It is in this way that the Dhamma is directly visible ….",
    "an3.53:3": "(2) \"One full of hate, overcome by hatred, with mind obsessed by it, intends for his own affliction, for the affliction of others, and for the affliction of both, and he experiences mental suffering and dejection. But when hatred is abandoned, he does not intend for his own affliction, for the affliction of others, or for the affliction of both, and he does not experience mental suffering and dejection. It is in this way, too, that the Dhamma is directly visible ….",
    "an3.53:4": "(3) \"One who is deluded, overcome by delusion, with mind obsessed by it, intends for his own affliction, for the affliction of others, and for the affliction of both, and he experiences mental suffering and dejection. But when delusion is abandoned, he does not intend for his own affliction, for the affliction of others, or for the affliction of both, and he does not experience mental suffering and dejection. It is in this way, too, that the Dhamma is directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.\"",
    "an3.53:5": "\"Excellent, Master Gotama! Excellent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the darkness so those with good eyesight can see forms. I now go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. Let Master Gotama consider me a lay follower who from today has gone for refuge for life.\""
}