{
    "an3.35:1": "On one occasion the Blessed One was dwelling at Āḷavī on a heap of leaves spread out on a cow track in a siṁsapā grove. Then Hatthaka of Āḷavī,[n.376] SeeAN.25.while walking and wandering for exercise, saw the Blessed One sitting there. He then approached the Blessed One, paid homage to him, sat down to one side, and said to the Blessed One.",
    "an3.35:2": "\"But, Bhante, the winter nights are cold. It is the eight-day interval, the time when snow falls.[n.377]Antaraṭṭhako himapātanasamayo.Mp:\"A period of eight days when snow falls. It is the last four days of the month of Māgha and the first four days of Phagguṇa (roughly in mid-February).\"The ground trampled by the hooves of cattle is rough, the spread of leaves is thin,the leaves on the tree are sparse, the ochre robes leave one cold, and the gale wind blows cold. Yet the Blessed One says thus: ‘Yes, prince, I slept well. I am one of those in the world who sleep well.’\"",
    "an3.35:3": "\"Well then, prince, I will question you about this matter. You should answer as you see fit. What do you think, prince? A householder or a householder's son might have a house with a peaked roof, plastered inside and out, draft-free, with bolts fastened and shutters closed. There he might have a couch spread with rugs, blankets, and covers, with an excellent covering of antelope hide, with a canopy above and red bolsters at both ends. An oil lamp would be burning and his four wives would serve him in extremely agreeable ways. What do you think, would he sleep well or not, or what do you think about this?\"",
    "an3.35:4": "(1) \"What do you think, prince? Might there arise in that householder or householder's son bodily and mental fevers born of lust, which would torment him so that he would sleep badly?.",
    "an3.35:5": "\"There might arise in that householder or householder's son bodily and mental fevers born of lust, which would torment him so that he would sleep badly; but the Tathāgata has abandoned such lust, cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising. Therefore I have slept well.",
    "an3.35:6": "(2) \"What do you think, prince? Might there arise in that householder or householder's son bodily and mental fevers born of hatred … (3) … bodily and mental fevers born of delusion, which would torment him so that he would sleep badly?.",
    "an3.35:7": "\"There might arise in that householder or householder's son bodily and mental fevers born of delusion, which would torment him so that he would sleep badly; but the Tathāgata has abandoned such delusion, cut it off at the root, made it like a palm stump,obliterated it so that it is no more subject to future arising. Therefore I have slept well.\"",
    "an3.35:8": "He always sleeps well,the brahmin who has attained nibbāna,cooled off, without acquisitions,not tainted by sensual pleasures.",
    "an3.35:9": "Having cut off all attachments,having removed anguish in the heart,the peaceful one sleeps well,having attained peace of mind.[n.378] Similar verses are spoken to Anāthapiṇḍika at SN10:8, I 212."
}