{
    "an3.74:1": "On one occasion the Venerable Ānanda was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Then the Licchavi Abhaya and the Licchavi Paṇḍitakumāra approached the Venerable Ānanda, paid homage to him, and sat down to one side.[n.495] The Licchavis were the dominant clan in the Vajji republic, which had its capital at Vesālī.The Licchavi Abhaya then said to the Venerable Ānanda:",
    "an3.74:2": "\"Abhaya, these three kinds of wearing-away purification have been properly expounded by the Blessed One, the Arahant, the Perfectly Enlightened One who knows and sees, for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna. What three?",
    "an3.74:3": "(2) \"When, Abhaya, this bhikkhu is thus accomplished in virtuous behavior, secluded from sensual pleasures, secluded from unwholesome states, he enters and dwells in the first jhāna … (as in :58) … the fourth jhāna …. He does not create any new kamma and he terminates the old kamma having contacted it again and again. The wearing away is directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.",
    "an3.74:4": "(3) \"When, Abhaya, this bhikkhu is thus accomplished in virtuous behavior and concentration, then, with the destruction of the taints, he realizes for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. He does not create any new kamma and he terminates the old kamma having contacted it again and again. The wearing away is directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.[n.500]Mpidentifies the three stages of wearing away with the four noble attainments. The description of the bhikkhu in the first \"wearing away\" as virtuous, according toMp,indicates the lower two paths and fruits—those of stream-entry and the once-returner—for disciples at these stages are said to have fulfilled virtuous behavior. The description of the bhikkhu in the second \"wearing away,\" as one who attains the four jhānas, indicates the attainment of the third path and fruit, that of the non-returner, described as one who has fulfilled concentration. And the description of the bhikkhu in the third \"wearing away\" as one who has reached the destruction of the taints indicates the fruit of arahantship, since the arahant has fulfilled wisdom.Mpmentions another interpretation, which holds that all three kinds of \"wearing away\" are descriptions of arahantship, made from the standpoint of the arahant's virtue, concentration, and wisdom. For the correlation between the three trainings and the four noble attainments, seeAN3.86.",
    "an3.74:5": "When this was said, the Licchavi Paṇḍitakumāra said to the Licchavi Abhaya: \"Why, friend Abhaya, don’t you thank[n.01]Abbhanumodasi. Lit. \"to rejoice along with.\"the Venerable Ānanda for his well-stated words?."
}