{
    "an3.26:1": "\"Bhikkhus, there are these three kinds of persons found existing in the world. What three? () There is a person who is not to be associated with, followed, and served; (2) a person who is to be associated with, followed, and served; and (3)a person who is to be associated with, followed, and served with honor and respect.",
    "an3.26:2": "() \"And what kind of person is to be associated with, followed, and served? Here, some person is similarto oneselfin virtuous behavior, concentration, and wisdom. Such a person is to be associated with, followed, and served. For what reason?Because one considers:‘Since we are similar with regard to virtuous behavior, we will have a discussion on virtuous behavior, and it will flow on smoothly between us, and we will feel at ease. Since we are similar with regard to concentration, we will have a discussion on concentration, and it will flow on smoothly between us, and we will feel at ease. Since we are similar with regard to wisdom, we will have a discussion on wisdom, and it will flow on smoothly between us, and we will feel at ease.’ Therefore such a person is to be associated with, followed, and served.",
    "an3.26:3": "() \"And what kind of person is to be associated with, followed, and served with honor and respect? Here, some person is superiorto oneselfin virtuous behavior, concentration, and wisdom. Such a person is to be associated with, followed, and served with honor and respect. For what reason?Because one considers:‘In such a way I will fulfill the aggregate of virtuous behavior that I have not yet fulfilled or assist with wisdom in various respects the aggregate of virtuous behavior that I have fulfilled. I will fulfill the aggregate of concentration that I have not yet fulfilled or assist with wisdom in various respects the aggregate of concentration that I have fulfilled. I will fulfill the aggregate of wisdom that I have not yet fulfilled or assist with wisdom in various respects the aggregate of wisdom that I have fulfilled.’[n.6]Tattha tattha paññāya anuggahessāmi.Mp:\"Oneassists with wisdomthe aggregate of virtuous behavior in one or another respect by avoiding those things that are uncongenial and unhelpful to virtuous behavior and by cultivating those things that are congenial and helpful (to it). The same method holds for the aggregates of concentration and wisdom.\" \"Aggregate of virtuous behavior\"(sīlakkhandha)is spoken of in the sense of the assemblage of factors that constitute virtuous behavior, and so too for the aggregates of concentration and wisdom.Therefore such a person is to be associated with, followed, and served with honor and respect.",
    "an3.26:4": "One who associates with an inferior person declines;one who associates with an equal does not decline;attending on a superior person one develops quickly;therefore you should follow one superior to yourself."
}