{
    "an3.102:1": "\"Bhikkhus, when a bhikkhu is devoted to the higher mind, from time to time he should give attention to three marks.[n.566]Tīṇi nimittāni.Mpglosses as \"three causes\"(tīṇi kāraṇāni). The threenimittasaresamādhinimitta,paggahanimitta, andupekkhānimitta.() From time to time he should give attention to the mark of concentration, (2) from time to time to the mark of exertion, and (3) from time to time to the mark of equanimity.",
    "an3.102:2": "\"Suppose, bhikkhus, a goldsmith or his apprentice would prepare a furnace, heat up the crucible, take some gold with tongs, and put it into the crucible. Then from time to time he would blow on it, from time to time sprinkle water over it, and from time to time just look on. If the goldsmith or his apprentice were to exclusively blow on the gold, it is possible that the gold would just burn up. If he were to exclusively sprinkle water on the gold, it is possible the gold would cool down. If he were exclusively to just look on, it is possible the gold would not reach the right consistency. But if the goldsmith or his apprentice from time to time blows on it, from time to time sprinkles water over it, and from time to time just looks on, the gold would become malleable, wieldy, and luminous, pliant and properly fit for work. Then whatever kind of ornament the goldsmith wishes to make from it—whether a bracelet, earrings, a necklace, or a golden garland—he can achieve his purpose.",
    "an3.102:3": "\"So too, when a bhikkhu is devoted to the higher mind, from time to time he should give attention to three marks. From time to time he should give attention to the mark of concentration, from time to time to the mark of exertion, and from time to time to the mark of equanimity.",
    "an3.102:4": "\"If he wishes: ‘May I wield the various kinds of psychic potency’ …all as in 3:101, down to:… If he wishes: ‘May I, with the destruction of the taints, in this very life realize for myself with direct knowledge the taintless liberation of mind, liberation by wisdom, and having entered upon it, may I dwell in it,’ he is capable of realizing it, there being a suitable basis.\""
}