{
    "an3.117:1": "\"Bhikkhus, there are these three failures. What three? Failure in virtuous behavior, failure in mind, and failure in view.",
    "an3.117:2": "() \"And what is failure in mind? Here, someone is full of longing and has a mind of ill will. This is called failure in mind.",
    "an3.117:3": "() \"And what is failure in view? Here, someone holds wrong view and has an incorrect perspective thus: ‘There is nothing given, nothing sacrificed, nothing offered; there is nofruit or result of good and bad actions; there is no this world, no other world; there is no mother, no father; there are no beings spontaneously reborn; there are in the world no ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’ This is called failure in view.",
    "an3.117:4": "\"There are, bhikkhus, these three accomplishments. What three? Accomplishment in virtuous behavior, accomplishment in mind, and accomplishment in view.",
    "an3.117:5": "(1) \"And what is accomplishment in virtuous behavior? Here, someone abstains from the destruction of life, from taking what is not given, from sexual misconduct, from false speech, from divisive speech, from harsh speech, and from idle chatter. This is called accomplishment in virtuous behavior.",
    "an3.117:6": "(2) \"And what is accomplishment in mind? Here, someone is without longing and has a mind free of ill will. This is called accomplishment in mind.",
    "an3.117:7": "(3) \"And what is accomplishment in view? Here, someone holds right view and has a correct perspective thus: ‘There is what is given, sacrificed, and offered; there is fruit and result of good and bad actions; there is this world and the other world; there is mother and father; there are beings spontaneously reborn; there are in the world ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’ This is called accomplishment in view."
}