{
    "an3.95:1": "\"Bhikkhus, there are these three kinds of assemblies.[n.540] A partial synthesis ofAN2.43andAN2.44.What three? The assembly of the foremost, the divided assembly, and the harmonious assembly.",
    "an3.95:2": "(1) \"And what, bhikkhus, is the assembly of the foremost? Here, in this kind of assembly the elder bhikkhus do not become luxurious and lax, but discard backsliding and take the lead in solitude; they arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.Those inthe next generation follow their example. They too do not become luxurious and lax, but discard backsliding and take the lead in solitude; they too arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. This is called the assembly of the foremost.",
    "an3.95:3": "(2) \"And what is the divided assembly? Here, the assembly in which the bhikkhus take to arguing and quarreling and fall into disputes, stabbing each other with piercing words, is called the divided assembly.",
    "an3.95:4": "(3) \"And what is the harmonious assembly? Here, the assembly in which the bhikkhus dwell in concord, harmoniously, without disputes, blending like milk and water, viewing each other with eyes of affection, is called the harmonious assembly.",
    "an3.95:5": "\"When the bhikkhus dwell in concord, harmoniously, without disputes, blending like milk and water, viewing each other with eyes of affection, on that occasion they generate much merit. On that occasion the bhikkhus dwell in a divine abode, that is, in the liberation of mind through altruistic joy. When one is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated.",
    "an3.95:6": "\"Just as, when it is raining and the rain pours down in thick droplets on a mountain top, the water flows down along the slope and fills the clefts, gullies, and creeks; these, becoming full, fill up the pools; these, becoming full, fill up the lakes; these, becoming full, fill up the streams; these, becoming full, fill up the rivers; and these, becoming full, fill up the ocean;",
    "an3.95:7": "So too, when the bhikkhus dwell in concord, harmoniously, without disputes, blending like milk and water, viewing each otherwith eyes of affection, on that occasion they generate much merit. On that occasion the bhikkhus dwell in a divine abode, that is, in the liberation of mind through altruistic joy. When one is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated."
}