{
    "an3.69:1": "\"Bhikkhus, there are these three unwholesome roots. What three? The unwholesome root, greed; the unwholesome root, hatred; and the unwholesome root, delusion.",
    "an3.69:2": "(1) \"Whatever greed occurs, bhikkhus, is unwholesome. Whatever (deed) a greedy person performs by body, speech, and mind is also unwholesome. When a greedy person, overcome by greed, with mind obsessed by it, inflicts suffering upon another under a false pretext[n.47]Asatā dukkhaṁ upadahati.MpCe: \"He creates suffering by falsehood, by what is non-existent, having spoken about an unreal fault\"(abhūtena avijjamānena yaṁ kiñci tassa abhūtaṁ dosaṁ vatvā dukkhaṁ uppādeti). Note that Mp takesasatāto be synonymous withabhūtena. In both text andMp,Be readsuppādayatiwhereas Ce and Ee haveupadahati.—by killing, imprisonment, confiscation, censure, or banishment—(thinking): ‘I am powerful, I want power,’ that too is unwholesome. Thus numerous bad unwholesome qualities originate in him born of greed, caused by greed, arisen from greed, conditioned by greed.",
    "an3.69:3": "(2) \"Whatever hatred occurs is unwholesome. Whatever (deed) a person full of hate performs by body, speech, and mind is also unwholesome. When a person full of hate, overcome by hatred, with mind obsessed by it, inflicts suffering upon another under a false pretext … (thinking): ‘I am powerful,I want power,’ that too is unwholesome. Thus numerous bad unwholesome qualities originate in him born of hatred, caused by hatred, arisen from hatred, conditioned by hatred.",
    "an3.69:4": "(3) \"Whatever delusion occurs is unwholesome. Whatever (deed) a deluded person performs by body, speech, and mind is also unwholesome. When a deluded person, overcome by delusion, with mind obsessed by it, inflicts suffering upon another under a false pretext … (thinking): ‘I am powerful, I want power,’ that too is unwholesome. Thus numerous bad unwholesome qualities originate in him born of delusion, caused by delusion, arisen from delusion, conditioned by delusion.\"Such a person, bhikkhus, is called one who speaks at an improper time, who speaks falsely, who speaks what is unbeneficial, who speaks non-Dhamma, who speaks non-discipline.",
    "an3.69:5": "And why is such a person called one who speaks at an improper time … who speaks non-discipline?",
    "an3.69:6-7": "\"Such a person, overcome by bad unwholesome qualities born of greed … born of hatred … born of delusion, with his mind obsessed by them, dwells in suffering in this very life, with distress, anguish, and fever, and with the breakup of the body, after death, a bad destination can be expected for him.",
    "an3.69:8": "… born of hatred … born of delusion, with his mind obsessed by them, dwells in suffering in this very life, with distress, anguish, and fever, and with the breakup of the body, after death, a bad destination can be expected for him. These are the three unwholesome roots.",
    "an3.69:9": "\"There are, bhikkhus, these three wholesome roots. What three? The wholesome root, non-greed; the wholesome root, non-hatred; and the wholesome root, non-delusion.",
    "an3.69:10": "(1) \"Whatever non-greed occurs, bhikkhus, is wholesome. Whatever (deed) one without greed performs by body, speech, and mind is also wholesome. When one without greed, not overcome by greed, with mind not obsessed by it, does not inflict suffering upon another under a false pretext—by killing, imprisonment, confiscation, censure, or banishment—thinking: ‘I am powerful, I want power,’ that too is wholesome. Thus numerous wholesome qualities originate in him born of non-greed, caused by non-greed, arisen from non-greed, conditioned by non-greed.",
    "an3.69:11": "(2) \"Whatever non-hatred occurs is wholesome. Whatever (deed) one without hate performs by body, speech, and mind is also wholesome. When one without hate, not overcome by hatred, with mind not obsessed by it, does not inflict suffering upon another under a false pretext … that too is wholesome. Thus numerous wholesome qualities originate in him born of non-hatred, caused by non-hatred, arisen from non-hatred, conditioned by non-hatred.",
    "an3.69:12": "(3) \"Whatever non-delusion occurs is wholesome. Whatever (deed) one who is undeluded performs by body, speech, and mind is also wholesome. When one who is undeluded, not overcome by delusion, with mind not obsessed by it, does not inflict suffering upon another under a false pretext … that too is wholesome. Thusnumerous wholesome qualities originate in him born of non-delusion, caused by non-delusion, arisen from non-delusion, conditioned by non-delusion.",
    "an3.69:13": "\"Such a person, bhikkhus, is called one who speaks at the proper time, who speaks in accordance with fact, who speaks what is beneficial, who speaks Dhamma, who speaks discipline. And why is such a person called one who speaks at the proper time … who speaks discipline? This person does not inflict suffering upon another under a false pretext—by killing, imprisonment, confiscation, censure, or banishment—thinking: ‘I am powerful, I want power.’ Thus when spoken to in accordance with fact, he admits (his faults); he does not despise (the one who reproaches him). When spoken to contrary to fact, he makes an effort to unravel what is said to him: ‘For such and such a reason this is untrue; for such and such a reason this is contrary to fact.’ Therefore such a person is called one who speaks at the proper time, who speaks in accordance with fact, who speaks what is beneficial, who speaks Dhamma, who speaks discipline.",
    "an3.69:14-15": "\"Such a person has abandoned the bad unwholesome qualities born of greed … born of hatred … born of delusion, cut them off at the root, made them like a palm stump, obliterated them so that they are no more subject to future arising. He dwells happily in this very life, without distress, anguish, or fever, and in this very life he attains nibbāna.",
    "an3.69:16": "… born of hatred … born of delusion, cut them off at the root, made them like a palm stump, obliterated them so that they are no more subject to future arising. He dwells happily in this very life, without distress, anguish, or fever, and in this very life he attains nibbāna. These are the three wholesome roots.\""
}