{
    "an3.79:1": "Then the Venerable Ānanda approached the Blessed One … and said to him:",
    "an3.79:2": "\"Bhante, there are these three fragrances that spread with the wind but not against the wind. What three? The fragrance of roots, the fragrance of heartwood, and the fragrance of flowers. These three fragrances spread with the wind but not against the wind. Is there any fragrance that spreads with the wind, against the wind, and both with and against the wind?\"",
    "an3.79:3": "\"There is, Ānanda, a fragrance that spreads with the wind,against the wind, and both with and against the wind..",
    "an3.79:4-5": "\"Here, Ānanda, in whatever village or town a man or a woman has gone for refuge to the Buddha, the Dhamma, and the Saṅgha; he or she is virtuous and of good character, abstaining from the destruction of life, taking what is not given, sexual misconduct, false speech, and liquor, wine, and intoxicants, the basis for heedlessness; and he or she dwells at home with a heart devoid of the stain of miserliness, freely generous, openhanded, delighting in relinquishment, devoted to charity, delighting in giving and sharing—in such a case, ascetics and brahmins inallquarters speak praise, saying: ‘In such and such a village or town a man or a woman has gone for refuge to the Buddha, the Dhamma, and the Saṅgha … delighting in giving and sharing.’",
    "an3.79:6": "\"The deities and the spirits,[n.507]Ceand Ee readdevatāpi'ssa amanussā. Be does not haveamanussā, \"the spirits.\"too, speak praise, saying: ‘In such and such a village or town a man or a woman has gone for refuge to the Buddha, the Dhamma, and the Saṅgha … is virtuous and of good character … delighting in giving and sharing..",
    "an3.79:7": "The fragrance of flowers does not spread against the wind,nor the fragrance of sandal,tagara,[n.508] A shrub from which a fragrant powder is produced.or jasmine.But the fragrance of good people spreads against the wind:the good person's fragrance pervades all quarters.[n.509] The verse is also atDhp 54."
}