{
    "an3.65:1": "On one occasion the Blessed One was wandering on tour among the Kosalans together with a large Saṅgha of monks when he reached the town of the Kālāmas named Kesaputta. The Kālāmas of Kesaputta heard: \"It is said that the ascetic Gotama, the son of the Sakyans who went forth from a Sakyan family, has arrived at Kesaputta. Now a good report about that Master Gotama has circulated thus: ‘That Blessed One is an arahant, perfectly enlightened … (and) reveals a spiritual life that is perfectly complete and pure.’ Now it is good to see such arahants.\"",
    "an3.65:2": "Then the Kālāmas of Kesaputta approached the Blessed One. Some paid homage to the Blessed One and sat down to one side; some exchanged greetings with himand, when they had concluded their greetings and cordial talk, sat down to one side; some reverentially saluted him and sat down to one side; some pronounced their name and clan and sat down to one side; some kept silent and sat down to one side. The brahmin Vacchagotta of Venāgapura then said to the Blessed One:",
    "an3.65:3": "\"Bhante, there are some ascetics and brahmins who come to Kesaputta. They explain and elucidate their own doctrines, but disparage, denigrate, deride, and denounce the doctrines of others. But then some other ascetics and brahmins come to Kesaputta,and they too explain and elucidate their own doctrines, but disparage, denigrate, deride, and denounce the doctrines of others. We are perplexed and in doubt, Bhante, as to which of these good ascetics speak truth and which speak falsehood.\"",
    "an3.65:4": "\"It is fitting for you to be perplexed, Kālāmas, fitting for you to be in doubt. Doubt has arisen in you about a perplexing matter.[n.56] From the last sentence of the preceding paragraph through this sentence,MĀ16 reads instead: \"Gotama, having heard this, we gave rise to doubt and uncertainty: ‘Of these ascetics or brahmins, which (speak) truthfully and which (speak) falsely?’\" The Blessed One said: \"Kālāmas, do not give rise to doubt and uncertainty. For what reason? Because when there is doubt and uncertainty, there will arise perplexity. Kālāmas, you yourselves do not have pure wisdom with which to know whether there is an afterlife or not. You yourselves do not have pure wisdom about what deeds are transgressions and what deeds are not transgressions.\"Come, Kālāmas, do not go by oral tradition, by lineage of teaching, by hearsay, by a collection of scriptures, by logical reasoning, by inferential reasoning, by reasoned cogitation, by the acceptance of a view after pondering it, by the seeming competence (of a speaker), or because you think: ‘The ascetic is our guru.’[n.57]MĀ16 does not have this passage on the ten inadequate sources of knowledge. Instead, the Buddha immediately explains to the Kālāmas the three unwholesome roots of action and how they lead to moral transgressions. And then he explains the ten courses of wholesome kamma, the explanations being very similar to those found, e.g., atAN10.176(on the threefold purity) andAN10.211(on rebirth in heaven). In MĀ 16, the Buddha does not ask the Kālāmas to judge for themselves but categorically tells them what he himself has known by direct experience. It is possible that MĀ 16 is a normalization of an original Indic text corresponding to the Pāli version, made at a time when the Buddha was widely regarded as an unquestionable authority.But when, Kālāmas, you know for yourselves: ‘These things are unwholesome; these things are blameworthy; these things are censured by the wise; these things, if accepted and undertaken, lead to harm and suffering,’ then you should abandon them.",
    "an3.65:5": "(1) \"What do you think, Kālāmas? When greed arises in a person, is it for his welfare or for his harm?\"[n.48] According to the Buddha, greed, hatred, and delusion are the three unwholesome roots(akusalamūlāni), which underlie all immoral conduct and all defiled states of mind; see3:69. Since the goal of his own teaching, nibbāna, is the destruction of greed, hatred, and delusion (SN38:1, IV 21,16–20), the Buddha subtly leads the Kālāmas to affirm his teaching simply by reflecting on their own experience, without any need for him to impose his authority on them.",
    "an3.65:6": "\"For his harm, Bhante.\"",
    "an3.65:7": "\"Kālāmas, a greedy person, overcome by greed, with mind obsessed by it, destroys life, takes what is not given, transgresses with another's wife, and speaks falsehood; and he encourages others to do likewise. Will that lead to his harm and suffering for a long time?\"",
    "an3.65:8": "\"Yes, Bhante.\"",
    "an3.65:9": "(2) \"What do you think, Kālāmas? When hatred arises in a person, is it for his welfare or for his harm?\"",
    "an3.65:10": "\"For his harm, Bhante.\"",
    "an3.65:11": "\"Kālāmas, a person who is full of hate, overcome by hatred, with mind obsessed by it, destroys life … and he encourages others to do likewise. Will that lead to his harm and suffering for a long time?\"",
    "an3.65:12": "\"Yes, Bhante.\"",
    "an3.65:13": "(3) \"What do you think, Kālāmas? When delusion arises in a person, is it for his welfare or for his harm?\"",
    "an3.65:14": "\"For his harm, Bhante.\"",
    "an3.65:15": "\"Kālāmas, a person who is deluded, overcome by delusion, with mind obsessed by it, destroys life … and he encourages others to do likewise. Will that lead to his harm and suffering for a long time?\"",
    "an3.65:16": "\"Yes, Bhante.\"",
    "an3.65:17-24": "\"What do you think, Kālāmas? Are these things wholesome or unwholesome?\" – \"Unwholesome, Bhante.\" – \"Blameworthy or blameless?\" – \"Blameworthy, Bhante.\" – \"Censured or praised by the wise?\" – \"Censured by the wise, Bhante.\" – \"Accepted and undertaken, do they lead to harm and suffering or not, or how do you take it?\" – \"Accepted and undertaken, these things lead to harm and suffering. So we take it.\"",
    "an3.65:25": "\"Thus, Kālāmas, when we said: ‘Come, Kālāmas, do not go by oral tradition … But when you know for yourselves: \"These things are unwholesome; these things are blameworthy; these things are censured by the wise; these things, if undertaken and practiced, lead to harm and suffering,\" then you should abandon them,’ it is because of this that this was said.",
    "an3.65:26": "\"Come, Kālāmas, do not go by oral tradition, by lineage of teaching, by hearsay, by a collection of scriptures, by logical reasoning, by inferential reasoning, by reasoned cogitation, by the acceptance of a view after pondering it, by the seeming competence (of a speaker), or because you think: ‘The ascetic is our guru.’ But when you know for yourselves: ‘These things are wholesome; these things are blameless; these things are praised by the wise; these things, if accepted and undertaken, lead to welfare and happiness,’ then you should live in accordance with them.",
    "an3.65:27": "(1) \"What do you think, Kālāmas? When non-greed arises in a person, is it for his welfare or for his harm?\"",
    "an3.65:28": "\"For his welfare, Bhante.\"",
    "an3.65:29": "\"Kālāmas, a person without greed, not overcome by greed, his mind not obsessed by it, does not destroy life, take what is not given, transgress with another's wife, or speak falsehood; nor does he encourage others to do likewise.Will that lead to his welfare and happiness for a long time?\"",
    "an3.65:30": "\"Yes, Bhante.\"",
    "an3.65:31": "(2) \"What do you think, Kālāmas? When non-hatred arises in a person, is it for his welfare or for his harm?.",
    "an3.65:32": "\"Yes, Bhante.\"",
    "an3.65:33-40": "\"What do you think, Kālāmas? Are these things wholesome or unwholesome?\" – \"Wholesome, Bhante.\" – \"Blameworthy or blameless?\" – \"Blameless, Bhante.\" – \"Censured or praised by the wise?\" – \"Praised by the wise, Bhante.\" – \"Accepted and undertaken, do they lead to welfare and happiness or not, or how do you take it?\" – \"Accepted and undertaken, these things lead to welfare and happiness. So we take it.\"",
    "an3.65:41": "\"Thus, Kālāmas, when we said: ‘Come, Kālāmas, do not go by oral tradition … But when you know for yourselves: \"These things are wholesome; these things are blameless; these things are praised by the wise; these things, if accepted and undertaken, lead to welfare and happiness,\" then you shouldlive in accordance with them,’ it is because of this that this was said.",
    "an3.65:42": "\"Then, Kālāmas, that noble disciple, who is thus devoid of longing, devoid of ill will, unconfused, clearly comprehending, ever mindful, dwells pervading one quarter with a mind imbued with loving-kindness … with a mind imbued with compassion … with a mind imbued with altruistic joy … with a mind imbued with equanimity, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with equanimity, vast, exalted, measureless, without enmity, without ill will.",
    "an3.65:43": "\"This noble disciple, Kālāmas, whose mind is in this way without enmity, without ill will, undefiled, and pure, has won four assurances in this very life.",
    "an3.65:44": "\"The second assurance he has won is this: ‘If there is no other world, and there is no fruit and result of good and bad deeds, still right here, in this very life, I maintain myself in happiness, without enmity and ill will, free of trouble.",
    "an3.65:45": "\"The third assurance he has won is this: ‘Suppose evil comes to one who does evil. Then, when I have no evil intentions toward anyone, how can suffering afflict me, since I do no evil deed?’[n.9] This is certainly counterintuitive, at least on the basis of what is immediately visible, for cases of \"bad things happening to good people\" are innumerable.",
    "an3.65:46": "\"The fourth assurance he has won is this: ‘Suppose evil does not come to one who does evil. Then right here I see myself purified in both respects.’[n.0]Idhāhaṁ ubhayen’eva visuddhaṁ attānaṁ samanupassāmi. The exact meaning of \"in both respects\" is not entirely clear to me.Mpglosses: \"Since I do no evil, and it is not done (to me as it is) to one who does (evil)\"(yañca pāpaṁ na karomi, yañca karotopi na karīyati).\" However, it seems to me more likely that the two kinds of purification are (1) not doing any evil deeds, and (2) developing a pure mind by practice of the four immeasurable states (loving-kindness, etc.). This seems to be the purport of the Chinese parallel (see next note).",
    "an3.65:47": "\"This noble disciple, Kālāmas, whose mind is in this way without enmity, without ill will, undefiled, and pure, has won these four assurances in this very life.\"[n.461] The four assurances ofMĀ16 (at T I 439b8–26) are as follows: (1) \"If there is this world and the other world, if there are results of good and bad deeds, I acquire the kamma connected with this right view; I uphold it and possess it. With the breakup of the body, after death, I will certainly go to a good state, even to rebirth in the heavenly realm. (2) If this world and the other world do not exist, and there are no results of good and bad deeds, still, even in this present life, I cannot be blamed by others on account of (my conduct), but I will be praised by the wise. However, those of right effort and right view say that there is (this world, the other world, and results of karma). (3) If anything is done, certainly I do no evil, I think nothing evil. Since I do no evil, how can suffering arise for me? (4) If anything is done, certainly I do no evil. I do not transgress against what is fearful and not fearful in the world. I always have love and compassion for the whole world. My mind has no belligerence toward sentient beings; it is without stains, joyful and happy.\"",
    "an3.65:48-51": "\"So it is, Blessed One! So it is, Fortunate One! This noble disciple whose mind is in this way without enmity, without ill will, undefiled, and pure,has won four assurances in this very life.",
    "an3.65:52": "\"This noble disciple, Bhante, whose mind is in this way without enmity, without ill will, undefiled, and pure, has won these four assurances in this very life.",
    "an3.65:53": "\"Excellent, Bhante! … We go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha of bhikkhus. Let the Blessed One consider us lay followers who from today have gone for refuge for life.\""
}