{
    "an3.61:1": "\"Bhikkhus, there are these three sectarian tenets[n.429] \"Sectarian tenets\" renderstitthāyatanāni, lit. \"bases of sects.\" The wordtittha(Skttīrtha), which originally meant a ford in a river, was used to designate religious teachings, probably in the sense that these teachings provide a \"ford\" for crossing the stream of defilements and reaching the far shore of liberation (seeMN 34, where this metaphor governs a short discourse).Mpexplains that the sects(tittha)are the sixty-two views (seeDN ..29–3.29, I 2–39); the founders of the sects(titthakara)are those who formulate those views; and the followers of the sects(titthiya)are those who approve of the views. The great teachers in Jainism are called in Skttīrthankara.which, when questioned, interrogated, and cross-examined by the wise, and taken to their conclusion, will eventuate in non-doing.[n.430]Parampi gantvā akiriyāya saṇṭhahanti.Mpglossesparaṁwithparamparā, \"lineage\": \"Even if they have gone to one of the three kinds of lineage, the lineage of teachers, the lineage of beliefs, and the lineage of (one's) individual existences\"(ācariyaparamparā laddhiparamparā attabhāvaparamparā ti etesu yaṁkiñci paramparaṁ gantvā pi). It is hard to see how this has any relevance to the context. Sinceparaṁcan also mean \"later, further, afterward,\" it seems the point being conveyed is that these positions, if extended further, eventuate in non-doing. On the basis of this understanding, I renderparampi gantvāas \"taken to their conclusion.\"Saṇṭhahantiis, more literally, \"stop at.\"What are the three.",
    "an3.61:2": "(1) \"Bhikkhus, I approached those ascetics and brahmins who hold such a doctrine and view as this: ‘Whatever this person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all that is caused by past deeds,’[n.43]Mp:\"They hold that one experiences feelings exclusively because of kamma created in the past.\" In this connection, see SN36:1, IV 30–31, where the Buddha explains eight causes for illness or affliction, only one of which is the ripening of past kamma. Brahmāli writes: \"The point here seems to be that each of these unwholesome ways of acting is related to particular feelings, and that those feelings (or experiences) can only be experienced through those acts. It follows that if your kamma is such that you have to experience the feelings connected with those bad acts, then you will have to perform them.\" The same point, with suitable changes, applies to the following two tenets, that of God's creative activity and non-causality. In each case, agents escape responsibility for their actions.and I said to them: ‘Is it true that you venerable ones hold such a doctrine and view?’ When I ask them this, they affirm it.Then I say to them: ‘In such a case, it is due to past deeds that you might destroy life, take what is not given, indulge in sexual activity, speak falsehood, utter divisive speech, speak harshly, indulge in idle chatter; that you might be full of longing, have a mind of ill will, and hold wrong view.’[n.433] AtMN 14.14–16, I 9–93, andMN 101, II 14–8, the Buddha challenges the Nigaṇṭhas with other arguments against their thesis that all feeling is due to past kamma.",
    "an3.61:3": "\"Those who fall back on past deeds as the essential truth have no desireto dowhat should be done andto avoid doingwhat should not be done, nor do they make an effort in this respect. Since they do not apprehend as true and valid anything that should be done or should not be done, they are muddle-minded, they do not guard themselves, and even the personal designation ‘ascetic’ could not be legitimately applied to them. This was my first legitimate refutation of those ascetics and brahmins who hold such a doctrine and view.",
    "an3.61:4": "(2) \"Then, bhikkhus, I approached those ascetics and brahmins who hold such a doctrine and view as this: ‘Whatever this person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all that is caused by God's creative activity,’ and I said to them: ‘Is it true that you venerable ones hold such a doctrine and view?’ When I ask them this, they affirm it. Then I say to them: ‘In such a case, it is due to God's creative activity that you might destroy life … and hold wrong view.’",
    "an3.61:5": "\"Those who fall back on God's creative activity as the essential truth have no desireto dowhat should be done andto avoid doingwhat should not be done, nor do they make an effort in this respect. Since they do not apprehend as true and valid anything that should be done or should not be done, they are muddle-minded, they do not guard themselves, and even the personal designation ‘ascetic’ could not be legitimately applied to them. This was my second legitimate refutation of those ascetics and brahmins who hold such a doctrine and view.",
    "an3.61:6": "(3) \"Then, bhikkhus, I approached those ascetics and brahmins who hold such a doctrine and view as this: ‘Whatever this person experiences—whether pleasure, pain, or neither-painnor-pleasure—all that occurs without a cause or condition,’ and I said to them: ‘Is it true that you venerable ones hold such a doctrine and view?’ When I ask them this, they affirm it. Then I say to them: ‘In such a case, it is without a cause or condition that you might destroy life … and hold wrong view.’",
    "an3.61:7": "\"Those who fall back on absence of cause and condition as the essential truth have no desireto dowhat should be done andto avoid doingwhat should not be done, nor do they make an effort in this respect. Since they do not apprehend as true and valid anything that should be done or should not be done, they are muddle-minded, they do not guard themselves, and even the personal designation ‘ascetic’ could not be legitimately applied to them. This was my third legitimate refutation of those ascetics and brahmins who hold such a doctrine and view.",
    "an3.61:8": "\"These, bhikkhus, are the three sectarian tenets which, when questioned, interrogated, and cross-examined by the wise, and taken to their conclusion, will eventuate in non-doing.",
    "an3.61:9": "\"But, bhikkhus, this Dhamma taught by me is unrefuted, undefiled, irreproachable, and uncensured by wise ascetics and brahmins.[n.434]Mp:\"He has so far shown that these sectarian tenets, when taken to their conclusion, eventuate in non-doing, and are therefore empty and unemancipating, without substance. He now shows that the Dhamma he teaches is substantial and emancipating(sārabhāvañc’eva niyyānikabhāvañca).\"And what is the Dhamma taught by me that is unrefuted, undefiled, irreproachable, and uncensured by wise ascetics and brahmins.",
    "an3.61:10": "\"When it was said: ‘\"These are the six elements\": this, bhikkhus, is the Dhamma taught by me that is unrefuted … uncensured by wise ascetics and brahmins,’ for what reason was this said? There arethese six elements: the earth element, the water element, the fire element, the air element, the space element, and the consciousness element.[n.435] For a detailed analysis of the six elements, seeMN 040..When it was said: ‘\"These are the six elements\": this, bhikkhus, is the Dhamma taught by me that is unrefuted … uncensured by wise ascetics and brahmins,’ it is because of this that this was said.",
    "an3.61:11": "\"When it was said: ‘\"These are the six bases for contact\": this, bhikkhus, is the Dhamma taught by me that is unrefuted … uncensured by wise ascetics and brahmins,’ for what reason was this said? There are these six bases for contact: the eye as a base for contact, the ear as a base for contact, the nose as a base for contact, the tongue as a base for contact, the body as a base for contact, and the mind as a base for contact. When it was said: ‘\"These are the six bases for contact\": this, bhikkhus, is the Dhamma taught by me that is unrefuted … uncensured by wise ascetics and brahmins,’ it is because of this that this was said.",
    "an3.61:12": "\"When it was said: ‘\"These are the eighteen mental examinations\": this, bhikkhus, is the Dhamma taught by me that is unrefuted … uncensured by wise ascetics and brahmins,’ for what reason was this said?[n.436]Mpexplainsmanopavicārathus: \"The mind's examination of the eighteen cases, using the ‘feet’ of thought and examination(vitakkavicārapādehi).\" The word \"feet\"(pāda)is used here becausevicāraoriginally meant \"traveling around.\"Having seen a form with the eye, one examines a form that is a basis for joy; one examines a form that is a basis for dejection; one examines a form that is a basis for equanimity. Having heard a sound with the ear … Having smelled an odour with the nose … Having tasted a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, one examines a mental phenomenon that is a basis for joy; one examines a mental phenomenon that is a basis for dejection; one examines a mental phenomenon that is a basis for equanimity. When it was said: ‘\"These are the eighteen mental examinations\": this, bhikkhus, is the Dhamma taught by me that is unrefuted … uncensured by wise ascetics and brahmins,’ it is because of this that this was said.",
    "an3.61:13": "\"When it was said: ‘\"These are the four noble truths\": this, bhikkhus, is the Dhamma taught by me that is unrefuted … uncensured by wise ascetics and brahmins,’ for what reason was this said? In dependence on the six elements the descent of afutureembryo occurs.[n.437]Mp:\"Why does he begin in this way? For ease of understanding. For the Tathāgata wants to explain the revolving of the twelve conditions, so he shows the round by the term ‘descent of a (future) embryo’(gabbhassāvakkanti). For when the round has been shown by the descent of afutureembryo, what follows will be easy to understand. Whose six elements serve as the condition, the mother's or the father's? It is neither, but descent of afutureembryo occurs conditioned by the six elements of the being taking rebirth.\" Mp citesMN 38.92, I 265,35–66,6(see tooMN 93.21, II 156,30–57,3).When the descent takes place, there is name-and-form; with name-and-form as condition, there are the six sense bases; with the six sense bases as condition, there is contact; with contact as condition, there is feeling. Now it is for one who feels that I proclaim: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’",
    "an3.61:14": "\"And what, bhikkhus, is the noble truth of suffering? Birth is suffering, old age is suffering, illness is suffering, deathis suffering; sorrow, lamentation, pain, dejection, and anguish are suffering; not to get what one wants is suffering; in brief, the five aggregates subject to clinging are suffering. This is called the noble truth of suffering.",
    "an3.61:15": "\"And what, bhikkhus, is the noble truth of the origin of suffering? With ignorance as condition, volitional activitiescome to be; with volitional activities as condition, consciousness; with consciousness as condition, name-and-form; with name-and-form as condition, the six sense bases; with the six sense bases as condition, contact; with contact as condition, feeling; with feeling as condition, craving; with craving as condition, clinging; with clinging as condition, existence; with existence as condition, birth; with birth as condition, old age and death, sorrow, lamentation, pain, dejection, and anguish come to be. Such is the origin of this whole mass of suffering. This is called the noble truth of the origin of suffering.[n.438] This may be a unique instance where the noble truths of the origin and cessation of suffering are explicated by way of the full twelve factors of dependent origination. At SN12:43, II 72–73, the origination(samudaya)of suffering is explained by way of the links from consciousness through craving; its passing away(atthaṅgama), by way of the cessation of the links from craving through old age and death. In the Chinese parallel, MĀ 13 (at T I 435a24–436a10), the second and third truths are not explained by way of dependent origination but according to the stock formulations as found in SN56:11, V 421, and elsewhere.",
    "an3.61:16": "\"And what, bhikkhus, is the noble truth of the cessation of suffering? With the remainderless fading away and cessation of ignorance comes cessation of volitional activities; with the cessation of volitional activities, cessation of consciousness; with the cessation of consciousness, cessation of name-andform; with the cessation of name-and-form, cessation of the six sense bases; with the cessation of the six sense bases, cessation of contact; with the cessation of contact, cessation of feeling; with the cessation of feeling, cessation of craving; with the cessation of craving, cessation of clinging; with the cessation of clinging, cessation of existence; with the cessation of existence, cessation of birth; with the cessation of birth, old age and death, sorrow, lamentation, pain, dejection, and anguish cease. Such is the cessation of this whole mass of suffering. This is called the noble truth of the cessation of suffering.",
    "an3.61:17": "\"And what, bhikkhus, is the noble truth of the way leading to the cessation of suffering? It is just this noble eightfold path; that is, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. This is called the noble truth of the way leading to the cessation of suffering."
}