{
    "an3.40:1": "\"Bhikkhus, there are these three authorities. What three? Oneself as one's authority, the world as one's authority, and the Dhamma as one's authority.[n.398] In Pāli:attādhipateyyaṁ lokādhipateyyaṁ dhammādhipateyyaṁ. AlthoughBucknell(2004) does not list a Chinese parallel of this sutta, by chance I recently discovered a parallel cited in the *Śāriputrābhidharmaśāstra, at T XXVIII 679c22–680a27. While the prose portion there is simpler than that of the Pāli, the two convey essentially the same meaning. Their verses, with the exception of the last, also closely correspond.",
    "an3.40:3": "() \"And what, bhikkhus, is the Dhamma as one's authority? Here, having gone to the forest, to the foot of a tree, or to an empty hut, a bhikkhu reflects thus: ‘I did not go forth from the household life into homelessness for the sake of a robe … but ratherwith the thought: \"I am immersed in birth, old age, and death … Perhaps an ending of this entire mass of suffering can be discerned.\" The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise. There are fellow monks of mine who know and see. As one who has gone forth from the household life into homelessness in this well-expounded Dhamma and discipline, it would be improper for me to be lazy and heedless.’ He then reflects thus: ‘Energy will be aroused in me without slackening; mindfulness will be established without confusion; my body will be tranquil without disturbance; my mind will be concentrated and one-pointed.’ Having taken the Dhamma as his authority, he abandons the unwholesome and develops the wholesome; he abandons what is blameworthy and develops what is blameless; he maintains himself in purity. This is called the Dhamma as one's authority.",
    "an3.40:4": "For one performing an evil deedthere is no place in the world called \"hidden.\"The self within you knows, O person,whether it is true or false.[n.00]Attā te purisa jānāti saccaṁ vā yadi vā musā.Mp:\"You yourself know, of whatever you do, whether it is of this or that nature. For this reason, it should be understood that, for one who does an evil deed, there is no place in the world that can be called ‘hidden.’\"",
    "an3.40:5": "Indeed, sir, you the witnessdespise your good self;you conceal the evil selfexisting within yourself.[n.401] The Pāli is obscure here andMpis not particularly helpful in resolving the difficulty. The Chinese parallel (at 680a20–21, but following the Song, Yuan, Ming reading) has: ---. This conveys a somewhat different point, which I would render: \"One who says ‘It is not false’ is better, for then one does not damage oneself. If a transgression exists and one knows it, do not conceal it.\"",
    "an3.40:6": "The devas and Tathāgatas see the foolacting unrighteously in the world.Therefore one should fare mindfully,taking oneself as authority;alert and meditative, taking the world as authority;and fare in accordance with the Dhamma,taking the Dhamma as authority.Truly exerting himself, a sage does not decline.",
    "an3.40:7": "Having vanquished Māraand overcome the end-maker,the striver has finished with birth.Such a sage, wise, a world-knower,identifies with nothing at all.[n.402] The Chinese (at 680a26–2) is quite different. I would render: \"Having discarded and abandoned the six sense faculties, he ends suffering and does not take (another) existence. Having passed away, he does not come back, being forever freed from birth and death.\""
}