{
    "an3.50:1": "\"Bhikkhus, possessing three factors, a master thief breaks into houses, plunders wealth, commits banditry, and ambushes highways. What three? Here, a master thief depends on the uneven, on thickets, and on powerful people.",
    "an3.50:2": "() \"And how does a master thief depend on thickets? Here, a master thief depends on a thicket of cane,a thicket of trees, a coppice,[n.407] Reading withCegedhaṁ(PED svgedha), as against Be and Eerodhaṁ(bank).or a large dense jungle. It is in this way that a master thief depends on thickets.",
    "an3.50:3": "() \"And how does a master thief depend on powerful people? Here, a master thief depends on kings or royal ministers. He thinks: ‘If anyone accuses me of anything, these kings or royal ministers will dismiss the case.’ If anyone accuses him of anything, those kings or royal ministers dismiss the case. It is in this way that a master thief depends on powerful people.",
    "an3.50:4": "\"So too, bhikkhus, possessing three qualities, an evil bhikkhu maintains himself in a maimed and injured condition, is blameworthy and subject to reproach by the wise, and generates much demerit. What three? Here, an evil bhikkhu depends on the uneven, on thickets, and on powerful people.",
    "an3.50:5": "(1) \"And how does an evil bhikkhu depend on the uneven? Here, an evil bhikkhu engages in unrighteous bodily, verbal, and mental action. It is in this way that an evil bhikkhu depends on the uneven.",
    "an3.50:6": "(2) \"And how does an evil bhikkhu depend on thickets? Here, an evil bhikkhu holds wrong view, adopts an extremist view. It is in this way that an evil bhikkhu depends on thickets.",
    "an3.50:7": "(3) \"And how does an evil bhikkhu depend on powerful people? Here, an evil bhikkhu depends on kings or royal ministers. He thinks: ‘If anyone accuses me of anything, these kings or royal ministers will dismiss the case.’ If anyone accuses him of anything, those kings or royal ministers dismiss the case. It is in this way that an evil bhikkhu depends on the powerful."
}