{
    "an3.66:1": "Thus have I heard. On one occasion the Venerable Nandaka was dwelling at Sāvatthī in Migāramātā's Mansion in the Eastern Park. Then Sāḷha, Migāra's grandson, and Rohaṇa, Pekhuniya's grandson, approached the Venerable Nandaka, paid homage to him, and sat down to one side. The Venerable Nandaka then said to Sāḷha:",
    "an3.66:2": "\"Come, Sāḷha, do not go by oral tradition, by lineage of teaching, by hearsay, by a collection of scriptures, by logical reasoning, by inferential reasoning, by reasoned cogitation, by the acceptance of a view after pondering it, by the seeming competence (of a speaker), or because you think: ‘The ascetic is our guru.’ But when youknow for yourselves: ‘These things are unwholesome; these things are blameworthy; these things are censured by the wise; these things, if accepted and undertaken, lead to harm and suffering,’ then you should abandon them.",
    "an3.66:3": "(1) \"What do you think, Sāḷha, is there greed?\"",
    "an3.66:4": "\"Yes, Bhante.\"",
    "an3.66:5": "\"I say this means longing. A greedy person, full of longing, destroys life, takes what is not given, transgresses with another's wife, and speaks falsehood; and he encourages others to do likewise. Will that lead to his harm and suffering for a long time?\"",
    "an3.66:6": "\"Yes, Bhante.\"",
    "an3.66:7": "(2) \"What do you think, Sāḷha, is there hatred?\"",
    "an3.66:8": "\"Yes, Bhante.\"",
    "an3.66:9": "\"I say this means ill will. A person full of hate, with a mind of ill will, destroys life … and he encourages others to do likewise. Will that lead to his harm and suffering for a long time?\"",
    "an3.66:10": "\"Yes, Bhante.\"",
    "an3.66:11": "(3) \"What do you think, Sāḷha, is there delusion?\"",
    "an3.66:12": "\"Yes, Bhante.\"",
    "an3.66:13": "\"I say this means ignorance. A deluded person, immersed in ignorance, destroys life … and he encourages others to do likewise. Will that lead to his harm and suffering for a long time?\"",
    "an3.66:14": "\"Yes, Bhante.\"",
    "an3.66:15-22": "\"What do you think, Sāḷha? Are these things wholesome or unwholesome?\" – \"Unwholesome, Bhante.\" – \"Blameworthy or blameless?\" – \"Blameworthy, Bhante.\" – \"Censured or praised by the wise?\" – \"Censured by the wise, Bhante.\" – \"Accepted and undertaken, do they lead to harm and suffering or not, or how do you take it?\"– \"Accepted and undertaken, these things lead to harm and suffering. So we take it.\"",
    "an3.66:23": "\"Thus, Sāḷha, when we said: ‘Come, Sāḷha, do not go by oral tradition … But when you know for yourselves: \"These things are unwholesome; these things are blameworthy; these things are censured by the wise; these things, if undertaken and practiced, lead to harm and suffering,\" then you should abandon them,’ it is because of this that this was said.",
    "an3.66:24": "\"Come, Sāḷha, do not go by oral tradition, by lineage of teaching, by hearsay, by a collection of scriptures, by logical reasoning, by inferential reasoning, by reasoned cogitation, by the acceptance of a view after pondering it, by the seeming competence (of a speaker), or because you think: ‘The ascetic is our guru.’ But when you know for yourselves: ‘These things are wholesome; these things are blameless; these things are praised by the wise; these things, if accepted and undertaken, lead to welfare and happiness,’ then you should live in accordance with them.",
    "an3.66:25": "(1) \"What do you think, Sāḷha, is there non-greed?\"",
    "an3.66:26": "\"Yes, Bhante.\"",
    "an3.66:27": "\"I say this means absence of longing. A person without greed, without longing, does not destroy life, take what is not given, transgress with another's wife, or speak falsehood; nor does he encourage others to do likewise. Will that lead to his welfare and happiness for a long time?\"",
    "an3.66:28": "\"Yes, Bhante.\"",
    "an3.66:29": "(2) \"What do you think, Sāḷha, is there non-hatred?\"",
    "an3.66:30": "\"Yes, Bhante.\"",
    "an3.66:31": "\"I say this means good will. A person without hate, with a mind of good will, does not destroy life … nor does he encourage others to do likewise. Will that lead to his welfare and happiness for a long time?\"",
    "an3.66:32": "\"Yes, Bhante.\"",
    "an3.66:33": "(3) \"What do you think, Sāḷha, is there non-delusion?\"",
    "an3.66:34": "\"Yes, Bhante.\"",
    "an3.66:35": "\"I say this means true knowledge. An undeluded person,who has arrived at true knowledge, does not destroy life … nor does he encourage others to do likewise. Will that lead to his welfare and happiness for a long time?\"",
    "an3.66:36": "\"Yes, Bhante.\"",
    "an3.66:37-44": "\"What do you think, Sāḷha? Are these things wholesome or unwholesome?\" – \"Wholesome, Bhante.\" – \"Blameworthy or blameless?\" – \"Blameless, Bhante.\" – \"Censured or praised by the wise?\" – \"Praised by the wise, Bhante.\" – \"Accepted and undertaken, do they lead to welfare and happiness or not, or how do you take it?\" – \"Accepted and undertaken, these things lead to welfare and happiness. So we take it.\"",
    "an3.66:45": "\"Thus, Sāḷha, when we said: ‘Come, Sāḷha, do not go by oral tradition … But when you know for yourselves: \"These things are wholesome; these things are blameless; these things are praised by the wise; these things, if accepted and undertaken, lead to welfare and happiness,\" then you should live in accordance with them,’ it is because of this that this was said.",
    "an3.66:46": "\"Then, Sāḷha, that noble disciple, who is thus devoid of longing, devoid of ill will, unconfused, clearly comprehending, ever mindful, dwells pervading one quarter with a mind imbued with loving-kindness … with a mind imbued with compassion … with a mind imbued with altruistic joy … with a mind imbued with equanimity, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with equanimity, vast, exalted, measureless, without enmity, without ill will.",
    "an3.66:47": "\"He then understands thus: ‘There is this; there is the inferior; there is the superior; there is a further escape from whatever is involved with perception.’[n.462]Atthi idaṁ, atthi hīnaṁ, atthi paṇītaṁ, atthi imassa saññāgatassa uttari nissaraṇaṁ. This is also atMN 0.10, I 38,31–32, where it also follows the four divine abodes.Mpsays \"there is this\" refers to the five aggregates, the truth of suffering; \"the inferior\" to the truth of the origin; \"the superior\" to the truth of the path; and \"a further escape from whatever is involved with perception\" to nibbāna, the truth of cessation.When he knows and sees thus, his mind is liberated from the taint of sensuality, from the taint of existence, and from the taint of ignorance.When it is liberated there comes the knowledge: ‘(It's) liberated.’ He understands: ‘Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.."
}