{
    "an3.34:1": "\"Bhikkhus, there are these three causes for the origination of kamma. What three? Greed is a cause for the origination of kamma; hatred is a cause for the origination of kamma; delusion is a cause for the origination of kamma.",
    "an3.34:2": "(1) \"Any kamma, bhikkhus, fashioned through greed, born of greed, caused by greed, originated by greed, ripens wherever the individual is reborn. Wherever that kamma ripens, it is there that one experiences its result, either in this very life, or in thenextrebirth, or on some subsequent occasion.[n.37] Some scholars have argued from the variant readings that only two alternatives are involved: either in this life or upon rebirth. However, I translate in accordance with the commentarial understanding. While the commentaries may be imposing a later interpretation on more archaic texts that asserted only two ways in which kamma can ripen, as a translator I feel responsible to the text that has been transmitted rather than to theories about a more archaic original. The recognition of a threefold ripening of kamma is not exclusive to the Theravāda school but is also found in the treatises of the Sarvāstivāda Abhidharma system. Definitions of the three types—for example, in the Abhidharma Mahāvibhāṣā Śāstra at T XXVII 59a–593b8, and in the Abhidharmakośa at T XXIX 81c10–16—are exactly the same as in the Pāli tradition and thus likely precede the division of the schools.",
    "an3.34:3": "(2) \"Any kamma fashioned through hatred, born of hatred, caused by hatred, originated by hatred, ripens wherever the individual is reborn. Wherever that kamma ripens, it is there that one experiences its result, either in this very life, or in thenextrebirth, or on some subsequent occasion.",
    "an3.34:4": "(3) \"Any kamma fashioned through delusion, born of delusion, caused by delusion, originated by delusion, ripens wherever the individual is reborn. Wherever that kamma ripens,it is there that one experiences its result, either in this very life, or in thenextrebirth, or on some subsequent occasion.",
    "an3.34:5": "\"Suppose, bhikkhus, seeds that are intact, unspoiled, not damaged by wind and the sun's heat, fecund, well preserved, were deposited in well-prepared ground in a good field and receive proper rainfall: in this way, those seeds would grow, increase, and mature.",
    "an3.34:6": "So too, any kamma that is fashioned through greed … hatred … delusion, born of delusion, caused by delusion, originated by delusion, ripens wherever the individual is reborn. Wherever that kamma ripens, it is there that one experiences its result, either in this very life, or in thenextrebirth, or on some subsequent occasion.",
    "an3.34:7": "\"Bhikkhus, there are these threeothercauses for the origination of kamma. What three? Non-greed is a cause for the origination of kamma; non-hatred is a cause for the origination of kamma; non-delusion is a cause for the origination of kamma.",
    "an3.34:8": "(1) \"Any kamma, bhikkhus, fashioned through non-greed, born of non-greed, caused by non-greed, originated by non-greed, is abandoned when greed has vanished; it is cut off at the root, made like a palm stump, obliterated so that it is no more subject to future arising.[n.373] This statement has to be carefully interpreted. For an arahant—who has abandoned greed, hatred, and delusion—kamma created earlier, whether good or bad, is still capable of ripening during the final life. But because there is no more rebirth, with his passing all accumulated kamma from the past becomes defunct. Thus the intention of this statement is not that an arahant's past kamma cannot ripen while the arahant lives, but that it becomes defunct with the arahant's passing; for there will be no further continuum of existence within which its fruits might arise. Brahmāli writes: \"There must be a distinction here between ‘non-greed’(alobha)and the situation when ‘greed has vanished’(lobhe vigata). The former must refer to the motivation behind a particular action, the latter to the full uprooting of greed, attained only by the non-returner or even the arahant. Only in the light of this distinction does this statement make sense.\"",
    "an3.34:9": "(2) \"Any kamma fashioned through non-hatred, born of non-hatred, caused by non-hatred, originated by non-hatred, is abandoned when hatred has vanished; it is cut off at the root, made like a palm stump, obliterated so that it is no more subject to future arising.",
    "an3.34:10": "(3) \"Any kamma fashioned through non-delusion, born of non-delusion, caused by non-delusion, originated by non-delusion, is abandoned when delusion has vanished; it is cut off at the root, made like a palm stump, obliterated so that it is no more subject to future arising.",
    "an3.34:11": "\"Suppose, bhikkhus, there are seeds that are intact, unspoiled,not damaged by wind and the sun's heat, fecund, well preserved. Then a man would burn them in a fire, reduce them to ashes, and winnow the ashes in a strong wind or let them be carried away by the swift current of a river. In this way, those seeds would be cut off at the root, made like a palm stump, obliterated so that they are no more subject to future arising.",
    "an3.34:12": "So too, any kamma that is fashioned through non-greed … non-hatred … non-delusion, born of non-delusion, caused by non-delusion, originated by non-delusion, is abandoned when delusion has vanished; it is cut off at the root, made like a palm stump, obliterated so that it is no more subject to future arising.\"",
    "an3.34:13": "Whatever kamma an ignorant personhas doneborn of greed, hatred, and delusion,whether what was fashioned by him be little or much,it is to be experienced right here:there exists no other sitefor it.[n.374] I read withCeand Bemohajañ cāpaviddasu, as against Ee'smohajañ cāpi ’viddasu.Mpboth Ce and Bealso readsmohajañ cāpaviddasu, which it resolves intomohajañcāpi aviddasu. It paraphrases the meaning thus: \"Whatever kamma the blind, ignorant worldling creates born of greed, hatred, and delusion—whether the kamma so fashioned be little or much—it is to be experienced right here(idh’eva taṁ vedaniyaṁ), that is, it is to be experienced by the fool here in his very own being(idha sake attabhāveyeva); this means that it ripens in his own individual being.There exists no other site[for it](vatthuṁ aññaṁ na vijjati): there is no other site for the ripening of that kamma; for the kamma done by one person does not ripen in another's being.\"",
    "an3.34:14": "Therefore a wise person should abandonany deedborn of greed, hatred, and delusion.A bhikkhu, giving rise to knowledge,should abandon all bad destinations.[n.375]Tasmā lobhaṁ ca dosaṁ ca, mohajaṁ cāpi viddasu. Ee reads the last pādamohañ cāpi ‘viddasu, which is missing a syllable. The text does lack a verb and direct object qualifed bymohajaṁ.Mpsupplies these in its paraphrase: \"Therefore a wise persondoes not do that kammaborn of greed and so forth\"(yo vidū…taṁ lobhajādibhedaṁ kammaṁ na karoti). It will be noted thatMpconsiderslobhaṁanddosaṁto be truncated forms oflobhajaṁanddosajaṁ, and I translate accordingly. For the verb, I seejaheof pāda d to implicitly extend up into pādas a and b, thus doing a dual service."
}