{
    "an3.80:1": "Then the Venerable Ānanda approached the Blessed One …… and said to him:",
    "an3.80:2": "A second time the Venerable Ānanda said to the Blessed One: \"Bhante, in the presence of the Blessed One I heard this …. How far, Bhante, can the Blessed One, the Arahant, the Perfectly Enlightened One convey his voice?",
    "an3.80:3": "A third time the Venerable Ānanda said to the Blessed One: \"Bhante, in the presence of the Blessed One I heard this …. How far, Bhante, can the Blessed One, the Arahant, the Perfectly Enlightened One convey his voice?.",
    "an3.80:4": "(1) \"A thousand times the world in which the sun and moon revolve and light up the quarters with their brightness is called a thousandfold minor world system.[n.512]Cūḷanikā lokadhātu.Mp:\"This is the domain of a disciple\"(ayaṁ sāvakassa visayo).In that thousandfold world system there are a thousand moons, a thousand suns, a thousand Sinerus king of mountains, a thousand Jambudīpas, a thousand Aparagoyānas, a thousand Uttarakurus, a thousand Pubbavidehas,[n.513] These are the four continents, located respectively to the south, west, north, and east.and a thousand four great oceans; a thousand four great kings, a thousandheavensof devasruled bythe four great kings, a thousand Tāvatiṁsaheavens, a thousandYāmaheavens, a thousand Tusitaheavens, a thousandheavensof devas who delight in creation, a thousandheavensof devas who control what is created by others, a thousand brahmā worlds.",
    "an3.80:5": "(2) \"A world that is a thousand times a thousandfold minor world system is called a thousand-to-the-second-power middling world system.[n.14]Dvisahassī majjhimā lokadhātu. It is necessary to use some such expression rather than \"a two-thousandfold middling world system.\" For the middling world system is not twice the size of a thousandfold minor world system, buta thousand timesits size, that is, a thousandfold world system squared. Similarly, just below, atisahassī mahāsahassī lokadhātuis not three times the size of a minor world system, buta thousand timesthe size of a thousand-to-the-second-power middling world system, in other words, a thousandfold world system cubed.",
    "an3.80:6": "(3) A world that is a thousand times a thousand-to-the-second-power middling world system is called a thousand-to-the-third-power great world system.",
    "an3.80:7": "Ānanda, the Tathāgata can convey his voice as far as he wants in a thousand-to-the-third-power great world system.\"",
    "an3.80:8": "\"But in what way, Bhante, can the Tathāgata convey his voice as far as he wants in a thousand-to-the-third-power great world system?.",
    "an3.80:9": "When this was said, the Venerable Ānanda said to the Blessed One: \"It is my good fortune! I am very fortunate that my Teacher is so powerful and mighty.."
}