{
    "an3.73:1": "On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Banyan Tree Park. Now on that occasion the Blessed One had just recently recovered from illness. Then the Sakyan Mahānāma approached the Blessed One, paid homage to him, sat down to one side, and said to him.",
    "an3.73:2": "Then the Venerable Ānanda took Mahānāma the Sakyan by the arm, led him off to one side, and said to him: \"The Blessed One has spoken about the virtuous behavior of a trainee and the virtuous behavior of one beyond training, the concentration of a traineeand the concentration of one beyond training, the wisdom of a trainee and the wisdom of one beyond training.",
    "an3.73:3": "(2) \"And what is the concentration of a trainee?[n.49]Eeis missing the question here.Here, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna … (as at :58) … the fourth jhāna …. This is called the concentration of a trainee.",
    "an3.73:4": "(3) \"And what is the wisdom of a trainee? Here, a bhikkhu understands as it really is: ‘This is suffering’ … (as in 3:12) … ‘This is the way leading to the cessation of suffering.’ This is called the wisdom of a trainee.",
    "an3.73:5": "\"When this noble disciple is thus accomplished in virtuous behavior, concentration, and wisdom, with the destruction of the taints, he realizes for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it.[n.494]Mp:\"Having explained the virtuous behavior, concentration, and wisdom of the trainee(sekha), he explains the virtuous behavior, concentration, and wisdom of one beyond training(asekha)by way of the fruit of arahantship: ‘The fruition knowledge of one beyond training arises later than the concentration and insight knowledge of a trainee. The concentration of the fruit in one beyond training arises later than the trainee's insight knowledge.’\""
}