{
    "an3.93:1": "\"Bhikkhus, wanderers of other sects prescribe these three kinds of solitude. What three? Solitude with respect to robes, solitude with respect to almsfood, and solitude with respect to lodgings.[n.535]Mp:\"Solitude with respect to robes(cīvarapaviveka): Separation from defilements arising on account of a robe. The same method with the other twoalmsfood and lodgings.\"",
    "an3.93:2": "\"This, bhikkhus, is what wanderers of other sects prescribe as solitude with respect to robes: they wear hemp robes, robes of hemp-mixed cloth, shroud robes, rag-robes; robes made from tree bark, antelope hides, strips of antelope hide; robes ofkusagrass, bark fabric, or wood-shavings fabric; a blanket made of head hair or of animal wool,a covering made of owls’ wings. That is what wanderers of other sects prescribe as solitude with respect to robes.",
    "an3.93:3": "\"This is what wanderers of other sects prescribe as solitude with respect to almsfood: they eat greens, millet, forest rice, hide-parings, moss, rice bran, the scum of rice, sesamum flour, grass, or cow dung. They subsist on forest roots and fruits; they feed on fallen fruits. That is what wanderers of other sects prescribe as solitude with respect to almsfood.",
    "an3.93:4": "\"This is what wanderers of other sects prescribe as solitude with respect to lodgings: a forest, the foot of a tree, a charnel ground, remote lodgings in forests and jungle groves, the open air, a heap of straw, a chaff-house. That is what wanderers of other sects prescribe as solitude with respect to lodgings.",
    "an3.93:5": "\"In this Dhamma and discipline, bhikkhus, there are these three kinds of solitude for a bhikkhu. What three.",
    "an3.93:6": "\"Suppose, bhikkhus, there is a farmer whose field of hill rice has ripened. The farmer would swiftly have the plants cut. Then he would swiftly have the plants collected. Then he would swiftlyhave them transportedto the threshing place. Then he would swiftly pile them up, have them threshed, get the straw removed, get the chaff removed, and winnow it. Then he would swiftly have it brought over, get it pounded, and get the husks removed. In this way, the farmer's grains of rice would be foremost, attained the core, pure, and established in the core.",
    "an3.93:7": "\"So too, bhikkhus, when a bhikkhu is virtuous … one of right view … one who has abandoned the taints and remains secluded from them, he is then called a bhikkhu who is foremost, attained the core, pure, and established in the core.\""
}