{
    "an3.11:1": "\"Bhikkhus, possessing three qualities, a well-known bhikkhu is acting for the harm of many people, for the unhappiness of many people, for the ruin, harm, and suffering of many people, of devas and human beings. What three? He encourages them in discordant bodily action, discordant verbal action, and discordantmentalqualities.[n.342]Mp.\"Discordant(ananulomike)means not in conformity with the teaching. Gross ‘discordant bodily action’ is destroying life, etc.; or (more subtly) worshipping the directions or making offerings to the spirits. Gross ‘discordant verbal action’ is false speech, etc.; or (more subtly), if one does not wish to give to others, deceiving them by saying one does not have anything to give. Gross ‘discordant mental action’ is longing, etc.; or (more subtly), explaining a meditation subject incorrectly.\"Mpillustrates this with the story of the elder mentioned at Vism 296,2–6, Ppn 9.6, who taught a young man to meditate on loving-kindness toward his wife. As a result he was overcome by lust and beat against the walls of his meditation cell all night. I translateananulomikesu dhammesuin accordance withMp,but the worddhammesucan also mean \"teachings,\" and it is possible that this was the original intention.Possessing these three qualities, a well-known bhikkhu is acting for the harm of many people, for the unhappiness of many people, for the ruin, harm, and suffering of many people, of devas and human beings.",
    "an3.11:2": "\"Bhikkhus, possessing three qualities, a well-known bhikkhu is acting for the welfare of many people, for the happiness of many people, for the good, welfare, and happiness of many people, of devas and human beings. What three? He encourages them in concordant bodily action, concordant verbal action, and concordantmentalqualities. Possessing these three qualities, a well-known bhikkhu is acting for the welfare of many people, for the happiness of many people, for the good, welfare, and happiness of many people, of devas and human beings.\""
}