{
    "an3.140:1": "\"Bhikkhus, I will teach you the three kinds of wild colts and the three kinds of persons who are like wild colts. Listen and attend closely. I will speak..",
    "an3.140:2": "\"And what, bhikkhus, are the three kinds of wild colts?(1) Here, one kind of wild colt possesses speed but not beauty or the right proportions. () Another kind of wild colt possesses speed and beauty but not the right proportions. (3) And still another kind of wild colt possesses speed, beauty, and the right proportions. These are the three kinds of wild colts.",
    "an3.140:3": "\"And what, bhikkhus, are the three kinds of persons who are like wild colts? (1) Here, one kind of person who is like a wild colt possesses speed but not beauty or the right proportions. (2) Another kind of person who is like a wild colt possesses speed and beauty but not the right proportions. () And still another kind of person who is like a wild colt possesses speed, beauty, and the right proportions.",
    "an3.140:4": "(1) \"And how does a person who is like a wild colt possess speed but not beauty or the right proportions? Here, a bhikkhu understands as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ This, I say, is his speed. But when asked a question pertaining to the Dhamma or the discipline, he falters and does not answer. This, I say, is his lack of beauty. And he does not gain robes, almsfood, lodgings, and medicines and provisions for the sick. This, I say, is his lack of the right proportions. In this way a person who is like a wild colt possesses speed but not beauty or the right proportions.",
    "an3.140:5": "(2) \"And how does a person who is like a wild colt possess speed and beauty but not the right proportions? Here, a bhikkhu understands as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ This, I say, is his speed. And when asked a question pertaining to the Dhamma or the discipline, he answers and does not falter. This, I say, is his beauty. But he does not gain robes … and provisions for the sick. This, I say, is his lack of the right proportions. In this waya person who is like a wild colt possesses speed and beauty but not the right proportions.",
    "an3.140:6": "(3) \"And how does a person who is like a wild colt possess speed, beauty, and the right proportions? Here, a bhikkhu understands as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ This, I say, is his speed. And when asked a question pertaining to the Dhamma or the discipline, he answers and does not falter. This, I say, is his beauty. And he gains robes … and provisions for the sick. This, I say, is his right proportions. In this way a person who is like a wild colt possesses speed, beauty, and the right proportions."
}