{
    "an3.63:1": "On one occasion the Blessed One was wandering on tour among the Kosalans together with a large Saṅgha of bhikkhus when he reached the Kosalan brahmin village named Venāgapura. The brahmin householders of Venāgapura heard: \"It is said that the ascetic Gotama, the son of the Sakyans who went forth from a Sakyan family, has arrived at Venāgapura. Now a good report about that Master Gotama has circulated thus: ‘That Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One. Having realized by his own direct knowledge this world with its devas, Māra, and Brahmā, this population with its ascetics and brahmins, its devas and humans, he makes it known to others. He teaches a Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; he reveals a spiritual life that is perfectly complete and pure.’ Now it is good to see such arahants.\"",
    "an3.63:2": "Then the brahmin householders of Venāgapura approached the Blessed One. Some paid homage to the Blessed One and sat down to one side; some exchanged greetings with himand, when they had concluded their greetings and cordial talk, sat down to one side; some reverentially saluted him and sat down to one side; some pronounced their name and clan and sat down to one side; some kept silent and sat down to one side. The brahmin Vacchagotta of Venāgapura then said to the Blessed One:",
    "an3.63:3": "\"It is astounding and amazing, Master Gotama, how Master Gotama's faculties are tranquil and the color of his skin is pure and bright. Just as a yellow jujube fruit in the autumn is pure and bright, so Master Gotama's faculties are tranquil and the color of his skin is pure and bright. Just as a palm fruit that has just been removed from its stalk is pure and bright, so Master Gotama's faculties are tranquil and the color of his skin is pure and bright. Just as an ornament of finest gold, well prepared by a skilled goldsmith and very skillfully wrought in the furnace, placed on red brocade, shines and beams and radiates, so Master Gotama's faculties are tranquil and the color of his skin is pure and bright.",
    "an3.63:4": "\"Brahmin, those high and luxurious kinds of bedding are rarely obtained by those who have gone forth, and if they are obtained, they are not allowed.",
    "an3.63:5": "\"But, brahmin, there are three kinds of high and luxurious beds that at present I gain at will, without trouble or difficulty. What three?The celestial high and luxurious bed, the divine high and luxurious bed, and the noble high and luxurious bed.[n.443]Dibbaṁ uccāsayanamahāsayanaṁ, brahmaṁ uccāsayanamahāsayanaṁ, ariyaṁ uccāsayanamahāsayanaṁ.These are the three kinds of high and luxurious beds that at present I gain at will, without trouble or difficulty.\"",
    "an3.63:6": "(1) \"But, Master Gotama, what is the celestial high and luxurious bed that at present you gain at will, without trouble or difficulty?.",
    "an3.63:7": "\"It is astounding and amazing, Master Gotama! Who else, apart from Master Gotama, can gain at will, without trouble or difficulty, such a celestial high and luxurious bed?",
    "an3.63:8": "(2) \"But, Master Gotama, what is the divine high and luxurious bed that at present you gain at will, without trouble or difficulty?\"",
    "an3.63:9": "\"It is astounding and amazing, Master Gotama! Who else, apart from Master Gotama, can gain at will, without trouble or difficulty, such a high and luxurious bed?",
    "an3.63:10": "(3) \"But, Master Gotama, what is the noble high and luxurious bed that at present you gain at will, without trouble or difficulty?.",
    "an3.63:11": "\"It is astounding and amazing, Master Gotama! Who else, apart from Master Gotama, can gain at will, without trouble or difficulty, such a noble high and luxurious bed?",
    "an3.63:12": "\"Excellent, Master Gotama! Excellent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the darkness so those with good eyesight can see forms. We now go for refuge to Master Gotama,to the Dhamma, and to the Saṅgha of bhikkhus. Let Master Gotama consider us lay followers who from today have gone for refuge for life.\""
}