{
    "an3.100:1": "\"Bhikkhus, if one were to say thus: ‘A person experiences kamma in precisely the same way that he created it,’ in such a case there could be no living of the spiritual life and no opportunity would be seen for completely making an end of suffering.[n.546] The pointMpis trying to make, it seems, is that if one has to experience the result of every kamma one has created of the type to be experienced upon rebirth, and of every kamma one has created of the type to be experienced in some life subsequent to the next, one would have to continue into the next rebirth, and into indefinite future rebirths, in order to experience those results. In such a case, because those kammas are bound to ripen, one would have to remain in saṁsāra forever in order to experience their fruits. It is not at all evident from the sutta itself, however, that this is the intended meaning. It seems, rather, that what the sutta is saying is that one need not experience the result of kamma inexactly the same waythat one created it (so that, for example, if one killed a person one would not have to be killed in turn). The point, then, is that when one's wholesome and unwholesome kammas ripen, they will have to be experienced, respectively, as pleasant and as painful, even though thequantumof pleasure and pain need not correspond to the moral force of the original action.But if one were to say thus: ‘When a person creates kamma that is to be experienced in a particular way, he experiences its result precisely in that way,’ in such a case the living of the spiritual life is possible and an opportunity is seen for completely making an end ofsuffering.[n.547]Mpexplains this in terms of the Abhidhamma theory that kamma is created by the sevenjavanacittas,the karmically active mental events in a cognitive process. The firstjavanais of the type to be experienced in this present life(diṭṭhadhammavedanīya);if it misses the chance to ripen in this life, it becomes defunct(ahosi).The seventhjavanais to be experienced after rebirth in the next life(upapajjavedanīya),and if it misses the chance to ripen in that life, it becomes defunct. The middle fivejavanasare to be experienced on some subsequent occasion(aparapariyāyavedanīya),which means that they can ripen any time after the next life for as long as one continues in saṃsāra. Since this theory arose long after the compilation of the Nikāyas, it is improbable that it conveys the purport of the present passage. As I explained in note546, the text seems to be saying simply that when one creates unwholesome kamma, one will experience its result as painful, whether to a strong degree or to a slight degree, but the degree of the result cannot be rigidly correlated with the severity of the original action. The converse holds with wholesome kamma, which is to be experienced as pleasant. It is this variability that allows a person, through the development of the path, to overcome the consequences of grave unwholesome kamma and thereby attain the end of suffering in saṃsāra. This interpretation seems to be borne out by the examples given in the sutta.The Chinese parallel,MĀ (at T I 433a2–434a), does not make a clear distinction between two contrary positions. I read it thus: \"The Buddha told the bhikkhus: ‘If one says:\"One receives the result of kamma according to the way it has been done by a person\"—in this case, one does not practice the spiritual life and is unable to end suffering. If one says: \"One receives the result of kamma according to the way it has been done by a person\"—in this case, one practices the spiritual life and is able to end suffering’\" (). Either there has been a mistake here in the textual transmission of the text, or the point in this version is that, of two people who hold the same view about karma, one does not practice and thus does not make an end to suffering, while the other practices and makes an end to suffering.",
    "an3.100:2": "\"What kind of person creates trifling bad kamma that leads him to hell? Here, some person is undeveloped in body, virtuous behavior, mind, and wisdom; he is limited and has a mean character,[n.548]Paritto appātumo.Mpexplains: \"He is limited because of the limitation of his virtues(parittaguṇo). His self(ātumā)is his body(attabhāvo); even though his body may be large, he has a ‘mean character’ because of the limitation of his virtues.\"Ātuma(n)is an alternative form ofatta(n)(Sktātman).Mpidentifies it withattabhāva. The Chinese parallel reads the corresponding phrase (occurring at T I 433a8) as \"his life span is very short\" ().and he dwells in suffering.[n.549] Text readsappadukkhavihārī, which does not fit the context well.Mpoffers an unconvincing resolution of the compound: \"He dwells in suffering because of his small evil deed\"(appakenapi pāpena dukkhavihārī). The Chinese parallel has nothing corresponding to this against which to check it. I amend the text to read simplydukkhavihārī. It is possible thatappaentered via a recitation error based onappamāṇavihārījust below.When such a person creates trifling bad kamma, it leads him to hell.",
    "an3.100:3": "\"What kind of person creates exactly the same trifling bad kamma and yet it is to be experienced in this very life, without even a slight (residue) being seen, much less abundantresidue? Here, some person is developed in body, virtuous behavior, mind, and wisdom. He is unlimited and has a lofty character, and he dwells without measure.[n.550]Aparitto mahattā(Be:mahatto).MpCe: \"He is unlimited because his virtues are not limited; even when his body is small, he has ‘a great character’ because of the greatness of his virtues\"(guṇamahantatāya mahattā). Mp takes all these terms to imply that the person being described is an arahant, which is puzzling since, according to the Abhidhamma philosophy that underlies the commentaries, an arahant does not create any kamma at all. Again, the Chinese parallel (at T I 4b11) interprets this by way of the life span: \"he has an extremely long life span\" ().When such a person creates exactly the same trifling bad kamma, it is to be experienced in this very life, without even a slightresiduebeing seen, much less abundantresidue.[n.551] That is, a residue to be experienced in future lives.",
    "an3.100:4": "(1) \"Suppose a man would drop a lump of salt into a small bowl of water. What do you think, bhikkhus? Would that lump of salt make the small quantity of water in the bowl[n.552]Beis missingudakamallakehere.salty and undrinkable?.",
    "an3.100:5": "\"So too, bhikkhus, some person here has created trifling bad kamma yet it leads him to hell, while some other person here has created exactly the same trifling kamma yet it is to be experienced in this very life, without even a slightresiduebeing seen, much less abundantresidue.",
    "an3.100:6": "\"What kind of person creates trifling bad kamma that leads him to hell? Here, some person is undeveloped in body, virtuous behavior, mind, and wisdom. When such a person creates a trifling bad kamma, it leads him to hell.",
    "an3.100:7": "\"What kind of person creates exactly the same trifling bad kamma and yet it is to be experienced in this very life, without even a slightresiduebeing seen, much less an abundantresidue? Here, some person is developed in body, virtuous behavior, mind, and wisdom. When such a person has created exactly the same trifling bad kamma, it is to be experienced in this very life, without even a slightresiduebeing seen, much less abundantresidue.",
    "an3.100:8": "(2) \"Here, bhikkhus, someone is imprisoned forstealinghalf akahāpaṇa, akahāpaṇa,or a hundredkahāpaṇas,[n.553]Kahāpaṇa: The major unit of currency used in northern India during the Buddha’s time.while someone else is not imprisoned forstealingthe same amount of money.",
    "an3.100:9": "\"What kind of person is imprisoned forstealinghalf akahāpaṇa, akahāpaṇa, or a hundredkahāpaṇas? Here, someone is poor, with little property and wealth. Such a person is imprisoned forstealinghalf akahāpaṇa, akahāpaṇa, or a hundredkahāpaṇas.",
    "an3.100:10": "\"What kind of person is not imprisoned forstealinghalf akahāpaṇa, akahāpaṇa, or a hundredkahāpaṇas? Here, someone is rich, with much money and wealth. Such a person is not imprisoned forstealinghalf akahāpaṇa, akahāpaṇa, or a hundredkahāpaṇas.",
    "an3.100:11": "\"What kind of person creates trifling bad kamma that leads him to hell? Here, some person is undeveloped in body … and wisdom. When such a person has created trifling bad kamma, it leads him to hell.",
    "an3.100:12": "\"What kind of person creates exactly the same trifling bad kamma and yet it is to be experienced in this very life, without even a slightresiduebeing seen, much less an abundantresidue?",
    "an3.100:13": "Here, some person is developed in body, virtuous behavior, mind, and wisdom. When such a person has created exactly the same trifling bad kamma, it is to be experienced in this very life, without even a slightresiduebeing seen, much less abundantresidue.",
    "an3.100:14": "\"What kind of person[n.554] WhereCehere readskathaṁrūpoand belowevarūpo, it is better to read with Be and Ee the accusativeskathaṁrūpaṁandevarūpaṁ. These words are to be correlated with the accusative present participleādiyamānaṁoccurring in the middle of each sentence; they qualify, not the sheep merchant or butcher, but the person who has stolen the sheep. Curiously, in the counterpart on the rich man, Ce has the right readingskathaṁrūpaṁandevarūpaṁ, in agreement with Be and Ee.can the sheep merchant or butcher execute, imprison, fine, or otherwise penalize for stealing a sheep? One who is poor, with little property and wealth. The sheep merchant or butcher can execute, imprison, fine, or otherwise penalize such a person for stealing a sheep.",
    "an3.100:15": "\"What kind of person can’t the sheep merchant or butcher execute, imprison, fine, or otherwise penalize for stealing a sheep? One who is rich, with a lot of money and wealth, a king or royal minister. The sheep merchant or butcher can’t execute, imprison, fine, or otherwise penalize such a person for stealing a sheep; he can only plead with him: ‘Sir, return my sheep or pay me for it.’",
    "an3.100:16": "\"What kind of person creates trifling bad kamma that leads him to hell? Here, some person is undeveloped in body, virtuous behavior, mind, and wisdom; he is limited and has a mean character, and he dwells in suffering. When such kind ofperson has created a trifling bad kamma, it leads him to hell.",
    "an3.100:17": "\"What kind of person creates exactly the same trifling bad kamma and yet it is to be experienced in this very life, without even a slightresiduebeing seen, much less an abundantresidue? Here, some person is developed in body, virtuous behavior, mind, and wisdom. He is unlimited and has a lofty character, and he dwells without measure. When such a person has created exactly the same trifling bad kamma, it is to be experienced in this very life, without even a slightresiduebeing seen, much less abundantresidue.",
    "an3.100:18": "\"If, bhikkhus, one were to say thus: ‘A person experiences kamma in precisely the same way that he created it,’ in such a case there could be no living of the spiritual life and no opportunity would be seen for completely making an end of suffering. But if one were to say thus: ‘When a person creates kamma that is to be experienced in a particular way, he experiences its result precisely in that way,’ in such a case the living of the spiritual life is possible and an opportunity is seen for completely making an end of suffering.\""
}