{
    "an3.112:1": "\"Bhikkhus, there are these three causes for the origination of kamma. What three? () Desire arises with reference to things in the past that are the basis for desire and lust. (2) Desire arises with reference to things in the future that are the basis for desire and lust. (3) Desire arises with reference to things presently existing that are the basis for desire and lust.",
    "an3.112:2": "() \"And how does desire arise with reference to things in the future that are the basis for desire and lust? One thinks about and mentally examines things in the future that are the basis for desire and lust. As one does so, desire arises. When desire springs up, one is fettered by those things. The mental infatuation is what I call the fetter. It is in this way that desire arises with reference to things in the future that are the basis for desire and lust.",
    "an3.112:3": "() \"And how does desire arise with reference to things presently existing that are the basis for desire and lust? One thinks about and mentally examines things presently existing that are the basis for desire and lust. As one does so, desire arises. When desire springs up, one is fettered by those things. The mental infatuation is what I call the fetter. It is in this way that desire arises with reference to things presently existing that are the basis for desire and lust.",
    "an3.112:4": "\"There are, bhikkhus, these threeothercauses for the origination of kamma. What three? Desire does not arise with reference to things in the past that are the basis for desire and lust. Desire does not arise with reference to things in the future that are the basis for desire and lust. Desire does not arise with reference to things presently existing that are the basis for desire and lust.",
    "an3.112:5": "(1) \"And how, bhikkhus, does desire not arise with reference to things in the past that are the basis for desire and lust? One understands the future result of things in the past that are the basis for desire and lust. Having understood the future result, one avoids it.[n.77] Here—and in the parallel passages below—I follow theCereading: …tadabhinivajjeti. Tadabhinivajjetvā cetasā abhivirājetvā.Be hastadabhinivatteti. Tadabhinivattetvā cetasā abhinivijjhitvā.Ee hastadabhinivaddhetiandtadabhinivaddhetvā, which cannot be correct. However, just below Ee agrees with Ce, as against Be, in readingabhivirājetvā.Having avoided it, one becomes dispassionate in mind, and having pierced through with wisdom, one sees.[n.78]Paññāya ativijjha passati.Mp:\"One sees having penetrated it with the wisdom of the path together with insight.\"It is in this way that desire does not arise with reference to things in the past that are the basis for desire and lust.",
    "an3.112:6": "(2) \"And how, bhikkhus, does desire not arise with reference to things in the future that are the basis for desire and lust? One understands the future result of things in the future that are the basis for desire and lust. Having understood the future result, one avoids it. Having avoided it, one becomes dispassionate in mind and, having pierced through with wisdom, one sees. It is in this way that desire does not arise with reference to things in the future that are the basis for desire and lust.",
    "an3.112:7": "(3) \"And how, bhikkhus, does desire not arise with reference to things presently existing that are the basis for desire and lust? One understands the future result of things presently existing that are the basis for desire and lust. Having understood the future result, one avoids it. Having avoided it, one becomes dispassionate in mind and, having pierced through with wisdom, one sees. It is in this way that desire does not arise with reference to things presently existing that are the basis for desire and lust."
}