{
    "an3.29:1": "\"Bhikkhus, there are these three kinds of persons found existing in the world. What three? The blind person, the one-eyed person, and the two-eyed person.",
    "an3.29:2": "() \"And what is the one-eyed person? Here, some person has the kind of eye with which one can acquire wealth not yet acquired and increase wealth already acquired, but he lacks the kind of eye with which one can know wholesome and unwholesome qualities, blameworthy and blameless qualities, inferior and superior qualities, dark and bright qualities with their counterparts. This is called the one-eyed person.",
    "an3.29:3": "() \"And what is the two-eyed person? Here, some person has the kind of eye with which one can acquire wealth not yet acquired and increase wealth already acquired, and he also has the kind of eye with which one can know wholesome and unwholesome qualities, blameworthy and blameless qualities, inferior and superior qualities, dark and bright qualities with their counterparts. This is called the two-eyed person.",
    "an3.29:4": "He does not possess such wealth,nor does he do deeds of merit;the blind man destitute of eyescasts an unlucky throw in both respects.",
    "an3.29:5": "The person described as one-eyedis a hypocrite who seeks wealth,sometimesrighteouslyand sometimesunrighteously.",
    "an3.29:6": "Both by thievish cheatful actsand by means of false speechthe man indulging in sensual pleasuresis skilled in amassing wealth.Having gone from here to hell,the one-eyed person is tormented.",
    "an3.29:7": "One with two eyes is said to bethe best kind of person.His wealth[n.365] Reading heredhanaṁwithCeand B. Eedhammaṁis clearly wrong.is acquired by his own exertion,with goods righteously gained.",
    "an3.29:8": "With best intentions he then gives,this person with an undivided mind.He goes torebirth inan excellent statewhere, having gone, one does not sorrow.",
    "an3.29:9": "One should avoid from afarthe blind one and the one-eyed person,but should befriend the one with two eyes,the best kind of person."
}