{
    "an3.123:1": "On one occasion the Blessed One was dwelling at Kusinārāā, in the Baliharaṇa forest thicket. There the Blessed One addressed the bhikkhus …",
    "an3.123:2": "\"Here, bhikkhus, a bhikkhu dwells in dependence on a certain village or town. A householder or a householder's son approaches him and invites him for the next day's meal. If he wishes, the bhikkhu accepts. When the night has passed, in the morning the bhikkhu dresses, takes his bowl and robe, and goes to the residence of that householder or householder's son. He sits down in the seat that has been prepared and that householder or householder's son, with his own hand, serves and satisfies him with various kinds of delicious food.",
    "an3.123:3": "(1) It occurs to him: ‘How good, indeed, that this householder or householder's son, with his own hand, serves and satisfies me with various kinds of delicious food!’ (2) It also occurs to him: ‘Oh, in the future too may this householder or householder's son, with his own hand, serve and satisfy me with a similar variety of delicious food!’ () He uses that food while being tied to it, infatuated with it, blindly absorbed in it, not seeing the danger in it and understanding the escape from it. He thinks sensual thoughts in relation to it; he thinks thoughts of ill will; he thinks thoughts of harming. What is given to such a bhikkhu, I say, is not of great fruit. For what reason? Because the bhikkhu is heedless.",
    "an3.123:4": "\"Here, a bhikkhu dwells in dependence on a certain village or town. A householder or a householder's son approaches him and invites him for the next day's meal. If he wishes, the bhikkhu accepts. When the night has passed, in the morning the bhikkhu dresses, takes his bowl and robe, and goes to the residence of that householder or householder's son. He sits down in the seat that has been prepared and that householder or householder's son, with his own hand, serves and satisfies him with various kinds of delicious food.",
    "an3.123:5": "(1) It does not occur to him: ‘How good, indeed, that this householderor householder's son, with his own hand, serves and satisfies me with various kinds of delicious food!’ (2) It also does not occur to him: ‘Oh, in the future too may this householder or householder's son, with his own hand, serve and satisfy me with a similar variety of delicious food!’ (3) He uses that food without being tied to it, infatuated with it, and blindly absorbed in it, but seeing the danger in it and understanding the escape from it. He thinks thoughts of renunciation in relation to it; he thinks thoughts of good will; he thinks thoughts of non-harming. What is given to such a bhikkhu, I say, is of great fruit. For what reason? Because the bhikkhu is heedful.\""
}