{
    "an3.60:1": "Then the brahmin Saṅgārava approached the Blessed One and exchanged greetings with him …. Then, sitting to one side, the brahmin Saṅgārava said this to the Blessed One:",
    "an3.60:2": "\"Well then, brahmin, I will question you about this matter. You should answer as you see fit. What do you think, brahmin? Here, a Tathāgata arises in the world, an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, an Enlightened One, a Blessed One. He says thus: ‘Come, this is the path, this is the way. Practicing in accordance with it, I have realized for myself with direct knowledge the unsurpassed culmination of the spiritual life[n.41]Anuttaraṁ brahmacariyogadhaṁ.Mp:\"Nibbāna is ‘the unsurpassed culmination of the spiritual life,’ the supreme support for the spiritual life, which is the path to arahantship\"(arahattamaggasaṅkhātassa brahmacariyassa anuttaraṁ ogadhaṁ uttamapatiṭṭhābhūtaṁ nibbānaṁ). InMN 44.51, I 304,1–,nibbānogadhaṁis used in conjunction withnibbānaparāyanaṁandnibbānapariyosānaṁ, which suggests that the three terms are synonymous. It –a I 11,11–1, glossesnibbānogadhagāmī(the same phrase as in AN) withnibbānasaṅkhātaṁ ogadhaṁ patiṭṭhaṁ pāraṁ gacchati(\"it goes to the far shore, the support, the culmination consisting in nibbāna\"). This explanation, which is consistent with other commentaries, supports my rendering ofnibbānogadhahere as \"culmination in nibbāna\" rather than \"the plunge into nibbāna,\" a rendering used by other translators. My rendering ofamatogadhain CDB (as atSN 45:139, SN46.184, SN48.4, SN48.44, etc.) as \"with the deathless as its ground\" is not satisfactory. I am grateful to Vanarata for his comments on this term.and make it known to others. Come, you too practice thus. Practicing in accordance with it, you too will realize for yourselves with direct knowledge the unsurpassed culmination of the spiritual life and dwell in it.’ Thus the teacher teaches this Dhamma and otherspractice accordingly. There are many hundreds, many thousands, many hundreds of thousands who do so.",
    "an3.60:3": "What do you think? When this is the case, is that act of going forth a meritorious practice that extends to one person or to many people?.",
    "an3.60:4": "When this was said, the Venerable Ānanda said to the brahmin Saṅgārava: \"Of these two practices, brahmin, which appeals to you more as being simpler and less harmful, and as being more fruitful and beneficial?.",
    "an3.60:5": "A second time the Venerable Ānanda said to the brahmin: \"Brahmin, I am not asking you whom you consider worthy of veneration and praise. I am asking you which of those two practices appeals to you as being simpler and less harmful, and also as more fruitful and beneficial?\"",
    "an3.60:6": "A third time the Venerable Ānanda said to the brahmin: \"Brahmin, I am not asking you whom you consider worthy of veneration and praise. I am asking you which of those two practices appeals to you as being simpler and less harmful, and also as more fruitful and beneficial?.",
    "an3.60:7": "Then the Blessed One thought: \"Even for a third time the brahmin Saṅgārava, on being asked a legitimate question by Ānanda, falters and does not answer. Let me release him.\" Then the Blessed One said to the brahmin Saṅgārava: \"What conversation, brahmin, arose today among the king's retinue when they assembled and were sitting in the royal palace?\"",
    "an3.60:8": "\"There are, brahmin, these three kinds of wonders. What three? The wonder of psychic potency, the wonder of mind-reading, and the wonder of instruction.[n.423]Iddhipāṭihāriyaṁ ādesanāpāṭihāriyaṁ anusāsanīpāṭihāriyaṁ. Also atDN 11.4–9, I 212–14.",
    "an3.60:9": "(2) \"And what, brahmin, is the wonder of mind-reading? There is one who, by means of some clue,[n.424]Nimittena ādisati.Mpexplains it as if it means an unrelated clue in the environment, but it may be a gesture or facial expression—what we now call \"body language\"—that reveals to a skilled observer the other person's state of mind.declares: ‘Your thought is thus, such is what you are thinking, your mind is in such and such a state.’ And even if he makes many declarations, they are exactly so and not otherwise.",
    "an3.60:10": "\"Again, someone does not declarethe state of mindon the basis of a clue,but he hears the sound of people, spirits, or deities (speaking) and then declares: ‘Your thought is thus, such is what you are thinking, your mind is in such and such a state.’ And even if he makes many declarations, they are exactly so and not otherwise.",
    "an3.60:11": "\"Again, someone does not declarethe state of mindon the basis of a mark, or by hearing the sound of people, spirits, or deitiesspeaking, but he hears the sound of the diffusion of thought[n.425]Vitakkavipphārasaddaṁ sutvā.Mp:\"Having heard the sound of those muttering while asleep or oblivious, which (sound) arises by the diffusion of thought.\" I suspect that Mp misses the point. Since the examples in the sutta proceed from the coarser to the subtler, this one should be subtler than its predecessor. I think that what is intended is a subtle sound supposedly emanated by thought but not expressed verbally.as one is thinking and examining (some matter) and then declares: ‘Your thought is thus, such is what you are thinking, your mind is in such and such a state.’ And even if he makes many declarations, they are exactly so and not otherwise.",
    "an3.60:12": "\"Again, someone does not declare (the state of mind) on the basis of a mark, or by hearing the sound of people, spirits, or deities (speaking), or by hearing the sound of the diffusion of thought as one is thinking and examining (some matter), but with his own mind he encompasses the mind of one who has attained concentration without thought and examination and he understands: ‘This person's mental activities are so disposed that immediately afterward he will think this thought.’[n.426] This must be referring to one in the second or higher jhānas.And even if he makes many declarations, they are exactly so and not otherwise. This is called the wonder of mind-reading.",
    "an3.60:13": "(3) \"And what, brahmin, is the wonder of instruction? Here, someone instructs (others) thus: ‘Think in this way and not in that way! Attend to this and not to that! Abandon this and enter and dwell in that!’ This is called the wonder of instruction.[n.427]Mpgives examples: \"Think thoughts of desirelessness, not thoughts of sensuality, etc. Attend to the idea of impermanence, etc., not to permanence, etc. Abandon lust for sensual pleasure and enter a world-transcending path and fruit.\"",
    "an3.60:14": "\"Among these, Master Gotama, when someone performs this wonder by which he wields the various kinds of psychic potency … exercises mastery with the body as far as the brahmā world, only the one who performs this wonder experiences it and it occurs only to him. This wonder seems to me like a magical trick.",
    "an3.60:15": "\"Again, Master Gotama, when someone performs this wonder by which he declares another's state of mind on the basis of a clue … by hearing the sound of people, spirits, or deities … by hearing the sound of the diffusion of thought while he is thinking and examining (some matter) … by encompassing with his own mind the mind of one who has attained concentration that is without thought and examination such that he understands:‘This person's mental activities are so disposed that immediately afterward he will think this thought,’ and, even if he makes many declarations, they are exactly so and not otherwise—again, only the one who performs this wonder experiences it and it occurs only to him. This wonder, too, seems to me like a magical trick.",
    "an3.60:16": "\"But, Master Gotama, when someone performs this wonder by which he instructs (others) thus: ‘Think in this way and not in that way! Attend to this and not to that! Abandon this and enter and dwell in that!’—this wonder appeals to me as the most excellent and sublime of those three wonders.",
    "an3.60:17": "\"It is astounding and amazing, Master Gotama, how well this has been stated by Master Gotama! We consider Master Gotama to be one who can perform these three wonders. For Master Gotama wields the various kinds of psychic potency … exercises mastery with the body as far as the brahmā world. Master Gotama encompasses with his own mind the mind of one who has attained concentration that is without thought and examination such that he understands: ‘This person's mental activities are so disposed that immediately afterward he will think this thought.’ And Master Gotama instructs (others) thus: ‘Think in this way and not in that way! Attend to this and not to that! Abandon this and enter and dwell in that!’\"",
    "an3.60:18": "\"Surely, brahmin, your words are prying and intrusive.[n.428]Āsajja upanīya vācā bhāsitā.Āsajjausually means \"having attacked,\" but this meaning seems too strong here.Mpmerely paraphrases without giving much help: \"The words you spoke hit upon my virtues and intrude on the domain of my virtues\"(mama guṇe ghaṭṭetvā mam’eva guṇānaṁ santikaṁ upanītā vācā bhāsitā). I therefore assume that the words, without being insulting, are considered inappropriate because they are making a personal inquiry.Nevertheless, I will answer you. I do wield the various kinds of psychic potency … exercise mastery with the body as far as the brahmā world. I do encompass with my own mind the mind of one who has attained a state of concentration that is without thought and examination such that I understand: ‘This person's mental activities are so disposed that immediately afterward he will think this thought.’ And I do instruct (others) thus: ‘Think in this way and not in that way! Attend to this and not to that! Abandon this and enter and dwell in that!’\"",
    "an3.60:19": "\"But, Master Gotama, is there even one other bhikkhu apart from Master Gotama who can perform these three wonders?.",
    "an3.60:20": "\"Excellent, Master Gotama! … Let Master Gotama consider me a lay follower who from today has gone for refuge for life.\""
}