{
    "an3.68:1": "\"Bhikkhus, wanderers of other sects may ask you: ‘Friends, there are these three things. What three? Greed, hatred, and delusion. These are the three. What, friends, is the distinction, the disparity, the difference between them?’ If you are asked this, how would you answer?.",
    "an3.68:2": "\"Bhikkhus, if wanderers of other sects should ask you such a question,you should answer them as follows: ‘Lust, friends, is slightly blameworthy but slow to fade away; hatred is very blameworthy but quick to fade away; delusion is very blameworthy and slow to fade away.’[n.471]Mpillustrates how lust is \"less blameworthy\" with the example of marriage, which, though rooted in sexual desire, is socially accepted and thus less blameworthy in regard to its kammic consequences. But since lust is connected with pleasure, it is hard to remove. Hatred and delusion are both regarded as blamable in society and have serious kammic consequences. Hatred, however, is connected with displeasure, and since beings naturally desire happiness they want to be rid of it. Delusive ideas, if deeply rooted in craving, wrong views, or conceit, will be as hard to remove as lust.",
    "an3.68:3": "(1) \"(Suppose they ask:) ‘But, friends, what is the reason unarisen lust arises and arisen lust increases and expands?’ You should answer: ‘An attractive object. For one who attends carelessly to an attractive object, unarisen lust arises and arisen lust increases and expands. This, friends, is the reason unarisen lust arises and arisen lust increases and expands.’",
    "an3.68:4": "(2) \"(Suppose they ask:) ‘But what, friends, is the reason unarisen hatred arises and arisen hatred increases and expands?’ You should answer: ‘A repulsive object. For one who attends carelessly to a repulsive object, unarisen hatred arises and arisen hatred increases and expands. This, friends, is the reason unarisen hatred arises and arisen hatred increases and expands.’",
    "an3.68:5": "(3) \"(Suppose they ask:) ‘But what, friends, is the reason unarisen delusion arises and arisen delusion increases and expands?’ You should answer: ‘Careless attention. For one who attends carelessly, unarisen delusion arises and arisen delusion increases and expands. This, friends, is the reason unarisen delusion arises and arisen delusion increases and expands.’",
    "an3.68:6": "(1) \"(Suppose they ask:) ‘But what, friends, is the reason unarisen lust does not arise and arisen lust is abandoned?’ You should answer: ‘An unattractive object. For one who attends carefully to an unattractive object, unarisen lust does not ariseand arisen lust is abandoned. This, friends, is the reason unarisen lust does not arise and arisen lust is abandoned.’",
    "an3.68:7": "(2) \"(Suppose they ask:) ‘But what, friends, is the reason unarisen hatred does not arise and arisen hatred is abandoned?’ You should answer: ‘The liberation of the mind by loving-kindness. For one who attends carefully to the liberation of the mind by loving-kindness, unarisen hatred does not arise and arisen hatred is abandoned. This, friends, is the reason unarisen hatred does not arise and arisen hatred is abandoned.’",
    "an3.68:8": "(3) \"(Suppose they ask:) ‘But what, friends, is the reason unarisen delusion does not arise and arisen delusion is abandoned?’ You should answer: ‘Careful attention. For one who attends carefully, unarisen delusion does not arise and arisen delusion is abandoned. This, friends, is the reason unarisen delusion does not arise and arisen delusion is abandoned.’\""
}