{
    "an3.70:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Migāramātā's Mansion in the Eastern Park. Then Visākhā Migāramātā, on the day of the uposatha, approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to her.",
    "an3.70:2": "\"There are, Visākhā, three kinds of uposathas. What three? The cowherds’ uposatha, the Nigaṇṭhas’ uposatha,[n.474] The Nigaṇṭhas are the Jain ascetics, followers of Mahāvīra, the best known teacher of Jainism, known in the Nikāyas as the Nigaṇṭha Nātaputta (Nāthaputta, Ñātaputta). He was a contemporary of the Buddha and is included among the six rival teachers (seeDN .30, I 5–59). It will be noted how, whenever the Nikāyas discuss the Jains, their tone becomes derisive if not acerbic. The compliments, of course, were returned by the Jains. This can be readily understood from the fact that the Buddhists and Jains originally flourished in the same territories and, as mendicant orders, they must have been in competition for supporters from the same communities.and the noble ones’ uposatha.",
    "an3.70:3": "(2) \"And how, Visākhā, is the Nigaṇṭhas’ uposatha observed? There are, Visākhā, ascetics called Nigaṇṭhas. They enjoin their disciples thus: ‘Come, good man, lay down the rod toward living beings dwelling more than a hundredyojanas’ distance in the eastern quarter.[n.475]Ye puratthimāya disāya pāṇā paraṁ yojanasataṁ tesu daṇḍaṁ nikkhipāhi.Mpglosses: \"Lay down the rod and be nonviolent toward those living beings dwelling in regions farther than a hundredyojanas\"(tesu yojanasatato parabhāgesu ṭhitesu sattesu daṇḍaṁ nikkhipa,nikkhittadaṇḍo hohi). Ayojanais between seven and nine miles. Thus the Jains are depicted as saying, \"It's only toward beings living far away from you that you should be nonviolent,\" as if they were permitted to be violent against those living close by. This, it seems, is contrary to the Jain teaching, which enjoins strict nonviolence(ahiṁsā)in regard to all beings under all conditions. Seehttp://www.jainworld.com/philosophy/ahimsa.asp.Lay down the rod toward living beings dwelling more than a hundredyojanas’ distance in the western quarter. Lay down the rod toward living beings dwelling more than a hundredyojanas’ distance in the northern quarter. Lay down the rod toward living beings dwelling more than a hundredyojanas’ distance in the southern quarter.’ Thus they enjoin them to be sympathetic and compassionate toward some living beings, but not to others. On the uposatha day, they enjoin their disciples thus: ‘Come, good man, having laid aside all clothes, recite: ‘I am not anywhere the belonging of anyone, nor is there anywhere anything in any place that is mine.’[n.476]Nāhaṁ kvacana,kassaci kiñcanatasmiṁ,na ca mama kvacana,katthaci kiñcanatātthi. Ce, Be, and Ee differ slightly among themselves in their reading of this formula. I follow Ce here and later atAN4.185. The purpose of the formula, according to this text, is to instill an attitude of non-possessiveness, one of the basic Jain virtues. The Buddha also taught this formula—which may have been in circulation among various contemplative communities—using it as a means to eliminate \"I-making\" and \"mine-making.\" For further discussion of the formula, seeAN4.185, n. 896.However, his parents know: ‘This is our son.’ And he knows: ‘These are my parents.’ His wife and children know: ‘He is our supporter.’ And he knows: ‘These are my wife and children.’ His slaves, workers, and servants know: ‘He is our master.’ And he knows: ‘These are my slaves, workers, and servants.’ Thus on an occasion when they should be enjoined in truthfulness, (the Nigaṇṭhas) enjoin them in false speech. This, I say, is false speech. When that night has passed, he makes use of possessions that have not been given. This, I say, is taking what has not been given. It is in such a way that the Nigaṇṭhas’ uposatha is observed. When one has observed the uposatha in the way of the Nigaṇṭhas, the uposatha is not of great fruit and benefit, nor is it extraordinarily brilliant and pervasive.",
    "an3.70:4": "(3) \"And how, Visākhā, is the noble ones’ uposatha observed?The defiled mind is cleansed by exertion.[n.77]Upakkiliṭṭhassa visākhe cittassa upakkamena pariyodapanā hoti.Mp:\"Why does he say this? Because the uposatha is not very fruitful if one observes it with a defiled mind, but becomes very fruitful if it is observed with a purified mind. He thus makes this statement to introduce the meditation subjects to be used for purifying the mind.\" What follows here are five of the standard six recollections(cha anussatiyo; seeAN6.10, etc.). For some reason, the sixth recollection, of generosity(cāgānussati), is omitted. The omission would seem, at first blush, to result from a fault in transmission. However, the Chinese parallel, MĀ 202 (at T I 770a16–773a1), also lacks this recollection, which suggests that the omission—whether accidental or deliberate—preceded the split between the Vibhajjavādins (the ancestors of the Theravāda) and the Sarvāstivādins. Interestingly, in MĀ 202 the eight preceptsprecedethe five recollections, while the Pāli has the sets in reverse. The sequence of the Chinese version is more consistent with other Buddhist teachings, which treat virtuous conduct as the basis for meditation.And how is the defiled mind cleansed by exertion? Here, Visākhā, a noble disciple recollects the Tathāgata thus: ‘The Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’ When a noble disciple recollects the Tathāgata, his mind becomes placid, joy arises, and the defilements of the mind are abandoned in the same way that one's head, when dirty, is cleansed by exertion.",
    "an3.70:5": "\"And how, Visākhā, does one cleanse a dirty head by exertion? By means of cleansing paste, clay, water, and the appropriate effort by the person. It is in such a way that one's head, when dirty, is cleansed by exertion. So too, the defiled mind is cleansed by exertion.",
    "an3.70:6": "And how is the defiled mind cleansed by exertion? Here, Visākhā, a noble disciple recollects the Tathāgata thus: ‘The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.’ When a noble disciple recollects the Tathāgata, his mind becomes placid, joy arises, and the defilements of the mind are abandoned. This is called a noble disciple who observes the uposatha of Brahmā, who dwells together with Brahmā, and it is by considering Brahmā that his mind becomes placid, joy arises, and the defilements of the mind are abandoned.[n.478]Mp:\"It is the perfectly enlightened Buddha who is called Brahmā\"(brahmā vuccati sammā sambuddho).It is in this way that the defiled mind is cleansed by exertion.",
    "an3.70:7": "\"The defiled mind, Visākhā, is cleansed by exertion. And how is the defiled mind cleansed by exertion? Here, Visākhā, a noble disciple recollects the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’ When a noble disciple recollects the Dhamma, his mind becomes placid, joy arises, and the defilements of the mindare abandoned in the same way that one's body, when dirty, is cleansed by exertion.",
    "an3.70:8": "\"And how, Visākhā, does one cleanse a dirty body by exertion? By means of a bathing brush, lime powder, water, and the appropriate effort by the person. It is in such a way that one's body, when dirty, is cleansed by exertion. So too, the defiled mind is cleansed by exertion.",
    "an3.70:9": "And how is the defiled mind cleansed by exertion? Here, Visākhā, a noble disciple recollects the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One … to be personally experienced by the wise.’ When a noble disciple recollects the Dhamma, his mind becomes placid, joy arises, and the defilements of the mind are abandoned. This is called a noble disciple who observes the uposatha of the Dhamma, who dwells together with the Dhamma, and it is by considering the Dhamma that his mind becomes placid, joy arises, and the defilements of the mind are abandoned. It is in this way that the defiled mind is cleansed by exertion.",
    "an3.70:10": "\"The defiled mind, Visākhā, is cleansed by exertion. And how is the defiled mind cleansed by exertion? Here, Visākhā, a noble disciple recollects the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practicing the good way, practicing the straight way, practicing the true way, practicing the proper way; that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’ When a noble disciple recollects the Saṅgha, his mind becomes placid, joy arises, and the defilements of the mind are abandoned in the same way that a dirty cloth is cleansed by exertion.",
    "an3.70:11": "\"And how, Visākhā, does one cleanse a dirty cloth by exertion?By means of heat, lye, cow dung, water, and the appropriate effort by the person. It is in such a way that a dirty cloth is cleansed by exertion. So too, the defiled mind is cleansed by exertion.",
    "an3.70:12": "And how is the defiled mind cleansed by exertion? Here, Visākhā, a noble disciple recollects the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practicing the good way … the unsurpassed field of merit for the world.’ When a noble disciple recollects the Saṅgha, his mind becomes placid, joy arises, and the defilements of the mind are abandoned. This is called a noble disciple who observes the uposatha of the Saṅgha, who dwells together with the Saṅgha, and it is by considering the Saṅgha that his mind becomes placid, joy arises, and the defilements of the mind are abandoned. It is in this way that the defiled mind is cleansed by exertion.",
    "an3.70:13": "\"The defiled mind, Visākhā, is cleansed by exertion. And how is the defiled mind cleansed by exertion? Here, Visākhā, a noble disciple recollects his own virtuous behavior as unbroken, flawless, unblemished, unblotched, freeing, praised by the wise, ungrasped, leading to concentration. When a noble disciple recollects his virtuous behavior, his mind becomes placid, joy arises, and the defilements of the mind are abandoned in the same way that a dirty mirror is cleansed by exertion.",
    "an3.70:14": "\"And how, Visākhā, is a dirty mirror cleansed by exertion? By means of oil, ashes, a roll of cloth, and the appropriate effort by the person. It is in such a way that a dirty mirror is cleansed by exertion. So too, the defiled mind is cleansed by exertion.",
    "an3.70:15": "And how is the defiled mind cleansed by exertion?Here, Visākhā, a noble disciple recollects his own virtuous behavior as unbroken … leading to concentration. When a noble disciple recollects his virtuous behavior, his mind becomes placid, joy arises, and the defilements of the mind are abandoned. This is called a noble disciple who observes the uposatha of virtuous behavior, who dwells together with virtuous behavior, and it is by considering virtuous behavior that his mind becomes placid, joy arises, and the defilements of the mind are abandoned. It is in this way that the defiled mind is cleansed by exertion.",
    "an3.70:16": "\"The defiled mind, Visākhā, is cleansed by exertion. And how is the defiled mind cleansed by exertion? Here, Visākhā, a noble disciple recollects the deities thus: ‘There are devas (ruled by) the four great kings, Tāvatiṁsa devas, Yāma devas, Tusita devas, devas who delight in creation, devas who control what is created by others, devas of Brahmā's company, and devas still higher than these.[n.479] These are the six sense-sphere heavenly realms. The devas higher than these belong to the form and formless realms.I too have such faith as those deities possessed because of which, when they passed away here, they were reborn there; I too have such virtuous behavior … such learning … such generosity … such wisdom as those deities possessed because of which, when they passed away here, they were reborn there.’ When a noble disciple recollects the faith, virtuous behavior, learning, generosity, and wisdom in himself and in those deities, his mind becomes placid, joy arises, and the defilements of the mind are abandoned in the same way that impure gold is cleansed by exertion.",
    "an3.70:17": "\"And how, Visākhā, is impure gold cleansed by exertion? By means of a furnace, salt, red chalk, a blow-pipe and tongs, and the appropriate effort by the person. It is in such a way that impure gold is cleansed by exertion. So too, the defiled mind is cleansed by exertion.",
    "an3.70:18": "And how is the defiled mind cleansed by exertion? Here, Visākhā, a noble disciple recollects the deities thus: ‘There are devas (ruled by) the four great kings … and devas still higher than these. I too have such faith … such wisdom as those deities possessed because of which, when they passed away here, they were reborn there.’ When a noble disciple recollects the faith, virtuous behavior, learning, generosity, and wisdom in himself and in those deities, his mind becomes placid, joy arises, and the defilements of the mind are abandoned. This is called a noble disciple who observes the uposatha of the deities, who dwells together with the deities, and it is by considering the deities that his mind becomes placid, joy arises, and the defilements of the mind are abandoned. It is in this way that the defiled mind is cleansed by exertion.",
    "an3.70:19": "(i) \"This noble disciple, Visākhā, reflects thus:[n.480] At this point, the Buddha explains the eight precepts undertaken by lay followers on the uposatha days. These appear again in AN atAN8.41–45. They correspond closely to the ten precepts of the novice monk, with the seventh and eighth joined and the tenth (abstaining from acceptance of gold and silver, that is, money) omitted.‘As long as they live the arahants abandon and abstain from the destruction of life; with the rod and weapon laid aside, conscientious and kindly, they dwell compassionate toward all living beings. Today, for this night and day, I too shall abandon and abstain from the destruction of life; with the rod and weapon laid aside, conscientious and kindly, I too shall dwell compassionate toward all living beings. I shall imitate the arahants in this respect and the uposatha will be observed by me.",
    "an3.70:20": "(ii) \"‘As long as they live the arahants abandon and abstain from taking what is not given; they take only what is given, expect only what is given, and are honest at heart, devoid of theft. Today, for this night and day, I too shall abandon and abstain from taking what is not given; I shall accept only what is given, expect only what is given, and be honest at heart, devoid of theft. I shall imitate the arahants in this respect and the uposatha will be observed by me.",
    "an3.70:21": "(iii) \"‘As long as they live the arahants abandon sexual activity and observe celibacy, living apart, abstaining from sexual intercourse, the common person's practice. Today, for this night and day, I too shall abandon sexual activity and observe celibacy, living apart, abstaining from sexual intercourse, the common person's practice. I shall imitate the arahants in this respect and the uposatha will be observed by me.",
    "an3.70:22": "(iv) \"‘As long as they live the arahants abandon and abstain from false speech; they speak truth, adhere to truth; they are trustworthy and reliable, no deceivers of the world. Today, for this night and day, I too shall abandon and abstain from false speech; I shall be a speaker of truth, an adherent of truth, trustworthy and reliable, no deceiver of the world. I shall imitate the arahants in this respect and the uposatha will be observed by me.",
    "an3.70:23": "(v) \"‘As long as they live the arahants abandon and abstain from liquor, wine, and intoxicants, the basis for heedlessness. Today, for this night and day, I too shall abandon and abstain from liquor, wine, and intoxicants, the basis for heedlessness. I shall imitate the arahants in this respect and the uposatha will be observed by me.",
    "an3.70:24": "(vi) \"‘As long as they live the arahants eat once a day,[n.481]Ekabhattika. This might also have been rendered \"eat in one part of the day.\"Mp:\"There are two meal (periods), the morning meal (period) and the evening meal (period). The morning meal (period) ends at midday; the evening meal (period) extends from midday until the following daybreak. Therefore even those who eat ten times before noon are said to eat once a day.\"abstaining from eating at night and from food outside the proper time. Today, for this night and day, I too shall eat once a day, abstaining from eating at night and from food outside the proper time. I shall imitate the arahants in this respect and the uposatha will be observed by me.",
    "an3.70:25": "(vii) \"‘As long as they live the arahants abstain from dancing, singing, instrumental music, and unsuitable shows, and from adorning and beautifying themselves by wearing garlands and applying scents and unguents. Today, for this night and day, I too shall abstain from dancing, singing, instrumental music, and unsuitable shows, and from adorning and beautifying myself by wearing garlands and applying scents and unguents. I shall imitate the arahants in this respect and the uposatha will be observed by me.",
    "an3.70:26": "(viii) \"‘As long as they live the arahants abandon and abstain from the use of high and luxurious beds; they lie down on a low resting place, either a small bed or a straw mat. Today, for this night and day, I too shall abandon and abstain from the use of high and luxurious beds; I shall lie down on a low resting place, either a small bed or a straw mat. I shall imitate the arahants in this respect and the uposatha will be observed by me.’",
    "an3.70:27": "\"It is in this way, Visākhā, that the noble ones’ uposatha is observed. When one has observed the uposatha in the way of the noble ones it is of great fruit and benefit, extraordinarily brilliant and pervasive.",
    "an3.70:28": "\"To what extent is it of great fruit and benefit? To what extent is it extraordinarily brilliant and pervasive? Suppose, Visākhā, one were to exercise sovereignty and kingship over these sixteen great countries abounding in the seven precious substances,[n.482] Cepahūtasattaratanānaṁ; Bepahūtarattaratanānaṁ; Eepahūtamahāsattaratanānaṁ.Mp(Ce and Be) readspahūtarattaratanānaṁ, but Mp (Ee) has–satta- here.Mpexplains: \"Possessed of abundant precious substances consisting inratta; the meaning is that it is filled with the seven precious substances so that, if the surface of Jambudīpa (the Indian subcontinent) were the size of the surface of abheridrum, the amount of seven substances would be the size of one's waist.\" There is thus an ambiguity about whether the original reading had–satta- or–ratta-. Mp-ṭ states that the wordrattais a synonym for precious substance(ratta-saddo ratanapariyāyo), but also says that the readingpahūtasattaratanānaṁis found in the text. I translate on the basis of the latter reading.that is, (the countries of) the Angans, the Magadhans, the Kāsis, the Kosalans, the Vajjis, the Mallas, the Cetis, the Vangas, the Kurus, the Pañcālas, the Macchas, the Sūrasenas, the Assakas, the Avantis, the Gandhārans, and the Kambojans:[n.483] Most of these states are located in the Indian subcontinent, but Gandhāra and Kamboja were in the northwest, corresponding to parts of modern Pakistan and Afghanistan.this would not be worth a sixteenth part of the uposatha observance complete in those eight factors. For what reason? Because human kingship is poor compared to celestial happiness.",
    "an3.70:29": "\"For the devas (ruled by) the four great kings,[n.484] Here begins a cosmological overview of the six sense-sphere heavens.a single night and day is equivalent to fifty human years; thirty such days make up a month, and twelve such months make up a year. The life span of the devas (ruled by) the four great kings is five hundred such celestial years. It is possible, Visākhā, that a woman or man here who observes the uposatha complete in these eight factors will, with the breakup of the body, after death, be reborn in companionship with the devas (ruled by) the four great kings. It was with reference to this that I said human kingship is poor compared to celestial happiness.",
    "an3.70:30": "\"For the Tāvatiṁsa devas a single night and day is equivalent to a hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of the Tāvatiṁsa devas is a thousand such celestial years. It is possible, Visākhā, that a woman or man here who observes the uposatha complete in these eight factors will, with the breakup of the body, after death, be reborn in companionship with the Tāvatiṁsa devas. It was with reference to this that I said human kingship is poor compared to celestial happiness.",
    "an3.70:31": "\"For the Yāma devas a single night and day is equivalent to two hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of the Yāma devas is two thousand such celestial years. It is possible, Visākhā, that a woman or man here who observes the uposatha complete in these eight factors will, with the breakup of the body, after death, be reborn in companionship with the Yāma devas. It was with reference to thisthat I said human kingship is poor compared to celestial happiness.",
    "an3.70:32": "\"For the Tusita devas, a single night and day is equivalent to four hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of the Tusita devas is four thousand such celestial years. It is possible, Visākhā, that a woman or man here who observes the uposatha complete in these eight factors will, with the breakup of the body, after death, be reborn in companionship with the Tusita devas. It was with reference to this that I said human kingship is poor compared to celestial happiness.",
    "an3.70:33": "\"For the devas who delight increation, a single night and day is equivalent to eight hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of the devas who delight in creation is eight thousand such celestial years. It is possible, Visākhā, that a woman or man here who observes the uposatha complete in these eight factors will, with the breakup of the body, after death, be reborn in companionship with the devas who delight in creation. It was with reference to this that I said human kingship is poor compared to celestial happiness.",
    "an3.70:34": "\"For the devas who control what is created by others, a single night and day is equivalent to sixteen hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of the devas who control what is created by others is sixteen thousand such celestial years. It is possible, Visākhā, that a woman or man here who observes the uposatha complete in these eight factors will, with the breakup of the body, after death, be reborn in companionship with the devas who control what is created by others. It was with reference to this that I said human kingship is poor compared to celestial happiness.\"",
    "an3.70:35": "One should not kill living beings or take what is not given;one should not speak falsehood or drink intoxicants;one should refrain from sexual activity, from unchastity;one should not eat at night or at an improper time.",
    "an3.70:36": "One should not wear garlands or apply scents;one should sleep on a (low) bed or a mat on the ground;this, they say, is the eight-factored uposathaproclaimed by the Buddha,who reached the end of suffering.",
    "an3.70:37": "As far as the sun and moon revolve,shedding light, so beautiful to gaze upon,dispellers of darkness, moving through the firmament,they shine in the sky,[n.485] Reading withBeand Eenabhe pabhāsanti, as against Cenabhe pabhāsenti, \"lighting up the skies.\"brightening up the quarters.",
    "an3.70:38": "Whatever wealth exists in this sphere—pearls, gems, and excellent beryl,[n.486] FollowingMp,I understandbhaddakaṁhere to be merely a qualification ofveḷuriyaṁ, not a separate type of precious stone.horn gold and mountain gold,and the natural gold calledhaṭaka—[n.487]Mp:\"Horn gold(siṅgīsuvaṇṇa)is gold similar (in color) to a cow's horn(gosiṅgasadisa). Mountain gold(kañcana)is gold found on a mountain. Natural gold(jātarūpa)is gold the color of the Buddha.Haṭakais gold removed by ants.\"",
    "an3.70:39-40": "those are not worth a sixteenth partof an uposatha complete in the eight factors,just as all the hosts of stars(do not match) the moon's radiance.[n.488]Candappabhā.Mp:\"A nominative used in a genitive sense, meaning ‘to the moon's radiance’(candappabhāya).\"Therefore a virtuous woman or man,having observed the uposatha complete in eight factors,and having made merit productive of happiness,goes blameless to a heavenly state."
}