{
    "an4.67:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion, in Sāvatthī, a certain bhikkhu had been bitten by a snake and had died.[n.758] The incident is also recorded at Vin II 09–0.Then a number of bhikkhus approached the Blessed One, paid homage to him, sat down to one side, and said: \"Bhante, a certain bhikkhu here in Sāvatthī was bitten by a snake and died.\"",
    "an4.67:2": "The Blessed One said:\"Surely, bhikkhus, that bhikkhu did not pervade the four royal families of snakes[n.759]Imāni cattāri ahirājakulāni.Mp:\"This is said with reference to thosesnakeswhose bite is venomous. For all those with a venomous bite are included in these four royal families of snakes.\"with a mind of loving-kindness. For if he had done so, he would not have been bitten by a snake and died. What are the four? Thevirūpakkharoyal family of snakes, theerāpatharoyal family of snakes, thechabyāputtaroyal family of snakes, and the blackgotamakaroyal family of snakes. Surely, that bhikkhu did not pervade these four royal families of snakes with a mind of loving-kindness. For if he had done so, he would not have been bitten by a snake and died.",
    "an4.67:4": "\"I enjoin you, bhikkhus, to pervade these four royal families of snakes with a mind of loving-kindness, for your own security, safety, and protection.\"",
    "an4.67:5": "I have loving-kindness for thevirūpakkhasnakes;for theerāpathasnakes I have loving-kindness.I have loving-kindness for thechabyāputtasnakes;for the blackgotamakasI have loving-kindness.",
    "an4.67:6": "I have loving-kindness for footless creatures;for those with two feet I have loving-kindness.I have loving-kindness for those with four feet;for those with many feet I have loving-kindness.",
    "an4.67:7": "May footless beings not harm me;may no harm come to me from those with two feet;may four-footed beings not harm me;may no harm come to me from those with many feet.",
    "an4.67:8": "May all beings, all living things,all creatures, every one,meet with good fortune;may nothing bad come to anyone.",
    "an4.67:9": "The Buddha is measureless, the Dhamma is measureless, the Saṅgha is measureless;",
    "an4.67:10": "Creeping things, snakes, scorpions, centipedes, spiders, lizards, and rats are finite.I have made a safeguard, I have made protection. Let the creatures retreat. I pay homage to the Blessed One, homage to the seven Perfectly Enlightened Ones.[n.760]Beformats this declaration as verse, but I follow Ce and Ee in taking it as prose. This is an asseveration of truth(saccakiriya)and, as such, belongs with the verses, but since no meter is apparent, it is unlikely to be actual verse. The asseveration is commonly recited by forest monks as a safeguard against snakebites. It is often incorporated into their daily recitation."
}