{
    "an4.177:1": "Then the Venerable Rāhula approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:[n.887] Much of this is also inMN 62.2–5, I 42–23. See tooMN 28andMN 40, which treat the topic more elaborately.",
    "an4.177:2": "(1) \"Rāhula, the internal earth element and the external earth element are just the earth element. This should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ Having seen this thus as it really is with correct wisdom, one becomes disenchanted with the earth element; one detaches the mind from the earth element.[n.888]Ee'spaññāya cittaṁ virājetiis clearly wrong. In each of the four paragraphs,paññāyahere should be replaced by the name of the element.",
    "an4.177:3": "(2) \"Rāhula, the internal water element and the external water elementare just the water element. This should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ Having seen this thus as it really is with correct wisdom, one becomes disenchanted with the water element; one detaches the mind from the water element.",
    "an4.177:4": "(3) \"Rāhula, the internal fire element and the external fire element are just the fire element. This should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ Having seen this thus as it really is with correct wisdom, one becomes disenchanted with the fire element; one detaches the mind from the fire element.",
    "an4.177:5": "(4) \"Rāhula, the internal air element and the external air element are just the air element. This should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ Having seen this thus as it really is with correct wisdom, one becomes disenchanted with the air element; one detaches the mind from the air element.",
    "an4.177:6": "\"When, Rāhula, a bhikkhu does not recognize a self or the belongings of a self in these four elements, he is called a bhikkhu who has cut off craving, stripped off the fetter, and by completely breaking through conceit, has made an end of suffering.\""
}