{
    "an4.193:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Then Bhaddiya the Licchavi approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an4.193:2": "\"Bhante, I have heard this: ‘The ascetic Gotama is a magician who knows a converting magic by which he converts the disciples of teachers of other sects.’ Do those who speak thus state what has been said by the Blessed One and not misrepresent him with what is contrary to fact? Do they explain in accordance with the Dhamma so that they do not incur any reasonable criticism or ground for censure? For we do not want to misrepresent the Blessed One.\"[n.907] This charge is also at SN4:13, IV 340,3–9. According toMN 56.33, I 375,4–6, it originated among the Jains.",
    "an4.193:3": "\"Come, Bhaddiya, do not go by oral tradition, by lineage of teaching, by hearsay, by a collection of scriptures, by logical reasoning, by inferential reasoning, by reasoned cogitation, by the acceptance of a view after pondering it, by the seeming competenceof a speaker, or because you think: ‘The ascetic is our guru.’ But when you know for yourself: ‘These things are unwholesome; these things are blameworthy; these things are censured by the wise; these things, if accepted and undertaken, lead to harm and suffering,’ then you should abandon them.[n.908] This is the Buddha’s advice to the Kālāmas atAN.65. The interrogation that follows also parallels that used with the Kālāmas, but with an additional unwholesome motive.",
    "an4.193:4": "(1) \"What do you think, Bhaddiya? When greed arises in a person, is it for his welfare or for his harm?\"",
    "an4.193:5": "(2) \"What do you think, Bhaddiya? When hatred … (3) … delusion … (4) … vehemence arises in a person, is it for his welfare or for his harm?\"[n.909]BHSDdefinessārambhaas \"quarrelsomeness\" and connects the word with Sktsaṁrambha, which SED explains as \"the act of grasping or taking hold of,\" and gives as meanings \"vehemence, impetuosity … fury, wrath against.\" Since the sutta speaks aboutsārambhaas occurring through body, speech, and mind, I settle for \"vehemence.\"",
    "an4.193:6": "\"What do you think, Bhaddiya? Are these things wholesome or unwholesome?\" – \"Unwholesome, Bhante.\" – \"Blameworthy or blameless?\" – \"Blameworthy, Bhante.\" – \"Censured or praised by the wise?\" – \"Censured by the wise, Bhante.\" – \"Accepted and undertaken, do they lead to harm and suffering or not, or how do you take it?\" – \"Accepted and undertaken, these things lead to harm and suffering. So we take it.\"",
    "an4.193:7": "\"Thus, Bhaddiya, when we said: ‘Come, Bhaddiya, do not go by oral tradition …… But when you know for yourself: \"These things are unwholesome; these things are blameworthy; these things are censured by the wise; these things, if undertaken and practiced, lead to harm and suffering,\" then you should abandon them,’ it is because of this that this was said.",
    "an4.193:8": "\"Come, Bhaddiya, do not go by oral tradition, by lineage of teaching, by hearsay, by a collection of texts, by logical reasoning, by inferential reasoning, by reasoned cogitation, by the acceptance of a view after pondering it, by the seeming competenceof a speaker, or because you think: ‘The ascetic is our guru.’ But when you know for yourself: ‘These things are wholesome; these things are blameless; these things are praised by the wise; these things, if accepted and undertaken, lead to welfare and happiness,’ then you should live in accordance with them.",
    "an4.193:9": "(1) \"What do you think, Bhaddiya? When non-greed arises in a person, is it for his welfare or for his harm?\"",
    "an4.193:10": "(2) \"What do you think, Bhaddiya? When non-hatred … (3) … non-delusion … (4) … non-vehemence arises in a person, is it for his welfare or his harm?\"",
    "an4.193:11": "\"What do you think, Bhaddiya? Are these things wholesome or unwholesome?\" – \"Wholesome, Bhante.\" – \"Blameworthy or blameless?\" – \"Blameless, Bhante.\" – \"Censured or praised by the wise?\" – \"Praised by the wise, Bhante.\"– \"Accepted and undertaken, do they lead to welfare and happiness or not, or how do you take it?\" – \"Accepted and undertaken, these things lead to welfare and happiness. So we take it.\"",
    "an4.193:12": "\"Thus, Bhaddiya, when we said: ‘Come, Bhaddiya, do not go by oral tradition … But when you know for yourself: \"These things are wholesome; these things are blameless; these things are praised by the wise; these things, if accepted and undertaken, lead to welfare and happiness,\" then you should live in accordance with them,’ it is because of this that this was said.",
    "an4.193:13": "\"Bhaddiya, the good persons in the world encourage their disciples thus: ‘Come, good man, you should constantly remove greed.[n.910]Cereadslobhaṁ vineyya vineyya viharanto, and so in relation todosa, moha, andsārambha. I try to capture this sense with \"constantly,\" though \"repeatedly\" might also have been used. Be and Ee read simplylobhaṁ vineyya viharanto.When you constantly remove greed, you will not do any action born of greed, whether by body, speech, or mind. You should constantly remove hatred. When you constantly remove hatred, you will not do any action born of hatred, whether by body, speech, or mind. You should constantly remove delusion. When you constantly remove delusion, you will not do any action born of delusion, whether by body, speech, or mind. You should constantly remove vehemence. When you constantly remove vehemence, you will not do any action born of vehemence, whether by body, speech, or mind.’\"",
    "an4.193:14": "When this was said, Bhaddiya the Licchavi said to the Blessed One: \"Excellent, Bhante! … Let the Blessed One consider me a lay follower who from today has gone for refuge for life.\"",
    "an4.193:15": "\"Now, Bhaddiya, did I say to you: ‘Come, Bhaddiya, be my disciple and I will be your teacher?’\"",
    "an4.193:16": "\"So it is, Bhaddiya, so it is! If all khattiyas would be converted by this conversion toward the abandoning of unwholesome qualities and the acquisition of wholesome qualities, that would lead to their welfare and happiness for a long time. If all brahmins … vessas … suddas would be converted by this conversion toward the abandoning of unwholesome qualities and the acquisition of wholesome qualities, that would lead to their welfare and happiness for a long time. If the world with its devas, Māra, and Brahmā, this population with its ascetics and brahmins, its devas and humans, would be converted by this conversion toward the abandoning of unwholesome qualities and the acquisition of wholesome qualities, that would lead to the welfare and happiness of the world for a long time. If these great sal trees would be converted by this conversion toward the abandoning of unwholesome qualities and the acquisition of wholesome qualities, that would lead to the welfare and happiness even of these great sal trees for a long time, if they could choose.[n.912] The wordssace ceteyyuṁare inCeand Ee, but not Be.How much more then for a human being!\""
}