{
    "an4.201:1": "\"Bhikkhus, I will teach you about the bad person and the person inferior to the bad person; about the good person and the person superior to the good person. Listen and attend closely; I will speak.\"",
    "an4.201:2": "(1) \"And who, bhikkhus, is the bad person? Here, someone destroys life, takes what is not given, engages in sexual misconduct, speaks falsely, and indulges in liquor, wine, and intoxicants, the basis for heedlessness. This is called the bad person.",
    "an4.201:3": "(2) \"And who is the person inferior to the bad person? Here, someone himself destroys life and encourages others to destroy life; he himself takes what is not given and encourages others to take what is not given; he himself engages in sexual misconduct and encourages others to engage in sexual misconduct; he himself speaks falsely and encourages others to speak falsely; he himself indulges in liquor, wine, and intoxicants, the basis for heedlessness, and encourages others to indulge in liquor, wine, and intoxicants, the basis for heedlessness. This is the person inferior to the bad person.",
    "an4.201:4": "(3) \"And who is the good person? Here, someone abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from liquor, wine, and intoxicants, the basis for heedlessness. This is called the good person.",
    "an4.201:5": "(4) \"And who is the person superior to the good person? Here, someone himself abstains from the destruction of life and encourages others to abstain from the destruction of life; he himself abstains from taking what is not given and encourages others to abstain from taking what is not given; he himself abstains from sexual misconduct and encourages others to abstain from sexual misconduct; he himself abstains from false speech and encourages others to abstain from false speech; he himself abstains from liquor, wine, and intoxicants, the basis for heedlessness, and encourages others to abstain from liquor, wine, and intoxicants, the basis for heedlessness. This is called the person superior to the good person.\""
}