{
    "an4.178:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four?",
    "an4.178:2": "() \"Here, a bhikkhu enters and dwells in a certain peaceful liberation of mind.He attends to the cessation of personal existence. As he is doing so, his mind launches out toward it, acquires confidence, becomes steady, and focuses on it. This bhikkhu can be expected to attain the cessation of personal existence. Suppose a man were to grab hold of a branch with a clean hand. His hand would not stick to it, adhere to it, or be fastened to it. So too, a bhikkhu enters and dwells in a certain peaceful liberation of mind …. This bhikkhu can be expected to attain the cessation of personal existence.",
    "an4.178:3": "() \"Here, a bhikkhu enters and dwells in a certain peaceful liberation of mind. He attends to the breaking up of ignorance. As he is doing so, his mind does not launch out toward it, acquire confidence, become steady, and focus on it. This bhikkhu cannot be expected to attain the breaking up of ignorance. Suppose there were a reservoir many years old. A man would close off its inlets and open up its outlets, and sufficient rain would not fall. In such a case, it could not be expected that this reservoir's embankment would break. So too, a bhikkhu enters and dwells in a certain peaceful liberation of mind …. This bhikkhu cannot be expected to attain the breaking up of ignorance.",
    "an4.178:4": "() \"Here, a bhikkhu enters and dwells in a certain peaceful liberation of mind. He attends to the breaking up of ignorance. As he is doing so, his mind launches out toward it, acquires confidence, becomes steady, and focuses on it. This bhikkhu can be expected to attain the breaking up of ignorance. Suppose there were a reservoir many years old. A man would open up its inlets and close off its outlets, and sufficient rain would fall. In such a case, it could be expected that this reservoir's embankment would break. So too, a bhikkhu enters and dwells in a certain peaceful liberation of mind. He attends to the breaking up of ignorance.As he is doing so, his mind launches out toward it, acquires confidence, becomes steady, and focuses on it. This bhikkhu can be expected to attain the breaking up of ignorance."
}