{
    "an4.12:1": "\"Bhikkhus, dwell observant of virtuous behavior, observant of the Pāṭimokkha. Dwell restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken them, train in the training rules. When you have done so, what further should be done?",
    "an4.12:2": "(1) \"Bhikkhus, if a bhikkhu has gotten rid of longing and ill will while walking; if he has abandoned dullness and drowsiness, restlessness and remorse, and doubt;[n.640] I read withCethīnamiddhaṁ uddhaccakukkuccaṁ vicikicchā pahīṇā hoti(Ee is the same, but withhonti), as against Bethīnamiddhaṁ vigataṁ hoti uddhaccakukkuccaṁ vigataṁ hoti vicikicchā pahīṇā hoti.if his energy is aroused without slackening; if his mindfulness is established and unmuddled; if his body is tranquil and undisturbed; if his mind is concentrated and one-pointed, then that bhikkhu is said to be ardent and to dread wrongdoing; he is constantly and continuously energetic and resolute while walking.",
    "an4.12:3": "(2) \"If a bhikkhu has gotten rid of longing and ill will while standing …",
    "an4.12:4": "(3) If a bhikkhu has gotten rid of longing and ill will while sitting ……",
    "an4.12:5": "(4) If a bhikkhu has gotten rid of longing and ill will while wakefully lying down; if he has abandoned dullness and drowsiness, restlessness and remorse, and doubt; if his energy is aroused without slackening; if his mindfulness is established and unmuddled; if his body is tranquil and undisturbed; if his mind is concentrated and one-pointed, then that bhikkhu is said to be ardent and to dread wrongdoing; he is constantly and continuously energetic and resolute while wakefully lying down.\"",
    "an4.12:6": "Controlled in walking, controlled in standing,controlled in sitting and in lying down;controlled, a bhikkhu draws in the limbs,and controlled, he stretches them out.",
    "an4.12:7": "Above, across, and below,as far as the world extends,he is one who scrutinizes the arising and vanishingof such phenomena as the aggregates.",
    "an4.12:8": "Training in what is conduciveto serenity of mind, always mindful,they call such a bhikkhuone constantly resolute."
}