{
    "an4.163:1": "\"Bhikkhus, there are these four modes of practice. What four? () Practice that is painful with sluggish direct knowledge; (2) practice that is painful with quick direct knowledge; (3) practice that is pleasant with sluggish direct knowledge; and (4) practice that is pleasant with quick direct knowledge.",
    "an4.163:2": "(1) \"And what, bhikkhus, is practice that is painful with sluggish direct knowledge? Here, a bhikkhu dwells contemplating the unattractiveness of the body, perceiving the repulsiveness of food, perceiving non-delight in the entire world, contemplating impermanence in all conditioned phenomena; and he has the perception of death well established internally. He dwells depending upon these five trainee powers: the power of faith, the power of moral shame, the power of moral dread,the power of energy, and the power of wisdom.[n.85] The trainee powers(sekhabalāni), defined atAN5., partly differ from the five powers included among the thirty-seven aids to enlightenment.These five faculties arise in him feebly: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because these five faculties are feeble, he sluggishly attains the immediacy condition for the destruction of the taints. This is called practice that is painful with sluggish direct knowledge.",
    "an4.163:3": "(2) \"And what is practice that is painful with quick direct knowledge? Here, a bhikkhu dwells contemplating the unattractiveness of the body … and he has the perception of death well established internally. He dwells depending upon these five trainee powers: the power of faith … the power of wisdom. These five faculties arise in him prominently: the faculty of faith … the faculty of wisdom. Because these five faculties are prominent, he quickly attains the immediacy condition for the destruction of the taints. This is called practice that is painful with quick direct knowledge.",
    "an4.163:4": "(3) \"And what is practice that is pleasant with sluggish direct knowledge? Here, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna, which consists of rapture and pleasure born of seclusion, accompanied by thought and examination. With the subsiding of thought and examination, he enters and dwells in the second jhāna, which has internal placidity and unification of mind and consists of rapture and pleasure born of concentration, without thought and examination. With the fading away as well of rapture, he dwells equanimous and, mindful and clearly comprehending, he experiences pleasure with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ With the abandoning of pleasure and pain, and with the previous passing away of joy and dejection, he enters and dwells in the fourth jhāna, neither painful nor pleasant, which has purification of mindfulness by equanimity. He dwells depending upon these five trainee powers: the power of faith … the power of wisdom. These five faculties arise in him feebly: the faculty of faith … the faculty of wisdom. Because these five faculties are feeble, he sluggishly attains the immediacy condition for the destruction of the taints. This is called practice that is pleasant with sluggish direct knowledge.",
    "an4.163:5": "(4) \"And what is practice that is pleasant with quick direct knowledge? Here, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna … the second jhāna … the third jhāna …the fourth jhāna. He dwells depending upon these five trainee powers: the power of faith … the power of wisdom. These five faculties arise in him prominently: the faculty of faith … the faculty of wisdom. Because these five faculties are prominent, he quickly attains the immediacy condition for the destruction of the taints. This is called practice that is pleasant with quick direct knowledge."
}