{
    "an4.122:1": "\"Bhikkhus, there are these four perils to be expected for one who enters the water. What four? The peril of waves, the peril of crocodiles, the peril of whirlpools, and the peril of fierce fish. These are the four perils to be expected for one who enters the water. So too, there are these four perils to be expected for a clansman who has gone forth out of faith from the household life into homelessness in this Dhamma and discipline. What four? The peril of waves, the peril of crocodiles, the peril of whirlpools, and the peril of fierce fish.",
    "an4.122:2": "(1) \"And what, bhikkhus, is the peril of waves? Here, a clansman has gone forth out of faith from the household life into homelessness with the thought: ‘I am immersed in birth, old age, and death; in sorrow, lamentation, pain, dejection, and anguish. I am immersed in suffering, afflicted by suffering. Perhaps an ending of this entire mass of suffering can be attained.’ Then, after he has thus gone forth, his fellow monks exhort and instruct him: ‘You should go forward in this way, return in this way;look ahead in this way, look aside in this way; draw in your limbs in this way, extend them in this way; you should wear your robes and carry your outer robe and bowl in this way.’ He thinks: ‘Formerly, when I was a layman, I exhorted and instructed others. But now thesemonks, who are young enough to be my sons or grandsons, presume to exhort and instruct me.’ Being angry and displeased, he gives up the training and reverts to the lower life. This is called a bhikkhu who has given up the training and reverted to the lower life because of the peril of waves. ‘The peril of waves’ is a designation for anger and irritation. This is called the peril of waves.",
    "an4.122:3": "(2) \"And what is the peril of crocodiles? Here, a clansman has gone forth out of faith from the household life into homelessness with the thought: ‘I am immersed in birth, old age, and death; in sorrow, lamentation, pain, dejection, and anguish. I am immersed in suffering, afflicted by suffering. Perhaps an ending of this entire mass of suffering can be attained.’ Then, after he has thus gone forth, his fellow monks exhort and instruct him: ‘You may consume this but not that; you may eat this but not that;[n.807] Pāli recognizes two classes of food items:khādanīyaandbhojanīya. The latter comprises rice, porridge, other grains, fish, and meat; the former comprises virtually all other edibles. Hence, corresponding to these two types of foods, two gerundives are used here to designate what may be eaten:khāditabbaandbhunjitabba, which I render, respectively, \"things that may be consumed\" and \"things that may be eaten.\"you may taste this but not that; you may drink this but not that. You can consume, eat, taste, and drink what is allowable, not what is unallowable. You may consume, eat, taste, and drink within the proper time, not outside the proper time.’ He thinks: ‘Formerly, when I was a layman, I consumed whatever I wanted to consume and did not consume anything I did not wish to consume. I ate whatever I wanted to eat and did not eat anything I did not wish to eat. I tasted whatever I wanted to taste and did not taste anything I did not wish to taste. I drank whatever I wanted to drink and did not drink anything I did not wish to drink. I consumed, ate, tasted, and drank both what was allowable and what was not allowable. I consumed, ate, tasted, and drank both within the proper time and outside the proper time.But now when faithful householders give us delicious things to consume and eat during the day outside the proper time, thesemonksseem to put a gag over our mouths.’ Being angry and displeased, he gives up the training and reverts to the lower life. This is called a bhikkhu who has given up the training and reverted to the lower life because of the peril of crocodiles. ‘The peril of crocodiles’ is a designation for gluttony. This is called the peril of crocodiles.",
    "an4.122:4": "(3) \"And what is the peril of whirlpools? Here, a clansman has gone forth out of faith from the household life into homelessness with the thought: ‘I am immersed in birth, old age, and death; in sorrow, lamentation, pain, dejection, and anguish. I am immersed in suffering, afflicted by suffering. Perhaps an ending of this entire mass of suffering can be attained.’ Then, after he has thus gone forth, in the morning he dresses, takes his bowl and robe, and enters a village or town for alms, with body, speech, and mind unguarded, without having established mindfulness, his sense faculties unrestrained. He sees a householder or a householder's son there enjoying himself, furnished and endowed with the five objects of sensual pleasure. It occurs to him: ‘Formerly, when I was a layman, I enjoyed myself, furnished and endowed with the five objects of sensual pleasure. My family has wealth. I can both enjoy that wealth and do meritorious deeds. Let me now give up the training and revert to the lower life so that I can both enjoy that wealth and do meritorious deeds.’ So he gives up the training and reverts to the lower life. This is called a bhikkhu who has given up the training and reverted to the lower life because of the peril of whirlpools. ‘The peril of whirlpools’ is a designation for the five objects of sensual pleasure. This is called the peril of whirlpools.",
    "an4.122:5": "(4) \"And what is the peril of fierce fish? Here, a clansman has gone forth out of faith from the household life into homelessness with the thought: ‘I am immersed in birth, old age, and death; in sorrow, lamentation, pain, dejection, and anguish. I am immersed in suffering, afflicted by suffering. Perhaps an ending of this entire mass of suffering can be attained.’ Then, after he has thus gone forth, in the morning he dresses, takes his bowl and robe, and enters a village or town for alms,with body, speech, and mind unguarded, without having established mindfulness, his sense faculties unrestrained. There he sees women with their dress in disarray and loosely attired. When he sees them, lust invades his mind. With his mind invaded by lust, he gives up the training and reverts to the lower life. This is called a bhikkhu who has given up the training and reverted to the lower life because of the peril of fierce fish. ‘The peril of fierce fish’ is a designation for women. This is called the peril of fierce fish."
}