{
    "an4.79:1": "Then the Venerable Sāriputta approached the Blessed One, paid homage to him, sat down to one side, and said: \"Bhante, () why is it that for one person here, the business he undertakes ends in failure? (2) Why is it that for another the same kind of business does not fulfill his expectations? (3) Why is it that for still another the same kind of business fulfills his expectations? (4) And why is it that for still another the same kind of business surpasses his expectations?\"",
    "an4.79:2": "(1) \"Here, Sāriputta, someone approaches an ascetic or a brahmin and invites him to ask for what he needs,but does not give him what was requested. When he passes away from there, if he comes back to this world, whatever business he undertakes ends in failure.",
    "an4.79:3": "(2) \"Someone else approaches an ascetic or a brahmin and invites him to ask for what he needs. He gives it to him but does not fulfill his expectations. When he passes away from there, if he comes back to this world, whatever business he undertakes does not fulfill his expectations.",
    "an4.79:4": "(3) \"Someone else approaches an ascetic or a brahmin and invites him to ask for what he needs. He gives it to him and fulfills his expectations. When he passes away from there, if he comes back to this world, whatever business he undertakes fulfills his expectations.",
    "an4.79:5": "(4) \"Someone else approaches an ascetic or a brahmin and invites him to ask for what he needs. He gives it to him and surpasses his expectations. When he passes away from there, if he comes back to this world, whatever business he undertakes surpasses his expectations.",
    "an4.79:6": "\"This, Sāriputta, is the reason why for one person here the business he undertakes ends in failure, for another the same kind of business does not fulfill his expectations, for still another the same kind of business fulfills his expectations, and for still another the same kind of business surpasses his expectations.\""
}