{
    "an4.180:1": "On one occasion the Blessed One was dwelling at Bhoganagara near the Ānanda Shrine. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an4.180:2": "\"What, bhikkhus, are the four great references?",
    "an4.180:3": "\"But a bhikkhu might say: ‘In the presence of the Blessed One I heard this; in his presence I learned this: \"This is the Dhamma; this is the discipline; this is the Teacher's teaching!\"’ That bhikkhu's statement should neither be approved nor rejected. Without approving or rejecting it, you should thoroughly learn those words and phrases and then check for them in the discourses and seek them in the discipline. If, when you check for them in the discourses and seek them in the discipline, (you find that) they are included among the discourses and are to be seen in the discipline, you should draw the conclusion: ‘Surely, this is the word of the Blessed One, the Arahant, the Perfectly Enlightened One. It has been learned well by this bhikkhu.’ You should remember this first great reference.",
    "an4.180:4": "(2) \"Then a bhikkhu might say: ‘In such and such a residence a Saṅgha is dwelling with elders and prominent monks. In the presence of that Saṅgha I heard this; in its presence I learned this: \"This is the Dhamma; this is the discipline; this is the Teacher's teaching.\"’ That bhikkhu's statement should neither be approved nor rejected. Without approving or rejecting it, you should thoroughly learn those words and phrases and then check for them in the discourses and seek them in the discipline. If, when you check for them in the discourses and seek them in the discipline, (you find that) they are not included among the discourses and are not to be seen in the discipline, you should draw the conclusion: ‘Surely, this is not the word of the Blessed One, the Arahant, the Perfectly Enlightened One.It has been badly learned by that Saṅgha.’ Thus you should discard it.",
    "an4.180:5": "\"But … if, when you check for them in the discourses and seek them in the discipline, (you find that) they are included among the discourses and are to be seen in the discipline, you should draw the conclusion: ‘Surely, this is the word of the Blessed One, the Arahant, the Perfectly Enlightened One. It has been learned well by that Saṅgha.’ You should remember this second great reference.",
    "an4.180:6": "(3) \"Then a bhikkhu might say: ‘In such and such a residence several elder bhikkhus are dwelling who are learned, heirs to the heritage, experts on the Dhamma, experts on the discipline, experts on the outlines. In the presence of those elders I heard this; in their presence I learned this: \"This is the Dhamma; this is the discipline; this is the Teacher's teaching!\"’ That bhikkhu's statement should neither be approved nor rejected. Without approving or rejecting it, you should thoroughly learn those words and phrases and then check for them in the discourses and seek them in the discipline. If, when you check for them in the discourses and seek them in the discipline, (you find that) they are not included among the discourses and are not to be seen in the discipline, you should draw the conclusion: ‘Surely, this is not the word of the Blessed One, the Arahant, the Perfectly Enlightened One. It has been badly learned by those elders.’ Thus you should discard it.",
    "an4.180:7": "\"But … if, when you check for them in the discourses and seek them in the discipline, (you find that) they are included among the discourses and are to be seen in the discipline, you should draw the conclusion: ‘Surely, this is the word of the Blessed One, the Arahant, the Perfectly Enlightened One. It has been learned well by those elders.’ You should remember this third great reference.",
    "an4.180:8": "(4) \"Then a bhikkhu might say: ‘In such and such a residence one elder bhikkhu is dwellingwho is learned, an heir to the heritage, an expert on the Dhamma, an expert on the discipline, an expert on the outlines. In the presence of that elder I heard this; in his presence I learned this: \"This is the Dhamma; this is the discipline; this is the Teacher's teaching!\"’ That bhikkhu's statement should neither be approved nor rejected. Without approving or rejecting it, you should thoroughly learn those words and phrases and then check for them in the discourses and seek them in the discipline. If, when you check for them in the discourses and seek them in the discipline, (you find that) they are not included among the discourses and are not to be seen in the discipline, you should draw the conclusion: ‘Surely, this is not the word of the Blessed One, the Arahant, the Perfectly Enlightened One. It has been badly learned by that elder.’ Thus you should discard it.",
    "an4.180:9": "\"But a bhikkhu might say: ‘In such and such a residence one elder bhikkhu is dwelling who is learned, an heir to the heritage, an expert on the Dhamma, an expert on the discipline, an expert on the outlines. In the presence of that elder I heard this; in his presence I learned this: \"This is the Dhamma; this is the discipline; this is the Teacher's teaching!\"’ That bhikkhu's statement should neither be approved nor rejected. Without approving or rejecting it, you should thoroughly learn those words and phrases and then check for them in the discourses and seek them in the discipline. If, when you check for them in the discourses and seek them in the discipline, (you find that) they are included among the discourses and are to be seen in the discipline, you should draw the conclusion: ‘Surely, this is the word of the Blessed One, the Arahant, the Perfectly Enlightened One. It has been learned well by that elder.’ You should remember this fourth great reference."
}