{
    "an4.197:1": "On one occasion the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. Then Queen Mallikā approached the Blessed One, paid homage to him, sat down to one side, and said to him:[n.926] Queen Mallikā was the wife of King Pasenadi of Kosala.",
    "an4.197:2": "(1) \"Bhante, why is it that some women here areiugly, ill formed, and unsightly;iipoor, destitute, and indigent; andiiilacking in influence?",
    "an4.197:3": "(2) And why is it that some areiugly, ill formed, and unsightly; butiirich, with great wealth and property; andiiiinfluential?",
    "an4.197:4": "(3) And why is it that some women here areibeautiful, attractive, and graceful, possessing supreme beauty of complexion; butiipoor, destitute, and indigent; andiiilacking in influence?",
    "an4.197:5": "(4) And why is it that some areibeautiful, attractive, and graceful, possessing supreme beauty of complexion;iirich, with great wealth and property; andiiiinfluential?\"",
    "an4.197:6": "(1) \"Here, Mallikā,isome woman is prone to anger and easily exasperated. Even if she is criticized slightly she loses her temper and becomes irritated, hostile, and stubborn; she displays anger, hatred, and bitterness.iiShe does not give things to ascetics or brahmins: food and drink; clothing and vehicles; garlands, scents, and unguents; bedding, dwellings, and lighting.iiiAnd she is envious, one who envies, resents, and begrudges the gain, honor, respect, esteem, homage, and worship given to others. When she passes away from that state, if she comes back to this world, wherever she is rebornishe is ugly, ill formed, and unsightly;iipoor, destitute, and indigent; andiiilacking in influence.",
    "an4.197:7": "(2) \"Another woman isiprone to anger and easily exasperated ….iiBut she gives things to ascetics or brahmins ….iiiAnd she is without envy, one who does not envy, resent, or begrudge the gain, honor, respect, esteem, homage, and worship given to others. When she passes away from that state, if she comes back to this world, wherevershe is rebornishe is ugly, ill formed, and unsightly;iibut she is rich, with great wealth and property; andiiiinfluential.",
    "an4.197:8": "(3) \"Still another woman isinot prone to anger or often exasperated. Even if she is criticized a lot she does not lose her temper and become irritated, hostile, and stubborn; she does not display anger, hatred, and bitterness.iiBut she does not give things to ascetics or brahmins ….iiiAnd she is envious, one who envies, resents, and begrudges the gain, honor, respect, esteem, homage, and worship given to others. When she passes away from that state, if she comes back to this world, wherever she is rebornishe is beautiful, attractive, and graceful, possessing supreme beauty of complexion;iibut she is poor, destitute, with little wealth;iiiand lacking in influence.",
    "an4.197:9": "(4) \"And still another woman isinot prone to anger or often exasperated ….iiAnd she gives things to ascetics or brahmins ….iiiAnd she is without envy, one who does not envy, resent, or begrudge the gain, honor, respect, esteem, homage, and worship given to others. When she passes away from that state, if she comes back to this world, wherever she is rebornishe is beautiful, attractive, and graceful, possessing supreme beauty of complexion;iirich, with great wealth and property; andiiiinfluential.",
    "an4.197:10": "\"This, Mallikā, is why some women here areiugly, ill formed, and unsightly;iipoor, destitute, and indigent; andiiilacking in influence. This is why some areiugly, ill formed, and unsightly; butiirich, with great wealth and property; andiiiinfluential. This is why some women here areibeautiful, attractive, and graceful, possessing supreme beauty of complexion; butiipoor, destitute, and indigent; andiiilacking in influence. This is why some areibeautiful, attractive, and graceful, possessing supreme beauty of complexion;iirich, with great wealth and property; andiiiinfluential.\"",
    "an4.197:11": "When this was said, Queen Mallikā said to the Blessed One: \"I suppose, Bhante,ithat in some earlier life I was prone to anger and often exasperated; that even when I was criticized slightly I lost my temper and became irritated,hostile, and stubborn, and displayed anger, hatred, and bitterness. Therefore I am now ugly, ill formed, and unsightly.",
    "an4.197:12": "iiBut I suppose that in some earlier life I gave things to ascetics or brahmins … bedding, dwellings, and lighting. Therefore I am now rich, with great wealth and property.",
    "an4.197:13": "iiiAnd I suppose that in some earlier life I was without envy, not one who envied, resented, and begrudged the gain, honor, respect, esteem, homage, and worship given to others. Therefore I am now influential. In this court there are girls of khattiya, brahmin, and householder families over whom I exercise command."
}