{
    "an4.41:1": "\"Bhikkhus, there are these four developments of concentration. What four?",
    "an4.41:2": "(1) \"And what, bhikkhus, is the development of concentration that leads to dwelling happily in this very life? Here, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna, which consists of rapture and pleasure born of seclusion, accompanied by thought and examination. With the subsiding of thought and examination, he enters and dwells in the second jhāna, which has internal placidity and unification of mind and consists of rapture and pleasure born of concentration, without thought and examination. With the fading away as well of rapture, he dwells equanimous and, mindful and clearly comprehending, he experiences pleasure with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ With the abandoning of pleasure and pain, and with the previous passing away of joy and dejection, he enters and dwells in the fourth jhāna, neither painful nor pleasant, which has purification of mindfulness by equanimity. This is called the development of concentration that leads to dwelling happily in this very life.[n.717] Evidently, this refers to the attainment of the jhānas either by one who does not use them to develop insight, or by an arahant, who enters the jhānas simply to dwell at ease. Elsewhere the jhānas are shown to lead to the destruction of the taints.Cehasvuccatiin this section but not in the parallel sentences of the next three sections. Ee is just the opposite, omittingvuccatihere but including it in the next three sections. Be omitsvuccatiin all four sections.",
    "an4.41:3": "(2) \"And what is the development of concentration that leads to obtaining knowledge and vision?[n.718]Mpexplains \"knowledge and vision\" in this context as the divine eye(dibbacakkhuñāṇadassanassa paṭilābhāya). Elsewhere it is used to mean insight knowledge or even full enlightenment.Here, a bhikkhu attends to the perception of light; he focuses on the perception of day thus: ‘As by day, so at night; as at night, so by day.’[n.719]Yathā divā tathā rattiṁ, yathā rattiṁ tathā divā.Mp:\"As he attends to the perception of light by day, so he attends to it at night; and so in reverse.\"Thus, with a mind that is open and uncovered, he develops a mind imbued with luminosity. This is the development of concentration that leads to obtaining knowledge and vision.",
    "an4.41:4": "(3) \"And what is the development of concentration that leads to mindfulness and clear comprehension? Here, a bhikkhu knows feelings as they arise, as they remain present, as they disappear; he knows perceptions as they arise, as they remain present, as they disappear; he knows thoughts as they arise, as they remain present, as they disappear.[n.720]Mp:\"How are feelings known as they arise, etc.? Here, a bhikkhu comprehends the base(vatthu, the sense organ) and the object(ārammaṇa). By comprehending the base and the object, he knows: ‘Thus those feelings have arisen; thus they stand; thus they cease.’ The same method applies to perceptions and thoughts.\"This is the development of concentration that leads to mindfulness and clear comprehension.",
    "an4.41:5": "(4) \"And what is the development of concentration that leads to the destruction of the taints? Here, a bhikkhu dwells contemplating arising and vanishing in the five aggregates subject to clinging: ‘Such is form, such its origin, such its passing away; such is feeling … such is perception … such are volitional activities … such is consciousness, such its origin, such its passing away.’ This is the development of concentration that leads to the destruction of the taints.",
    "an4.41:6": "\"Having comprehended the world's highs and lows,he is not perturbed by anything in the world.Peaceful, fumeless, untroubled, wishless,he has, I say, crossed over birth and old age.\"[n.721]Sn 1048, also cited atAN3.33."
}