{
    "an4.94:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four? () Here, bhikkhus, some person gains internal serenity of mind but not the higher wisdom of insight into phenomena.(2) Some other person gains the higher wisdom of insight into phenomena but not internal serenity of mind. (3) Still another gains neither internal serenity of mind nor the higher wisdom of insight into phenomena. (4) And still another gains both internal serenity of mind and the higher wisdom of insight into phenomena.",
    "an4.94:2": "(1) \"Bhikkhus, the person among these who gains internal serenity of mind but not the higher wisdom of insight into phenomena should approach one who gains the higher wisdom of insight into phenomena and inquire of him: ‘How, friend, should conditioned phenomena be seen? How should conditioned phenomena be explored? How should conditioned phenomena be discerned by insight?’ The other then answers him as he has seen and understood the matter thus: ‘Conditioned phenomena should be seen in such a way, explored in such a way, discerned by insight in such a way.’[n.788]Mp:\"Conditioned phenomena should be seen as impermanent, explored as impermanent, and discerned with insight as impermanent; and so too as suffering and as non-self.\"Then, some time later, he gains both internal serenity of mind and the higher wisdom of insight into phenomena.",
    "an4.94:3": "(2) \"The person who gains the higher wisdom of insight into phenomena but not internal serenity of mind should approach one who gains internal serenity of mind and inquire of him: ‘How, friend, should the mind be steadied? How should the mind be composed? How should the mind be unified? How should the mind be concentrated?’ The other then answers him as he has seen and understood the matter thus: ‘The mind should be steadied in such a way, composed in such a way, unified in such a way, concentrated in such a way.’[n.789]Mp:\"The mind should be steadied, composed, unified, and concentrated by way of the first jhāna; and so too for the second and higher jhānas.\"Then, some time later, he gains both the higher wisdom of insight into phenomena and internal serenity of mind.",
    "an4.94:4": "(3) \"The person who gains neither internal serenity of mind nor the higher wisdom of insight into phenomena should approach one who gains both and inquire of him: ‘How, friend, should the mind be steadied? How should the mind be composed? How should the mind be unified? How should the mind be concentrated? How should conditioned phenomena be seen? How should conditioned phenomena be explored? How should conditioned phenomena be discerned by insight?’ The other then answers him as he has seen and understood the matter thus: ‘The mind should be steadied in such a way, composed in such a way, unified in such a way, concentrated in such a way. Conditioned phenomena should be seen in such a way, explored in such a way, discerned by insight in such a way.’ Then, some time later,he gains both internal serenity of mind and the higher wisdom of insight into phenomena.",
    "an4.94:5": "(4) \"The person who gains both internal serenity of mind and the higher wisdom of insight into phenomena should base himself on those same wholesome qualities and make a further effort for the destruction of the taints."
}