{
    "an4.191:1": "\"Bhikkhus, when one has followed the teachings by ear,[n.903] Be and Ee readsotānugatānaṁ bhikkhave dhammānaṁ. Ce hassotānudhatānaṁhere, andsotānudhātā hontijust below, as against Be and Eesotānugatā honti; however, Ce hassotānugataṁin theuddānaverse.MpCe readssotānugatānaṁ.Mpglosses: \"Having applied the sensory ear, one has determined (the meaning) with the ear of knowledge\"(pasādasotaṁ odahitvā ñāṇasotena vavatthapitānaṁ). This seems to supportsotānudhatānaṁ, but just below Mp Be glossessotānugatā hontiwithsotaṁ anuppattā anupaviṭṭhā honti, which suggests the readingsotānugatānaṁ. Mp Ce, though readingsotānugatānaṁin the lemma of the earlier sentence, inconsistently reads heresotānudhatā honti. Thus a number of texts reveal that the compilers were themselves uncertain of the reading. There is no recorded Chinese parallel.recited them verbally, examined them with the mind, and penetrated them well by view, four benefits are to be expected. What four?",
    "an4.191:3": "() \"Again, a bhikkhu masters the Dhamma: discourses … and questions-and-answers. He has followed those teachings by ear, recited them verbally, examined them with the mind, and penetrated them well by view. He passes away muddled in mind and is reborn into a certain group of devas. There, the happy ones do not recite passages of the Dhamma to him, nor does a bhikkhu with psychic potency who has attained mastery of mind teach the Dhamma to an assembly of devas. However, a young deva teaches the Dhamma to an assembly of devas. It occurs to him: ‘This is the Dhamma and discipline in which I formerly lived the spiritual life.’ The arising of his memory is sluggish, but then that being quickly reaches distinction. Suppose a man were skilled in the sound of a conch. While traveling along a highway he might hear the sound of a conch and he would not be at all perplexed or uncertain about the sound; rather, he would conclude: ‘That is the sound of a conch.’ So too, a bhikkhu masters the Dhamma … The arising of his memory is sluggish, but then that being quickly reaches distinction. This is the third benefit to be expected when one has followed the teachings by ear, recited them verbally, examined them with the mind, and penetrated them well by view.",
    "an4.191:4": "() \"Again, a bhikkhu masters the Dhamma: discourses … and questions-and-answers. He has followed those teachings by ear, recited them verbally, examined them with the mind, and penetrated them well by view. He passes away muddled in mind and is reborn into a certain group of devas. There, the happy ones do not recite passages of the Dhamma to him, nor does a bhikkhu with psychic potency who has attained mastery of mind teach the Dhamma to an assembly of devas, nor does a young deva teach the Dhamma to an assembly of devas. However, one being who has been spontaneously reborn reminds another who has been spontaneously reborn: ‘Do you remember, dear sir? Do you remember where we formerly lived the spiritual life?’ The other says: ‘I remember, dear sir. I remember.’ The arising of his memory is sluggish, but then that being quickly reaches distinction. Suppose there were two friends who had played together in the mud. By chance they would meet one another later in life. Then one friend would say to the other: ‘Do you remember this, friend? Do you remember that, friend?’ And the other would say:‘I remember, friend. I remember.’ So too, a bhikkhu masters the Dhamma … The arising of his memory is sluggish, but then that being quickly reaches distinction. This is the fourth benefit to be expected when one has followed the teachings by ear, recited them verbally, examined them with the mind, and penetrated them well by view."
}