{
    "an4.34:1": "\"Bhikkhus, there are these four foremost kinds of confidence. What four?",
    "an4.34:2": "() \"To whatever extent there are phenomena that are conditioned, the noble eightfold path is declared the foremost among them. Those who have confidence in the noble eightfold path have confidence in the foremost, and for those who have confidence in the foremost, the result is foremost.",
    "an4.34:3": "() \"To whatever extent there are phenomena conditioned or unconditioned,[n.691]Yāvatā bhikkhave dhammā saṅkhatā vā asaṅkhatā vā. In the Nikāyas, the onlydhammaexplicitly said to be unconditioned is nibbāna. All otherdhammas, mental and material, are conditioned. Thus the best of conditioneddhammasis the noble eightfold path, which leads to the unconditioned.dispassion is declared the foremost among them, that is, the crushing of pride, the removal of thirst, the uprooting of attachment, the termination of the round, the destruction of craving, dispassion, cessation, nibbāna. Those who have confidence in the Dhamma have confidence in the foremost, and for those who have confidence in the foremost, the result is foremost.",
    "an4.34:4": "() \"To whatever extent there are Saṅghas or groups, the Saṅgha of the Tathāgata's disciples is declared the foremost among them, that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.Those who have confidence in the Saṅgha have confidence in the foremost, and for those who have confidence in the foremost, the result is foremost.",
    "an4.34:5": "For those confident in regard to the foremost,knowing the foremost Dhamma,confident in the Buddha—the foremost—unsurpassed, worthy of offerings;",
    "an4.34:6": "for those confident in the foremost Dhamma,in the blissful peace of dispassion;for those confident in the foremost Saṅgha,the unsurpassed field of merit;",
    "an4.34:7": "for those giving gifts to the foremost,the foremost kind of merit increases:the foremost life span, beauty, and glory,good reputation, happiness, and strength",
    "an4.34:8": "The wise one who gives to the foremost,[n.692]Aggassa dātā. It-a II 111,5–7, explains that the dative-genitiveaggassacan be understood to denote either the recipient of the gift or the item to be given: \"A giver to the foremost: a giver to the Three Jewels, which are foremost; or one who generates merit by making a lofty gift of a foremost item\"(aggassa ratanattayassa dātā, atha vā aggassa deyyadhammassa dānaṁ uḷāraṁ katvā tattha puññaṁ pavattetā).concentrated upon the foremost Dhamma,having become a deva or a human being,rejoices, having attained the foremost."
}