{
    "an4.244:2": "() \"Suppose, bhikkhus, a man were to wrap himself in a black cloth, loosen his hair, put a club on his shoulder, and tell a large crowd of people: ‘Worthy sirs,[n.950] The text uses the wordbhantehere. Apparently this word was not used solely to address monks but also others in a superior position. Thus I here translate it as \"worthy sirs.\"I have committed an evil deed, reprehensible, punishable by clubbing. Let me do whatever will make you pleased with me.’ A man standing on the sidelines might think: ‘Truly, this man must have committed an evil deed, reprehensible, punishable by clubbing, insofar as he has wrapped himself in a black cloth, loosened his hair, put a club on his shoulder, and tells a large crowd of people: \"Worthy sirs, I have committed an evil deed, reprehensible, deserving a clubbing. Let me do whatever will make you pleased with me.\"Indeed, I should never do such an evil deed, reprehensible, punishable by clubbing.’",
    "an4.244:3": "() \"Suppose, bhikkhus, a man were to wrap himself in a black cloth, loosen his hair, put a sack of ashes on his shoulder, and tell a large crowd of people: ‘Worthy sirs, I have committed an evil deed, reprehensible, punishable by a sack of ashes.[n.952] Ce and Eeassapuṭaṁ, Bebhasmapuṭaṁ.Mp:\"(His deed) deserves to be punished with a reprehensible sack of ashes on his head\"(garahitabbachārikāpuṭena matthake abhighātārahaṁ).Let me do whatever will make you pleased with me.’ A man standing on the sidelines might think: ‘Truly, this man must have committed an evil deed, reprehensible, punishable by a sack of ashes, insofar as he has wrapped himself in a black cloth, loosened his hair, put a sack of ashes on his shoulder, and tells a large crowd of people: \"Worthy sirs, I have committed an evil deed, reprehensible, punishable by a sack of ashes. Let me do whatever will make you pleased with me.\" Indeed, I should never do such an evil deed, reprehensible, (to be punished with) a sack of ashes.’",
    "an4.244:4": "() \"Suppose, bhikkhus, a man were to wrap himself in a black cloth, loosen his hair, and tell a large crowd of people: ‘Worthy sirs, I have committed an evil deed, reprehensible, censurable. Let me do whatever will make you pleased with me.’ A man standing on the sidelines might think: ‘Truly, this man must have committed an evil deed, reprehensible, censurable, insofar as he has wrapped himself in a black cloth, loosened his hair, and tells a large crowd of people:\"Worthy sirs, I have committed an evil deed, reprehensible, censurable. Let me do whatever will make you pleased with me.\" Indeed, I should never do such an evil deed, reprehensible, censurable.’"
}