{
    "an4.40:1": "Then the brahmin Ujjaya approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Blessed One:",
    "an4.40:2": "(3) \"But I praise a non-violent sacrifice at which cattle, goats, rams, chickens, and pigs are not slain, where various creatures are not slaughtered, that is, a regular giving, a sacrifice offered by family custom.[n.709a]Niccadānaṁ anukulayaññaṁ.Mpexplainsanukulayaññaṁas a sacrifice that should be made to maintain the family custom, on the grounds that it was given by one's father and grandfather and so forth. Onniccadānaṁ anukulayaññaṁas superior to animal sacrifice, see especiallyDN 5.79–80, I 144, which can be regarded almost as an elaboration of the present sutta.(4) For what reason? Because arahants and those who have entered the path to arahantship attend a nonviolent sacrifice.\"[n.710a] My division into four sections is speculative. Apart from this, I do not see any other basis for including this sutta among the Fours.",
    "an4.40:3": "When a sacrifice is timely and allowable,well prepared and nonviolent,the self-controlled followers of the spiritual lifeattend such a sacrifice as this.",
    "an4.40:4": "Those in the world who have removed the coverings,[n.713]  Readings of this enigmatic term vary here and elsewhere across the Nikāyas. Here,Cehasvivattacchaddā,Bevivaṭacchadā,Eevivattacchadā.The expression often occurs in the stock passage on the two courses open to one with the thirty-two bodily marks of a great man: if he remains at home, he will become a wheel-turning king, but if he goes forth into homelessness, he will become a perfectly enlightened Buddha, described as “one in the world whovivaṭacchado”(variants:vivaṭṭacchado, vivaṭṭacchaddo, vivattacchaddo). See e.g.DN 3.3, I 89,8–9;DN 1.9, II 16,8–9;DN 30, III 12,;MN 91.2b, II 13,28;Sn 106. Though the origins of the term and its exact meaning are problematic, the commentaries consistently analyze and explain it in the same way. SinceMp(on the present sutta) does not offer an explanation, I cite the Dīgha Nikāya commentary, Sv I 250,3–251,3:“Vivaṭṭacchado:Here, having been born into the world, he dwells having entirely removed the covering in the world(loke taṃ chadanaṃ vivaṭṭetvā),in the darkness of defilements covered by seven coverings (chadanehi): lust, hatred, delusion, conceit, views, ignorance, and misconduct.”The old canonical commentary, Cūḷaniddesa, commenting onSn 117, says:“Vivaṭacchado:There are five coverings(chadanāni):craving, views, defilements, misconduct, ignorance. Those coverings have been removed(vivaṭāni)by the Blessed Buddha; they have been dispelled, uprooted, abandoned, eradicated, settled, stilled, burned by the fire of knowledge so that they are unable to arise. Therefore the Buddha is one who has removed the coverings” (Nidd II 251,18–22; VRI ed. 20).Norman (1991: 71–76) had proposed that the Pāli expression was to be derived from the BHS formvighuṣṭaśabdaand thus meant “one whose name (or fame) had rolled in different directions” or “one of widespread fame.” In a later work (2006b: 228–29) he changed his position, stating: “although I was correct to see a connection between the Pāli and Skt words, the direction of the development was in the reverse order, and must represent a hyper-Sanskritisation fromvivattacchadda.”AtSn 372and elsewhere he renders this “with deceit removed.”The Chinese translators of the Āgamas must have worked with texts that readvighuṣṭaśabdaor some variant with the same meaning. Thus a parallel ofAN.0, SĀ290 (at T II 0c6) has\"whose name is heard extremely far away.\" The parallel ofDN 30, MĀ 59 (at T I 93b7–8), reads:; \"he necessarily becomes a Tathāgata, unattached (= arahant), fully enlightened,whose name spreads around and is heard in the ten directions.\" MĀ 161, the parallel ofMN 91, has the same at T I 685b2–. Though various conjectures might be proposed with respect to the original expression and its meaning, given the difficulty of settling these questions across Buddhist textual traditions, the most expedient course open to me is to translate the term as it has been preserved and interpreted in the Pāli tradition.transcenders of time and destination,[n.71] The readings here vary considerably. Ce and Be havevītivattā kulaṁ gatiṁ, \"who have transcended family and destination.\" Ee has abahubbīhicompound,vītivattakālaṁgatī, with still more variants in the notes.MpBe readskulaṁ gatiṁin the lemma, butMpCe haskālaṁ gatiṁ. My rendering follows Ee. Note that inAN5.55, at III 69,10,kālaṁandgatiṁare in immediate proximity, which supports the hypothesis that here too we should readkāla-/kālaṁ.the Buddhas who are proficient in sacrifice,[n.715] I read with Beyaññassa kovidā, as against Ce and Eepuññassa kovidā, \"proficient in merit.\" Mp Be andMpCe show the same difference in their lemmas and glosses. Two Chinese parallels correspond to Be. SĀ 90 (at T II 23a11) has\"the Buddha who is skilled in sacrifice,\" and SĀ290 (at T II 0c8), \"this is the good sacrifice and the path of sacrifice praised by the Buddhas.\"praise this kind of sacrifice.",
    "an4.40:5": "Having prepared an appropriate gift,whether of the ordinary kind or in memory of the dead,one makes the sacrifice with a confident mindto a fertile field, to followers of the spiritual life.",
    "an4.40:6": "When what has been properly obtainedis properly offered, properly sacrificed,to those worthy of offerings,the sacrifice is vast and the deities are pleased.",
    "an4.40:7": "The wise person endowed with faith,having sacrificed thus with a generous mind,is reborn in a happy world,ina realmwithout affliction."
}