{
    "an4.260:1": "\"Bhikkhus, possessing four factors a king's excellent thoroughbred horse is worthy of a king, an accessory of a king, and reckoned as a factor of kingship.[n.97] An expanded parallel ofAN3.96.What four? Here, a king's excellent thoroughbred horse possesses beauty, strength, speed, and the right proportions. Possessing these four factors, a king's excellent thoroughbred horse is … reckoned as a factor of kingship.",
    "an4.260:2": "\"So too, bhikkhus, possessing four qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What four? Here, a bhikkhu possesses beauty, strength, speed, and the right proportions.",
    "an4.260:3": "(1) \"And how does a bhikkhu possess beauty? Here, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them. It is in this way that a bhikkhu possesses beauty.",
    "an4.260:4": "(2) \"And how does a bhikkhu possess strength? Here, a bhikkhu has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. It is in this way that a bhikkhu possesses strength.",
    "an4.260:5": "(3)[n.972a] An expanded parallel ofAN3.98. A parallel ofAN3.97, on the non-returner, is not found among the Fours.\"And how does a bhikkhu possess speed? Here, with the destruction of the taints, a bhikkhu has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. It is in this way that a bhikkhu possesses speed.\"",
    "an4.260:6": "(4) \"And how does a bhikkhu possess the right proportions? Here, a bhikkhu is one who gains robes, almsfood, lodgings, and medicines and provisions for the sick. It is in this way that a bhikkhu possesses the right proportions.",
    "an4.260:7": "\"Possessing these four qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.\""
}