{
    "an4.185:1": "On one occasion the Blessed One was dwelling at Rājagaha on Mount Vulture Peak. Now on that occasion a number of very well-known wanderers were residing at the wanderers’ park on the bank of the river Sappinī, that is, Annabhāra, Varadhara, Sakuludāyī, and other very well-known wanderers. Then, in the evening, the Blessed One emerged from seclusion and went to the wanderers’ park on the bank of the river Sappinī.",
    "an4.185:2": "Now on that occasion the wanderers of other sects had assembled and were sitting together when this conversation arose: \"Such are the brahmin truths, such are the brahmin truths.\"",
    "an4.185:3": "\"Wanderers, what discussion were you engaged in just now? What was the conversation that was underway?\"",
    "an4.185:4": "\"Wanderers, there are these four brahmin truths that I have proclaimed, having realized them for myself with direct knowledge. What four?",
    "an4.185:5": "(2) \"Again, a brahmin says thus:‘All sensual pleasures are impermanent, suffering, and subject to change.’ Speaking thus, a brahmin speaks truth, not falsehood. He does not, on that account, misconceive himself as ‘an ascetic’ or as ‘a brahmin.’ He does not misconceive: ‘I am better’ or ‘I am equal’ or ‘I am worse.’ Rather, having directly known the truth in that, he is practicing simply for disenchantment with sensual pleasures, for their fading away and cessation.",
    "an4.185:6": "(3) \"Again, a brahmin says thus: ‘All states of existence are impermanent, suffering, and subject to change.’ Speaking thus, a brahmin speaks truth, not falsehood. He does not, on that account, misconceive himself as ‘an ascetic’ or as ‘a brahmin.’ He does not misconceive: ‘I am better’ or ‘I am equal’ or ‘I am worse.’ Rather, having directly known the truth in that, he is practicing simply for disenchantment with states of existence, for their fading away and cessation.",
    "an4.185:7": "(4) \"Again, wanderers, a brahmin says thus: ‘I am not anywhere the belonging of anyone, nor is there anywhere anything in anyplace that is mine.’[n.896] My rendering followsMp,which comments: \"This is an explanation of four-pointed emptiness(catukkoṭisuññatā).I am not anywhere(nāhaṁ kvacana): He does not see (his) self anywhere.The belonging of anyone(kassaci kiñcanatasmiṁ): He does not regard his self as an entity that could be taken up by anyone else, that is, he cannot be taken up by thinking of him as a brother in the position of a brother, a friend in the position of a friend, an employee in the position of an employee.Nor is there anywhere anything…that is mine(na ca mama kvacana): Here, we temporarily put aside the word ‘mine’(mama). The meaning is then: ‘He does not see anywhere the self of another.’ Now, having brought in the word ‘mine,’ we get: [Anything]in any place that is mine(mama kvacana,katthaci kiñcanatātthi): He does not see: ‘There is somewhere the self of another that might become my belonging.’ The meaning is that he does not see any self of another in any position that could be taken up as his belonging: a brother in the position of a brother, a friend in the position of a friend, an employee in the position of an employee.\"Speaking thus, a brahmin speaks truth, not falsehood. He does not, on that account, misconceive himself as ‘an ascetic’ or as ‘a brahmin.’ He does not misconceive: ‘I am better’ or ‘I am equal’ or ‘I am worse.’ Rather, having directly known the truth in that, he is practicing the path of nothingness.[n.89]Ākiñcaññaṁyeva paṭipadaṁ paṭipanno hoti.Mpsays that he is practicing the way without impediments, without grasping(nippalibodhaṁ niggahaṇameva paṭipadaṁ paṭipanno hoti).MN 106., II 263,33–264,3, however, offers this formula as a meditation device for attaining the base of nothingness(ākiñcaññāyatanaṁ samāpajjati)."
}