{
    "an4.113:1": "\"Bhikkhus, there are these four kinds of excellent thoroughbred horses found existing in the world. What four?",
    "an4.113:2": "() \"Again, one kind of excellent thoroughbred horse is not stirred nor does it acquire a sense of urgency as soon as it sees the shadow of the goad, but it is stirred and acquires a sense of urgency when its hairs are struck by the goad, thinking: ‘What task will my trainer set for me today? What can I do to satisfy him?’ Such is one kind of excellent thoroughbred horse. This is the second kind of excellent thoroughbred horse found existing in the world.",
    "an4.113:3": "() \"Again, one kind of excellent thoroughbred horse is not stirred nor does it acquire a sense of urgency as soon as it sees the shadow of the goad, nor when its hairs are struck by the goad, but it is stirred and acquires a sense of urgency when its hide is struck by the goad, thinking: ‘What task now will my trainer set for me today? What can I do to satisfy him?’ Such is one kind of excellent thoroughbred horse. This is the third kind of excellent thoroughbred horse found existing in the world.",
    "an4.113:4": "() \"Again, one kind of excellent thoroughbred horse is not stirred nor does it acquire a sense of urgency as soon as it sees the shadow of the goad, nor when its hairs are struck by the goad, nor when its hide is struck by the goad, but it is stirred and acquires a sense of urgency when its bone is struck by the goad, thinking:‘What task now will my trainer set for me today? What can I do to satisfy him?’ Such is one kind of excellent thoroughbred horse. This is the fourth kind of excellent thoroughbred horse found existing in the world.",
    "an4.113:5": "\"So too, bhikkhus, there are these four kinds of excellent thoroughbred persons found existing in the world. What four?",
    "an4.113:6": "(2) \"Again, one kind of excellent thoroughbred person does not hear: ‘In such and such a village or town some woman or man has fallen ill or died.’ Rather, he himself sees a woman or a man who has fallen ill or died. He is stirred by this and acquires a sense of urgency. Stirred, he strives carefully. Resolute, he realizes the supreme truth with the body and, having pierced it through with wisdom, he sees it. I say that this excellent thoroughbred person is similar to the excellent thoroughbred horse that is stirred and acquires a sense of urgency when its hairs are struck by the goad. Such is one kind of excellent thoroughbred person. This is the second kind of excellent thoroughbred person found existing in the world.",
    "an4.113:7": "(3) \"Again, one kind of excellent thoroughbred person does not hear: ‘In such and such a village or town some woman or man has fallen ill or died,’ nor does he himself see a woman or a man who has fallen ill or died. Rather, a relative or family member of his has fallen ill or died. He is stirred by this and acquires a sense of urgency.Stirred, he strives carefully. Resolute, he realizes the supreme truth with the body and, having pierced it through with wisdom, he sees it. I say that this excellent thoroughbred person is similar to the excellent thoroughbred horse that is stirred and acquires a sense of urgency when its hide is struck by the goad. Such is one kind of excellent thoroughbred person. This is the third kind of excellent thoroughbred person found existing in the world.",
    "an4.113:8": "(4) \"Again, one kind of excellent thoroughbred person does not hear: ‘In such and such a village or town some woman or man has fallen ill or died,’ nor does he himself see a woman or a man who has fallen ill or died, nor has a relative or family member of his fallen ill or died. Rather, he himself is stricken by bodily feelings that are painful, racking, sharp, piercing, harrowing, disagreeable, sapping one's vitality. He is stirred by this and acquires a sense of urgency. Stirred, he strives carefully. Resolute, he realizes the supreme truth with the body and, having pierced it through with wisdom, he sees it. I say that this excellent thoroughbred person is similar to the excellent thoroughbred horse that is stirred and acquires a sense of urgency when its bone is struck by the goad. Such is one kind of excellent thoroughbred person. This is the fourth kind of excellent thoroughbred person found existing in the world."
}