{
    "an4.93:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four? () Here, some person gains internal serenity of mind but not the higher wisdom of insight into phenomena. (2) Some other person gains the higher wisdom of insight into phenomena but not internal serenity of mind. (3) Still another gains neither internal serenity of mind nor the higher wisdom of insight into phenomena. (4) And still another gains both internal serenity of mind and the higher wisdom of insight into phenomena.",
    "an4.93:2": "(1) \"Bhikkhus, the person among these who gains internalserenity of mind but not the higher wisdom of insight into phenomena should base himself on internal serenity of mind and make an effort to gain the higher wisdom of insight into phenomena. Then, some time later, he gains both internal serenity of mind and the higher wisdom of insight into phenomena.",
    "an4.93:3": "(2) \"The person who gains the higher wisdom of insight into phenomena but not internal serenity of mind should base himself on the higher wisdom of insight into phenomena and make an effort to gain internal serenity of mind. Then, some time later, he gains both the higher wisdom of insight into phenomena and internal serenity of mind.",
    "an4.93:4": "(3) \"The person who gains neither internal serenity of mind nor the higher wisdom of insight into phenomena should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to obtain both those wholesome qualities. Just as one whose clothes or head had caught fire would put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to extinguishthe fire onhis clothes or head, so that person should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to obtain both those wholesome qualities. Then, some time later, he gains both internal serenity of mind and the higher wisdom of insight into phenomena.",
    "an4.93:5": "(4) \"The person who gains both internal serenity of mind and the higher wisdom of insight into phenomena should base himself on those same wholesome qualities and make a further effort to reach the destruction of the taints."
}