{
    "an4.184:1": "Then the brahmin Jāṇussoṇī approached the Blessed One and exchanged greetings with him …. Then, sitting to one side, he said to the Blessed One:",
    "an4.184:2": "\"Master Gotama, I hold the thesis and view that there is no one subject to death who is not frightened and terrified of death.\"",
    "an4.184:3": "\"And, brahmin, who are those subject to death that are frightened and terrified of death?",
    "an4.184:4": "(2) \"Again, someone is not devoid of lust, desire, affection, thirst, passion, and craving for the body. When he incurs a severe and debilitating illness, he thinks: ‘Alas, this body dear to me will leave me, and I will have to leave this body.’ He sorrows, languishes, and laments; he weeps beating his breast and becomes confused. This, too, is one subject to death who is frightened and terrified of death.",
    "an4.184:5": "(3) \"Again, someone has not done what is good and wholesome or made a shelter for himself, but he has done what is evil, cruel, and defiled. When he incurs a severe and debilitating illness, he thinks: ‘Alas, I have not done anything good and wholesome, nor have I made a shelter for myself, but I have done what is evil, cruel, and defiled. When I pass on, I will meet the appropriate fate.’ He sorrows, languishes, and laments; he weeps beating his breast and becomes confused. This, too, is one subject to death who is frightened and terrified of death.",
    "an4.184:6": "(4) \"Again, someone here is perplexed, doubtful, and undecided about the good Dhamma. When he incurs a severe and debilitating illness, he thinks: ‘Alas, I am perplexed, doubtful, and undecided about the good Dhamma.’ He sorrows, languishes, and laments; he weeps beating his breast and becomes confused. This, too, is one subject to death who is frightened and terrified of death.",
    "an4.184:7": "(1) \"And, brahmin, who are those subject to death that are not frightened and terrified of death?",
    "an4.184:8": "(2) \"Again, someone is devoid of lust, desire, affection, thirst, passion, and craving for the body. When he incurs a severe and debilitating illness, he does not think: ‘Alas, this body dear to me will leave me, and I will have to leave this body.’ He does not sorrow, languish, and lament; he does not weep beating his breast and become confused. This, too, is one subject to death who is not frightened and terrified of death.",
    "an4.184:9": "(3) \"Again, someone has not done what is evil, cruel, and defiled, but has done what is good and wholesome and made a shelter for himself. When he incurs a severe and debilitating illness, he thinks: ‘Indeed, I have not done anything evil, cruel, and defiled, but I have done what is good and wholesome and made a shelter for myself. When I pass on, I will meet the appropriate fate.’ He does not sorrow, languish, and lament; he does not weep beating his breast and become confused. This, too, is one subject to death who is not frightened and terrified of death.",
    "an4.184:10": "(4) \"Again, someone is unperplexed, doubt-free, and decided about the good Dhamma. When he incurs a severe and debilitating illness, he thinks: ‘I am unperplexed, doubt-free, and decided about the good Dhamma.’ He does not sorrow, languish, and lament; he does not weep beating his breast and become confused.This, too, is one subject to death who is not frightened and terrified of death.",
    "an4.184:11": "\"Excellent, Master Gotama! Excellent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the darkness so those with good eyesight can see forms. I now go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. Let Master Gotama consider me a lay follower who from today has gone for refuge for life.\""
}