{
    "an4.162:1": "\"Bhikkhus, there are these four modes of practice. What four? () Practice that is painful with sluggish direct knowledge; (2) practice that is painful with quick direct knowledge; (3) practice that is pleasant with sluggish direct knowledge; and (4) practice that is pleasant with quick direct knowledge.",
    "an4.162:2": "(1) \"And what, bhikkhus, is the practice that is painful with sluggish direct knowledge? Here, someone is by nature strongly prone to lust and often experiences pain and dejection born of lust. By nature he is strongly prone to hatred and often experiences pain and dejection born of hatred. By nature he is strongly prone to delusion and often experiences pain and dejection born of delusion. These five faculties arise in him feebly: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because these five faculties are feeble in him, he sluggishly attains the immediacy condition for thedestruction of the taints.[n.851]Ānantariyaṁ pāpuṇāti āsavānaṁ khayāya. The wordānantariyais of rare occurrence, so its meaning must be determined inferentially. One clue is the Ratana Sutta, which says:yam buddhaseṭṭho parivaṇṇayī suciṁ samādhim ānantarikaññam āhu(Sn 6). Any difference betweenānantarikaandānantariyais insignificant, as the terminations-iyaand-ikaare often interchangeable. Another clue is SN:81, at III 96–99, where the Buddha addresses the question: \"How should one know and see to attain immediately (lit. ‘without interval’) the destruction of the taints?\"(evaṁ…jānato evaṁ passato anantarā āsavānaṁ khayo hoti). Other AN suttas—AN3.10, I 158,7–1, andAN5.3, III 16,9–17,—speak about the mind being \"properly concentrated for the destruction of the taints\"(sammā samādhiyati āsavānaṁ khayāya). See tooAN5.170, III 0,7–33, which speaks about certain conditions \"such that immediately afterward the destruction of the taints occurs\"(anantarā āsavānaṁ khayo hoti). Thus, the \"immediacy condition\" spoken of here seems to be a state in which the mind is properly concentrated and, at the same time, has acquired the insight that brings about the destruction of the taints.Mpexplainsānantariyawith reference to the Abhidhamma concept of an immediate succession between path and fruit: \"The ‘immediacy condition’ is the concentration of the path, which immediately yields its result(anantaravipākadāyakaṁ maggasamādhiṁ).\" Though the suttas do not employ the scheme of the cognitive process that underlies the concept of path and fruition moments, the expression \"immediacy condition\" does suggest a state of complete ripeness for the breakthrough to arahantship.This is called practice that is painful with sluggish direct knowledge.",
    "an4.162:3": "(2) \"And what is practice that is painful with quick direct knowledge? Here, someone is by nature strongly prone to lust … hatred … delusion and often experiences pain and dejection born of delusion. These five faculties arise in him prominently:the faculty of faith … the faculty of wisdom. Because these five faculties are prominent in him, he quickly attains the immediacy condition for the destruction of the taints. This is called practice that is painful with quick direct knowledge.",
    "an4.162:4": "(3) \"And what is practice that is pleasant with sluggish direct knowledge? Here, someone by nature is not strongly prone to lust and does not often experience pain and dejection born of lust. By nature he is not strongly prone to hatred and does not often experience pain and dejection born of hatred. By nature he is not strongly prone to delusion and does not often experience pain and dejection born of delusion. These five faculties arise in him feebly: the faculty of faith … the faculty of wisdom. Because these five faculties are feeble in him, he sluggishly attains the immediacy condition for the destruction of the taints. This is called practice that is pleasant with sluggish direct knowledge.",
    "an4.162:5": "(4) \"And what is practice that is pleasant with quick direct knowledge? Here, someone by nature is not strongly prone to lust … hatred … delusion and does not often experience pain and dejection born of delusion. These five faculties arise in him prominently: the faculty of faith … the faculty of wisdom. Because these five faculties are prominent in him, he quickly attains the immediacy condition for the destruction of the taints. This is called practice that is pleasant with quick direct knowledge."
}