{
    "an4.103:1": "\"Bhikkhus, there are these four kinds of pots. What four? The one that is empty and covered; the one that is full and open; the one that is empty and open; and the one that is full and covered. These are the four kinds of pots. So too, there are these four kinds of persons similar to pots found existing in the world. What four? The one who is empty and covered; the one who is full and open; the one who is empty and open; and the one who is full and covered.",
    "an4.103:2": "(1) \"And how, bhikkhus, is a person empty and covered? Here, someone inspires confidence by his manner of going forward and returning, looking ahead and looking aside, drawing in and extending the limbs, wearing his robes and carrying his outer robe and bowl; but he does not understand as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is empty and covered. So, I say, this person is just like a pot that is empty and covered.",
    "an4.103:3": "(2) \"And how is a person full and open? Here, someone does not inspire confidence by his manner of going forward and returning … and carrying his outer robe and bowl; but he understands as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is full and open. So, I say, this person is just like a pot that is full and open.",
    "an4.103:4": "(3) \"And how is a person empty and open? Here, someone does not inspire confidence by his manner of going forward and returning … and carrying his outer robe and bowl; and he does not understand as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is empty and open. So, I say, this person is just like a pot that is empty and open.",
    "an4.103:5": "(4) \"And how is a person full and covered? Here, someone inspires confidence by his manner of going forward and returning, looking ahead and looking aside, drawing in and extending the limbs, wearing his robes and carrying his outer robe and bowl;and he understands as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is full and covered. So, I say, this person is just like a pot that is full and covered."
}