{
    "an4.109:1": "\"Bhikkhus, there are these four kinds of trees. What four?The one made of softwood that is surrounded by softwoodtrees; the one made of softwood that is surrounded by hardwoodtrees; the one made of hardwood that is surrounded by softwoodtrees; and the one made of hardwood that is surrounded by hardwoodtrees. These are the four kinds of trees. So too, there are these four kinds of persons similar to trees found existing in the world. What four? The one made of softwood who is surrounded by softwoodtrees; the one made of softwood who is surrounded by hardwoodtrees; the one made of hardwood who is surrounded by softwoodtrees; and the one made of hardwood who is surrounded by hardwoodtrees.",
    "an4.109:2": "(1) \"And how, bhikkhus, is a person made of softwood and surrounded by softwoodtrees? Here, someone is immoral, of bad character, and his retinue is also immoral, of bad character. It is in this way that a person is made of softwood and surrounded by softwoodtrees. So, I say, this person is just like a tree made of softwood and surrounded by softwoodtrees.",
    "an4.109:3": "(2) \"And how is a person made of softwood but surrounded by hardwoodtrees? Here, someone is immoral, of bad character, but his retinue is virtuous, of good character. It is in this way that a person is made of softwood but surrounded by hardwoodtrees. So, I say, this person is just like a tree made of softwood but surrounded by hardwoodtrees.",
    "an4.109:4": "(3) \"And how is a person made of hardwood but surrounded by softwoodtrees? Here, someone is virtuous, of good character, but his retinue is immoral, of bad character. It is in this way that a person is made of hardwood but surrounded by softwoodtrees. So, I say, this person is just like a tree made of hardwood but surrounded by softwoodtrees.",
    "an4.109:5": "(4) \"And how is a person made of hardwood and surrounded by hardwoodtrees? Here, someone is virtuous, of good character, and his retinue is also virtuous, of good character. It is in this way that a person is made of hardwood and surrounded by hardwoodtrees. So, I say, this person is just like a tree made of hardwood and surrounded by hardwoodtrees."
}