{
    "an4.157:1": "\"Bhikkhus, there are these two kinds of illness. Which two?Bodily illness and mental illness. People are found who can claim to enjoy bodily health for one, two, three, four, and five years; for ten, twenty, thirty, forty, and fifty years; and even for a hundred years and more. But apart from those whose taints have been destroyed, it is hard to find people in the world who can claim to enjoy mental health even for a moment.",
    "an4.157:2": "\"There are, bhikkhus, these four illnesses incurred by a monk. What four? (1) Here, a bhikkhu has strong desires, undergoes distress, and is not content with any kind of robe, almsfood, lodging, or medicines and provisions for the sick.[n.840]Mp:\"He is not content with the four requisites by way of the three kinds of contentment.\" SeeAN1.65, n. 55.() Because he has strong desires, undergoes distress, and is not content with any kind of robe, almsfood, lodging, and medicines and provisions for the sick, he submits to evil desire for recognition and for gain, honor, and praise. (3) He arouses himself, strives, and makes an effort to obtain recognition and gain, honor, and praise. (4) He cunningly approaches families, cunningly sits down, cunningly speaks on the Dhamma, and cunningly holds in his excrement and urine.[n.841]Mpsays the word \"cunningly\"(saṅkhāya, lit. \"having calculated\") indicates that he tries to make a false impression on families (for the purpose of receiving offerings). The last phrase is perhaps similar in nuance to a well-known English slang expression.These are the four illnesses incurred by a monk.",
    "an4.157:3": "\"Therefore, bhikkhus, you should train yourselves thus: ‘We will not have strong desires or undergo distress, and we will not be discontent with any kind of robe, almsfood, lodging, and medicines and provisions for the sick. We will not submit to evil desires for recognition and for gain, honor, and praise. We will not arouse ourselves, strive, and make an effort to obtain recognition and gain, honor, and praise. We will patiently endure cold and heat, hunger and thirst; contact with flies, mosquitoes, wind, the burning sun, and serpents; rude and offensive ways of speech; we will bear up with arisen bodily feelings that are painful, racking, sharp, piercing, harrowing, disagreeable, sapping one's vitality.’ It is in this way, bhikkhus, that you should train yourselves.\""
}