{
    "an4.104:1": "\"Bhikkhus, there are these four kinds of pools of water. What four? The one that is shallow but appears to be deep; the one that is deep but appears to be shallow; the one that is shallow and appears to be shallow; and the one that is deep and appears to be deep. These are the four kinds of pools of water.[n.793]Eeends 4:04 here, taking this much to be a complete sutta, and then repeats these sentences as the opening of 4:05, followed by the exposition. Thus Ee's4:05is identical with myAN4.04. Ee reads theuddānaverse to indicate there are two \"pools of water\" suttas, but the manuscripts have only one. In the versedve hontican be read with eitherudakarahadāorambāni. Ce and Be, which I follow, choose the latter and thus have only one \"pools of water\" sutta,AN4.04, withAN4.06left blank.So too, there are these four kinds of persons similar to pools of water found existing in the world. What four? The one who is shallow but appears to be deep; the one who is deep but appears to be shallow; the one who is shallow and appears to be shallow; and the one who is deep and appears to be deep.",
    "an4.104:2": "(1) \"And how, bhikkhus, is a person one who is shallow but appears to be deep? Here, someone inspires confidence by his manner of going forward and returning, looking ahead and looking aside, drawing in and extending the limbs, wearing his robes and carrying his outer robe and bowl; but he does not understand as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is shallow but appears to be deep. So, I say, this person is just like a pool of water that is shallow but appears to be deep.",
    "an4.104:3": "(2) \"And how is a person one who is deep but appears to be shallow? Here, someone does not inspire confidence by his manner of going forward and returning … and carrying his outer robe and bowl; but he understands as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is deep but appears to be shallow. So, I say, this person is just like a pool of water that is deep but appears to be shallow.",
    "an4.104:4": "(3) \"And how is a person one who is shallow and appears to be shallow? Here, someone does not inspire confidence by his manner of going forward and returning … and carrying his outer robe and bowl; and he does not understand as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is shallow and appears to be shallow. So, I say, this person is just like a pool of water that is shallow and appears to be shallow.",
    "an4.104:5": "(4) \"And how is a person one who is deep and appears to be deep? Here, someone inspires confidence by his manner of going forward and returning, looking ahead and looking aside, drawing in and extending the limbs, wearing his robes and carrying his outer robe and bowl; and he understands as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is deep and appears to be deep. So, I say, this person is just like a pool of water that is deep and appears to be deep."
}