{
    "an4.159:1-2": "On one occasion the Venerable Ānanda was dwelling at Kosambī in Ghosita's Park. Then a certain bhikkhunī addressed a man thus: ‘Come, good man, approach Master Ānanda and pay homage to him in my name with your head at his feet. Then say: ‘Bhante, the bhikkhunī so-and-so is sick, afflicted, gravely ill. She pays homage to Master Ānanda with her head at his feet.’ Then say: ‘It would be good, Bhante, if, out of compassion, Master Ānanda would come to visit that bhikkhunī in the bhikkhunīs’ quarters.’\"",
    "an4.159:3": "Then the Venerable Ānanda dressed, took his bowl and robe, and went to the bhikkhunīs’ quarters. When that bhikkhunī saw the Venerable Ānanda coming in the distance, she covered herself from the head down and lay down on her bed.[n.84] It is puzzling that Ānanda goes unaccompanied to visit the bhikkhunī. Almost always when a bhikkhu goes to visit a layperson, even a male, he brings another monk along. In a Chinese parallel of this sutta,SĀ564 (T II 148a1–148c10), as Ānanda approaches, the bhikkhunī sees him in the distance and exposes her body. When Ānanda sees her exposed, he restrains his senses and turns away. The nun then feels ashamed and puts on her clothes. She offers Ānanda a seat, pays homage to him, and sits down to one side. Apart from this circumstantial difference, Ānanda's discourse in the Chinese version is almost exactly as in the Pāli version.Then the Venerable Ānanda approached that bhikkhunī, sat down in the appointed seat, and said to her:",
    "an4.159:4": "\"Sister, this body has originated from nutriment; in dependence on nutriment, nutriment is to be abandoned. This body has originated from craving; in dependence on craving, craving is to be abandoned. This body has originated from conceit; in dependence on conceit, conceit is to be abandoned. This body has originated from sexual intercourse, but in regard to sexual intercourse the Blessed One has declared the demolition of the bridge.[n.8]Setughāto vutto bhagavatā.Mp:\"Thedemolition of the bridge(setughātaṁ): the demolition of the state and the demolition of its condition(padaghātaṁ paccayaghātaṁ).\" The expression is also inAN3.7. SeeAN3.7, n. 97.",
    "an4.159:5": "(1) \"When it was said: ‘This body, sister, has originated from nutriment; in dependence on nutriment, nutriment is to be abandoned,’ for what reason was this said? Here, sister, reflecting carefully, a bhikkhu consumes food neither for amusement nor for intoxication nor for the sake of physical beauty and attractiveness, but only for the support and maintenance of this body, for avoiding harm, and for assisting the spiritual life, considering: ‘Thus I shall terminate the old feeling and not arouse a new feeling, and I shall be healthy and blameless and dwell at ease.’ Some time later, in dependence upon nutriment, he abandons nutriment.[n.84]Mp:\"Based on the present nutriment of edible food, using it carefully, he abandons the nutriment consisting in past kamma; but the craving for present edible food should be abandoned.\"When it was said: ‘This body, sister, has originated from nutriment; in dependence on nutriment, nutriment is to be abandoned,’ it is because of this that this was said.",
    "an4.159:6": "(2) \"When it was said: ‘This body has originated from craving; in dependence on craving, craving is to be abandoned,’ for whatreason was this said? Here, sister, a bhikkhu hears: ‘The bhikkhu named so-and-so, with the destruction of the taints, has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it.’ He thinks: ‘When will I, with the destruction of the taints, realize for myself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwell in it?’ Some time later, in dependence upon craving, he abandons craving. When it was said: ‘This body has originated from craving; in dependence on craving, craving is to be abandoned,’ it was because of this that this was said.",
    "an4.159:7": "(3) \"When it was said: ‘This body has originated from conceit; in dependence on conceit, conceit is to be abandoned.’ With reference to what was this said? Here, sister, a bhikkhu hears: ‘The bhikkhu named so-and-so, with the destruction of the taints, has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it.’ He thinks: ‘That venerable one, with the destruction of the taints, has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. Why, so can I!’ Some time later, in dependence upon conceit, he abandons conceit. When it was said: ‘This body has originated from conceit; in dependence on conceit, conceit is to be abandoned,’ it was because of this that this was said.",
    "an4.159:8": "(4) \"This body, sister, has originated from sexual intercourse, but in regard to sexual intercourse the Blessed One has declared the demolition of the bridge.\"[n.46] The Chinese version reads: \"Sister, by not indulging it, one abandons and severs sexual desire, the connecting bridge  ().\" It seems thatsetughātomust have been an idiom meaning that any connection with a particular state should be destroyed.Mpsays that when Ānanda reached the end of the discourse, the bhikkhunī's passion for him had vanished.",
    "an4.159:9": "Then that bhikkhunī got up from her bed, arranged her upper robe over one shoulder, and having prostrated herself with her head at the Venerable Ānanda's feet, she said to the Venerable Ānanda: \"Bhante, I have committed a transgression in that I so foolishly, stupidly, and unskillfully behaved as I did. Bhante, may Master Ānanda accept my transgression seen as a transgression for the sake of future restraint.\""
}