{
    "an4.195:1": "On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Banyan Tree Park. Then Vappa the Sakyan, a disciple of the Nigaṇṭhas, approached the Venerable Mahāmoggallāna, paid homage to him, and sat down to one side. The Venerable Mahāmoggallāna then said to him:",
    "an4.195:2": "\"Here, Vappa, if one is restrained by body, speech, and mind, then, with the fading away of ignorance and the arising of true knowledge, do you see anything on account of which taints productive of painful feeling might flow in upon such a person in future lives?\"",
    "an4.195:3": "While this conversation between the Venerable Mahāmoggallāna and Vappa the Sakyan was underway, in the evening the Blessed One emerged from seclusionand went to the attendance hall. He sat down on the appointed seat and said to the Venerable Mahāmoggallāna:",
    "an4.195:4": "\"What, Moggallāna, was the discussion that you were engaged in just now? And what was the conversation of yours that was underway?.The Venerable Mahāmoggallāna here relates his entire conversation with Vappa the Sakyan, concluding:",
    "an4.195:5": "Then the Blessed One said to Vappa the Sakyan: \"If, Vappa, you would admit what should be admitted and reject what should be rejected; and if, when you do not understand the meaning of my words, you would question me about them further, saying: ‘How is this, Bhante? What is the meaning of this?’; then we might discuss this.\"",
    "an4.195:6": "(1) \"What do you think, Vappa? Those taints, distressing and feverish, that might arise because of bodily undertakings do not occur when one refrains from them. He does not create any new kamma and he terminates the old kamma having contacted it again and again.[n.919]So navañca kammaṁ na karoti, purāṇañ ca kammaṁ phussa phussa vyantīkaroti. SeeAN3.74, n. 499. Mp's paraphrase here differs slightly from the earlier one: \"Having contacted the kamma again and again by contact with knowledge, he destroys the kamma to be eliminated by means of knowledge. Having contacted the result again and again by resultant-contact, he destroys the kamma to be eliminated byexperiencingthe result.\"The wearing away is directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise. Do you see, Vappa, anything on account of which taints productive of painful feeling might flow in upon such a person in future lives?\"",
    "an4.195:7": "(2) \"What do you think, Vappa? Those taints, distressing and feverish, that might arise because of verbal undertakings do not occur when one refrains from them. He does not create any new kamma and he terminates the old kamma having contacted it again and again. The wearing away is directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise. Do you see, Vappa, anything on account of which taints productive of painful feeling might flow in upon such a person in future lives?\"",
    "an4.195:8": "(3) \"What do you think, Vappa? Those taints, distressing and feverish, that might arise because of mental undertakings do not occur when one refrains from them. He does not create any new kamma and he terminates the old kamma having contacted it again and again. The wearing away is directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise. Do you see, Vappa, anything on account of which taints productive of painful feeling might flow in upon such a person in future lives?\"",
    "an4.195:9": "(4) \"What do you think, Vappa? With the fading away of ignorance and the arising of true knowledge, those taints, distressing and feverish, that arise with ignorance as condition no longer occur. He does not create any new kamma and he terminates the old kamma having contacted it again and again. The wearing away is directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise. Do you see, Vappa, anything on account of which taints productive of painful feeling might flow in upon such a person in future lives?\"",
    "an4.195:10": "\"A bhikkhu thus perfectly liberated in mind, Vappa, achieves six constant dwellings. Having seen a form with the eye, he is neither joyful nor saddened, but dwells equanimous, mindful and clearly comprehending.[n.920]Mp:\"Because he has acquired equanimity, which is embraced by mindfulness and clear comprehension and has mental balance as its characteristic, ‘he dwells equanimous,’ mentally balanced in relation to those objects\"(satisampajaññapariggahitāya majjhattākāralakkhaṇāya upekkhāya tesu ārammaṇesu upekkhako majjhatto hutvā viharati).Having heard a sound with the ear … Having smelled an odour with the nose … Having experienced a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, he is neither joyful nor saddened, but dwells equanimous, mindful and clearly comprehending.",
    "an4.195:11": "\"Suppose, Vappa, a shadow is seen on account of a stump. Thena man would come along bringing a shovel and a basket. He would cut down the stump at its foot, dig it up, and pull out the roots, even the fine rootlets and root-fibers. He would cut the stump into pieces, split the pieces, and reduce them to slivers. Then he would dry the slivers in the wind and sun, burn them in a fire, and reduce them to ashes. Having done so, he would winnow the ashes in a strong wind or let them be carried away by the swift current of a river. Thus the shadow that depended on that stump would be cut off at the root, made like a palm stump, obliterated so that it is no more subject to future arising.[n.922]Mp:\"Here is the application of the simile: The body should be seen as like the tree. Wholesome and unwholesome kamma are like the shadow depending on the tree. The meditator is like the man who wants to remove the shadow; wisdom is like the shovel; concentration is like the basket; insight is like the pick(khaṇitti, not mentioned in the sutta; DOP defines bothkuddālaandkhaṇittias a digging tool, a spade, a trowel). The time of digging up the roots with the pick is like the time of cutting off ignorance with the path of arahantship. The time of reducing the stump to pieces is like the time of seeing the aggregates; the time of splitting the pieces is like the time of seeing the sense bases; the time of reducing them to slivers is like the time of seeing the elements. The time of drying the slivers in the wind and sun is like the time of applying bodily and mental energy. The time of burning the slivers in a fire is like the time of burning the defilements with knowledge. The time of reducing them to ash is like the time when the five aggregates are still occurringafter one reaches arahantship. The time of winnowing the ashes in a strong wind and letting them be carried away by the current is like the cessation of the five aggregates, which have been cut off at the root with no further rebirth. As the ashes winnowed and carried away go to the indiscernible state(apaññattibhāvūpagamo), so should one understand the indescribable state(appaṇṇattibhāvo)reachedby the non-arising of resultant aggregates in renewed existence.\"",
    "an4.195:12": "\"So too, Vappa, a bhikkhu thus perfectly liberated in mind achieves six constant dwellings. Having seen a form with the eye … Having cognized a mental phenomenon with the mind, he is neither joyful nor saddened, but dwells equanimous, mindful and clearly comprehending. When he feels a feeling terminating with the body, he understands … ‘With the breakup of the body, following the exhaustion of life, all that is felt, not being delighted in, will become cool right here.’\"",
    "an4.195:13": "When this was said, Vappa the Sakyan, a disciple of the Nigaṇṭhas, said to the Blessed One: \"Suppose, Bhante, there was a man in quest of profit who raised horses for sale, but he would not gain a profit and instead would only reap weariness and distress. Just so, in quest of profit, I attended upon the foolish Nigaṇṭhas, but I did not gain a profit and instead only reaped weariness and distress. Starting today, whatever confidence I had in the foolish Nigaṇṭhas, I winnow in a strong wind or let it be carried away by the current of a river."
}