{
    "an4.23:1": "\"Bhikkhus, the Tathāgata has fully awakened to the world;[n.655]Mpidentifies the world(loka)with the truth of suffering. The four tasks that the Tathāgata has accomplished here correspond to the four tasks regarding the four noble truths—fully understanding the truth of suffering, abandoning the truth of its origin, realizing its cessation, and developing the path—but with \"fully awakened\"(abhisambuddha)replacing \"fully understood\"(pariññāta)in regard to the first truth. See SN56:, V 422.the Tathāgata is detached from the world. The Tathāgata has fully awakened to the origin of the world; the Tathāgata has abandoned the origin of the world. The Tathāgata has fully awakened to the cessation of the world; the Tathāgata has realized the cessation of the world. The Tathāgata has fully awakened to the way leading to the cessation of the world; the Tathāgata has developed the way leading to the cessation of the world.",
    "an4.23:2": "(1) \"Bhikkhus, in this world with its devas, Māra, and Brahmā, among this population with its ascetics and brahmins, its devas and humans, whatever is seen, heard, sensed, cognized, reached, sought after,examined by the mind—all that the Tathāgata has fully awakened to;therefore he is called the Tathāgata.[n.656]Mp,like other commentaries, explains the seen(diṭṭha)as the visible-form base; the heard(suta)as the sound base; the sensed(muta)as the bases of odour, taste, and tactile sensations; and the cognized(viññātaṁ)as the mental-phenomena base. The three terms \"reached, sought after, examined by the mind\"(pattaṁ pariyesitaṁ anuvicaritaṁ manasā)are simply elaborations of the cognized. Mp also explains that the suffix–gata, lit. \"gone,\" in the derivation of the word \"Tathāgata,\" means the same asabhisambuddha, \"fully awakened to.\"",
    "an4.23:3": "(2) \"Bhikkhus, whatever the Tathāgata speaks, utters, or expounds in the interval between the night when he awakens to the unsurpassed perfect enlightenment and the night when he attains final nibbāna,[n.657]Ceand Ee have merelyparinibbāyati, as against Beanupādisesāya nibbānadhātuyā parinibbāyati, \"attains final nibbāna by way of the nibbāna element without residue remaining.\" The latter reading may have entered Be from It §112, 121,21–22.all that is just so and not otherwise; therefore he is called the Tathāgata.[n.658]Sabbaṁ taṁ tath’eva hoti, no aññathā. Tasmā ‘tathāgato’ ti vuccati.",
    "an4.23:4": "(3) \"Bhikkhus, as the Tathāgata speaks, so he does; as he does, so he speaks. Since he does as he speaks and speaks as he does, therefore he is called the Tathāgata.[n.659]Yathāvādī tathākārī, yathākārī tathāvādī …. Tasmā ‘tathāgato’ ti vuccati.",
    "an4.23:5": "(4) \"Bhikkhus, in this world with its devas, Māra, and Brahmā, among this population with its ascetics and brahmins, its devas and humans, the Tathāgata is the vanquisher, the unvanquished, the universal seer, the wielder of mastery; therefore he is called the Tathāgata.\"",
    "an4.23:6": "Having directly known all the world—all in the world just as it is—he is detached from all the world,disengaged from all the world.",
    "an4.23:7": "He is the vanquisher of all,the wise one who has untied all knots.He has reached the supreme peace,nibbāna, inaccessible to fear.",
    "an4.23:8": "He is the Buddha, his taints destroyed,untroubled, all doubts cut off;having reached the destruction of all kamma,he is liberated in the extinction of acquisitions.",
    "an4.23:9": "He is the Blessed One, the Buddha,he is the lion unsurpassed;in this world with its devas,he set in motion the wheel of Brahmā.",
    "an4.23:10": "Thus those devas and human beingswho have gone for refuge to the Buddhaassemble and pay homage to him,the great one free from diffidence:",
    "an4.23:11": "\"Tamed, he is the best of tamers;peaceful, he is the seer among peace-bringers;freed, he is the chief of liberators;crossed over, he is the best of guides across.\"",
    "an4.23:12": "Thus indeed they pay him homage,the great one free from diffidence.In this world together with its devas,there is no one who can rival you."
}