{
    "an4.108:1": "\"Bhikkhus, there are these four kinds of bulls. What four?The one wrathful toward its own cattle, not toward the cattle of others; the one wrathful toward the cattle of others, not toward its own cattle; the one wrathful both toward its own cattle and toward the cattle of others; and the one wrathful neither toward its own cattle nor toward the cattle of others. These are the four kinds of bulls. So too, there are these four kinds of persons similar to bulls found existing in the world. What four? The one wrathful toward his own cattle, not toward the cattle of others; the one wrathful toward the cattle of others, not toward his own cattle; the one wrathful both toward his own cattle and toward the cattle of others; and the one wrathful neither toward his own cattle nor toward the cattle of others.",
    "an4.108:2": "(1) \"And how, bhikkhus, is a person wrathful toward his own cattle, not toward the cattle of others? Here, someone intimidates his own retinue but not the retinues of others. It is in this way that a person is wrathful toward his own cattle, not toward the cattle of others. So, I say, this person is just like a bull wrathful toward its own cattle, not toward the cattle of others.",
    "an4.108:3": "(2) \"And how is a person wrathful toward the cattle of others, not toward his own cattle? Here, someone intimidates the retinues of others but not his own retinue. It is in this way that a person is wrathful toward the cattle of others, not toward his own cattle. So, I say, this person is just like a bull wrathful toward the cattle of others, not toward his own cattle.",
    "an4.108:4": "(3) \"And how is a person wrathful both toward his own cattle and toward the cattle of others? Here, someone intimidates both the retinues of others and also his own retinue. It is in this way that a person is wrathful both toward his own cattle and toward the cattle of others. So, I say, this person is just like a bull wrathful both toward his own cattle and toward the cattle of others.",
    "an4.108:5": "(4) \"And how is a person wrathful neither toward his own cattle nor toward the cattle of others? Here, someone does not intimidate his own retinue or the retinues of others. It is in this way that a person is wrathful neither toward his own cattle nor toward the cattle of others. So, I say, this person is just like a bull wrathful neither toward his own cattle nor toward the cattle of others."
}