{
    "an4.39:1": "Then the brahmin Ujjaya approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Blessed One:",
    "an4.39:2": "(3) \"But I praise a non-violent sacrifice at which cattle, goats, rams, chickens, and pigs are not slain, where various creatures are not slaughtered, that is, a regular giving, a sacrifice offered by family custom.[n.709]Niccadānaṁ anukulayaññaṁ.Mpexplainsanukulayaññaṁas a sacrifice that should be made to maintain the family custom, on the grounds that it was given by one's father and grandfather and so forth. Onniccadānaṁ anukulayaññaṁas superior to animal sacrifice, see especiallyDN 5.79–80, I 144, which can be regarded almost as an elaboration of the present sutta.(4) For what reason? Because arahants and those who have entered the path to arahantship attend a nonviolent sacrifice.\"[n.710] My division into four sections is speculative. Apart from this, I do not see any other basis for including this sutta among the Fours.",
    "an4.39:3": "The horse sacrifice, human sacrifice,sammāpāsa,vājapeyya,niraggaḷa:[n.711] These were Vedic sacrifices.these grand sacrifices, fraught with violence,[n.712] I follow Ce and Be, which putniraggaḷaṁin pāda b and includemahāyaññāin pāda c. Ee lacksmahāyaññā, but two Chinese parallels include a compound corresponding to this word: SĀ 89 (at T II 22c19) hasmore literally \"great gathering,\" and SĀ289 (at T II 404b4) has, wheremeans \"to sacrifice to the gods or ancestors.\"Mpexplainsmahārambhā: \"With great tasks, great works; further, they are of ‘great violence’ because of the extent of the destruction of life.\"do not bring great fruit.",
    "an4.39:4": "The great seers of right conductdo not attend a sacrificewhere goats, rams, cattle,and various creatures are slain.",
    "an4.39:5": "But when they regularly offer by family customsacrifices free from violence,no goats, sheep, and cattleor various creatures are slain.That is the sacrifice the great seersof right conduct attend.",
    "an4.39:6": "The wise person should offer this;this sacrifice is very fruitful.For one who makes such sacrificeit is indeed better, never worse.Such a sacrifice is truly vastand the deities too are pleased."
}