{
    "an4.121:1": "\"Bhikkhus, there are these four perils. What four? The peril of self-reproach, the peril of reproach by others, the peril of punishment, and the peril of a bad destination.",
    "an4.121:2": "(1) \"And what, bhikkhus, is the peril of self-reproach? Here, someone reflects thus: ‘If I were to engage in bodily, verbal, or mental misconduct, wouldn’t I reprove myself because of my behavior?’ Afraid of the peril of self-reproach, he abandons bodily misconduct and develops bodily good conduct; he abandons verbal misconduct and develops verbal good conduct; he abandons mental misconduct and develops mental good conduct; he maintains himself in purity. This is called the peril of self-reproach.",
    "an4.121:3": "(2) \"And what is the peril of reproach by others?Here, someone reflects thus: ‘If I were to engage in bodily, verbal, or mental misconduct, wouldn’t others reprove me because of my behavior?’ Afraid of the peril of reproach by others, he abandons bodily misconduct and develops bodily good conduct; he abandons verbal misconduct and develops verbal good conduct; he abandons mental misconduct and develops mental good conduct; he maintains himself in purity. This is called the peril of reproach by others.",
    "an4.121:4": "(3) \"And what is the peril of punishment?[n.803] What follows is also atAN2.1.Here, someone sees that when kings arrest a thief who has committed a crime, they subject him to various punishments: they have him flogged with whips, beaten with canes, beaten with clubs; they have his hands cut off, his feet cut off, his hands and feet cut off; his ears cut off, his nose cut off, his ears and nose cut off; they have him subjected to the ‘porridge pot,’ to the ‘polished-shell shave,’ to the ‘Rāhu's mouth,’ to the ‘fiery wreath,’ to the ‘flaming hand,’ to the ‘blades of grass,’ to the ‘bark dress,’ to the ‘antelope,’ to the ‘meat hooks,’ to the ‘coins,’ to the ‘lye pickling,’ to the ‘pivoting pin,’ to the ‘rolled-up palliasse’; and they have him splashed with boiling oil, and they have him devoured by dogs, and they have him impaled alive on a stake, and they have his head cut off with a sword.",
    "an4.121:5": "\"It occurs to him: ‘When kings have arrested a thief who has committed a crime, they subject him to various punishments because of such bad deeds: they have him flogged with whips … they have his head cut off with a sword. Now if I were to commit such an evil deed, and if kings were to arrest me, they would subject me to the same punishments. They would have me flogged with whips … they would have my head cut off with a sword.’ Afraid of the peril of punishment, he does not go about plundering the belongings of others. This is called the peril of punishment.",
    "an4.121:6": "(4) \"And what is the peril of a bad destination? Here, someone reflects thus: ‘Bodily misconduct has bad results[n.804] What follows parallels the passage on \"the fault pertaining to the future life\" inAN2.1, but it describes this simply as \"a bad result\"(pāpako vipāko)whereAN2.1has \"a bad, painful result\"(pāpako dukkho vipāko). SinceAN2.11also lacksdukkho, it is possibledukkhowas originally a commentator's gloss onpāpakothat made its way into the text ofAN2.1itself.in future lives; verbal misconduct has bad results in future lives; mental misconduct has bad results in future lives. Now if I were to engage in misconduct with body, speech, and mind, then with the breakup of the body, after death, I would be reborn in the plane of misery, in a bad destination, in the lower world, in hell.’ Afraid of the peril of a bad destination, he abandons bodily misconduct and develops bodily good conduct; he abandons verbal misconduct and develops verbal good conduct; he abandons mental misconduct and develops mental good conduct; he maintains himself in purity. This is called the peril of a bad destination."
}