{
    "an4.127:1": "\"Bhikkhus, with the manifestation of a Tathāgata, an Arahant, a Perfectly Enlightened One, four astounding and amazing things become manifest.[n.88] For various wonders occurring at the bodhisatta's conception and birth, see tooMN 23.What four?",
    "an4.127:2": "() \"Again, when a bodhisatta mindfully and with clear comprehension emerges from his mother's womb, then in this world with its devas, Māra, and Brahmā, in this population with its ascetics and brahmins, its devas and humans, a measureless glorious radiance becomes manifest, surpassing the divine majesty of the devas. Even in those world intervals … (beings) say: ‘Indeed, it seems there are other beings who have been reborn here.’ This is the second astounding and amazing thing that becomes manifest with the manifestation of a Tathāgata, an Arahant, a Perfectly Enlightened One.",
    "an4.127:3": "() \"Again, when a Tathāgata awakens to the unsurpassed perfect enlightenment, then in this world with its devas, Māra, and Brahmā, in this population with its ascetics and brahmins, its devas and humans, a measureless glorious radiance becomes manifest, surpassing the divine majesty of the devas. Even in those world intervals … (beings) say: ‘Indeed, it seems there are other beings who have been reborn here.’ This is the third astounding and amazing thing that becomes manifest with the manifestation of a Tathāgata, an Arahant, a Perfectly Enlightened One.",
    "an4.127:4": "() \"Again, when a Tathāgata sets in motion the unsurpassed wheel of the Dhamma, then in this world with its devas, Māra, and Brahmā, in this population with its ascetics and brahmins, its devas and humans, a measureless glorious radiance becomes manifest, surpassing the divine majesty of the devas. Even in those world intervals, vacant and abysmal, regions of gloom and impenetrable darkness where the light of the sun and moon, so powerful and mighty, does not reach, there too a measureless glorious radiance becomes manifest, surpassing the divine majesty of the devas. Those beings who have been reborn there perceive one another by this radiance and say: ‘Indeed, it seems there are other beings who have been reborn here.’ This is the fourth astounding and amazing thing that becomes manifest with the manifestation of a Tathāgata, an Arahant, a Perfectly Enlightened One."
}