{
    "an4.186:1": "Then a certain bhikkhu approached the Blessed One … and said to him:",
    "an4.186:2": "\"Good, good, bhikkhu! Your acumen is excellent. Your discernment is excellent.[n.899]Mpidentifies bothummaggaandpaṭibhānawith wisdom(pañña): \"Acumen is rising up, that is, the movement of wisdom. Or wisdom itself is called ‘acumen,’ in the sense of rising up. It is (also called) ‘discernment’ in the sense of discerning\"(ummaggoti ummujjanaṁ, paññāgamanan ti attho. Paññā eva vā ummujjanaṭṭhenaummaggoti vuccati. Sā va paṭibhānaṭṭhenapaṭibhānaṁ).Your inquiry is a good one. For you have asked thus: ‘Bhante, by what is the world led? By what is the world dragged around? When what has arisen doesthe worldgo under its control?’\"",
    "an4.186:3": "Saying, \"Good, Bhante,\" that bhikkhu delighted and rejoiced in the Blessed One's statement. Then he asked the Blessed One a further question:",
    "an4.186:4": "\"Good, good, bhikkhu! Your acumen is excellent. Your discernment is excellent. Your inquiry is a good one. For you have asked thus: ‘It is said, Bhante, \"a learned expert on the Dhamma, a learned expert on the Dhamma.\" In what way is one a learned expert on the Dhamma?’\"",
    "an4.186:5": "Saying, \"Good, Bhante,\" that bhikkhu delighted and rejoiced in the Blessed One's statement. Then he asked the Blessed One a further question:",
    "an4.186:6": "\"Good, good, bhikkhu! Your acumen is excellent. Your discernment is excellent. Your inquiry is a good one. For you have asked thus: ‘It is said, Bhante, \"learned, of penetrative wisdom; learned, of penetrative wisdom.\" In what way is one learned, of penetrative wisdom?’\"",
    "an4.186:7": "Saying, \"Good, Bhante,\" that bhikkhu delighted and rejoiced in the Blessed One's statement. Then he asked the Blessed One a further question:",
    "an4.186:8": "\"Good, good, bhikkhu! Your acumen is excellent. Your discernment is excellent. Your inquiry is a good one. For you have asked thus: ‘It is said, Bhante, \"a wise person of great wisdom, a wise person of great wisdom.\" In what way is one a wise person of great wisdom?’\""
}