{
    "an4.131:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four?",
    "an4.131:2": "() Some other person has abandoned the lower fetters, but not the fetters for obtaining rebirth or the fetters for obtaining existence.",
    "an4.131:3": "() Still another person has abandoned the lower fetters and the fetters for obtaining rebirth, but not the fetters for obtaining existence.",
    "an4.131:4": "() And still another person has abandoned the lower fetters, the fetters for obtaining rebirth, and the fetters for obtaining existence.",
    "an4.131:5": "(1) \"What kind of person has not abandoned the lower fetters, the fetters for obtaining rebirth, or the fetters for obtaining existence? The once-returner.[n.827] Since the stream-enterer, too, has not abandoned any of these fetters,Mpexplains: \"The once-returner is mentioned to show the highest among the noble ones who have not abandoned any of the fetters.\" Mp-ṭ: \"That is, who have not abandoned the lower fetters. For above the once-returner, there is no noble one who has not abandoned the lower fetters. But isn’t it the case that once-returners have abandoned (some) lower fetters, for they have abandoned the fetters of views, doubt, and wrong grasp of rules and observances? In that case, why is it said that they have not abandoned the lower fetters? Because once-returners have not abandoned the fetters of sensual lust and ill will; therefore the statement that they have not abandoned the lower fetters is said with reference to those fetters that they have not abandoned. It does not mean that they have not abandoned any fetters.\"This person has not abandoned the lower fetters, the fetters for obtaining rebirth, or the fetters for obtaining existence.",
    "an4.131:6": "(2) \"What kind of person has abandoned the lower fetters, but not the fetters for obtaining rebirth or the fetters for obtaining existence? The one bound upstream, heading toward the Akaniṭṭha realm.[n.828]Uddhaṁsotassa akaniṭṭhagāmino puggalassa. This refers to the most sluggish of the five classes of non-returners, who proceed upward through successive pure abodes to the highest one, called Akaniṭṭha. This type, too, is mentioned to show the coarsest who still retain the fetters of rebirth, but more acute classes of non-returners also retain these fetters.This person has abandoned the lower fetters but not the fetters for obtaining rebirth or the fetters for obtaining existence.",
    "an4.131:7": "(3) \"What kind of person has abandoned the lower fetters and the fetters for obtaining rebirth but not the fetters for obtaining existence? The one who attains final nibbāna in the interval.[n.829] This statement creates a predicament for the traditional Theravādin interpretation of the five types of non-returners, which is based onPp16–1 and its commentary at Pp-a 198–201. The core of this interpretation is the rejection of an intermediate state(antarābhava)between two lives. Such rejection thus entails the need to interpret theantarāparinibbāyīas a non-returner who attains arahantship during the first half of the life span in the next existence. However, the wordantarāparinibbāyīliterally means \"one who attains final nibbānain between,\" and there seems no legitimate reason, based on a sutta, to deny the possibility that certain non-returners, following their death in human form, enter an intermediate state and attain final nibbāna in that state itself, thereby circumventing the need to take another rebirth. This seems to be the purport of the present text, according to which theantarāparinibbāyīhas abandoned the fetters of rebirth but not the fetters of existence. Upon attaining arahantship, theantarāparinibbāyīwill also abandon the fetters of existence. I have discussed the five types of non-returners in detail in CDB 1902–3, note 65. For further discussion, see p. 182, notes 1535–38; for additional textual analysis, seeHarvey 1995: 98–108.This person has abandoned the lower fetters and the fetters for obtaining rebirth but not the fetters for obtaining existence.",
    "an4.131:8": "(4) \"What kind of person has abandoned the lower fetters, the fetters for obtaining rebirth, and the fetters for obtaining existence? The arahant. For this person has abandoned the lower fetters, the fetters for obtaining rebirth, and the fetters for obtaining existence."
}