{
    "an4.36:1": "On one occasion the Blessed One was traveling along the highway between Ukkaṭṭhā and Setavya. The brahmin Doṇa was also traveling along the highway between Ukkaṭṭhā and Setavya. The brahmin Doṇa then saw the thousand-spoked wheels of the Blessed One's footprints, with their rims and hubs, complete in all respects,[n.695] This is one of the thirty-two marks of a great person, said to be the karmic consequence of living for the happiness of many, dispelling fear and terror, providing lawful protection and shelter, and supplying all necessities. SeeDN 30.5, III 47–49.and thought: \"It is astounding and amazing! These surely could not be the footprints of a human being!\"",
    "an4.36:2": "(1) \"Could you be a deva, sir?\"[n.696]Mpinterprets the conversation on both sides as referring to the future: the brahmin asks about the Buddha’s future rebirth and the latter replies with respect to his future rebirth. As I read the exchange, however, a subtle word play is involved. The brahmin uses the futurebhavissatias a polite way of inquiring about the present, which I render \"could you be?\"(Bhavissantiis used above in just this way, negatively, in the sentence,na vat’imāni manussabhūtassa padāni bhavissanti, \"These could not be ….\") But the Buddha uses the future form literally and thus in each case answers, \"I will not be\"(na bhavissāmi), referring to his destiny in a future life. Two Chinese parallels, SĀ 101 (at T II 8a19–8b17) and EĀ 38.3 (at T II 717c18–718a1), render this entire conversation as pertaining to the present. The brahmin asks the Buddha whether he is () a deva, a nāga, etc., a human being, or a nonhuman being, and the Buddha simply denies () that he is any of these. There is no reference to the future.",
    "an4.36:3": "\"When you are asked: ‘Could you be a deva, sir?’ you say: ‘I will not be a deva, brahmin.’ When you are asked: ‘Could you be a gandhabba, sir?’ you say: ‘I will not be a gandhabba, brahmin.’ When you are asked: ‘Could you be a yakkha, sir?’ you say: ‘I will not be a yakkha, brahmin.’ When you are asked: ‘Could you be a human being, sir?’ you say: ‘I will not be a human being, brahmin.’ What, then, could you be, sir?\"",
    "an4.36:4": "(1) \"Brahmin, I have abandoned those taints because of which I might have become a deva; I have cut them off at the root, made them like palm stumps, obliterated them so that they are no longer subject to future arising. (2) I have abandoned those taints because of which I might have become a gandhabba … (3) … might have become a yakkha … () … might have become a human being; I have cut them off at the root, made them like palm stumps, obliterated them so that they are no longer subject to future arising. Just as a blue, red, or white lotus flower, though born in the water and grown up in the water, rises above the water and standsunsoiled by the water, even so, though born in the world and grown up in the world, I have overcome the world and dwell unsoiled by the world. Remember me, brahmin, as a Buddha.",
    "an4.36:5": "\"I have destroyed those taints by whichI might have been reborn as a devaor as a gandhabba that travels through the sky;by which I might have reached the state of a yakkha,or arrived back at the human state:[n.698] The verbabbajehere is optative ofabbajati(Sktāvrajati). See DOP svabbajati.I have dispelled and cut down these taints.",
    "an4.36:6": "\"As a lovely white lotusis not soiled by the water,I am not soiled by the world:therefore, O brahmin, I am a Buddha.\"[n.99]Mp:\"At the end of the discourse, the brahmin attained three paths and fruits and, in 12,000 phrases, spoke the praise called ‘Doṇa's Thunder.’ When a great commotion erupted after the Buddha’s passing, he settled it and distributed the relics\"atDN 1.90, II 1."
}