{
    "an4.115:1": "\"Bhikkhus, there are these four cases of deeds.[n.796] The Pāli wordṭhānacan mean place, possibility, occasion, situation, cause, case, etc.Mpglosses it withkāraṇa. To convey the appropriate meaning, I here render it sometimes as \"case of a deed\" and sometimes simply as \"deed.\"What four? () There is a deed that is disagreeable to do which will prove harmful. (2) There is a deed that is disagreeable to do which will prove beneficial. (3) There is a deed that is agreeable to do which will prove harmful. (4) There is a deed that is agreeable to do which will prove beneficial.",
    "an4.115:2": "(1) \"Bhikkhus, take first the case of the deed that is disagreeable to do which will prove harmful. One considers that this deed should not be done on both grounds: because it is disagreeable to do and because it will prove harmful. One considers that this deed should not be done on both grounds.",
    "an4.115:3": "(2) \"Next, take the case of the deed that is disagreeable to do which will prove beneficial. It is in this case that one can understand who is a fool and who is a wise person in regard to manly strength, manly energy, and manly exertion. The fool does not reflect thus: ‘Although this deed is disagreeable to do, stillit will prove beneficial.’ So he does not do that deed, and his refraining from it proves harmful. But the wise person does reflect thus: ‘Although this deed is disagreeable to do, still it will prove beneficial.’ So he does that deed, and it proves beneficial.",
    "an4.115:4": "(3) \"Next, take the case of the deed that is agreeable to do which will prove harmful. It is in this case, too, that one can understand who is a fool and who is a wise person in regard to manly strength, manly energy, and manly exertion. The fool does not reflect thus: ‘Although this deed is agreeable to do, still it will prove harmful.’ So he does that deed, and it proves harmful. But the wise person does reflect thus: ‘Although this deed is agreeable to do, still it will prove harmful.’ So he does not do that deed, and his refraining from it proves beneficial.",
    "an4.115:5": "(4) \"Next, take the case of the deed that is agreeable to do which will prove beneficial. This deed is considered one that should be done on both grounds: because it is agreeable to do and because it proves beneficial. This deed is considered one that should be done on both grounds."
}