{
    "an4.6:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four? One of little learning who is not intent on what he has learned; one of little learning who is intent on what he has learned; one of much learning who is not intent on what he has learned; and one of much learning who is intent on what he has learned.",
    "an4.6:2": "() \"And how is a person one of little learning who is intent on what he has learned? Here, someone has learned little—that is, of the discourses … questions-and-answers—but having understood the meaning of what he has learned, and having understood the Dhamma, he practices in accordance with the Dhamma. In such a way, a person is one of little learning who is intent on what he has learned.",
    "an4.6:3": "() \"And how is a person one of much learning who is not intent on what he has learned? Here, someone has learned much—that is, of the discourses … questions-and-answers—but he does not understand the meaning of what he has learned; he does not understand the Dhamma; and he does not practice in accordance with the Dhamma. In such a way, a person is one of much learning who is not intent on what he has learned.",
    "an4.6:4": "() \"And how is a person one of much learning who is intent on what he has learned? Here, someone has learned much—that is, of the discourses … questions-and-answers—and having understood the meaning of what he has learned, and having understood the Dhamma, he practices in accordance with the Dhamma. In such a way, a person is one of much learning who is intent on what he has learned.",
    "an4.6:5": "If one has little learningand is not settled in the virtues,they criticize him on both counts,virtuous behavior and learning.",
    "an4.6:6": "If one has little learningbut is well settled in the virtues,they praise him for his virtuous behavior;his learning has succeeded.[n.32] I followBe,which readstassa sampajjate sutaṁin pāda d of this verse andnāssa sampajjate sutaṁ, \"his learning has not succeeded,\" in pāda d of the next verse. Ce readsnāssa sampajjate sutaṁhere andtassa sampajjate sutaṁin the next verse, while Ee hasnāssa sampajjate sutaṁin both places. Mp supports Be by explaining, in relation to this verse: \"His learning can be said to have succeeded because this person has used what he has learned to achieve the purpose of learning.\" And in relation to the next verse, Mp says: \"It (his learning) does not succeed because he has not achieved the purpose of learning.\" The verses are cited at Vism 48, Ppn 1.13, but with differences in readings among the several editions.",
    "an4.6:7": "If one is highly learnedbut is not settled in the virtues,they criticize him for his lack of virtue;his learning has not succeeded.",
    "an4.6:8": "If one is highly learnedand is settled in the virtues,they praise him on both counts,virtuous behavior and learning.",
    "an4.6:9": "When a disciple of the Buddha is highly learned,an expert on the Dhamma, endowed with wisdom,like a coin of refined mountain gold,who is fit to blame him?Even the devas praise such a one;by Brahmā too he is praised."
}