{
    "an4.196:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Then Sāḷha the Licchavi and Abhaya the Licchavi approached the Blessed One, paid homage to him, and sat down to one side. Sāḷha the Licchavi then said to the Blessed One:",
    "an4.196:2": "\"Bhante, there are some ascetics and brahmins who proclaim the crossing of the flood through two things: by means of purification of virtuous behavior and by means of austerity and disgust.[n.93] The crossing of the flood(oghassa nittharaṇa)is a metaphor for the crossing of saṁsāra or the eradication of defilements. The two factors mentioned by Sāḷha aresīlavisuddhiandtapojigucchā. The latter comprises diverse types of austerity and self-mortification rejected by the Buddha in his formulation of the \"middle way.\" In his reply, the Buddha accepts purification of virtuous behavior as one of the factors of asceticism(sāmaññanga), but rejects austerity and disgust.What does the Blessed One say about this?\"",
    "an4.196:3": "\"I say, Sāḷha, that purification of virtuous behavior is one of the factors of asceticism. But those ascetics and brahmins who advocate austerity and disgust, who regard austerity and disgust as the essence, and who adhere to austerity and disgust are incapable of crossing the flood.[n.924] SeeAN.78.Also, those ascetics and brahmins whose bodily, verbal, and mental behavior are impure, and whose livelihood is impure, are incapable of knowledge and vision, of unsurpassed enlightenment.",
    "an4.196:4": "\"Suppose, Sāḷha, a man desiring to cross a river were to take a sharp axe and enter a grove. There he would see a large sal sapling, straight, fresh, without a fruit-bud core. He would cut it down at its root, cut off the top, completely strip off the branches and foliage, trim it with axes, trim it further with hatchets, scrape it with a scraping tool, polish it with a stone ball, and set out to cross the river.",
    "an4.196:5": "What do you think, Sāḷha? Could that man cross the river?\"",
    "an4.196:6": "\"So too, Sāḷha, those ascetics and brahmins who advocate austerity and disgust, who regard austerity and disgust as the essence, and who adhere to austerity and disgust are incapable of crossing the flood. Also, those ascetics and brahmins whose bodily, verbal, and mental behavior are impure, and whose livelihood is impure, are incapable of knowledge and vision, of unsurpassed enlightenment.",
    "an4.196:7": "\"But, Sāḷha, those ascetics and brahmins who do not advocate austerity and disgust, who do not regard austerity and disgust as the essence, and who do not adhere to austerity and disgust are capable of crossing the flood. Also, those ascetics and brahmins whose bodily, verbal, and mental behavior are pure, and whose livelihood is pure, are capable of knowledge and vision, of unsurpassed enlightenment.",
    "an4.196:8": "\"Suppose, Sāḷha, a man desiring to cross a river were to take a sharp axe and enter a grove. There he would see a large sal sapling, straight, fresh, without a fruit-bud core. He would cut it down at its root, cut off the top, completely strip off the branches and foliage, trim it with axes, trim it further with hatchets, take a chisel and thoroughly cleanse it within, scrape it with a scraping tool, polish it with a stone ball, and make it into a boat. Then he would equip it with oars and a rudder and set out to cross the river.",
    "an4.196:9": "What do you think, Sāḷha? Could that man cross the river?\"",
    "an4.196:10": "(1) \"So too, Sāḷha, those ascetics and brahmins who do not advocate austerity and disgust, who do not regard austerity and disgust as the essence, and who do not adhere to austerity and disgust are capable of crossing the flood. Also, those ascetics and brahminswhose bodily, verbal, and mental behavior are pure, and whose livelihood is pure, are capable of knowledge and vision, of unsurpassed enlightenment.",
    "an4.196:11": "(2) \"Just as the warrior is a long-distance shooter, so too the noble disciple has right concentration. Whatever kind of form there is—whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near—a noble disciple with right concentration sees all form as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ Whatever kind of feeling there is … Whatever kind of perception there is … Whatever kind of volitional activities there are … Whatever kind of consciousness there is—whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near—a noble disciple with right concentration sees all consciousness as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’",
    "an4.196:12": "(3) \"Just as the warrior is a sharp-shooter, so too the noble disciple has right view. The noble disciple with right view understands as it really is: ‘This is suffering.’ He understands as it really is: ‘This is the origin of suffering.’ He understands as it really is: ‘This is the cessation of suffering.’ He understands as it really is: ‘This is the way leading to the cessation of suffering.’",
    "an4.196:13": "(4) \"Just as the warrior splits a great body, so too the noble disciple has right liberation. The noble disciple with right liberation has split the great mass of ignorance.\"[n.925] I assume this sutta is included in the Fours by way of moral purity (of body, speech, mind, and livelihood), right concentration, right view, and right liberation. However, the sutta itself is not sufficiently explicit about this and thus my numbering is hypothetical."
}