{
    "an4.73:1": "\"Bhikkhus, one who possesses four qualities can be understood to be a bad person. What four?",
    "an4.73:2": "() \"Again, a bad person does not disclose the virtues of others even when asked about them, how much less then when not asked. But when he is asked about them, then, though led on by questions, he speaks about the virtues of others with gaps and omissions, not fully or in detail. It can be understood: ‘This fellow is a bad person.’",
    "an4.73:3": "() \"Again, a bad person does not disclose his own faults even when asked about them, how much less then when not asked. But when he is asked about them, then, though led on by questions, he speaks about his own faults with gaps and omissions, not fully or in detail. It can be understood: ‘This fellow is a bad person.’",
    "an4.73:4": "() \"Again, a bad person discloses his own virtues even when not asked about them, how much more then when asked. But when he is asked about them, then, led on by questions, he speaks about his own virtues without gaps and omissions, fully and in detail. It can be understood: ‘This fellow is a bad person.’",
    "an4.73:5": "\"Bhikkhus, one who possessesanotherfour qualities can be understood to be a good person. What four?",
    "an4.73:6": "(2) \"Again, a good person discloses the virtues of others even when not asked about them, how much more then when asked. But when he is asked about them, then, led on by questions, he speaks about the virtues of others without gaps and omissions, fully and in detail. It can be understood: ‘This fellow is a good person.’",
    "an4.73:7": "(3) \"Again, a good person discloses his own faults even when not asked about them, how much more then when asked. But when he is asked about them, then, led on by questions, he speaks about his own faults without gaps and omissions, fully and in detail. It can be understood: ‘This fellow is a good person.’",
    "an4.73:8": "(4) \"Again, a good person does not disclose his own virtues even when asked about them, how much less then when not asked. But when he is asked about them, then, led on by questions, he speaks about his own virtues with gaps and omissions, not fully or in detail. It can be understood: ‘This fellow is a good person.’",
    "an4.73:9": "\"Bhikkhus,[n.768] Ee treats this as the beginning of a new sutta, numberedAN4.74, whereas Ce and Be consider this part ofAN4.73.Mpsupports Ce and Be, stating that the simile is brought in to give an example of the bad person's character.when a bride is first brought into the home, whether at night or during the day, at first she sets up a keen sense of moral shame and moral dread toward her mother-in-law, her father-in-law, her husband, and even the slaves, workers, and servants. But after some time, as a result of living together and intimacy with them, she says to her mother-in-law, her father-in-law, and her husband: ‘Go away! What do you know?’"
}