{
    "an4.241:1": "\"Bhikkhus, ‘only here is there an ascetic, a second ascetic, a third ascetic, and a fourth ascetic. The other sects are empty of ascetics.’[n.947] I follow here the reading ofCeand Ee:suññā parappavādā samaṇehi aññe ti. Be readsaññehiforaññe ti. The same difference in readings between the editions occurs at MN I 63,30–64,. In a line of verse without reference to a lion's roarDN II 5,22, hassuññā parappavādā samaṇehi aññe.Mpsays that the \"other sects\" are the proponents of the sixty-two views, who lack twelve kinds of ascetics: the four who have attained the fruits, the four cultivating the paths, and the four practicing insight to attain the respective paths.It is in such a way that you should rightly roar your lion's roar.",
    "an4.241:2": "(1) \"And what, bhikkhus, is the first ascetic? Here, with the utter destruction of three fetters, a bhikkhu is a stream-enterer, no longer subject torebirth inthe lower world, fixed in destiny, heading for enlightenment. This is the first ascetic.",
    "an4.241:3": "(2) \"And what is the second ascetic? Here, with the utter destruction of three fetters and with the diminishing of greed, hatred, and delusion, a bhikkhu is a once-returner who, after coming back to this world only one more time, will make an end of suffering. This is the second ascetic.",
    "an4.241:4": "(3) \"And what is the third ascetic? Here, with the utter destruction of the five lower fetters, a bhikkhu is of spontaneous birth, due to attain final nibbāna there without returning from that world. This is the third ascetic.",
    "an4.241:5": "(4) \"And what is the fourth ascetic? Here, with the destruction of the taints, a bhikkhu has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. This is the fourth ascetic.",
    "an4.241:6": "\"Bhikkhus, ‘only here is there an ascetic, a second ascetic, a third ascetic, and a fourth ascetic. The other sects are empty of ascetics.’ It is in such a way that you should rightly roar your lion's roar.\""
}