{
    "an4.107:1": "\"Bhikkhus, there are these four kinds of mice. What four? The one that makes a hole but does not live in it; the one that lives in a hole but does not make one; the one that neither makes a hole nor lives in one; and the one that both makes a hole and lives in it. These are the four kinds of mice. So too, there are these four kinds of persons similar to mice found existing in the world. What four? The one who makes a hole but does not live in it; the one who lives in a hole but does not make one; the one who neither makes a hole nor lives in one; and the one who both makes a hole and lives in it.",
    "an4.107:2": "(1) \"And how, bhikkhus, is a person one who makes a hole but does not live in it? Here, someone masters the Dhamma—the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers—but he does not understand as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is one who makes a hole but does not live in it. So, I say, this person is just like a mouse that makes a hole but does not live in it.",
    "an4.107:3": "(2) \"And how is a person one who lives in a hole but does not make one? Here, someone does not master the Dhamma—the discourses … questions-and-answers—but he understands as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is one who lives in a hole but does not make one. So, I say, this person is just like a mouse that lives in a hole but does not make one.",
    "an4.107:4": "(3) \"And how is a person one who neither makes a hole nor lives in one? Here, someone does not master the Dhamma—the discourses … questions-and-answers—and he does not understand as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is one who neither makes a hole nor lives in one. So, I say, this person is just like a mouse that neither makes a hole nor lives in one.",
    "an4.107:5": "(4) \"And how is a person one who both makes a hole and lives in it? Here, someone masters the Dhamma—the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers—and he understands as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is one who both makes a hole and lives in it. So, I say, this person is just like a mouse that both makes a hole and lives in it."
}