{
    "an4.165:1": "\"Bhikkhus, there are these four modes of practice. What four? The impatient practice, the patient practice, the taming practice, and the calming practice.",
    "an4.165:2": "(1) \"And what, bhikkhus, is the impatient practice? Here, someone does not patiently endure cold and heat; hunger and thirst; contact with flies, mosquitoes, wind, the burning sun, and serpents; rude and offensive ways of speech; he is unable to bear up with arisen bodily feelings that are painful, racking, sharp, piercing, harrowing, disagreeable, sapping one's vitality. This is called the impatient practice.",
    "an4.165:3": "(2) \"And what is the patient practice? Here, someone patiently endures cold and heat … rude and offensive ways of speech; he is able to bear up with arisen bodily feelings that are painful, racking, sharp, piercing, harrowing, disagreeable, sapping one's vitality. This is called the patient practice.",
    "an4.165:4": "(3) \"And what is the taming practice? Here, having seen a form with the eye, a bhikkhu does not grasp its marks and features. Since, if he left the eye faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the eye faculty, he undertakes the restraint of the eye faculty. Having heard a sound with the ear … Having smelled an odour with the nose … Having tasted a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, a bhikkhu does not grasp its marks and features. Since, if he left the mind faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the mind faculty, he undertakes the restraint of the mind faculty. This is called the taming practice.",
    "an4.165:5": "(4) \"And what is the calming practice? Here, a bhikkhu does not tolerate an arisen sensual thought; he abandons it, dispels it, calms it down, terminates it, and obliterates it.Here,sameti, \"calms (it) down,\" is an addition to the usual formula, intended to subsume this discipline under \"the calming practice.\"He does not tolerate an arisen thought of ill will … an arisen thought of harming … bad unwholesome states whenever they arise; he abandons them, dispels them, calms them down, terminates them, and obliterates them. This is called the calming practice."
}