{
    "an4.181:1": "\"Bhikkhus, possessing four factors, a warrior is worthy of a king, an accessory of a king, and reckoned a factor of kingship. What four? Here, a warrior is skilled in places, a long-distance shooter, a sharp-shooter, and one who splits a great body. Possessing these four factors, a warrior is worthy of a king, an accessory of a king, and reckoned a factor of kingship.So too, possessing four factors, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What four? Here, a bhikkhu is skilled in places, a long-distance shooter, a sharp-shooter, and one who splits a great body.",
    "an4.181:2": "(1) \"And how, bhikkhus, is a bhikkhu skilled in places? Here, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them. It is in this way that a bhikkhu is skilled in places.",
    "an4.181:3": "(2) \"And how is a bhikkhu a long-distance shooter? Here, any kind of form whatsoever—whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near—a bhikkhu sees all form as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ Any kind of feeling whatsoever … Any kind of perception whatsoever … Any kind of volitional activities whatsoever … Any kind of consciousness whatsoever—whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near—a bhikkhu sees all consciousness as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ It is in this way that a bhikkhu is a long-distance shooter.",
    "an4.181:4": "(3) \"And how is a bhikkhu a sharp-shooter? Here, a bhikkhu understands as it really is: ‘This is suffering.’ He understands as it really is: ‘This is the origin of suffering.’ He understands as it really is: ‘This is the cessation of suffering.’ He understands as it really is: ‘This is the way leading to the cessation of suffering.’ It is in this way that a bhikkhu is a sharp-shooter.",
    "an4.181:5": "(4) \"And how is a bhikkhu one who splits a great body? Here, a bhikkhu splits the great mass of ignorance. It is in this way that a bhikkhu is one who splits a great body."
}