{
    "an4.4:1": "\"Bhikkhus, behaving wrongly toward four persons, the foolish, incompetent, bad person maintains himself in a maimed and injured condition; he is blameworthy and subject to reproach by the wise; and he generates much demerit. What four? () Behaving wrongly toward his mother, the foolish, incompetent, bad person maintains himself in a maimed and injured condition; he is blameworthy and subject to reproach by the wise; and he generates much demerit. (2) Behaving wrongly toward his father … (3) Behaving wrongly toward the Tathāgata … (4) Behaving wrongly toward a disciple of the Tathāgata … Behaving wrongly toward these four persons, the foolish, incompetent, bad person maintains himself in a maimed and injured condition; he is blameworthy and subject to reproach by the wise; and he generates much demerit.",
    "an4.4:2": "\"Bhikkhus, behaving rightly toward four persons, the wise, competent, good person preserves himself unmaimed and uninjured; he is blameless and beyond reproach by the wise; and he generates much merit. What four? (1) Behaving rightly toward his mother, the wise, competent, good person preserves himself unmaimed and uninjured; he is blameless and beyond reproach by the wise; and he generates much merit. () Behaving rightly toward his father … (3) Behaving rightly toward the Tathāgata … (4) Behaving rightly toward a disciple of the Tathāgata … Behaving rightly toward these four persons, the wise, competent, good person preserves himself unmaimed and uninjured; he is blameless and beyond reproach by the wise; and he generates much merit.\"",
    "an4.4:3": "A person who behaves wronglytoward his mother and father,toward the enlightened Tathāgata,or toward his disciple,generates much demerit.",
    "an4.4:4": "Because of that unrighteous conducttoward mother and father,the wise criticize one here in this worldand after death one goes to the plane of misery.",
    "an4.4:5": "A person who behaves rightlytoward his mother and father,toward the enlightened Tathāgata,or toward his disciple,generates much merit.",
    "an4.4:6": "Because of that righteous conducttoward mother and father,the wise praise one in this worldand after death one rejoices in heaven.[n.27] The verse is also atAN3.31andAN4.3, but heredhammacariyāyareplacesparicariyāya."
}