{
    "an4.114:1": "\"Bhikkhus, possessing four factors a king's bull elephant is worthy of a king, an accessory of a king, and reckoned as a factor of kingship. What four? Here, a king's bull elephant is one who listens, who destroys, who patiently endures, and who goes.",
    "an4.114:2": "(1) \"And how, bhikkhus, is a king's bull elephant one who listens? Here, whatever task the elephant trainer sets for it, whether or not it has ever done it before, the king's bull elephant heeds it, attends to it, directs his whole mind to it, and listens with eager ears. It is in this way that a king's bull elephant is one who listens.",
    "an4.114:3": "(2) \"And how is a king's bull elephant one who destroys? Here, when a king's bull elephant has entered the battle, it destroys elephants and elephant riders; it destroys horses and cavalry;it destroys chariots and charioteers; it destroys infantry. It is in this way that a king's bull elephant is one who destroys.",
    "an4.114:4": "(3) \"And how is a king's bull elephant one who patiently endures? Here, when a king's bull elephant has entered the battle, it patiently endures being struck by spears, swords, arrows, and axes; it endures the thundering of drums, kettledrums, conches, and tom-toms. It is in this way that a king's bull elephant is one who patiently endures.",
    "an4.114:5": "(4) \"And how is a king's bull elephant one who goes? Here, the king's bull elephant quickly goes to whatever region the elephant trainer sends it, whether or not it has ever gone there before. It is in this way that a king's bull elephant is one who goes.",
    "an4.114:6": "\"So too, bhikkhus, possessing four qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What four? Here, a bhikkhu is one who listens, who destroys, who patiently endures, and who goes.",
    "an4.114:7": "(1) \"And how, bhikkhus, is a bhikkhu one who listens? Here, when the Dhamma and discipline proclaimed by the Tathāgata is being taught, a bhikkhu heeds it, attends to it, directs his whole mind to it, and listens with eager ears. It is in this way that a bhikkhu is one who listens.",
    "an4.114:8": "(2) \"And how is a bhikkhu one who destroys? Here, a bhikkhu does not tolerate an arisen sensual thought, but abandons it, dispels it, terminates it, and obliterates it. He does not tolerate an arisen thought of ill will … an arisen thought of harming … any other bad unwholesome states that arise from time to time, but abandons them, dispels them, terminates them, and obliterates them. It is in this way that a bhikkhu is one who destroys.",
    "an4.114:9": "(3) \"And how is a bhikkhu one who patiently endures? Here, a bhikkhu patiently endures cold and heat; hunger and thirst; contact with flies, mosquitoes, wind, the burning sun, and serpents; rude and offensive ways of speech;he is able to bear up with arisen bodily feelings that are painful, racking, sharp, piercing, harrowing, disagreeable, sapping one's vitality. It is this way that a bhikkhu is one who patiently endures.",
    "an4.114:10": "(4) \"And how is a bhikkhu one who goes? Here, a bhikkhu quickly goes to that region where he has never before gone in this long stretch of time, that is, to the stilling of all activities, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, nibbāna. It is in this way that a bhikkhu is one who goes."
}