{
    "an4.169:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four?",
    "an4.169:2": "(1) \"And how, bhikkhus, does a person attain nibbāna through exertion in this very life? Here, a bhikkhu dwells contemplating the unattractiveness of the body, perceiving the repulsiveness of food, perceiving non-delight in the entire world, contemplating impermanence in all conditioned phenomena; and he has the perception of deathwell established internally. He dwells depending upon these five trainee powers: the power of faith, the power of moral shame, the power of moral dread, the power of energy, and the power of wisdom. These five faculties arise in him prominently: the faculties of faith, energy, mindfulness, concentration, and wisdom. Because these five faculties are prominent, he attains nibbāna through exertion in this very life. This is how a person attains nibbāna through exertion in this very life.",
    "an4.169:3": "(2) \"And how does a person attain nibbāna through exertion with the breakup of the body? Here, a bhikkhu dwells contemplating the unattractiveness of the body … and he has the perception of death well established internally. He dwells depending upon these five trainee powers: the powers of faith … and wisdom. These five faculties arise in him feebly: the faculties of faith … and wisdom. Because these five faculties are feeble, he attains nibbāna through exertion with the breakup of the body. This is how a person attains nibbāna through exertion with the breakup of the body.",
    "an4.169:4": "(3) \"And how does a person attain nibbāna without exertion in this very life? Here, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna … the fourth jhāna. He dwells depending upon these five trainee powers: the powers of faith … and wisdom. These five faculties arise in him prominently: the faculties of faith … and wisdom. Because these five faculties are prominent, he attains nibbāna without exertion in this very life. This is how a person attains nibbāna without exertion in this very life.",
    "an4.169:5": "(4) \"And how does a person attain nibbāna without exertion with the breakup of the body? Here, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna … the fourth jhāna. He dwells depending upon these five trainee powers: the powers of faith … and wisdom. These five faculties arise in him feebly: the faculties of faith … and wisdom. Because these five faculties are feeble, he attains nibbāna without exertion with the breakup of the body. This is how a person attains nibbāna without exertion with the breakup of the body."
}