{
    "an4.170:1": "On one occasion the Venerable Ānanda was dwelling at Kosambī in Ghosita's Park. There the Venerable Ānanda addressed the bhikkhus:",
    "an4.170:2": "\"Friends, whatever bhikkhu or bhikkhunī has declared the attainment of arahantship in my presence has done so by these four paths[n.857] WithCeand Be I readmaggehi, as against Eeaṅgehi. The latter is likely to be an editorial error. ThoughMpdoes not provide a gloss here, the passage is cited at Paṭis II 9,9, and commented on at Paṭis-a III 584,4–5, in a way that requiresmaggehi:Catūhi maggehīti upari vuccamānehi catūhi paṭipadāmaggehi, na ariyamaggehi(\"By four paths: by the four paths of practice spoken about below, not by the noble paths\").or by a certain one among them.",
    "an4.170:3": "What four? (1) \"Here, a bhikkhu develops insight preceded by serenity. As he is developing insight preceded by serenity, the path is generated.[n.858]Mpexplains this as the first world-transcending path, but Mp-ṭ says: \"This is said with reference to the path of stream-entry(sotāpattimagga), but the meaning of this passage can be understand simply by way of the mundane (preparatory) path\"(lokiyamaggavasen’eva).He pursues this path, develops it, and cultivates it. As he is pursuing, developing, and cultivating this path, the fetters are abandoned and the underlying tendencies are uprooted.[n.859]Mpand Mp-ṭ, read together, say that because there is no development and cultivation of the world-transcending path, which lasts for only one mind-moment, he develops and cultivates the preparatory mundane path(pubbabhāgiyo lokiyamaggo)for the purpose of attaining the higher world-transcending paths. Then the fetters are abandoned and the underlying tendencies are uprooted by the successive paths(maggappaṭipāṭiya pahīyanti byantī honti).",
    "an4.170:4": "(2) \"Again, a bhikkhu develops serenity preceded by insight.[n.860]Mp:\"This is a person who naturally gains insight. Based on insight, he produces concentration.\"As he is developing serenity preceded by insight, the path is generated. He pursues this path, develops it, and cultivates it. As he is pursuing, developing, and cultivating this path, the fetters are abandoned and the underlying tendencies are uprooted.",
    "an4.170:5": "(3) \"Again, a bhikkhu develops serenity and insight in conjunction.[n.861]Yuganaddhaṁ bhāveti.Mpsays that each time he attains a meditative attainment(samāpatti), he explores it by way of its conditioned phenomena. And having explored its conditioned phenomena, he enters the next attainment. Thus, having attained the first jhāna, he emerges and explores its conditioned phenomena as impermanent, etc. Then he enters the second jhāna, emerges, and explores its conditioned phenomena, and so on up to the base of neither-perception-nor-non-perception. Since, however,yuganaddhameans literally \"yoked together,\" some interpret the term to mean that in this mode of practice serenity and insight occur simultaneously. The commentarial system does not acknowledge this possibility but several suttas might be read as suggesting that insight can occur within the jhāna and does not require the meditator to withdraw before beginning contemplation. In AN, see in particularAN9.36; see tooMN 2.4–14, I 30–2;MN 64.17–21, I 43–37.As he is developing serenity and insight in conjunction, the path is generated. He pursues this path, develops it, and cultivates it. As he is pursuing, developing, and cultivating this path, the fetters are abandoned and the underlying tendencies are uprooted.",
    "an4.170:6": "(4) \"Again, a bhikkhu's mind is seized by restlessness about the Dhamma.[n.82] The readings vary. Ee hasdhammuddhaccaviggahītamanā; the termination-manāis suspicious. Be has -viggahitaṁ mānasaṁ. Ce has-viggahītaṁ mānaṁ. Whilemanāandmānasaṁcan both be translated as \"mind,\"mānaṁnormally means \"conceit.\" The Sinhala translation seems to support this by renderingmānaṁasadhimānaya(Pāliadhimāna), \"overestimation of oneself,\" but to speak of \"conceit\"—as opposed to \"mind\"—as being \"grasped by restlessness\" does not make good sense.Mpglosses the term without specifying the subject: \"Grasped, thoroughly grasped, by restlessness, which consists of the ten corruptions of insight(dasa vipassan’upakkilesā; see Vism 33–38, Ppn 20.105–28) in regard to thedhammasof serenity and insight.\" Nothing in the text itself suggests the corruptions of insight are involved. I understand the person being described here as a practitioner who reflects deeply on the Dhamma, acquires a sense of urgency, and then finally settles down and gains insight when meeting with favorable supporting conditions. In the next sentence of the text, the word rendered \"mind\" iscittaṁ.But there comes an occasion when his mind becomes internally steady, composed, unified, and concentrated. Then the path is generated in him. He pursues this path, develops it, and cultivates it. As he is pursuing, developing, and cultivating this path, the fetters are abandoned and the underlying tendencies are uprooted.",
    "an4.170:7": "\"Whatever bhikkhu or bhikkhunī, friends, has declared the attainment of arahantship in my presence has done so by these four paths or by a certain one among them.\""
}