{
    "an4.183:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the squirrel sanctuary. Then the brahmin Vassakāra, the chief minister of Magadha, approached the Blessed One and exchanged greetings with him …. Then, sitting to one side, he said to the Blessed One:",
    "an4.183:2": "\"Master Gotama, I hold the thesis and view that there is no fault when one speaks about the seen, saying: ‘Such was seen by me’; no fault when one speaks about the heard, saying: ‘Such was heard by me’; no fault when one speaks about the sensed, saying: ‘Such was sensed by me’; no fault when one speaks about the cognized, saying: ‘Such was cognized by me.’\"",
    "an4.183:3": "(1) \"I do not say, brahmin, that everything seen should be spoken about, nor do I say that nothing seen should be spoken about. (2) I do not say that everything heard should be spoken about, nor do I say that nothing heardshould be spoken about. () I do not say that everything sensed should be spoken about, nor do I say that nothing sensed should be spoken about. (4) I do not say that everything cognized should be spoken about, nor do I say that nothing cognized should be spoken about.",
    "an4.183:4": "(1) \"For, brahmin, if, when one speaks about what one has seen, unwholesome qualities increase and wholesome qualities decline, I say that one should not speak about what one has seen. But if, when one speaks about what one has seen, unwholesome qualities decline and wholesome qualities increase, I say that one should speak about what one has seen.[n.895] I followCeand Ee here. Be differs and would be translated: \"But if, when one does not speak about what one has seen, wholesome qualities decline and unwholesome qualities increase, I say that one should speak about what one has seen.\" Each of the following paragraphs varies in the same way.",
    "an4.183:5": "(2) \"If, when one speaks about what one has heard, unwholesome qualities increase and wholesome qualities decline, I say that one should not speak about what one has heard. But if, when one speaks about what one has heard, unwholesome qualities decline and wholesome qualities increase, I say that one should speak about what one has heard.",
    "an4.183:6": "(3) \"If, when one speaks about what one has sensed, unwholesome qualities increase and wholesome qualities decline, I say that one should not speak about what one has sensed. But if, when one speaks about what one has sensed, unwholesome qualities decline and wholesome qualities increase, I say that one should speak about what one has sensed.",
    "an4.183:7": "(4) \"If, when one speaks about what one has cognized, unwholesome qualities increase and wholesome qualities decline, I say that one should not speak about what one has cognized. But if, when one speaks about what one has cognized, unwholesome qualities decline and wholesome qualities increase, I say that one should speak about what one has cognized.\"",
    "an4.183:8": "Then the brahmin Vassakāra, the chief minister of Magadha, having delighted and rejoiced in the Blessed One's statement, rose from his seat and departed."
}