{
    "an4.192:1": "\"Bhikkhus, four factsabout peoplecan be known from fourotherfacts. What four?",
    "an4.192:2": "(1) \"It was said: ‘By dwelling together their virtuous behavior can be known, and this only after a long time, not casually; by one who is attentive, not by one who is inattentive; and by one who is wise, not by one who is unwise.’ On account of what was this said?",
    "an4.192:3": "\"But in another case, by dwelling together with another person, one comes to know him thus: ‘For a long time this venerable one's conduct has been unbroken, flawless, unblemished, and unblotched,and he consistently observes and follows virtuous behavior. This venerable one is virtuous, not immoral.’",
    "an4.192:4": "(2) \"Further it was said: ‘By dealingwith themtheir integrity can be known, and this only after a long time, not casually; by one who is attentive, not by one who is inattentive; and by one who is wise, not by one who is unwise.’ On account of what was this said?",
    "an4.192:5": "\"But in another case, when dealing with a person, one comes to know him thus: ‘In the same way as he deals with one, he deals with two, three, or many. His dealings in one case do not deviate from his dealings in another. This venerable one is pure in his dealings with others, not impure in such dealings.’",
    "an4.192:6": "(3) \"Further it was said: ‘In misfortune their fortitude can be known, and this only after a long time, not casually; by one who is attentive, not by one who is inattentive; and by one who is wise, not by one who is unwise.’ On account of what was this said?",
    "an4.192:7": "\"But in another case, someone is afflicted with the loss of relatives,wealth, or health, but he does reflect thus: ‘Human life in the world is such that the eight worldly conditions revolve around the world, and the world revolves around these eight worldly conditions, namely, gain and loss, disrepute and fame, blame and praise, and pleasure and pain.’ Thus when afflicted with the loss of relatives, wealth, or health, he does not sorrow, languish, and lament; he does not weep beating his breast and become confused.",
    "an4.192:8": "(4) \"Further it was said: ‘By conversation their wisdom can be known, and this only after a long time, not casually; by one who is attentive, not by one who is inattentive; and by one who is wise, not by one who is unwise.’ On account of what was this said?",
    "an4.192:9": "Just as if a man with good sight, standing on the bank of a pond, were to see a small fish emerging, he would think: ‘Judging from the way this fish emerges, from the ripples it makes, and from its force, this is a small fish, not a big one,’ so too, when conversing with a person, one comes to know: ‘Judging from the way this venerable one initiates, formulates, and poses a question, he is unwise, not wise.’",
    "an4.192:10": "\"But in another case, when conversing with someone, one comes to know: ‘Judging from the way this venerable one initiates, formulates, and poses a question, he is wise, not unwise. For what reason? This venerable one speaks about matters that are deep, peaceful, sublime, beyond the sphere of reasoning, subtle, comprehensible to the wise. When this venerable one speaks on the Dhamma, he is able to explain, teach, describe, establish, reveal, analyze, and explicate its meaning both briefly and in detail. This venerable one is wise, not unwise.’",
    "an4.192:11": "Just as if a man with good sight, standing on the bank of a pond, were to see a big fish emerging,he would think: ‘Judging from the way this fish emerges, from the ripples it makes, and from its force, this is a big fish, not a small one,’ so too, when conversing with someone, one comes to know: ‘Judging from the way this venerable one initiates, formulates, and poses a question, he is wise, not unwise.’",
    "an4.192:12": "\"It was on account of this that it was said: ‘By conversation their wisdom can be known, and this only after a long time, not casually; by one who is attentive, not by one who is inattentive; and by one who is wise, not by one who is unwise.’"
}