{
    "an4.102:1": "\"Bhikkhus, there are these four kinds of clouds. What four? The one that thunders but does not rain; the one that rains but does not thunder; the one that neither thunders nor rains; and the one that both thunders and rains. These are the four kinds of clouds. So too, there are these four kinds of persons similar to clouds found existing in the world. What four? The one who thunders but does not rain; the one who rains but does not thunder; the one who neither thunders nor rains; and the one who both thunders and rains.",
    "an4.102:2": "(1) \"And how, bhikkhus, is a person one who thunders but does not rain? Here, someone masters the Dhamma—the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers[n.79] These are the nine divisions of the Buddha’s teachings. SeeAN4.6, n. 631.—but he does not understand as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is one who thunders but does not rain. So, I say, this person is just like a cloud that thunders but does not rain.",
    "an4.102:3": "(2) \"And how is a person one who rains but does not thunder? Here, someone does not master the Dhamma—the discourses … questions-and-answers—but he understands as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is one who rains but does not thunder. So, I say, this person is just like a cloud that rains but does not thunder.",
    "an4.102:4": "(3) \"And how is a person one who neither thunders nor rains? Here, someone does not master the Dhamma—the discourses … questions-and-answers—and he does not understand as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is one who neither thunders nor rains. So, I say, this person is just like a cloud that neither thunders nor rains.",
    "an4.102:5": "(4) \"And how is a person one who both thunders and rains? Here, someone masters the Dhamma—the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers—and he understands as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’ It is in this way that a person is one who both thunders and rains. So, I say, this person is just like a cloud that both thunders and rains."
}