{
    "an4.87:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four? The ascetic unshaken, the red-lotus ascetic, the white-lotus ascetic, and the delicate ascetic among ascetics.[n.778]Mpresolvessamaṇamacalointosamaṇa-acalo, with –m– a mere conjunct consonant. It identifies this figure with the seven kinds of trainees(sattavidhampi sekhaṁ dasseti). On the next two ascetics,Mpsays: \"Thewhite-lotus ascetic(samaṇapuṇḍarīka)is an ascetic similar to a white lotus(puṇḍarīka), which has fewer than a hundred petals. By this he shows the dry-insight arahant(sukkhavipassakakhīṇāsavaṁ dasseti), called a white-lotus ascetic because his virtues are incomplete, since he lacks the jhānas and direct knowledges. The red-lotus ascetic(samaṇapaduma)is an ascetic similar to a red lotus(paduma), which has a full hundred petals. By this he shows the arahant liberated in both respects(ubhatobhāgavimuttaṁ khīṇāsavaṁ dasseti), called a red-lotus ascetic because his virtues are complete, since he possesses the jhānas and direct knowledges.\" On the colors of the two kinds of lotus flowers,puṇḍarīkaandpaduma, seeAN3.39, n. 389. \"The delicate ascetic among ascetics\"(samaṇesu samaṇasukhumālo)is \"one with soft mind and body, who experiences exclusively pleasure, free from bodily and mental pain\"(muducittasarīro kāyikacetasikadukkharahito ekantasukhī).",
    "an4.87:2": "(1) \"And how, bhikkhus, is a person an ascetic unshaken? Here, a bhikkhu is a trainee practicing the way who dwells aspiring for the unsurpassed security from bondage. Just asthe eldest son of a head-anointed khattiya king—one due to be anointed but not yet anointed—would have attained the unshaken,[n.779]Mp:\"Macalappattoti rañño khattiyassa muddhāvasittassa puttabhāvena ceva puttesu jeṭṭhakabhāvena ca na tāva abhisittabhāvena ca abhisekappatti-atthāya acalappatto niccalapatto.\" The gist is that the eldest son is said to have \"attained the unshaken\" since he is destined to be a head-anointed king. See tooAN3.13, n. 345.so too a bhikkhu is a trainee practicing the way who dwells aspiring for the unsurpassed security from bondage.[n.780]Anuttaraṁ yogakkhemaṁ patthayamāno viharati.Mp:\"He dwells aspiring for arahantship.\"It is in this way that a person is an ascetic unshaken.",
    "an4.87:3": "(2) \"And how is a person a white-lotus ascetic? Here, with the destruction of the taints, a bhikkhu has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it; yet he does not dwell having contacted with the body the eight emancipations. It is in this way that a person is a white-lotus ascetic.[n.781] The eight emancipations(aṭṭha vimokkhā), defined atAN8.66, are not exactly identical with the four jhānas and four formless attainments. It seems that the first three emancipations correspond to the four jhānas but distinguish them in terms of objects rather than mental factors.",
    "an4.87:4": "(3) \"And how is a person a red-lotus ascetic? Here, with the destruction of the taints, a bhikkhu has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it; and he dwells having contacted with the body the eight emancipations. It is in this way that a person is a red-lotus ascetic.[n.782] Again, there is an ambiguity in the definition of the red-lotus ascetic. To qualify as such, does one have to possess all eight emancipations or is it sufficient to possess several? Given the commentarial explanation, which compares the red-lotus ascetic to a lotus with a full hundred petals, it seems that one would have to possess all eight emancipations. But the commentarial definition of theubhatobhāgavimuttaarahant allows one who possessesanyof the formless attainments to count as \"one liberated in both respects.\" This, too, might represent a lowering of a more stringent criterion that would restrict the designation to an arahant possessing all eight emancipations.",
    "an4.87:5": "(4) \"And how is a person a delicate ascetic among ascetics? Here, a bhikkhu usually uses a robe that has been specifically offered to him, seldom one that has not been specifically offered to him;[n.783] More literally, \"the robe he uses is usually one that he has been asked to accept, seldom one that he has not been asked to accept.\" And so with the other three requisites.he usually eats almsfood that has been specifically offered to him, seldom almsfood that has not been specifically offered to him; he usually uses a lodging that has been specifically offered to him, seldom one that has not been specifically offered to him; he usually uses medicines and provisions for the sick that have been specifically offered to him, seldom those that have not been specifically offered to him. His fellow monks, those with whom he dwells, usually behave toward him in agreeable ways by body, speech, and mind, seldom in disagreeable ways. They usually present him what is agreeable, seldom what is disagreeable. Discomfort originating from bile, phlegm, wind, or their combination;[n.784] In commenting onsannipātikāni,Mp-ṭsays \"produced by a combination of the three—bile and so forth—which are out of balance\"(pittādīnaṁ tiṇṇampi visamānaṁ sannipātena jātāni). Spk III 81,22–23, commenting on the same word atSN IV 230,29, says \"originating through a disturbance of the three, bile and so forth\"(tiṇṇampi pittādīnaṁ kopena samuṭṭhitāni).discomfort produced by change of climate; discomfort produced by careless behavior; discomfort produced by assault; or discomfort produced as the result of kamma—these do not often arise in him.[n.78] The eight causes of feelings are also at SN36:21, IV 230–31.He is seldom ill. He gains at will, without trouble or difficulty, the four jhānas that constitute the higher mind and are pleasant dwellings in this very life. With the destruction of the taints, he has realized for himself with direct knowledge, in this very life, the taintless liberation of mind,liberation by wisdom, and having entered upon it, he dwells in it. It is in this way that a person is a delicate ascetic among ascetics.",
    "an4.87:6": "\"If, bhikkhus, one could rightly say of anyone: ‘He is a delicate ascetic among ascetics,’ it is precisely of me that one might say this. For I usually use a robe that has been specifically offered to me, seldom one that has not been specifically offered to me; I usually eat almsfood that has been specifically offered to me, seldom almsfood that has not been specifically offered to me; I usually use a lodging that has been specifically offered to me, seldom one that has not been specifically offered to me; I usually use medicines and provisions for the sick that have been specifically offered to me, seldom those that have not been specifically offered to me. Those bhikkhus with whom I dwell usually behave toward me in agreeable ways by body, speech, and mind, seldom in disagreeable ways. They usually present me what is agreeable, seldom what is disagreeable. Discomfort originating from bile, phlegm, wind, or their combination; discomfort produced by change of climate; discomfort produced by careless behavior; discomfort produced by assault; or discomfort produced as the result of kamma—these do not often arise in me. I am seldom ill. I gain at will, without trouble or difficulty, the four jhānas that constitute the higher mind and are pleasant dwellings in this very life. With the destruction of the taints, I have realized for myself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, I dwell in it.",
    "an4.87:7": "If one could rightly say of anyone: ‘He is a delicate ascetic among ascetics,’ it is precisely of me that one might say this."
}