{
    "an4.45:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, when the night had advanced, the young deva Rohitassa, of stunning beauty, illuminating the entire Jeta's Grove, approached the Blessed One. He paid homage to the Blessed One, stood to one side, and said:",
    "an4.45:2": "\"Is it possible, Bhante, by traveling to know, see, or reach the end of the world, where one is not born, does not grow old and die,does not pass away and get reborn?\"",
    "an4.45:3": "\"It is astounding and amazing, Bhante, how well this was stated by the Blessed One: ‘I say, friend, that by traveling one cannot know, see, or reach that end of the world where one is not born, does not grow old and die, does not pass away and get reborn.’",
    "an4.45:4": "\"In the past, Bhante, I was a seer named Rohitassa, son of Bhoja, one possessing psychic potency, able to travel through the sky. My speed was like that of a light arrow easily shot by a firm-bowed[n.72]Daḷhadhammā. The suffix -dhammahere is a Pāli formation of Sktdhanvan, \"having a bow.\" Hence the gloss byMp:\"Firm-bowedmeans possessing a bow of the maximum size\"(daḷhadhanu uttamappamāṇena dhanunā samannāgato).archer—one trained, skillful, and experienced[n.725]Dhanuggaho sikkhito katahattho katūpāsano.Mpexplainsdhanuggahoas a teacher of archery,sikkhitoas one who has trained in archery for twelve years,katahatthoas one skillful enough to split the tip of a hair even at the distance of anusabha, andkatūpasānoas one experienced in shooting arrows who has exhibited his craft. See tooAN9.38, n. 1935; also see CDB 393, note 181, and CDB 819, note 365.—across the shadow of a palmyra tree. My stride was such that it could reach from the eastern ocean to the western ocean. Then, while I possessed such speed and such a stride, the wish arose in me: ‘I will reach the end of the world by traveling.’ Having a life span of a hundred years, living for a hundred years, I traveled for a hundred years without pausing except to eat, drink, chew, and taste, to defecate and urinate, and to dispel fatigue with sleep; yet I died along the way without having reached the end of the world.",
    "an4.45:5": "\"It is astounding and amazing, Bhante, how well this was stated by the Blessed One: ‘I say, friend, that by traveling one cannot know, see, or reach that end of the world where one is not born, does not grow old and die, does not pass away and get reborn.’\"",
    "an4.45:6": "\"I say, friend, that by traveling one cannot know, see, or reach that end of the world where one is not born, does not grow old and die, does not pass away and get reborn. Yet I say that without having reached the end of the world there is no making an end of suffering. It is in this fathom-long body endowed with perception and mind that I proclaim (1) the world, (2) the origin of the world, (3) the cessation of the world, and (4) the way leading to the cessation of the world.\"",
    "an4.45:7": "The end of the world can never be reachedby means of travelingacross the world;yet without reaching the world's endthere is no release from suffering.",
    "an4.45:8": "Hence the wise one, the world-knower,who has reached the world's end and lived the spiritual life,having known the world's end, at peace,does not desire this world or another."
}