{
    "an4.21:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an4.21:2": "\"Bhikkhus, on one occasion I was dwelling at Uruvelā, by the goatherds’ banyan tree on the bank of the Neranjarā River, just after I had attained full enlightenment. Then, while I was alone in seclusion, a course of thought arose in my mind thus: ‘It is painful to dwell without reverence and deference. Now what ascetic or brahmin can I honor, respect, and dwell in dependence on?’",
    "an4.21:3": "\"Then it occurred to me: (1) ‘If my aggregate of virtuous behavior were incomplete, for the sake of completing it I would honor, respect, and dwell in dependence on another ascetic or brahmin. However, in this world with its devas, Māra, and Brahmā, among this population with its ascetics and brahmins, its devas and humans, I do not see another ascetic or brahmin more accomplished in virtuous behavior than myself whom I could honor, respect, and dwell in dependence on.",
    "an4.21:4": "(2) \"‘If my aggregate of concentration were incomplete, for the sake of completing it I would honor, respect, and dwell in dependence on another ascetic or brahmin. However … I do not see another ascetic or brahmin more accomplished in concentration than myself ….",
    "an4.21:5": "(3) \"‘If my aggregate of wisdom were incomplete, for the sake of completing it I would honor, respect, and dwell in dependence on another ascetic or brahmin. However … I do not see another ascetic or brahmin more accomplished in wisdom than myself ….",
    "an4.21:6": "(4) \"‘If my aggregate of liberation were incomplete, for the sake of completing it I would honor, respect, and dwell in dependence on another ascetic or brahmin. However, in this world with its devas, Māra, and Brahmā, among this population with its ascetics and brahmins, its devas and humans, I do not see another ascetic or brahmin more accomplished in liberation than myself whom I could honor, respect, and dwell in dependence on.",
    "an4.21:7": "\"It occurred to me: ‘Let me then honor, respect, and dwell in dependence only on this Dhamma to which I have become fully enlightened.’",
    "an4.21:8": "\"Then Brahmā Sahampati,having known with his own mind the reflection in my mind, disappeared from the brahmā world and reappeared before me just as a strong man might extend his drawn-in arm or draw in his extended arm. He arranged his upper robe over one shoulder, bent down with his right knee on the ground, reverently saluted me, and said: ‘So it is, Blessed One! So it is, Fortunate One! Bhante, those who were the Arahants, the Perfectly Enlightened Ones in the past—those Blessed Ones, too, honored, respected, and dwelled in dependence only on the Dhamma. Those who will be the Arahants, the Perfectly Enlightened Ones in the future—those Blessed Ones, too, will honor, respect, and dwell in dependence only on the Dhamma. Let the Blessed One, too, who is at present the Arahant, the Perfectly Enlightened One, honor, respect, and dwell in dependence only on the Dhamma.’",
    "an4.21:9": "\"‘The perfect Buddhas of the past,the Buddhas of the future,and the present Buddhawho removes the sorrow of many:",
    "an4.21:10": "all those dwelled, now dwell,andin the futurewill dwellrevering the good Dhamma.This is the nature of the Buddhas.",
    "an4.21:11": "\"‘Therefore one desiring the good,[n.650]Cereadsatthakāmena; Be and Ee haveattakāmena, \"desiring self.\" In pāda d, the plural of Buddha is in the Pāli,buddhānasāsanaṁ. Possibly the compound is a corruption ofbuddhānusāsanaṁ, \"the Buddha’s instruction,\" which would preserve a singular.aspiring for greatness,should revere the good Dhamma,recollecting the Buddhas’ teaching.’",
    "an4.21:12": "\"This was what Brahmā Sahampati said. He then paid homage to me, and keeping me on his right, he disappeared right there. Then, having acknowledged Brahmā's request and what was proper for myself, I honored, respected, and dwelled in dependence only on the Dhamma to which I had become fully enlightened. And now that the Saṅgha has acquired greatness, I have respect for the Saṅgha, too.\""
}