{
    "an4.38:1": "\"Bhikkhus, a bhikkhu who has dispelled personal truths, totally renounced seeking, and tranquilized bodily activity is said to have drawn back.[n.703]Patilīno.Mpglosses with \"hidden, gone into solitude\"(nilīno ekībhāvaṁ upagato).",
    "an4.38:2": "() \"And how has a bhikkhu totally renounced seeking? Here, a bhikkhu has abandoned the search for sensual pleasures and the search for existence and has allayed the search for a spiritual life.[n.706]Mp:\"The search for a spiritual life(brahmacariyesanā)consists in the aspiration that occurs thus, ‘I will seek out, search for, a spiritual life.’ This subsides and is tranquilized by the path of arahantship. But the search for a spiritual life in the form of views(diṭṭhibrahmacariyesanā)subsides with the path of stream-entry.\"It is in this way that a bhikkhu has totally renounced seeking.",
    "an4.38:3": "() \"And how has a bhikkhu tranquilized bodily activity? Here, with the abandoning of pleasure and pain, and with the previous passing away of joy and dejection, a bhikkhu enters and dwells in the fourth jhāna, neither painful nor pleasant, which has purification of mindfulness by equanimity. It is in this way that a bhikkhu has tranquilized bodily activity.[n.707] Bodily activity(kāyasaṅkhāra)is elsewhere identified with in-andout breathing, which ceases in the fourth jhāna. See9:1§4. Also seeMN 44.22; I 01,19–21; SN41:6, IV 29,16–17.",
    "an4.38:4": "() \"And how has a bhikkhu drawn back? Here, a bhikkhu has abandoned the conceit ‘I am,’ cut it off at the root, made it like a palm stump, obliterated it so that it is no longer subject to future arising. It is in this way that a bhikkhu has drawn back.",
    "an4.38:5": "Seeking for sense pleasures,seeking for existence,seeking for a spiritual life;the tight grasp \"Such is the truth,\"viewpointsthat areswellings:[n.708]Mp:\"The tight grasp ‘Such is the truth’(iti saccaparāmāso)is the grasping of such conceptions as ‘Such is the truth, such is the truth.’Viewpoints(diṭṭhiṭṭhānā)are simply views, called ‘swellings’(samussayā)because of their swelling up(samussitattā), because they rise up and persist.\"",
    "an4.38:6": "for one entirely detached from lust,liberated by the destruction of craving,such seeking has been relinquished,and viewpoints are uprooted.",
    "an4.38:7": "That peaceful, mindful bhikkhu,tranquil, undefeated, enlightenedby breaking through conceit,is called \"one who has drawn back.\""
}