{
    "an4.49:1": "\"Bhikkhus, there are these four inversions of perception, inversions of mind, and inversions of view.[n.729]Saññāvipallāso,cittavipallāso,diṭṭhivipallāso.Vipallāsais fromvi+pari+āsa, \"turned upside down.\" These are treated in terms of abandonment and non-abandonment at Paṭis II 80–8.What four? () The inversion of perception, mind, and view that takes the impermanent to be permanent; (2) the inversion of perception, mind, and view that takes what is suffering to be pleasurable;[n.730] I read with Ce and Bedukkhe bhikkhave sukhan ti saññāvipallāso, as against Eeadukkhe bhikkhave dukkhan ti saññāvipallāso.(3) the inversion of perception, mind, and view that takes what is non-self to be self; (4) the inversion of perception, mind, and view that takes what is unattractive to be attractive. These are the four inversions of perception, mind, and view.",
    "an4.49:2": "\"There are, bhikkhus, these four non-inversions of perception, non-inversions of mind, and non-inversions of view. What four? (1) The non-inversion of perception, mind, and view that takes the impermanent to be impermanent; () the non-inversion of perception, mind, and view that takes what is suffering to be suffering; (3) the non-inversion of perception, mind, and view that takes what is non-self to be non-self; (4) the non-inversion of perception, mind, and view that takes what is unattractive to be unattractive. These are the four non-inversions of perception, mind, and view.\"",
    "an4.49:3": "Perceiving permanence in the impermanent,perceiving pleasure in what is suffering,perceiving a self in what is non-self,and perceiving attractiveness in what is unattractive,beings resort to wrong views,[n.71] I read withCeand Eemicchādiṭṭhigatā, as against Bemicchādiṭṭhihatā. But I follow the verse divisions of Be rather than of Ce.their minds deranged, their perception twisted.",
    "an4.49:4": "Such people are bound by the yoke of Māra,and do not reach security from bondage.Beings continue in saṁsāra,going to birth and death.",
    "an4.49:5": "But when the Buddhas arise in the world,sending forth a brilliant light,they reveal this Dhamma that leadsto the stilling of suffering.",
    "an4.49:6": "Having heard it, wise peoplehave regained their sanity.They have seen the impermanent as impermanentand what is suffering as suffering.",
    "an4.49:7": "They have seen what is non-selfas non-self and the unattractive as unattractive.By the acquisition of right view,they have overcome all suffering."
}