{
    "an4.200:1": "\"Bhikkhus, there are these four things that are born. What four? Affection is born from affection; hatred is born from affection; affection is born from hatred; and hatred is born from hatred.",
    "an4.200:2": "(1) \"And how, bhikkhus, is affection born from affection? Here, one person is desirable, lovable, and agreeable to another. Others treat that person in a way that is desirable, lovable, and agreeable. It occurs to the latter: ‘Others treat that person who is desirable, lovable, and agreeable to me in a way that is desirable, lovable, and agreeable.’ He thus feels affection for them. It is in this way that affection is born from affection.",
    "an4.200:3": "(2) \"And how is hatred born from affection? Here, one person is desirable, lovable, and agreeable to another. Others treat that person in a way that is undesirable, unlovable, and disagreeable. It occurs to the latter: ‘Others treat that person who is desirable, lovable, and agreeable to me in a way that is undesirable, unlovable, and disagreeable.’ He thus feels hatred for them. It is in this way that hatred is born from affection.",
    "an4.200:4": "(3) \"And how is affection born from hatred? Here, one person is undesirable, unlovable, and disagreeable to another. Others treat that person in a way that is undesirable, unlovable, and disagreeable. It occurs to the latter: ‘Others treat that person who is undesirable, unlovable, and disagreeable to me in a way that is undesirable, unlovable, and disagreeable.’ He thus feels affection for them. It is in this way that affection is born from hatred.",
    "an4.200:5": "(4) \"And how is hatred born from hatred? Here, one person is undesirable, unlovable,and disagreeable to another. Others treat that person in a way that is desirable, lovable, and agreeable. It occurs to the latter: ‘Others treat that person who is undesirable, unlovable, and disagreeable to me in a way that is desirable, lovable, and agreeable.’ He thus feels hatred for them. It is in this way that hatred is born from hatred.",
    "an4.200:6": "\"When, secluded from sensual pleasures … a bhikkhu enters and dwells in the first jhāna, on that occasion affection born from affection does not exist in him, hatred born from affection does not exist in him, affection born from hatred does not exist in him, and hatred born from hatred does not exist in him.",
    "an4.200:7": "\"When, with the subsiding of thought and examination, a bhikkhu enters and dwells in the second jhāna … the third jhāna … the fourth jhāna, on that occasion affection born from affection does not exist in him, hatred born from affection does not exist in him, affection born from hatred does not exist in him, and hatred born from hatred does not exist in him.",
    "an4.200:8": "\"When, with the destruction of the taints, a bhikkhu has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it, then he has abandoned affection born from affection, cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising; he has abandoned hatred born from affection, cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising; he has abandoned affection born from hatred, cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising; and he has abandoned hatred born from hatred, cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising.",
    "an4.200:9": "\"And how does a bhikkhu pick up?[n.37]DOPdefines the verbussenetias \"forms an association (with), is involved,\" butMpglosses it withukkhipati, which DOP says can mean \"throws up; raises; lifts up, picks up, holds up; raises up, extols.\" What follows are the twenty modes of personal-existence view(sakkāyadiṭṭhi), the view of a real self existing in relation to the five aggregates. There are four modes in relation to each of the five aggregates.Here, a bhikkhu regards form as self, or self as possessing form, or form as in self, or self as in form. He regards feeling as self …… perception as self … volitional activities as self … consciousness as self, or self as possessing consciousness, or consciousness as in self, or self as in consciousness. It is in this way that a bhikkhu picks up.",
    "an4.200:10": "\"And how does a bhikkhu not pick up? Here, a bhikkhu does not regard form as self, or self as possessing form, or form as in self, or self as in form. He does not regard feeling as self … perception as self … volitional activities as self … consciousness as self, or self as possessing consciousness, or consciousness as in self, or self as in consciousness. It is in this way that a bhikkhu does not pick up.",
    "an4.200:11": "\"And how does a bhikkhu push away? Here, a bhikkhu insults one who insults him, scolds one who scolds him, and argues with one who picks an argument with him. It is in this way that a bhikkhu pushes away.",
    "an4.200:12": "\"And how does a bhikkhu not push away? Here, a bhikkhu does not insult one who insults him, does not scold one who scolds him, and does not argue with one who picks an argument with him. It is in this way that a bhikkhu does not push away.",
    "an4.200:13": "\"And how does a bhikkhu fume? When there isthe notion‘I am,’ there arethe notions‘I am thus,’ ‘I am just so,’ ‘I am otherwise,’ ‘I am lasting,’ ‘I am evanescent,’ ‘I may be,’ ‘I may be thus,’ ‘I may be just so,’ ‘I may be otherwise,’ ‘May I be,’ ‘May I be thus,’ ‘May I be just so,’ ‘May I be otherwise,’ ‘I shall be,’ ‘I shall be thus,’ ‘I shall be just so,’ ‘I shall be otherwise.’ It is in this way that a bhikkhu fumes.",
    "an4.200:14": "\"And how does a bhikkhu not fume? When there is nonotion‘I am,’ there are nonotions‘I am thus’ …… ‘I shall be otherwise.’ It is in this way that a bhikkhu does not fume.",
    "an4.200:15": "\"And how does a bhikkhu blaze? When there isthe notion, ‘I am because of this,’ there arethe notions: ‘I am thus because of this,’ ‘I am just so because of this,’ ‘I am otherwise because of this,’ ‘I am lasting because of this,’ ‘I am evanescent because of this,’ ‘I may be because of this,’ ‘I may be thus because of this,’ ‘I may be just so because of this,’ ‘I may be otherwise because of this,’ ‘May I be because of this,’ ‘May I be thus because of this,’ ‘May I be just so because of this,’ ‘May I be otherwise because of this,’ ‘I shall be because of this,’ ‘I shall be thus because of this,’ ‘I shall be just so because of this,’ ‘I shall be otherwise because of this.’ It is in this way that a bhikkhu blazes.",
    "an4.200:16": "\"And how does a bhikkhu not blaze? When there is nonotion, ‘I am because of this,’ there are nonotions: ‘I am thus because of this’ … ‘I shall be otherwise because of this.’ It is in this way that a bhikkhu does not blaze.",
    "an4.200:17": "\"And how does a bhikkhu ruminate?[n.938] There are different readings here:Ceapajjhāyate, Besampajjhāyati, Eepajjhāyati. Ee is missing this paragraph but includes the following paragraph; presumably, this was an editorial oversight rather than a difference in the manuscripts.Here, a bhikkhu has not abandoned the conceit ‘I am,’ cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising. It is in this way that a bhikkhu ruminates.",
    "an4.200:18": "\"And how does a bhikkhu not ruminate? Here, a bhikkhu has abandoned the conceit ‘I am,’ cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising. It is in this way that a bhikkhu does not ruminate.\""
}