{
    "an4.8:1": "\"Bhikkhus, there are these four kinds of self-confidence that the Tathāgata has, possessing which he claims the place of the chief bull,roars his lion's roar in the assemblies, and sets in motion the brahma wheel.[n.633]Mpglossesbrahmahere as \"best, supreme, pure\"(seṭṭhaṁ uttamaṁ visuddhaṁ)and identifiesbrahmacakkawithdhammacakka, the wheel of the Dhamma.What four?",
    "an4.8:2": "() \"I do not see any ground on the basis of which an ascetic or brahmin or deva or Māra or Brahmā or anyone in the world might reasonably reprove me, saying: ‘Though you claim to be one whose taints are destroyed, you have not fully destroyed these taints.’ Since I do not see any such ground, I dwell secure, fearless, and self-confident.",
    "an4.8:3": "() \"I do not see any ground on the basis of which an ascetic or brahmin or deva or Māra or Brahmā or anyone in the world might reasonably reprove me, saying: ‘These things that you have said to be obstructive are not able to obstruct one who engages in them.’ Since I do not see any such ground, I dwell secure, fearless, and self-confident.",
    "an4.8:4": "() \"I do not see any ground on the basis of which an ascetic or brahmin or deva or Māra or Brahmā or anyone in the world might reasonably reprove me, saying: ‘The Dhamma does not lead one who practices it to the complete destruction of suffering, the goal for the sake of which you teach it.’[n.63] SeeAN3.6andAN3.6, n. 51.Since I do not see any such ground, I dwell secure, fearless, and self-confident.",
    "an4.8:5": "These pathways of doctrine,formulated in diverse ways,relied upon by ascetics and brahmins,do not reach the Tathāgata,the self-confident one who has passedbeyond the pathways of doctrine.[n.63] Vanarata writes with regard to pāda c: \"I think thatpatvāis a mistaken adaptation from an original early Pālipattā, which can be both absolutive and past participle. When Pāli was reshaped, the wrong alternative was chosen.Pattā, being past participle, should have been left unchanged\"personal communication. I read pāda d withBevisāradaṁ vādapathātivattaṁ, a reading shared with older Sinhala manuscripts. Ce hasvisāradaṁ vādapathātivattīnaṁ, which is also plausible, but Eevisāradaṁ vādapathāti vuttaṁis certainly mistaken.",
    "an4.8:6": "Consummate, having overcomeeverything,he set in motion the wheel of Dhammaout of compassion for all beings.Beings pay homage to such a one,the best among devas and humans,who has gone beyond existence."
}