{
    "an4.171:1": "\"Bhikkhus, when there is the body, then because of bodily volitionpleasure and pain arise internally; when there is speech, then because of verbal volition pleasure and pain arise internally; when there is the mind, then because of mental volition pleasure and pain arise internally—with ignorance itself as condition.[n.864]Mpexplains this with reference to the Abhidhamma scheme ofcittas, types of consciousness; see CMA 32–40, 46–64. I summarize Mp's explanation: Bodily volition is of twenty kinds by way of the eight kinds of sense-sphere wholesomecittasand twelve kinds of unwholesomecittas. So too for verbal volition. But mental volition includes these as well as the nine kinds of sublime(mahaggata)volition, namely, volition associated with the five jhānas of the Abhidhamma system and the four formless attainments. Because of bodily volition, there arises pleasure conditioned by the eight kinds of wholesome kamma, and pain conditioned by the twelve kinds of unwholesome kamma, that is, the kamma generated in the corresponding active types of consciousness. So too for the other two doors. Ignorance is a condition(avijjāpaccayā va)because, there being ignorance, volition occurs in the three doors as a condition for pleasure and pain. Thus this sutta statement refers to ignorance as the root cause. Pleasure and pain arise \"internally\"(ajjhattaṁ)when they arise in oneself. The word seems to underscore the retributive aspect of kamma.",
    "an4.171:2": "\"Either on one's own, bhikkhus, one performs that bodily volitional activity conditioned by which pleasure and pain arise in one internally, or others make one generate that bodily volitional activity conditioned by which pleasure and pain arise in one internally. Either with clear comprehension one performs that bodily volitional activity conditioned by which pleasure and pain arise in one internally, or without clear comprehension one performs that bodily volitional activity conditioned by which pleasure and pain arise in one internally.[n.865]Mp:\"One acts on one's own(sāmaṁ)when one initiates the action without instigation from others. One instigates activity because of others when others encourage or command one to act. One acts with clear comprehension(sampajāno)when one knows the wholesome and unwholesome as such, and their respective results as such. If one does not understand this, one acts without clear comprehension.\"",
    "an4.171:3": "\"Either on one's own, bhikkhus, one performs that verbal volitional activity conditioned by which pleasure and pain arise in one internally, or others make one perform that verbal volitional activity conditioned by which pleasure and pain arise in one internally. Either with clear comprehension one performs that verbal volitional activity conditioned by which pleasure and pain arise in one internally, or without clear comprehension one performs that verbal volitional activity conditioned by which pleasure and pain arise in one internally.",
    "an4.171:4": "\"Either on one's own, bhikkhus, one performs that mental volitional activity conditioned by which pleasure and pain arise in one internally, or others make one perform that mental volitional activity conditioned by which pleasure and pain arise in one internally. Either with clear comprehension one performs that mental volitional activity conditioned by which pleasure and pain arise in one internally, or without clear comprehension one performs that mental volitional activity conditioned by which pleasure and pain arise in one internally.",
    "an4.171:5": "\"Ignorance is comprised within these states.[n.866]Imesu bhikkhave dhammesu avijjā anupatitā.Mp:\"Ignorance is comprised in the volitional states analyzed above, functioning both as a coexistent condition and as a decisive-support condition(sahajātavasena ca upanissayavasena ca). Thus the round of existence and its root, ignorance, are shown.\"But with the remainderless fading away and cessation of ignorance that body does not exist conditioned by which that pleasure and pain arise in one internally; that speech does not exist conditioned by which that pleasure and pain arise in one internally; that mind does not exist conditioned by which that pleasure and pain arise in one internally.[n.867]Mp:\"Arahants are seen acting with the body. They sweep the courtyard of the shrine and the bodhi tree, go out and return, do various duties, etc., but in their case the twenty volitions occurring at the bodily door no longer produce kammic results(avipākadhammataṁ āpajjanti). Here, it is the volition that occurs at the body door that is intended by the word ‘body.’ The same method applies to the other two.\" Mp-ṭ: \"When arahants perform actions, how is it that they create no bodily or other kinds of kamma? In the sense that these deeds do not bear results, for an action done by an arahant is neither wholesome nor unwholesome but a mere activity(kiriyamatta)that does not yield results.\"That field does not exist, that sitedoes not exist, that base does not exist, that location does not exist conditioned by which that pleasure and pain arise in one internally.[n.868]Mp:\"‘Field,’ etc., are names for wholesome and unwholesome kamma. For that is afield(khetta)in the sense of a place where results grow; asite(vatthu)in the sense of their foundation; abase(āyatana)in the sense of a cause; alocation(adhikaraṇa)in the sense of a locale.\"",
    "an4.171:6": "\"Bhikkhus, there are these four acquisitions of individuality.[n.89] InEethis sentence marks the beginning of a new sutta, and thus at this point Ee's numbering exceeds mine by one. Both Ce and Be, in accord with Mp, treat the previous passage and this one as a single sutta. While this paragraph certainly looks like the beginning of an independent sutta, and perhaps originally was, Mp takes it to be continuous with the analysis of volition stated above. It says that up to this point the Buddha has shown the kamma accumulated in the three doors; now he shows the places where that kamma ripens. \"Acquisition of individuality\"(attabhāvappaṭilābha)is an individual existence, the combination of body and mind that constitutes a particular life.What four? (1) There is an acquisition of individuality in which one's own volition operates, not the volition of others. (2) There is an acquisition of individuality in which the volition of others operates, not one's own volition. (3) There is an acquisition of individuality in which both one's own volition and the volition of others operate. (4) And there is an acquisition of individuality in which neither one's own volition nor the volition of others operates. These are the four acquisitions of individuality.\"",
    "an4.171:7": "When this was said, the Venerable Sāriputta said to the Blessed One: \"Bhante, I understand in detail the meaning of this statement that the Blessed One has spoken in brief to be as follows. (1) In that acquisition of individuality in which one's own volition operates but not the volition of others, it is by reason of their own volition that beings pass away from that group.[n.80]Mpidentifies these beings as the devas corrupted by play(khiḍḍāpadosikā devā). While they are enjoying celestial delights in their heavenly realm, they sometimes forget to eat and drink, and because they miss a meal they wither away like a garland placed in the sun. See Bodhi 200: 159–60.(2) In that acquisition of individuality in which the volition of others operates but not one's own volition, it is by reason of the volition of others that beings pass away from that group.[n.81]Mpsays these are the devas corrupted by mind(manopadosika devā), who dwell in the realm of the four great kings. When they become angry at one another, their mutual anger becomes the cause for both to pass away. See Bodhi 200: 160–61.(3) In that acquisition of individuality in which both one's own volition and the volition of others operate, it is by reason of both one's own volition and the volition of others that beings pass away from that group.[n.82]Mpsays that these are human beings. For people kill themselves and others kill them. Thus they perish either on account of their own volition or because of the volition of others.(4) But, Bhante, what kind of devas should be understood as the acquisition of individuality in which neither one's own volition nor the volition of others operates?\"[n.83]Mp:\"Question:Why does Sāriputta pose this question? Isn’t he able to answer it himself? (Reply:) He is able, but he does not speak because he thinks, ‘This question is in the domain of a Buddha.’\"",
    "an4.171:8": "\"Why is it, Bhante, that some beings who pass away from that group are returners, who come back to this state of being, whileothers are non-returners, who do not come back to this state of being?\"[n.74]Mp:\"The former, whocome back to this state of being(āgantāro itthattaṁ), are those who return to the five aggregates in the sense sphere; they are not reborn there (in the realm where they pass away) or in a higher realm. Those whodo not come back to this state of being(anāgantāro itthattaṁ)do not return to the five aggregates or take a lower rebirth. They are either reborn there (in the realm where they pass away) or in a higher realm, or they attain final nibbāna right there. When it is said that they are reborn in a higher realm, this is said in the case of those who had been born in a lower existence. But from the realm of neither-perceptionnor-non-perception, there is no rebirth into a higher realm.\"",
    "an4.171:9": "\"But some (other) person here has abandoned the lower fetters. In this very life he enters and dwells in the base of neither-perception-nor-non-perception. He relishes it, desires it, and finds satisfaction in it. If he is firm in it, focused on it, often dwells in it, and has not lost it when he dies, he is reborn in companionship with the devas in the base of neither-perception-nor-non-perception. When he passes away from there he is a non-returner who does not come back to this state of being.",
    "an4.171:10": "\"This, Sāriputta, is the reason some beings here who pass away from that group are returners, who come back to this state of being, while others are non-returners, who do not come back to this state of being.\""
}