{
    "an4.3:2": "\"Bhikkhus, possessing four qualities, the wise, competent, good person preserves himself unmaimed and uninjured; he is blameless and beyond reproach by the wise; and he generates much merit. What four.",
    "an4.3:3": "He who praises one deserving blame,or blames one deserving praise,casts with his mouth an unlucky throwby which he finds no happiness.[n.624]Vicināti mukhena so kaliṁ, kalinā tena sukhaṁ na vindati. This could also have been rendered: \"The fool collects a disaster with his mouth.\"Kalimeans both disaster and the losing throw at dice.",
    "an4.3:4": "Slight is the unlucky throw at dicethat results in the loss of one's wealth,the lossof all, oneself included;much worse is this unlucky throwof harboring hate against the fortunate ones.[n.625]Mp:\"This disaster is trifling, that is, the loss of wealth at dice along with all that one owns, including oneself.\" Mp glossessugatesu, \"holy ones,\" assammaggatesu puggalesu, \"persons who have rightly attained,\" thus referring to all arahants, not only to the Buddha.",
    "an4.3:5": "For a hundred thousand and thirty-sixnirabbudas, plus fiveabbudas,the slanderer of noble ones goes to hell,having defamed them with evil speech and mind.[n.626]Sataṁ sahassānaṁ nirabbudānaṁ/chattiṁsatī pañca ca abbudāni. I translate followingMp,which says of the numbers: \"A hundred thousandnirabbudas, plus thirty-six morenirabbudas, plus fiveabbudas\"(sataṁ sahassānanti nirabbudagaṇanāya satasahassaṁ;chattiṁsatīti aparāni ca chattiṁsati nirabbudāni;pañca cāti abbudagaṇanāya ca pañca abbudāni). Vanarata, however, holds thatpañcacannot directly qualifyabbudānaṁand therefore he would conjoinsahassānaṁwithchattiṁsatīandpañcaas well, making thirty-six thousand additionalnirabbudasand five thousandabbudas.Mp,commenting onAN10.89, explains the Buddhist numbering scheme as follows: onekoṭi= ten million; akoṭiofkoṭis= onepakoṭi; akoṭiofpakoṭis= onekoṭipakoṭi; akoṭiofkoṭipakoṭis= onenahuta; akoṭiofnahutas= oneninnahuta; akoṭiofninnahutas= oneabbuda; twentyabbudas= onenirabbuda."
}