{
    "an4.51:1": "\"Bhikkhus, there are these four streams of merit, streams of the wholesome, nutriments of happiness—heavenly, ripening in happiness, conducive to heaven—that lead to what is wished for, desired, and agreeable, to one's welfare and happiness. What four?[n.735] Here, the four streams of merit are explained in terms of the four requisites: robes, almsfood, lodging, and medicines.Mpapparently misses the correct derivation ofsovaggika, deriving it fromsuṭṭhu aggānaṁ rūpādīnaṁ dāyakā. The word is properly derived fromsagga(Sktsvarga), heaven. ButMpto AN4.6 gives the correct derivation; seeAN4.6, n. 746.",
    "an4.51:2": "() When a bhikkhu enters and dwells in a measureless concentration of mind while using almsfoodthat one has given him, one acquires a measureless stream of merit, stream of the wholesome, a nutriment of happiness … that leads … to one's welfare and happiness.",
    "an4.51:3": "() When a bhikkhu enters and dwells in a measureless concentration of mind while using a lodgingthat one has given him, one acquires a measureless stream of merit, stream of the wholesome, a nutriment of happiness … that leads … to one's welfare and happiness.",
    "an4.51:4": "() When a bhikkhu enters and dwells in a measureless concentration of mind while using medicines and provisions for the sickthat one has given him, one acquires a measureless stream of merit, stream of the wholesome, a nutriment of happiness … that leads to one's welfare and happiness.",
    "an4.51:5": "\"When, bhikkhus, a noble disciple possesses these four streams of merit, streams of the wholesome, it is not easy to measure his merit thus: ‘Just so much is his stream of merit, stream of the wholesome, nutriment of happiness … that leads to … one's welfare and happiness’; rather, it is reckoned simply as an incalculable, immeasurable, great mass of merit.",
    "an4.51:6": "\"Bhikkhus, just as it is not easy to measure the water in the great ocean thus: ‘There are so many gallons of water,’ or ‘There are so many hundreds of gallons of water,’ or ‘There are so many thousands of gallons of water,’ or ‘There are so many hundreds of thousands of gallons of water,’ but rather it is reckoned simply as an incalculable, immeasurable, great mass of water; so too, when a noble disciple possesses these four streams of merit … it is reckoned simply as an incalculable, immeasurable, great mass of merit.\"",
    "an4.51:7": "Just as the many rivers used by the hosts of people,flowing downstream, reach the ocean,the great mass of water, the boundless sea,the fearsome receptacle of heaps of gems;",
    "an4.51:8": "so the streams of merit reach the wise manwho is a giver of food, drink, and cloth;they reachthe donor of beds, seats, and coverslike rivers carrying their waters to the sea."
}