{
    "an4.194:1": "On one occasion the Venerable Ānanda was dwelling among the Koliyans near the Koliyan town named Sāpūga. Then a number of young Koliyans from Sāpūga approached the Venerable Ānanda, paid homage to him, and sat down to one side. The Venerable Ānanda then said to them:",
    "an4.194:2": "\"Byagghapajjas, there are these four factors of striving for purity[n.913]Pārisuddhipadhāniyaṅgāni. I translate the compound in accordance with Mp's resolution:pārisuddhi-atthāya padhāniyaṅgāni.that the Blessed One, the Arahant, the Perfectly Enlightened One, knowing and seeing,has rightly expounded for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna. What four? The factor of striving for purity of virtuous behavior, the factor of striving for purity of mind, the factor of striving for purity of view, and the factor of striving for purity of liberation.[n.914]Sīlapārisuddhipadhāniyaṅga,cittapārisuddhipadhāniyaṅga,diṭṭhipārisuddhipadhāniyaṅga,vimuttipārisuddhipadhāniyaṅga.Sīlavisuddhi,cittavisuddhi, anddiṭṭhivisuddhiare included among the seven purifications(satta visuddhi)inMN 4, which is used as the scaffolding for Vism. The four are included among the ninepārisuddhipadhāniyaṅgāniinDN 34.178, III 88,16–5, where they are all conjoined with the wordvisuddhi, for instance,sīlavisuddhipārisuddhipadhāniyaṅgaṁ. It is intriguing that no suttas on the seven purifications are included in the Sevens. This suggests a late origin for the scheme, as well as a late origin forMN 4.",
    "an4.194:3": "(1) \"And what, Byagghapajjas, is the factor of striving for purity of virtuous behavior? Here, a bhikkhu is virtuous …as at 4:181… he trains in them. This is called purity of virtuous behavior. The desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehensionapplied with the intention: ‘In just such a way I will fulfill purity of virtuous behavior that I have not yet fulfilled or assist with wisdom in various respects purity of virtuous behavior that I have fulfilled’[n.915]Tattha tattha paññāya anuggahessāmi.Mp:\"In this and that respect I will assist it with the wisdom of insight(vipassanāpaññāya).\"—this is called the factor of striving for purity of virtuous behavior.",
    "an4.194:4": "(2) \"And what, Byagghapajjas, is the factor of striving for purity of mind? Here, secluded from sensual pleasures … a bhikkhu enters and dwells in the fourth jhāna. This is called purity of mind. The desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehensionapplied with the intention: ‘In just such a way I will fulfill purity of mind that I have not yet fulfilled or assist with wisdom in various respects purity of mind that I have fulfilled’—this is called the factor of striving for purity of mind.",
    "an4.194:5": "(3) \"And what, Byagghapajjas, is the factor of striving for purity of view? Here, a bhikkhu understands as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ This is called purity of view.[n.916] Since, in the Nikāyas, direct understanding of the four noble truths typically marks the attainment of stream-entry, purification of view here can be identified with the wisdom of the stream-enterer. This stands in contrast with the scheme of Vism, in which purification of view(diṭṭhivisuddhi)is the third of the seven purifications. Vism explains it as the clear understanding of mental and material phenomena(nāmarūpavavatthāna), also known as the delimitation of conditioned phenomena(saṅkhāraparicccheda). In the Vism scheme, the attainment of stream-entry (and each subsequent path) occurs only with the seventh purification, purification of knowledge and vision(ñāṇadassanavisuddhi).The desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension (applied with the intention): ‘In just such a way I will fulfill purity of view that I have not yet fulfilled or assist with wisdom in various respects purity of view that I have fulfilled’—this is called the factor of striving for purity of view.",
    "an4.194:6": "(4) \"And what, Byagghapajjas, is the factor of striving for purity of liberation? That same noble disciple, possessing this factor of striving for purity of virtuous behavior,this factor of striving for purity of mind, and this factor of striving for purity of view, detaches his mind from the things that cause attachment and emancipates his mind through the things that bring emancipation. He thereby reaches right liberation. This is called purity of liberation.[n.917] A separate purification of this name does not occur in the Vism scheme, but perhaps it could be considered the culmination of purification of knowledge and vision.The desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehensionapplied with the intention: ‘In just such a way I will fulfill purity of liberation that I have not yet fulfilled or assist with wisdom in various respects purity of liberation that I have fulfilled’—this is called the factor of striving for purity of liberation.",
    "an4.194:7": "\"These, Byagghapajjas, are the four factors of striving for purity that the Blessed One, the Arahant, the Perfectly Enlightened One, knowing and seeing, has rightly expounded for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna.\""
}