{
    "an4.30:1": "On one occasion the Blessed One was dwelling at Rājagaha on Mount Vulture Peak. Now on that occasion a number of very well-known wanderers were residing at the wanderers’ park on the bank of the river Sappinī, namely, Annabhāra, Varadhara, Sakuludāyī the wanderer, and other very well-known wanderers.",
    "an4.30:2": "\"Wanderers, there are these four Dhamma factors that are primal,of long standing, traditional, ancient, unadulterated and never before adulterated, which are not being adulterated and will not be adulterated, which are not repudiated by wise ascetics and brahmins. What four?",
    "an4.30:3": "(1) \"If, wanderers, anyone should say: ‘I will reject this Dhamma factor of non-longing and point out arealascetic or brahmin who is full of longing, deeply passionate about sensual pleasures,’ I would respond to him thus: ‘Let him come, speak, and converse. Let me see how mighty he is!’ Indeed, it would be impossible for him to reject non-longing as a Dhamma factor and to point out arealascetic or brahmin who is full of longing, deeply passionate about sensual pleasures.",
    "an4.30:4": "(2) \"If anyone should say: ‘I will reject this Dhamma factor of good will and point out arealascetic or brahmin who has a mind of ill will and intentions of hate,’ I would respond to him thus: ‘Let him come, speak, and converse. Let me see how mighty he is!’ Indeed, it would be impossible for him to reject good will as a Dhamma factor and to point out arealascetic or brahmin who has a mind of ill will and intentions of hate.",
    "an4.30:5": "(3) \"If anyone should say: ‘I will reject this Dhamma factor of right mindfulness and point out arealascetic or brahmin who is muddled in mind and lacks clear comprehension,’ I would respond to him thus: ‘Let him come, speak, and converse. Let me see how mighty he is!’ Indeed, it would be impossible for him to reject right mindfulness as a Dhamma factor and to point out arealascetic or brahmin who is muddled in mind and lacks clear comprehension.",
    "an4.30:6": "(4) \"If anyone should say: ‘I will reject this Dhamma factor of right concentration and point out arealascetic or brahmin who is unconcentrated, with a wandering mind,’ I would respond to him thus: ‘Let him come, speak,and converse. Let me see how mighty he is!’ Indeed, it would be impossible for him to reject right concentration as a Dhamma factor and to point out arealascetic or brahmin who is unconcentrated, with a wandering mind.",
    "an4.30:7": "\"If, wanderers, anyone thinks these four Dhamma factors should be censured and repudiated, then, in this very life, he incurs four reasonable criticisms and grounds for censure.[n.684] SeeAN3.5, n. 416.What four?",
    "an4.30:8": "\"If, wanderers, anyone thinks these four Dhamma factors should be censured and repudiated, then, in this very life, he incurs these four reasonable criticisms and grounds for censure. Even those wanderers Vassa and Bhañña of Ukkalā, who were proponents of non-causality, inactivity, and nihilism, did not think that these four Dhamma factors should be censured and repudiated. For what reason? From fear of blame, attack, and refutation.\"[n.65] These two wanderers are also mentioned atMN 117.16, III 7,13, and SN22:62, III 73,3. We do not have more information about them than what is said here.",
    "an4.30:9": "One of good will, ever mindful,inwardly well concentrated,training to remove longing,is said to be heedful."
}