{
    "an4.53:1": "On one occasion the Blessed One was traveling along the highway between Madhurā and Verañjā. A number of male and female householders were also traveling along the same highway. Then the Blessed One left the highway and sat down at the foot of a tree. The male and female householders saw the Blessed One sitting there and approached him, paid homage to him, and sat down to one side. The Blessed One then said to them:",
    "an4.53:2": "\"Householders, there are these four ways of living together. What four? A wretch lives together with a wretch;[n.739]Chava, lit. a corpse.Mp:\"Such a person is called a corpse because he or she is dead through the death of their virtuous qualities.\"a wretch lives together with a female deva; a deva lives together with a wretch; a deva lives together with a female deva.",
    "an4.53:3": "(1) \"And how, householders, does a wretch live together with a wretch?Here, the husband is one who destroys life, takes what is not given, engages in sexual misconduct, speaks falsely, and indulges in liquor, wine, and intoxicants, the basis for heedlessness; he is immoral, of bad character; he dwells at home with a heart obsessed by the stain of miserliness; he insults and reviles ascetics and brahmins. And his wife is also one who destroys life … she insults and reviles ascetics and brahmins. It is in such a way that a wretch lives together with a wretch.",
    "an4.53:4": "(2) \"And how does a wretch live together with a female deva? Here, the husband is one who destroys life … he insults and reviles ascetics and brahmins. But his wife is one who abstains from the destruction of life, from taking what is not given, from sexual misconduct, from false speech, and from liquor, wine, and intoxicants, the basis for heedlessness; she is virtuous, of good character; she dwells at home with a heart free from the stain of miserliness; she does not insult or revile ascetics and brahmins. It is in such a way that a wretch lives together with a female deva.",
    "an4.53:5": "(3) \"And how does a deva live together with a wretch? Here, the husband is one who abstains from the destruction of life … he does not insult or revile ascetics and brahmins. But his wife is one who destroys life … she insults and reviles ascetics and brahmins. It is in such a way that a deva lives together with a wretch.",
    "an4.53:6": "(4) \"And how does a deva live together with a female deva? Here, the husband is one who abstains from the destruction of life … he does not insult or revile ascetics and brahmins. And his wife is also one who abstains from the destruction of life … she does not insult or revile ascetics and brahmins. It is in such a way that a deva lives together with a female deva.",
    "an4.53:7": "When both are immoral,miserly and abusive,husband and wifelive together as wretches.",
    "an4.53:8": "The husband is immoral,miserly and abusive,but his wife is virtuous,charitable, generous.She is a female deva livingwith a wretched husband.",
    "an4.53:9": "The husband is virtuous,charitable, generous,but his wife is immoral,miserly and abusive.She is a wretch livingwith a deva husband.",
    "an4.53:10": "Both husband and wife are endowed with faith,charitable and self-controlled,living their lives righteously,addressing each other with pleasant words.",
    "an4.53:11": "Then many benefits accrue to themand they dwell at ease.Their enemies are saddenedwhen both are the same in virtue.",
    "an4.53:12": "Having practiced the Dhamma here,the same in virtuous behavior and observances,delightingafter deathin a deva world,they rejoice, enjoying sensual pleasures."
}