{
    "an4.2:1": "At Sāvatthī. \"Bhikkhus, one who does not possess four things is said to have fallen from this Dhamma and discipline. What four? () One who does not possess noble virtuous behavior is said to have fallen from this Dhamma and discipline. (2) One who does not possess noble concentration … (3) One who does not possess noble wisdom … (4) One who does not possess noble liberation is said to have fallen from this Dhamma and discipline. One who does not possess these four things is said to have fallen from this Dhamma and discipline.",
    "an4.2:2": "\"But, bhikkhus, one who possesses four things is said to be secure[n.6]Appatito. Lit., \"not fallen,\" butMpglosses it more positively withpatiṭṭho, meaning \"established, settled,\" and says it refers to the stream-enterer and other noble ones; the arahant is \"entirely settled\"(khīṇāsavo ekantapatiṭṭho).in this Dhamma and discipline. What four? (1) One who possesses noble virtuous behavior is said to be secure in this Dhamma and discipline. () One who possesses noble concentration … (3) One who possesses noble wisdom … (4) One who possesses noble liberation is said to be secure in this Dhamma and discipline. One who possesses these four things is said to be secure in this Dhamma and discipline.\"",
    "an4.2:3": "Collapsed and fallen, they fall away;the greedy ones come back again.Done is the task, the delightful is delighted in;happiness is reached by happiness.[n.62] The verse is also atTh 6.Th-aI 155: \"Done is the task(kataṁ kiccaṁ): The sixteenfold task has been done (that is, each of the four noble paths performs the four tasks of fully understanding suffering, abandoning its origin, realizing its cessation, and developing the path) and there is nothing more to be done.The delightful is delighted in(rataṁ rammaṁ): The delightful nibbāna, free from all that is conditioned, is delighted in by the noble ones.Happiness is reached by happiness(sukhenanvāgataṁ sukhaṁ): The ultimate happiness, nibbāna, is reached by the happiness of fruition attainment; or the happiness of fruition and of nibbāna is arrived at by the happiness of insight and the path through a pleasant mode of practice (on this, seeAN4.162).\""
}