{
    "an4.110:1": "\"Bhikkhus, there are these four kinds of vipers. What four? The one whose venom is quick to come up but not virulent; the one whose venom is virulent but not quick to come up; the one whose venom is both quick to come up and virulent; and the one whose venom is neither quick to come up nor virulent. These are the four kinds of vipers.So too, there are these four kinds of persons similar to vipers found existing in the world. What four? The one whose venom is quick to come up but not virulent; the one whose venom is virulent but not quick to come up; the one whose venom is both quick to come up and virulent; and the one whose venom is neither quick to come up nor virulent.",
    "an4.110:2": "(1) \"And how, bhikkhus, is a person one whose venom is quick to come up but not virulent? Here, someone often becomes angry, but his anger does not linger for a long time. It is in this way that a person is one whose venom is quick to come up but not virulent. So, I say, this person is just like a viper whose venom is quick to come up but not virulent.",
    "an4.110:3": "(2) \"And how is a person one whose venom is virulent but not quick to come up? Here, someone does not often become angry, but his anger lingers for a long time. It is in this way that a person is one whose venom is virulent but not quick to come up. So, I say, this person is just like a viper whose venom is virulent but not quick to come up.",
    "an4.110:4": "(3) \"And how is a person one whose venom is both quick to come up and virulent? Here, someone often becomes angry, and his anger lingers for a long time. It is in this way that a person is one whose venom is both quick to come up and virulent. So, I say, this person is just like a viper whose venom is both quick to come up and virulent.",
    "an4.110:5": "(4) \"And how is a person one whose venom is neither quick to come up nor virulent? Here, someone does not often become angry, and his anger does not linger for a long time. It is in this way that a person is one whose venom is neither quick to come up nor virulent. So, I say, this person is just like a viper whose venom is neither quick to come up nor virulent."
}