{
    "an4.172:1": "There the Venerable Sāriputta addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an4.172:2": "(1) \"A half-month, friends, after my full ordination I realized the analytical knowledge of meaning by way of its divisions and formulation.[n.875]Odhiso vyañjanaso.Mpglosses these two words respectively withkāraṇaso akkharaso, \"by way of reasonsor cases, by way of the letter.\" The meaning is not entirely clear to me and Mp-ṭ does not elaborate. Thepaṭisambhidāsare explained at Vism 440–43, Ppn 14.1–31, on the basis of Vibh 9–94Be §§718–4, which analyzes them from several angles. Briefly: Knowledge of meaning is analytical knowledge of meaning(atthapaṭisambhidā); knowledge of Dhamma is analytical knowledge of Dhamma(dhammapaṭisambhidā); knowledge of how to express and articulate the Dhamma is analytical knowledge of language(niruttipaṭisambhidā); and knowledge about knowledges is analytical knowledge of discernment(paṭibhānapaṭisambhidā). This last analytical knowledge seems to refer to the ability to spontaneously apply the other three types of knowledge to clearly communicate the Dhamma. From a more philosophical perspective,atthais considered the result of a cause(hetuphala)anddhammaa cause(hetu)producing an effect. Therefore the analytical knowledge of meaning is correlated with knowledge of the first and third noble truths, analytical knowledge of Dhamma with knowledge of the second and fourth noble truths. Analytical knowledge of meaning is knowledge of each factor of dependent origination in its role as an effect arisen from a condition, and analytical knowledge of Dhamma is knowledge of the same factor in its role as a condition giving rise to an effect.In many ways I explain it, teach it, proclaim it, establish it, disclose it, analyze it, and elucidate it.[n.876]Ee'spakāsemi, as the third verb, is not in Ce or Be.Pakāsetiis also absent in the same sequence of verbs atAN3.136, I 86,9–10, also in Ee.Letanyone who is perplexed or uncertainapproachme with a question; Iwill satisfy himwith my answer.[n.877] The text is cryptic here and may have become garbled in the course of transmission.Mpsupplies a verb to the first part of the sentence,upagacchatu, which I include and translate in brackets.Mpfills outahaṁ veyyākaraṇenawithahamassa pañhakathanena cittaṁ ārādhessāmi\"I will satisfy his mind by answering the question\". I have also added this in brackets.Our teacher, who is highly skilled in our teachings, is present.[n.878]Mp:\"‘Our teacher, who is highly skilled in these things that have been attained by us, is present. If I had not realized the analytical knowledge of meaning, he would dismiss me, telling me to first realize it.’ Even while sitting in front of the teacher, he roars a lion's roar.\"",
    "an4.172:3": "(2) \"A half-month after my full ordination I realized the analytical knowledge of the Dhamma by way of its divisions and formulation. In many ways I explain it, teach it, proclaim it, establish it, disclose it, analyze it, and elucidate it.Letanyone who is perplexed or uncertainapproachme with a question; Iwill satisfy himwith my answer. Our teacher, who is highly skilled in our teachings, is present.",
    "an4.172:4": "(3) \"A half-month after my full ordination I realized the analytical knowledge of language by way of its divisions and formulation. In many ways I explain it, teach it, proclaim it, establish it, disclose it, analyze it, and elucidate it.Letanyone who is perplexed or uncertainapproachme with a question; Iwill satisfy himwith my answer. Our teacher, who is highly skilled in our teachings, is present.",
    "an4.172:5": "(4) \"A half-month after my full ordination I realized the analytical knowledge of discernment by way of its divisions and formulation. In many ways I explain it, teach it, proclaim it, establish it, disclose it, analyze it, and elucidate it.Letanyone who is perplexed or uncertainapproachme with a question; Iwill satisfy himwith my answer. Our teacher, who is highly skilled in our teachings, is present.\""
}