{
    "an4.70:1": "\"Bhikkhus, when kings are unrighteous,[n.763]Adhammikā honti.Mp:\"Without performing the tenfold oblation prescribed by the ancient kings, and without assigning punishment in proportion to the crime, they perform excessive oblations and assign excessive punishments.\" The tenfold oblation(dasabhāgabali)is mentioned only here.the royal vassals become unrighteous. When the royal vassals are unrighteous, brahmins and householders become unrighteous.[n.764] In support of my translation ofbrāhmaṇagahapatikāas advandacompound rather than as akammadhāraya, \"brahmin householders,\" see It-a II 62,7–9:Brāhmaṇagahapatikā ti brāhmaṇā c’eva gahapatikā ca. Ṭhapetvā brāhmaṇe ye keci agāraṁ ajjhāvasantā idha gahapatikā ti veditabbā.When brahmins and householders are unrighteous, the people of the towns and countryside become unrighteous. When the people of the towns and countryside are unrighteous, the sun and moonproceed off course. When the sun and moon proceed off course, the constellations and the stars proceed off course. When the constellations and the stars proceed off course, day and night proceed off course … the months and fortnights proceed off course … the seasons and years proceed off course. When the seasons and years proceed off course, the winds blow off course and at random. When the winds blow off course and at random, the deities become upset. When the deities are upset, sufficient rain does not fall. When sufficient rain does not fall, the crops ripen irregularly. When people eat crops that ripen irregularly, they become short-lived, ugly, weak, and sickly.[n.765] The omission ofdubbalāin theVRIedition appears to be an error. The other editions, including the Be printed version, have this word.",
    "an4.70:2": "\"Bhikkhus, when kings are righteous, the royal vassals become righteous. When the royal vassals are righteous, brahmins and householders become righteous. When brahmins and householders are righteous, the people of the towns and countryside become righteous. When the people of the towns and countryside are righteous, the sun and moon proceed on course. When the sun and moon proceed on course, the constellations and the stars proceed on course. When the constellations and the stars proceed on course, day and night proceed on course … the months and fortnights proceed on course … the seasons and years proceed on course. When the seasons and years proceed on course, the winds blow on course and dependably. When the winds blow on course and dependably, the deities do not become upset. When the deities are not upset, sufficient rain falls. When sufficient rain falls, the crops ripen in season. When people eat crops that ripen in season, they become long-lived, beautiful, strong, and healthy.\"",
    "an4.70:3": "When cattle are crossinga ford,if the chief bull goes crookedly,all the others go crookedlybecause their leader has gone crookedly.",
    "an4.70:4": "So too, among human beings,when the one considered the chiefbehaves unrighteously,other people do so as well.The entire kingdom is dejectedif the king is unrighteous.",
    "an4.70:5": "When cattle are crossinga fordif the chief bull goes straight across,all the others go straight acrossbecause their leader has gone straight.",
    "an4.70:6": "So too, among human beings,when the one considered the chiefconducts himself righteously,other people do so as well.The entire kingdom rejoicesif the king is righteous."
}