{
    "an4.233:1": "\"Bhikkhus, there are these four kinds of kamma proclaimed by me after I realized them for myself with direct knowledge. What four? There is dark kamma with dark result; there is bright kamma with bright result; there isdark-and-bright kamma with dark-and-bright result; and there is kamma that is neither dark nor bright with neither-dark-nor-bright result, kamma that leads to the destruction of kamma.",
    "an4.233:2": "(1) \"And what, bhikkhus, is dark kamma with dark result? Here, someone performs an afflictive bodily volitional activity, an afflictive verbal volitional activity, an afflictive mental volitional activity.Here an \"afflictive bodily volitional activity\"(sabyāpajjhaṁ kāyasaṅkhāraṁ)can be understood as the volition responsible for the three courses of unwholesome bodily kamma, an \"afflictive verbal volitional activity\" as the volition responsible for the four courses of unwholesome verbal kamma, and an \"afflictive mental volitional activity\" as the volition responsible for the three courses of unwholesome mental kamma.As a consequence, he is reborn in an afflictive world. When he is reborn in such a world, afflictive contacts touch him. Being touched by afflictive contacts, he feels afflictive feelings, exclusively painful, as in the case of hell beings. This is called dark kamma with dark result.",
    "an4.233:3": "(2) \"And what is bright kamma with bright result? Here, someone performs a non-afflictive bodily volitional activity, a non-afflictive verbal volitional activity, a non-afflictive mental volitional activity.The ten courses of wholesome kamma along with the volition of the jhānas.As a consequence he is reborn in a non-afflictive world.The higher deva worlds.When he is reborn in such a world, non-afflictive contacts touch him. Being touched by non-afflictive contacts, he feels non-afflictive feelings, exclusively pleasant, as in the case of the devas of refulgent glory.Devā subhakiṇhā. These are the devas dwelling in the highest divine realm corresponding to the third jhāna.This is called bright kamma with bright result.",
    "an4.233:4": "(3) \"And what is dark-and-bright kamma with dark-and-bright result? Here, someone performs a bodily volitional activity that is both afflictive and non-afflictive, a verbal volitional activity that is both afflictive and non-afflictive, a mental volitional activity that is both afflictive and non-afflictive. As a consequence he is reborn in a world that is both afflictive and non-afflictive. When he is reborn in such a world,contacts that are both afflictive and non-afflictive touch him. Being touched by contacts that are both afflictive and non-afflictive, he feels feelings that are both afflictive and non-afflictive, mingled pleasure and pain, as in the case of human beings and some devas and some beings in the lower worlds. This is called dark-and-bright kamma with dark-and-bright result.",
    "an4.233:5": "(4) \"And what is kamma that is neither dark nor bright with neither-dark-nor-bright result, kamma that leads to the destruction of kamma? The volition for abandoning the kind of kamma that is dark with dark result, the volition for abandoning the kind of kamma that is bright with bright result, and the volition for abandoning the kind of kamma that is dark and bright with dark-and-bright result: this is called kamma that is neither dark nor bright with neither-dark-nor-bright result, kamma that leads to the destruction of kamma.Mp:\"The volition of the path leading to the end of the round\"(vivaṭṭagāminī maggacetanā)."
}