{
    "an4.5:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four? The person who goes along with the stream; the one who goes against the stream; the one who is inwardly firm; and the one who has crossed over and gone beyond, the brahmin who stands on high ground.[n.628] In Pāli:anusotagāmī puggalo,paṭisotagāmī puggalo, ṭhitatto puggalo,tiṇṇo pāraṅgato thale tiṭṭhati brāhmaṇo.",
    "an4.5:2": "() \"And what is the person who goes against the stream? Here, someone does not indulge in sensual pleasures or perform bad deeds. Even with pain and dejection, weeping with a tearful face, he lives the complete and purified spiritual life. This is called the person who goes against the stream.",
    "an4.5:3": "() \"And what is the person who is inwardly firm? Here, with the utter destruction of the five lower fetters, some person is of spontaneous birth, due to attain final nibbāna there without ever returning from that world. This is called the person who is inwardly firm.",
    "an4.5:4": "() \"And what is the one who has crossed over and gone beyond, the brahmin who stands on high ground?Here, with the destruction of the taints, some person has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. This is called the person who has crossed over and gone beyond, the brahmin who stands on high ground.",
    "an4.5:5": "Those people who are uncontrolled in sense pleasures,not rid of lust, enjoying sense pleasures here,repeatedly coming back to[n.629] Reading withBeand Eeupagāmino, as against Ceupagāhino.birth and old age,immersed in craving, are \"the ones who go along with the stream.\"",
    "an4.5:6": "Therefore a wise person with mindfulness established,not resorting to sense pleasures and bad deeds,should give up sense pleasures even if it's painful:they call this person \"one who goes against the stream.\"",
    "an4.5:7": "One who has abandoned five defilements,a fulfilled trainee,[n.630]Paripuṇṇasekho.Mp:\"One firm in fulfillment of the training\"(sikkhāpāripūriyā ṭhito). A trainee(sekha)is one who has entered the irreversible path to liberation but has not yet attained arahantship. The arahant isasekha, \"one beyond training.\"unable to retrogress,attained to mind's mastery, his faculties composed:this person is called \"one inwardly firm.\"",
    "an4.5:8": "One who has comprehended things high and low,burnt them up, so they’re gone and exist no more:that sage who has lived the spiritual life,reached the world's end, is called\"one who has gone beyond.\""
}