{
    "an4.160:1": "\"Bhikkhus, while the Fortunate One or the Fortunate One's discipline remains in the world, this is for the welfare of many people, for the happiness of many people, out of compassion for the world, for the good, welfare, and happiness of devas and humans.",
    "an4.160:2": "\"And who, bhikkhus, is the Fortunate One? Here, the Tathāgata arises in the world, an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One. This is the Fortunate One.",
    "an4.160:3": "\"And what is the Fortunate One's discipline? He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; he reveals the perfectly complete and pure spiritual life. This is the Fortunate One's discipline. Thus while the Fortunate One or the Fortunate One's discipline remains in the world, this is for the welfare of many people, for the happiness of many people, out of compassion for the world, for the good, welfare, and happiness of devas and humans.",
    "an4.160:4": "\"There are, bhikkhus, these four things that lead to the decline and disappearance of the good Dhamma. What four?",
    "an4.160:5": "(2) \"Again, the bhikkhus are difficult to correct and possess qualities that make them difficult to correct. They are impatient and do not accept instruction respectfully. This is the second thing that leads to the decline and disappearance of the good Dhamma.",
    "an4.160:6": "(3) \"Again, those bhikkhus who are learned, heirs to the heritage, experts on the Dhamma, experts on the discipline, experts on the outlines, do not respectfully teach the discourses to others. When they have passed away, the discourses are cut off at the root, left without anyone to preserve them. This is the third thing that leads to the decline and disappearance of the good Dhamma.",
    "an4.160:7": "(4) \"Again, the elder bhikkhus are luxuriousand lax, leaders in backsliding, discarding the duty of solitude; they do not arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.Those inthe next generation follow their example. They, too, become luxurious and lax, leaders in backsliding, discarding the duty of solitude; they, too, do not arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. This is the fourth thing that leads to the decline and disappearance of the good Dhamma.",
    "an4.160:8": "\"There are, bhikkhus, these fourotherthings that lead to the continuation, non-decline, and non-disappearance of the good Dhamma. What four?",
    "an4.160:9": "(2) \"Again, the bhikkhus are easy to correct and possess qualities that make them easy to correct. They are patient and accept instruction respectfully. This is the second thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma.",
    "an4.160:10": "(3) \"Again, those bhikkhus who are learned, heirs to the heritage, experts on the Dhamma, experts on the discipline, experts on the outlines, respectfully teach the discourses to others. When they have passed away, the discourses are not cut off at the root for there are those who preserve them. This is the third thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma.",
    "an4.160:11": "(4) \"Again, the elder bhikkhus are not luxurious and lax, but they discard backsliding and take the lead in solitude; they arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.Those inthe next generation follow their example. They, too, do not become luxurious and lax, but they discard backsliding and take the lead in solitude; they, too, arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. This is the fourth thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma."
}