{
    "an4.245:1": "\"Bhikkhus, this spiritual life is lived with the training as its benefit, with wisdom as its supervisor, with liberation as its core, and with mindfulness as its authority.[n.955]Sikkhānisaṁsam idaṁ bhikkhave brahmacariyaṁ vussati paññuttaraṁ vimuttisāraṁ satādhipateyyaṁ. In later suttas that use these metaphors (AN8.83,AN9.4,AN0.58), mindfulness precedes wisdom and liberation, but the present sutta explains the reason for the inversion of the normal sequence.",
    "an4.245:2": "\"Again, the training fundamental to the spiritual life[n.957]Mp:\"This is a designation for the four major types of virtuous behavior, which are the foundation for the spiritual life of the path\"(maggabrahmacariyassa ādibhūtānaṁ catunnaṁ mahāsīlānam etaṁ adhivacanaṁ). ThoughMpseems to confine this type of virtue to the fourpārājikaoffenses, it certainly includes many more training rules included among the other classes of offenses.has been prescribed by me to my disciples for the utterly complete destruction of suffering. One takes up this training fundamental to the spiritual life in just the way that I have prescribed it to my disciples for the utterly complete destruction of suffering, keeping it unbroken, flawless, unblemished, and unblotched. Having undertaken them, one trains in the training rules. It is in this way that the training is its benefit.",
    "an4.245:3": "(2) \"And how is wisdom its supervisor? Here, the teachings have been taught by me to my disciples for the utterly complete destruction of suffering. One scrutinizes those teachings with wisdom in just the way that I have taught them to my disciples for the utterly complete destruction of suffering. It is in this way that wisdom is its supervisor.[n.958]Mpdoes not explain in what sensepaññāis calleduttarā, but says only: \"They are well seen by the wisdom of the path along with insight\"(sahavipassanāya maggapaññāya sudiṭṭhā honti).",
    "an4.245:4": "(3) \"And how is liberation its core? Here, the teachings have been taught by me to my disciples for the utterly complete destruction of suffering. Through liberation one experiences those teachings in just the way that I have taught them to my disciples for the utterly complete destruction of suffering. It is in this way that liberation is its core.[n.959]Mp:\"They are experienced by the experiential knowledge of the liberation of the fruit of arahantship\"(arahattaphalavimuttiyā ñāṇaphassena phuṭṭhā honti).",
    "an4.245:5": "(4) \"And how is mindfulness its authority? One's mindfulness is well established internally thus: ‘In just such a way I will fulfill the training pertaining to good conduct that I have not yet fulfilled or assist with wisdom in various respects the training pertaining to good conduct that I have fulfilled.’[n.960] As inAN4.194.Mpsays that insight wisdom(vipassanāpaññā)is intended here.And one's mindfulness is well established internally thus: ‘In just such a way I will fulfill the training pertaining to the fundamentals of the spiritual life that I have not yet fulfilled or assist with wisdom in various respects the training pertaining to the fundamentals of the spiritual life that I have fulfilled.’ And one's mindfulness is well established internally thus: ‘In just such a way I will scrutinize with wisdom the teachings that I have not yet scrutinized or assist with wisdom in various respects the teachings that I have scrutinized.’ And one's mindfulness is well established internally thus: ‘In just such a way I will experience through liberation the Dhamma that I have not yet experienced or assist with wisdom in various respects the Dhamma that I have experienced.’ It is in this way that mindfulness is its authority."
}