{
    "an4.100:1": "Then the wanderer Potaliya approached the Blessed One and exchanged greetings with him. When they had exchanged greetings and cordial talk, the wanderer Potaliya sat down to one side, and the Blessed One then said to him:",
    "an4.100:2": "\"Potaliya, there are these four kinds of persons found existing in the world. What four? (1) Here, some person speaks dispraise of someone who deserves dispraise, and the dispraise is accurate, truthful, and timely; but he does not speak praise of someone who deserves praise, though the praise would be accurate, truthful, and timely. () Some other person speaks praise of someone who deserves praise, and the praise is accurate, truthful, and timely; but he does not speak dispraise of someone who deserves dispraise, though the dispraise would be accurate, truthful, and timely. (3) Still another person does not speak dispraise of someone who deserves dispraise, though the dispraise would be accurate, truthful, and timely; and he does not speak praise of someone who deserves praise, though the praise would be accurate, truthful, and timely. (4) And still another person speaks dispraise of someone who deserves dispraise, and the dispraise is accurate, truthful, and timely; and he also speaks praise of someone who deserves praise, and the praise is accurate, truthful, and timely. These are the four kinds of persons found existing in the world. Now, Potaliya, which among these four kinds of persons seems to you the most excellent and sublime?\"",
    "an4.100:3": "\"There are, Master Gotama, those four kinds of persons found existing in the world.[n.790] He repeats all four types, as does the Buddha below. I have omitted the repetition.Of those four, the one that seems to me the most excellent and sublime is the one who does not speak dispraise of someone who deserves dispraise, though the dispraise would be accurate, truthful, and timely; and who does not speak praise of someone who deserves praise, though the praise would be accurate, truthful, and timely. For what reason? Because what excels, Master Gotama, is equanimity.\"",
    "an4.100:4": "\"There are, Potaliya, those four kinds of persons found existing in the world. Of those four, the one that is the most excellent and sublime is the one who speaks dispraise of someone who deserves dispraise, and the dispraise is accurate, truthful, and timely; and who also speaks praise of someone who deserves praise, and the praise is accurate, truthful, and timely. For what reason? Because what excels, Potaliya, is knowledge of the proper time to speak in any particular case.\"[n.791]Abhikkantā h’esā potaliya yadidaṁ tattha tattha kālaññutā.Mp:\"It is the nature of the wise, when they have known it is the proper time, to speak dispraise of one who deserves dispraise and to speak praise of one who deserves praise.\"",
    "an4.100:5": "\"There are, Master Gotama, those four kinds of persons found existing in the world. Of those four, the one that seems to me the most excellent and sublime is the one who speaks dispraise of someone who deserves dispraise, and the dispraise is accurate, truthful, and timely; and who also speaks praise of someone who deserves praise, and the praise is accurate, truthful, and timely. For what reason? Because what excels, Master Gotama, is knowledge of the proper time to speak in any particular case.",
    "an4.100:6": "\"Excellent, Master Gotama! Excellent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the darkness so those with good eyesight can see forms. I now go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. Let Master Gotama consider me a lay follower who from today has gone for refuge for life.\""
}