{
    "an4.235:1": "See Mn 57.7–, I 389–9.\"Bhikkhus, there are these four kinds of kamma proclaimed by me after I realized them for myself with direct knowledge. What four? There is dark kamma with dark result; there is bright kamma with bright result; there isdark-and-bright kamma with dark-and-bright result; and there is kamma that is neither dark nor bright with neither-dark-nor-bright result, kamma that leads to the destruction of kamma.",
    "an4.235:2": "() \"And what is bright kamma with bright result? Here, someone abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from liquor, wine, and intoxicants, the basis for heedlessness. This is called bright kamma with bright result.",
    "an4.235:3": "() \"And what is dark-and-bright kamma with dark-andbright result? Here, someone performs a bodily volitional activity that is both afflictive and non-afflictive, a verbal volitional activity that is both afflictive and non-afflictive, a mental volitional activity that is both afflictive and non-afflictive. As a consequence, he is reborn in a world that is both afflictive and non-afflictive. When he is reborn in such a world, contacts that are both afflictive and non-afflictive touch him. Being touched by contacts that are both afflictive and non-afflictive, he feels feelings that are both afflictive and non-afflictive, mingled pleasure and pain, as in the case of human beings and some devas and some beings in the lower worlds. This is called dark-andbright kamma with dark-and-bright result.",
    "an4.235:4": "() \"And what is kamma that is neither dark nor bright with neither-dark-nor-bright result, kamma that leads to the destruction of kamma? The volition for abandoning the kind of kamma that is dark with dark result, the volition for abandoning the kind of kamma that is bright with bright result, and the volition for abandoning the kind of kamma that is dark and bright with dark-and-bright result: this is called kamma that is neither dark nor bright with neither-dark-nor-bright result, kamma that leads to the destruction of kamma."
}