{
    "an4.187:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the squirrel sanctuary. Then the brahmin Vassakāra, the chief minister of Magadha, approached the Blessed One and exchanged greetings with him …. Then, sitting to one side, he said to the Blessed One:",
    "an4.187:3": "\"It is astounding and amazing, Master Gotama, howwell this has been stated by Master Gotama: ‘It is, brahmin, impossible and inconceivable that a bad person can know of a bad person …all as above… It is also possible that a good person can know of a bad person: \"This fellow is a bad person.\"’",
    "an4.187:4": "\"On one occasion, Master Gotama, the members of the brahmin Todeyya's assembly were carping against others,saying: ‘This King Eḷeyya is a fool, for he has complete confidence in the ascetic Rāmaputta and shows him supreme honor by paying homage to him, rising up for him, reverentially saluting him, and observing proper etiquette toward him.[n.901]Mpidentifies him as Uddaka Rāmaputta, one of the Buddha’s teachers before his enlightenment. SeeMN 26.2, I 165–66.These vassals of King Eḷeyya—Yamaka, Moggalla, Ugga, Nāvindakī, Gandhabba, and Aggivessa—are fools as well, for they, too, have complete confidence in the ascetic Rāmaputta and show him supreme honor by paying homage to him, rising up for him, reverentially saluting him, and observing proper etiquette toward him.’ Thereupon the brahmin Todeyya led them around by this method: ‘What do you think, sirs, in matters pertaining to tasks and administrative duties, to edicts and proclamations, isn’t King Eḷeyya wise and more astute even than those who are very astute?’",
    "an4.187:5": "\"‘But, sirs,’he said,‘it is because the ascetic Rāmaputta is wiser than the wise King Eḷeyya, more astute than this astutekingin matters pertaining to tasks and administrative duties, to edicts and proclamations, that King Eḷeyya has complete confidence in him and shows him supreme honor by paying homage to him, rising up for him, reverentially saluting him, and observing proper etiquette toward him.",
    "an4.187:6": "\"‘What do you think, sirs, in matters pertaining to tasks and administrative duties, to edicts and proclamations, are King Eḷeyya's vassals—Yamaka, Moggalla,Ugga, Nāvindakī, Gandhabba, Aggivessa—wise and more astute even than those who are very astute?’",
    "an4.187:7": "\"‘But, sirs, it is because the ascetic Rāmaputta is wiser than King Eḷeyya's vassals, more astute than those astutevassalsin matters pertaining to tasks and administrative duties, to edicts and proclamations, that King Eḷeyya's vassals have complete confidence in him and show him supreme honor by paying homage to him, rising up for him, reverentially saluting him, and observing proper etiquette toward him.’\"[n.902]Mpexplains the purport of this apparent digression thus: \"The brahmin, being a good person himself, praises King Eḷeyya, his retinue, and Uddaka Rāmaputta. For the bad person is like a blind man, and a good person like one with good sight. As a blind man does not see either one who is blind or one with sight, so a bad person does not know either a good person or a bad one. But just as one with good sight can see both a blind person and one with sight, so a good person can know both a good person and a bad one. The brahmin (Vassakāra), thinking: ‘Even Todeyya, being a good person, knew who were bad men,’ was delighted because of this and said: ‘It is astounding, Master Gotama!’\"",
    "an4.187:8": "\"It is astounding and amazing, Master Gotama, how well this has been stated by Master Gotama: ‘It is impossible and inconceivable that a bad person can know of a bad person: \"This fellow is a bad person.\" It is also impossible and inconceivable that a bad person can know of a good person: \"This fellow is a good person.\" It is possible that a good person can know of a good person: \"This fellow is a good person.\" It is also possible that a good person can know of a bad person: \"This fellow is a bad person.\"’ And now, Master Gotama, we must be going. We are busy and have much to do.\"",
    "an4.187:9": "Then the brahmin Vassakāra, the chief minister of Magadha, having delighted and rejoiced in the Blessed One's statement, rose from his seat and departed."
}