{
    "an4.199:1": "\"Bhikkhus, I will teach you about craving—the ensnarer, streaming, widespread, and sticky[n.932]Mp:\"Craving is calledthe ensnarer(jālinī)because it is like a net. For as a net is sewn tightly together and is thoroughly interwoven, so too is craving. Or it is called the ensnarer because it is a net spread out over the three realms of existence. It isstreaming(saritā)because it streams and runs on here and there. It iswidespread(visaṭā)because it is spread out and dispersed. And it issticky(visattikā)because it sticks, attaches, fastens here and there.\"—by which this world has been smothered and enveloped, and by which it has become a tangled skein, a knotted ball of thread, a mass of reeds and rushes,so that it does not pass beyond the plane of misery, the bad destination, the lower world, saṁsāra. Listen and attend closely; I will speak.\"",
    "an4.199:2": "\"And what, bhikkhus, is craving—the ensnarer, streaming, widespread, and sticky—by which this world has been smothered and enveloped, and by which it has become a tangled skein, a knotted ball of thread, a mass of reeds and rushes, so that it does not pass beyond the plane of misery, the bad destination, the lower world, saṁsāra?",
    "an4.199:3": "\"And what are the eighteen currents of craving related to the internal? When there isthe notion‘I am,’ there arethe notions‘I am thus,’ ‘I am just so,’ ‘I am otherwise,’ ‘I am lasting,’ ‘I am evanescent,’ ‘I may be,’ ‘I may be thus,’ ‘I may be just so,’ ‘I may be otherwise,’ ‘May I be,’ ‘May I be thus,’ ‘May I be just so,’ ‘May I be otherwise,’ ‘I shall be,’ ‘I shall be thus,’ ‘I shall be just so,’ ‘I shall be otherwise.’",
    "an4.199:4": "\"And what are the eighteen currents of craving related to the external?[n.93] \"Related to the external\"(bāhirassa upādāya)means related to external five aggregates.When there isthe notion, ‘I am because of this,’[n.935]Mpsays that \"because of this\"(iminā)should be understood to mean \"because of this form … because of this consciousness\"(iminā rūpena vā…pe…viññāṇena). The passage is opaque as it stands and I am not sure thatMphas caught the original intention. \"Because of this\" might have meant \"because of a creator God,\" or \"because of primordial matter\" or \"because of chance or necessity,\" etc.there arethe notions: ‘I am thus because of this,’ ‘I am just so because of this,’ ‘I am otherwise because of this,’ ‘I am lasting because of this,’ ‘I am evanescent because of this,’ ‘I may be because of this,’ ‘I may be thus because of this,’ ‘I may be just so because of this,’ ‘I may be otherwise because of this,’ ‘May I be because of this,’ ‘May I be thus because of this,’ ‘May I be just so because of this,’ ‘May I be otherwise because of this,’ ‘I shall be because of this,’ ‘I shall be thus because of this,’ ‘I shall be just so because of this,’ ‘I shall be otherwise because of this.’ These are the eighteen currents of craving related to the external.",
    "an4.199:5": "\"Thus there are eighteen currents of craving related to the internal, and eighteen currents of craving related to the external. These are called the thirty-six currents of craving. There are thirty-six such currents of craving pertaining to the past, thirty-six pertaining to the future,and thirty-six pertaining to the present. So there are one hundred and eight currents of craving.",
    "an4.199:6": "\"This, bhikkhus, is that craving—the ensnarer, streaming, widespread, and sticky—by which this world has been smothered and enveloped, and by which it has become a tangled skein, a knotted ball of thread, a mass of reeds and rushes, so that it does not pass beyond the plane of misery, the bad destination, the lower world, saṁsāra.\"[n.93] I am unsure how to explain the inclusion of this sutta in the Fours. The reason may be the four terms used to describe craving, enclosed between dashes, but this is a mere hypothesis."
}