{
    "an4.28:1": "\"Bhikkhus, there are these four noble lineages, primal, of long standing, traditional, ancient, unadulterated and never before adulterated, which are not being adulterated and will not be adulterated, which are not repudiated by wise ascetics and brahmins. What four?",
    "an4.28:2": "\"Again, a bhikkhu is content with any kind of almsfood, and he speaks in praise of contentment with any kind of almsfood, and he does not engage in a wrong search, in what is improper, for the sake of almsfood. If he does not get almsfood he is not agitated, and if he gets some he uses it without being tied to it, infatuated with it, and blindly absorbed in it, seeing the danger in it and understanding the escape from it.Yet he does not extol himself or disparage others because of this. Any bhikkhu who is skillful in this, diligent, clearly comprehending and ever mindful, is said to be standing in an ancient, primal noble lineage.",
    "an4.28:3": "\"Again, a bhikkhu is content with any kind of lodging, and he speaks in praise of contentment with any kind of lodging, and he does not engage in a wrong search, in what is improper, for the sake of lodging. If he does not get lodging he is not agitated, and if he gets it he uses it without being tied to it, infatuated with it, and blindly absorbed in it, seeing the danger in it and understanding the escape from it. Yet he does not extol himself or disparage others because of this. Any bhikkhu who is skillful in this, diligent, clearly comprehending and ever mindful, is said to be standing in an ancient, primal noble lineage.",
    "an4.28:4": "\"Again, a bhikkhu finds delight in development, is delighted with development, finds delight in abandoning, is delighted with abandoning.[n.680]Mp:\"Finds delight in development(bhāvanārāmo): He delights in developing the four establishments of mindfulness, the four right strivings, the four bases for psychic potency, the five faculties, the five powers, the seven enlightenment factors, the seven contemplations, the eighteen great insights, the thirty-seven aids to enlightenment, and the thirty-eight meditation objects.Finds delight in abandoning(pahānārāmo): He delights in abandoning the defilements of sensual desire and so forth.\"Yet he does not extol himself or disparage others because of this. Any bhikkhu who is skillful in this, diligent, clearly comprehending and ever mindful, is said to be standing in an ancient, primal noble lineage.",
    "an4.28:5": "\"Bhikkhus, when a bhikkhu possesses these four noble lineages, if he dwells in the east he vanquishes discontent, discontent does not vanquish him; if he dwells in the west he vanquishes discontent, discontent does not vanquish him; if he dwells in the north he vanquishes discontent, discontent does not vanquish him; if he dwells in the south he vanquishes discontent, discontent does not vanquish him. For what reason? Because he is a steadfast one who vanquishes discontent and delight.\"",
    "an4.28:6": "Discontent does not vanquish the steadfast one,[n.81] Reading withBeand Eedhīraṁ. Ce hasvīraṁin pādas a and b, butdhīroin pādas c and d.forthe steadfast one is not vanquished by discontent.[n.82]Mpsays that pāda b explains pāda a. Because discontent is unable to vanquish the steadfast one, cannot overcome him, therefore discontent does not vanquish the steadfast one.The steadfast one vanquishes discontent,for the steadfast one is a vanquisher of discontent.",
    "an4.28:7": "Who can obstruct the dispellerwho has discarded all kamma?Who is fit to blame one who is likea coin of refined gold?Even the devas praise such a one;by Brahmā too he is praised."
}