{
    "an4.85:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four? The one heading from darkness to darkness, the one heading from darkness to light, the one heading from light to darkness, and the one heading from light to light.",
    "an4.85:2": "(1) \"And how, bhikkhus, is a person heading from darkness to darkness? Here, some person has been reborn in a low family—a family of caṇḍālas, bamboo workers, hunters, cart makers, or flower scavengers[n.776] SeeAN3.13. I read withCeand Beveṇakule vā nesādakule, as against Eenesādakule vā veṇakule.—one that is poor, with little food and drink, that subsists with difficulty, where food and clothing are obtained with difficulty; and he is ugly, unsightly, dwarfish, with much illness—blind, crippled, lame, or paralyzed. He does not obtain food, drink, clothing, and vehicles; garlands, scents, and unguents; bedding, housing, and lighting. He engages in misconduct by body, speech, and mind. In consequence, with the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell. It is in this way that a person is heading from darkness to darkness.",
    "an4.85:3": "(2) \"And how is a person heading from darkness to light? Here, some person has been reborn in a low family … where food and clothing are obtained with difficulty; and he is ugly … or paralyzed. He does not obtain food … and lighting. He engages in good conduct by body, speech, and mind. In consequence, with the breakup of the body, after death, he is reborn in a good destination, in a heavenly world. It is in this way that a person is heading from darkness to light.",
    "an4.85:4": "(3) \"And how is a person heading from light to darkness?Here, some person has been reborn in a high family—an affluent khattiya family, an affluent brahmin family, or an affluent householder family—one that is rich, with great wealth and property, with abundant gold and silver, with abundant treasures and belongings, with abundant wealth and grain; and he is handsome, attractive, graceful, possessing supreme beauty of complexion. He obtains food, drink, clothing, and vehicles; garlands, scents, and unguents; bedding, housing, and lighting. He engages in misconduct by body, speech, and mind. In consequence, with the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell. It is in this way that a person is heading from light to darkness.",
    "an4.85:5": "(4) \"And how is a person heading from light to light? Here, some person has been reborn in a high family … with abundant wealth and grain; and he is handsome … possessing supreme beauty of complexion. He obtains food … and lighting. He engages in good conduct by body, speech, and mind. In consequence, with the breakup of the body, after death, he is reborn in a good destination, in a heavenly world. It is in this way that a person is heading from light to light."
}