{
    "an4.173:1": "Then the Venerable Mahākoṭṭhita approached the Venerable Sāriputta and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and asked the Venerable Sāriputta:",
    "an4.173:2": "(1) \"Friend, with the remainderless fading away and cessation of the six bases for contact, is there anything else?\"[n.879] The dialogue here seems to be concerned with the \"ontological status\" of the arahant who has attained the nibbāna element without residue remaining, that is, with the question whether the liberated person exists or does not exist after death.",
    "an4.173:3": "\"Do not say so, friend.\"",
    "an4.173:4": "(2) \"With the remainderless fading away and cessation of the six bases for contact, is there nothing else?\"",
    "an4.173:5": "\"Do not say so, friend.\"",
    "an4.173:6": "(3) \"With the remainderless fading away and cessation of the six bases for contact, is there both something else and nothing else?\"",
    "an4.173:7": "\"Do not say so, friend.\"",
    "an4.173:8": "(4) \"With the remainderless fading away and cessation of the six bases for contact, is there neither something else nor nothing else?\"",
    "an4.173:9": "\"Do not say so, friend.\"[n.880]Mpglossesmā h’evaṁwithevaṁ mā bhaṇi, \"Do not speak thus,\" and explains that the four questions are asked by way of eternalism, annihilationism, partial eternalism, and \"eel-wriggling\"(sassata-uccheda-ekaccasassata-amarāvikkhepa). Thus Sāriputta rejects each question. \"Eel-wriggling\" is agnosticism, skepticism, or intellectual evasiveness.",
    "an4.173:10": "\"Friend, when you are asked: ‘With the remainderless fading away and cessation of the six bases for contact, is there something else?’ you say: ‘Do not say so, friend.’ And when you are asked: ‘With the remainderless fading away and cessation of the six bases for contact, is there nothing else? … Is there both something else and nothing else? … Is there neither something else nor nothing else?’in each caseyou say: ‘Do not say so, friend.’ In what way should the meaning of this statement be understood?\"",
    "an4.173:11": "(1) \"Friend, if one says: ‘With the remainderless fading away and cessation of the six bases for contact, there is something else,’ one proliferates that which is not to be proliferated.[n.881]Appapañcaṁ papañceti.Mp:\"He creates proliferationor speculationsin relation to something that should not be proliferatedor speculated about. He travels along a path that one should not travel on.\" The Pāli wordpapañcasuggests mental fabrication, obsessive mental construction, and deluded conceptualization, which the commentaries say arise from craving, conceit, and wrong views(taṇhā,māna,diṭṭhi). It seems to me thatMpunderstandsappapañcaṁas a contraction ofappapañciyaṁ. A Chinese parallel, SĀ 249, says at T II 60a16–20: \"If onemakes any of these assertions about the six bases for contact, these are just empty words (). With the vanishing, fading away, cessation, and stilling of the six bases for contact, one relinquishes empty falsehood () and attains nibbāna.\"(2) If one says: ‘Friend, with the remainderless fading away and cessation of the six bases for contact, there is nothing else,’ one proliferates that which is not to be proliferated. (3) If one says: ‘Friend, with the remainderless fading away and cessation of the six bases for contact, there is both something else and nothing else,’ one proliferates that which is not to be proliferated. (4) If one says: ‘Friend, with the remainderless fading away and cessation of the six bases for contact, there is neither something else nor nothing else,’ one proliferates that which is not to be proliferated."
}