{
    "an4.99:1": "\"Bhikkhus, there are these four kinds of persons found existing in the world. What four? () One who is practicing for his own welfarebut not for the welfare of others; (2) one who is practicing for the welfare of others but not for his own welfare; (3) one who is practicing neither for his own welfare nor for the welfare of others; and (4) one who is practicing both for his own welfare and for the welfare of others.",
    "an4.99:2": "(1) \"And how, bhikkhus, is a person practicing for his own welfare but not for the welfare of others? Here, some person himself abstains from the destruction of life but does not encourage others to abstain from the destruction of life. He himself abstains from taking what is not given but does not encourage others to abstain from taking what is not given. He himself abstains from sexual misconduct but does not encourage others to abstain from sexual misconduct. He himself abstains from false speech but does not encourage others to abstain from false speech. He himself abstains from liquor, wine, and intoxicants, the basis for heedlessness, but does not encourage others to abstain from them. It is in this way that a person is practicing for his own welfare but not for the welfare of others.",
    "an4.99:3": "(2) \"And how is a person practicing for the welfare of others but not for his own welfare? Here, some person does not himself abstain from the destruction of life but he encourages others to abstain from the destruction of life …. He does not himself abstain from liquor, wine, and intoxicants, the basis for heedlessness, but he encourages others to abstain from them. It is in this way that a person is practicing for the welfare of others but not for his own welfare.",
    "an4.99:4": "(3) \"And how is a person practicing neither for his own welfare nor for the welfare of others? Here, some person does not himself abstain from the destruction of life and does not encourage others to abstain from the destruction of life …. He does not himself abstain from liquor, wine, and intoxicants, the basis for heedlessness, and does not encourage others to abstain from them. It is in this way that a person is practicing neither for his own welfare nor for the welfare of others.",
    "an4.99:5": "(4) \"And how is a person practicing both for his own welfare and for the welfare of others? Here, some person himself abstains from the destruction of life and encourages others to abstain from the destruction of life …. He himself abstains from liquor, wine, and intoxicants, the basis for heedlessness, and encourages others to abstain from them. It is in this way that he is practicing both for his own welfare and for the welfare of others."
}