{
    "an4.10:1": "\"Bhikkhus, there are these four bonds. What four? The bond of sensuality, the bond of existence, the bond of views, and the bond of ignorance.",
    "an4.10:2": "() \"And how is there the bond of existence? Here, someone does not understand as they really are the origin and the passing away, the gratification, the danger, and the escape in regard to states of existence.[n.637]Bhavānaṁ.Mpdistinguisheskāmayogaas lust connected with the five objects of sensual pleasure andbhavayogaas desire and lust for existence in the form and formless realms.When one does not understand these things as they really are, then lust for existence, delight in existence, affection for existence, infatuation with existence, thirst for existence, passion for existence, attachment to existence, and craving for existence lie deep within one in regard to states of existence. This is called the bond of existence. Such are the bond of sensuality and the bond of existence.",
    "an4.10:3": "() \"And how is there the bond of views? Here, someone does not understand as they really are the origin and the passing away, the gratification, the danger, and the escape in regard to views. When one does not understand these things as they really are,then lust for views, delight in views, affection for views, infatuation with views, thirst for views, passion for views, attachment to views, and craving for views lie deep within one in regard to views. This is called the bond of views. Such are the bond of sensuality, the bond of existence, and the bond of views.",
    "an4.10:4": "() \"And how is there the bond of ignorance? Here, someone does not understand as they really are the origin and the passing away, the gratification, the danger, and the escape in regard to the six bases for contact. When one does not understand these things as they really are, then, ignorance and unknowing lie deep within one in regard to the six bases for contact. This is called the bond of ignorance. Such are the bond of sensuality, the bond of existence, the bond of views, and the bond of ignorance.",
    "an4.10:5": "\"There are, bhikkhus, these four severances of bonds. What four? The severance of the bond of sensuality, the severance of the bond of existence, the severance of the bond of views, and the severance of the bond of ignorance.",
    "an4.10:6": "(2) \"And how is there the severance of the bond of existence? Here, someone understands as they really are the origin and the passing away, the gratification, the danger, and the escape in regard to states of existence. When one understands these things as they really are, then lust for existence, delight in existence, affection for existence, infatuation with existence, thirst for existence, passion for existence, attachment to existence, and craving for existence do not lie within one in regard to states of existence. This is called the severance of the bond of existence. Such are the severance of the bond of sensuality and the severance of the bond of existence.",
    "an4.10:8": "(4) \"And how is there the severance of the bond of ignorance? Here, someone understands as they really are the origin and the passing away, the gratification, the danger, and the escape in regard to the six bases for contact. When one understands these things as they really are, then ignorance and unknowing do not lie within one in regard to the six bases for contact.",
    "an4.10:9": "Fettered by the bond of sensualityand the bond of existence,fettered by the bond of views,preceded by ignorance,",
    "an4.10:10": "beings go on in saṁsāra,led on in birth and death.But having entirely understoodsense pleasures and the bond of existence,",
    "an4.10:11": "having uprooted the bond of viewsand dissolved ignorance,the sages have severed all bonds;they have gone beyond bondage.[n.638] Reading withCeand Beyogātigā munī, as against Eeyogātigāmino."
}