{
    "an5.139:1": "\"Bhikkhus, possessing five factors, a king's bull elephant is not worthy of a king, not an accessory of a king, and not reckoned as a factor of kingship. What five? It cannot patiently endure forms, cannot patiently endure sounds, cannot patiently endure odours, cannot patiently endure tastes, and cannot patiently endure tactile objects.",
    "an5.139:2": "(1) \"And how is it that a king's bull elephant cannot patiently endure forms? Here, when a king's bull elephant has gone to battle, on seeing the elephant troops, the cavalry, the charioteers, or the infantry, it sinks, founders, does not brace itself, and cannot enter the battle. It is in this way that a king's bull elephant cannot patiently endure forms.",
    "an5.139:3": "(2) \"And how is it that a king's bull elephant cannot patiently endure sounds? Here, when a king's bull elephant has gone to battle, on hearing the sounds of elephants, horses, chariots, or infantrymen, or the sounds of drums, kettledrums, conches, and tom-toms, it sinks, founders, does not brace itself, and cannot enter the battle. It is in this way that a king's bull elephant cannot patiently endure sounds.",
    "an5.139:4": "(3) \"And how is it that a king's bull elephant cannot patiently endure odours?Here, when a king's bull elephant has gone to battle, on smelling the odour of the urine and feces of the royal bull elephants that are of pedigree stock and accustomed to battle, it sinks, founders, does not brace itself, and cannot enter the battle. It is in this way that a king's bull elephant cannot patiently endure odours.",
    "an5.139:5": "(4) \"And how is it that a king's bull elephant cannot patiently endure tastes? Here, when a king's bull elephant has gone to battle, if it is deprived of one portion of grass and water, or two, three, four, or five portions, it sinks, founders, does not brace itself, and cannot enter the battle. It is in this way that a king's bull elephant cannot patiently endure tastes.",
    "an5.139:6": "(5) \"And how is it that a king's bull elephant cannot patiently endure tactile objects? Here, when a king's bull elephant has gone to battle, if it is pierced by one volley of arrows, or by two, three, four, or five volleys, it sinks, founders, does not brace itself, and cannot enter the battle. It is in this way that a king's bull elephant cannot patiently endure tactile objects.",
    "an5.139:7": "\"Possessing these five factors, a king's bull elephant is not worthy of a king, not an accessory of a king, and not reckoned as a factor of kingship.",
    "an5.139:8": "\"So too, bhikkhus, possessing five qualities,[n.1139] I preferEedhammehihere to Ce and Beaṅgehi. The concluding paragraph of this section, and the corresponding opening and closing paragraph on the accomplished bhikkhu, all havedhammehi.a bhikkhu is not worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What five? He cannot patiently endure forms, cannot patiently endure sounds, cannot patiently endure odours, cannot patiently endure tastes, and cannot patiently endure tactile objects.",
    "an5.139:9": "(1) \"And how is it that a bhikkhu cannot patiently endure forms? Here, when a bhikkhu sees a form with the eye, he becomes enamored of a tantalizing form and cannot concentrate his mind. It is in this way that a bhikkhu cannot patiently endure forms.",
    "an5.139:10": "(2) \"And how is it that a bhikkhu cannot patiently endure sounds?Here, when a bhikkhu hears a sound with the ear, he becomes enamored of a tantalizing sound and cannot concentrate his mind. It is in this way that a bhikkhu cannot patiently endure sounds.",
    "an5.139:11": "(3) \"And how is it that a bhikkhu cannot patiently endure odours? Here, when a bhikkhu smells an odour with the nose, he becomes enamored of a tantalizing odour and cannot concentrate his mind. It is in this way that a bhikkhu cannot patiently endure odours.",
    "an5.139:12": "(4) \"And how is it that a bhikkhu cannot patiently endure tastes? Here, when a bhikkhu experiences a taste with the tongue, he becomes enamored of a tantalizing taste and cannot concentrate his mind. It is in this way that a bhikkhu cannot patiently endure tastes.",
    "an5.139:13": "(5) \"And how is it that a bhikkhu cannot patiently endure tactile objects? Here, when a bhikkhu feels a tactile object with the body, he becomes enamored of a tantalizing tactile object and cannot concentrate his mind. It is in this way that a bhikkhu cannot patiently endure tactile objects.",
    "an5.139:14": "\"Possessing these five qualities, a bhikkhu is not worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.",
    "an5.139:15": "\"Bhikkhus, possessing five factors, a king's bull elephant is worthy of a king, an accessory of a king, and reckoned as a factor of kingship. What five? It patiently endures forms, patiently endures sounds, patiently endures odours, patiently endures tastes, and patiently endures tactile objects.",
    "an5.139:16": "(1) \"And how is it that a king's bull elephant patiently endures forms? Here, when a king's bull elephant has gone to battle, on seeing the elephant troops, the cavalry, the charioteers, or the infantry, it does not sink and founder, but braces itself and can enter the battle. It is in this way that a king's bull elephant patiently endures forms.",
    "an5.139:17": "(2) \"And how is it that a king's bull elephant patiently endures sounds?Here, when a king's bull elephant has gone to battle, on hearing the sounds of elephants, horses, chariots, or infantrymen, or the sounds of drums, kettledrums, conches, and tom-toms, it does not sink and founder but braces itself and can enter the battle. It is in this way that a king's bull elephant patiently endures sounds.",
    "an5.139:18": "(3) \"And how is it that a king's bull elephant patiently endures odours? Here, when a king's bull elephant has gone to battle, on smelling the odour of the urine and feces of royal bull elephants that are of pedigree stock and accustomed to battle, it does not sink and founder but braces itself and can enter the battle. It is in this way that a king's bull elephant patiently endures odours.",
    "an5.139:19": "(4) \"And how is it that a king's bull elephant patiently endures tastes? Here, when a king's bull elephant has gone to battle, though it is deprived of one portion of grass and water, or of two, three, four, or five portions, it does not sink and founder but braces itself and can enter the battle. It is in this way that a king's bull elephant patiently endures tastes.",
    "an5.139:20": "(5) \"And how is it that a king's bull elephant patiently endures tactile objects? Here, when a king's bull elephant has gone to battle, though it is pierced by one volley of arrows, or by two, three, four, or five volleys, it does not sink and founder but braces itself and can enter the battle. It is in this way that a king's bull elephant patiently endures tactile objects.",
    "an5.139:21": "\"Possessing these five factors, a king's bull elephant is worthy of a king, an accessory of a king, and reckoned as a factor of kingship.",
    "an5.139:22": "\"So too, bhikkhus, possessing five qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What five? He patiently endures forms, patiently endures sounds, patiently endures odours, patiently endures tastes, and patiently endurestactile objects.",
    "an5.139:23": "(1) \"And how is it that a bhikkhu patiently endures forms? Here, when a bhikkhu sees a form with the eye, he does not become enamored of a tantalizing form and can concentrate his mind. It is in this way that a bhikkhu patiently endures forms.",
    "an5.139:24": "(2) \"And how is it that a bhikkhu patiently endures sounds? Here, when a bhikkhu hears a sound with the ear, he does not become enamored of a tantalizing sound and can concentrate his mind. It is in this way that a bhikkhu patiently endures sounds.",
    "an5.139:25": "(3) \"And how is it that a bhikkhu patiently endures odours? Here, when a bhikkhu smells an odour with the nose, he does not become enamored of a tantalizing odour and can concentrate his mind. It is in this way that a bhikkhu patiently endures odours.",
    "an5.139:26": "(4) \"And how is it that a bhikkhu patiently endures tastes? Here, when a bhikkhu experiences a taste with the tongue, he does not become enamored of a tantalizing taste and can concentrate his mind. It is in this way that a bhikkhu patiently endures tastes.",
    "an5.139:27": "(5) \"And how is it that a bhikkhu patiently endures tactile objects? Here, when a bhikkhu feels a tactile object with the body, he does not become enamored of a tantalizing tactile object and can concentrate his mind. It is in this way that a bhikkhu patiently endures tactile objects.",
    "an5.139:28": "\"Possessing these five qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.\""
}