{
    "an5.14:1": "\"Bhikkhus, there are these five powers. What five? The power of faith, the power of energy, the power of mindfulness, the power of concentration, and the power of wisdom.",
    "an5.14:2": "(1) \"And what, bhikkhus, is the power of faith? Here, a noble disciple is endowed with faith. He places faith in the enlightenment of the Tathāgata thus: ‘The Blessed One is an arahant, perfectly enlightened … the Enlightened One, the Blessed One.’This is called the power of faith.",
    "an5.14:3": "(2) \"And what is the power of energy? Here, a noble disciple has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. This is called the power of energy.",
    "an5.14:4": "(3) \"And what is the power of mindfulness? Here, the noble disciple is mindful, possessing supreme mindfulness and alertness, one who remembers and recollects what was done and said long ago. This is called the power of mindfulness.",
    "an5.14:5": "(4) \"And what is the power of concentration? Here, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna, which consists of rapture and pleasure born of seclusion, accompanied by thought and examination. With the subsiding of thought and examination, he enters and dwells in the second jhāna, which has internal placidity and unification of mind and consists of rapture and pleasure born of concentration, without thought and examination. With the fading away as well of rapture, he dwells equanimous and, mindful and clearly comprehending, he experiences pleasure with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ With the abandoning of pleasure and pain, and with the previous passing away of joy and dejection, he enters and dwells in the fourth jhāna, neither painful nor pleasant, which has purification of mindfulness by equanimity. This is called the power of concentration.",
    "an5.14:6": "(5) \"And what is the power of wisdom? Here, a noble disciple is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering. This is called the power of wisdom."
}