{
    "an5.179:1": "Then the householder Anāthapiṇḍika, accompanied by five hundred lay followers, approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then addressed the Venerable Sāriputta: \"You should know, Sāriputta, that any white-robed householder whose actions are restrained by five training rules and who gains at will, without trouble or difficulty, four pleasant visible dwellings that pertain to the higher mind, might, if he so wished, declare of himself: ‘I am finished with hell, the animal realm, and the sphere of afflicted spirits; I am finished with the plane of misery, the bad destination, the lower world; I am a stream-enterer, no longer subject torebirth inthe lower world, fixed in destiny, heading for enlightenment.’",
    "an5.179:2": "(1) \"What are the five training rules by which his actions are restrained?Here, Sāriputta, a noble disciple abstains from the destruction of life, from taking what is not given, from sexual misconduct, from false speech, and from liquor, wine, and intoxicants, the basis for heedlessness. His actions are restrained by these five training rules.",
    "an5.179:3": "\"What are the four pleasant visible dwellings that pertain to the higher mind, which he gains at will, without trouble or difficulty?",
    "an5.179:4": "(3) \"Again, the noble disciple possesses unwavering confidence in the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’ This is the second pleasant visible dwelling that pertains to the higher mind, which he has achieved for the purification of the impure mind, for the cleansing of the unclean mind.",
    "an5.179:5": "(4) \"Again, the noble disciple possesses unwavering confidence in the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practicing the good way, practicing the straight way, practicing the true way, practicing the proper way; that is, the four pairs of persons, the eight types of individual—this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’ This is the third pleasant visible dwelling that pertains to the higher mind, which he has achievedfor the purification of the impure mind, for the cleansing of the unclean mind.",
    "an5.179:6": "(5) \"Again, the noble disciple possesses the virtuous behavior loved by the noble ones, unbroken, flawless, unblemished, unblotched, freeing, praised by the wise, ungrasped, leading to concentration. This is the fourth pleasant visible dwelling that pertains to the higher mind, which he has achieved for the purification of the impure mind, for the cleansing of the unclean mind.",
    "an5.179:7": "\"You should know, Sāriputta, that any white-robed householder whose actions are restrained by these five training rules and who gains at will, without trouble or difficulty, these four pleasant visible dwellings that pertain to the higher mind, might, if he so wished, declare of himself: ‘I am finished with hell, the animal realm, and the sphere of afflicted spirits; I am finished with the plane of misery, the bad destination, the lower world; I am a stream-enterer, no longer subject torebirth inthe lower world, fixed in destiny, heading for enlightenment.’\"",
    "an5.179:8": "Having seen the peril in the hells,one should avoid evil deeds;having undertaken the noble Dhamma,the wise one should avoid them.",
    "an5.179:9": "To the utmost of one's ability,one should not injure living beings;one should not knowingly speak falsely;one should not take what is not given.",
    "an5.179:10": "One should be content with one's own wives,[n.1174] The plural \"wives\" is in the Pāli,sehi dārehi santuṭṭho.and should refrain from the wives of others.[n.1175]Beand Ee readārame, Cenārame. DOP gives as meanings ofāramatiboth \"leaves off, keeps away (from)\" and \"delights in, takes pleasure.\" Hence the Be and Ee reading (which I follow) fits the former sense, the Ce reading the latter sense.A person should not drink wine and liquor,which cause mental confusion.",
    "an5.179:11": "One should recollect the Buddhaand ponder on the Dhamma.One should develop a benevolent mind,which leads to the world of the devas.",
    "an5.179:12": "When things to be given are available,for one needing and wanting merit[n.1176]Puññatthassa jigiṁsato.Mpglosses the line:puññena atthikassa puññaṁ gavesantassa.Jigiṁsatiis desiderative ofjayati, here with the sense \"to wish to obtain.\"an offering becomes vastif first given to the holy ones.",
    "an5.179:13-14": "I will describe the holy ones,Sāriputta, listen to me.[n.1177] The verses to follow are identical with those ofAN3.57.Among cattle of any sort,whether black, white, red, or golden,mottled, uniform, or pigeon-colored,the tamed bull is born,",
    "an5.179:15": "the one that can bear the load,possessing strength, advancing with good speed.They yoke the burden just to him;they are not concerned about his color.",
    "an5.179:16": "So too, among human beingsit is in any kind of birth—among khattiyas, brahmins, vessas,suddas, caṇḍālas, or scavengers—",
    "an5.179:17": "among people of any sortthat the tamed person of good manners is born:one firm in Dhamma, virtuous in conduct,truthful in speech, endowed with moral shame;",
    "an5.179:18": "one who has abandoned birth and death,consummate in the spiritual life,with the burden dropped, detached,who has done his task, free of taints;",
    "an5.179:19": "who has gone beyond all thingsof the worldand by non-clinging has reached nibbāna:an offering is truly vastwhen planted in that spotless field.",
    "an5.179:20": "Fools devoid of understanding,dull-witted, unlearned,do not attend on the holy onesbut give their gifts to those outside.",
    "an5.179:21": "Those, however, who attend on the holy ones,on the wise ones esteemed as sagely,and those whose faith in the Fortunate Oneis deeply rooted and well established,",
    "an5.179:22": "go to the world of the devasor are born here in a good family.Advancing in successive steps,those wise ones attain nibbāna."
}