{
    "an5.156:1": "\"Bhikkhus, there are these five things that lead to the decline and disappearance of the good Dhamma. What five?[n.5] As atAN4.60. See tooAN2.20.",
    "an5.156:2": "() \"Again, the bhikkhus are difficult to correct and possess qualities that make them difficult to correct. They are impatient and do not accept instruction respectfully. This is the second thing that leads to the decline and disappearance of the good Dhamma.",
    "an5.156:3": "() \"Again, those bhikkhus who are learned, heirs to the heritage, experts on the Dhamma, experts on the discipline, experts on the outlines, do not respectfully teach the discourses to others. When they have passed away, the discourses are cut off at the root, left without anyone to preserve them. This is the third thing that leads to the decline and disappearance of the good Dhamma.",
    "an5.156:4": "() \"Again, the elder bhikkhus are luxurious and lax, leaders in backsliding, discarding the duty of solitude; they do not arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.Those inthe next generation follow their example. They, too, become luxurious and lax, leaders in backsliding, discarding the duty of solitude; they, too, do not arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. This is the fourth thing that leads to the decline and disappearance of the good Dhamma.",
    "an5.156:5": "() \"Again, there is a schism in the Saṅgha, and when there is a schism in the Saṅgha there are mutual insults, mutual reviling, mutual disparagement, and mutual rejection. Then those without confidence do not gain confidence, while some of those with confidence change their minds.[n.112] As atAN.4§.This is the fifth thing that leads to the decline and disappearance of the good Dhamma.",
    "an5.156:6": "\"There are, bhikkhus, these fiveotherthings that lead to the continuation, non-decline, and non-disappearance of the good Dhamma. What five?",
    "an5.156:7": "(2) \"Again, the bhikkhus are easy to correct and possess qualities that make them easy to correct. They are patient and accept instruction respectfully. This is the second thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma.",
    "an5.156:8": "(3) \"Again, those bhikkhus who are learned, experts on the Dhamma, experts on the discipline, experts on the outlines, respectfully teach the discourses to others. When they have passed away, the discourses are not cut off at the root, for there are those who preserve them. This is the third thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma.",
    "an5.156:9": "(4) \"Again, the elder bhikkhus are not luxurious and lax, but discard backsliding and take the lead in solitude; they arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.Those inthe next generation follow their example. They, too, do not become luxurious and lax, but discard backsliding and take the lead in solitude; they, too, arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. This is the fourth thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma.",
    "an5.156:10": "(5) \"Again, the Saṅgha is dwelling at ease—in concord, harmoniously, without disputes, with a single recitation. When the Saṅgha is in concord, there are no mutual insults, no mutual reviling, no mutual disparagement, and no mutual rejection. Then those without confidence gain confidence and those with confidence increasein their confidence. This is the fifth thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma."
}