{
    "an5.191:1": "\"Bhikkhus, there are these five ancient brahmin practices that are now seen among dogs but not among brahmins. What five?",
    "an5.191:2": "() \"In the past, brahmins coupled with brahmin women only when they were in season, not out of season. But nowbrahmins couple with brahmin women both when they are in season and out of season. Dogs, however, still couple with female dogs only when they are in season, not out of season. This is the second ancient brahmin practice that is now seen among dogs but not among brahmins.",
    "an5.191:3": "() \"In the past, brahmins did not buy and sell brahmin women, and they would initiate cohabitation only through mutual affection, doing so for the sake of family continuity.[n.1181] Reading here with Besampiyen’eva saṁvāsaṁ saṁbandhāya sampavattenti.Ce and Ee havesaṁsaggatthāyaforsaṁbandhāya.MpBe seems to support the Be reading with its paraphrase:piyo piyaṁ upasaṅkamitvā paveṇiyā bandhanatthaṁ saṁvāsaṁ pavattayanti.MpCe hasganthanatthaṁforbandhanatthaṁ.Saṁbandhāyais glossedpaveṇiyā, which may signify the continuity of the family.But now brahmins buy and sell brahmin women, and they initiate cohabitation both through mutual affection and without mutual affection, doing so for the sake of family continuity.[n.1182]Bereads: …sampiyenapi saṁvāsaṁ saṁbandhāya saṁpavattenti, which seems incomplete. Ee is similar in this respect. I follow Ce in positing here two contrasting clauses: …sampiyenapi saṁvāsaṁ saṁsaggatthāya sampavattenti, asampiyenapi saṁvāsaṁ saṁsaggatthāya sampavattenti, but I would replace Cesaṁsaggatthāyawith Besaṁbandhāya.Dogs, however, still do not buy and sell female dogs, and they initiate cohabitation only through mutual affection, doing so for the sake of family continuity. This is the third ancient brahmin practice that is now seen among dogs but not among brahmins.",
    "an5.191:4": "() \"In the past, brahmins did not store up wealth, grain, silver, and gold. But now brahmins store up wealth, grain, silver, and gold. Dogs, however, still do not store up wealth, grain, silver, and gold. This is the fourth ancient brahmin practice that is now seen among dogs but not among brahmins.",
    "an5.191:5": "() \"In the past, brahmins went seeking almsfood in the evening for their evening meal and in the morning for their morning meal. But now brahmins eat as much as they want until their bellies are full, and then leave taking the leftovers away. Dogs, however, still go seeking food in the evening for their evening meal and in the morning for their morning meal. This is the fifth ancient brahmin practice that is now seen among dogs but not among brahmins."
}