{
    "an5.135:1": "\"Bhikkhus, possessing five factors, the eldest son of a head-anointed khattiya king yearns for kingship. What five? () Here, the eldest son of a head-anointed khattiya king is well born on both his maternal and paternal sides, of pure descent, unassailable and impeccable with respect to birth as far back as the seventh paternal generation. (2) He is handsome, attractive, graceful, possessing supreme beauty of complexion. (3) He is pleasing and agreeable to his parents. (4) He is pleasing and agreeable to the people of the towns and countryside. (5) He is trained and proficient in the arts of head-anointed khattiya kings, whether elephant riding, horsemanship, driving a chariot, archery, or swordsmanship.",
    "an5.135:2": "\"It occurs to him: (1) ‘I am well born on both sides … impeccable with respect to birth, so why shouldn’t I yearn for kingship? () I am handsome, attractive, graceful, possessing supreme beauty of complexion, so why shouldn’t I yearn for kingship? (3) I am pleasing and agreeable to my parents, so why shouldn’t I yearn for kingship? (4) I am pleasing and agreeable to the people of the towns and countryside, so why shouldn’t I yearn for kingship? (5) I am trained and proficient in the arts of head-anointed khattiya kings, whether elephant riding, horsemanship, driving a chariot, archery, or swordsmanship, so why shouldn’t I yearn for kingship?’ Possessing these five factors, the eldest son of a head-anointed khattiya king yearns for kingship.",
    "an5.135:3": "\"So too, bhikkhus, possessing five qualities, a bhikkhu yearns for the destruction of the taints. What five? (1) Here, a bhikkhu is endowed with faith. He places faith in the enlightenment of the Tathāgata thus: ‘The Blessed One is an arahant, perfectly enlightened … teacher of devas and humans, the Enlightened One, the Blessed One.’ (2) He is seldom ill or afflicted, possessing an even digestion that is neither too cool nor too hot but moderate and suitable for striving. () He is honest and open, one who reveals himself as he really is to the Teacher and his wise fellow monks. (4) He has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. (5) He is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering.",
    "an5.135:4": "\"It occurs to him: (1) ‘I am endowed with faith; I place faith in the enlightenment of the Tathāgata thus: \"The Blessed One is an arahant, perfectly enlightened … teacher of devas and humans, the Enlightened One, the Blessed One,\" so why shouldn’t Iyearn for the destruction of the taints? (2) I am seldom ill or afflicted, possessing an even digestion that is neither too cool nor too hot but moderate and suitable for striving, so why shouldn’t I yearn for the destruction of the taints? (3) I am honest and open; I reveal myself as I really am to the Teacher and my wise fellow monks, so why shouldn’t I yearn for the destruction of the taints? () I have aroused energy for the abandoning of unwholesome qualities … not casting off the duty of cultivating wholesome qualities, so why shouldn’t I yearn for the destruction of the taints? (5) I am wise; I possess the wisdom …thatleads to the complete destruction of suffering, so why shouldn’t I yearn for the destruction of the taints?’"
}