{
    "an5.133:1": "\"Bhikkhus, even a wheel-turning monarch, a righteous king who rules by the Dhamma, does not turn the wheel without a king above him.\"",
    "an5.133:2": "\"It is the Dhamma, bhikkhu,\" the Blessed One said. \"Here, a wheel-turning monarch, a righteous king who rules by the Dhamma, relying just on the Dhamma, honoring, respecting, and venerating the Dhamma, taking the Dhamma as his standard, banner, and authority, provides righteous protection, shelter, and guard for the people in his court.",
    "an5.133:3": "Again, a wheel-turning monarch, a righteous king who rules by the Dhamma … provides righteous protection, shelter, and guard for his khattiya vassals; for his army; for brahmins and householders; for the people of town and countryside; for ascetics and brahmins; for the animals and birds.Having provided such righteous protection, shelter, and guard, that wheel-turning monarch, a righteous king who rules by the Dhamma, turns the wheel solely through the Dhamma, a wheel that cannot be turned back by any hostile creature in human form.",
    "an5.133:4": "\"So too, bhikkhu, the Tathāgata, the Arahant, the Perfectly Enlightened One, the righteous king of the Dhamma, relying just on the Dhamma, honoring, respecting, and venerating the Dhamma, taking the Dhamma as his standard, banner, and authority, provides righteous protection, shelter, and guard for the bhikkhus, saying: (1) ‘Such bodily action should be cultivated; such bodily action should not be cultivated. (2) Such verbal action should be cultivated; such verbal action should not be cultivated. (3) Such mental action should be cultivated; such mental action should not be cultivated. () Such livelihood should be cultivated; such livelihood should not be cultivated. (5) Such a village or town should be resorted to; such a village or town should not be resorted to.’",
    "an5.133:5": "\"Again, the Tathāgata, the Arahant, the Perfectly Enlightened One, the righteous king of the Dhamma, relying just on the Dhamma, honoring, respecting, and venerating the Dhamma, taking the Dhamma as his standard, banner, and authority, provides righteous protection, shelter, and guard for the bhikkhunīs … for the male lay followers … for the female lay followers, saying: ‘Such bodily action should be cultivated …. Such verbal action should be cultivated …. Such mental action should be cultivated …. Such livelihood should be cultivated; such livelihood should not be cultivated. Such a village or town should be resorted to; such a village or town should not be resorted to.’",
    "an5.133:6": "\"Having provided such righteous protection, shelter, and guard, the Tathāgata, the Arahant, the Perfectly Enlightened One,the righteous king of the Dhamma, sets in motion the unsurpassed wheel of the Dhamma solely through the Dhamma, a wheel that cannot be turned back by any ascetic, brahmin, deva, Māra, or Brahmā, or by anyone in the world.\""
}