{
    "an5.103:1": "\"Bhikkhus, possessing five factors, a master thief breaks into houses, plunders wealth, commits banditry, and ambushes highways. What five? Here, a master thief () depends upon the uneven, (2) on thickets, and (3) on powerful people; (4) he offers bribes, and (5) he moves alone.",
    "an5.103:2": "(1) \"And how does a master thief depend on the uneven? Here, a master thief depends on rivers that are hard to cross and rugged mountains. It is in this way that a master thief depends on the uneven.",
    "an5.103:3": "(2) \"And how does a master thief depend on thickets? Here, a master thief depends on a thicket of cane, a thicket of trees, a coppice, or a large dense jungle. It is in this way that a master thief depends on thickets.",
    "an5.103:4": "(3) \"And how does a master thief depend on powerful people? Here, a master thief depends on kings or royal ministers. He thinks: ‘If anyoneaccuses me of anything, these kings or royal ministers will dismiss the case.’ If anyone accuses him of anything, those kings or royal ministers dismiss the case. It is in this way that a master thief depends on powerful people.",
    "an5.103:5": "(4) \"And how does a master thief offer bribes? Here, a master thief is rich, with great wealth and property. He thinks: ‘If anyone should accuse me of anything, I’ll placate him with a bribe.’ If anyone accuses him of anything, he placates him with a bribe. It is in this way that a master thief offers bribes.",
    "an5.103:6": "(5) \"And how does a master thief move alone? Here, a master thief executes his raids[n.1113]Gahaṇāni, lit. \"takings.\"Mp:\"The taking of others’ belongings\"(parasantakānaṁ bhaṇḍānaṁ gahaṇāni).all alone. For what reason?With the thought:‘My secret deliberations[n.1114]Guyhamantā. Heremantāmust mean \"deliberations\" or \"consultations,\" notmantras.Mpoffers only a verbal gloss,guhitabbamantā.shouldn’t spread to others!’ It is in this way that a master thief moves alone.",
    "an5.103:7": "\"It is by possessing these five factors that a master thief breaks into houses, plunders wealth, commits banditry, and ambushes highways.",
    "an5.103:8": "\"So too, bhikkhus, possessing five qualities, an evil bhikkhu maintains himself in a maimed and injured condition, is blameworthy and subject to reproach by the wise, and generates much demerit. What five? Here, an evil bhikkhu (1) depends on the uneven, (2) depends on thickets, and (3) depends on powerful people; (4) he offers bribes and (5) moves alone.",
    "an5.103:9": "(1) \"And how does an evil bhikkhu depend on the uneven? Here, an evil bhikkhu engages in unrighteous bodily, verbal, and mental action. It is in this way that an evil bhikkhu depends on the uneven.",
    "an5.103:10": "(2) \"And how does an evil bhikkhu depend on thickets?Here, an evil bhikkhu holds wrong view; he has adopted an extremist view.[n.1115]Antaggāhikāya.Mp:\"He grasps hold of eternalism or annihilationism.\"It is in this way that an evil bhikkhu depends upon thickets.",
    "an5.103:11": "(3) \"And how does an evil bhikkhu depend on powerful people? Here, an evil bhikkhu depends on kings or royal ministers. He thinks: ‘If anyone should accuse me of anything, these kings or royal ministers will dismiss the case.’ If anyone accuses him of anything, those kings or royal ministers dismiss the case. It is in this way that an evil bhikkhu depends on the powerful people.",
    "an5.103:12": "(4) \"And how does an evil bhikkhu offer bribes? Here, an evil bhikkhu gains robes, almsfood, lodgings, and medicines and provisions for the sick. He thinks: ‘If anyone should accuse me of anything, I’ll placate him with one of these gains.’ If anyone accuses him of anything, he placates him with one of his gains. It is in this way that an evil bhikkhu offers bribes.",
    "an5.103:13": "(5) \"And how does an evil bhikkhu move alone? Here, an evil bhikkhu sets up a solitary residence for himself in the borderlands. Approaching families there, he obtains gains. It is in this way that an evil bhikkhu moves alone.",
    "an5.103:14": "\"It is by possessing these five qualities that an evil bhikkhu maintains himself in a maimed and injured condition, is blameworthy and subject to reproach by the wise, and generates much demerit.\""
}