{
    "an5.38:1": "\"Bhikkhus, these five benefits come to a clansman endowed with faith. What five? () When the good persons in the world show compassion,[n.07] They \"show compassion\"(anukampeyyuṁ)to them by offering them an opportunity to give alms and thereby acquire merit. Thus it is not so much the laypeople who show compassion to the monastics by giving them alms (though this is true), but the monastic who shows compassion to laypeople by approaching their homes to receive their offerings. By giving alms laypeople create the seeds for a happy rebirth and the attainment of nibbāna. The monastics may also teach the Dhamma to the laypeople and in this way give them access to the teachings.they first show compassion to the person with faith, not so to the person without faith. (2) When they approach anyone, they first approach the person with faith, not so the person without faith. (3) When they receive alms, they first receive alms from the person with faith, not so from the person without faith. (4) When they teach the Dhamma, they first teach the Dhamma to the person with faith, not so to the person without faith. (5) With the breakup of the body, after death, a person with faith is reborn in a good destination, in a heavenly world. These are the five benefits that come to a clansman who has faith.",
    "an5.38:2": "\"Just as at a crossroads on level ground, a great banyan tree becomes the resort for birds all around, sothe clansman endowed with faith becomes the resort for many people: for bhikkhus, bhikkhunīs, male lay followers, and female lay followers.\"",
    "an5.38:3": "A large tree with a mighty trunk,branches, leaves, and fruit,firm roots, and bearing fruit,is a support for many birds.",
    "an5.38:4": "Having flown across the sky,the birds resort to this delightful base:those in need of shade partake of its shade;those needing fruit enjoy its fruit.",
    "an5.38:5": "Just so, when a person is virtuous,endowed with faith,of humble manner, compliant,gentle, welcoming, soft,",
    "an5.38:6": "those in the world who are fields of merit—devoid of lust and hatred,devoid of delusion, taintless—resort to such a person.",
    "an5.38:7": "They teach him the Dhammathat dispels all suffering,having understood whichthe taintless one here attains nibbāna."
}