{
    "an5.192:1": "Then the brahmin Doṇa approached the Blessed One and exchanged greetings with him. When he had concluded his greetings and cordial talk, he sat down to one side and said to the Blessed One:",
    "an5.192:2": "\"I have heard, Master Gotama: ‘The ascetic Gotama does not pay homage to brahmins who are old, aged, burdened with years, advanced in life, come to the last stage; nor does he stand up for them or offer them a seat.’[n.1183] This seems to have been a common criticism of the Buddha. See tooAN4.andAN8.11.This is indeed true, for Master Gotama does not pay homage to brahmins who are old, aged, burdened with years, advanced in life, come to the last stage; nor does he stand up for them or offer them a seat. This is not proper, Master Gotama.\"",
    "an5.192:3": "\"Doṇa, the ancientseers among the brahmin—that is, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Angīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, and Bhagu—were the creators of the hymns and the composers of the hymns, and it is their ancient hymns, formerly chanted, declared, and compiled, that the brahmins nowadays still chant and repeat, repeating what was spoken, reciting what was recited, and teaching what was taught. Those ancient seers described these five kinds of brahmins: the one similar to Brahmā, the one similar to a deva, the one who remains within the boundary, the one who has crossed the boundary, and the caṇḍāḷa of a brahmin as the fifth. Which of these are you, Doṇa?\"",
    "an5.192:4": "\"We do not know these five kinds of brahmins, Master Gotama. All we know isthe word‘brahmins.’ Please, let Master Gotama teach me the Dhamma in such a way that I might know these five kinds of brahmins.\"",
    "an5.192:5": "(1) \"And how, Doṇa, is a brahmin similar to Brahmā? Here, a brahmin is well born on both his maternal and paternal sides, of pure descent, unassailable and impeccable with respect to birth as far back as the seventh paternal generation. He lives the spiritual life of virginal celibacy[n.1184]Komārabrahmacariyaṁ. Presumably this means the celibacy of one who has always been a virgin.for forty-eight years, studying the hymns. He then seeks a teacher's fee for his teacher solely in accordance with the Dhamma, not contrary to the Dhamma.",
    "an5.192:6": "And what, Doṇa, is the Dhamma in that case?Not by agriculture, not by trade, not by raising cattle, not by archery, not by service to the king, not by a particular craft, but solely by wandering for alms without scorning the alms bowl. Having offered the teacher's fee to his teacher, he shaves off his hair and beard, puts on ochre robes, and goes forth from the household life into homelessness.[n.1185] This passage suggests, contrary to a common assumption, that during the Buddha’s time brahmins were not obliged to marry and adopt the life of a householder. While marriage later became the norm for brahmins during the prime of life, it seems that in this period some brahmins, after completing their training, chose to renounce secular life even in their youth and maintained their renunciant status throughout their lives. On celibate brahmin ascetics, see Samuel 2008:122–23, 154–5.When he has gone forth, he dwells pervading one quarter with a mind imbued with loving-kindness, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with loving-kindness, vast, exalted, measureless, without enmity, without ill will. He dwells pervading one quarter with a mind imbued with compassion … with a mind imbued with altruistic joy … with a mind imbued with equanimity, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with equanimity, vast, exalted, measureless, without enmity, without ill will. Having developed these four divine abodes,[n.118]Cattāro brahmavihāre bhāvetvā. This is one of the few places in the Nikāyas where the wordbrahmavihārais used to designate these four meditations collectively. Wherever the word is used in the Nikāyas, it immediately precedes the practitioner's rebirth in the brahmā world.with the breakup of the body, after death, he is reborn in a good destination, in the brahmā world. In this way a brahmin is similar to Brahmā.",
    "an5.192:7": "(2) \"And how, Doṇa, is a brahmin similar to a deva? Here, a brahmin is well born on both his maternal and paternal sides, of pure descent, unassailable and impeccable with respect to birth as far back as the seventh paternal generation. He lives the spiritual life of virginal celibacy for forty-eight years, studying the hymns. He then seeks a teacher's fee for his teacher solely in accordance with the Dhamma, not contrary to the Dhamma.",
    "an5.192:8": "And what, Doṇa, is the Dhamma in that case? Not by buying and selling,he takesonly a brahmin woman given to him by the pouring of water. He couples only with a brahmin woman, not with a khattiya woman, a vessa woman, a sudda woman, or a caṇḍāla woman, nor with a woman from a family of hunters, bamboo workers, chariot makers, or flower scavengers. He does not couple with a pregnant woman, nor with a woman who is nursing, nor with a woman out of season.",
    "an5.192:9-10": "(3) \"And how, Doṇa, is a brahmin one who remains within the boundary? Here, a brahmin is well born on both his maternal and paternal sides, of pure descent, unassailable and impeccable with respect to birth as far back as the seventh paternal generation. He lives the spiritual life of virginal celibacy for forty-eight years ….all as above down to… Because his brahmin wife does not serve for sensual pleasure, amusement, or sensual delight, but only for procreation. When he has engaged in sexual activity, out of attachment to his sons he remains settled on his property and does not go forth from the household life into homelessness. He stops at the boundary of the ancient brahmins but does not violate it. Since he stops at the boundary of the ancient brahmins but does not violate it, he is called a brahmin who remains within the boundary. It is in this way that a brahmin is one who remains within the boundary.",
    "an5.192:11": "(4) \"And how, Doṇa, is a brahmin one who has crossed the boundary?Here, a brahmin is well born on both his maternal and paternal sides, of pure descent, unassailable and impeccable with respect to birth as far back as the seventh paternal generation. He lives the spiritual life of virginal celibacy for forty-eight years, studying the hymns. He then seeks a teacher's fee for his teacher solely in accordance with the Dhamma, not contrary to the Dhamma.",
    "an5.192:12": "And what, Doṇa, is the Dhamma in that case? Not by agriculture, not by trade, not by raising cattle, not by archery, not by service to the king, not by a particular craft, but solely by wandering for alms without scorning the alms bowl. Having offered the teacher's fee to his teacher, he seeks a wife both in accordance with the Dhamma and contrary to the Dhamma.He takes a wifeby buying and selling as well as a brahmin woman given to him by the pouring of water. He couples with a brahmin woman, a khattiya woman, a vessa woman, a sudda woman, and a caṇḍāla woman, and a woman from a family of hunters, bamboo workers, chariot makers, or flower scavengers. He couples with a pregnant woman, a woman who is nursing, a woman in season, and a woman out of season. His brahmin wife serves for sensual pleasure, amusement, and sensual delight, as well as for procreation.[n.1189] Reading withBeand Eepajatthāpi, as against Cena pajatthāva.He does not stop at the boundary of the ancient brahmins but violates it. Since he does not stop at the boundary of the ancient brahmins but violates it, he is called a brahmin who has crossed the boundary. It is in this way that a brahmin is one who has crossed the boundary.",
    "an5.192:13": "(5) \"And how, Doṇa, is a brahmin a caṇḍāla of a brahmin? Here, a brahmin is well born on both his maternal and paternal sides, of pure descent, unassailable and impeccable with respect to birth as far back as the seventh paternal generation. Helives the spiritual life of virginal celibacy for forty-eight years, studying the hymns. He then seeks a teacher's fee for his teacher both in accordance with the Dhamma and contrary to the Dhamma—by agriculture, by trade, by raising cattle, by archery, by service to the king, by a particular craft, and not only[n.1190] I assume the text (in all three editions) should be corrected to readna kevalaṁ bhikkhācariyāyarather thankevalam pi bhikkhācariyāya.by wandering for alms without scorning the alms bowl.",
    "an5.192:14": "Having offered the teacher's fee to his teacher, he seeks a wife both in accordance with the Dhamma and contrary to the Dhamma.He takes a wifeby buying and selling as well as a brahmin woman given to him by the pouring of water. He couples with a brahmin woman, a khattiya woman, a vessa woman, a sudda woman, and a caṇḍāla woman, and a woman from a family of hunters, bamboo workers, chariot makers, or flower scavengers. He couples with a pregnant woman, a woman who is nursing, a woman in season, and a woman out of season. His brahmin wife serves for sensual pleasure, amusement, and sensual delight, as well as for procreation. He earns his living by all kinds of work. Brahmins say to him: ‘Why, sir, while claiming to be a brahmin, do you earn your living by all kinds of work?’ He answers them: ‘Just as fire burns pure things and impure things yet is not thereby defiled, so too, sirs, if a brahmin earns his living by all kinds of work, he is not thereby defiled.’ Since he earns his living by all kinds of work, this brahmin is called a caṇḍāla of a brahmin. It is in this way that a brahmin is a caṇḍāla of a brahmin.",
    "an5.192:15": "\"Doṇa, the ancient seers among the brahmin—that is, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Angīrasa, Bhāradvāja,Vāseṭṭha, Kassapa, and Bhagu—were the creators of the hymns and the composers of the hymns, and it is their ancient hymns, formerly chanted, declared, and compiled, that the brahmins nowadays still chant and repeat, repeating what was spoken, reciting what was recited, and teaching what was taught. Those ancient seers described these five kinds of brahmins: the one similar to Brahmā, the one similar to a deva, the one who remains within the boundary, the one who has crossed the boundary, and the caṇḍāḷa of a brahmin as the fifth. Which of these are you, Doṇa?\"",
    "an5.192:16": "\"Such being the case, Master Gotama, we do not even measure up to the caṇḍāla of a brahmin. Excellent, Master Gotama! Excellent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the darkness so those with good eyesight can see forms. I now go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. Let Master Gotama consider me a lay follower who from today has gone for refuge for life.\""
}