{
    "an5.167:1": "There the Venerable Sāriputta addressed the bhikkhus thus: …",
    "an5.167:2": "What five? (1)He should consider:‘I will speak at a proper time, not at an improper time; () I will speak truthfully, not falsely; (3) I will speak gently, not harshly; (4) I will speak in a beneficial way, not in a harmful way; (5) I will speak with a mind of loving-kindness, not while harboring hatred.’ A bhikkhu who wishes to reprove another should first establish these five things in himself.",
    "an5.167:3": "\"Here, friends, I see some person being reproved at an improper time, not disturbed[n.1165]No kālena kupitaṁ. It seems strange that the text uses the wordkupitato refer to being reproved at the proper time.Kupitanormally suggests \"disturbed, irritated, angered,\" and at the proper time it would be suitable to reprove him.at a proper time; being reproved about what is false, not disturbed about what is true; being reproved harshly, not disturbed gently; being reproved in a harmful way, not disturbed in a beneficial way; being reproved by one who harbors hatred, not disturbed by one with a mind of loving-kindness.",
    "an5.167:4": "\"Friends, when a bhikkhu is reproved in a way contrary to the Dhamma, non-remorse should be induced in him in five ways: (1) ‘Friend, you were reproved at an improper time, notat a proper time; that is sufficient for you to be without remorse. (2) You were reproved falsely, not truthfully; that is sufficient for you to be without remorse. (3) You were reproved harshly, not gently; that is sufficient for you to be without remorse. () You were reproved in a harmful way, not in a beneficial way; that is sufficient for you to be without remorse. (5) You were reproved by one harboring hatred, not by one with a mind of loving-kindness; that is sufficient for you to be without remorse.’ When a bhikkhu is reproved in a way contrary to the Dhamma, non-remorse should be induced in him in these five ways.",
    "an5.167:5": "\"Friends, when a bhikkhu reproves in a way contrary to the Dhamma, remorse should be induced in him in five ways: (1) ‘Friend, you reproved him at an improper time, not at a proper time; that is sufficient for you to feel remorse. (2) You reproved him falsely, not truthfully; that is sufficient for you to feel remorse. (3) You reproved him harshly, not gently; that is sufficient for you to feel remorse. (4) You reproved him in a harmful way, not in a beneficial way; that is sufficient for you to feel remorse. () You reproved him while harboring hatred, not with a mind of loving-kindness; that is sufficient for you to feel remorse.’ When a bhikkhu reproves in a way contrary to the Dhamma, remorse should be induced in him in these five ways. For what reason? So that another bhikkhu would not think of reproving falsely.",
    "an5.167:6": "\"Here, friends, I see some person being reproved at a proper time, not disturbed at an improper time; being reproved truthfully, not disturbed falsely; being reproved gently, not disturbed harshly; being reproved in a beneficial way, not disturbed in a harmful way; being reproved by one with a mind of loving-kindness, not disturbed by one who harbors hatred.",
    "an5.167:7": "\"Friends, when a bhikkhu is reproved in accordance with the Dhamma, remorse should be induced in him in five ways: (1) ‘Friend, you were reproved at a proper time, not at an improper time; that is sufficient for you to feel remorse. (2) You were reproved truthfully, not falsely; that is sufficient for you to feel remorse. (3) You were reproved gently, not harshly; that is sufficient for you to feel remorse. (4) You were reproved in a beneficial way, not in a harmful way; that is sufficient for you to feel remorse. (5) You were reproved by one with a mind of loving-kindness, not by one harboring hatred; that is sufficient for you to feel remorse.’When a bhikkhu is reproved in accordance with the Dhamma, remorse should be induced in him in these five ways.",
    "an5.167:8": "\"Friends, when a bhikkhu reproves in accordance with the Dhamma, non-remorse should be induced in him in five ways: (1) ‘Friend, you reproved him at a proper time, not at an improper time; that is sufficient for you to be without remorse. (2) You reproved him truthfully, not falsely; that is sufficient for you to be without remorse. (3) You reproved him gently, not harshly; that is sufficient for you to be without remorse. (4) You reproved him in a beneficial way, not in a harmful way; that is sufficient for you to be without remorse. (5) You reproved him with a mind of loving-kindness, not while harboring hatred; that is sufficient for you to be without remorse.’ When a bhikkhu reproves in accordance with the Dhamma, non-remorse should be induced in him in these five ways. For what reason? So that another bhikkhu would think of reproving about what is true.",
    "an5.167:9": "\"Friends, a person who is reproved should be established in two things: in truth and non-anger. If others should reprove me—whether at a proper time or at an improper time; whether about what is true or about what is false; whether gently or harshly; whether in a beneficial way or in a harmful way; whether with a mind of loving-kindness or while harboring hatred—I should still be established in two things: in truth and non-anger.",
    "an5.167:10": "The Blessed One said:\"Sāriputta, even when you are speaking to them in such a way, some foolish men here do not respectfully accept what you say.\"",
    "an5.167:11": "\"There are, Bhante, persons devoid of faith who have gone forth from the household life into homelessness, notout of faith but intent on earning a living; they are crafty, hypocritical, deceptive, restless, puffed up, vain, talkative, rambling in their talk, unguarded over the doors of the senses, immoderate in eating, not intent on wakefulness, indifferent to the ascetic life, not keenly respectful of the training, luxurious and lax, leaders in backsliding, discarding the duty of solitude, lazy, devoid of energy, muddle-minded, lacking in clear comprehension, unconcentrated, with wandering minds, unwise, stupid. When I speak to them in such a way, they do not respectfully accept what I say.",
    "an5.167:12": "\"But, Bhante, there are clansmen who have gone forth from the household life into homelessness out of faith, who are not crafty, hypocritical, deceptive, restless, puffed up, vain, talkative, and rambling in their talk; who keep guard over the doors of the senses; who are moderate in eating, intent on wakefulness, intent upon the ascetic life, keenly respectful of the training; who are not luxurious and lax; who discard backsliding and take the lead in solitude; who are energetic, resolute, mindful, clearly comprehending, concentrated, with one-pointed minds, wise, intelligent. When I speak to them in such a way, they respectfully accept what I say.\"",
    "an5.167:13": "\"Sāriputta, leave alone those people who are devoid of faith and have gone forth from the household life into homelessness, not out of faith but intent on earning a living; who are crafty … unwise, stupid.",
    "an5.167:14": "But, Sāriputta, you should speak to those clansmen who have gone forth from the household life into homelessness out of faith, who are not crafty … who are wise, intelligent.Exhort your fellow monks, Sāriputta! Instruct your fellow monks, Sāriputta,thinking:‘I will cause my fellow monks to emerge from what is contrary to the good Dhamma and will establish them in the good Dhamma.’ Thus, Sāriputta, should you train yourself.\""
}