{
    "an5.48:1": "\"Bhikkhus, there are these five situations that are unobtainable by an ascetic or a brahmin, by a deva, Māra, or Brahmā, or by anyone in the world. What five? () ‘May what is subject to old age not grow old!’: this is a situation that is unobtainable by an ascetic or a brahmin, by a deva, Māra, or Brahmā, or by anyone in the world. (2) ‘May what is subject to illness not fall ill!’: this is a situation that is unobtainable by an ascetic … or by anyone in the world. (3) ‘May what is subject to death not die!’: this is a situation that is unobtainable by an ascetic … or by anyone in the world. (4) ‘May what is subject to destruction not be destroyed!’: this is a situation that is unobtainable by an ascetic … or by anyone in the world. (5) ‘May what is subject to loss not be lost!’: this is a situation that is unobtainable by an ascetic or a brahmin, by a deva, Māra, or Brahmā, or by anyone in the world.",
    "an5.48:2": "(1) \"Bhikkhus, for the uninstructed worldling, what is subject to old age grows old. When this happens, he does not reflect thus: ‘I am not the only one for whom what is subject to old age grows old. For all beings that come and go, that pass away and undergo rebirth, what is subject to old age grows old. If I were to sorrow, languish, lament, weep beating my breast, and become confused when what is subject to old age grows old, I would lose my appetite and my features would become ugly. I would not be able to do my work, my enemies would be elated, and my friends would become saddened.’ Thus, when what is subject to old age grows old, he sorrows, languishes, laments, weeps beating his breast, and becomes confused. This is called an uninstructed worldling pierced by the poisonous dart of sorrow who only torments himself.",
    "an5.48:3": "(2) \"Again, for the uninstructed worldling,what is subject to illness falls ill … () … what is subject to death dies … (4) … what is subject to destruction is destroyed … (5) … what is subject to loss is lost. When this happens, he does not reflect thus: ‘I am not the only one for whom what is subject to loss is lost. For all beings who come and go, who pass away and undergo rebirth, what is subject to loss is lost. If I were to sorrow, languish, lament, weep beating my breast, and become confused when what is subject to loss is lost, I would lose my appetite and my features would become ugly. I would not be able to do my work, my enemies would be elated, and my friends would become saddened.’ Thus, when what is subject to loss is lost, he sorrows, languishes, laments, weeps beating his breast, and becomes confused. This is called an uninstructed worldling pierced by the poisonous dart of sorrow who only torments himself.",
    "an5.48:4": "(1) \"Bhikkhus, for the instructed noble disciple, what is subject to old age grows old. When this happens, he reflects thus: ‘I am not the only one for whom what is subject to old age grows old. For all beings that come and go, that pass away and undergo rebirth, what is subject to old age grows old. If I were to sorrow, languish, lament, weep beating my breast, and become confused when what is subject to old age grows old, I would lose my appetite and my features would become ugly. I would not be able to do my work, my enemies would be elated, and my friends would become saddened.’ Thus, when what is subject to old age grows old, he does not sorrow, languish, lament, weep beating his breast, and become confused. This is called an instructed noble disciple who has drawn out the poisonous dart of sorrow pierced by which the uninstructed worldling only torments himself. Sorrowless, without darts, the noble disciple realizes nibbāna.[n.1039] The text uses a reflexive causative form:attānaṁyeva parinibbāpeti. This might also have been rendered: \"He extinguishes himself,\" or \"He quenches himself.\" What is literally extinguished is the bitter feeling of sorrow, but the verbparinibbāpeti, related to the nounnibbāna, implies that he reaches ultimate liberation.",
    "an5.48:5": "(2) \"Again, for the instructed noble disciple, what is subject to illness falls ill … (3) … what is subject to death dies … (4) … what is subject to destruction is destroyed … () … what is subject to loss is lost. When this happens, he reflects thus: ‘I am not the only one for whom what is subject to loss is lost. For all beings that come and go, that pass away and undergo rebirth, what is subject to lossis lost. If I were to sorrow, languish, lament, weep beating my breast, and become confused when what is subject to loss is lost, I would lose my appetite and my features would become ugly. I would not be able to do my work, my enemies would be elated, and my friends would become saddened.’ Thus, when what is subject to loss is lost, he does not sorrow, languish, lament, weep beating his breast, and become confused. This is called an instructed noble disciple who has drawn out the poisonous dart of sorrow pierced by which the uninstructed worldling only torments himself. Sorrowless, without darts, the noble disciple realizes nibbāna.",
    "an5.48:6": "\"These, bhikkhus, are the five situations that are unobtainable by an ascetic or a brahmin, by a deva, Māra, or Brahmā, or by anyone in the world.",
    "an5.48:7": "\"It is not by sorrowing and lamentingthat even the least good here can be gained.[n.1040] I read withEeattho idha labbhā api appako pi(Be is essentially the same). Ceattho alabbho api appako pimeans \"even the least good cannot be gained,\" which undermines the point.Knowing that one is sorrowful and sad,one's enemies are elated.",
    "an5.48:8": "\"When the wise person does not shake in adversities,knowing how to determine what is good,his enemies are saddened, having seenthat his former facial expression does not change.",
    "an5.48:9": "\"Wherever one might gain one's good,in whatever way—by chanting, mantras,maxims, gifts, or tradition[n.1041]Paveṇiyā.Mp:\"By family custom(kulavaṁsena). The meaning is, ‘We have traditionally practiced this, and we have not practiced that.’\"—thereone should exert oneself in just that way.",
    "an5.48:10": "\"But if one should understand: ‘This goodcannot be obtained by me or anyone else,’one should accept the situation without sorrowing,thinking: ‘The kamma is strong; what can I do now?’\""
}