{
    "an5.155:1": "\"Bhikkhus, there are these five things that lead to the decline and disappearance of the good Dhamma. What five?",
    "an5.155:2": "() \"Again, the bhikkhus do not teach the Dhamma to others in detail as they have heard it and learned it. This is the second thing that leads to the decline and disappearance of the good Dhamma.",
    "an5.155:3": "() \"Again, the bhikkhus do not make others repeat the Dhamma in detail as they have heard it and learned it. This is the third thing that leads to the decline and disappearance of the good Dhamma.",
    "an5.155:4": "() \"Again, the bhikkhus do not recite the Dhamma in detail as they have heard it and learned it. This is the fourth thing that leads to the decline and disappearance of the good Dhamma.",
    "an5.155:5": "() \"Again, the bhikkhus do not ponder, examine, and mentally inspect the Dhamma as they have heard it and learned it. This is the fifth thing that leads to the decline and disappearance of the good Dhamma.",
    "an5.155:6": "\"Bhikkhus, there are these fiveotherthings that lead to the continuation, non-decline, and non-disappearance of the good Dhamma. What five?",
    "an5.155:7": "(2) \"Again, the bhikkhus teach the Dhamma to others in detail as they have heard it and learned it. This is the second thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma.",
    "an5.155:8": "(3) \"Again, the bhikkhus make others repeat the Dhamma in detail as they have heard it and learned it. This is the third thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma.",
    "an5.155:9": "(4) \"Again, the bhikkhus recite the Dhamma in detail as they have heard it and learned it. This is the fourth thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma.",
    "an5.155:10": "(5) \"Again, the bhikkhus ponder, examine, and mentally inspect the Dhamma as they have heard it and learned it. This is the fifth thing that leads to the continuation, non-decline, and non-disappearance of the good Dhamma."
}