{
    "an5.77:1": "\"Bhikkhus, when a forest bhikkhu considers five future perils, it is enough for him to dwell heedful, ardent,and resolute for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.",
    "an5.77:2": "What five? (1) \"Here, a forest bhikkhu reflects thus: ‘I am now dwelling all alone in the forest. But while I am living here, a snake might bite me, a scorpion might sting me, or a centipede might sting me. Because of that I might die, which would be an obstacle for me. Let me now arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.’ This is the first future peril considering which it is enough for a forest bhikkhu to dwell heedful, ardent, and resolute … for the realization of the as-yet-unrealized.",
    "an5.77:3": "(2) \"Again, a forest bhikkhu reflects thus: ‘I am now dwelling all alone in the forest. But while I am living here, I might trip and fall down, or the food that I have eaten might harm me, or my bile or phlegm or sharp winds might become agitated in me. Because of that I might die, which would be an obstacle for me. Let me now arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.’ This is the second future peril considering which it is enough for a forest bhikkhu to dwell heedful, ardent, and resolute … for the realization of the as-yet-unrealized.",
    "an5.77:4": "(3) \"Again, a forest bhikkhu reflects thus: ‘I am now dwelling all alone in the forest. But while I am living here, I might encounter wild beasts, such as a lion, a tiger, a leopard, a bear, or a hyena, and they might take my life. Because of that I would die,which would be an obstacle for me. Let me now arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.’ This is the third future peril considering which it is enough for a forest bhikkhu to dwell heedful, ardent, and resolute … for the realization of the as-yet-unrealized.",
    "an5.77:5": "(4) \"Again, a forest bhikkhu reflects thus: ‘I am now dwelling all alone in the forest. But while I am living here, I might encounter hoodlums escaping a crime or planning one and they might take my life. Because of that I would die, which would be an obstacle for me. Let me now arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.’ This is the fourth future peril considering which it is enough for a forest bhikkhu to dwell heedful, ardent, and resolute … for the realization of the as-yet-unrealized.",
    "an5.77:6": "(5) \"Again, a forest bhikkhu reflects thus: ‘I am now dwelling all alone in the forest. But in the forest there are wild spirits,[n.1082]Vāḷā amanussā, lit., \"wild nonhumans.\"Mpglosses \"such nonhumans as rough, violent yakkhas, etc.\"(kakkhaḷā duṭṭhā yakkhādayo amanussā).and they might take my life. Because of that I would die, which would be an obstacle for me. Let me now arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.’ This is the fifth future peril considering which it is enough for a forest bhikkhu to dwell heedful, ardent, and resolute … for the realization of the as-yet-unrealized.",
    "an5.77:7": "\"These, bhikkhus, are the five future perils considering which it is enough for a forest bhikkhu to dwell heedful, ardent, and resolute for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.\""
}