{
    "an5.136:1": "\"Bhikkhus, possessing five factors, the eldest son of a head-anointed khattiya king yearns to be the viceroy. What five? () Here, the eldest son of a head-anointed khattiya king is well born … as far back as the seventh paternal generation. (2) He is handsome, attractive, graceful, possessing supreme beauty of complexion. (3) He is pleasing and agreeable to his parents. (4) He is pleasing and agreeable to the armed forces. (5) He is wise, competent, and intelligent, able to consider benefits pertaining to the past, future, and present.",
    "an5.136:2": "\"It occurs to him: (1) ‘I am well born … as far back as the seventh paternal generation, so why shouldn’t I yearn to be the viceroy? () I am handsome, attractive, graceful, possessing supreme beauty of complexion, so why shouldn’t I yearn to be the viceroy? (3) I am pleasing and agreeable to my parents, so why shouldn’t I yearn to be the viceroy?(4) I am pleasing and agreeable to the armed forces, so why shouldn’t I yearn to be the viceroy? (5) I am wise, competent, and intelligent, able to consider benefits pertaining to the past, future, and present, so why shouldn’t I yearn to be the viceroy?’ Possessing these five factors, the eldest son of a head-anointed khattiya king yearns to be the viceroy.",
    "an5.136:3": "\"So too, bhikkhus, possessing five qualities, a bhikkhu yearns for the destruction of the taints. What five? (1) Here, a bhikkhu is virtuous … he trains in them. (2) He has learned much … and penetrated well by view. () He is one whose mind is well established in the four establishments of mindfulness. (4) He has aroused energy … not casting off the duty of cultivating wholesome qualities. (5) He is wise; he possesses the wisdom …thatleads to the complete destruction of suffering.",
    "an5.136:4": "\"It occurs to him: (1) ‘I am virtuous … I train in them, so why shouldn’t I yearn for the destruction of the taints? (2) I have learned much … and penetrated well by view, so why shouldn’t I yearn for the destruction of the taints? (3) I am one whose mind is well established in the four establishments of mindfulness, so why shouldn’t I yearn for the destruction of the taints? () I have aroused energy for the abandoning of unwholesome qualities … not casting off the duty of cultivating wholesome qualities, so why shouldn’t I yearn for the destruction of the taints? (5) I am wise; I possess the wisdom …thatleads to the complete destruction of suffering, so why shouldn’t I yearn for the destruction of the taints?’"
}