{
    "an5.100:1": "Thus have I heard.[n.02] The opening story, together with the discourse on the five kinds of teachers, is at Vin II 85–87.On one occasion the Blessed One was dwelling at Kosambī in Ghosita's Park. Now on that occasion Kakudha the Koliyan son, the Venerable Mahāmoggallāna's attendant, had recently died and been reborn among a certain group of mind-madedeities.[n.03]Manomayaṁ kāyaṁ upapanno. The mind-made deities are those reborn in the form realm through the power of their past attainment of the jhānas.His body was two or three times the size of the fields of a Magadhan village, but he did not obstruct either himself or others with that body.[n.04] On the size of his body, the text readsdve vā tīṇi vā māgadhikāni gāmakkhettāni. OngāmakkhettaBrahmāli writes: \"This word also occurs at MN III 0,:ekaṁ gāmakkhettaṁ upanissāya viharāma, and at MN II 67,27:amhākaṁ gāmakkhettaṁ āgacchanti. From these passages it seems quite clear to me thatgāmakkhettarefers to a villagetogether with allits fields\" (private communication). The figures for length given byMpsuggest that his body was 3–4.5 miles or 5–7 km tall.",
    "an5.100:2": "Then the young deva Kakudha approached the Venerable Mahāmoggallāna, paid homage to him, stood to one side, andsaid to him: \"Bhante, such a desire arose in Devadatta: ‘I will take charge of the Saṅgha of bhikkhus.’ And together with the arising of this thought, Devadatta lost that psychic potency.\"[n.1105] The text saystassā iddhiyā, \"that psychic potency,\" nottassa iddhiyā, \"his psychic potency.\" The pronoun refers to a psychic power already mentioned, yet the sutta does not make clear what it is. The context is provided by Vin II 184,33–185,1, where Devadatta exercises the psychic power of transforming himself into a young boy wearing a girdle of snakes. He used this power to impress Prince Ajātasattu and win his support. Thereupon Devadatta thought to wrest control of the Saṅgha from the Buddha, whereupon he lostthatpsychic potency.This is what the young deva Kakudha said. He then paid homage to the Venerable Mahāmoggallāna, circumambulated him keeping the right side toward him, and disappeared right there.",
    "an5.100:3-4": "Then the Venerable Mahāmoggallāna approached the Blessed One, paid homage to him, sat down to one side, and reported all that had happened.The Blessed One said:",
    "an5.100:5": "\"But, Moggallāna, have you encompassed his mind with your mind and understood of the young deva Kakudha: ‘Whatever the young deva Kakudha says is all true and not otherwise’?\"",
    "an5.100:6": "\"There are, Moggallāna, these five kinds of teachers found in the world. What five?",
    "an5.100:7": "(2) \"Again, some teacher whose livelihood is unpurified claims: ‘I am one whose livelihood is purified. My livelihood is purified, cleansed, undefiled.’ His disciples know him thus: ‘This honorable teacher, though of unpurified livelihood, claims: \"I am one whose livelihood is purified. My livelihood is purified, cleansed, undefiled.\" Now he would not like it if we were to report this to the laypeople. How can we treat him in a way that he would not like? Further, he is honored with robes, almsfood, lodgings, and medicines and provisions for the sick. A person will be known by what he himself does.’ His disciples cover up such a teacher with respect to his livelihood, and such a teacher expects to be covered up by his disciples with respect to his livelihood.",
    "an5.100:8": "(3) \"Again, some teacher whose Dhamma teaching is unpurified claims: ‘I am one whose Dhamma teaching is purified. My Dhamma teaching is purified, cleansed, undefiled.’ His disciples know him thus: ‘This honorable teacher, though of unpurified Dhamma teaching,claims: \"I am one whose Dhamma teaching is purified. My Dhamma teaching is purified, cleansed, undefiled.\" Now he would not like it if we were to report this to the laypeople. How can we treat him in a way that he would not like? Further, he is honored with robes, almsfood, lodgings, and medicines and provisions for the sick. A person will be known by what he himself does.’ His disciples cover up such a teacher with respect to his Dhamma teaching, and such a teacher expects to be covered up by his disciples with respect to his Dhamma teaching.",
    "an5.100:9": "(4) \"Again, some teacher whose explanations are unpurified[n.1107]Aparisuddhaveyyākaraṇo.Mpdoes not comment. Presumably, this refers to his explanation of a point in his teaching or his reply to a question.claims: ‘I am one whose explanations are purified. My explanations are purified, cleansed, undefiled.’ His disciples know him thus: ‘This honorable teacher, though giving unpurified explanations, claims: \"I am one whose explanations are purified. My explanations are purified, cleansed, undefiled.\" Now he would not like it if we were to report this to the laypeople. How can we treat him in a way that he would not like? Further, he is honored with robes, almsfood, lodgings, and medicines and provisions for the sick. A person will be known by what he himself does.’ His disciples cover up such a teacher with respect to his explanations, and such a teacher expects to be covered up by his disciples with respect to his explanations.",
    "an5.100:10": "(5) \"Again, some teacher whose knowledge and vision are unpurified claims: ‘I am one whose knowledge and vision are purified. My knowledge and vision are purified, cleansed, undefiled.’ His disciples know him thus: ‘This honorable teacher, though of unpurified knowledge and vision, claims: \"I am one whose knowledge and vision are purified. My knowledge and vision are purified, cleansed, undefiled.\" Now he would not like it if we were to report this to the laypeople. How can we treat him in a way that he would not like?Further, he is honored with robes, almsfood, lodgings, and medicines and provisions for the sick. A person will be known by what he himself does.’ His disciples cover up such a teacher with respect to his knowledge and vision, and such a teacher expects to be covered up by his disciples with respect to his knowledge and vision.",
    "an5.100:11": "(1) \"But, Moggallāna, I am one whose behavior is purified and I claim: ‘I am one whose behavior is purified. My behavior is purified, cleansed, undefiled.’ My disciples do not cover me up with respect to my behavior, and I do not expect to be covered up by my disciples with respect to my behavior. (2) I am one whose livelihood is purified and I claim: ‘I am one whose livelihood is purified. My livelihood is purified, cleansed, undefiled.’ My disciples do not cover me up with respect to my livelihood, and I do not expect to be covered up by my disciples with respect to my livelihood. (3) I am one whose Dhamma teaching is purified and I claim: ‘I am one whose Dhamma teaching is purified. My Dhamma teaching is purified, cleansed, undefiled.’ My disciples do not cover me up with respect to my Dhamma teaching, and I do not expect to be covered up by my disciples with respect to my Dhamma teaching. (4) I am one whose explanations are purified and I claim: ‘I am one whose explanations are purified. My explanations are purified, cleansed, undefiled.’ My disciples do not cover me up with respect to my explanations, and I do not expect to be covered up by my disciples with respect to my explanations. (5) I am one whose knowledge and vision are purified and I claim: ‘I am one whose knowledge and vision are purified. My knowledge and vision are purified, cleansed, undefiled.’ My disciples do not cover me up with respect to my knowledge and vision, and I do not expect to be covered up by my disciples with respect to my knowledge and vision.\""
}