{
    "an5.54:1": "\"Bhikkhus, there are these five unfavorable occasions for striving. What five?",
    "an5.54:2": "() \"Again, a bhikkhu is ill, overcome by illness. This is the second unfavorable occasion for striving.",
    "an5.54:3": "() \"Again, there is a famine, a poor harvest, a time when almsfood is difficult to obtain and it is not easy to subsist by means of gleaning.[n.1046]Na sukaraṁ uñchena paggahena yāpetun.I takeuñchena paggahenato denote a single act, not two acts. There is nocaorvāto suggest that two acts are intended. The gloss inMpalso implies that the expression refers to one act: \"It is not possible to take one's bowl and sustain oneself by the practice of gleaning\"(na sakkā hoti pattaṁ gahetvā uñchācariyāya yāpetuṁ). See too the gloss at Sp I 175,22–2:paggahena yo uñcho, tena yāpetuṁ na sukarā.This is the third unfavorable occasion for striving.",
    "an5.54:4": "() \"Again, there is peril, turbulence in the wilderness, and the people of the countryside, mounted on their vehicles, flee on all sides. This is the fourth unfavorable occasion for striving.",
    "an5.54:5": "() \"Again, there is a schism in the Saṅgha, and when there is a schism in the Saṅgha there are mutual insults, mutual reviling, mutual disparagement, and mutual rejection.[n.1047]Aññamaññaṁ akkosā ca honti, aññamaññaṁ paribhāsā ca honti, aññamaññaṁ parikkhepā ca honti, aññamaññaṁ pariccajā ca honti. A similar passage in It §§18–19, 10–11, hasaññamaññaṁ bhaṇḍanāni ceva hontiinstead ofaññamaññaṁ akkosā ca hontibut is otherwise the same. I translateparikkhepāandpariccajanāin accordance withIt-aI 69,2–27, which explainsparikkhepāas \"disparagement and denigration through the ten bases of insults, attacking all around in terms of birth and so forth\"(jāti-ādivasena parito khepā, dasahi akkosavatthūhi khuṁsanavambhanā), andpariccajanāas \"dismissal by way of disciplinary acts of suspension and so forth\"(ukkhepaniyakammakaraṇādivasena nissāraṇā).Then those without confidence do not gain confidence, while some of those with confidence change their minds.",
    "an5.54:6": "\"There are, bhikkhus, these five favorable occasions for striving. What five?",
    "an5.54:7": "(2) \"Again, a bhikkhu is seldom ill or afflicted, possessing an even digestion that is neither too cool nor too hot but moderate and suitable for striving. This is the second favorable occasion for striving.",
    "an5.54:8": "(3) \"Again, food is plentiful; there has been a good harvestand almsfood is abundant, so that one can easily sustain oneself by means of gleaning. This is the third favorable occasion for striving.",
    "an5.54:9": "(4) \"Again, people are dwelling in concord, harmoniously, without disputes, blending like milk and water, viewing each other with eyes of affection. This is the fourth favorable occasion for striving.",
    "an5.54:10": "(5) \"Again, the Saṅgha is dwelling at ease—in concord, harmoniously, without disputes, with a single recitation. When the Saṅgha is in concord, there are no mutual insults, no mutual reviling, no mutual disparagement, and no mutual rejection. Then those without confidence gain confidence and those with confidence increasein their confidence.[n.48] It might be asked whether the expressionpasannānañca bhiyyobhāvo hotimeans that the number of those with confidence increases, or, alternatively, that those with confidence increase in confidence.SpI 225,18–24, supports the latter: \"Laypeople who have confidence in the Teaching, seeing the bhikkhus following the training rules as they have been established, become ever more confident, saying: ‘The monks indeed do what is hard to do; for as long as they live they eat once a day, maintain celibacy, and observe the restraint of the Vinaya’\"(yepi sāsane pasannā kulaputtā tepi sikkhāpadapaññattiṁ ñatvā yathāpaññattaṁ paṭipajjamāne bhikkhū vā disvā \"aho ayyā dukkarakārino, ye yāvajīvaṁ ekabhattaṁ brahmacariyaṁ vinayasaṁvaraṁ anupālentī\" ti bhiyyo bhiyyo pasīdanti).This is the fifth favorable occasion for striving."
}