{
    "an5.34:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Then Sīha the general approachedthe Blessed One, paid homage to him, sat down to one side, and said:[n.0] He was originally a lay follower of the Jains. The story of his conversion is told atAN8.2.",
    "an5.34:2": "\"It is, Sīha,\" the Blessed One said.",
    "an5.34:3": "(2) \"Again, good persons resort to a donor, a munificent giver. This, too, is a directly visible fruit of giving.",
    "an5.34:4": "(3) \"Again, a donor, a munificent giver, acquires a good reputation. This, too, is a directly visible fruit of giving.",
    "an5.34:5": "(4) \"Again, whatever assembly a donor, a munificent giver, approaches—whether of khattiyas, brahmins, householders, or ascetics—he approaches it confidently and composed.[n.1013]Visārado upasaṅkamati amaṅkubhūto.Mpexplains \"confidently\"(visārado)as knowledgeable and joyous(ñāṇasomanassappatto)and \"composed\"(amaṅkubhūto)as not diffident(na nittejabhūto).This too is a directly visible fruit of giving.",
    "an5.34:6": "(5) \"Again, with the breakup of the body, after death, a donor, a munificent giver, is reborn in a good destination, in a heavenly world. This is a fruit of giving pertaining to future lives.\"[n.1014]Samparāyikaṁ dānaphalaṁ. With this fifth benefit, the Buddha has gone beyond Sīha's original request and explained, not a directly visible fruit of giving, but a fruit pertaining to the next life.",
    "an5.34:7": "When this was said, Sīha the general said to the Blessed One: \"Bhante, I do not go by faith in the Blessed One concerning those four directly visible fruits of giving declared by him. I know them, too. For I am a donor, a munificent giver, and I am dear and agreeable to many people. I am a donor, a munificent giver, and many good persons resort to me. I am a donor, a munificent giver, and I have acquired a good reputation as a donor, sponsor, and supporter of the Saṅgha. Iam a donor, a munificent giver, and whatever assembly I approach—whether of khattiyas, brahmins, householders, or ascetics—I approach it confidently and composed. I do not go by faith in the Blessed One concerning these four directly visible fruits of giving declared by him. I know them, too. But when the Blessed One tells me: ‘Sīha, with the breakup of the body, after death, a donor, a munificent giver, is reborn in a good destination, in a heavenly world,’ I do not know this, and here I go by faith in the Blessed One.\"",
    "an5.34:8": "By giving, he becomes dear and many resort to him.He attains a good reputation and his fame increases.The generous man is composedand confidently enters the assembly.",
    "an5.34:9": "Therefore, seeking happiness,wise persons give gifts,having removed the stain of miserliness.When they are settled in the triple heaven,for a long time they delightin companionship with the devas.",
    "an5.34:10": "Having taken the opportunity to do wholesome deeds,passing from here, self-luminous, they roam in Nandana,[n.15]Nandana: the Garden of Delight in the Tāvatiṁsa heaven.where they delight, rejoice, and enjoy themselves,furnished with the five objects of sensual pleasure.Having fulfilled the word of the unattached Stable One,the Fortunate One's disciples rejoice in heaven."
}