{
    "an5.140:1": "\"Bhikkhus, possessing five factors, a king's bull elephant is worthy of a king, an accessory of a king, and reckoned as a factor of kingship. What five? Here, a king's bull elephant is one who listens, who destroys, who guards, who patiently endures, and who goes.",
    "an5.140:2": "(1) \"And how is a king's bull elephant one who listens? Here, whatever task the elephant trainer sets for it, whether or notit has ever done it before, the king's bull elephant heeds it, attends to it, directs its whole mind to it, and listens with eager ears. It is in this way that a king's bull elephant is one who listens.",
    "an5.140:3": "(2) \"And how is a king's bull elephant one who destroys? Here, when a king's bull elephant has entered the battle, it destroys elephants and elephant riders, horses and cavalry, chariots and charioteers, and infantry. It is in this way that a king's bull elephant is one who destroys.",
    "an5.140:4": "(3) \"And how is a king's bull elephant one who guards? Here, when the king's bull elephant has entered a battle, it guards its front quarters, its back quarters, its front feet, its back feet, its head, its ears, its tusks, its trunk, its tail, and its rider. It is in this way that a king's bull elephant is one who guards.",
    "an5.140:5": "(4) \"And how is a king's bull elephant one who patiently endures? Here, when a king's bull elephant has entered the battle, it patiently endures being struck by spears, swords, arrows, and axes; it endures the sounds of drums, kettledrums, conches, and tom-toms. It is in this way that a king's bull elephant is one who patiently endures.",
    "an5.140:6": "(5) \"And how is a king's bull elephant one who goes? Here, the king's bull elephant quickly goes to whatever region the elephant trainer sends it, whether or not it has ever gone there before. It is in this way that a king's bull elephant is one who goes.",
    "an5.140:7": "\"Possessing these five factors, a king's bull elephant is worthy of a king, an accessory of a king, and reckoned as a factor of kingship.",
    "an5.140:8": "\"So too, bhikkhus, possessing five qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What five? Here, a bhikkhu is one who listens, who destroys,who guards, who patiently endures, and who goes.",
    "an5.140:9": "(1) \"And how is a bhikkhu one who listens? Here, when the Dhamma and discipline proclaimed by the Tathāgata is being taught, a bhikkhu heeds it, attends to it, directs his whole mind to it, and listens to the Dhamma with eager ears. It is in this way that a bhikkhu is one who listens.",
    "an5.140:10": "(2) \"And how is a bhikkhu one who destroys? Here, a bhikkhu does not tolerate an arisen sensual thought, but abandons it, dispels it, terminates it, and obliterates it. He does not tolerate an arisen thought of ill will … an arisen thought of harming … any other bad unwholesome states that arise from time to time, but abandons them, dispels them, terminates them, and obliterates them. It is in this way that a bhikkhu is one who destroys.",
    "an5.140:11": "(3) \"And how is a bhikkhu one who guards? Here, having seen a form with the eye, a bhikkhu does not grasp its marks and features. Since, if he left the eye faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the eye faculty, he undertakes the restraint of the eye faculty. Having heard a sound with the ear … Having smelled an odour with the nose … Having tasted a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind … he guards the mind faculty, he undertakes the restraint of the mind faculty. It is in this way that a bhikkhu is one who guards.",
    "an5.140:12": "(4) \"And how is a bhikkhu one who patiently endures? Here, a bhikkhu patiently endures cold and heat; hunger and thirst; contact with flies, mosquitoes, wind, the burning sun, and serpents; rude and offensive ways of speech; he is able to bear up with arisen bodily feelings that are painful, racking, sharp, piercing, harrowing, disagreeable, sapping one's vitality. It is in this way that a bhikkhu is one who patiently endures.",
    "an5.140:13": "(5) \"And how is a bhikkhu one who goes?Here, a bhikkhu is one who quickly goes to that region where he has never before gone in this long time, that is, to the stilling of all activities, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, nibbāna. It is in this way that a bhikkhu is one who goes.",
    "an5.140:14": "\"Possessing these five qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.\""
}