{
    "an5.116:1": "\"Bhikkhus, possessing five qualities, a bhikkhunī is deposited in hell as if brought there. What five? () Without investigating and scrutinizing, she speaks praise of one who deserves dispraise. (2) Without investigating and scrutinizing, she speaks dispraise of one who deserves praise. (3) Without investigating and scrutinizing, she believes a matter that merits suspicion. (4) Without investigating and scrutinizing, she is suspicious about a matter that merits belief. (5) She squanders gifts given out of faith.[n.24]Saddhādeyyaṁ vinipāteti.Mp:\"When she is given almsfood by others out of faith, without taking the top portionfor herself, she gives it to someone else.\" The rule against squandering gifts given out of faith is at Vin I 298,–3: \"Bhikkhus, a gift given out of faith should not be squandered. For one who squanders it, there is an offense of wrongdoing\"(na ca bhikkhave saddhādeyyaṁ vinipātetabbaṁ; yo vinipāteyya, āpatti dukkaṭassa). This is an offense because it shows disregard for the generosity of others. After taking the top portion for oneself, however, one can share the rest with others. The Buddha also made a unique allowance for a monastic to give almsfood, cloth, and other gains to his or her parents if they are in need.Possessing these five qualities, a bhikkhunī is deposited in hell as if brought there.",
    "an5.116:2": "\"Bhikkhus, possessing fiveotherqualities, a bhikkhunī is deposited in heaven as if brought there. What five? (1) Having investigated and scrutinized, she speaks dispraise of one who deserves dispraise. () Having investigated and scrutinized, she speaks praise of one who deserves praise.(3) Having investigated and scrutinized, she is suspicious about a matter that merits suspicion. (4) Having investigated and scrutinized, she believes a matter that merits belief. (5) She does not squander gifts given out of faith. Possessing these five qualities, a bhikkhunī is deposited in heaven as if brought there.\""
}