{
    "an5.33:1": "On one occasion the Blessed One was dwelling at Bhaddiya in the Jātiyā Grove. Then Uggaha, Meṇḍaka's grandson, approached the Blessed One, paid homage to him, sat down to one side, and said to the Blessed One:",
    "an5.33:2": "\"Bhante, let the Blessed One together with three other monks[n.1008]Attacatuttho. Lit., \"(with)-self-(as)-fourth,\" meaning that the Buddha is invited with three monks accompanying him.consent to accept tomorrow'smeal from me.\"",
    "an5.33:3": "Then, when the night had passed, in the morning the Blessed One dressed, took his bowl and robe, and went to Uggaha's residence, where he sat down on the appointed seat. Then, with his own hands, Uggaha, Meṇḍaka's grandson, served and satisfied the Blessed One with various kinds of delicious food.",
    "an5.33:4": "The Blessed One then said to those girls:",
    "an5.33:5": "(2) \"And you should train yourselves thus: ‘We will honor, respect, esteem, and venerate those whom our husband respects—his mother and father, ascetics and brahmins—and when they arrive we will offer them a seat and water.’ Thus should you train yourselves.",
    "an5.33:6": "(3) \"And you should train yourselves thus: ‘We will be skillful and diligent in attending to our husband's domestic chores, whether knitting or weaving; we will possess sound judgment about them in order to carry out and arrange them properly.’ Thus should you train yourselves.",
    "an5.33:7": "(4) \"And you should train yourselves thus: ‘We will find out what our husband's domestic helpers—whether slaves, messengers, orworkers—have done and left undone; we will find out the condition of those who are ill; and we will distribute to each an appropriate portion of food.’ Thus should you train yourselves.",
    "an5.33:8": "(5) \"And you should train yourselves thus: ‘We will guard and protect whatever income our husband brings home—whether money or grain, silver or gold—and we will not be spendthrifts, thieves, wastrels, or squanderers of his earnings.’ Thus should you train yourselves.",
    "an5.33:9": "She does not despise her husband,the man who constantly supports her,who ardently and eagerlyalways brings her whatever she wants.",
    "an5.33:10": "She rises early, works diligently,manages the domestic help;she treats her husband in agreeable waysand safeguards the wealth he earns.",
    "an5.33:12": "The woman who fulfills her duties thus,following her husband's will and wishes,is reborn among the devascalled \"the agreeable ones.\""
}