{
    "an5.162:1": "There the Venerable Sāriputta addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an5.162:2": "\"Friends, there are these five ways of removing resentment by which a bhikkhu should entirely remove resentment when it has arisen toward anyone. What five? (1) Here, a person's bodily behavior is impure, but his verbal behavior is pure; one should remove resentment toward such a person. () A person's verbal behavior is impure, but his bodily behavior is pure; one should also remove resentment toward such a person. (3) A person's bodily behavior and verbal behavior are impure, but from time to time he gains an opening of the mind, placidity of mind;[n.1158]Labhati ca kālena kālaṁ cetaso vivaraṁ cetaso pasādaṁ.Mp:\"From time to time he gains an opening of the mind, that is, an opportunity arises in his mind for serenity and insight, and he gains placidity, which consists in the achievement of faith\"(kāle kāle samathavipassanācittassa uppannokāsasaṅkhātaṁ vivarañceva saddhāsampannabhāvasaṅkhātaṁ pasādañca labhati).one should also remove resentment toward such a person. (4) A person's bodily behavior and verbal behavior are impure, and he does not gainan opening of the mind, placidity of mind from time to time; one should also remove resentment toward such a person. (5) A person's bodily behavior and verbal behavior are pure, and from time to time he gains an opening of the mind, placidity of mind; one should also remove resentment toward such a person.",
    "an5.162:3": "(1) \"How, friends, should resentment be removed toward the person whose bodily behavior is impure but whose verbal behavior is pure? Suppose a rag-robed bhikkhu sees a rag by the roadside. He would press it down with his left foot, spread it out with his right foot, tear off an intact section, and take it away with him; so too, when a person's bodily behavior is impure but his verbal behavior is pure, on that occasion one should not attend to the impurity of his bodily behavior but should instead attend to the purity of his verbal behavior. In this way resentment toward that person should be removed.",
    "an5.162:4": "(2) \"How, friends, should resentment be removed toward the person whose verbal behavior is impure but whose bodily behavior is pure? Suppose there is a pond covered with algae and water plants. A man might arrive, afflicted and oppressed by the heat, weary, thirsty, and parched. He would plunge into the pond, sweep away the algae and water plants with his hands, drink from his cupped hands, and then leave; so too,when a person's verbal behavior is impure but his bodily behavior is pure, on that occasion one should not attend to the impurity of his verbal behavior but should instead attend to the purity of his bodily behavior. In this way resentment toward that person should be removed.",
    "an5.162:5": "(3) \"How, friends, should resentment be removed toward the person whose bodily behavior and verbal behavior are impure but who from time to time gains an opening of the mind, placidity of mind? Suppose there is a little water in a puddle. Then a person might arrive, afflicted and oppressed by the heat, weary, thirsty, and parched. He would think: ‘This little bit of water is in the puddle. If I try to drink it with my cupped hands or a vessel, I will stir it up, disturb it, and make it undrinkable. Let me get down on all fours, suck it up like a cow, and depart.’ He then gets down on all fours, sucks the water up like a cow, and departs. So too, when a person's bodily behavior and verbal behavior are impure but from time to time he gains an opening of the mind, placidity of mind, on that occasion one should not attend to the impurity of his bodily and verbal behavior, but should instead attendto the opening of the mind, the placidity of mind, he gains from time to time. In this way resentment toward that person should be removed.",
    "an5.162:6": "(4) \"How, friends, should resentment be removed toward the person whose bodily and verbal behavior are impure and who does not gain an opening of the mind, placidity of mind, from time to time? Suppose a sick, afflicted, gravely ill person was traveling along a highway, and the last village behind him and the next village ahead of him were both far away. He would not obtain suitable food and medicine or a qualified attendant; he would not getto meetthe leader of the village district. Another man traveling along the highway might see him and arouse sheer compassion, sympathy, and tender concern for him, thinking: ‘Oh, may this man obtain suitable food, suitable medicine, and a qualified attendant! May he getto meetthe leader of the village district! For what reason? So that this man does not encounter calamity and disaster right here.’ So too, when a person's bodily and verbal behavior are impure and he does not gain from time to time an opening of the mind, placidity of mind, on that occasion one should arouse sheer compassion, sympathy, and tender concern for him, thinking, ‘Oh, may this venerable one abandon bodily misbehavior and develop good bodily behavior; may he abandon verbal misbehavior and develop good verbal behavior; may he abandon mental misbehavior and develop good mental behavior! For what reason? So that, with the breakup of the body, after death, he will not be reborn in the plane of misery, in a bad destination, in the lower world, in hell.’ In this way resentment toward that person should be removed.",
    "an5.162:7": "(5) \"How, friends, should resentment be removed toward the person whose bodily and verbal behavior are pure and who from time to time gains an opening of the mind, placidity of mind? Suppose there were a pond with clear, sweet, cool water, clean, with smooth banks, a delightful place shaded by various trees. Then a man might arrive, afflicted and oppressed by the heat, weary, thirsty, and parched. Having plunged into the pond, he would bathe and drink, and then, after coming out, he would sit or lie down in the shade of a tree right there.",
    "an5.162:8": "So too, when a person's bodily and verbal behavior are pure and from time to time he gains an opening of the mind, placidity of mind, on that occasion one should attend to his pure bodily behavior, to his pure verbal behavior, and to the opening of the mind, the placidity of mind, that he gains from time to time. In this way resentment toward that person should be removed. Friends, by means of a person who inspires confidence in every way, the mind gains confidence.[n.1159]Samantapāsādikaṁ āvuso puggalaṁ āgamma cittaṁ pasīdati.This is apparently referring to the fifth type of person. Since his behavior and mind are both pure, one can easily dispel resentment toward him and settle down into a state of trust and tranquility.",
    "an5.162:9": "\"These, friends, are the five ways of removing resentment by means of which a bhikkhu can entirely remove resentment toward whomever it has arisen.\""
}