{
    "an5.31:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then Princess Sumanā,[n.000]Mpidentifies her as a daughter of King Pasenadi of Kosala.accompanied by five hundred chariots and five hundred court girls, approached the Blessed One, paid homage to him, and sat down to one side. Princess Sumanā then said to the Blessed One:",
    "an5.31:2": "\"Here, Bhante, there might be two disciples of the Blessed One equal in faith, virtuous behavior, and wisdom, but one is generous while the other is not. With the breakup of the body,after death, they would both be reborn in a good destination, in a heavenly world. When they have become devas, would there be any distinction or difference between them?\"",
    "an5.31:3": "\"There would be, Sumanā,\" the Blessed One said. \"The generous one, having become a deva, would surpass the other in five ways: in celestial life span, celestial beauty, celestial happiness, celestial glory, and celestial authority. The generous one, having become a deva, would surpass the other in these five ways.\"",
    "an5.31:5": "\"But, Bhante, if these two should go forth from the household life into homelessness, would there still be some distinction or difference between them?\"",
    "an5.31:6": "\"But, Bhante, if both attain arahantship, would there still be some distinction or difference between them after they have attained arahantship?\"",
    "an5.31:7": "\"It's astounding and amazing, Bhante! Truly, one has good reason to give alms and do meritorious deeds, since they will be helpful if one becomes a deva,againbecomes a human being, or goes forth.\"",
    "an5.31:8": "This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this:",
    "an5.31:9": "\"As the stainless moonmoving through the sphere of spaceoutshines with its radianceall the stars in the world,",
    "an5.31:10": "so one accomplished in virtuous behavior,a person endowed with faith,outshines by generosityall the misers in the world.",
    "an5.31:11": "\"As the hundred-peaked rain cloud,thundering, wreathed in lightning,pours down rain upon the earth,inundating the plains and lowlands,",
    "an5.31:12": "so the Perfectly Enlightened One's disciple,the wise one accomplished in vision,surpasses the miserly personin five specific respects:",
    "an5.31:13": "life span and glory,beauty and happiness.[n.1002] Only four kinds of superiority are mentioned, unless the fifth is wealth(bhoga)rather than authority(ādhipateyya), as mentioned in the following couplet.Possessed of wealth, after deathhe rejoices in heaven.\""
}