{
    "an5.75:1": "\"Bhikkhus, there are these five kinds of warriors found in the world. What five?",
    "an5.75:2": "() \"Again, some warrior can endure the cloud of dust, but when he sees the crests of the standards, he sinks, founders, does not brace himself, and cannot enter the battle. There is, bhikkhus, such a warrior here. This is the second kind of warrior found in the world.",
    "an5.75:3": "() \"Again, some warrior can endure the cloud of dust and the crests of the standards, but when he hears the uproar, he sinks, founders, does not brace himself, and cannot enter the battle. There is, bhikkhus, such a warrior here. This is the third kind of warrior found in the world.",
    "an5.75:4": "() \"Again, some warrior can endure the cloud of dust, the crests of the standards, and the uproar, but he is struck down and wounded by blows. There is, bhikkhus, such a warrior here. This is the fourth kind of warrior found in the world.",
    "an5.75:5": "() \"Again, some warrior can endure the cloud of dust, the crests of the standards, the uproar,and the blows. Having triumphed in that battle, he emerges victorious and settles at the head of the battlefield. There is, bhikkhus, such a warrior here. This is the fifth kind of warrior found in the world.",
    "an5.75:6": "\"So too, there are these five kinds of persons similar to warriors found among the bhikkhus. What five?",
    "an5.75:7": "This is the cloud of dust in his case. I say that this person is just like the warrior who, when he sees the cloud of dust, sinks, founders, does not brace himself, and cannot enter the battle. There is, bhikkhus, such a person here. This is the first kind of person similar to a warrior found among the bhikkhus.",
    "an5.75:8": "(2) \"Again, some bhikkhu can endure the cloud of dust, but when he sees the crests of the standards, he sinks, founders, does not brace himself, and cannot maintain the spiritual life. He discloses his weakness in the training, gives up the training, and reverts to the lower life. What are the crests of the standards in his case? The bhikkhu does not hear: ‘In such and such a village or town the women or girls are beautiful, attractive, graceful, possessing supreme beauty of complexion,’ but he himself sees a woman or a girl who is beautiful, attractive, graceful, possessing supreme beauty of complexion. Having seen her, he sinks, founders, does not brace himself, andcannot maintain the spiritual life. He discloses his weakness in the training, gives up the training, and reverts to the lower life. These are the crests of the standards in his case.",
    "an5.75:9": "I say that this person is just like the warrior who can endure the cloud of dust, but when he sees the crests of the standards, he sinks, founders, does not brace himself, and cannot enter the battle. There is, bhikkhus, such a person here. This is the second kind of person similar to a warrior found among the bhikkhus.",
    "an5.75:10": "(3) \"Again, some bhikkhu can endure the cloud of dust and the crests of the standards, but when he hears the uproar, he sinks, founders, does not brace himself, and cannot maintain the spiritual life. He discloses his weakness in the training, gives up the training, and reverts to the lower life. What is the uproar in his case? When the bhikkhu has gone to the forest, to the foot of a tree, or to an empty hut, a woman approaches him, smiles at him, chats with him, laughs at him, and teases him. As the woman is smiling at him, chatting with him, laughing at him, and teasing him, he sinks, founders, does not brace himself, and cannot maintain the spiritual life. He discloses his weakness in the training, gives up the training, and reverts to the lower life. This is the uproar in his case.",
    "an5.75:11": "I say that this person is just like the warrior who can endure the cloud of dust and the crests of the standards, but when he hears the uproar, he sinks, founders, does not brace himself, and cannot enter the battle. There is, bhikkhus, such a person here. This is the third kind of person similar to a warrior found among the bhikkhus.",
    "an5.75:12": "(4) \"Again, some bhikkhu can endure the cloud of dust, the crests of the standards, and the uproar, but he is struck down and wounded by a blow. What is the blow in his case? When the bhikkhu has gone to the forest, to the foot of a tree,or to an empty hut, a woman approaches him, sits down or lies down next to him, and embraces him. When she does so, he has sexual intercourse with her without having given up the training and disclosed his weakness. This is the blow in his case.",
    "an5.75:13": "I say that this person is just like the warrior who can endure the cloud of dust, the crests of the standards, and the uproar, but who is struck down and wounded by a blow. There is, bhikkhus, such a person here. This is the fourth kind of person similar to a warrior found among the bhikkhus.",
    "an5.75:14": "(5) \"Again, some bhikkhu can endure the clouds of dust, the crests of the standards, the uproar, and a blow. Having triumphed in that battle, he emerges victorious and settles at the head of the battlefield. What is the victory in his case? When the bhikkhu has gone to the forest, to the foot of a tree, or to an empty hut, a woman approaches him, sits down or lies down next to him, and embraces him. But he disentangles himself, frees himself, and goes off wherever he wants.",
    "an5.75:15": "\"He resorts to a secluded lodging: the forest, the foot of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle highland, the open air, a heap of straw. Gone to the forest, to the foot of a tree, or to an empty hut, he sits down, folding his legs crosswise, straightening his body, and establishing mindfulness in front of him. Having abandoned longing for the world, he dwells with a mind free from longing; he purifies his mind from longing. Having abandoned ill will and hatred, he dwells with a mind free from ill will, compassionate toward all living beings; he purifies his mind from ill will and hatred. Having abandoned dullness and drowsiness, he dwells free from dullness and drowsiness, percipient of light, mindful and clearly comprehending; he purifies his mind from dullness and drowsiness. Having abandoned restlessness and remorse, he dwells without agitation, with a mind inwardly peaceful; he purifies his mind from restlessness and remorse. Having abandoned doubt, he dwells having gone beyond doubt,unperplexed about wholesome qualities; he purifies his mind from doubt.",
    "an5.75:16": "\"When his mind is thus concentrated, purified, cleansed, unblemished, rid of defilement, malleable, wieldy, steady, and attained to imperturbability, he directs it to the knowledge of the destruction of the taints.[n.1080] I followBeand Ee, which do not have ellipsis points here. Ce inconsistently has ellipsis points in this sutta (implying that all threevijjāare intended) but not in the parallel section of the next sutta.He understands as it really is: ‘This is suffering.’ He understands as it really is: ‘This is the origin of suffering.’ He understands as it really is: ‘This is the cessation of suffering.’ He understands as it really is: ‘This is the way leading to the cessation of suffering.’ He understands as it really is: ‘These are the taints.’ He understands as it really is: ‘This is the origin of the taints.’ He understands as it really is: ‘This is the cessation of the taints.’ He understands as it really is: ‘This is the way leading to the cessation of the taints.’ When he knows and sees thus, his mind is liberated from the taint of sensual desire, from the taint of existence, and from the taint of ignorance. When it is liberated, there comes the knowledge: ‘It'sliberated.’ He understands: ‘Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.’ This is his victory in battle.",
    "an5.75:17": "\"Bhikkhus, I say that this person is like the warrior who can endure the cloud of dust, the crests of the standards, the uproar, and the blow, and who, having triumphed in that battle, emerges victorious and settles at the head of the battlefield. There is, bhikkhus, such a person here. This is the fifth kind of person similar to a warrior found among the bhikkhus."
}