{
    "an5.43:1": "Then the householder Anāthapiṇḍika approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "an5.43:2": "\"Householder, there are these five things that are wished for, desired, agreeable, and rarely gained in the world. What five? Long life, householder, is wished for, desired, agreeable, and rarely gained in the world. Beauty … Happiness … Fame … The heavens are wished for, desired, agreeable, and rarely gained in the world. These are the five things that are wished for, desired, agreeable, and rarely gained in the world.[n.10] Compare with the opening ofAN4.61.",
    "an5.43:3": "\"These five things, householder, that are wished for, desired, agreeable, and rarely gained in the world, I say, are not obtained by means of prayers or aspirations. If these five things that are wished for, desired, agreeable, and rarely gained in the world could be obtained by means of prayersor aspirations, who here would be lacking in anything?",
    "an5.43:4": "(1) \"Householder, the noble disciple who desires long life ought not to pray for long life or delight in it orpassivelyyearn for it.[n.1023] In each paragraph, I read withCevā pihetuṁ, as against Bevāpi hetu, Eevā pi hetuṁ. The verbpiheti(infinitivepihetuṁ)means \"to yearn for.\" The idea of passively yearning seems implied by the contrast with practicing the way as a means of fulfilling one's wish.A noble disciple who desires long life should practice the way conducive to long life.[n.102]Āyusaṁvattanikā paṭipadā.Mp:\"The meritorious practice of giving, virtuous behavior, etc.\" For an analysis of the specific relationship between present actions and their results, seeMN 135.For when he practices the way conducive to long life, it leads to obtaining long life, and he gains long life either celestial or human.",
    "an5.43:5": "(2) \"Householder, the noble disciple who desires beauty …",
    "an5.43:6": "(3) … who desires happiness …",
    "an5.43:7": "(4) … who desires fame ought not to pray for fame or delight in it orpassivelyyearn for it. A noble disciple who desires fame should practice the way conducive to fame. For when he practices the way conducive to fame, it leads to obtaining fame, and he gains fame either celestial or human.",
    "an5.43:8": "(5) \"Householder, the noble disciple who desires the heavens ought not to pray for the heavens or delight in them orpassivelyyearn for them. A noble disciple who desires the heavens should practice the way conducive to heaven. For when he practices the way conducive to heaven, it leads to obtaining the heavens, and he gains the heavens.\"[n.1025] The text switches back and forth between singular and plural forms ofsagga.",
    "an5.43:9": "For one desiring long life, beauty, fame,[n.1026] These verses are also at SN3:17, I 87; SN3:18, I 8.acclaim, heaven, high families,and lofty delightsfollowing in succession,the wise praise heedfulnessin doing deeds of merit.",
    "an5.43:10-11": "Being heedful, the wise personsecures both kinds of good:the good in this life,and the good of the future life.By attaining the good,[n.1027]Atthābhisamayā. I base this rendering on the gloss inMp:Atthassa abhisamāgamena, atthappaṭilābhenā ti vuttaṁ hoti.the steadfast oneis called one of wisdom."
}