{
    "an5.32:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the squirrel sanctuary. Then Princess Cundī,[n.004]Mp,commenting on the preceding sutta, says she was a daughter of King Bimbisāra.accompanied by five hundred chariots and five hundred court girls, approached the Blessed One, paid homage to him, and sat down to one side. Princess Cundī then said to the Blessed One:",
    "an5.32:2": "\"Bhante, my brother is Prince Cunda. He says thus: ‘Whenever a man or a woman has gone for refuge to the Buddha, the Dhamma, and the Saṅgha, and abstains from the destruction of life, from taking what is not given, from sexual misconduct, from false speech, and from indulging in liquor, wine, and intoxicants, the basis for heedlessness, with the breakup of the body, after death, he is reborn only in a good destination, not in a bad destination.’ I ask the Blessed One: ‘What kind of teacher, Bhante, should one have confidence in, so that, with the breakup of the body, after death, one is reborn only in a good destination, not in a bad destination? What kind of Dhamma should one have confidence in, so that, with the breakup of the body, after death, one is reborn only in a good destination, not in a bad destination? What kind of Saṅgha should one have confidence in, so that, with the breakup of the body, after death, one is reborn only in a good destination, not in a bad destination? What kind of virtuous behavior should one fulfill so that, with the breakup of the body, after death, one is reborn only in a good destination, not in a bad destination?\"",
    "an5.32:3": "(1) \"Cundī, to whatever extent there are beings, whether footless or with two feet, four feet, or many feet, whether having form or formless, whether percipient, non-percipient, or neither percipient nor non-percipient, the Tathāgata, the Arahant, the Perfectly Enlightened One is declared the foremost among them. Those who have confidence in the Buddha have confidence in the foremost, and for those who have confidence in the foremost, the result is foremost.",
    "an5.32:4": "(2) \"To whatever extent, Cundī, there are phenomena that are conditioned, the noble eightfold path is declared the foremost among them. Those who have confidence in the noble eightfold path have confidence in the foremost, and for those who have confidence in the foremost, the result is foremost.[n.1005] Strangely, neitherCenor Ee contains this paragraph, which is in Be. It seems necessary to complete the set of five items. The paragraph is found in all three editions of the Fours. The parallel It §90, 88, does not include this paragraph, but It §90 is included in the Threes and thus must limit itself to three objects of faith.",
    "an5.32:5": "(3) \"To whatever extent, Cundī, there are phenomena whether conditioned or unconditioned, dispassion is declared the foremost among them, that is, the crushing of pride, the removal of thirst, the uprooting of attachment, the termination of the round, the destruction of craving, dispassion, cessation, nibbāna. Those whohave confidence in the Dhamma, in dispassion,[n.1006]Virāge dhamme. The parallel statement atAN4.34has onlyvirāge, but It §90 hasvirāge dhamme.have confidence in the foremost, and for those who have confidence in the foremost, the result is foremost.",
    "an5.32:6": "(4) \"To whatever extent, Cundī, there are Saṅghas or groups, the Saṅgha of the Tathāgata's disciples is declared the foremost among them, that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world. Those who have confidence in the Saṅgha have confidence in the foremost, and for those who have confidence in the foremost, the result is foremost.",
    "an5.32:7": "(5) \"To whatever extent, Cundī, there is virtuous behavior, the virtuous behavior loved by the noble ones is declared the foremost among them, that is, when it is unbroken, flawless, unblemished, unblotched, freeing, praised by the wise, ungrasped, leading to concentration. Those who fulfill the virtuous behavior loved by the noble ones fulfill the foremost, and for those who fulfill the foremost, the result is foremost.\"",
    "an5.32:8": "For those confident in regard to the foremost,[n.1007] These verses are also atAN4.34.knowing the foremost Dhamma,confident in the Buddha—the foremost—unsurpassed, worthy of offerings;",
    "an5.32:9": "for those confident in the foremost Dhamma,in the blissful peace of dispassion;for those confident in the foremost Saṅgha,the unsurpassed field of merit;",
    "an5.32:10": "for those giving gifts to the foremost,the foremost kind of merit increases:the foremost life span, beauty, and glory,good reputation, happiness, and strength.",
    "an5.32:11": "The wise one who gives to the foremost,concentrated upon the foremost Dhamma,having become a deva or human being,rejoices having attained the foremost."
}