{
    "an5.166:1": "There the Venerable Sāriputta … said this:",
    "an5.166:2": "When this was said, the Venerable Udāyī said to the Venerable Sāriputta: \"This is impossible, friend Sāriputta, it cannot happen that a bhikkhu, having been reborn among a certain group of mind-madedeitiesthat transcend the company of devas that subsist on edible food, mightagainenter and emerge from the cessation of perception and feeling. There is no such possibility.\"",
    "an5.166:3": "A second time … A third time,the Venerable Sāriputta said: \"Here, friends, it is possible that a bhikkhu accomplished in virtuous behavior … having been reborn among a certain group of mind-madedeities… mightagainenter and emerge from the cessation of perception and feeling. There is this possibility.\"",
    "an5.166:4": "A third time, the Venerable Udāyī said to the Venerable Sāriputta: \"This is impossible, friend Sāriputta, it cannot happen that a bhikkhu, having been reborn among a certain group of mind-madedeities… mightagainenter and emerge from the cessation of perception and feeling. There is no such possibility.\"",
    "an5.166:5": "Then it occurred to the Venerable Sāriputta: \"The Venerable Udāyī has rejected me up to the third time, and not a single bhikkhu expresses agreement with me. Let me approach the Blessed One.\" Then the Venerable Sāriputta approached the Blessed One, paid homage to him, sat down to one side, and addressed the bhikkhus: \"Here, friends, a bhikkhu accomplished in virtuous behavior, concentration, and wisdom mightagainenter and emerge from the cessation of perception and feeling. There is this possibility. If he does not reach final knowledge in this very life, having been reborn among a certain group of mind-madedeitiesthat transcend the company of devas that subsist on edible food, he mightagainenter and emerge from the cessation of perception and feeling. There is this possibility.\"",
    "an5.166:6": "When this was said, the Venerable Udāyī said to the Venerable Sāriputta: \"This is impossible, friend Sāriputta, it cannot happen that a bhikkhu, having been reborn among a certain group of mind-madedeitiestranscending the company of devas that subsist on edible food, mightagainenter and emerge from the cessation of perception and feeling. There is no such possibility.\"",
    "an5.166:7": "A second time … A third time, the Venerable Sāriputta addressed the bhikkhus: \"Here, friends, a bhikkhu accomplished in virtuous behavior …… having been reborn among a certain group of mind-madedeities… mightagainenter and emerge from the cessation of perception and feeling. There is this possibility.\"",
    "an5.166:8": "A third time, the Venerable Udāyī said to the Venerable Sāriputta: \"This is impossible, friend Sāriputta, it cannot happen that a bhikkhu … reborn among a certain group of mind-madedeities… mightagainenter and emerge from the cessation of perception and feeling. There is no such possibility.\"",
    "an5.166:9": "Then it occurred to the Venerable Sāriputta: \"Even when I am in the presence of the Blessed One, the Venerable Udāyī rejects me up to the third time, and not a single bhikkhu expresses agreement with me. Let me just keep silent.\" Then the Venerable Sāriputta fell silent.",
    "an5.166:10": "Then the Blessed One addressed the Venerable Udāyī: \"Udāyī, just what do you understand by a mind-made group?\"",
    "an5.166:11": "Then the Blessed One addressed the Venerable Ānanda: \"Ānanda, do you just look on passively as an elder bhikkhu is being harassed? Don’t you have any compassion toward an elder bhikkhu when he's being harassed?\"",
    "an5.166:12": "Then the Blessed One addressed the bhikkhus: \"Here, bhikkhus, a bhikkhu accomplished in virtuous behavior, concentration, and wisdom might enter and emerge from the cessation of perception and feeling. If he does not reach final knowledge in this very life, then, having been reborn among a certain group of mind-madedeitiesthat transcend the company of devas that subsist on edible food, he mightagainenter and emerge from the cessation of perception and feeling. There is this possibility.\" This is what the Blessed One said. Having said this, the Fortunate One got up from his seat and entered his dwelling.",
    "an5.166:13": "Then, not long after the Blessed One had left, the Venerable Ānanda approached the Venerable Upavāṇa and said to him: \"Here, friend Upavāṇa, they were harassing other elder bhikkhus, but we didn’t question them.[n.1162] I read withCeand Eemayaṁ te na pucchāma, as against Bemayaṁ tena na muccāma.It would not be surprising if this evening, when he emerges from seclusion, the Blessed One makes a pronouncement about this matter, and he might call upon the Venerable Upavāṇa himselfto give an account.[n.1163]Yathā āyasmantaṁyev’ettha upavāṇaṁ paṭibhāseyya.Mpexplainsyathāas a word for a cause(kāraṇavacanaṁ). I takepaṭibhāsatito mean \"calls upon (someone to say something)\" (see SED svpratibhāsh).Mpcontinues: \"When something has been uttered by the Blessed One with reference to this matter, you should think of some reply(paṭivacana, a counter-statement).\"Just now I feel timid.\"",
    "an5.166:14": "\"Upavāṇa, how many qualities should an elder bhikkhu possess to be pleasing and agreeable to his fellow monks and to be respected and esteemed by them?\"",
    "an5.166:15": "\"Good, good, Upavāṇa! Possessing those five qualities, an elder is pleasing and agreeable to his fellow monks and is respected and esteemed by them. But if these five qualities are not found in an elder bhikkhu, why should his fellow monks honor, respect, esteem, and venerate him?[n.1164] I followCeand Ee, which havena saṁvijjeyyuṁ, kena naṁ sabrahmacārī sakkareyyuṁ garukareyyuṁ māneyyuṁ pūjeyyuṁ.Be hasna saṁvijjeyyuṁ, taṁ sabrahmacārī na sakkareyyuṁ na garuṁ kareyyuṁ na māneyyuṁ na pūjeyyuṁ.On account of his broken teeth, grey hair, and wrinkled skin? But because these five qualities are found in an elder bhikkhu, his fellow monks honor, respect, esteem, and venerate him.\""
}