{
    "an5.104:1": "\"Bhikkhus, possessing five qualities, a bhikkhu is a delicate ascetic among ascetics.",
    "an5.104:2": "What five? (1) He usually uses a robe that has been specifically offered to him, seldom one that has not been specifically offered to him; he usually eats almsfood that has been specifically offered to him, seldom almsfood that has not been specifically offered to him; he usually uses a lodging that has been specifically offered to him, seldom one that has not been specifically offered to him; he usually uses medicines and provisions for the sick that have been specifically offered to him, seldom those that have not been specifically offered to him.() His fellow monks, those with whom he dwells, usually behave toward him in agreeable ways by body, speech, and mind, seldom in disagreeable ways. They usually present him what is agreeable, seldom what is disagreeable. (3) Discomfort originating from bile, phlegm, wind, or their combination; discomfort produced by change of climate; discomfort produced by careless behavior; discomfort produced by assault; or discomfort produced as the result of kamma—these do not often arise in him. He is seldom ill. (4) He gains at will, without trouble or difficulty, the four jhānas that constitute the higher mind and are pleasant dwellings in this very life. (5) With the destruction of the taints, he has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. It is by possessing these five qualities that a bhikkhu is a delicate ascetic among ascetics.",
    "an5.104:3": "\"If, bhikkhus, one could rightly say of anyone: ‘He is a delicate ascetic among ascetics,’ it is precisely of me that one might say this. (1) For I usually use a robe that has been specifically offered to me, seldom one that has not been specifically offered to me; I usually eat almsfood that has been specifically offered to me, seldom almsfood that has not been specifically offered to me; I usually use a lodging that has been specifically offered to me, seldom one that has not been specifically offered to me; I usually use medicines and provisions for the sick that have been specifically offered to me, seldom those that have not been specifically offered to me. (2) Those bhikkhus with whom I dwell usually behave toward me in agreeable ways by body, speech, and mind, seldom in disagreeable ways. They usually present me what is agreeable, seldom what is disagreeable. () Discomfort originating from bile, phlegm, wind, or their combination; discomfort produced by change of climate; discomfort produced by careless behavior; discomfort produced by assault; or discomfort produced as the result of kamma—thesedo not often arise in me. I am seldom ill. (4) I gain at will, without trouble or difficulty, the four jhānas that constitute the higher mind and are pleasant dwellings in this very life. (5) With the destruction of the taints, I have realized for myself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, I dwell in it.",
    "an5.104:4": "If, bhikkhus, one could rightly say of anyone: ‘He is a delicate ascetic among ascetics,’ it is precisely of me that one might say this.\""
}