{
    "an5.80:1": "\"Bhikkhus, there are these five future perils as yet unarisen that will arise in the future. You should recognize them and make an effort to abandon them.",
    "an5.80:2": "What five? (1) \"In the future, there will be bhikkhus who desire fine robes. They will give up the use of rag robes, give up remote lodgings in forests and jungle groves, and having converged upon the villages, towns, and capital cities, will take up their residence there; and they will engage in many kinds of wrong and improper searches for the sake of a robe. This is the first future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.80:3": "(2) \"Again, in the future there will be bhikkhus who desire fine almsfood. They will give up going on alms round, give up remote lodgings in forests and jungle groves, and having converged upon the villages, towns, and capital cities, will take up their residence there, seeking the finest delicacies with the tips of their tongues; and they will engage in many kinds of wrong and improper searches for the sake of almsfood. This is the second future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.80:4": "(3) \"Again, in the future there will be bhikkhus who desire fine lodgings. They will give up dwelling at the foot of a tree, will give up remote lodgings in forests and jungle groves, and having converged upon the villages, towns, and capital cities, will take up their residence there; and they will engage in many kinds of wrong and improper searches for the sake of lodgings. This is the third future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.80:5": "(4) \"Again, in the future there will be bhikkhus who bond closely with bhikkhunīs, female probationers, and novices.[n.1088]Saṁsaṭṭhā viharissanti.Mp:\"They will bond closely by way of the fivefold bond(pañcavidhena saṁsaggena).\" Mp-ṭ: \"Fivefold bond: bonding by hearing, seeing, conversation, eating together, and bodily contact\"(savanasaṁsaggo,dassanasaṁsaggo,samullāpasaṁsaggo,sambhogasaṁsaggo,kāyasaṁsaggo). Mp-ṭ identifies them all as manifestations of lust and exemplifies the last by the lust arisen through holding hands(hatthaggāha, asaṅghādisesaoffense when it occurs between a bhikkhu and a woman). Female probationers(sikkhamānā)are nuns already ordained as novices who are formally training for full bhikkhunī ordination.When they form such close bonds, it can be expected that they will live the spiritual life dissatisfied, commit acertain defiled offense,[n.1089] A defiled offense(saṅkiliṭṭhaṁ āpattiṁ)here would be apārājikaor asaṅghādisesa.or give up the training and revert to the lower life. This is the fourth future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.80:6": "(5) \"Again, in the future there will be bhikkhus who bond closely with monastery workers and novices. When they form such close bonds, it can be expected that they will engage in the use of various kinds of stored-up goodsand give gross hints in regard to the ground and vegetation.[n.1090] Use of stored-up food(sannidhikāraparibhoga)is prohibited by Pācittiya 38, Vin IV 8–87. Regarding \"giving a gross hint\"(oḷārikaṁ nimittaṁ),Mpsays: \"Here, digging the ground and ordering ‘Dig!’ is called giving a gross hint in regard to the ground. Cutting and ordering ‘Cut!’ is called giving a gross hint with regard to vegetation.\" The reference is to Pācittiyas 10 and 11, Vin IV 32–33, 33–35.This is the fifth future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.80:7": "\"These, bhikkhus, are the five future perils as yet unarisen that will arise in the future. You should recognize them and make an effort to abandon them.\""
}