{
    "an5.78:1": "\"Bhikkhus, when a forest bhikkhu considers five future perils, it is enough for him to dwell heedful, ardent, and resolute for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. What five?",
    "an5.78:2": "() \"Again, a bhikkhu reflects thus: ‘I am now seldom ill or afflicted; I possess an even digestion that is neither too cool nor too hot but moderate and suitable for striving. But there will come a time when illness assails this body. Now when one is ill, overcome by illness, it is not easy to attend to the Buddhas’ teaching; it is not easy to resort to remote lodgings in forests and jungle groves. Before that unwished for, undesirable, disagreeable condition comes upon me, let me in advance arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.Thus when I am in that condition, I will dwell at ease even though I am ill.’ This is the second future peril considering which it is enough for a bhikkhu to dwell heedful, ardent, and resolute … for the realization of the as-yet-unrealized.",
    "an5.78:3": "() \"Again, a bhikkhu reflects thus: ‘Food is now plentiful; there has been a good harvest and almsfood is abundant, so that one can easily subsist by means of gleaning. But there will come a time of famine, a poor harvest, when almsfood is hard to obtain and one cannot easily subsist by means of gleaning. In a time of famine, people migrate to places where food is plentiful and living conditions there are congested and crowded. Now when living conditions are congested and crowded, it is not easy to attend to the Buddhas’ teaching; it is not easy to resort to remote lodgings in forests and jungle groves. Before that unwished for, undesirable, disagreeable condition comes upon me, let me in advance arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. Thus when I am in that condition, I will dwell at ease even in a famine.’ This is the third future peril considering which it is enough for a bhikkhu to dwell heedful, ardent, and resolute … for the realization of the as-yet-unrealized.",
    "an5.78:4": "() \"Again, a bhikkhu reflects thus: ‘People are now dwelling in concord, harmoniously, without disputes, blending like milk and water, viewing each other with eyes of affection. But there will come a time of peril, of turbulence in the wilderness, when the people of the countryside, mounted on their vehicles, flee on all sides. In a time of peril, people migrate to places where there is safety and living conditions there are congested and crowded.Now when living conditions are congested and crowded, it is not easy to attend to the Buddhas’ teaching; it is not easy to resort to remote lodgings in forests and jungle groves. Before that unwished for, undesirable, disagreeable condition comes upon me, let me in advance arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. Thus when I am in that condition, I will dwell at ease even in time of peril.’ This is the fourth future peril considering which it is enough for a bhikkhu to dwell heedful, ardent, and resolute … for the realization of the as-yet-unrealized.",
    "an5.78:5": "() \"Again, a bhikkhu reflects thus: ‘The Saṅgha is now dwelling at ease—in concord, harmoniously, without disputes, with a single recitation. But there will come a time when there will be a schism in the Saṅgha. Now when there is a schism in the Saṅgha, it is not easy to attend to the Buddhas’ teaching; it is not easy to resort to remote lodgings in forests and jungle groves. Before that unwished for, undesirable, disagreeable condition comes upon me, let me in advance arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. Thus when I am in that condition, I will dwell at ease even though there is a schism in the Saṅgha.’ This is the fifth future peril considering which it is enough for a bhikkhu to dwell heedful, ardent, and resolute … for the realization of the as-yet-unrealized.",
    "an5.78:6": "\"These, bhikkhus, are the five future perils considering which it is enough for a bhikkhu to dwell heedful, ardent, and resolute for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.\""
}