{
    "an5.73:1": "Then a certain bhikkhu approached the Blessed One, paid homage to him, sat down to one side, and said:",
    "an5.73:2": "(1) \"Here, bhikkhu, a bhikkhu learns the Dhamma: the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers. He passes the day in learning the Dhamma but neglects seclusion and does not devote himself to internal serenity of mind. This is called a bhikkhu who is absorbed in learning, not one who dwells in the Dhamma.",
    "an5.73:3": "(2) \"Again, a bhikkhu teaches the Dhamma to others in detail as he has heard and learned it. He passes the day communicating the Dhamma[n.1075] I read withCedhammasaññattiyāhere andsaññattibahulojust below, as against Be and Eedhammapaññattiyāandpaññattibahulorespectively.but neglects seclusion and does not devote himself to internal serenity of mind. This is called a bhikkhu who is absorbed in communication, not one who dwells in the Dhamma.",
    "an5.73:4": "(3) \"Again, a bhikkhu recites the Dhamma in detail as he has heard it and learned it. He passes the day in recitation but neglects seclusion and does not devote himself to internal serenity of mind. This is called a bhikkhu who is absorbed in recitation, not one who dwells in the Dhamma.",
    "an5.73:5": "(4) \"Again, a bhikkhu ponders, examines, and mentally inspects the Dhamma as he has heard it and learned it. He passes the day in thinking about the Dhamma but neglects seclusion and does not devote himself to internal serenity of mind. This is called a bhikkhu who is absorbed in thought, not one who dwells in the Dhamma.",
    "an5.73:6": "(5) \"Here, a bhikkhu learns the Dhamma—the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers—but he does not pass the day (solely) in learning the Dhamma. He does not neglect seclusion but devotes himself to internal serenity of mind.[n.107]Anuyuñjati ajjhattaṁ cetosamathaṁ.Mp:\"He pursues and develops mental concentration within himself; he is intent on and devoted to a serenity meditation subject\"(niyakajjhatte cittasamādhiṁ āsevati bhāveti, samathakammaṭṭhāne yuttappayutto hoti).It is in this way that a bhikkhu is one who dwells in the Dhamma.",
    "an5.73:7": "\"Thus, bhikkhu, I have taught the one absorbed in learning, the one absorbed in communication, the one absorbed in recitation, the one absorbed in thought, and the one who dwells in the Dhamma. Whatever should be done by a compassionate teacher out of compassion for his disciples, seeking their welfare, that I have done for you. These are the feet of trees, these are empty huts. Meditate, bhikkhu, do not be heedless. Do not have cause to regret it later. This is our instruction to you.\""
}