{
    "an5.2:1": "At Sāvatthī. \"Bhikkhus, there are these five trainee's powers. What five? The power of faith, the power of moral shame, the power of moral dread, the power of energy, and the power of wisdom.",
    "an5.2:2": "(1) \"And what, bhikkhus, is the power of faith? Here, a noble disciple is endowed with faith. He places faith in the enlightenment of the Tathāgata thus: ‘The Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’ This is called the power of faith.",
    "an5.2:3": "(2) \"And what is the power of moral shame? Here, a noble disciple has a sense of moral shame; he is ashamed of bodily, verbal, and mental misconduct; he is ashamed of acquiring evil, unwholesome qualities. This is called the power of moral shame.",
    "an5.2:4": "(3) \"And what is the power of moral dread? Here, a noble disciple dreads wrongdoing; he dreads bodily, verbal, and mental misconduct; he dreads acquiring evil, unwholesome qualities. This is called the power of moral dread.[n.976] For the distinction between moral shame(hiri)and moral dread(ottappa), with references, seeAN2.8–9 andAN2.8, n. 225.",
    "an5.2:5": "(4) \"And what is the power of energy? Here, a noble disciple has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. This is called the power of energy.",
    "an5.2:6": "(5) \"And what is the power of wisdom? Here, a noble disciple is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering.[n.977]Mpexplainsudayatthagāminī paññā, \"the wisdom that discerns arising and passing away,\" as \"the wisdom able to penetrate the arising and vanishing of the five aggregates(pañcannaṁ khandhānaṁ udayavayagāminiyā udayañca vayañca paṭivijjhituṁ samatthāya). It is the wisdom of the path together with insight wisdom(vipassanāpaññāya c’eva maggapaññāya).\"This is called the power of wisdom.",
    "an5.2:7": "\"These are the five trainee's powers. Therefore, bhikkhus, you should train yourselves thus: ‘We will possess the power of faith, a trainee's power; we will possess the power of moral shame, a trainee's power; we will possess the power of moral dread,a trainee's power; we will possess the power of energy, a trainee's power; we will possess the power of wisdom, a trainee's power.’ Thus, bhikkhus, should you train yourselves.\""
}