{
    "an5.72:1": "\"Bhikkhus, these five things, when developed and cultivated, have liberation of mind as their fruit, liberation of mind as their fruit and benefit; they have liberation by wisdom as their fruit, liberation by wisdom as their fruit and benefit. What five? The perception of impermanence, the perception of suffering in the impermanent, the perception of non-self in what is suffering, the perception of abandoning, the perception of dispassion.[n.073] The perception of abandoning(pahānasaññā)and the perception of dispassion(virāgasaññā)are respectively atAN0.60§5 andAN0.60§6.Ce,both printed and electronic editions, also includesnirodhasaññā, apparently an editorial error that would raise the number of perceptions to six.These five things, when developed and cultivated, have liberation of mind as their fruit, liberation of mind as their fruit and benefit; they have liberation by wisdom as their fruit, liberation by wisdom as their fruit and benefit.",
    "an5.72:2": "\"And how has a bhikkhu removed the crossbar? Here, a bhikkhu has abandoned ignorance, cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising. It is in this way that a bhikkhu has removed the crossbar.",
    "an5.72:3": "\"And how has a bhikkhu filled in the moat? Here, a bhikkhu has abandoned the wandering on in birth that brings renewed existence; he has cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising. It is in this way that a bhikkhu has filled in the moat.",
    "an5.72:4": "\"And how has a bhikkhu pulled out the pillar?Here, a bhikkhu has abandoned craving, cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising. It is in this way that a bhikkhu has pulled out the pillar.",
    "an5.72:5": "\"And how is a bhikkhu a boltless one? Here, a bhikkhu has abandoned the five lower fetters, cut them off at the root, made them like a palm stump, obliterated them so that they are no more subject to future arising. It is in this way that a bhikkhu is a boltless one.",
    "an5.72:6": "\"And how is a bhikkhu a noble one with banner lowered, with burden dropped, detached? Here, a bhikkhu has abandoned the conceit ‘I am,’ cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising. It is in this way that a bhikkhu is a noble one with banner lowered, with burden dropped, detached.\""
}