{
    "an5.196:1": "\"Bhikkhus, before his enlightenment, while he was just a bodhisatta, not fully enlightened, five great dreams appeared to the Tathāgata, the Arahant, the Perfectly Enlightened One. What five?",
    "an5.196:2": "() \"Again, before his enlightenment … the Tathāgata, the Arahant, the Perfectly Enlightened Onedreamtthat a kind of grass calledtiriyārose up from his navel and stood touching the sky.This was the second great dream that appeared to the Tathāgata … while he was just a bodhisatta, not fully enlightened.",
    "an5.196:3": "() \"Again, before his enlightenment … the Tathāgata, the Arahant, the Perfectly Enlightened Onedreamtthat white worms with black heads crawled from his feet up to his knees and covered them. This was the third great dream that appeared to the Tathāgata … while he was just a bodhisatta, not fully enlightened.",
    "an5.196:4": "() \"Again, before his enlightenment … the Tathāgata, the Arahant, the Perfectly Enlightened Onedreamtthat four birds of different colors came from the four quarters, fell at his feet, and turned all white. This was the fourth great dream that appeared to the Tathāgata … while he was just a bodhisatta, not fully enlightened.",
    "an5.196:5": "() \"Again, before his enlightenment … the Tathāgata, the Arahant, the Perfectly Enlightened Onedreamtthat he climbed up a huge mountain of dung without being soiled by it. This was the fifth great dream that appeared to the Tathāgata … while he was just a bodhisatta, not fully enlightened.",
    "an5.196:6": "(1) \"Now, bhikkhus, when the Tathāgata, the Arahant, the Perfectly Enlightened One—before his enlightenment, while just a bodhisatta, not fully enlightened—dreamtthat this mighty earth was his bedstead and the Himālaya, king of mountains, his pillow; that his left hand rested on the eastern sea, his right hand on the western sea, and his two feet on the southern sea,this was a foretokenthat he would awaken to the unsurpassed, perfect enlightenment.[n.1200] I have added \"this was a foretoken\" in compliance withMp'suse of the wordpubbanimittato characterize the significance of the dreams. Brahmāli suggests: \"(the dream) … represented his awakening to the unsurpassed, perfect enlightenment,\" with a parallel construction for the corresponding sections below.This first great dream appeared to himas a signthat his awakeningwas imminent.[n.1201]Tassa abhisambodhāya ayaṁ paṭhamo mahāsupino pāturahosi. Brahmāli suggests here: \"This was the first great dream that was beneficial for his awakening,\" again with a parallel construction for the corresponding sections below. The sentence as it stands is perplexing; yetMpdoes not comment and there is no Chinese parallel. Ce and Be readtassāfortassa(the Ee reading).Tassāwould have to representsammā sambodhiin the previous sentence, but the question would then arise whatabhisambodhāyarelates to in §§2–4, wheresammā sambodhidoes not occur. I find the sentence is more intelligible if we readtassa(as in the following sections), taking it to mean \"to him,\" that is, to the future Buddha. We can then see the whole sentence as affirming that the dream was indicative of his imminent awakening.",
    "an5.196:7": "(2) \"When the Tathāgata, the Arahant, the Perfectly Enlightened One …dreamtthattiriyāgrass rose up from his navel and stood touching the sky,this was a foretokenthat he would awaken to the noble eightfold path and would proclaim it well among devas and humans. This second great dream appeared to himas a signthat his awakeningwas imminent.",
    "an5.196:8": "(3) \"When the Tathāgata, the Arahant, the Perfectly Enlightened One …dreamtthat white worms with black heads crawled from his feet up to his knees and covered them,this was a foretokenthat many white-robed householders would go for lifelong refuge to the Tathāgata. This third great dream appeared to himas a signthat his awakeningwas imminent.",
    "an5.196:9": "(4) \"When the Tathāgata, the Arahant, the Perfectly Enlightened One …dreamtthat four birds of different colors came from the four quarters, fell at his feet, and turned all white,this was a foretokenthat members of the four classes—khattiyas, brahmins, vessas, and suddas—would go forth from the household life into homelessness in the Dhamma and discipline proclaimed by the Tathāgata and realize unsurpassed liberation. This fourth great dream appeared to himas a signthat his awakeningwas imminent.",
    "an5.196:10": "(5) \"When the Tathāgata, the Arahant, the Perfectly Enlightened One …dreamtthat he climbed up a huge mountain of dung without being soiled by it,this was a foretokenthat he would receive robes, almsfood, dwellings, and medicines and provisions for the sick, and he would use them without being tied to them, infatuated with them, and blindly absorbed in them, seeing the danger and knowing the escape. This fifth great dream appeared to himas a signthat his awakeningwas imminent.",
    "an5.196:11": "\"These, bhikkhus, were the five great dreams that appeared to the Tathāgata, the Arahant, the Perfectly Enlightened One, before his enlightenment, while he was just a bodhisatta, not fully enlightened.\""
}