{
    "an5.143:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Then, in the morning, the Blessed One dressed, took his bowl and robe, and entered Vesālī for alms. Now on that occasion five hundred Licchavis had assembled at the Sārandada Shrine and were sitting together when this conversation arose: \"The manifestation of five gems is rare in the world. What five? The elephant-gem, the horse-gem, the jewel-gem, the woman-gem, and the stewardgem. The manifestation of these five gems is rare in the world.\"",
    "an5.143:2": "Then the Licchavis stationed a man on the road and told him: \"Good man, when you see the Blessed One coming, you should inform us.\" The man saw the Blessed One coming in the distance, went to the Licchavis, and told them: \"Sirs, this Blessed One, the Arahant, the Perfectly Enlightened One is coming. You may go at your own convenience.\"",
    "an5.143:3": "Then the Licchavis approached the Blessed One, paid homage to him, and stood to one side. Standing there, they said to him:",
    "an5.143:4": "\"Please, Bhante, let the Blessed One go to the Sārandada Shrine out of compassion.\" The Blessed One silently consented. He went to the Sārandada Shrine, sat down on a seat that was prepared, and said to the Licchavis:",
    "an5.143:5": "\"Intent on sensual pleasures, the Licchavis were engaged in a conversation about sensual pleasures! Licchavis, the manifestation of five gems is rare in the world. What five? (1) The manifestation of a Tathāgata, an Arahant, a Perfectly Enlightened One is rare in the world. (2) A person who teaches the Dhamma and discipline proclaimed by a Tathāgatais rare in the world. (3) When the Dhamma and discipline proclaimed by a Tathāgata has been taught, a person who understands it is rare in the world. (4) When the Dhamma and discipline proclaimed by a Tathāgata has been taught and understood, a person who practices in accordance with the Dhamma is rare in the world. () A grateful and thankful person is rare in the world. Licchavis, the manifestation of these five gems is rare in the world.\""
}