{
    "an5.56:1": "Then a certain bhikkhu approached his own preceptor and said to him: \"Bhante, my body now seems as if it has been drugged, I have become disoriented, and the teachings are no longer clear to me. Dullness and drowsiness obsess my mind. I live the spiritual life dissatisfied and have doubt about the teachings.\"[n.056] The expression \"I live the spiritual life dissatisfied\"(anabhirato ca brahmacariyaṁ carāmi)implies that he wants to disrobe and return to lay life.",
    "an5.56:2": "Then the preceptor took his pupil to the Blessed One. He paid homage to the Blessed One, sat down to one side, and told the Blessed One what his pupil had said.",
    "an5.56:3": "The Blessed One said:\"So it is, bhikkhu! (1) When one is unguarded in the doors of the sense faculties, (2) immoderate in eating, () and not intent on wakefulness; (4) when one lacks insight into wholesome qualities (5) and does not dwell intent on the endeavor to develop the aids to enlightenment in the earlier and later phases of the night, one's body seems as if it had been drugged, one becomes disoriented, and the teachings are no longer clear to one. Dullness and drowsiness obsess one's mind. One lives the spiritual life dissatisfied and has doubt about the teachings.",
    "an5.56:4": "Then, having received such an exhortation from the Blessed One, that bhikkhu rose from his seat, paid homage to the Blessed One, circumambulated him keeping the right side toward him, and departed. Then, dwelling alone, withdrawn, heedful, ardent, and resolute, in no long time that bhikkhu realized for himself with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness, and having entered upon it, he dwelled in it. He directly knew: \"Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.\" And that bhikkhu became one of the arahants.",
    "an5.56:5": "Then, after attaining arahantship, that bhikkhu approached his preceptor and said to him: \"Bhante, my body now no longer seems as if it had been drugged, I have become well oriented, and the teachings are clear to me. Dullness and drowsiness do not obsess my mind. I live the spiritual life joyfully and have no doubt about the teachings.\"",
    "an5.56:6": "The Blessed One said:\"So it is, bhikkhu! When one is guarded in the doors of the sense faculties, moderate in eating, and intent on wakefulness; when one has insight into wholesome qualities and dwells intent on the endeavor to develop the aids to enlightenment in the earlier and later phases of the night, one's body does not seem as if it had been drugged, one becomes well oriented, and the teachings are clear to one. Dullness and drowsiness do not obsess one's mind. One lives the spiritual life joyfully and has no doubt about the teachings."
}