{
    "an5.44:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Then, in the morning, the Blessed One dressed, took his bowl and robe, and went to the residence of the householder Ugga of Vesālī, where he sat down in the appointed seat. Then the householder Ugga of Vesālī approached the Blessed One, paid homage to him, sat down to one side, and said to the Blessed One:",
    "an5.44:2": "\"Bhante, in the presence of the Blessed One I heard and learned this: ‘The giver of what is agreeable gains what is agreeable.’ Bhante, my sal flower porridge is agreeable.[n.108]Sālapupphakaṁ khādaniyaṁ.Mp:\"A food similar to sal flour; it is made with hill-rice flour prepared with the four sweets (honey, sugar, butter, and ghee).\"Let the Blessed One accept it from me, out of compassion.\" The Blessed One accepted, out of compassion.",
    "an5.44:3": "\"Bhante, in the presence of the Blessed One I heard and learned this: ‘The giver of what is agreeable gains what is agreeable.’ Bhante, my pork embellished with jujubes is agreeable.[n.1029] Reading with Besampannakolakaṁ sūkaramaṁsaṁ.Mp:\"The flesh of a one-year-old pig cooked with spices such as cumin seeds, etc., together with sweet jujube fruits.\"Let the Blessed One accept it from me, out of compassion.\" The Blessed One accepted, out of compassion.",
    "an5.44:4": "\"Bhante, in the presence of the Blessed One I heard and learned this: ‘The giver of what is agreeable gains what is agreeable.’ Bhante, my fried vegetable stalks are agreeable.[n.1030] Cenibaddhatelakaṁ nāḷiyasākaṁ(Benibattatelakaṁ nāliyasākaṁ).Mp:\"The vegetable stalks are cooked in ghee mixed with cumin and other spices, which have been pulverized together with hill-rice flour; then they are coated with the four sweets and put out until they acquire a particular aroma.\"Let the Blessed One accept them from me, out of compassion.\" The Blessed One accepted, out of compassion.",
    "an5.44:5": "\"Bhante, in the presence of the Blessed One I heard and learned this: ‘The giver of what is agreeable gains what is agreeable.’ Bhante, my boiled hill rice cleared of dark grains, accompanied by various sauces and condiments, is agreeable. Let the Blessed One accept it from me, out of compassion.\" The Blessed One accepted, out of compassion.",
    "an5.44:6": "\"Bhante, in the presence of the Blessed One I heard and learned this: ‘The giver of what is agreeable gains what is agreeable.’ Bhante, my cloths from Kāsi are agreeable. Let the Blessed One accept them from me, out of compassion.\" The Blessed One accepted, out of compassion.",
    "an5.44:7": "\"Bhante, in the presence of the Blessed One I heard and learned this: ‘The giver of what is agreeable gains what is agreeable.’ Bhante, my couch spread with rugs, blankets, and covers, with an excellent covering of antelope hide, with a canopy above and red bolsters at both ends, is agreeable. Although I know this is not allowable for the Blessed One, this sandalwood plank of mine is worth over a thousand.[n.1031] SoCe.Be and Ee \"over a hundred thousand\"(adhikasatasahassaṁ). Presumably this refers tokahāpaṇas, the major currency unit.Let the Blessed One accept it from me, out of compassion.\" The Blessed One accepted, out of compassion.",
    "an5.44:8": "\"The giver of the agreeable gains the agreeable,when he gives willingly to the upright onesclothing, bedding, food, and drink,and various kinds of requisites.",
    "an5.44:9": "\"Having known the arahants to be like a fieldfor what is relinquished and offered, not held back,[n.1032] Reading withCeanaggahītaṁ, as against Be and Eeanuggahītaṁ.the good person gives what is hard to give:the giver of agreeable things gains what is agreeable.\"",
    "an5.44:10": "Then, after expressing his appreciation to the householder Ugga of Vesālī, the Blessed One rose from his seat and left.",
    "an5.44:11": "Then, some time later, the householder Ugga of Vesālī passed away. After his death, the householder Ugga of Vesālī was reborn among a certain group of mind-madedeities.[n.1033]Aññataraṁ manomayaṁ kāyaṁ upapajjati. I followMpin taking this expression, as used here, to mean that he was reborn among a group(kāya)of deities rather than that he was reborn with a mind-made body.Mp:\"(Reborn) into a group of devas in the pure abodes who are produced through the mind of jhāna\"(suddhāvāsesu ekaṁ jhānamanena nibbattaṁ devakāyaṁ). Also, at AN III 348,28–349,1(= V 139,5–8) we findtusitaṁ kāyaṁ upapanno, wherekāyaṁmust mean \"group.\" In relation to the spiritual powers,manomaya kāyasignifies a subtle body produced by the meditative mind, as at AN I 24,2. See tooAN5.166.On that occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, when the night had advanced, the young deva Ugga, of stunning beauty, illuminating the entireJeta's Grove, approached the Blessed One, paid homage to him, and stood to one side. The Blessed One then said to him: \"I hope, Ugga, that it is as you would have wished.\"",
    "an5.44:12": "\"The giver of the agreeable gains the agreeable;the giver of the foremost again gains the foremost;the giver of the excellent gains the excellent;the giver of the best reaches the best state.",
    "an5.44:13": "\"The person who gives the best,the giver of the foremost,the giver of the excellent,is long-lived and famouswherever he is reborn.\"[n.1034] It is hard to see why this sutta is included in the Fives. Could it be that the original version had only five items of offering and a sixth was added later, after the sutta was included in the Fives?"
}