{
    "an5.76:1": "\"Bhikkhus, there are these five kinds of warriors found in the world. What five?",
    "an5.76:2": "() \"Again, some warrior takes up a sword and shield, arms himself with a bow and quiver, and enters the fray of battle. He strives and exerts himself in the battle, but his foes wound him.His comradescarry him off and bring him to his relatives. While he is being brought to his relatives, he dies along the way even before he arrives. There is, bhikkhus, such a warrior here. This is the second kind of warrior found in the world.",
    "an5.76:3": "() \"Again, some warrior takes up a sword and shield, arms himself with a bow and quiver, and enters the fray of battle. He strives and exerts himself in the battle, but his foes wound him.His comradescarry him off and bring him to his relatives. His relatives nurse him and look after him, but while they are doing so he dies from that injury. There is, bhikkhus, such a warrior here. This is the third kind of warrior found in the world.",
    "an5.76:4": "() \"Again, some warrior takes up a sword and shield, arms himself with a bow and quiver, and enters the fray of battle. He strives and exerts himself in the battle, but his foes wound him.His comradescarry him off and bring him to his relatives. His relatives nurse him and look after him, and as a result he recovers from that injury. There is, bhikkhus, such a warrior here. This is the fourth kind of warrior found in the world.",
    "an5.76:5": "() \"Again, some warrior takes up a sword and shield, arms himself with a bow and quiver, and enters the fray of battle. Having triumphed in that battle, he emerges victoriousand settles at the head of the battlefield. There is, bhikkhus, such a warrior here. This is the fifth kind of warrior found in the world.",
    "an5.76:6": "\"So too, there are these five kinds of persons similar to warriors found among the bhikkhus. What five?",
    "an5.76:7": "This person, I say, is just like the warrior who takes up a sword and shield, arms himself with a bow and quiver, and enters the fray of battle, and whose foes slay him and finish him off while he is striving and exerting himself in battle. There is, bhikkhus, such a person here. This is the first kind of person similar to a warrior found among the bhikkhus.",
    "an5.76:8": "(2) \"Again, some bhikkhu dwells in dependence upon a certain village or town. In the morning, he dresses, takes his robe and bowl, and enters that village or town for alms …andlust invades his mind. With his mind invaded by lust, he burns bodily and mentallywith the fever of lust. He thinks: ‘Let me return to the monasteryand inform the bhikkhus: \"Friends, I am obsessed by lust, oppressed by lust. I cannot maintain the spiritual life. Having disclosed my weakness in the training, I will give up the training and revert to the lower life.\"’ While he is returning to the monastery, even before he arrives, he discloses his weakness in the training, gives up the training, and reverts to the lower life along the way.",
    "an5.76:9": "This person, I say, is just like the warrior who takes up a sword and shield, arms himself with a bow and quiver, enters the fray of battle, is wounded by his foes while he strives and exerts himself in the battle, and is then carried off and brought to his relatives but dies along the way even before he arrives. There is, bhikkhus, such a person here. This is the second kind of person similar to a warrior found among the bhikkhus.",
    "an5.76:10": "(3) \"Again, some bhikkhu dwells in dependence upon a certain village or town. In the morning, he dresses, takes his robe and bowl, and enters that village or town for alms …andlust invades his mind. With his mind invaded by lust, he burns bodily and mentallywith the fever of lust. He thinks: ‘Let me return to the monastery and inform the bhikkhus: \"Friends, I am obsessed by lust, oppressed by lust. I cannot maintain the spiritual life. Having disclosed my weakness in the training, I will give up the training and revert to the lower life.\"’ He returns to the monastery and informs the bhikkhus: ‘Friends, I am obsessed by lust, oppressed by lust. I cannot maintain the spiritual life. Having disclosed my weakness in the training, I will give up the training and revert to the lower life.’",
    "an5.76:11": "His fellow monks then exhort and instruct him:‘Friend, the Blessed One has stated that sensual pleasures provide little gratification, much suffering and anguish, and that the danger in them is more.[n.1081] The following exhortation is also atMN 22.3, I 130,23–31. Many of these similes for sensual pleasures are elaborated atMN 54.14–33, I 364–67.With the simile of the skeleton the Blessed One has stated that sensual pleasures provide little gratification, much suffering and anguish, and that the danger in them is more. With the simile of the piece of meat … with the simile of the grass torch … with the simile of the charcoal pit … with the simile of the dream … with the simile of the borrowed goods … with the simile of fruits on a tree … with the simile of the butcher's knife and block … with the simile of the sword stake … with the simile of the snake's head, the Blessed One has stated that sensual pleasures provide little gratification, much suffering and anguish, and that the danger in them is more. Enjoy the spiritual life. Do not think you are unable to follow the training, give it up, and revert to the lower life.’",
    "an5.76:12": "While he is being exhorted and instructed by his fellow monks in this way, he protests: ‘Friends, although the Blessed One has stated that sensual pleasures provide little gratification, much suffering and anguish, and that the danger in them is more, still, I am unable to maintain the spiritual life. Having disclosed my weakness in the training, I will give up the training and revert to the lower life.’ Having disclosed his weakness in the training, he gives up the training and reverts to the lower life.",
    "an5.76:13": "This person, I say, is just like the warrior who takes up a sword and shield, arms himself with a bow and quiver, enters the fray of battle, is wounded by his foes while he strives and exerts himself in the battle, and is then carried offand brought to his relatives, who nurse him and look after him, but who dies from that injury. There is, bhikkhus, such a person here. This is the third kind of person similar to a warrior found among the bhikkhus.",
    "an5.76:14": "(4) \"Again, some bhikkhu dwells in dependence upon a certain village or town. In the morning, he dresses, takes his robe and bowl, and enters that village or town for alms … lust invades his mind. With his mind invaded by lust, he burns bodily and mentallywith the fever of lust. He thinks: ‘Let me return to the monastery and inform the bhikkhus: \"Friends, I am obsessed by lust, oppressed by lust. I cannot maintain the spiritual life. Having disclosed my weakness in the training, I will give up the training and revert to the lower life.\"’ He returns to the monastery and informs the bhikkhus: ‘Friends, I am obsessed by lust, oppressed by lust. I cannot maintain the spiritual life. Having disclosed my weakness in the training, I will give up the training and revert to the lower life.’",
    "an5.76:15": "His fellow monks then exhort and instruct him: ‘Friend, the Blessed One has stated that sensual pleasures provide little gratification, much suffering and anguish, and that the danger in them is more. With the simile of the skeleton …… with the simile of the snake's head, the Blessed One has stated that sensual pleasures provide little gratification, much suffering and anguish, and that the danger in them is more. Enjoy the spiritual life. Do not think you are unable to follow the training, give it up, and revert to the lower life.’",
    "an5.76:16": "While he is being exhorted and instructed by his fellow monks in this way, he says: ‘I will try, friends, I will carry on, I will enjoy it. I won’t think I am unable to follow the training, give it up, and revert to the lower life.’",
    "an5.76:17": "This person, I say, is just like the warrior who takes up a sword and shield, arms himself with a bow and quiver, and enters the fray of battle, who is wounded by his foes while he strives and exerts himself in the battle, and is then carried off and brought to his relatives, who nurse him and look after him, and who then recovers from that injury. There is, bhikkhus, such a person here. This is the fourth kind of person similar to a warrior found among the bhikkhus.",
    "an5.76:18": "(5) \"Again, some bhikkhu dwells in dependence upon a certain village or town. In the morning, he dresses, takes his robe and bowl, and enters that village or town for alms with body, speech, and mind guarded, mindfulness established, and sense faculties restrained. Having seen a form with the eye, he does not grasp its marks and features. Since, if he left the eye faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the eye faculty, he undertakes the restraint of the eye faculty. Having heard a sound with the ear … Having smelled an odour with the nose … Having tasted a taste with the tongue …… Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, he does not grasp its marks and features. Since, if he left the mind faculty unrestrained, bad unwholesome states of longing and dejection might invade him, he practices restraint over it; he guards the mind faculty, he undertakes the restraint of the mind faculty. After his meal, on returning from his alms round, he resorts to a secluded lodging: the forest, the foot of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle highland, the open air, a heap of straw. Gone to the forest, to the foot of a tree, or to an empty hut, he sits down, folding his legs crosswise, straightening his body, and establishing mindfulness in front of him. Having abandoned longing for the world … he purifies his mind from doubt.",
    "an5.76:19": "\"When his mind is thus concentrated, purified, cleansed, unblemished, rid of defilement, malleable, wieldy, steady, and attained to imperturbability, he directs it to the knowledge of the destruction of the taints. He understands as it really is: ‘This is suffering’ … ‘Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.’",
    "an5.76:20": "This person, I say, is just like the warrior who takes up a sword and shield, arms himself with a bow and quiver, enters the fray of battle, and having triumphed in that battle, emerges victorious and settles at the head of the battlefield. There is, bhikkhus, such a person here. This is the fifth kind of person similar to a warrior found among the bhikkhus."
}