{
    "an5.194:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Now on that occasion the brahmin Kāraṇapālī was getting some work done for the Licchavis.[n.94]Mpexplains that after rising early, he had new gates, a watchtower, and ramparts built and had those that had decayed repaired.The brahmin Kāraṇapālī saw the brahmin Piṅgiyānīcoming in the distance and said to him:",
    "an5.194:2": "\"Where is Master Piṅgiyānī coming from in the middle of the day?\"",
    "an5.194:3": "5() \"Just as a man who comes upon a piece of sandalwood, whether yellow sandalwood or red sandalwood, will enjoy a pure, fragrant scent wherever he smells it, be it at the bottom, the middle, or the top; so too, sir, whatever one hears of Master Gotama's Dhamma—discourses, mixed prose and verse, expositions, or amazing accounts—one will derive elation and joy.",
    "an5.194:4": "(2) \"Just as a man oppressed by hunger and weakness who receives a honey cake will enjoy a sweet, delicious taste wherever he eats of it; so too, sir, whatever one hears of Master Gotama's Dhamma—discourses, mixed prose and verse, expositions, or amazing accounts—one will obtain satisfaction and placidity of mind.",
    "an5.194:5": "3(3) \"Just as a man who comes upon a piece of sandalwood, whether yellow sandalwood or red sandalwood, will enjoy a pure, fragrant scent wherever he smells it, be it at the bottom, the middle, or the top; so too, sir, whatever one hears of Master Gotama's Dhamma—discourses, mixed prose and verse, expositions, or amazing accounts—one will derive elation and joy.",
    "an5.194:6": "(4) \"Just as a capable physician might instantly cure one who is afflicted, sick, and gravely ill; so too, sir, whatever one hears of Master Gotama's Dhamma—discourses, mixed prose and verse, expositions, or amazing accounts—one's sorrow, lamentation, pain, dejection, and anguish will vanish.",
    "an5.194:7": "(5) \"Just as there might be a delightful pond with pleasant banks, its water clear, agreeable, cool, and limpid, and a man oppressed and exhausted by the heat, fatigued, parched, and thirsty, might come by, enter the pond, and bathe and drink; thus all his affliction, fatigue, and feverish burning would subside. So too, sir, whatever one hears of Master Gotama's Dhamma—discourses, mixed prose and verse, expositions, or amazing accounts—all one's affliction, fatigue, and feverish burning subside.\"",
    "an5.194:8": "When this was said, the brahmin Kāraṇapālī rose from his seat, arranged his upper robe over one shoulder, and placing his right knee on the ground, he reverently saluted the Blessed One and uttered three times these inspired words:",
    "an5.194:9": "\"Homage to the Blessed One, the Arahant, the Perfectly Enlightened One!",
    "an5.194:10": "Homage to the Blessed One, the Arahant, the Perfectly Enlightened One!",
    "an5.194:11": "Homage to the Blessed One, the Arahant, the Perfectly Enlightened One!",
    "an5.194:12": "\"Excellent, Master Piṅgiyānī! Excellent, Master Piṅgiyānī! Master Piṅgiyānī has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost,or holding up a lamp in the darkness so those with good sight can see forms. Master Piṅgiyānī, I now go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. Let Master Piṅgiyānī consider me a lay follower who from today has gone for refuge for life.\""
}