{
    "an5.200:1": "\"Bhikkhus, there are these five elements of escape.[n.204]Nissāraṇīyā dhātuyo.Mpglossesnissāraṇīyawithvisaṁyutta, \"detached, disconnected,\" anddhātuyowithattasuññasabhāvā, \"a nature empty of self.\"What five?",
    "an5.200:2": "() \"Again, when a bhikkhu is attending to ill will, his mind does not launch out upon it, and become placid, settled, and focused on it. But when he is attending to good will, his mind launches out upon it and becomes placid, settled, and focused on it. His mind is well departed, well developed, well emerged, well liberated, and well detached from ill will. And he is freed from those taints, distressful and feverish, that arise with ill will as condition. He does not feel that kind of feeling. This is declared to be the escape from ill will.",
    "an5.200:3": "() \"Again, when a bhikkhu is attending to harming, his mind does not launch out upon it and become placid, settled, and focused on it. But when he is attending to non-harming, his mind launches out upon it and becomes placid, settled, and focused on it. His mind is well departed, well developed, well emerged, well liberated, and well detached from harming. And he is freed from those taints, distressful and feverish, that arise with harming as condition. He does not feel that kind of feeling. This is declared to be the escape from harming.",
    "an5.200:4": "() \"Again, when a bhikkhu is attending to form, his mind does not launch out upon it and become placid, settled, and focused on it. But when he is attending to the formless, his mind launches out upon it and becomes placid, settled, and focused on it. His mind is well departed, well developed, well emerged, well liberated, and well detached from form. And he is freed from those taints, distressful and feverish, that arise with form as condition. He does not feel that kind of feeling. This is declared to be the escape from form.",
    "an5.200:5": "() \"Again, when a bhikkhu is attending to personal existence, his mind does not launch out upon it and become placid, settled, and focused on it. But when he is attending to the cessation of personal existence, his mind launches out upon it and becomes placid, settled, and focused on it. His mind is well departed, well developed, well emerged, well liberated, and well detached from personal existence. And he is freed from those taints, distressful and feverish, that arise with personal existence as condition. He does not feel that feeling. This is declared to be the escape from personal existence.",
    "an5.200:6": "\"Delight in sensual pleasures does not lie within him; delight in ill will does not lie within him; delight in harming does not lie within him; delight in form does not lie within him; delight in personal existence does not lie within him. Because he is without the underlying tendencies toward delight in sensual pleasures, delight in ill will, delight in harming, delight in form, and delight in personal existence, he is called a bhikkhu devoid of underlying tendencies. He has cut off craving, stripped off the fetter, and by completely breaking through conceit, he has made an end of suffering. These, bhikkhus, are the five elements of escape.\""
}