{
    "an5.74:1": "Then a certain bhikkhu approached the Blessed One, paid homage to him, sat down to one side, and said:",
    "an5.74:2": "(1) \"Here, bhikkhu, a bhikkhu learns the Dhamma—the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers—but he does not go further and understand its meaning with wisdom.[n.1077]Uttariṁ c’assa paññāya atthaṁ nappajānāti.Mp:\"Beyond his learning, he does not understand the meaning of that Dhamma by path wisdom together with insight; he does not see and penetrate the four (noble) truths\"(tato pariyattito uttariṁ tassa dhammassa sahavipassanāya maggapaññāya atthaṁ nappajānāti, cattāri saccāni na passati nappaṭivijjhati).This is called a bhikkhu who is absorbed in learning, not one who dwells in the Dhamma.",
    "an5.74:3": "(2) \"Again, a bhikkhu teaches the Dhamma to others in detail as he has heard and learned it, but he does not go further and understand its meaning with wisdom. This is called a bhikkhu who is absorbed in communication, not one who dwells in the Dhamma.",
    "an5.74:4": "(3) \"Again, a bhikkhu recites the Dhamma in detail as he has heard it and learned it, but he does not go further and understand its meaning with wisdom. This is called a bhikkhu who is absorbed in recitation, not one who dwells in the Dhamma.",
    "an5.74:5": "(4) \"Again, a bhikkhu ponders, examines, and mentally inspects the Dhamma as he has heard it and learned it, but he does not go further and understand its meaning with wisdom. This is called a bhikkhu who is absorbed in thought, not one who dwells in the Dhamma.",
    "an5.74:6": "(5) \"Here, a bhikkhu learns the Dhamma—the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers—but he goes further and understands its meaning with wisdom. It is in this way that a bhikkhu is one who dwells in the Dhamma.",
    "an5.74:7": "\"Thus, bhikkhu, I have taught the one absorbed in learning,the one absorbed in communication, the one absorbed in recitation, the one absorbed in thought, and the one who dwells in the Dhamma. Whatever should be done by a compassionate teacher out of compassion for his disciples, seeking their welfare, that I have done for you. These are the feet of trees, these are empty huts. Meditate, bhikkhu, do not be heedless. Do not have cause to regret it later. This is our instruction to you.\""
}