{
    "an5.79:1": "\"Bhikkhus, there are these five future perils as yet unarisen that will arise in the future. You should recognize themand make an effort to abandon them.",
    "an5.79:2": "What five? (1) \"In the future, there will be bhikkhus who are undeveloped in body, virtuous behavior, mind, and wisdom.[n.1083]Mpdoes not comment onabhāvitakāyā, but Spk II 395,16glosses it asabhāvitapañcadvārikakāyā, \"undeveloped in the body of the five sense doors,\" probably referring to sense restraint. I suspect the term actually refers to the maintenance of clear comprehension in all modes of deportment and in the various bodily activities, as described at AN II 10,1–6and V 06,5–30.They will give full ordination to others but will not be able to discipline them in the higher virtuous behavior, the higher mind, and the higher wisdom. These (pupils) too will be undeveloped in body, virtuous behavior, mind, and wisdom. They in turn will give full ordination to others but will not be able to discipline them in the higher virtuous behavior, the higher mind, and the higher wisdom. These (pupils) too will be undeveloped in body, virtuous behavior, mind, and wisdom. Thus, bhikkhus, through corruption of the Dhamma comes corruption of the discipline, and from corruption of the discipline comes corruption of the Dhamma.[n.1084]Iti kho, bhikkhave, dhammasandosā vinayasandoso; vinayasandosā dhammasandoso.Mp:\"How is it that when the Dhamma is becoming corrupt, the discipline becomes corrupt? When thedhammasof serenity and insight are no longer being nurtured, the fivefold discipline no longer exists. But when there is no discipline of restraint among those who are immoral, in its absence serenity and insight are not nurtured. In this way, through corruption of the discipline, there is corruption of the Dhamma.\" The fivefold discipline by restraint is restraint by virtuous behavior, mindfulness, knowledge, patience, and energy(sīlasaṁvara,satisaṁvara,ñāṇasaṁvara,khantisaṁvara,viriyasaṁvara). See Ps I 6,3–5, commenting on the Sabbāsava Sutta.This is the first future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.79:3": "(2) \"Again, in the future there will be bhikkhus who are undeveloped in body, virtuous behavior, mind, and wisdom. They will give dependence[n.1085]Nissaya. A procedure prescribed in the Vinaya by which a junior bhikkhu apprentices himself to a qualified senior bhikkhu, normally his preceptor or teacher. A similar procedure is prescribed for bhikkhunīs. The period ofnissayais normally the first five years after a bhikkhu's full ordination, but it can be extended in the case of one who needs more time to gain competence. For details, see Ṭhānissaro 2007a: 29–40.to others but will not be able to discipline them in the higher virtuous behavior, the higher mind, and the higher wisdom. These (pupils) too will be undeveloped in body, virtuous behavior, mind, and wisdom. They in turn will give dependence to others but will not be able to discipline them in the higher virtuous behavior, the higher mind, and the higher wisdom. These (pupils) too will be undeveloped in body, virtuous behavior, mind, and wisdom. Thus, bhikkhus, through corruption of the Dhamma comes corruption of the discipline, and from corruption of the discipline comes corruption of the Dhamma. This is the second future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.79:4": "(3) \"Again, in the future there will be bhikkhus who are undeveloped in body, virtuous behavior, mind, and wisdom. While engaged in talk pertaining to the Dhamma, in questions-and-answers,[n.1086]Abhidhammakathaṁ vedallakathaṁ kathentā. I take the wordabhidhammahere to have a purely referential function, that is, to mean \"pertaining to the Dhamma, relating to the Dhamma.\" It does not denote the canonical collection of that name or its philosophy. See DOP svabhidhamme.Mp,too, appears to recognize that the Abhidhamma Piṭaka is not relevant here, explainingabhidhammakathaṁin this passage as a discussion on \"the supreme teaching concerned with virtuous behavior, etc.\"(sīlādi-uttamadhammakathaṁ). It takesvedallakathaṁto be a \"miscellaneous talk on knowledge connected with inspirational joy\"(vedapaṭisaṁyuttaṁ ñāṇamissakakathaṁ).MN 3andMN havevedallain their title and proceed by way of miscellaneous questions and answers between disciples. The \"dark Dhamma\"(kaṇhadhammaṁ)is said to occur by way of faultfinding with a mind bent on criticizing others(randhagavesitāya upārambhapariyesanavasena).they will slide down into a dark Dhamma but will not recognize it. Thus, bhikkhus, through corruption of the Dhamma comes corruption of the discipline, and from corruption of the discipline comes corruption of the Dhamma. This is the third future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.79:5": "(4) \"Again, in the future there will be bhikkhus who are undeveloped in body, virtuous behavior, mind, and wisdom. When those discourses spoken by the Tathāgata are being recited that are deep, deep in meaning, world-transcending, connected with emptiness, they will not want to listen to them, will not lend an ear to them, or apply their minds to understand them; they will not think those teachings should be studied and learned.[n.1087] SeeAN2.47.But when those discourses are being recited that are mere poetry composed by poets, beautiful in words and phrases, created by outsiders, spoken by disciples, they will want to listen to them, lend an ear to them, and apply their minds to understand them; they will think those teachings should be studied and learned. Thus, bhikkhus, through corruption of the Dhamma comes corruption of the discipline, and from corruption of the discipline comes corruption of the Dhamma. This is the fourth future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.79:6": "(5) \"Again, in the future there will be bhikkhus who are undeveloped in body, virtuous behavior, mind,and wisdom. The elder bhikkhus—being undeveloped in body, virtuous behavior, mind, and wisdom—will be luxurious and lax, leaders in backsliding, discarding the duty of solitude; they will not arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. Those in the next generation will follow their example. They, too, will be luxurious and lax, leaders in backsliding, discarding the duty of solitude; they, too, will not arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. Thus, bhikkhus, through corruption of the Dhamma comes corruption of the discipline, and from corruption of the discipline comes corruption of the Dhamma. This is the fifth future peril as yet unarisen that will arise in the future. You should recognize it and make an effort to abandon it.",
    "an5.79:7": "\"These, bhikkhus, are the five future perils as yet unarisen that will arise in the future. You should recognize them and make an effort to abandon them.\""
}