{
    "an5.131:1": "\"Bhikkhus, possessing five factors, a wheel-turning monarch sets the wheel in motion solely through the Dhamma,[n.30]Dhammen’eva cakkaṁ vatteti.Mp:\"‘Dhamma’ here is the ten wholesome (courses of kamma).\"a wheel thatcannot be turned back by any hostile creature in human form.",
    "an5.131:2": "What five? Here, a wheel-turning monarch is one who knows what is good, who knows the Dhamma, who knows the right measure, who knows the proper time, and who knows the assembly. Possessing these five factors, a wheel-turning monarch sets the wheel in motion solely through the Dhamma, a wheel that cannot be turned back by any hostile creature in human form.",
    "an5.131:3": "\"So too, bhikkhus, possessing five qualities, the Tathāgata, the Arahant, the Perfectly Enlightened One sets in motion the unsurpassed wheel of the Dhamma solely through the Dhamma, a wheel that cannot be turned back by any ascetic, brahmin, deva, Māra, or Brahmā, or by anyone in the world.",
    "an5.131:4": "What five? Here, the Tathāgata, the Arahant, the Perfectly Enlightened One is one who knows what is good, who knows the Dhamma, who knows the right measure, who knows the proper time, and who knows the assembly.[n.1131]Mp:\"Who knows what is good(atthaññū): who knows the fivefold good (Mp-ṭ: one's own good, the good of others, the good of both, the good pertaining to this present life, and the good pertaining to future lives).Who knows the Dhamma(dhammaññū): who knows the fourfold Dhamma (Mp-ṭ: the Dhamma of the four truths, or the four kinds ofdhammasdistinguished into those of the sense sphere, the form realm, the formless realm, and the world-transcending).Who knows the right measure(mattaññū): who knows the right measure in accepting and using the four requisites.Who knows the proper time(kālaññū): who knows the time thus, ‘This is the time for seclusion, this is the time for meditative attainment, this is the time for teaching the Dhamma, and this is the time for touring the country.’Who knows the assembly(parisaññū): who knows, ‘This is an assembly of khattiyas … this is an assembly of ascetics.’\"Possessing these five qualities, the Tathāgata … sets in motion the unsurpassed wheel of the Dhamma solely through the Dhamma, a wheel that cannot be turned back … by anyone in the world.\""
}