{
    "an5.142:1": "\"Bhikkhus, there are these five kinds of persons found in the world. What five?",
    "an5.142:2": "() \"Here, one person violates and does not become remorseful,[n.1141]Mp:\"He commits an offense, but rehabilitates himself and thus does not become remorseful.\"and does not understand as it really is the liberation of mind, liberation by wisdom, where these arisen bad unwholesome states of his cease without remainder.",
    "an5.142:3": "() \"Here, one person does not violateand yet becomes remorseful,[n.1142]Mp:\"Having committed an offense once, he rehabilitates himself but afterward, though he does not commit an offense, he cannot dispel remorse.\" This probably refers to the case, often cited in the Vinaya, where a monk wrongly believes that he has committed an offense.and does not understand as it really is the liberation of mind, liberation by wisdom, where these arisen bad unwholesome states of his cease without remainder.",
    "an5.142:4": "() \"Here, one person does not violate and does not become remorseful, and does not understand as it really is the liberation of mind, liberation by wisdom, where these arisen bad unwholesome states of his cease without remainder.",
    "an5.142:5": "() \"Here, one person does not violate and does not become remorseful, and understands as it really is the liberation of mind, liberation by wisdom, where these arisen bad unwholesome states of his cease without remainder.",
    "an5.142:6": "(1) \"Bhikkhus, the person among these who violates and then becomes remorseful, and does not understand as it really is the liberation of mind, liberation by wisdom, where these arisen bad unwholesome states of his cease without remainder, should be told: ‘Taints born of violation are found in you, and taints born of remorse increase. Please abandon the taints born of violation and dispel the taints born of remorse; then develop your mind and wisdom.[n.1143]Mp:\"Abandon the taints born of transgression by confessing the offense or by rehabilitating yourself from the offense. Then develop the mind of insight(vipassanācittaṁ)and the wisdom conjoined with it.\"In this way you will be exactly the same as the fifth type of person.’",
    "an5.142:7": "(2) \"The person among these who violates and does not become remorseful, and does not understand as it really is the liberation of mind, liberation by wisdom, where these arisen bad unwholesome states of his cease without remainder, should be told: ‘Taints born of violation are found in you, but taints born of remorse do not increase. Please abandon the taints born of violation, and then develop your mind and wisdom. In this way you will be exactly the same as the fifth type of person.’",
    "an5.142:8": "(3) \"The person among these who does not violate and yet becomes remorseful, and does not understand as it really is the liberation of mind, liberation by wisdom, where these arisen bad unwholesome states of his cease without remainder, should be told:‘Taints born of violation are not found in you, yet taints born of remorse increase. Please dispel the taints born of remorse, and then develop your mind and wisdom. In this way you will be exactly the same as the fifth type of person.’",
    "an5.142:9": "(4) \"The person among these who does not violate and does not become remorseful, and does not understand as it really is the liberation of mind, liberation by wisdom, where these arisen bad unwholesome states of his cease without remainder, should be told: ‘Taints born of violation are not found in you, and taints born of remorse do not increase. Please develop your mind and wisdom. In this way you will be exactly the same as the fifth type of person.’",
    "an5.142:10": "(5) \"Thus, bhikkhus, when persons of these four types are exhorted and instructed by the example of the fifth type of person, they gradually attain the destruction of the taints.\""
}