{
    "an5.144:1": "On one occasion the Blessed One was dwelling at Sāketa in the Tikaṇḍakī Grove. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an5.144:2": "\"(1) Bhikkhus, it is good for a bhikkhu from time to time to dwell perceiving the repulsive in the unrepulsive. () It is good for a bhikkhu from time to time to dwell perceiving the unrepulsive in the repulsive. (3) It is good for a bhikkhu from time to time to dwell perceiving the repulsive in both the unrepulsive and the repulsive. (4) It is good for a bhikkhu from time to time to dwell perceiving the unrepulsive in both the repulsive and the unrepulsive. (5) It is good for a bhikkhu from time to time to dwell equanimous, mindful and clearly comprehending, having turned away from both the repulsive and the unrepulsive.[n.1144] This mode of practice is explained at Paṭis II 1–13, where it is called the psychic potency of the noble ones(ariy’iddhi). The following explanations ofMpare drawn from that source: (1) \"Perceiving the repulsive in the unrepulsive(appaṭikūle paṭikūlasaññī): He observes a desirable object with the idea of its unattractiveness or he attends to it as impermanent. ()Perceiving the unrepulsive in the repulsive(paṭikūle appaṭikūlasaññī): He observes an undesirable object with loving-kindness or attends to it by way of elements. (3–4) In the third and fourth sections, he applies respectively the first and second methods to both kinds of objects. (5)To dwell equanimous(upekkhako vihareyya): this is the six-factored equanimity (that is, equanimity regarding the six sense objects) similar to that of an arahant. In this sutta, insight is explained in the five cases. It is possible for a bhikkhu who has initiated insight to do this; it is also possible for a knowledgeable, wise, and learned person to do this. The stream-enterer, once-returner, and non-returner definitely can do this; there is no need to say anything about the arahant.\"",
    "an5.144:3": "(1) \"And for the sake of what benefit should a bhikkhu dwell perceiving the repulsive in the unrepulsive? ‘Let no lust arise in me toward things provocative of lust!’: for the sake of this benefit a bhikkhu should dwell perceiving the repulsive in the unrepulsive.",
    "an5.144:4": "(2) \"And for the sake of what benefit should a bhikkhu dwell perceiving the unrepulsive in the repulsive? ‘Let no hatred arise in me toward things provocative of hatred!’: for the sake of this benefit a bhikkhu should dwell perceiving the unrepulsive in the repulsive.",
    "an5.144:5": "(3) \"And for the sake of whatbenefit should a bhikkhu dwell perceiving the repulsive in both the unrepulsive and the repulsive? ‘Let no lust arise in me toward things provocative of lust, and no hatred toward things provocative of hatred!’: for the sake of this benefit a bhikkhu should dwell perceiving the repulsive in both the unrepulsive and the repulsive.",
    "an5.144:6": "(4) \"And for the sake of what benefit should a bhikkhu dwell perceiving the unrepulsive in both the repulsive and the unrepulsive? ‘Let no hatred arise in me toward things provocative of hatred, and no lust toward things provocative of lust!’: for the sake of this benefit a bhikkhu should dwell perceiving the unrepulsive in both the repulsive and the unrepulsive.",
    "an5.144:7": "(5) \"And for the sake of what benefit should a bhikkhu dwell equanimous, mindful and clearly comprehending, having turned away from both the repulsive and the unrepulsive? ‘Let no lust at all arise in me anywhere in any way regarding things provocative of lust! Let no hatred at all arise in me anywhere in any way regarding things provocative of hatred! May no delusion at all arise in me anywhere in any way regarding things that breed delusion!’:[n.1145]Mā me kvacini katthaci kiñcana rajanīyesu dhammesu rāgo udapādi, mā me kvacini katthaci kiñcana dosanīyesu dhammesu doso udapādi, mā me kvacini katthaci kiñcana mohanīyesu dhammesu moho udapādī. The formulation here seems deliberately stronger and more comprehensive than in the previous cases.Mpglosses:Kvacanīti kismiñci ārammaṇe.Katthacīti kismiñci padese.Kiñcanati koci appamattakopi.for the sake of this benefit a bhikkhu should dwell equanimous, mindful and clearly comprehending, having turned away from both the repulsive and the unrepulsive.\""
}