{
    "an5.157:1": "\"Bhikkhus, a talk is wrongly addressed when, having weighed one type of person against another, it is addressed to these fiveinappropriatetypes of persons. What five? A talk on faith is wrongly addressed to one devoid of faith; a talk on virtuous behavior is wrongly addressed to an immoral person; a talk on learning is wrongly addressed to one of little learning; a talk on generosity is wrongly addressed to a miser; a talk on wisdom is wrongly addressed to an unwise person.",
    "an5.157:2": "(1) \"And why, bhikkhus, is a talk on faith wrongly addressed to one devoid of faith? When a talk on faith is being given, a person devoid of faith loses his temper and becomes irritated, hostile, and stubborn; he displays anger, hatred, and bitterness. For what reason? Because he does not perceive that faith in himself and obtain rapture and joy based upon it. Therefore a talk on faith is wrongly addressed to a person devoid of faith.",
    "an5.157:3": "(2) \"And why is a talk on virtuous behavior wrongly addressed to an immoral person? When a talk on virtuous behavior is being given, an immoral person loses his temper and becomes irritated, hostile, and stubborn; he displays anger, hatred, and bitterness. For what reason? Because he does not perceive that virtuous behavior in himself and obtain rapture and joy based upon it. Therefore a talk on virtuous behavior is wrongly addressed to an immoral person.",
    "an5.157:4": "(3) \"And why is a talk on learning wrongly addressed to a person of little learning? When a talk on learning is being given, a person of little learning loses his temper and becomes irritated, hostile, and stubborn; he displays anger, hatred, and bitterness. For what reason? Because he does not perceive that learning in himself and obtain rapture and joy based upon it. Therefore a talk on learning is wrongly addressed to a person of little learning.",
    "an5.157:5": "(4) \"And why is a talk on generosity wrongly addressed to a miser? When a talk on generosity is being given, a miser loses his temper and becomes irritated, hostile, and stubborn; he displays anger, hatred, and bitterness. For what reason? Because he does not perceive that generosity in himself andobtain rapture and joy based upon it. Therefore a talk on generosity is wrongly addressed to a miser.",
    "an5.157:6": "(5) \"And why is a talk on wisdom wrongly addressed to an unwise person? When a talk on wisdom is being given, an unwise person loses his temper and becomes irritated, hostile, and stubborn; he displays anger, hatred, and bitterness. For what reason? Because he does not perceive that wisdom in himself and obtain rapture and joy based upon it. Therefore a talk on wisdom is wrongly addressed to an unwise person.",
    "an5.157:7": "\"Bhikkhus, a talk is properly addressed when, having weighed one type of person against another, it is addressed to these fiveappropriatetypes of persons. What five? A talk on faith is properly addressed to one endowed with faith; a talk on virtuous behavior is properly addressed to a virtuous person; a talk on learning is properly addressed to a learned person; a talk on generosity is properly addressed to a generous person; a talk on wisdom is properly addressed to a wise person.",
    "an5.157:8": "(1) \"And why, bhikkhus, is a talk on faith properly addressed to one endowed with faith? When a talk on faith is being given, a person endowed with faith does not lose his temper and become irritated, hostile, and stubborn; he does not display anger, hatred, and bitterness. For what reason? Because he perceives that faith in himself and obtains rapture and joy based upon it. Therefore a talk on faith is properly addressed to a person endowed with faith.",
    "an5.157:9": "(2) \"And why is a talk on virtuous behavior properly addressed to a virtuous person? When a talk on virtuous behavior is being given, a virtuous person does not lose his temper and become irritated, hostile, and stubborn; he does not display anger, hatred, and bitterness. For what reason? Because he perceives that virtuous behavior in himself and obtains rapture and joy based upon it. Therefore a talk on virtuous behavior is properly addressed to a virtuous person.",
    "an5.157:10": "(3) \"And why is a talk on learning properly addressed to a learned person? When a talk on learning is being given, a learned person does not lose his temper and become irritated, hostile, andstubborn; he does not display anger, hatred, and bitterness. For what reason? Because he perceives that learning in himself and obtains rapture and joy based upon it. Therefore a talk on learning is properly addressed to a learned person.",
    "an5.157:11": "(4) \"And why is a talk on generosity properly addressed to a generous person? When a talk on generosity is being given, a generous person does not lose his temper and become irritated, hostile, and stubborn; he does not display anger, hatred, and bitterness. For what reason? Because he perceives that generosity in himself and obtains rapture and joy based upon it. Therefore a talk on generosity is properly addressed to a generous person.",
    "an5.157:12": "(5) \"And why is a talk on wisdom properly addressed to a wise person? When a talk on wisdom is being given, a wise person does not lose his temper and become irritated, hostile, and stubborn; he does not display anger, hatred, and bitterness. For what reason? Because he perceives that wisdom in himself and obtains rapture and joy based upon it. Therefore a talk on wisdom is properly addressed to a wise person."
}