{
    "an5.170:1": "On one occasion the Venerable Ānanda was dwelling at Kosambī in Ghosita's Park. Then the Venerable Bhaddaji approached the Venerable Ānanda and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side. The Venerable Ānanda then said to him:",
    "an5.170:2": "\"(1) There is, friend, Brahmā, the vanquisher, the unvanquished, the universal seer, the wielder of power. Getting to see Brahmā is the foremost sight. () There are the devas of streaming radiance who are suffused and inundated with happiness. They sometimes utter the inspired utterance: ‘Oh, what happiness! Oh, what happiness!’ Getting to hear that sound is the foremost kind of hearing. (3) There are the devas of refulgent glory. Being happy, they experience very peaceful happiness:[n.1167] I preferCete santaññeva sukhitā sukhaṁ paṭisaṁvedentito Be and Eete santaṁyeva tusitā sukhaṁ paṭivedenti.this is the foremost happiness. (4) There are the devas of the base of nothingness: this is the foremost perception. (5) There are the devas of the base of neither-perception-nor-non-perception: this is the foremost state of existence.\"",
    "an5.170:3": "\"The Venerable Ānanda is learned, so let him clear this up himself.\"",
    "an5.170:4": "\"(1) In whatever way, friend, one sees such that immediately afterward the destruction of the taints occurs:[n.1169]Anantarā āsavānaṁ khayo hoti. On the \"immediacy condition for the destruction of the taints,\" seeAN.162, n. 851.this is the foremost sight. (2) In whatever way one hears such that immediately afterward the destruction of the taints occurs: this is the foremost kind of hearing. (3) In whatever way one is happy such that immediately afterward the destruction of the taints occurs: this is the foremost happiness. () In whatever way one perceives such that immediately afterward the destruction of the taints occurs: this is the foremost perception. (5) In whatever way one exists such that immediately afterward the destruction of the taints occurs: this is the foremost state of existence.\""
}