{
    "an5.180:1": "On one occasion the Blessed One was wandering on tour among the Kosalans together with a large Saṅgha of bhikkhus. Then, while traveling along the highway, the Blessed One saw a large sal-tree grove in a certain place. He left the highway, entered the sal-tree grove, and smiled when he reached a certain place.",
    "an5.180:2": "Then it occurred to the Venerable Ānanda: \"Why did the Blessed One smile? Tathāgatas do not smile without a reason.\" Then the Venerable Ānandasaid to the Blessed One: \"Why, Bhante, did the Blessed One smile? Tathāgatas do not smile without a reason.\"",
    "an5.180:3": "\"In the past, Ānanda, in this place there was an affluent, prosperous, well-populated city, one teeming with people. Now the Blessed One, the Arahant, the Perfectly Enlightened One Kassapa lived in dependence on that city. The Blessed One Kassapa had a lay follower named Gavesī who had not fulfilled virtuous behavior. And Gavesī taught and guided five hundred lay followers who had not fulfilled virtuous behavior.",
    "an5.180:4": "\"Then Gavesī approached the five hundred lay followers and said to them: ‘From today on, you should consider me to be one fulfilling virtuous behavior.’ Then it occurred to those five hundred lay followers: ‘Master Gavesī is our benefactor, leader, and guide. Now Master Gavesī will fulfill virtuous behavior. Why shouldn’t we do so too?’",
    "an5.180:5": "\"Then Gavesī approached the five hundred lay followers and said to them: ‘From today on, you should consider me to be celibate, living apart, abstaining from sexual intercourse, the common person's practice.’ Then it occurred to those five hundred lay followers: ‘Master Gavesī is our benefactor, leader, and guide. Now Master Gavesī will be celibate, living apart, abstaining from sexual intercourse, the common person's practice. Why shouldn’t we do so too?’",
    "an5.180:6": "\"Then Gavesī approached the five hundred lay followers and said to them: ‘From today on, you should consider me to be eating once a day, refraining from a night meal, abstaining from eating outside the proper time.’ Then it occurred to those five hundred lay followers: ‘Master Gavesī is our benefactor, leader, and guide. Now Master Gavesī eats once a day, refraining from a night meal, abstaining from eating outside the proper time. Why shouldn’t we do so too?’",
    "an5.180:7": "\"Then Gavesī approached the Blessed One, the Arahant, the Perfectly Enlightened One Kassapa, and said to him: ‘Bhante, may I obtain the going forth and full ordination under the Blessed One?’ The lay follower Gavesī obtained the going forth and full ordination under the Blessed One, the Arahant, the Perfectly Enlightened One Kassapa. Soon after his full ordination, dwelling alone, withdrawn, heedful, ardent, and resolute, the bhikkhu Gavesī realized for himself with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness, and having entered upon it, he dwelled in it. He directly knew: ‘Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.’ And the bhikkhu Gavesī became one of the arahants.",
    "an5.180:8": "\"Then, Ānanda, it occurred to those five hundred lay followers: ‘Master Gavesī is our benefactor, leader, and guide. Now Master Gavesī, having shaved off his hair and beard and put on ochre robes, has gone forth from the household life into homelessness. Why shouldn’t we do so too?’",
    "an5.180:9": "(5) \"Then, Ānanda, it occurred to the bhikkhu Gavesī: ‘I obtain at will, without trouble or difficulty, the unsurpassed bliss of liberation. Oh, that these five hundred bhikkhus could obtain at will, without trouble or difficulty, the unsurpassed bliss of liberation!’ Then, Ānanda, dwelling each alone, withdrawn, heedful, ardent, and resolute, in no long time those five hundred bhikkhus realized for themselves with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness, and having entered upon it, they dwelled in it. They directly knew: ‘Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.’",
    "an5.180:10": "\"Thus, Ānanda, those five hundred bhikkhus headed by Gavesī, striving in successively higher and more sublime ways, realized the unsurpassed bliss of liberation.[n.1178] Here and just below I read withCeanuttaraṁ vimuttisukhaṁ. Be and Ee haveanuttaraṁ vimuttiṁ.Therefore, Ānanda, you should train yourselves thus: ‘Striving in successively higher and more sublime ways, we will realize the unsurpassed bliss of liberation.’ Thus, Ānanda, should you train yourselves.\""
}