{
    "an5.174:1": "Then the householder Anāthapiṇḍika approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "an5.174:2": "\"Householder, without having abandoned five perils and enmities, one is called immoral and is reborn in hell. What five? The destruction of life, taking what is not given, sexual misconduct, false speech, andindulging inliquor, wine, and intoxicants, the basis for heedlessness.Without having abandoned these five perils and enmities, one is called immoral and is reborn in hell.",
    "an5.174:3": "\"Householder, having abandoned five perils and enmities, one is called virtuous and is reborn in heaven. What five? The destruction of life … andindulging inliquor, wine, and intoxicants, the basis for heedlessness. Having abandoned these five perils and enmities, one is called virtuous and is reborn in heaven.",
    "an5.174:4": "(1) \"Householder, one who destroys life thereby engenders peril and enmity pertaining to the present life and the future life, and also experiences mental pain and dejection. One who abstains from the destruction of life does not engender peril and enmity pertaining to the present life and the future life, nor does he experience mental pain and dejection. For one who abstains from the destruction of life, that peril and enmity has thus subsided.",
    "an5.174:5": "(2) \"Householder, one who takes what is not given …",
    "an5.174:6": "(3) … engages in sexual misconduct …",
    "an5.174:7": "(4) … speaks falsely …",
    "an5.174:8": "(5) … indulges in liquor, wine, and intoxicants, the basis for heedlessness, thereby engenders peril and enmity pertaining to the present life and the future life, and also experiences mental pain and dejection. One who abstains from liquor, wine, and intoxicants, the basis for heedlessness, does not engender peril and enmity pertaining to the present life and the future life, nor does he experience mental pain and dejection. For one who abstains from liquor, wine, and intoxicants, the basis for heedlessness, that peril and enmity has thus subsided.\"",
    "an5.174:9": "There's a man in the world who destroys life,speaks falsely, and takes what is not given,who goes to the wives of others,and indulges in liquor and wine.",
    "an5.174:10": "Harboring within the five enmities,he is called immoral.With the breakup of the body,that unwise person is reborn in hell.",
    "an5.174:11": "But there is a man in the worldwho does not destroy life,speak falsely, take what is not given,go to the wives of others,or indulge in liquor and wine.",
    "an5.174:12": "Having abandoned the five enmities,he is called virtuous.With the breakup of the body,that wise person is reborn in heaven."
}