{
    "an5.26:1": "\"Bhikkhus, there are these five bases of liberation[n.989]Vimuttāyatanāni.Mp:\"Causes of being liberated\"(vimuccana-kāraṇāni).by means of which, if a bhikkhu dwells heedful, ardent, and resolute, his unliberated mind is liberated, his undestroyed taints are utterly destroyed, and he reaches the as-yet-unreached unsurpassed security from bondage.",
    "an5.26:2": "(1)What five? \"Here, bhikkhus, the Teacher or a fellow monk in the position of a teacher teaches the Dhamma to a bhikkhu. In whatever way the Teacher or that fellow monk in the position of a teacher teaches the Dhamma to the bhikkhu, in just that way he experiences inspiration in the meaning andinspiration in the Dhamma.[n.990]So tasmiṁ dhamme atthapaṭisaṁvedī ca hoti dhammapaṭisaṁvedī ca.Mpexplainsatthapaṭisaṁvedīas \"one knowing the meaning of the text\"(pāḷi-atthaṁ jānantassa)anddhammapaṭisaṁvedīas \"one knowing the text\"(pāḷiṁ jānantassa), but this explanation is certainly too narrow and anachronistic. AtAN6.10, we findlabhati atthavedaṁ labhati dhammavedaṁ, which I render \"(he) gains inspiration in the meaning, inspiration in the Dhamma.\" The stem ofpaṭisaṁvedīisvedī, which obviously connectsatthapaṭisaṁvedīanddhammapaṭisaṁvedītoatthavedaanddhammaveda. The rootvidis related both tovijjā, knowledge, andvedanā, feeling. Thus I suggestvedashould be understood as inspired knowledge, or \"inspiration,\" which gives rise topāmojjaandpīti, joy and rapture. It is likely thatatthapaṭisaṁvedīanddhammapaṭisaṁvedīare related toatthapaṭisambhidāanddhammapaṭisambhidā, though in Pāli the latter are connected to the verbbhindati, \"to break, to divide.\" See too pp. 1643–44, note 403.As he does so, joy arises in him. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated.[n.991]Mpexplains this to mean \"he is concentrated by the concentration of the fruit of arahantship\"(arahattaphalasamādhinā samādhiyati). It seems improbable to me that this was the original intention, for the context suggests that this is a concentration that serves asthe basisfor insight, and thereafter for the attainment of path and fruit, not a concentration that occurssubsequent torealization.This is the first basis of liberation, by means of which, if a bhikkhu dwells heedful, ardent, and resolute, his unliberated mind is liberated, his undestroyed taints are utterly destroyed, and he reaches the as-yet-unreached unsurpassed security from bondage.",
    "an5.26:3": "(2) \"Again, neither the Teacher nor a fellow monk in the position of a teacher teaches the Dhamma to a bhikkhu, but he himself teaches the Dhamma to others in detail as he has heard it and learned it. In whatever way the bhikkhuteaches the Dhamma to others in detail as he has heard it and learned it, in just that way, in relation to that Dhamma, he experiences inspiration in the meaning and inspiration in the Dhamma. As he does so, joy arises in him. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. This is the second basis of liberation, by means of which, if a bhikkhu dwells heedful, ardent, and resolute, his unliberated mind is liberated, his undestroyed taints are utterly destroyed, and he reaches the as-yet-unreached unsurpassed security from bondage.",
    "an5.26:4": "(3) \"Again, neither the Teacher nor a fellow monk in the position of a teacher teaches the Dhamma to a bhikkhu, nor does he himself teach the Dhamma to others in detail as he has heard it and learned it, but he recites the Dhamma in detail as he has heard it and learned it. In whatever way the bhikkhu recites the Dhamma in detail as he has heard it and learned it, in just that way, in relation to that Dhamma, he experiences inspiration in the meaning and inspiration in the Dhamma. As he does so, joy arises in him. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. This is the third basis of liberation, by means of which, if a bhikkhu dwells heedful, ardent, and resolute, his unliberated mind is liberated, his undestroyed taints are utterly destroyed, and he reaches the as-yet-unreached unsurpassed security from bondage.",
    "an5.26:5": "(4) \"Again, neither the Teacher nor a fellow monk in the position of a teacher teaches the Dhamma to a bhikkhu, nor does he teach the Dhamma to others in detail as he has heard it and learned it, nor does he recite the Dhamma in detail as he has heard it and learned it, but he ponders,examines, and mentally inspects the Dhamma as he has heard it and learned it. In whatever way the bhikkhu ponders, examines, and mentally inspects the Dhamma as he has heard it and learned it, in just that way, in relation to that Dhamma, he experiences inspiration in the meaning and inspiration in the Dhamma. As he does so, joy arises in him. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. This is the fourth basis of liberation, by means of which, if a bhikkhu dwells heedful, ardent, and resolute, his unliberated mind is liberated, his undestroyed taints are utterly destroyed, and he reaches the as-yet-unreached unsurpassed security from bondage.",
    "an5.26:6": "(5) \"Again, neither the Teacher nor a fellow monk in the position of a teacher teaches the Dhamma to a bhikkhu, nor does he teach the Dhamma to others in detail as he has heard it and learned it, nor does he recite the Dhamma in detail as he has heard it and learned it, nor does he ponder, examine, and mentally inspect the Dhamma as he has heard it and learned it, but he has grasped well a certain object of concentration, attended to it well, sustained it well, and penetrated it well with wisdom. In whatever way the bhikkhu has grasped well a certain object of concentration, attended to it well, sustained it well, and penetrated it well with wisdom, in just that way, in relation to that Dhamma, he experiences inspiration in the meaning and inspiration in the Dhamma. As he does so, joy arises in him. When he is joyful, rapture arises. For one with a rapturous mind, the body becomes tranquil. One tranquil in body feels pleasure. For one feeling pleasure, the mind becomes concentrated. This is the fifth basis of liberation, by means of which, if a bhikkhu dwells heedful, ardent, and resolute,his unliberated mind is liberated, his undestroyed taints are utterly destroyed, and he reaches the as-yet-unreached unsurpassed security from bondage.",
    "an5.26:7": "\"These, bhikkhus, are the five bases of liberation, by means of which, if a bhikkhu dwells heedful, ardent, and resolute, his unliberated mind is liberated, his undestroyed taints are utterly destroyed, and he reaches the as-yet-unreached unsurpassed security from bondage.\""
}