{
    "an5.90:1": "\"Bhikkhus, these five things lead to the decline of a bhikkhu who is a trainee. What five?",
    "an5.90:2": "() \"Again, a bhikkhu who is a trainee spends the day on some trifling work, so he neglects seclusion and does not devote himself to internalserenity of mind. This is the second thing that leads to the decline of a bhikkhu who is a trainee.",
    "an5.90:3": "() \"Again, a bhikkhu who is a trainee bonds closely with householders and monastics, socializing in an unfitting manner typical of laypeople,[n.1097]Ananulomikena gihisaṁsaggena.On the five kinds ofsaṁsagga, seeAN5.80, n. 1088.so he neglects seclusion and does not devote himself to internal serenity of mind. This is the third thing that leads to the decline of a bhikkhu who is a trainee.",
    "an5.90:4": "() \"Again, a bhikkhu who is a trainee enters a village too early and returns too late in the day, so he neglects seclusion and does not devote himself to internal serenity of mind. This is the fourth thing that leads to the decline of a bhikkhu who is a trainee.",
    "an5.90:5": "() \"Again, a bhikkhu who is a trainee does not get to hear at will, without trouble or difficulty, talk concerned with the austere life that is conducive to opening up the heart, that is, talk on fewness of desires, on contentment, on solitude, on not getting bound up (with others), on arousing energy, on virtuous behavior, on concentration, on wisdom, on liberation, on the knowledge and vision of liberation; so he neglects seclusion and does not devote himself to internal serenity of mind. This is the fifth thing that leads to the decline of a bhikkhu who is a trainee.",
    "an5.90:6": "\"Bhikkhus, these five things lead to the non-decline of a bhikkhu who is a trainee. What five?",
    "an5.90:7": "(2) \"Again, a bhikkhu who is a trainee does not spend the day on some trifling work, so he does not neglect seclusion but devotes himself to internal serenity of mind. This is the second thing that leads to the non-decline of a bhikkhu who is a trainee.",
    "an5.90:8": "(3) \"Again, a bhikkhu who is a trainee does not bond closely with householders and monastics, socializing in an unfitting manner typical of laypeople, so he does not neglect seclusion but devotes himself to internal serenity of mind.This is the third thing that leads to the non-decline of a bhikkhu who is a trainee.",
    "an5.90:9": "(4) \"Again, a bhikkhu who is a trainee does not enter a village too early or return too late in the day, so he does not neglect seclusion but devotes himself to internal serenity of mind. This is the fourth thing that leads to the non-decline of a bhikkhu who is a trainee.",
    "an5.90:10": "(5) \"Again, a bhikkhu who is a trainee gets to hear at will, without trouble or difficulty, talk concerned with the austere life that is conducive to opening up the heart, that is, talk on fewness of desires … on the knowledge and vision of liberation; so he does not neglect seclusion but devotes himself to internal serenity of mind. This is the fifth thing that leads to the non-decline of a bhikkhu who is a trainee."
}