{
    "an5.159:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Kosambī in Ghosita's Park. Now on that occasion the Venerable Udāyī, surrounded by a large assembly of laypeople, was sitting teaching the Dhamma.[n.54] This is Lāḷudāyī, often depicted as a presumptuous monk. Thus the Buddha’s words to follow should probably be read as a reproach to him for prematurely setting himself up as a teacher. Other examples of Udāyī's rashness are atAN3.80andAN5.66. AtAN6.29and again atMN 36.4c, III 208,25–3, he is reproached by the Buddha. In the Vinaya Piṭaka a certain Udāyī is depicted as a licentious monk whose misbehavior in sexual matters was responsible for the laying down of severalsaṅghādisesarules, but it is questionable whether he is identical with this Udāyī. He may even have been a fictional character, a \"John Doe\" used to account for the origin of these rules.The Venerable Ānanda saw this and approached the Blessed One, paid homage to him, sat down to one side, and said: \"Bhante, the Venerable Udāyī, surrounded by a large assembly of laypeople, is teaching the Dhamma.\"",
    "an5.159:2": "\"It isn’t easy, Ānanda, to teach the Dhamma to others. One who teaches the Dhamma to others should first set up five qualities internally. What five? (1) (Having determined:) ‘I will give a progressive talk,’ one should teach the Dhamma to others.[n.1155]Ānupubbīkathaṁ kathessāmi.Mp:\"One should teach the Dhamma to others after determining: ‘I will first speak about giving, next about virtuous behavior, and next about heaven; or I will explain a sutta passage or verse in accordance with the order of its words.’\"() (Having determined:) ‘I will give a talk that shows reasons,’ one should teach the Dhamma to others.[n.1156]Pariyāyadassāvī.Mp:\"Showing the reason(kāraṇa)for this or that point.\"(3) (Having determined:) ‘I will give a talk out of sympathy,’ one should teach the Dhamma to others. (4) (Having determined:) ‘I will not give a talk while intent on material gain,’ one should teach the Dhamma to others. (5) (Having determined:) ‘I will give a talk without harming myself or others,’ one should teach the Dhamma to others. It isn’t easy, Ānanda, to teach the Dhamma to others. One who teaches the Dhamma to others should first set up these five qualities internally.\""
}