{
    "an5.195:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Now on that occasion five hundred Licchavis were visiting the Blessed One. Some Licchavis were blue, with a blue complexion, clothed in blue, wearing blue ornaments. Some Licchavis were yellow, with a yellow complexion, clothed in yellow, wearing yellow ornaments. Some Licchavis were red, with a red complexion, clothed in red, wearing red ornaments. Some Licchavis were white, with a white complexion, clothed in white, wearing white ornaments. Yet the Blessed One outshone them all with his beauty and glory.",
    "an5.195:2": "Then the brahmin Piṅgiyānī rose from his seat, arranged his upper robe over one shoulder, and having reverently saluted the Blessed One, he said: \"An inspiration has come to me, Blessed One! An inspiration has come to me, Fortunate One!\"",
    "an5.195:3": "\"As the fragrant redkokanadalotusblooms in the morning, its fragrance unspent,behold Angīrasa radiantlike the sun beaming in the sky.\"",
    "an5.195:4": "Then those Licchavis presented the brahmin Piṅgiyānī with five hundred upper robes. The brahmin Piṅgiyānī presented those five hundred upper robes to the Blessed One.The Blessed One then said to those Licchavis:",
    "an5.195:5": "\"Licchavis, the manifestation of five gems is rare in the world.[n.1199] The following as atAN.143above.What five? (1) The manifestation of a Tathāgata, an Arahant, a Perfectly Enlightened One is rare in the world. (2) A person who can teach the Dhamma and discipline proclaimed by a Tathāgata is rare in the world. (3) When the Dhamma and discipline proclaimed by a Tathāgata has been taught, a person who can understand it is rare in the world. (4) When the Dhamma and discipline proclaimed by a Tathāgata has been taught, a person who can understand it and practice in accordance with the Dhamma is rare in the world. () A grateful and thankful person is rare in the world. Licchavis, the manifestation of these five gems is rare in the world.\""
}