{
    "an5.88:1": "\"Bhikkhus, possessing five qualities, an elder bhikkhu is acting for the harm of many people, for the unhappiness of many people, for the ruin, harm, and suffering of many people, of devas and humans.\"",
    "an5.88:2": "What five? (1) An elder is of long standing and has long gone forth. () He is well known and famous and has a retinue of many people, including householders and monastics. (3) He gains robes, almsfood, lodgings, and medicines and provisions for the sick. (4) He has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally, mentally investigated, and penetrated well by view.[n.1094]Bereads herediṭṭhiyā appaṭividdhā, \"not penetrated by view,\" which seems a learned \"correction\" to a stock formula. Otherwise we would have expected an adversative conjunction, such ascaorca pana, to prepare us for the variation on the usual reading. Ce and Ee have the familiardiṭṭhiyā suppaṭividdhā, which I follow.(5) He holds wrong view and has a distorted perspective.",
    "an5.88:3": "\"Bhikkhus, possessing five (other) qualities, an elder bhikkhu is acting for the welfare of many people, for the happiness of many people, for the good, welfare, and happiness of many people, of devas and human beings.",
    "an5.88:4": "What five?\"(1) An elder is of long standing and has long gone forth. (2) He is well known and famous and has a retinue of many people, including householders and monastics. (3) He gains robes, almsfood, lodgings, and medicines and provisions for the sick. () He has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning … he has penetrated well by view. (5) He holds right view and has a correct perspective."
}