{
    "an6.28:1": "On one occasion a number of elder bhikkhus were dwelling at Bārāṇasī in the deer park at Isipatana. Then, after their meal, on returning from their alms round, those elder bhikkhus assembled and were sitting together in the pavilion hall when this conversation arose among them: \"What, friends, is the proper occasion for going to see an esteemed bhikkhu?\"",
    "an6.28:2": "When this was said, one bhikkhu told those elders: \"Friends, after his meal, when an esteemed bhikkhu has returned from his alms round, washed his feet, and is sitting with his legs crossed, holding his body straight, having established mindfulness before him: that is the proper occasion for going to see him.\"",
    "an6.28:3": "When he had spoken, another bhikkhu told him: \"Friend, that isn’t the proper occasion for going to see an esteemed bhikkhu. After his meal, when an esteemed bhikkhu has returned from his alms round, washed his feet, and is sitting with his legs crossed, holding his body straight, having established mindfulness before him, his fatigue on account of his walkingfor almsand his meal has not yet subsided. Therefore that is not the proper occasion for going to see him. But in the evening, when an esteemed bhikkhu has emerged from seclusion and is sitting in the shade of his dwelling with his legs crossed, holding his body straight, having established mindfulness before him: that is the proper occasion for going to see him.\"",
    "an6.28:4": "When he had spoken, another bhikkhu told him: \"Friend, that isn’t the proper occasion for going to see an esteemed bhikkhu.In the evening, when an esteemed bhikkhu has emerged from seclusion and is sitting in the shade of his dwelling with his legs crossed, holding his body straight, having established mindfulness before him, the object of concentration that he attended to during the day is still present to him.[n.1298]Mp:\"On that occasion when he is sitting in his daytime dwelling it occurs in his mind door.\"Therefore that is not the proper occasion for going to see him. But when an esteemed bhikkhu has risen as the night begins to fade and is sitting with his legs crossed, holding his body straight, having established mindfulness before him: that is the proper occasion for going to see him.\"",
    "an6.28:5": "When he had spoken, another bhikkhu told him: \"Friend, that isn’t the proper occasion for going to see an esteemed bhikkhu. When an esteemed bhikkhu has risen as the night begins to fade and he is sitting with his legs crossed, holding his body straight, having established mindfulness before him, on that occasion his body is fresh; it is easy for him to attend to the teaching of the Buddhas. Therefore that is not the proper occasion for going to see him.\"",
    "an6.28:6": "When this was said, the Venerable Mahākaccāna said to those elder bhikkhus: \"Friends, in the presence of the Blessed One I heard and learned this:",
    "an6.28:7": "What six? (1) \"Here, bhikkhu, when a bhikkhu's mind is obsessed and oppressed by sensual lust, and he does not understand as it really is the escape from arisen sensual lust, on that occasion he should approach an esteemed bhikkhu and say to him: ‘Friend, my mind is obsessed and oppressed by sensual lust,and I do not understand as it really is the escape from arisen sensual lust. Please teach me the Dhamma for abandoning sensual lust.’ The esteemed bhikkhu then teaches him the Dhamma for abandoning sensual lust. This is the first proper occasion for going to see an esteemed bhikkhu. …",
    "an6.28:8": "(2) … obsessed and oppressed by ill will …",
    "an6.28:9": "(3) … obsessed and oppressed by dullness and drowsiness …",
    "an6.28:10": "(4) … obsessed and oppressed by restlessness and remorse …",
    "an6.28:11": "(5) … obsessed and oppressed by doubt …",
    "an6.28:12": "(6) … when a bhikkhu does not know and see what object to rely on and attend to in order to attain the immediate destruction of the taints …. The esteemed bhikkhu then teaches him the Dhamma for the destruction of the taints. This is the sixth proper occasion for going to see an esteemed bhikkhu.’",
    "an6.28:13": "\"Friends, in the presence of the Blessed One I heard and learned this: ‘These, bhikkhu, are the six proper occasions for going to see an esteemed bhikkhu.’\""
}