{
    "an6.24:1": "\"Bhikkhus, possessing six qualities, a bhikkhu might split the Himalayas, the king of mountains,[n.290] The text uses the singularhimavantaṁ pabbatarājaṁ. To conform to ordinary English usage I translatehimavantaṁas \"the Himalayas,\" despite apparent tension between the plural object and the singular \"the king of mountains.\"how much more then vile ignorance! What six? Here, a bhikkhu is () skilled in the attainment of concentration; (2) skilled in the duration of concentration; (3) skilled in emergence from concentration; (4) skilled in fitness for concentration; (5) skilled in the area of concentration; and (6) skilled in resolution regarding concentration.[n.29]Mp:\"He is skilled in the attainment of concentration(samādhissa samāpattikusalo): he is skilled in entering concentration, having comprehended what kind of food and climate is suitable.Skilled in the duration of concentration(samādhissa ṭhitikusalo): he is able to stabilize concentration.Skilled in emergence(samādhissa vuṭṭhānakusalo): he is able to emerge at the predetermined time.Skilled in fitness for concentration(samādhissa kallitakusalo): he is able to gladden the mind for concentration, to make it fit.Skilled in the area[or resort]of concentration(samādhissa gocarakusalo): having avoided those things that are unsuitable and unhelpful for concentration, pursuing those that are suitable and helpful, he knows, ‘This concentration takes a mark as its object; this one takes a characteristic as its object.’Skilled in resolution regarding concentration(samādhissa abhinīhārakusalo): in order to enter higher and higher meditative attainments, he is able to direct (the mind) to the concentration of the first jhāna and so forth.\" Mp-ṭ adds more information on these skills: \"Skilled in fitness: able to make the mind enter (concentration) by removing the states that are opposed and by evenly applying the collaborative causes of concentration.Skilled in the area: skilled in what is to be done to produce concentration; skilled in the place where it occurs, namely, the meditation subject; and skilled in yoking mindfulness and clear comprehension to the area for going on alms round.Skilled in resolution: able to direct or lead (the mind) to the concentration of the first jhāna, etc., because they pertain to distinction.\" For more on the skills needed to master concentration, seeAN7.40–4 and SN chap. 34.Possessing these six qualities, a bhikkhu might split the Himalayas, the king of mountains, how much more then vile ignorance!\""
}