{
    "an6.11:1": "\"Bhikkhus, there are these six principles of cordiality.[n.26]Dhammā sāraṇīyā.Mpexplainssāraṇīyāas if it meant \"fit to be remembered\"(saritabbayuttakā), but Edgerton, in BHSD (p. 593), regardssaṁrañjana,saṁrañjanīya, \"courteous, pleasing, polite, friendly,\" as the correct Skt equivalent. Five of these are atAN5.05, where they are called \"means of dwelling at ease\"(phāsuvihārā).What six?",
    "an6.11:2": "() \"Again, a bhikkhu maintains verbal acts of loving-kindness toward his fellow monks both openly and privately. This, too, is a principle of cordiality.",
    "an6.11:3": "() \"Again, a bhikkhu maintains mental acts of loving-kindness toward his fellow monks both openly and privately. This, too, is a principle of cordiality.",
    "an6.11:4": "() \"Again, a bhikkhu shares without reservation[n.1262]Appaṭivibhattabhogī.Mpexplains that there are two kinds of reservation(dve paṭivibhattāni), regarding things and regarding persons. Reservation regarding things means that one decides to give away so much and keep so much for oneself. Reservation regarding persons means that one decides to give to one person but not to another. The bhikkhu described here does not make either of these reservations.any righteous gains that have been righteously obtained, including even the contents of his alms bowl, and uses such things in common with his virtuous fellow monks. This, too, is a principle of cordiality.",
    "an6.11:5": "() \"Again, a bhikkhu dwells both openly and privately possessing in common with his fellow monks virtuous behavior that is unbroken, flawless, unblemished, unblotched, freeing, praised by the wise, ungrasped, leading to concentration. This, too, is a principle of cordiality.",
    "an6.11:6": "() \"Again, a bhikkhu dwells both openly and privately possessing in common with his fellow monks a view that is noble and emancipating, which leads out, for one who acts upon it, to the complete destruction of suffering. This, too, is a principle of cordiality.",
    "an6.11:7": "\"These, bhikkhus, are the six principles of cordiality.\""
}