{
    "an6.17:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the evening, the Blessed One emerged from seclusion and went to the meeting hall, where he sat down in the seat that was prepared. In the evening, the Venerable Sāriputta, too, emerged from seclusion and went to the meeting hall, wherehe paid homage to the Blessed One and sat down to one side. The Venerable Mahāmoggallāna … the Venerable Mahākassapa … the Venerable Mahākaccāyana … the Venerable Mahākoṭṭhita … the Venerable Mahācunda … the Venerable Mahākappina … the Venerable Anuruddha … the Venerable Revata … the Venerable Ānanda, too, emerged from seclusion and went to the meeting hall, where he paid homage to the Blessed One and sat down to one side.",
    "an6.17:2": "\"Bhikkhus, where is Sāriputta? Where is Mahāmoggallāna? Where is Mahākassapa? Where is Mahākaccāyana? Where is Mahākoṭṭhita? Where is Mahācunda? Where is Mahākappina? Where is Anuruddha? Where is Revata? Where is Ānanda? Where have those elder disciples gone?\"",
    "an6.17:3": "(2) \"What do you think, bhikkhus? Have you ever seen or heard that a royal official … () … a favorite son … (4) … a general … (5) … a village headman … (6) … a guild master, while exercising leadership over the guild all his life, is pleasing and agreeable to the guild if he spends as much time as he wants yielding to the pleasure of rest, the pleasure of sloth, the pleasure of sleep?\"",
    "an6.17:4": "\"Bhikkhus, what do you think? Suppose there is an ascetic or brahmin who spends as much time as he wants yielding to the pleasure of rest, the pleasure of sloth, the pleasure of sleep; one who does not guard the doors of the sense faculties, who is immoderate in eating, and is not intent on wakefulness; who lacks insight into wholesome qualities; who does not dwell intent on the endeavor to develop the aids to enlightenment in the earlier and later phases of the night. Have you ever seen or heard that such a one, with the destruction of the taints, has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwells in it?\"",
    "an6.17:5": "\"Therefore, bhikkhus, you should train yourselves thus: ‘We will guard the doors of the sense faculties, be moderate in eating, and be intent on wakefulness; we will have insight into wholesome qualities, and will dwell intent on the endeavor to develop the aids to enlightenment in the earlier and later phases of the night.’[n.1282] Also atAN.6.Thus, bhikkhus, should you train yourselves.\""
}