{
    "an6.43:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the morning, the Blessed One dressed, took his bowl and robe, and entered Sāvatthī for alms. When he had walked for alms in Sāvatthī, after his meal, on returning from his alms round, he addressed the Venerable Ānanda: \"Come, Ānanda, let us go to Migāramātā's Mansion in the Eastern Parkto pass the day.\"",
    "an6.43:2": "Then the Blessed One, together with the Venerable Ānanda, went to Migāramātā's Mansion in the Eastern Park.",
    "an6.43:3": "On that occasion, King Pasenadi of Kosala's bull elephant[n.116] The various applications of the wordnāgawill be explained just below. King's Pasenadi's bull elephant was called \"Seta\" (\"White\") because its body was white.named \"Seta\" was coming out through the eastern gate to the accompaniment of instrumental music and drumming. People saw him and said: \"The king's bull elephant is handsome! The king's bull elephant is beautiful! The king's bull elephant is graceful! The king's bull elephant is massive! He's a nāga, truly a nāga.\"",
    "an6.43:4": "\"It's astounding and amazing, Bhante, how well this was stated by the Blessed One: ‘But, Udāyī, in the world with its devas, Māra, and Brahmā, in this population with its ascetics and brahmins, its devas and humans, I call one a nāga who does no evil by body, speech, and mind.’ I rejoice, Bhante, in this good statement of the Blessed One with these verses:[n.1318]Mpidentifies this Udāyī with Kāludāyī. However, the same verses atTh 689–70are ascribed simply to Udāyī, while a different set of verses in Th (527–36) is ascribed to Kāludāyī. This proves that Mp's identification of the poet cannot be correct. There is a Chinese parallel of this sutta, MĀ 118 (at T I 608b2–609a3), which at several points proved helpful in my reading of the Pāli verses.",
    "an6.43:5": "\"A human being who is fully enlightened,self-tamed and concentrated,traveling on the path of brahmā,he takes delight in peace of mind.",
    "an6.43:6": "\"I have heard from the Arahantthat even the devas pay homage to him,to the same one whom humans venerate,the one who has gone beyond everything.",
    "an6.43:7": "\"He has transcended all fettersand emerged from the jungle to the clearing;[n.1319] Reading with Bevanā nibbanam āgataṁ. Ce and Ee havenibbānamin place ofnibbanam.Mpdraws out the word play: \"From the jungle of defilements, he has come to a clearing; he has reached nibbāna, devoid of the jungle of defilements\"(kilesavanato nibbanaṁ kilesavanarahitaṁ nibbānaṁ āgataṁ sampattaṁ). It seems that Ce and Ee have transposednibbānafrom the gloss into the text itself. The Chinese at T I 608c2has \"from the woods he has left the woods,\" which supports the Be reading.delighting in renunciation of sensual pleasures,he is like pure gold freed from its ore.",
    "an6.43:8": "\"He is the nāga who outshines all,like the Himalayas amid the other mountains.Among all things named nāga,he, unsurpassed, is the one truly named.[n.1320]Saccanāmois not \"one whose name is truth,\" but \"one who is truly named,\" whose name truly corresponds to his being.Mp:\"He is truly named, really named, accurately named ‘nāga’ just because of not doing evil\"(tacchanāmo bhūtanāmo āguṁ akaraṇeneva nāgoti evaṁ avitathanāmo). The Chinese (at T I 60c7) has, \"he is the nāga among all nāgas, in truth the nāga who is unsurpassed.\"",
    "an6.43:9": "\"I will extol for you the nāga:indeed, he does no evil.Mildness and harmlessnessare two feet of the nāga.",
    "an6.43:10": "\"Austerity and celibacyare the nāga's other two feet.[n.1321] There is a word play here between two meanings ofcaraṇa, \"conduct, behavior\" and \"feet.\"Mpglosses: \"They are the Buddhanāga's two hind feet.\"Faith is the great nāga's trunk,and equanimity his ivory tusks.",
    "an6.43:11": "\"Mindfulness is his neck, his head is wisdom,investigation, and reflection on phenomena.[n.1322]Sati gīvā siro paññā vīmaṁsā dhammacintanā. I translate the terms quite literally.Mp,however, says: \"The tip of the elephant's trunk is called investigation(vīmaṁsā)because (it investigates) things to determine whether they are hard or soft, edible or inedible, etc. He then rejects whatever should be rejected and takes whatever should be taken. So, for the Buddha-nāga,reflection on phenomena(dhammacintanā)—referring to his knowledge that determines the classes of phenomena—is his (means of) investigation. With this knowledge he knows who is capable and who incapable.\" The Chinese at 608crenders the line in a more straightforward way:, \"wisdom is his head, reflection on and discrimination of phenomena.\"Dhamma is the balanced heat of his belly,and seclusion is his tail.[n.1323] In pāda c I readsamātapowith Be and Ee, as against Cesamāvāpo.Mp:\"It is the concentration of the fourth jhāna that is here calleddhamma. For it is on this basis that the supernormal powers succeed. Therefore it is calledbalanced heat of the belly(kucchisamātapo).Seclusion(viveka)refers to bodily seclusion, mental seclusion, and seclusion from the acquisitions(kāyacittaupadhiviveko). As the elephant uses its tail to ward off mosquitoes, so the Tathāgata resorts to seclusion to ward off householders and monks.\" The Chinese reads the couplet (at 608c12) as, \"upholding dharmas is his belly, and delight in seclusion is his pair of arms.\" Apparently in this transmission,vāladhiof the Pāli came down asbāhūni.",
    "an6.43:12": "\"This meditator, delighting in consolation,[n.1324]Assāsacan mean both inhalation and consolation, the latter referring to arahantship.Mpsays that just as inhalation and exhalation are what keeps the elephant alive, so fruition attainment(phalasamāpatti)is essential to the Buddha, and it is there that he delights.is inwardly well concentrated.When walking, the nāga is concentrated;when standing, the nāga is concentrated.",
    "an6.43:13": "\"When lying down, the nāga is concentrated;when sitting, too, the nāga is concentrated.Everywhere, the nāga is restrained:this is the nāga's accomplishment.",
    "an6.43:14": "\"He eats blameless food,but doesn’t eat what is blameworthy.When he gains food and clothing,he avoids storing it up.",
    "an6.43:15": "\"Having cut off all fetters and bonds,whether they be gross or subtle,in whatever direction he goes,he goes without concern.",
    "an6.43:16": "\"The lotus floweris born and grown up in water,yet is not soiled by the waterbut remains fragrant and delightful.",
    "an6.43:17": "\"Just so the Buddha, well born in the world,dwells in the world,[n.1325] Reading withBeloke viharati. Ce and Eeloke virajjatimeans \"becomes detached in the world,\" which does not match the simile as well.yet is not soiled by the world likethe lotus (unsoiled) by water.",
    "an6.43:18": "\"A great fire all ablazesettles down when deprived of fuel,and when all the coals have gone out,it is said to be extinguished.[n.1326] In place ofsaṅkhāresūpasantesuin pāda c (the reading of all three editions), I read here with a pair of Burmese manuscripts (referred to in a note in Ee):aṅgāresu ca santesu, nibbutoti pavuccati. The reading is also found atTh 702. Vanarata points out that \"the whole verseisthe simile andnibbuto(meaning both an extinguished fire and a person who has attained nibbāna) refers to the fire.\" The Chinese (at 608c27), in agreement with Th and the Burmese manuscripts, has, \"Without firewood, the fire does not continue. This fire is then said to have ceased.\"",
    "an6.43:19": "\"This simile, which conveys the meaning,was taught by the wise.Great nāgas will know the nāgathat was taught by the nāga.[n.1327]Mp:\"Other arahant nāgas will know the Buddha-nāga that was taught by the nāga, the elder Udāyī.\" DespiteMp,I suspect the text itself intendsthe Buddha himselfas the one who taught about the nāga. The Chinese (at 608c29) supports my suspicion:, \"it was spoken by the nāga among nāgas.\"",
    "an6.43:20": "\"Devoid of lust, devoid of hatred,devoid of delusion, without taints,the nāga, discarding his body,taintless, is utterly quenchedand attains final nibbāna.\"[n.1328] Reading withEeparinibbāti ‘nāsavo, as against Ce and Beparinibbissati anāsavo. This verse completes the simile with the fire. The analogy is clearer in the Chinese (at 609a2), where, \"this nāga is said to have attained nibbāna,\" echoes 608c27,, \"this fire is said to have ceased.\" I have attempted to capture this effect by translatingparinibbātitwice, first as quenched and then in terms of its doctrinal meaning."
}