{
    "an6.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an6.1:2": "\"Bhikkhus, possessing six qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What six? (1) Here, having seen a form with the eye, a bhikkhu is neither joyful nor saddened, but dwells equanimous, mindful, and clearly comprehending.[n.151]N’eva sumano hoti na dummano, upekkhako viharati sato sampajāno.Mp:\"Neither joyful nor saddened: (filled) with joy accompanied by lust in regard to a desirable object.Nor[is he]saddened: (filled) with sadness accompanied by aversion in regard to an undesirable object.But[he]dwells equanimous, mindful, and clearly comprehending: He is not equanimous because he has fallen into the ‘equanimity of unknowing’(aññāṇ’upekkhā)through apathy in the case of a neutral object; but rather, being mindful and clearly comprehending, he maintains neutrality in relation to the object. In this sutta, the constant dwelling of an arahant is discussed.\"() Having heard a sound with the ear, a bhikkhu is neither joyful nor saddened, but dwells equanimous, mindful, and clearly comprehending. (3) Having smelled an odour with the nose, a bhikkhu is neither joyful nor saddened, but dwells equanimous, mindful, and clearly comprehending. (4) Having experienced a taste with the tongue, a bhikkhu is neither joyful nor saddened, but dwells equanimous, mindful, and clearly comprehending. (5) Having felt a tactile object with the body, a bhikkhu is neither joyful nor saddened, but dwells equanimous, mindful, and clearly comprehending. (6) Having cognized a mental phenomenon with the mind, a bhikkhu is neither joyful nor saddened, but dwells equanimous, mindful, and clearly comprehending. Possessing these six qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.\"",
    "an6.1:3": "This is what the Blessed One said. Elated, those bhikkhus delighted in the Blessed One's statement."
}