{
    "an6.29:1": "Then the Blessed One addressed the Venerable Udāyī: \"Udāyī, how many subjects of recollection are there?\"",
    "an6.29:2": "Then the Venerable Ānanda said to the Venerable Udāyī: \"The Teacher is addressing you, friend Udāyī.\"",
    "an6.29:3": "Then the Blessed One addressed the Venerable Ānanda: \"I knew, Ānanda, that this hollow man Udāyī does not devote himself to the higher mind.[n.1299]Adhicittaṁ.Mp:\"The mind of concentration and insight.\" The bhikkhu Udāyī (Lāḷudāyī) often blunders in his explanation of doctrinal points and is then reproached by the Buddha.How many subjects of recollection are there, Ānanda?\"",
    "an6.29:4": "\"There are, Bhante, five subjects of recollection. What five?",
    "an6.29:5": "(2) \"Again, Bhante, a bhikkhu attends to the perception of light; he focuses on the perception of day thus: ‘As by day, so at night; as at night, so by day.’ Thus, with a mind that is open and uncovered, he develops a mind imbued with luminosity.[n.1301]Yathā divā tathā rattiṁ, yathā rattiṁ tathā divā. Also atAN4.41.Mpexplains: \"As by day he attends to the perception of light, just so does he attend to it at night. As at night he attends to the perception of light, just so does he attend to it during the day.Obtaining knowledge and vision: this is obtaining the divine eye, called knowledge and vision.\"This subject of recollection, developed and cultivated in this way, leads to obtaining knowledge and vision.",
    "an6.29:6": "(3) \"Again, Bhante, a bhikkhu reviews this very body upward from the soles of the feet, downward from the tips of the hairs, enclosed in skin, as full of many kinds of impurities: ‘There are in this body head hairs, body hairs, nails, teeth, skin, flesh, sinews, bones, bone marrow, kidneys, heart, liver, pleura, spleen, lungs, intestines, mesentery, stomach, excrement, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, snot, fluid of the joints, urine.’ This subject of recollection, developed and cultivated in this way, leads to abandoning sensual lust.",
    "an6.29:7": "(4) \"Again, Bhante, suppose a bhikkhu were to see a corpse thrown aside in a charnel ground, one, two,or three days dead, bloated, livid, and festering. He compares his own body with it thus: ‘This body, too, is of the same nature; it will be like that; it is not beyond that.’[n.1302] Here and below are the nine charnel ground contemplations, as in the Satipaṭṭhāna Sutta, atDN 22.21–29, II 295–9;MN 10.13–2, I 58–59.",
    "an6.29:8": "Or suppose he were to see a corpse thrown aside in a charnel ground, being devoured by crows, hawks, vultures, dogs, jackals, or various kinds of living beings. He compares his own body with it thus: ‘This body, too, is of the same nature; it will be like that; it is not beyond that.’",
    "an6.29:9": "Or suppose he were to see a corpse thrown aside in a charnel ground, a skeleton with flesh and blood, held together with sinews … a fleshless skeleton smeared with blood, held together with sinews … a skeleton without flesh and blood, held together with sinews … disconnected bones scattered in all directions: here a handbone, there a footbone, here a shinbone, there a thighbone, here a hipbone, there a backbone, and there the skull. He compares his own body with it thus: ‘This body, too, is of the same nature; it will be like that; it is not beyond that.’ Or suppose he were to see a corpse thrown aside in a charnel ground, bones bleached white, the color of shells … bones heaped up, more than a year old … bones rotted, crumbled to dust. He compares his own body with it thus:‘This body, too, is of the same nature; it will be like that; it is not beyond that.’ This subject of recollection, developed and cultivated in this way, leads to the uprooting of the conceit ‘I am.’",
    "an6.29:10": "(5) \"Again, Bhante, with the abandoning of pleasure and pain, and with the previous passing away of joy and dejection, a bhikkhu enters and dwells in the fourth jhāna, neither painful nor pleasant, which has purification of mindfulness by equanimity. This subject of recollection, developed and cultivated in this way, leads to the penetration of numerous elements.[n.1303] This must be referring to the fourth jhāna as the basis for the six kinds of direct knowledge.",
    "an6.29:11": "\"Good, good, Ānanda! Therefore, Ānanda, remember this sixth subject of recollection, too."
}