{
    "an6.13:1": "\"Bhikkhus, there are these six elements of escape.[n.263]Nissāraṇīyā dhātuyo. CompareAN5.200, which describes a different set of \"elements of escape.\"What six?",
    "an6.13:2": "() \"Then, a bhikkhu might say thus: ‘I have developed and cultivated the liberation of the mind by compassion, made it my vehicle and basis, carried it out, consolidated it, and properly undertaken it, yet the thought of harming still obsesses my mind.’ He should be told: ‘Not so! Do not speak thus. Do not misrepresent the Blessed One; for it is not good to misrepresent the Blessed One. The Blessed One would certainly not speak in such a way. It is impossible and inconceivable, friend, that one might develop and cultivate the liberation of the mind by compassion, make it one's vehicle and basis, carry it out, consolidate it, and properly undertake it, yet the thought of harming could still obsess one's mind. There is no such possibility. For this, friend, is the escape from the thought of harming, namely, the liberation of the mind by compassion.’",
    "an6.13:3": "() \"Then, a bhikkhu might say thus: ‘I have developed and cultivated the liberation of the mind by altruistic joy, made it my vehicle and basis, carried it out, consolidated it, and properly undertaken it, yet discontent still obsesses my mind.’[n.1264]Arati. This word usually signifies dissatisfaction with the life of renunciation.He should be told: ‘Not so! Do not speak thus. Do not misrepresent the Blessed One; for it is not good to misrepresent the Blessed One. The Blessed One would certainly not speak in such a way. It is impossible and inconceivable, friend, that one might develop and cultivate the liberation of the mind by altruistic joy, make it one's vehicle and basis, carry it out, consolidate it, and properly undertake it, yet discontent could still obsess one's mind. There is no such possibility. For this, friend, is the escape from discontent, namely, the liberation of the mind by altruistic joy.’",
    "an6.13:4": "() \"Then, a bhikkhu might say thus: ‘I have developed and cultivated the liberation of the mind by equanimity, made it my vehicle and basis, carried it out, consolidated it, and properly undertaken it, yet lust still obsesses my mind.’ He should be told: ‘Not so! Do not speak thus. Do not misrepresent the Blessed One; for it is not good to misrepresent the Blessed One. The Blessed One would certainly not speak in such a way. It is impossible and inconceivable, friend, that one might develop and cultivate the liberation of the mind by equanimity, make it one's vehicle and basis, carry it out, consolidate it, and properly undertake it,yet lust could still obsess one's mind. There is no such possibility. For this, friend, is the escape from lust, namely, the liberation of the mind by equanimity.’[n.1265] This text uses the wordrāga, which in this context probably means personal bias rather than sensual desire. Interestingly, at MN I 2,33–3,upekkhāis opposed topaṭigha, aversion, the polar opposite ofrāga. Given thatupekkhāis a state of inner poise beyond both attraction and repulsion, it is not surprising to find it offered as the antidote to the two opposed qualities.",
    "an6.13:5": "() \"Then, a bhikkhu might say thus: ‘I have developed and cultivated the markless liberation of the mind,[n.1266]Animittā cetovimutti.Mp:\"The markless liberation of mind: strong insight(balavavipassanā). But the reciters of the Dīgha Nikāya say it is the meditative attainment of the fruit of arahantship(arahattaphalasamāpattī); for that is said to be markless because it lacks the marks of lust, etc., the marks of form, etc., and the marks of permanence, etc.(sā hi rāganimittādīnañc’eva rūpanimittādīnañca niccanimittādīnañca abhāvā animittā ti vuttā).made it my vehicle and basis, carried it out, consolidated it, and properly undertaken it, yet my consciousness still follows after marks.’[n.1267]Nimittānusārī.Mp:\"Follows after marks: follows along with the aforesaid marks.\" The \"aforesaid marks\" are those mentioned in the preceding note.He should be told: ‘Not so! Do not speak thus. Do not misrepresent the Blessed One; for it is not good to misrepresent the Blessed One. The Blessed One would certainly not speak in such a way. It is impossible and inconceivable, friend, that one might develop and cultivate the markless liberation of the mind, make it one's vehicle and basis, carry it out, consolidate it, and properly undertake it, yet one's consciousness could still follow after marks. There is no such possibility. For this, friend, is the escape from all marks, namely, the markless liberation of the mind.’",
    "an6.13:6": "() \"Then, a bhikkhu might say: ‘I have discarded (the notion) \"I am,\" and I do not regardanything as\"This I am,\" yet the dart of doubt and bewilderment still obsesses my mind.’ He should be told: ‘Not so! Do not speak thus. Do not misrepresent the Blessed One; for it is not good to misrepresent the Blessed One. The Blessed One would certainly not speak in such a way. It is impossible and inconceivable, friend, that whenthe notion\"I am\" has been discarded, and one does not regardanything as\"This I am,\" the dart of doubt and bewilderment could still obsess one's mind. There is no such possibility. For this, friend, is the escape from the dart of doubt and bewilderment, namely, the uprooting of the conceit \"I am.\"’[n.128] In the standard correlation between stages of attainment and removal of defilements, doubt and bewilderment along with the view \"This I am\" are eliminated with the attainment of stream-entry, and the conceit \"I am\" with the attainment of arahantship (see SN22:89, III 12–32). In the present passage, the persistence of doubt is taken as a criterion for determining that someone has not removed the conceit \"I am.\"",
    "an6.13:7": "\"These, bhikkhus, are the six elements of escape.\""
}