{
    "an6.54:1": "On one occasion the Blessed One was dwelling in Rājagaha on Mount Vulture Peak. On that occasion the Venerable Dhammika was the resident monk in his native district, in all the seven monasteries in his native district.[n.359]Mpdoes not give information about him and he does not appear elsewhere in the Nikāyas.There the Venerable Dhammika insulted visiting bhikkhus, reviled them, harmed them, attacked them, and scolded them, and then those visiting bhikkhus left. They did not settle down but vacated the monastery.",
    "an6.54:2": "Then it occurred to the lay followers of the native district: \"We serve the Saṅgha of bhikkhus with robes, almsfood, lodgings, and medicines and provisions for the sick, but the visiting bhikkhus leave. They do not settle down but vacate the monastery. Why is that so?\"",
    "an6.54:3": "Then the lay followers went to the Venerable Dhammika and said to him: \"Bhante, leave this monastery. You’ve stayed here long enough.\"",
    "an6.54:4-5": "Then it occurred to the lay followers …all as above… and said to him: \"Bhante, leave this monastery. You’ve stayed here long enough.\"",
    "an6.54:6": "Then it occurred to the lay followers: \"We serve the Saṅgha of bhikkhus with robes, almsfood, lodgings, and medicines and provisions for the sick, but the visiting bhikkhus leave. They do not settle down but vacate the monastery. Why is that so?\"",
    "an6.54:7": "Then the Venerable Dhammika took his bowl and robe and left for Rājagaha. Gradually he reached Rājagaha, and then went to Mount Vulture Peak, where he approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then asked him: \"Where are you coming from, Brahmin Dhammika?\"[n.1360] Strangely, neitherMpnor Mp-ṭ explains why the Buddha refers to Dhammika asbrāhmaṇa. This may be the only place in the Nikāyas where the Buddha refers to a bhikkhu as a brahmin followed by his personal name.",
    "an6.54:8": "In the past, Brahmin Dhammika, some seafaring merchants set out to sea in a ship, taking along a land-spotting bird. When the ship had still not caught sight of land they released the bird. It went to the east, the west, the north, the south, upward, and to the intermediate directions. If it saw land anywhere, it went straight for it. But if it didn’t see land, it returned to the ship. In the same way, when you have been banished from those places, you’ve come to me.\"",
    "an6.54:9": "\"In the past, Brahmin Dhammika, King Koravya had a royal banyan tree named ‘Well Grounded,’ which had five branches, cast a cool shade, and gave delight. Its canopy extended for twelveyojanas; its network of roots for fiveyojanas. Its fruits were as large as cooking pots and as sweet as pure honey. The king and his harem made use of one section of the tree, the army used another section, the townfolk and countryfolk used still another, ascetics and brahmins used still another, and the beasts and birds used still another. No one guarded the tree's fruits, yet no one took another's fruits.",
    "an6.54:10": "\"Then, Brahmin Dhammika, a certain man ate as much as he wanted of the tree's fruits, broke off a branch, and left. It occurred to the deity who lived in the tree: ‘It's astounding and amazing how evil this man is! He ate as much as he wanted of the tree's fruits, broke off a branch, and left! Let me see to it that in the future the royal banyan tree does not yield fruit.’ Then in the future the royal banyan tree did not yield fruit.",
    "an6.54:11": "ThereuponKing Koravya approached Sakka the ruler of the devas and said to him: ‘Listen, respected sir, you should know that the royal banyan tree does not yield fruit.’",
    "an6.54:12": "Sakka approached this deity and said: ‘Why, deity, do you stand to one side, sad and miserable, weeping with a tearful face?’ – ‘It is, sir, because a violent rainstorm came and twisted and uprooted my dwelling.’ – ‘But, deity, were you following the duty of a tree when the violent rainstorm came and twisted and uprooted your dwelling?’ – ‘But how, sir, does a tree follow the duty of a tree?’ – ‘Here, deity, those who need roots take its roots; those who need bark take its bark; those who need leaves take its leaves; those who need flowers take its flowers; and those who need fruit take its fruit. Yet because of this the deity does not become displeased or discontent. That's how a tree follows the duty of a tree.’ – ‘Sir, I wasn’t following the duty of a tree when the violent rainstorm came and twisted and uprooted my dwelling.’ – ‘If, deity, you would follow the duty of a tree, your dwelling might return to its former state.’ – ‘I will, sir, followthe duty of a tree. Let my dwelling be as before.’",
    "an6.54:13": "\"Then, Brahmin Dhammika, Sakka the ruler of the devas performed such a feat of psychic potency that a violent rainstorm came and turned upright the royal banyan tree and its roots were covered with bark. So too, Brahmin Dhammika, were you following the duty of an ascetic when the lay followers of the native district banished you from all seven monasteries?\"",
    "an6.54:14": "(1) \"In the past, Brahmin Dhammika, there was a teacher named Sunetta, the founder of a spiritual sect, one without lust for sensual pleasures. The teacher Sunetta had many hundreds of disciples. He taught a Dhamma to his disciples for companionship with the brahmā world.[n.1362]Brahmalokasahavyatāya. An odd expression, which also occurs atDN 19.95, II 250,20. Sv II 670,13–says: \"‘He taught the path to disciples for companionship with the brahmā world’: that is, he explained the path to fellowship with Brahmā in the brahmā world\"(sāvakānañca brahmalokasahabyatāya maggaṁ desesī ti brahmaloke brahmunā sahabhāvāya maggaṁ kathesi).When he was teaching such a Dhamma, those who did not place confidence in him were, with the breakup of the body, after death, reborn in the plane of misery, in a bad destination, in the lower world, in hell; but those who placed confidence in him were reborn in a good destination, in a heavenly world.",
    "an6.54:15-18": "(2) \"In the past, there was a teacher named Mūgapakkha … (3) … a teacher named Aranemi … (4) … a teacher named Kuddālaka … (5) … a teacher named Hatthipāla …",
    "an6.54:19": "(6) …a teacher named Jotipāla, the founder of a spiritual sect, one without lust for sensual pleasures …. When he was teaching such a Dhamma, those who did not place confidence in him were, with the breakup of the body, after death, reborn in the plane of misery, in a bad destination, in the lower world, in hell; but those who placed confidence in him were reborn in a good destination, in a heavenly world.",
    "an6.54:20": "\"What do you think, Brahmin Dhammika? These six teachers were founders of spiritual sects, men without lust for sensual pleasures who had retinues of many hundreds of disciples. If, with a mind of hatred, one had insulted and reviled them and their communities of disciples, wouldn’t one have generated much demerit?\"",
    "an6.54:21": "Sunetta, Mūgapakkha,the brahmin Aranemi,Kuddālaka, and Hatthipāla,the brahmin youth, were teachers.",
    "an6.54:22": "And Jotipālaknown asGovindathe chaplain of sevenkings:these were harmless ones in the past,six teachers possessed of fame.",
    "an6.54:23": "Unspoiled, liberated by compassion,these men had transcended the fetter of sensuality.Having expunged sensual lust,they were reborn in the brahmā world.",
    "an6.54:24": "Their disciples toonumbering many hundredswere unspoiled, liberated in compassion,men who had transcended the fetter of sensuality.Having expunged sensual lust,they were reborn in the brahmā world.",
    "an6.54:25": "That man who, with thoughts of hatred,reviles these outside seers devoid of lustwhose mindswere concentrated,generates abundant demerit.",
    "an6.54:26": "But the man who, with thoughts of hatred,reviles a disciple of the Buddha,a bhikkhu accomplished in view,generates even more demerit.",
    "an6.54:27": "One should not attack a holy personone who has abandoned viewpoints.This one is called the seventh personof the Saṅgha of noble ones,",
    "an6.54:28": "one not devoid of lust for sensual pleasures,whose five faculties are weak:faith, mindfulness, energy,serenity, and insight.",
    "an6.54:29": "If one attacks such a bhikkhu,one first harms oneself;then, having harmed oneself,one afterward harms the other.",
    "an6.54:30": "When one protects oneself,the other person is also protected.Therefore one should protect oneself;the wise person is always unhurt."
}