{
    "an6.62:1": "Thus have I heard. On one occasion the Blessed One was wandering on tour among the Kosalans together with a large Saṅgha of bhikkhus when he arrived at a Kosalan town named Daṇḍakappaka. Then the Blessed One left the highway and sat down on a seat that was prepared for him at the foot of a tree, and those bhikkhus entered Daṇḍakappaka to search for a rest house.",
    "an6.62:2": "Then the Venerable Ānanda together with a number of bhikkhus went down to the Aciravatī River to bathe. Having finished bathing and come back out, he stood in one robe drying his body. Then a certain bhikkhu approached the Venerable Ānanda and said to him: \"Friend Ānanda, was it after full consideration that the Blessed One declared of Devadatta: ‘Devadatta is bound for the plane of misery, bound for hell, and he will remain there for the eon, unredeemable,’ or did he say this only figuratively?\"",
    "an6.62:3": "Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, andreported what had happened, ending:\"When this was said, Bhante, I said to that bhikkhu: ‘It was just in this way, friend, that the Blessed One declared it.’\"",
    "an6.62:4": "The Blessed One said:\"Ānanda, that bhikkhu must be either newly ordained, not long gone forth, or a foolish and incompetent elder. For when this was declared by me definitively, how can he see any ambiguity in it?[n.10]Kathañhi nāma yaṁ mayā ekaṁsena byākataṁ tattha dvejjhā āpajjissati. The Buddha’s statement here belongs to his first way of answering a question, namely, by making a categorical assertion. On the four ways of answering a question, seeAN3.67,AN.2.I do not see even one other person, Ānanda, about whom I have made a declaration after giving him such full consideration as Devadatta. As long as I saw even a mere fraction of a hair's tip of a bright quality in Devadatta, I did not declare of him: ‘Devadatta is bound for the plane of misery, bound for hell, and he will remain there for an eon, unredeemable.’ It was, Ānanda, only when I did not see even a mere fraction of a hair's tip of a bright quality[n.105]Vālaggakoṭinittudanamattampi sukkadhammaṁ.Mp:\"An amount that could be seen on the tip of a hair; or an amount that could be poked with the tip of a hair.\"in Devadatta that I declared this of him.",
    "an6.62:5": "\"Suppose there was a cesspit deeper than a man's height full of feces right up to the top, and a man was sunk in it so that his head was submerged. Then a man would appear desiring his good, welfare, and security, wishing to pull him out from the cesspit. He would go around the cesspit on all sides but would not see even a mere fraction of a hair's tip of the man not smeared with feceswhere he might get a grip and pull him out. So too, Ānanda, it was only when I did not see even a mere fraction of a hair's tip of a bright quality in Devadatta that I declared of him: ‘Devadatta is bound for the plane of misery, bound for hell, and he will remain there for an eon, unredeemable.’",
    "an6.62:6": "\"It is the time for this, Blessed One! It is the time for this, Fortunate One! The Blessed One should analyze his knowledges of a person's faculties. Having heard this from the Blessed One, the bhikkhus will retain it in mind.\"",
    "an6.62:7": "(1) \"Here, Ānanda, having encompassed his mind with my own mind, I understand some person thus: ‘Wholesome qualities and unwholesome qualities are found in this person.’ On a later occasion, having encompassed his mind with my own mind, I understand him thus: ‘This person's wholesome qualities have disappeared, unwholesome qualities are manifest, but he has a wholesome root that has not been eradicated. From that wholesome root[n.140] I read withCekusalamūlā, as against Be and Eekusalā.of his the wholesome will appear. Thus this person will not be subject to decline in the future.’ Suppose seeds that are intact, unspoiled, not damaged by wind and the sun's heat, fecund, well preserved, were deposited in well-prepared soil in a good field. Wouldn’t you know: ‘These seeds will grow, increase, and mature’?\"",
    "an6.62:8": "(2) \"Then, Ānanda, having encompassed his mind with my own mind, I understand some person thus: ‘Wholesome qualities and unwholesome qualities are found in this person.’ On a later occasion, having encompassed his mind with my own mind, I understand him thus: ‘This person's unwholesome qualities have disappeared, wholesome qualities are manifest, but he has an unwholesome root that has not been eradicated. From that unwholesome root of his the unwholesome will appear. Thus this person will be subject to decline in the future.’ Suppose, Ānanda, seeds that are intact, unspoiled, not damaged by wind and the sun's heat, fecund, well preserved, were deposited on a wide rock. Wouldn’t you know: ‘These seeds will not grow, increase, and mature’?\"",
    "an6.62:9": "(3) \"Then, Ānanda, having encompassed his mind with my own mind, I understand some person thus: ‘Wholesome qualities and unwholesome qualities are found in this person.’ On a later occasion, having encompassed his mind with my own mind, I understand him thus: ‘This person does not have even a mere fraction of a hair's tip of a bright quality. This person possesses exclusively black, unwholesome qualities. With the breakup of the body, after death, he will be reborn in the plane of misery, in a bad destination, in the lower world, in hell.’ Suppose, Ānanda, seeds that are broken, spoiled, damaged by wind and the sun's heat, were deposited in well-prepared soil in a good field. Wouldn’t you know: ‘These seeds will not grow, increase, and mature’?\"",
    "an6.62:10": "When this was said, the Venerable Ānanda said to the Blessed One:\"Is it possible, Bhante, to describe three other persons as the counterparts of those three?\"",
    "an6.62:11": "(5) \"Then, Ānanda, having encompassed his mind with my own mind, I understand some person thus: ‘Wholesome qualities and unwholesome qualities are found in this person.’ On a later occasion, having encompassed his mind with my own mind, I understand him thus: ‘This person's unwholesome qualities have disappeared, wholesome qualities are manifest, but he has an unwholesome root that has not been eradicated. That, too, is about to be completely destroyed. Thus this person will not be subject to decline in the future.’ Suppose, Ānanda, coals that are burning, blazing, and glowing were deposited on a heap of dry grass or firewood. Wouldn’t you know: ‘These coals will grow, increase, and spread’?\"",
    "an6.62:12": "(6) \"Then, Ānanda, having encompassed his mind with my own mind, I understand some person thus: ‘Wholesome qualities and unwholesome qualities are found in this person.’ On a later occasion, having encompassed his mind with my own mind, I understand him thus: ‘This person does not have even a mere fraction of a hair's tip of an unwholesome quality. This person possesses exclusively bright, blameless qualities. He will attain nibbāna in this very life.’ Suppose, Ānanda, coals that are cool and extinguished were deposited on a heap of dry grass or firewood. Wouldn’t you know: ‘These coals will not grow, increase, and spread’?\"",
    "an6.62:13": "\"Ānanda, among the former three persons, one is not subject to decline, one is subject to decline, and one is bound for the plane of misery, bound for hell. Among the latter three persons, one is not subject to decline, one is subject to decline, and one is bound to attain nibbāna.\""
}