{
    "an6.88:1": "\"Bhikkhus, possessing six qualities, even while listening to the good Dhamma one is incapable of entering upon the fixed courseconsisting inrightness in wholesome qualities. What six? When the Dhamma and discipline proclaimed by the Tathāgata is being taught, () one does not wish to listen; (2) one does not lend an ear; (3) one does not set one's mind on understanding; (4) one grasps the meaning wrongly; (5) one discards the meaning;[n.436]Atthaṁ riñcati.Mp:\"One discards the benefit of growth\"(vaḍḍhiatthaṁ chaḍḍeti).Mpexplainsatthahere in an ethical sense, as good or benefit. However, since the word is used in connection with someone listening to the teaching, it seems more likely that its semantic sense—namely, \"meaning\"—is intended. Thusatthais the correct meaning of the exposition, whileanatthais a false meaning resulting from misinterpretation.and (6) one has adopted a conviction that is not in conformitywith the teaching.[n.437] The wordkhanti, normally meaning \"patience,\" is used in relation to contemplative practice to mean one's beliefs or convictions. I base the parenthetical addition here onMp'sgloss,sāsanassa ananulomikāya, \"not in conformity with the teaching.\"Possessing these six qualities, even while listening to the good Dhamma one is incapable of entering upon the fixed courseconsisting inrightness in wholesome qualities.",
    "an6.88:2": "\"Bhikkhus, possessing six qualities, while listening to the good Dhamma one is capable of entering upon the fixed courseconsisting inrightness in wholesome qualities. What six? When the Dhamma and discipline proclaimed by the Tathāgata is being taught, (1) one wishes to listen; () one lends an ear; (3) one sets one's mind on understanding; (4) one grasps the meaning; (5) one discards what is not the meaning; and (6) one has adopted a conviction that is in conformitywith the teaching. Possessing these six qualities, while listening to the good Dhamma one is capable of entering upon the fixed courseconsisting inrightness in wholesome qualities.\""
}