{
    "an6.16:1": "On one occasion the Blessed One was dwelling among the Bhaggas at Suṁsumāragira, in the deer park at Bhesakalā Grove. Now on that occasion the householder Nakulapitā was sick, afflicted, gravely ill. Then the housewife Nakulamātā said this to him: \"Do not die full of concern,[n.275]Sāpekkho.Mpglosses this withsataṇho, \"with craving,\" but I believe the intended meaning is more likely to be \"with anxiety, with worry, with sorrow.\" Pāliapekkhā, like \"concern,\" can mean both attachment and worry.householder. To die full of concern is painful. To die full of concern has been criticized by the Blessed One.[n.276]Mpsays that since she was not able to cure his illness with medicine, she roared this \"lion's roar\"(sīhanāda)to cure his illness by a declaration of truth(saccakiriyā).",
    "an6.16:2": "(1) \"It may be, householder, that you think thus: ‘After I’m gone, Nakulamātā won’t be able to support our children and maintain the household.’ But you should not look at the matter in this way. I am skilled at weaving cotton and knitting wool. After you are gone, I’ll be able to support the childrenand maintain the household. Therefore, householder, do not die full of concern. To die full of concern is painful. To die full of concern has been criticized by the Blessed One.",
    "an6.16:3": "(2) \"It may be, householder, that you think thus: ‘After I’m gone, Nakulamātā will take another husband.’[n.1277] I read withCevaraṁ, as against Be and Eegharaṁ.Mp:\"will take another husband\"(aññaṁ sāmikaṁ gaṇhissati). See SED svvara2: \"‘chooser,’ one who solicits a girl in marriage, suitor, lover, bridegroom, husband.\"But you should not look at the matter in this way. You know, householder, and so do I, that for the last sixteen years we have led the layperson's celibate life.[n.1278]Gahaṭṭhakaṁ brahmacariyaṁ. It is not unusual in traditional Buddhist cultures for devout couples who have begotten several children to mutually agree to observe celibacy.Therefore, householder, do not die full of concern. To die full of concern is painful. To die full of concern has been criticized by the Blessed One.",
    "an6.16:4": "(3) \"It may be, householder, that you think thus: ‘After I’m gone, Nakulamātā won’t want to see the Blessed One and the Saṅgha of bhikkhus.’ But you should not look at the matter in this way. After you are gone, householder, I will be even keener to see the Blessed One and the Saṅgha of bhikkhus. Therefore, householder, do not die full of concern. To die full of concern is painful. To die full of concern has been criticized by the Blessed One.",
    "an6.16:5": "(4) \"It may be, householder, that you think thus: ‘Nakulamātā does not fulfill virtuous behavior.’[n.1279] Since the structure of this section is parallel to the two that follow rather than to the three that precede it, it is evident thatmam’accayenadoes not belong here. Though the expression is in all three printed editions, a Sinhala-script manuscript noted in Ee omits it. Like the two following sections, this one does not have a future verbbhavissati. Further, parallel to the next two sections, Nakulamātā here asserts that shepresentlyfulfills virtuous behavior, referring one who doubts this to the Buddha. Hence, since Nakulamātā is speaking about acurrentfact, there is no need for her to refer to a time when her husband has passed away.Mpsays that §§4–6 are Nakulamātā's declaration of truth.But you should not look at the matter in this way. I am one of the Blessed One's white-robed female lay disciples who fulfill virtuous behavior. If anyone has any doubt or uncertainty about this, the Blessed One, the Arahant, the Perfectly Enlightened One is dwelling among the Bhaggas at Suṁsumāragira, in the deer park at Bhesakalā Grove. They can go and ask him. Therefore, householder, do not die full of concern.To die full of concern is painful. To die full of concern has been criticized by the Blessed One.",
    "an6.16:6": "(5) \"It may be, householder, that you think thus: ‘Nakulamātā does not obtain internal serenity of mind.’ But you should not look at the matter in this way. I am one of the Blessed One's white-robed female lay disciples who obtain internal serenity of mind. If anyone has any doubt or uncertainty about this, the Blessed One, the Arahant, the Perfectly Enlightened One is dwelling among the Bhaggas at Suṁsumāragira, in the deer park at Bhesakalā Grove. They can go and ask him. Therefore, householder, do not die full of concern. To die full of concern is painful. To die full of concern has been criticized by the Blessed One.",
    "an6.16:7": "(6) \"It may be, householder, that you think thus: ‘Nakulamātā has not attained a foothold, a firm stand, assurance in this Dhamma and discipline;[n.1280]Na…imasmiṁ dhammavinaye ogādhappattā patigādhappattā assāsappattā. These are all ways of asserting that she is at minimum a stream-enterer. It is interesting that she claims to have obtained a foothold in thedhammavinaya, which suggests that in certain contextsvinayabears a wider meaning than the code of monastic regulations.she has not crossed over doubt, gotten rid of bewilderment, attained self-confidence, and become independent of others in the Teacher's teaching.’ But you should not look at the matter in this way. I am one of the Blessed One's white-robed female lay disciples who have attained a foothold, a firm stand, assurance in this Dhamma and discipline; I am one of those who have crossed over doubt, gotten rid of bewilderment, attained self-confidence, and become independent of others in the Teacher's teaching. If anyone has any doubt or uncertainty about this, the Blessed One, the Arahant, the Perfectly Enlightened One is dwelling among the Bhaggas at Suṁsumāragira, in the deer park at Bhesakalā Grove. They can go and ask him. Therefore, householder, do not die full of concern. To die full of concern is painful. To die full of concern has been criticized by the Blessed One.\"",
    "an6.16:8": "Then, while the householder Nakulapitāwas being exhorted in this way by the housewife Nakulamātā, his ailment subsided on the spot. Nakulapitā recovered from that illness, and that is how his illness was abandoned.",
    "an6.16:9": "\"It is truly your good fortune and gain, householder, that the housewife Nakulamātā has compassion for you, desires your good, and exhorts and instructs you. Nakulamātā is one of my white-robed female lay disciples who fulfill virtuous behavior. She is one of my white-robed female lay disciples who obtain internal serenity of mind. She is one of my white-robed female lay disciples who have attained a foothold, a firm stand, assurance in this Dhamma and discipline, who have crossed over doubt, gotten rid of bewilderment, attained self-confidence, and become independent of others in the Teacher's teaching. It is truly your good fortune and gain, householder, that the housewife Nakulamātā has compassion for you, desires your good, and exhorts and instructs you.\""
}