{
    "an6.53:1": "Then a certain brahmin approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Blessed One:",
    "an6.53:2": "\"Master Gotama, is there one thing which, when developed and cultivated, can accomplish both kinds of good, the good pertaining to the present life and the good pertaining to the future life?\"",
    "an6.53:4": "(1) \"Just as, brahmin, the footprints of all animals that walk fit into the footprint of the elephant, and the elephant's footprint is declared to be foremost among them with respect to size, so too heedfulness is the one thing that, when developed and cultivated, can accomplish both kinds of good, the good pertaining to the present life and the good pertaining to the future life.",
    "an6.53:5": "(2) \"Just as all the rafters of a peaked house lean toward the roof peak, slope toward the roof peak, converge upon the roof peak, and the roof peak is declared to be foremost among them, so tooheedfulness is the one thing that … can accomplish both kinds of good ….",
    "an6.53:6": "(3) \"Just as a reed-cutter, having cut a bunch of reeds, grabs them by the top, shakes the bottom, shakes the two sides, and beats them, so too heedfulness is the one thing that … can accomplish both kinds of good ….",
    "an6.53:7": "(4) \"Just as, when the stalk of a bunch of mangoes is cut, all the mangoes attached to the stalk follow along with it, so too heedfulness is the one thing that … can accomplish both kinds of good ….",
    "an6.53:8": "(5) \"Just as all petty princes are the vassals of a wheel-turning monarch, and the wheel-turning monarch is declared to be foremost among them, so too heedfulness is the one thing that … can accomplish both kinds of good ….",
    "an6.53:9": "(6) \"Just as the radiance of all the stars does not amount to a sixteenth part of the radiance of the moon, and the radiance of the moon is declared to be foremost among them, so too heedfulness is the one thing that … can accomplish both kinds of good ….",
    "an6.53:10": "\"This, brahmin, is the one thing which, when developed and cultivated, can accomplish both kinds of good, the good pertaining to the present life and the good pertaining to the future life.\"",
    "an6.53:11": "\"Excellent, Master Gotama! … Let Master Gotama consider me a lay follower who from today has gone for refuge for life.\""
}