{
    "an6.27:1": "Then a certain bhikkhu approached the Blessed One, paid homage to him, sat down to one side, and said: \"Bhante, how many proper occasions are there for going to see an esteemed bhikkhu?\"[n.296]Manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṁ. The commentaries consistently explainmanobhāvanīyāto mean \"those who increase esteem,\" or \"those worthy of esteem,\" rather than \"those who have developed the mind.\" Thus Spk II 250,–2says those bhikkhus aremanobhāvanīyā\"who, when seen, make the mind grow in the wholesome\"(yesu hi diṭṭhesu kusalavasena cittaṁ vaḍḍhati).",
    "an6.27:2": "What six? (1) \"Here, bhikkhu, when a bhikkhu's mind is obsessed and oppressed by sensual lust, and he does not understand as it really is the escape from arisen sensual lust, on that occasion he should approach an esteemed bhikkhu and say to him: ‘Friend, my mind is obsessed and oppressed by sensual lust,and I do not understand as it really is the escape from arisen sensual lust. Please teach me the Dhamma for abandoning sensual lust.’ The esteemed bhikkhu then teaches him the Dhamma for abandoning sensual lust. This is the first proper occasion for going to see an esteemed bhikkhu.",
    "an6.27:3": "(2) \"Again, when a bhikkhu's mind is obsessed and oppressed by ill will, and he does not understand as it really is the escape from arisen ill will, on that occasion he should approach an esteemed bhikkhu and say to him: ‘Friend, my mind is obsessed and oppressed by ill will ….’ The esteemed bhikkhu then teaches him the Dhamma for abandoning ill will. This is the second proper occasion for going to see an esteemed bhikkhu.",
    "an6.27:4": "(3) \"Again, when a bhikkhu's mind is obsessed and oppressed by dullness and drowsiness, and he does not understand as it really is the escape from arisen dullness and drowsiness, on that occasion he should approach an esteemed bhikkhu and say to him: ‘Friend, my mind is obsessed and oppressed by dullness and drowsiness ….’ The esteemed bhikkhu then teaches him the Dhamma for abandoning dullness and drowsiness. This is the third proper occasion for going to see an esteemed bhikkhu.",
    "an6.27:5": "(4) \"Again, when a bhikkhu's mind is obsessed and oppressed by restlessness and remorse, and he does not understand as it really is the escape from arisen restlessness and remorse, on that occasion he should approach an esteemed bhikkhu and say to him: ‘Friend, my mind is obsessed and oppressed by restlessness and remorse ….’… The esteemed bhikkhu then teaches him the Dhamma for abandoning restlessness and remorse. This is the fourth proper occasion for going to see an esteemed bhikkhu.",
    "an6.27:6": "(5) \"Again, when a bhikkhu's mind is obsessed and oppressed by doubt, and he does not understand as it really is the escape from arisen doubt, on that occasion he should approach an esteemed bhikkhu and say to him: ‘Friend, my mind is obsessed and oppressed by doubt, and I do not understand as it really is the escape from arisen doubt. Please teach me the Dhamma for abandoning doubt.’ The esteemed bhikkhu then teaches him the Dhamma for abandoning doubt. This is the fifth proper occasion for going to see an esteemed bhikkhu.",
    "an6.27:7": "(6) \"Again, when a bhikkhu does not know and see what object to rely on and attend to in order to attain the immediate destruction of the taints,[n.129]Yaṁ nimittaṁ āgamma yaṁ nimittaṁ manasikaroto anantarā āsavānaṁ khayo hoti. On the \"immediate destruction of the taints,\" seeAN4.162, n. 851.on that occasion he should approach an esteemed bhikkhu and say to him: ‘Friend, I do not know and see what object to rely on and attend to in order to attain the immediate destruction of the taints. Please teach me the Dhamma for the destruction of the taints.’ The esteemed bhikkhu then teaches him the Dhamma for the destruction of the taints. This is the sixth proper occasion for going to see an esteemed bhikkhu.",
    "an6.27:8": "\"These, bhikkhu, are the six proper occasions for going to see an esteemed bhikkhu.\""
}