{
    "an6.59:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Nādika in the brick hall. Then the householder Dārukammika[n.384] His name means \"dealer in firewood.\"Mpsays that he was so named because he earned his living by selling firewood.approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him: \"Does your family give gifts, householder?\"",
    "an6.59:2": "\"Since, householder, you are a layman enjoying sensual pleasures, living at home in a house full of children, using sandalwood from Kāsi, wearing garlands, scents, and unguents, and receiving gold and silver, it is difficult for you to know: ‘These are arahants or on the path to arahantship.’",
    "an6.59:3": "(1) \"If, householder, a bhikkhu who is a forest-dweller is restless, puffed up, vain, talkative, rambling in his talk, muddle-minded, lacking clear comprehension, unconcentrated, with a wandering mind, with loose sense faculties, then in this respect he is blameworthy. But if a bhikkhu who is a forest-dweller is not restless, puffed up, and vain, is not talkative and rambling in his talk, but has mindfulness established, clearly comprehends, is concentrated, with a one-pointed mind, with restrained sense faculties, then in this respect he is praiseworthy.",
    "an6.59:4": "(2) \"If a bhikkhu who dwells on the outskirts of a village is restless … with loose sense faculties, then in this respect he is blameworthy. But if a bhikkhu who dwells on the outskirts of a village is not restless … with restrained sense faculties, then in this respect he is praiseworthy.",
    "an6.59:5": "(3) \"If a bhikkhu who is an almsfood collector is restless … with loose sense faculties, then in this respect he is blameworthy. But if a bhikkhu who is an almsfood collector is not restless… with restrained sense faculties, then in this respect he is praiseworthy.",
    "an6.59:6": "(4) \"If a bhikkhu who accepts invitations to meals is restless … with loose sense faculties, then in this respect he is blameworthy. But if a bhikkhu who accepts invitations to meals is not restless … with restrained sense faculties, then in this respect he is praiseworthy.",
    "an6.59:7": "(5) \"If a bhikkhu who wears rag-robes is restless … with loose sense faculties, then in this respect he is blameworthy. But if a bhikkhu who wears rag-robes is not restless … with restrained sense faculties, then in this respect he is praiseworthy.",
    "an6.59:8": "(6) \"If a bhikkhu who wears robes given by householders is restless … with loose sense faculties, then in this respect he is blameworthy. But if a bhikkhu who wears robes given by householders is not restless … with restrained sense faculties, then in this respect he is praiseworthy.",
    "an6.59:9": "\"Come now, householder, give gifts to the Saṅgha. When you give gifts to the Saṅgha, your mind will be confident. When your mind is confident, with the breakup of the body, after death, you will be reborn in a good destination, in a heavenly world.\""
}