{
    "an6.63:1": "\"Bhikkhus, I will teach you a penetrative exposition of the Dhamma.[n.409]Nibbedhikapariyāyaṁ vo bhikkhave dhammapariyāyaṁ desessāmi.Mp:\"A penetrative exposition is one that penetrates and splits the mass of greed, (hatred, and delusion) that had not been penetrated and split before.\"Listen and attend closely. I will speak.\"",
    "an6.63:2": "\"And what, bhikkhus, is that penetrative exposition of the Dhamma?",
    "an6.63:3": "(2) \"Feelings should be understood; the source and origin of feelings should be understood; the diversity of feelings should be understood; the result of feelings should be understood; the cessation of feelings should be understood; the way leading to the cessation of feelings should be understood.",
    "an6.63:4": "(3) \"Perceptions should be understood; the source and origin of perceptions should be understood; the diversity of perceptions should be understood; the result of perceptions should be understood; the cessation of perceptions should be understood; the way leading to the cessation of perceptions should be understood.",
    "an6.63:5": "(4) \"The taints should be understood; the source and origin of the taints should be understood; the diversity of the taints should be understood; the result of the taints should be understood; the cessation of the taints should be understood; the way leading to the cessation of the taints should be understood.",
    "an6.63:6": "(5) \"Kamma should be understood; the source and origin of kamma should be understood; the diversity of kamma should be understood; the result of kamma should be understood; the cessation of kamma should be understood; the way leading to the cessation of kamma should be understood.[n.1410] The text alternates between singular and plural forms ofkamma. I have used the singular, which sounds more natural in English.",
    "an6.63:7": "(6) \"Suffering should be understood; the source and origin of suffering should be understood; the diversity of suffering should be understood; the result of suffering should be understood; the cessation of suffering should be understood; the way leading to the cessation of suffering should be understood.",
    "an6.63:8": "(1) \"When it was said: ‘Sensual pleasures should be understood; the source and origin of sensual pleasures should be understood; the diversity of sensual pleasures should be understood; the resultof sensual pleasures should be understood; the cessation of sensual pleasures should be understood; the way leading to the cessation of sensual pleasures should be understood,’ for what reason was this said?",
    "an6.63:9": "\"They are not sensual pleasures, the pretty things in the world:a person's sensual pleasure is lustful intention;the pretty things remain just as they are in the world,but the wise remove the desire for them.",
    "an6.63:10": "\"And what, bhikkhus, is the source and origin of sensual pleasures? Contact is their source and origin.[n.1412]Mpexplains this as the coexistent contact(sahajātaphassa).",
    "an6.63:11": "\"And what is the diversity of sensual pleasures? Sensual desire for forms is one thing, sensual desire for sounds is another, sensual desire for odours still another, sensual desire for tastes still another, and sensual desire for tactile objects still another. This is called the diversity of sensual pleasures.",
    "an6.63:12": "\"And what is the result of sensual pleasures? One produces an individual existence that corresponds with whateversense pleasuresone desires and which may be the consequence either of merit or demerit.[n.1413]Mp:\"One desiring celestial sensual pleasures, by fulfilling good conduct, is reborn in the deva world (and acquires) an individual existence that is a consequence of merit. By engaging in misconduct, one is reborn in the plane of misery (and acquires) an individual existence that is a consequence of demerit.\"This is called the result of sensual pleasures.",
    "an6.63:13": "\"And what is the cessation of sensual pleasures? With the cessation of contact there is cessation of sensual pleasures.",
    "an6.63:14": "\"When, bhikkhus, a noble disciple thus understands sensual pleasures, the source and origin of sensual pleasures, the diversity of sensual pleasures, the result of sensual pleasures, the cessation of sensual pleasures, and the way leading to the cessation of sensual pleasures, he understands this penetrative spiritual life to be the cessation of sensual pleasures.[n.] Regarding this last phrase,Mpsays that it is just the spiritual life of the path(brahmacariyasaṅkhāto maggo va)that is called the cessation of sensual pleasures. It will be observed that each section follows the pattern of the four noble truths, with two additions: diversity(vemattatā)and result(vipāka).",
    "an6.63:15": "(2) \"When it was said: ‘Feelings should be understood … the way leading to the cessation of feelings should be understood,’ for what reason was this said?",
    "an6.63:16": "\"And what is the source and origin of feelings? Contact is their source and origin.",
    "an6.63:17": "\"And what is the diversity of feelings? There is worldly pleasant feeling,[n.1415]Sāmisā.Mp:\"Associated with the bait of the defilements\"(kilesāmisasampayuttā).there is spiritual pleasant feeling; there is worldly painful feeling, there is spiritual painful feeling; there is worldly neither-painful-nor-pleasant feeling, there is spiritual neither-painful-nor-pleasant feeling. This is called the diversity of feelings.",
    "an6.63:18": "\"And what is the result of feelings? One produces an individual existence that corresponds with whateverfeelingsone experiences and which may be the consequence either of merit or demerit. This is called the result of feelings.",
    "an6.63:19": "\"And what is the cessation of feelings? With the cessation of contact there is cessation of feelings.",
    "an6.63:20": "\"When, bhikkhus, a noble disciple thus understands feeling, the source and origin of feelings,the diversity of feelings, the result of feelings, the cessation of feelings, and the way leading to the cessation of feelings, he understands this penetrative spiritual life to be the cessation of feelings.",
    "an6.63:21": "(3) \"When it was said: ‘Perceptions should be understood … the way leading to the cessation of perceptions should be understood,’ for what reason was this said?",
    "an6.63:22": "\"And what is the source and origin of perceptions? Contact is their source and origin.",
    "an6.63:23": "\"And what is the diversity of perceptions? The perception of forms is one thing, the perception of sounds is another, the perception of odours still another, the perception of tastes still another, the perception of tactile objects still another, and the perception of mental phenomena still another. This is called the diversity of perceptions.",
    "an6.63:24": "\"And what is the result of perceptions? I say that perceptions result in expression.[n.1416]Vohāravepakkaṁ…saññaṁ vadāmi.Mp:\"Expression, consisting in talk, is the result of perception.\"In whatever way one perceives something, in just that way one expresses oneself,saying:‘I was percipient of such and such.’ This is called the result of perception.",
    "an6.63:25": "\"And what is the cessation of perceptions? With the cessation of contact there is cessation of perceptions.",
    "an6.63:26": "\"When, bhikkhus, a noble disciple thus understands perceptions, the source and origin of perceptions,the diversity of perceptions, the result of perceptions, the cessation of perceptions, and the way leading to the cessation of perceptions, he understands this penetrative spiritual life to be the cessation of perceptions.",
    "an6.63:27": "(4) \"When it was said: ‘The taints should be understood … the way leading to the cessation of the taints should be understood,’ for what reason was this said?",
    "an6.63:28": "\"And what is the source and origin of the taints? Ignorance is their source and origin.",
    "an6.63:29": "\"And what is the diversity of the taints? There are taints leading to hell; there are taints leading to the animal realm; there are taints leading to the realm of afflicted spirits; there are taints leading to the human world; there are taints leading to the deva world. This is called the diversity of the taints.",
    "an6.63:30": "\"And what is the result of the taints? One immersed in ignorance produces a corresponding individual existence, which may be the consequence either of merit or demerit. This is called the result of the taints.",
    "an6.63:31": "\"And what is the cessation of the taints? With the cessation of ignorance there is cessation of the taints.",
    "an6.63:32": "\"When, bhikkhus, a noble disciple thus understands the taints, the source and origin of the taints, the diversity of the taints, the result of the taints, the cessation of the taints, and the way leading to the cessation of the taints, he understands this penetrative spiritual life to be the cessation of the taints.",
    "an6.63:33": "(5) \"When it was said: ‘Kamma should be understood … the way leading to the cessation of kamma should be understood,’ for what reason was this said?",
    "an6.63:34": "\"And what is the source and origin of kamma? Contact is its source and origin.",
    "an6.63:35": "\"And what is the diversity of kamma? There is kamma to be experienced in hell; there is kamma to be experienced in the animal realm; there is kamma to be experienced in the realm of afflicted spirits; there is kamma to be experienced in the human world; and there is kamma to be experienced in the deva world.[n.1418] This statement should be understood in the sense that the results of kamma are to be experienced in their respective realms.This is called the diversity of kamma.",
    "an6.63:36": "\"And what is the result of kamma? The result of kamma, I say, is threefold:to be experiencedin this very life, or in thenextrebirth, or on some subsequent occasion. This is called the result of kamma.[n.1419] SeeAN3.34, n. 372, andAN3.100, n. 547. The Chinese parallel, MĀ 111, has here the fourfold distinction of kamma found inAN4.232–33. But MĀ 15 (at T I 437b26) speaks of only two kinds of results, in this life or in a later life, without a third alternative.",
    "an6.63:37": "\"And what, bhikkhus, is the cessation of kamma? With the cessation of contact there is cessation of kamma.[n.1420] This should probably be understood in the sense that, because contact is the condition for intention and kamma can be explained as intention, contact is therefore the condition for kamma.",
    "an6.63:38": "\"When, bhikkhus, a noble disciple thus understands kamma, the source and origin of kamma, the diversity of kamma, the result of kamma, the cessation of kamma, and the way leading to the cessation of kamma, he understands this penetrative spiritual life to be the cessation of kamma.",
    "an6.63:39": "(6) \"When it was said: ‘Suffering should be understood; the source and origin of suffering should be understood; the diversity of suffering should be understood; the result of suffering should be understood; the cessation of suffering should be understood; the way leading to the cessation of suffering should be understood,’ for what reason was this said?",
    "an6.63:40": "\"And what is the source and origin of suffering? Craving is its source and origin.",
    "an6.63:41": "\"And what is the diversity of suffering? There is extreme suffering; there is slight suffering; there is suffering that fades away slowly; there is suffering that fades away quickly. This is called the diversity of suffering.",
    "an6.63:42": "\"And what is the result of suffering? Here, someone overcome by suffering, with a mind obsessed by it, sorrows, languishes, and laments; he weeps beating his breast and becomes confused. Or else, overcome by suffering, with a mind obsessed by it, he embarks upon a search outside, saying: ‘Who knows one or two words for putting an end to this suffering?’[n.11]Ko ekapadaṁ dvipadaṁ jānāti imassa dukkhassa nirodhāya.Mp:\"The meaning is: ‘Who knows a mantra, a one-word or two-word mantra?’\" The Chinese parallel at T I 600b17–18uses the character(=), meaning \"mantra.\"Suffering, I say, results either in confusion or in a search. This is called the result of suffering.",
    "an6.63:43": "\"And what is the cessation of suffering? With the cessation of craving there is cessation of suffering.",
    "an6.63:44": "\"When, bhikkhus, a noble disciple thus understands suffering,the source and origin of suffering, the diversity of suffering, the result of suffering, the cessation of suffering, and the way leading to the cessation of suffering, he understands this penetrative spiritual life to be the cessation of suffering.",
    "an6.63:45": "\"This, bhikkhus, is that penetrative exposition of the Dhamma.\""
}