{
    "an6.49:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the Venerable Khema and the Venerable Sumana were dwelling at Sāvatthīin the Blind Men's Grove. Then they approached the Blessed One, paid homage to him, and sat down to one side. The Venerable Khema then said to the Blessed One:",
    "an6.49:2": "\"Bhante, when a bhikkhu is an arahant, one whose taints are destroyed, who has lived the spiritual life, done what had to be done, laid down the burden, reached his own goal, utterly destroyed the fetters of existence, one completely liberated through final knowledge, it does not occur to him: (1) ‘There is someone better than me,’ or () ‘There is someone equal to me,’ or (3) ‘There is someone inferior to me.’\"",
    "an6.49:3": "Then, right after the Venerable Khema had left, the Venerable Sumana said to the Blessed One: \"Bhante, when a bhikkhu is an arahant, one whose taints are destroyed, who has lived the spiritual life, done what had to be done, laid down the burden, reached his own goal, utterly destroyed the fetters of existence, one completely liberated through final knowledge, it does not occur to him: (4) ‘There is no one better than me,’ or (5) ‘There is no one equal to me,’ or (6) ‘There is no one inferior to me.’\"",
    "an6.49:4": "Then, soon after both monks had left, the Blessed One addressed the bhikkhus: \"Bhikkhus, it is in such a way that clansmen declare final knowledge. They state the meaning but don’t bring themselves into the picture.[n.1352]Attho ca vutto attā ca anupanīto. As atAN3.72, IV 218,31, there seems to be a word play betweenatthoandattā, \"goal\" and \"self.\"But there are some foolish men here who, it seems, declare final knowledge as a joke. They will meet with distress later.\"",
    "an6.49:5": "They (do not rank themselves) as superior or inferior,nor do they rank themselves as equal.[n.133]Mpglossesussesuas superior persons,omesuas inferior ones, andsamatteas similar ones, explaining: \"Arahants do not rank themselves, by way of conceit, as superior, inferior, and equal.\"Destroyed is birth, the spiritual life has been lived;they continue on, freed from fetters."
}