{
    "an6.60:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Bārāṇasī in the deer park at Isipatana. Now on that occasion, after their meal, on returning from their alms round, a number of elder bhikkhus assembled and were sitting together in the pavilion hall engaged in a discussion pertaining to the Dhamma.[n.387]Abhidhammakathaṁ kathenti.Mpexplains this as \"a talk involved with the Abhidhamma\"(abhidhammamissakaṁ kathaṁ), but I takeabhidhammakathaṁhere as a mere referential term. On this use of the expression, seeAN5.79, n.086.While they were engaged in their discussion, the Venerable Citta Hatthisāriputta repeatedly interrupted their talk.[n.388]Kathaṁ opāteti(as in Ce and Be; Ee has the aoristopātesi).Mp:\"He interrupted their discussion and gave his own explanation\"(tesaṁ kathaṁ vicchinditvā attano kathaṁ katheti).The Venerable Mahākoṭṭhita then told the Venerable Citta Hatthisāriputta:",
    "an6.60:2": "The Venerable Mahākoṭṭhita said:\"It's difficult, friends, for those who don’t know the course of another's mind to know this.",
    "an6.60:3": "\"Suppose a crop-eating bull was bound by a rope or shut up in a pen. Could one rightly say: ‘Now this crop-eating bull will never again enter among the crops’?\"",
    "an6.60:4": "(2) \"Then, friends, secluded from sensual pleasures … some person enters and dwells in the first jhāna.Thinking,‘I am one who gains the first jhāna,’ he bonds withotherbhikkhus, bhikkhunīs, male and female lay followers, kings and royal ministers, sectarian teachers and their disciples. As he bonds with them and becomes intimate with them, as he loosens up and talks with them, lust invades his mind. With his mind invaded by lust, he gives up the training and reverts to the lower life.",
    "an6.60:5": "(3) \"Then, friends, with the subsiding of thought and examination, some person enters and dwells in the second jhāna ….Thinking,‘I am one who gains the second jhāna,’ he bonds withotherbhikkhus, bhikkhunīs, male and female lay followers, kings and royal ministers, sectarian teachers and their disciples. As he bonds with them and becomes intimate with them, as he loosens up and talks with them, lust invades his mind. With his mind invaded by lust, he gives up the training and reverts to the lower life.",
    "an6.60:6": "(4) \"Then, friends, with the fading away as well of rapture, some person … enters and dwells in the third jhāna ….Thinking,‘I am one who gains the third jhāna,’ he bonds withotherbhikkhus, bhikkhunīs, male and female lay followers, kings and royal ministers, sectarian teachers and their disciples. As he bonds with them and becomes intimate with them, as he loosens up and engages in talk with them, lust invades his mind. With his mind invaded by lust, he gives up the training and reverts to the lower life.",
    "an6.60:7": "(5) \"Then, friends, with the abandoning of pleasure and pain … some person enters and dwells in the fourth jhāna ….Thinking,‘I am one who gains the fourth jhāna,’ he bonds withotherbhikkhus, bhikkhunīs, male and female lay followers, kings and royal ministers, sectarian teachers and their disciples. As he bonds with them and becomes intimate with them, as he loosens up and talks with them, lust invades his mind. With his mind invaded by lust, he gives up the training and reverts to the lower life.",
    "an6.60:8": "(6) \"Then, friends, through non-attention to all marks, some person enters and dwells in the markless mental concentration.[n.1391]Animittaṁ cetosamādhiṁ.Mp:\"All marksare all such marks as permanence and so forth. Themarkless mental concentrationis the concentration of strong insight(balavavipassanāsamādhiṁ).\"Thinking,‘I am one who gains the markless mental concentration,’ he bonds withotherbhikkhus, bhikkhunīs, male and female lay followers, kings and royal ministers, sectarian teachers and their disciples. As he bonds with them and becomes intimate with them, as he loosens up and talks with them, lust invades his mind. With his mind invaded by lust, he gives up the training and reverts to the lower life.",
    "an6.60:9": "On a later occasion the Venerable Citta Hatthisāriputta gave up the training and returned to the lower life. His bhikkhu friends then approached the Venerable Mahākoṭṭhita and said to him: \"Did the Venerable Mahākoṭṭhita encompass Citta Hatthisāriputta's mind with his own mind and understand: ‘Citta Hatthisāriputta gains such and such meditative dwellings and attainments, yet he will give up the training and return to the lower life’? Or did deities report this matter to him?\"",
    "an6.60:10": "Then those bhikkhu friends of Citta Hatthisāriputta approached the Blessed One, paid homage to him,sat down to one side, and said: \"Bhante, Citta Hatthisāriputta gained such and such meditative dwellings and attainments, yet he gave up the training and returned to the lower life.\"",
    "an6.60:11": "Not long afterward, Citta Hatthisāriputta shaved off his hair and beard, put on ochre robes, and went forth from the household life into homelessness. Then, dwelling alone, withdrawn, heedful, ardent, and resolute, in no long time the Venerable Citta Hatthisāriputta realized for himself with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness, and having entered upon it, he dwelled in it.[n.1393]Mpexplains that Citta returned to lay life seven times and went forth seven times. The reason for his instability was that during the time of the Buddha Kassapa he had persuaded a bhikkhu to return to lay life. Therefore, even though he had the supporting conditions for arahantship, because of that kamma he had to move back and forth seven times between lay life and monastic life before attaining arahantship.He directly knew: \"Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.\" And the Venerable Citta Hatthisāriputta became one of the arahants."
}