{
    "an6.64:1": "\"Bhikkhus, there are these six Tathāgata's powers that the Tathāgata has, possessing which he claims the place of the chief bull, roars his lion's roar in the assemblies, and sets in motion the brahma wheel.[n.422] It is strange that only six Tathāgata's powers are mentioned here. Usually, ten Tathāgata's powers are cited (identified asñāṇabalāni, powers of knowledge). In AN the ten are inAN0.2. They are also atMN 2.9–20, I 69–7, and analyzed at Vibh 335 — 44 (Be §§809–3).What six?",
    "an6.64:2": "() \"Again, the Tathāgata understands as it really is the result of the undertaking of kamma past, future, and present in terms of possibilities and causes.[n.144]Ṭhānaso hetuso.Mpexplains possibility(ṭhāna)as condition(paccaya). Following Vibh 338–39 (Be §810), it takes this to be knowledge of the conditions for kamma bringing a result in connection with four factors that can either reinforce or impede its maturation: realm(gati, one's place of rebirth), acquisitions(upadhi, one's body and mind), time(kāla), and effort(payoga). The cause(hetu)is the kamma itself.Since the Tathāgata understands as it really is the result of the undertaking of kamma … this too is a Tathāgata's power that the Tathāgata has, possessing which he … sets in motion the brahma wheel.",
    "an6.64:3": "() \"Again, the Tathāgataunderstands as it really is the defilement, the cleansing, and the emergence in regard to the jhānas, emancipations, concentrations, and meditative attainments.[n.1425] The fourjhānasare found throughout the Nikāyas. The eightemancipations(vimokkha)are atAN8.66. The three kinds ofconcentration(samādhi)are atAN8.6: concentration with thought and examination, without thought but with examination only, and without thought and examination. The ninemeditative attainments(samāpatti)are the same as the nine progressive dwellings(anupubbavihārā)atAN9.2. Thedefilement(saṁkilesa)is a quality that leads to deterioration; thecleansing(vodāna)is a quality that makes for distinction; and theemergence(vuṭṭhāna), according to Vibh 42–4 (Be §828), is the cleansing and emergence itself. \"Cleansing\" here means that proficiency in the lower jhāna is the foundation for the next higher jhāna; \"emergence itself\" means coming out from the jhāna.Since the Tathāgata understands as it really is the defilement, the cleansing, and the emergence in regard to the jhānas … this too is a Tathāgata's power that the Tathāgata has, possessing which he … sets in motion the brahma wheel.",
    "an6.64:4": "() \"Again, the Tathāgata recollects his manifold past abodes, that is, one birth, two births … Thus he recollects his manifold past abodes with their aspects and details. Since the Tathāgata recollects his manifold past abodes … with their aspects and details, this too is a Tathāgata's power that the Tathāgata has, possessing which he … sets in motion the brahma wheel.",
    "an6.64:5": "() \"Again, with the divine eye, which is purified and surpasses the human, the Tathāgata sees beings passing away and being reborn … and he understands how beings fare in accordance with their kamma. Since the Tathāgata … understands how beings fare in accordance with their kamma, this too is a Tathāgata's power that the Tathāgata has, possessing which he … sets in motion the brahma wheel.",
    "an6.64:6": "() \"Again, with the destruction of the taints, the Tathāgata has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. Since the Tathāgata has realized for himself … the taintless liberation of mind, liberation by wisdom … this too is a Tathāgata's power that the Tathāgata has, possessing which he … sets in motion the brahma wheel.",
    "an6.64:7": "(1) \"If, bhikkhus, others approach the Tathāgata and ask him a question related to his knowledge as it really is of the possible as possible and the impossible as impossible, then the Tathāgata, questioned in this way, answers them exactly as he has understood this knowledge.",
    "an6.64:8": "(2) \"If others approach the Tathāgata and ask him a question related to his knowledge as it really is of the result of the undertaking of kamma past, future, and present in terms of possibilities and causes, then the Tathāgata, questioned in this way, answers them exactly as he has understood this knowledge.",
    "an6.64:9": "(3) \"If others approach the Tathāgata and ask him a question related to his knowledge as it really is of the defilement, the cleansing, and the emergence in regard to the jhānas, emancipations, concentrations, and meditative attainments, then the Tathāgata, questioned in this way, answers them exactly as he has understood this knowledge.",
    "an6.64:10": "(4) \"If others approach the Tathāgata and ask him a question related to his knowledge as it really is of the recollection of past abodes, thenthe Tathāgata, questioned in this way, answers them exactly as he has understood this knowledge.[n.1426]Ceand Be indicate, by the use of ellipsis points, that the last three sections should be expanded in full, as inAN6.2. To facilitate readability, I present these sections without showing the elision of stock phrases.",
    "an6.64:11": "(5) \"If others approach the Tathāgata and ask him a question related to his knowledge as it really is of the passing away and rebirth of beings, then the Tathāgata, questioned in this way, answers them exactly as he has understood this knowledge.",
    "an6.64:12": "(6) \"If others approach the Tathāgata and ask him a question related to his knowledge as it really is of the taintless liberation of mind, liberation by wisdom, then the Tathāgata, questioned in this way, answers them exactly as he has understood this knowledge.",
    "an6.64:13": "(1) \"I say, bhikkhus, that the knowledge as it really is of the possible as possible and the impossible as impossible is for one who is concentrated, not for one who lacks concentration."
}