{
    "an6.20:1": "On one occasion the Blessed One was dwelling at Nādika in the brick hall. There the Blessed One addressed the bhikkhus:",
    "an6.20:2": "\"Here, bhikkhus, when day has receded and night has approached,[n.187]Rattiyā patihitāya.Patihita(orpaṭihita)is not in PED; see SED svprati-dhā. It is the past participle ofpatidahati, meaning \"to commence, to begin, to approach,\" which seems relevant here.Mpglosses withpaṭipannāya.a bhikkhu reflects thus: ‘I could die on account of many causes. (1) A snake might bite me, or a scorpion or centipede might sting me, and I might die; that would be an obstacle for me. () I might stumble and fall down, or (3) my food might disagree with me, or (4) my bilemight become agitated, or (5) my phlegm might become agitated, or (6) sharp winds in me might become agitated, and I might die; that would be an obstacle for me.’",
    "an6.20:3": "\"This bhikkhu should reflect thus: ‘Do I have any bad unwholesome qualities that have not been abandoned, which might become an obstacle for me if I were to die tonight?’ If, upon review, the bhikkhu knows: ‘I have bad unwholesome qualities that have not been abandoned, which might become an obstacle for me if I were to die tonight,’ then he should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those bad unwholesome qualities. Just as one whose clothes or head had caught fire would put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to extinguish (the fire on) his clothes or head, so that bhikkhu should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those bad unwholesome qualities.",
    "an6.20:4": "\"But if, upon review, the bhikkhu knows thus: ‘I do not have any bad unwholesome qualities that have not been abandoned, which might become an obstacle for me if I were to die tonight,’ then he should dwell in that same rapture and joy, training day and night in wholesome qualities.",
    "an6.20:5": "\"But when night has receded and day has approached, a bhikkhu reflects thus: ‘I could die on account of many causes. A snake might bite me … or sharp winds might become agitated in me, and I might die; that would be an obstacle for me.’",
    "an6.20:6": "\"This bhikkhu should reflect thus:‘Do I have any bad unwholesome qualities that have not been abandoned which might become an obstacle for me if I were to die this day?’ If, upon review, the bhikkhu knows: ‘I have bad unwholesome qualities that I have not yet abandoned, which might become an obstacle for me if I were to die this day,’ then he should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those bad unwholesome qualities. Just as one whose clothes or head had caught fire would put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to extinguish (the fire on) his clothes or head, so that bhikkhu should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those bad unwholesome qualities.",
    "an6.20:7": "\"But if, upon review, the bhikkhu knows: ‘I do not have any bad unwholesome qualities that I have not yet abandoned, which might become an obstacle for me if I were to die this day,’ then he should dwell in that same rapture and joy, training day and night in wholesome qualities.",
    "an6.20:8": "\"It is, bhikkhus, when mindfulness of death is developed and cultivated in this way that it is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation.\""
}