{
    "an6.58:1": "\"Bhikkhus, possessing six qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.",
    "an6.58:2": "What six? Here, by restraint a bhikkhu has abandoned those taints that are to be abandoned by restraint; by using he has abandoned those taints that are to be abandoned by using; by patiently enduring he has abandoned those taints that are to be abandoned by patiently enduring; by avoiding he has abandoned those taints that are to be abandoned by avoiding; by dispelling he has abandoned those taints that are to be abandoned by dispelling; and by developing he has abandoned those taints that are to be abandoned by developing.[n.138] In Pāli:āsavā saṁvarā pahātabbā,āsavā paṭisevanā pahātabbā,āsavā adhivāsanā pahātabbā,āsavā parivajjanā pahātabbā,āsavā vinodanā pahātabbā,āsavā bhāvanā pahātabbā. These six, preceded by \"taints to be abandoned by seeing\"(āsavā dassanā pahātabbā), are treated in detail in theMN - The Sabbāsava Sutta, where the explanations are the same as those given here.",
    "an6.58:3": "(1) \"And what, bhikkhus, are the taints to be abandoned by restraint that have been abandoned by restraint? Here, having reflected carefully, a bhikkhu dwells restrained over the eye faculty. Thosetaints, distressful and feverish, that might arise in one who dwells unrestrained over the eye faculty do not occur in one who dwells restrained over the eye faculty. Having reflected carefully, a bhikkhu dwells restrained over the ear faculty … nose faculty … tongue faculty … body faculty … mind faculty. Those taints, distressful and feverish, that might arise in one who dwells unrestrained over the mind faculty do not occur in one who dwells restrained over the mind faculty. Those taints, distressful and feverish, that might arise in one who dwells unrestrained (over these things) do not occur in one who dwells restrained.[n.18] This sentence is missing inBe,but it occurs in Ce and Ee and has parallels in the sections on the other methods of abandoning the taints.These are called the taints to be abandoned by restraint that have been abandoned by restraint.",
    "an6.58:4": "(2) \"And what are the taints to be abandoned by using that have been abandoned by using? Here, reflecting carefully a bhikkhu uses a robe only for warding off cold; for warding off heat; for warding off contact with flies, mosquitoes, wind, sun, and serpents; and only for covering the private parts. Reflecting carefully, he uses almsfood neither for amusement nor for intoxication nor for the sake of physical beauty and attractiveness, but only for the support and maintenance of this body, for avoiding harm, and for assisting the spiritual life, considering: ‘Thus I shall terminate the old feeling and not arouse a new feeling, and I shall be healthy and blameless and dwell at ease.’ Reflecting carefully, he uses a lodging only for warding off cold; for warding off heat; for warding off contact with flies, mosquitoes, wind, sun, and serpents; and only for protection from rough weather and for enjoying seclusion. Reflecting carefully, he uses medicines and provisions for the sick only for warding off arisen oppressive feelings and to sustain his health.Those taints, distressful and feverish, that might arise in one who does not make use (of these things) do not arise in one who uses them. These are called the taints to be abandoned by using that have been abandoned by using.",
    "an6.58:5": "(3) \"And what are the taints to be abandoned by patiently enduring that have been abandoned by patiently enduring? Here, reflecting carefully a bhikkhu patiently endures cold and heat, hunger and thirst; contact with flies, mosquitoes, wind, the burning sun, and serpents; rude and offensive ways of speech; he bears up with arisen bodily feelings that are painful, racking, sharp, piercing, harrowing, disagreeable, sapping one's vitality. Those taints, distressful and feverish, that might arise in one who does not patiently endure (these things) do not arise in one who patiently endures them. These are called the taints to be abandoned by patiently enduring that have been abandoned by patiently enduring.",
    "an6.58:6": "(4) \"And what are the taints to be abandoned by avoiding that have been abandoned by avoiding? Here, reflecting carefully a bhikkhu avoids a wild elephant, a wild horse, a wild bull, and a wild dog; he avoids a snake, a stump, a clump of thorns, a pit, a precipice, a refuse dump, and a cesspit. Reflecting carefully, he avoids sitting in unsuitable seats, and wandering in unsuitable alms resorts, and associating with bad friends, such that his wise fellow monks might suspect him of evil deeds. Those taints, distressful and feverish, that might arise in one who does not avoid (these things) do not arise in one who avoids them.These are called the taints to be abandoned by avoiding that have been abandoned by avoiding.",
    "an6.58:7": "(5) \"And what are the taints to be abandoned by dispelling that have been abandoned by dispelling? Here, reflecting carefully a bhikkhu does not tolerate an arisen sensual thought; he abandons it, dispels it, terminates it, and obliterates it. Reflecting carefully, he does not tolerate an arisen thought of ill will … an arisen thought of harming … bad unwholesome states whenever they arise; he abandons them, dispels them, terminates them, and obliterates them. Those taints, distressful and feverish, that might arise in one who does not dispel (these things) do not arise in one who dispels them. These are called the taints to be abandoned by dispelling that have been abandoned by dispelling.",
    "an6.58:8": "(6) \"And what are the taints to be abandoned by developing that have been abandoned by developing? Here, reflecting carefully a bhikkhu develops the enlightenment factor of mindfulness, which is based upon seclusion, dispassion, and cessation, maturing in release. Reflecting carefully, he develops the enlightenment factor of discrimination of phenomena … the enlightenment factor of energy … the enlightenment factor of rapture … the enlightenment factor of tranquility … the enlightenment factor of concentration … the enlightenment factor of equanimity, which is based upon seclusion, dispassion, and cessation, maturing in release. Those taints, distressful and feverish, that might arise in one who does not develop (these things) do not arise in one who develops them. These are called the taints to be abandoned by developing that have been abandoned by developing.",
    "an6.58:9": "\"Possessing these six qualities, bhikkhus, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.\""
}