{
    "an6.30:1": "\"Bhikkhus, there are these six unsurpassed things. What six? () The unsurpassed sight, (2) the unsurpassed hearing, (3) the unsurpassed gain, (4) the unsurpassed training, (5) the unsurpassed service, and (6) the unsurpassed recollection.[n.304] In Pāli:dassanānuttariyaṁ,savanānuttariyaṁ,lābhānuttariyaṁ,sikkhānuttariyaṁ,pāricariyānuttariyaṁ,anussatānuttariyaṁ.",
    "an6.30:2": "(1) \"And what, bhikkhus, is the unsurpassed sight? Here, someone goes to see the elephant-gem, the horse-gem, the jewel-gem, or to see various sights; or else they go to see an ascetic or brahmin of wrong views, of wrong practice. There is this seeing; this I do not deny. But this seeing is low, common, worldly, ignoble, and unbeneficial; it does not lead to disenchantment, dispassion, cessation, peace, direct knowledge, enlightenment, andnibbāna. When, however, one of settled faith, of settled devotion, decided, full of confidence, goes to see the Tathāgata or a disciple of the Tathāgata: this unsurpassed sight is for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna. This is called the unsurpassed sight. Such is the unsurpassed sight.",
    "an6.30:3": "(2) \"And how is there the unsurpassed hearing? Here, someone goes to hear the sound of drums, the sound of lutes, the sound of singing, or to hear various sounds; or else they go to hear the Dhamma of an ascetic or brahmin of wrong views, of wrong practice. There is this hearing; this I do not deny. But this hearing is low, common, worldly, ignoble, and unbeneficial; it does not lead to disenchantment, dispassion, cessation, peace, direct knowledge, enlightenment, and nibbāna. When, however, one of settled faith, of settled devotion, decided, full of confidence, goes to hear the Tathāgata or a disciple of the Tathāgata: this unsurpassed hearing is for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna. This is called the unsurpassed hearing. Such is the unsurpassed sight and the unsurpassed hearing.",
    "an6.30:4": "(3) \"And how is there the unsurpassed gain? Here, someone gains a son, a wife, or wealth; or they gain variousgoods; or else they obtain faith in an ascetic or brahmin of wrong views, of wrong practice. There is this gain; this I do not deny. But this gain is low, common, worldly, ignoble, and unbeneficial; it does not lead to disenchantment, dispassion, cessation, peace, direct knowledge, enlightenment, and nibbāna. When, however, one of settled faith, of settled devotion, decided, full of confidence, obtains faith in the Tathāgata or in a disciple of the Tathāgata: this unsurpassed gain is for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna. This is called the unsurpassed gain. Such is the unsurpassed sight, the unsurpassed hearing, and the unsurpassed gain.",
    "an6.30:5": "(4) \"And how is there the unsurpassed training? Here, someone trains in elephantry, in horsemanship, in chariotry, in archery, in swordsmanship; or they train in various fields; or else they train under an ascetic or brahmin of wrong views, of wrong practice. There is this training; this I do not deny. But this training is low, common, worldly, ignoble, and unbeneficial; it does not lead to disenchantment, dispassion, cessation, peace, direct knowledge, enlightenment, and nibbāna. When, however, one of settled faith, of settled devotion, decided, full of confidence, trains in the higher virtuous behavior, the higher mind, and the higher wisdom in the Dhamma and discipline proclaimed by the Tathāgata: this unsurpassed training is for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for therealization of nibbāna. This is called the unsurpassed training. Such is the unsurpassed sight, the unsurpassed hearing, the unsurpassed gain, and the unsurpassed training.",
    "an6.30:6": "(5) \"And how is there the unsurpassed service? Here, someone serves a khattiya, a brahmin, a householder; or they serve various others; or else they serve an ascetic or brahmin of wrong views, of wrong practice. There is this kind of service; this I do not deny. But this kind of service is low, common, worldly, ignoble, and unbeneficial; it does not lead to disenchantment, dispassion, cessation, peace, direct knowledge, enlightenment, and nibbāna. When, however, one of settled faith, of settled devotion, decided, full of confidence, serves the Tathāgata or a disciple of the Tathāgata: this unsurpassed service is for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna. This is called the unsurpassed service. Thus there is the unsurpassed sight, the unsurpassed hearing, the unsurpassed gain, the unsurpassed training, and the unsurpassed service.",
    "an6.30:7": "(6) \"And how is there the unsurpassed recollection? Here, someone recollects the gain of a son, a wife, or wealth; or else they recollect various kinds of gain; or else they recollect an ascetic or brahmin of wrong views, of wrong practice. There is this kind of recollection; this I do not deny. But this kind of recollection is low, common, worldly, ignoble, and unbeneficial; it does not lead to disenchantment, dispassion, cessation, peace, direct knowledge, enlightenment, and nibbāna. When, however, oneof settled faith, of settled devotion, decided, full of confidence, recollects the Tathāgata or a disciple of the Tathāgata: this unsurpassed recollection is for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna. This is called the unsurpassed recollection.",
    "an6.30:8": "\"These, bhikkhus, are the six unsurpassed things.\"",
    "an6.30:9": "Having gained the best of sights,and the unsurpassed hearing,having acquired the unsurpassed gain,delighting in the unsurpassed training,",
    "an6.30:10": "Attentive in service,they develop recollectionconnected with seclusion,secure, leading to the deathless.",
    "an6.30:11": "Rejoicing in heedfulness,prudent, restrained by virtue,in time they realizewhere it is that suffering ceases."
}