{
    "an6.45:1": "() \"Bhikkhus, isn’t poverty suffering in the world for one who enjoys sensual pleasures?\"",
    "an6.45:2": "() \"If a poor,destitute, indigent person gets into debt, isn’t his indebtedness, too, suffering in the world for one who enjoys sensual pleasures?\"",
    "an6.45:3": "() \"If a poor, destitute, indigent person who has gotten into debt promises to pay interest, isn’t the interest, too, suffering in the world for one who enjoys sensual pleasures?\"",
    "an6.45:4": "() \"If a poor, destitute, indigent person who has promised to pay interest cannot pay it when it falls due, they reprove him. Isn’t being reproved, too, suffering in the world for one who enjoys sensual pleasures?\"",
    "an6.45:5": "() \"If a poor, destitute, indigent person who is reproved does not pay, they prosecute him. Isn’t prosecution, too, suffering in the world for one who enjoys sensual pleasures?\"",
    "an6.45:6": "() \"If a poor, destitute, indigent person who is prosecuted does not pay, they imprison him. Isn’t imprisonment, too, suffering in the world for one who enjoys sensual pleasures?\"",
    "an6.45:7": "\"So, bhikkhus, for one who enjoys sensual pleasures, poverty is suffering in the world; getting into debt is suffering in the world; having to pay interest is suffering in the world; being reproved is suffering in the world; prosecution is suffering in the world; and imprisonment is suffering in the world.",
    "an6.45:8": "(2) \"Having no faith, no sense of moral shame, no moral dread, no energy, no wisdom incultivatingwholesome qualities, that poor, destitute, indigent person engages in misconduct by body, speech, and mind. This, I say, is his getting into debt.",
    "an6.45:9": "(3) \"To conceal his bodily misconduct, he nurtures an evil desire. He wishes: ‘Let no one know me’; he intendswith the aim: ‘Let no one know me’;he utters statementswith the aim: ‘Let no one know me’; he makes bodily endeavorswith the aim: ‘Let no one know me.’",
    "an6.45:10": "(4) \"Well-behaved fellow monks speak thus about him: ‘This venerable one acts in such a way, behaves in such a way.’ This, I say, is his being reproved.",
    "an6.45:11": "(5) \"When he has gone to the forest, to the foot of a tree, or to an empty dwelling, bad unwholesome thoughts accompanied by remorse assail him. This, I say, is his prosecution.",
    "an6.45:12": "(6) \"Then, with the breakup of the body, after death, that poor, destitute, indigent person who engaged in misconduct by body, speech, and mind is bound in the prison of hell or the prison of the animal realm. I do not see, bhikkhus, any other prison that is as terrible and harsh,andsuch an obstacle to attaining the unsurpassed security from bondage, as the prison of hell or the prison of the animal realm.\"",
    "an6.45:13": "Poverty is called suffering in the world;so too is getting into debt.A poor person who becomes indebtedis troubled while enjoying himself.",
    "an6.45:14": "Then they prosecute himand he also incurs imprisonment.This imprisonment is indeed sufferingfor one yearning for gain and sensual pleasures.",
    "an6.45:15": "Just so in the Noble One's discipline,one in whom faith is lacking,who is shameless and brash,heaps up a mass of evil kamma.",
    "an6.45:16": "Having engaged in misconductby body, speech, and mind,he forms the wish:\"May no one find out about me.\"",
    "an6.45:17": "He twists around with his body,twists aroundby speech or mind;he piles up his evil deeds,in one way or another, repeatedly.",
    "an6.45:18": "This foolish evildoer, knowinghis own misdeeds, is a poor personwho falls into debt,troubled while enjoying himself.",
    "an6.45:19": "His thoughts then prosecute him;painful mental states born of remorsefollow him wherever he goeswhether in the village or the forest.",
    "an6.45:20": "This foolish evildoer,knowing his own misdeeds,goes to a certainanimalrealmor is even bound in hell.",
    "an6.45:21": "This indeed is the suffering of bondage[n.1341] I have divided the stanzas as is done inBe,which I find more satisfactory than Ce. In Ee the lines of verse are not grouped into separate stanzas.from which the wise person is freed,givinggiftswith wealth righteously gained,settling his mind in confidence.",
    "an6.45:22": "The householder endowed with faithhas made a lucky throw in both cases:for his welfare in this present lifeand happiness in future lives.Thus it is that for home-dwellersthis merit increases through generosity.[n.1342] All three editions readevam etaṁ gahaṭṭhānaṁ cāgo puññaṁ pavaḍḍhati. The syntax is not satisfactory yet no variants are noted.Mpattempts to resolve the problem with its gloss,cāgoti saṅkhaṁ gataṁ puññaṁ vaḍḍhati, \"merit which is designated ‘generosity’ increases,\" but this is implausible. Could there have originally been an ablativecāgāhere, or an instrumentalcāgena(with the verbvaḍḍhati, to support the meter), which was changed tocāgoby error? The Chinese parallel,MĀ125, lends some support to this hypothesis at T I 614c20:, \"because of generosity merit increases.\"",
    "an6.45:23": "Just so, in the Noble One's discipline,one whose faith is firm,who is endowed with shame, dreading wrong,wise and restrained by virtuous behavior,",
    "an6.45:24": "is said to live happilyin the Noble One's discipline.Having gained spiritual happiness,one then resolves on equanimity.",
    "an6.45:25": "Having abandoned the five hindrances,always arousing energy,he enters upon the jhānas,unified, alert, and mindful.",
    "an6.45:26": "Having known things thus as they really are,through complete non-clingingthe mind is rightly liberatedwith the destruction of all fetters.",
    "an6.45:27": "With the destruction of the fetters of existence,for the stable one, rightly liberated,the knowledge occurs:\"My liberation is unshakable.\"",
    "an6.45:28": "This is the supreme knowledge;this is unsurpassed happiness.Sorrowless, dust-free, and secure,this is the highest freedom from debt."
}