{
    "an6.61:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Bārāṇasī in the deer park at Isipatana. Now on that occasion, after their meal, on returning from their alms round, a number of elder bhikkhus assembled and were sitting together in the pavilion hall when this conversation arose: \"It was said, friends, by the Blessed One in the Pārāyana, in ‘The Questions of Metteyya’:[n.394]Sn 042. The brahmin student's name is Tissa Metteyya. On the Pārāyana, seeAN3.32, n. 367.",
    "an6.61:2": "\"‘Having understood both ends,the wise one does not stick in the middle.[n.1395]Majjhe mantā na lippati.Mpglossesmantāwithpaññā, taking it to be a feminine noun. In this it follows Nidd II 10,1, which glossesmantāas if it were a truncated feminine instrumental:majjhe mantāya na lippati. I think it more likely, however, thatmantāis the nominative of the agent nounmantar, \"a thinker, a wise man.\" On this form, see Norman 006b: 190–91.I call him a great man:he has here transcended the seamstress.’",
    "an6.61:3": "\"What, friends, is the first end? What is the second end? What is in the middle? And what is the seamstress?\"",
    "an6.61:4": "(2) When this was said, another bhikkhu said to the elder bhikkhus: \"The past, friends, is one end; the future is the second end; the present is in the middle; and craving is the seamstress. For craving sews one to the production of this or that state of existence. It is in this way that a bhikkhu directly knows what should be directly known … in this very life he makes an end of suffering.\"",
    "an6.61:5": "(3) When this was said, another bhikkhu said to the elder bhikkhus: \"Pleasant feeling, friends, is one end; painful feeling is the second end; neither-painful-nor-pleasant feeling is in the middle; and craving is the seamstress. For craving sews one to the production of this or that state of existence. It is in this way that a bhikkhu directly knows what should be directly known … in this very life he makes an end of suffering.\"",
    "an6.61:6": "(4) When this was said, another bhikkhu said to the elder bhikkhus: \"Name, friends, is one end; form is the second end; consciousness is in the middle; and craving is the seamstress.[n.1398]Mp:\"Consciousness—both rebirth-consciousness and the other kinds—is said to be in the middle because it occurs as the condition for name and form.\"For craving sews one to the production of this or that state of existence. It is in this way that a bhikkhu directly knows what should be directly known … in this very life he makes an end of suffering.\"",
    "an6.61:7": "(5) When this was said, another bhikkhu said to the elder bhikkhus: \"The six internal bases, friends, are one end; the six external bases are the second end; consciousness is in the middle; and craving is the seamstress.[n.1399]Mp:\"Kammic consciousness is in the middle; or here, because kamma is included by the mind-base among the internal bases, any kind of consciousness is in the middle; or else thejavanaconsciousness is dependent on an internal base—for (it depends on) adverting in the mind-door—and so it is said to be in the middle.\"For craving sews one to the production of this or that state of existence. It is in this way that a bhikkhudirectly knows what should be directly known … in this very life he makes an end of suffering.\"",
    "an6.61:8": "(6) When this was said, another bhikkhu said to the elder bhikkhus: \"Personal existence, friends, is one end; the origin of personal existence is the second end; the cessation of personal existence is in the middle; and craving is the seamstress.[n.1400]Mp:\"Personal existence(sakkāya)is the round of existence with its three planes. The origin of personal existence is the truth of the origin; the cessation of personal existence is the truth of cessation.\" Again, I would interpret this as I did the first presentation: personal existence is the present existence; the origin of personal existence is the arising of the next existence; the cessation of personal existence is the ceasing of the present existence. And craving, by generating rebirth, sews the future existence to this present one.For craving sews one to the production of this or that state of existence. It is in this way that a bhikkhu directly knows what should be directly known; fully understands what should be fully understood; and by doing so, in this very life he makes an end of suffering.\"",
    "an6.61:9": "When this was said, a certain bhikkhu said to the elder bhikkhus: \"Friends, we have each explained according to our own inspiration. Come, let's go to the Blessed One and report this matter to him. As the Blessed One explains it to us, so should we retain it in mind.\"",
    "an6.61:10": "\"Yes, friend,\" those elder bhikkhus replied. Then the elder bhikkhus went to the Blessed One, paid homage to him, sat down to one side, and reported to him the entire conversation that had taken place,asking:\"Bhante, which of us has spoken well?\"The Blessed One said:\"In a way, bhikkhus, you have all spoken well, but listen and attend closely as I tell you what I intended when I said in the Pārāyana, in ‘The Questions of Metteyya’:",
    "an6.61:11": "\"‘Having understood both ends,the wise one does not stick in the middle.I call him a great man:he has here transcended the seamstress.’\"",
    "an6.61:12": ""
}