{
    "an6.14:1": "There the Venerable Sāriputta addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an6.14:2": "\"Friends, a bhikkhu passes his time[n.169]Vihāraṁ kappeti. Lit., \"arranges his dwelling.\"Kappeti, as suggesting a way to pass time, occurs in such expressions asjīvitaṁ kappeti, \"to make a living,\"vāsaṁ kappeti, \"to make a dwelling, to dwell,\"nisajjaṁ kappeti, \"to take a seat, to sit down,\" etc.in such a way that he does not have a good death.[n.170]Na bhaddakaṁ maraṇaṁ hoti, no bhaddikā kālakiriyā. Pāli often pairs two words for death,maraṇaandkālakiriyā. Since such a manner of expression sounds odd in English, I use one word.Mpsays that what is meant by \"not a good death\" is rebirth in the plane of misery(apāye paṭisandhiṁ gaṇhāti).And how does a bhikkhu pass his time in such a way that he does not have a good death?",
    "an6.14:3": "\"Here, (1) a bhikkhu delights in work, takes delight in work, is devoted to delight in work;[n.1271]Kammārāmo hoti kammarato kammārāmataṁ anuyutto. In this context,kammameans construction work, common at monasteries, such as putting up new buildings and renovating existing facilities.(2) he delights in talk, takes delight in talk, is devoted to delight in talk; () he delights in sleep, takes delight in sleep, is devoted to delight in sleep; (4) he delights in company, takes delight in company, is devoted to delight in company; (5) he delights in bonding, takes delight in bonding, is devoted to delight in bonding; (6) he delights in proliferation, takes delight in proliferation, is devoted to delight in proliferation.[n.1272]Papañcārāmo hoti papañcarato papañcārāmataṁ anuyutto.Mpsays: \"Proliferation is the proliferation of defilements, occurring by way of craving, views, and conceit and inducing intoxication\"(papañco ti taṇhādiṭṭhimānavasena pavatto madanākārasaṇṭhito kilesapapañco). For more onpapañca, see pp. 1710–11, note 881.When a bhikkhu passes his time in such a way he does not have a good death. This is called a bhikkhu who delights in personal existence,[n.127]Sakkāya.Mp:\"The round of existence with its three planes\"(tebhūmakavaṭṭaṁ).who has not abandoned personal existence to completely make an end of suffering.",
    "an6.14:4": "\"Friends, a bhikkhu passes his time in such a way that he has a good death. And how does a bhikkhu pass his time in such a way that he has a good death?",
    "an6.14:5": "\"Here, (1) a bhikkhu does not delight in work, does not take delight in work, is not devoted to delight in work; (2) he does not delight in talk, does not take delight in talk, is not devoted to delight in talk; (3) he does not delight in sleep, does not take delight in sleep, is not devoted to delight in sleep; (4) he does not delight in company, does not take delight in company, is not devoted to delight in company; () he does not delight in bonding, does not take delight in bonding, is not devoted to delight in bonding; (6) he does not delight in proliferation, does not take delight in proliferation, is not devoted to delight in proliferation. When a bhikkhupasses his time in such a way he has a good death. This is called a bhikkhu who delights in nibbāna, who has abandoned personal existence to completely make an end of suffering.\"",
    "an6.14:6": "The creature[n.1274]Mago. Lit., \"a beast.\"Mp:\"One like a beast\"(magasadiso).devoted to proliferation,who is delighted with proliferation,has failed to attain nibbāna,the unsurpassed security from bondage.",
    "an6.14:7": "But one who has abandoned proliferation,who finds delight in non-proliferation,has attained nibbāna,the unsurpassed security from bondage."
}