{
    "an6.55:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha on Mount Vulture Peak. Now on that occasion the Venerable Soṇa was dwelling at Rājagaha in the Cool Grove.[n.367] This is Soṇa Koḷivīsa, declared by the Buddha foremost among those who arouse energy (seeAN.205). His verses are atTh 632–44.Th 638–39refer to the simile of the lute;Th 640–44are identical with the verses at the end of this sutta. The story of Soṇa appears in an expanded version atKhandaka 5, where it leads to the Buddha’s granting permission to the monks to wear sandals.",
    "an6.55:2": "Then, having known with his own mind the course of thought in the Venerable Soṇa's mind, just as a strong man might extend his drawn-in arm or draw in his extended arm, the Blessed One disappeared on Mount Vulture Peak and appeared in the Cool Grove in the presence of the Venerable Soṇa. The Blessed One sat down on the seat prepared for him. The Venerable Soṇa paid homage to the Blessed One and sat down to one side. The Blessed One then said to him:",
    "an6.55:3": "\"Soṇa, when you were alone in seclusion, didn’t the following course of thought arise in your mind: ‘I am one of the Blessed One's most energetic disciples, yet my mind has not been liberated from the taints by non-clinging. Now there is wealth in my family, and it is possible for me to enjoy my wealth and do meritorious deeds. Let me then give up the training and return to the lower life, so that I can enjoy my wealth and do meritorious deeds’?\"",
    "an6.55:4": "\"Tell me, Soṇa, in the past, when you lived at home, weren’t you skilled at the lute?\"",
    "an6.55:5": "\"When its strings were too loose, was your lute well tuned and easy to play?\"",
    "an6.55:6": "\"But, Soṇa, when its strings were neither too tight nor too loose but adjusted to a balanced pitch, was your lute well tuned and easy to play?\"",
    "an6.55:7": "\"So too, Soṇa, if energy is aroused too forcefully this leads to restlessness, and if energy is too lax this leads to laziness. Therefore, Soṇa, resolve on a balance of energy, achieve evenness of the spiritual faculties, and take up the object there.\"[n.1368] Reading withCeand Ee:Viriyasamataṃ adhiṭṭhaha, indriyānaṃ ca samataṃ paṭivijjha, tattha ca nimittaṃ gaṇhāhi.Where Ce and Ee haveviriyasamataṃ,Be hasvīriyasamathaṃ(but just below,indriyānañca samataṃ). Mp (Ce) also readsviriyasamathaṃin the lemma. The explanation in Mp seems to supportviriyasamathaṃ.Mp: “Resolve on evenness of energy: Resolve on serenity combined with energy(viriyasampayuttaṃ samathaṃ adhiṭṭhaha).The meaning is, ‘Link energy with serenity.’ Achieve evenness of the spiritual faculties: Keep to evenness, a balance of the spiritual faculties of faith, etc. When faith is linked with wisdom and wisdom with faith; when energy is linked with concentration and concentration with energy, then the balance of the faculties is maintained. But mindfulness is useful everywhere, so it should always be strong…. Seize the object there: When such balance exists, the object can arise clearly, like the reflection of one’s face in a mirror; and you should take up(gaṇhāhi)this object—bring forth(nibbattehi)the object of serenity, of insight, of the path, and of the fruit. Thus the Buddha explained the meditation subject to him, leading up to arahantship.”Chinese parallels to this passage offer quite different readings of the Buddha’s injunction, as follows:T I 612a28–29: \"Therefore you should distinguish this time (couldsamataṁhave mutated intosamayaṁ?), examine this mark, and do not be heedless\" (); T II 62c1–18: \"Therefore you should practice by taking up (the object) in a balanced way; do not cling, do not be heedless, and do not grasp marks\" (); T II 612b19–20: \"If you can stay in the middle, this is the superior practice\" (); T XXII 844c1–2is closest to the Pāli: \"You should balance your energy, balance the faculties\" ().",
    "an6.55:8": "Then, some time later, the Venerable Soṇa resolved on a balance of energy, achieved evenness of the spiritual faculties, and took up the object there. Then, dwelling alone, withdrawn, heedful, ardent, and resolute, in no long time the Venerable Soṇa realized for himself with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness, and having entered upon it, he dwelled in it. He directly knew: \"Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.\" And the Venerable Soṇa became one of the arahants.",
    "an6.55:9": "Having attained arahantship, the Venerable Soṇa thought: \"Let me go to the Blessed One and declare final knowledge in his presence.\" Then he approached the Blessed One, paid homage to him, sat down to one side, and said:",
    "an6.55:10": "\"Bhante, when a bhikkhu is an arahant, one whose taints are destroyed, who has lived the spiritual life, done what had to be done, laid down the burden, reached his own goal, utterly destroyed the fetters of existence, and become completely liberated through final knowledge, he is intent upon six things: on renunciation, on solitude, on non-affliction, on the destruction of craving, on the destruction of clinging, and on nonconfusion.[n.1369] In Pāli:nekkhammādhimutto,pavivekādhimutto,abyāpajjhādhimutto,taṇhakkhayādhimutto,upādānakkhayādhimutto,asammohādhimutto.Mpsays that each expression signifies arahantship.",
    "an6.55:11": "(1) \"It may be, Bhante, that some venerable one here thinks: ‘Could it be that this venerable one is intent upon renunciation on account of mere faith?’ But it should not be seen in such a way. A bhikkhu with taints destroyed, who has lived the spiritual life and done his task, does not see in himself anything further to be done or anyneed toincrease what has been done.[n.1370]Karaṇīyaṁ attano asamanupassanto katassa vā paṭicayaṁ.Mpglossespaṭicayaṁwith \"growth by repeated activity\"(punappunaṁ karaṇena vaḍḍhiṁ).He is intent upon renunciation because he is devoid of lust through the destruction of lust; because he is devoid of hatred through the destruction of hatred; because he is devoid of delusion through the destruction of delusion.",
    "an6.55:12": "(2) \"It may be that some venerable one here thinks: ‘Could it be that this venerable one is intent upon solitude because he is hankering after gain, honor, and praise?’ But it should not be seen in such a way. A bhikkhu with taints destroyed, who has lived the spiritual life and done his task, does not see in himself anything further to be done or anyneed toincrease what has been done. He is intent upon solitude because he is devoid of lust through the destruction of lust; because he is devoid of hatred through the destruction of hatred; because he is devoid of delusion through the destruction of delusion.",
    "an6.55:13": "(3) \"It may be that some venerable one here thinks: ‘Could it be that this venerable one is intent upon non-affliction because he has fallen back on the wrong grasp of behavior and observances as the essence?’[n.71]Sīlabbataparāmāsaṁ…sārato paccāgacchanto. This expression normally refers to the extreme austerities of those who believe them to be the core of spiritual cultivation. SeeAN3.78.But it should not be seen in such a way. A bhikkhu with taints destroyed, who has lived the spiritual life and done his task, does not see in himself anything further to be done or anyneed toincrease what has been done. He is intent upon non-affliction because he is devoid of lust through the destruction of lust; because he is devoid of hatred through the destruction of hatred; because he is devoid of delusion through the destruction of delusion.",
    "an6.55:14": "(4) \" … He is intent upon the destruction of craving because he is devoid of lust through the destruction of lust; because he is devoid of hatred through the destruction of hatred; because he is devoid of delusion through the destruction of delusion.[n.1372] All three editions abridge the last three items as is done here.",
    "an6.55:15": "(5) \" … He is intent upon the destruction of clinging because he is devoid of lust through the destruction of lust; because he is devoid of hatred through the destruction of hatred; because he is devoid of delusion through the destruction of delusion.",
    "an6.55:16": "(6) \" … He is intent upon non-confusion because he is devoid of lust through the destruction of lust; because he is devoid of hatred through the destruction of hatred; because he is devoid of delusion through the destruction of delusion.",
    "an6.55:17": "\"Bhante, when a bhikkhu is thus perfectly liberated in mind, even if powerful forms cognizable by the eye come into raṅge of the eye, they do not obsess his mind; his mind is not at all affected. It remains steady, attained to imperturbability, and he observes its vanishing.[n.1373]Vayañc’assānupassati.Mp:\"He sees the arising and vanishing of that mind\"(tassa c’esa cittassa uppādampi vayampi passati).Even if powerful sounds cognizable by the ear come into raṅge of the ear … Even if powerful odours cognizable by the nose come into raṅge of the nose … Even if powerful tastes cognizable by the tongue come into raṅge of the tongue … Even if powerful tactile objects cognizable by the body come into raṅge of the body … Even if powerful phenomena cognizable by the mind come into raṅge of the mind, they do not obsess his mind; his mind is not at all affected. It remains steady, attained to imperturbability, and he observes its vanishing.",
    "an6.55:18": "If one is intent on renunciationand solitude of mind;if one is intent on non-afflictionand the destruction of clinging;",
    "an6.55:19": "if one is intent on craving's destructionand non-confusion of mind:when one sees the sense bases’ arising,one's mind is completely liberated.",
    "an6.55:20": "For a bhikkhu of peaceful mind,one completely liberated,there's nothing further to be done,noneed toincrease what has been done.",
    "an6.55:21": "As a stone mountain, one solid mass,is not stirred by the wind,so no forms and tastes, sounds,odours, and tactile objects,",
    "an6.55:22": "and phenomena desirable or undesirablestir the stable one's mind.His mind is steady and freed,and he observes its vanishing."
}