{
    "an6.46:1": "Thus have I heard. On one occasion the Venerable Mahācunda was dwelling among the Cetis at Sahajāti. There he addressed the bhikkhus:",
    "an6.46:2": "(1) \"Here, friends, bhikkhus who are Dhamma specialists[n.1343]Dhammayogā.Mpsays this is a name for speakers on the Dhamma(dhammakathikā), but it may refer to all those who adopt a pre-dominantly cognitive approach to the Dhamma. The term seems to be unique to the present text. The distinction posited between meditators and those intent on Dhamma suggests a late origin, when vocations in the Saṅgha had bifurcated along these lines.disparage those bhikkhus who are meditators, saying: ‘They meditate and cogitate,claiming: \"We are meditators, we are meditators!\"[n.1344]Jhāyanti pajjhāyanti. The tone of this is derisive. Be uses a string of four verbs:jhāyanti pajjhāyanti nijjhāyanti avajjhāyanti. For a similar derisive use of verbs based onjhāyanti, seeAN11.9, V 33,18;MN 50.9, I 334,18–34.Why do they meditate? In what way do they meditate? How do they meditate?’ In this case, the bhikkhus who are Dhamma specialists aren’t pleased, and the bhikkhus who are meditators aren’t pleased, and they aren’t practicing for the welfare of many people, for the happiness of many people, for the good, welfare, and happiness of many people, of devas and human beings.",
    "an6.46:3": "(2) \"But the meditating bhikkhus disparage the bhikkhus who are Dhamma specialists, saying: ‘They are restless, puffed up, vain, talkative, rambling in their talk, muddle-minded, lacking clear comprehension, unconcentrated, with wandering minds, with loose sense faculties,claiming: \"We are Dhamma specialists, we are Dhamma specialists!\" Why are they Dhamma specialists? In what way are they Dhamma specialists? How are they Dhamma specialists?’ In this case, the meditators aren’t pleased, and the Dhamma specialists aren’t pleased, and they aren’t practicing for the welfare of many people, for the happiness of many people, for the good, welfare, and happiness of many people, of devas and human beings.",
    "an6.46:4": "(3) \"Friends, the bhikkhus who are Dhamma specialists praise only bhikkhus who are Dhamma specialists, not those who are meditators. In this case, the bhikkhus who are Dhamma specialistsaren’t pleased, and those who are meditators aren’t pleased, and they aren’t practicing for the welfare of many people, for the happiness of many people, for the good, welfare, and happiness of many people, of devas and human beings.",
    "an6.46:5": "(4) \"But the bhikkhus who are meditators praise only bhikkhus who are also meditators, not those who are Dhamma specialists. In this case, the bhikkhus who are meditators aren’t pleased, and those who are Dhamma specialists aren’t pleased, and they aren’t practicing for the welfare of many people, for the happiness of many people, for the good, welfare, and happiness of many people, of devas and human beings.",
    "an6.46:6": "(5) \"Therefore, friends, you should train yourselves thus: ‘Those of us who are Dhamma specialists will praise those bhikkhus who are meditators.’ Thus should you train yourselves. For what reason? Because, friends, these persons are astounding and rare in the world who dwell having touched the deathless element with the body.[n.1345]Amataṁ dhātuṁ kāyena phusitvā viharanti.Mp:\"This refers to the nibbāna element, called ‘the deathless’ because it is devoid of death. Having taken up a meditation subject, in stages they dwell having touched it with the mental body.\"",
    "an6.46:7": "(6) \"Therefore, friends, you should train yourselves thus: ‘Those of us who are meditators will praise those bhikkhus who are Dhamma specialists.’ Thus should you train yourselves. For what reason? Because, friends, these persons are astounding and rare in the world who see a deep and pithy matter after piercing it through with wisdom.\"[n.1346]Gambhīraṁ atthapadaṁ paññāya ativijjha passanti.Mp:\"The ‘deep and pithy matter’ includes the aggregates, elements, sense bases, and so forth, which are subtle and hidden. They see this after penetrating it with insight and path wisdom(sahavipassanāya maggapaññāya).\""
}