{
    "an6.26:1": "There the Venerable Mahākaccāna addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an6.26:2": "What six? (1) \"Here, friends, a noble disciple recollects the Tathāgata thus: ‘The Blessed One is an arahant … the Enlightened One, the Blessed One.’ When a noble disciple recollects the Tathāgata, on that occasion his mind is not obsessed by lust, hatred,or delusion; on that occasion his mind is simply straight. He has departed from greed, freed himself from it, emerged from it. ‘Greed,’ friends, is a designation for the five objects of sensual pleasure. This noble disciple dwells with a mind entirely like space: vast, exalted, measureless, without enmity and ill will. Having made this a basis, some beings here become pure in such a way.[n.195] Where the preceding sutta readsidh’ekacce sattā visujjhanti,the present one hasidh’ ekacce sattā visuddhidhammā bhavanti. There is no difference in the meaning.",
    "an6.26:3": "(2) \"Again, a noble disciple recollects the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One … to be personally experienced by the wise.’ When a noble disciple recollects the Dhamma, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight. He has departed from greed … some beings here become pure in such a way.",
    "an6.26:4": "(3) \"Again, a noble disciple recollects the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practicing the good way … the unsurpassed field of merit for the world.’ When a noble disciple recollects the Saṅgha, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight. He has departed from greed …… some beings here become pure in such a way.",
    "an6.26:5": "(4) \"Again, a noble disciple recollects his own virtuous behavior as unbroken, flawless, unblemished, unblotched, freeing, praised by the wise, ungrasped, leading to concentration. When a noble disciple recollects his virtuous behavior, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight. He has departed from greed … some beings here become pure in such a way.",
    "an6.26:6": "(5) \"Again, a noble disciple recollects his own generosity thus: ‘It is truly my good fortune … that in a population obsessed by the stain of miserliness, I dwell with a mind devoid of the stain of miserliness … delighting in giving and sharing.’ When a noble disciple recollects his generosity, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight. He has departed from greed … beings here become pure in such a way.",
    "an6.26:7": "(6) \"Again, a noble disciple recollects the deities thus: ‘There are devas (ruled by) the four great kings …… I too have such faith … such virtuous behavior … such learning … such generosity … such wisdom as those deities possessed, because of which, when they passed away here, they were reborn there.’ When a noble disciple recollects the faith, virtuous behavior, learning, generosity, and wisdom in himself and in those deities, on that occasion his mind is not obsessed by lust, hatred, or delusion; on that occasion his mind is simply straight. He has departed from greed, freed himself from it, emerged from it. ‘Greed,’ friends, is a designation for the five objects of sensual pleasure. This noble disciple dwells with a mind entirely like space: vast, exalted, measureless, without enmity and ill will. Having made this a basis, too, some beings here become pure in such a way.",
    "an6.26:8": "\"It's astounding and amazing, friends, that the Blessed One, the Arahant, the Perfectly Enlightened One, who knows and sees, has discovered the opening in the midst of confinement for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna, that is, the six subjects of recollection.\""
}