{
    "an6.56:1": "Now on a certain occasion the Venerable Phagguṇa was sick, afflicted, gravely ill. Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said: \"Bhante, the Venerable Phagguṇa is sick, afflicted, gravely ill. Please let the Blessed One visit him out of compassion.\" The Blessed One consented by silence.",
    "an6.56:2": "\"I hope you are bearing up, Phagguṇa. I hope you are getting better. I hope that your painful feelings are subsiding and not increasing, and that their subsiding, not their increase, is to be seen.\"",
    "an6.56:3": "Just as if a strong man were to grind my head with the tip of a sharp sword, so too, violent windscut through my head. I am not bearing up ….",
    "an6.56:4": "Just as if a strong man were to tighten a tough leather strap around my head as a headband, so too, there are violent headpains in my head. I am not bearing up ….",
    "an6.56:5": "Just as if a skillful butcher or his apprentice were to carve upan ox'sbelly with a sharp butcher's knife, so too, violent winds are carving up my belly. I am not bearing up ….",
    "an6.56:6": "Just as if two strong men were to seize a weaker man by both arms and roast and grill him over a pit of hot coals, so too, there is a violent burning in my body. I am not bearing up, Bhante, I am not getting better. Strong painful feelings are increasing in me, not subsiding, and their increase, not their subsiding, is to be seen.\"",
    "an6.56:7": "Not long after the Blessed One left, the Venerable Phagguṇa died. At the time of his death, his faculties were serene.",
    "an6.56:8": "\"Why, Ānanda, shouldn’t the bhikkhu Phagguṇa's faculties have been serene?",
    "an6.56:9": "\"There are, Ānanda, these six benefits of listening to the Dhamma at the proper time and of examining the meaning at the proper time.[n.1376] I followBeand Ee, in which the first, second, fourth, and fifth benefits come from listening to the Dhamma at the proper time(kālena dhammassavane), the third and sixth from examining the meaning at the proper time(kālena atth’upaparikkhāya). Ce combines the two for the third and sixth items, which seems less satisfactory, because in these two situations the monk doesn’t get to hear the Dhamma.What six?",
    "an6.56:10": "(2) \"Again, a bhikkhu's mind is not yet liberated from the five lower fetters. At the time of his death he does not get to see the Tathāgata, but he gets to see a disciple of the Tathāgata. The Tathāgata's disciple teaches him the Dhamma … reveals a spiritual life that is perfectly complete and pure. When the bhikkhu hears that discourse on the Dhamma, his mind is liberated from the five lower fetters. This is the second benefit of listening to the Dhamma at the proper time.",
    "an6.56:11": "(3) \"Again, a bhikkhu's mind is not yet liberated from the fivelower fetters. At the time of his death he does not get to see the Tathāgata or a disciple of the Tathāgata, but he ponders, examines, and mentally inspects the Dhamma as he has heard it and learned it. As he does so, his mind is liberated from the five lower fetters. This is the third benefit of examining the meaning at the proper time.",
    "an6.56:12": "(4) \"Here, Ānanda, a bhikkhu's mind is liberated from the five lower fetters but not yet liberated in the unsurpassed extinction of the acquisitions.[n.1377]Anuttare upadhisaṅkhaye.Mpidentifies this as nibbāna.Sabbūpadhipaṭinissagga.Mpspecifies three types of \"acquisitions\"(upadhi): the five aggregates, the defilements, and volitional activities(khandha,kilesa,abhisaṅkhārā). The relinquishment of these is a synonym for nibbāna. The striving for this is the energy arisen along with insight and the path.At the time of his death he gets to see the Tathāgata. The Tathāgata teaches him the Dhamma … he reveals a spiritual life that is perfectly complete and pure. When the bhikkhu hears that discourse on the Dhamma, his mind is liberated in the unsurpassed extinction of the acquisitions. This is the fourth benefit of listening to the Dhamma at the proper time.",
    "an6.56:13": "(5) \"Again, a bhikkhu's mind is liberated from the five lower fetters but not yet liberated in the unsurpassed extinction of the acquisitions. At the time of his death he does not get to see the Tathāgata, but he gets to see a disciple of the Tathāgata. The Tathāgata's disciple teaches him the Dhamma … reveals a spiritual life that is perfectly complete and pure. When the bhikkhu hears that discourse on the Dhamma, his mind is liberated in the unsurpassed extinction of the acquisitions. This is the fifth benefit of listening to the Dhamma at the proper time.",
    "an6.56:14": "(6) \"Again, a bhikkhu's mind is liberated from the five lower fettersbut not yet liberated in the unsurpassed extinction of the acquisitions. At the time of his death he does not get to see the Tathāgata or a disciple of the Tathāgata, but he ponders, examines, and mentally inspects the Dhamma as he has heard it and learned it. As he does so, his mind is liberated in the unsurpassed extinction of the acquisitions. This is the sixth benefit of examining the meaning at the proper time.",
    "an6.56:15": "\"These, Ānanda, are the six benefits of listening to the Dhamma at the proper time and of examining the meaning at the proper time.\""
}