{
    "an6.44:1": "Then, in the morning, the Venerable Ānanda dressed, took his bowl and robe, and went to the house of the female lay follower Migasālā, where he sat down on the seat prepared for him. Then the female lay disciple Migasālā approached the Venerable Ānanda, paid homage to him, sat down to one side, and said:",
    "an6.44:2": "\"Bhante Ānanda, just how should this teaching of the Blessed One be understood, where one who is celibate and one who is not celibate both have exactly the same destination in their future life?My father Purāṇa was celibate, living apart, abstaining from sexual intercourse, the common person's practice. When he died, the Blessed One declared: ‘He attained to the state of a once-returner[n.139] I take the correct reading here to be Besakadāgāmipatto(found, too, in Burmese manuscripts), as contrasted with Ce and Eesakadāgāmī satto. Confusion ofsandpis not unusual in Sinhalascript manuscripts. However, the gloss inMp,sakadāgāmipuggalo hutvā, suggests that the commentator used a text with the readingsakadāgāmī satto. It is not impossible that the corruption (if it is one) dates back before the age of the commentaries.and has been reborn in the Tusita group (of devas).’ My paternal uncle[n.1330]Ceand Bepetteyyopi; Eepetteyyo piyo. The only meaning PED assignspetteyyais \"showing filial piety toward one's father,\" which does not fit here. We should probably read herepettāpiyo, which PED defines as \"father's brother, paternal uncle.\" In the version atAN10.75, Ce haspettā pi yoand Eepettā piyo, which, by closing the spaces, would both give the desired reading. InMN89, Purāṇa and Isidatta are said to have been in the employment of King Pasenadi of Kosala but to have shown greater respect toward the Buddha than toward the king. Their love for the Buddha is expressed inSN55:6.Isidatta was not celibate but lived a contented married life. When he died, the Blessed One also declared: ‘He attained to the state of a once-returner and has been reborn in the Tusita groupof devas.’ Bhante Ānanda, just how should this teaching of the Blessed One be understood, where one who is celibate and one who is not celibate both have exactly the same destination in their future life?\"",
    "an6.44:3-4": "Then, when the Venerable Ānanda had received almsfood at Migasālā's house, he rose from his seat and departed. After his meal, on returning from his alms round, he went to the Blessed One, paid homage to him, sat down to one side, and said: \"Here, Bhante, in the morning, I dressed, took my bowl and robe, and went to the house of the female lay follower Migasālā …all as above, down to… When she asked me this, I replied: ‘It was just in this way, sister, that the Blessed One declared it.’\"",
    "an6.44:5": "The Blessed One said:\"Who, indeed, is the female lay follower Migasālā, a foolish, incompetent woman with a woman's intellect?[n.1332]Ceambakapaññā;Be here hasammakasaññā,\"a woman's perception\" or \"a woman's idea,\" but the Be text ofAN10.7readsammakapaññā. Ee hasambakasaññāhere butambakapaññāin the concluding paragraph. Apparently Ee's former reading is a typographical error for the latter, since on the first occurrencesaññāis cited as a variant in the notes. Again, the commons/pconfusion must lie behind the variants.Ambakain Ce and Ee (or Beammaka)is derived fromammā, \"mother,\" but with the more general meaning of women. Mp-ṭ explains: \"Ammakā(orambakā)means women (lit., the class of mothers). This is a metaphorical term. That is, mothers, the class of mothers, maternal parents, are found among women\"(Ammakāti mātugāmo. Upacāravacanañh’etaṁ. Itthīsu yadidaṁ ammakā mātugāmo jananī janikā). SED svambāhas \"a mother, good woman (as a title of respect).\" And underambikā: \"mother, good woman (as a term of respect).\" The Chinese parallel at T II 28c8–9, does not include the derogatory generalization about women, but states the matter with reference to Migasālā as an individual: \"The lay follower Migasālā is foolish and has little wisdom\" ().And who are thosewho havethe knowledge of other persons as superior and inferior?[n.1333] The juxtaposition of nominativekewith locative–ñāṇeis puzzling. I take the sense to be that those referred to bykeare establishedinthis knowledge. Perhaps, though,–ñāṇeis a residual eastern form, a nominative plural in agreement withke.Mpdoes not attempt to resolve this problem, but when commenting on \"in the knowledge of other persons as superior and inferior\"(purisapuggalaparopariyañāṇe), it explains this knowledge as \"the knowledge of other persons’ superior and inferior faculties by way of their sharpness or dullness\"(purisapuggalānaṁ tikkhamuduvasena indriyaparopariyañāṇaṁ).",
    "an6.44:6": "What six?(1) \"Here, Ānanda, there is one person who is mild, a pleasant companion, with whom his fellow monks gladly dwell. But he has not listenedto the teachings, become learnedin them, and penetratedthemby view, and he does not attain temporary liberation.[n.1334]Sāmāyikampi vimuttiṁ na labhati.Mpsays that he does not occasionally gain rapture and joy derived from listening to the Dhamma. Paṭis II 40,1–17, however, defines the near-synonymsamayavimokkhoas the four jhānas and four formless attainments(cattāri ca jhānāni, catasso ca arūpasamāpattiyo, ayaṁ samayavimokkho), which it distinguishes from permanent emancipation, identified with the four noble paths, the four fruits of the spiritual life, and nibbāna(cattāro ca ariyamaggā, cattāri ca sāmaññaphalāni, nibbānañca, ayaṁ asamayavimokkho).With the breakup of the body, after death, he heads for deterioration, not for distinction; he is one going to deterioration, not to distinction.",
    "an6.44:7": "(2) \"Then, Ānanda, there is one person who is mild, a pleasant companion, with whom his fellow monks gladly dwell. And he has listenedto the teachings, become learnedin them, and penetratedthemby view, and he attains temporary liberation. With the breakup of the body, after death, he heads for distinction, not for deterioration; he is one going to distinction, not to deterioration.",
    "an6.44:8": "\"Ānanda, those who are judgmental will pass such judgment on them: ‘This one has the same qualities as the other. Why should one be inferior and the other superior?’ Thatjudgmentof theirs[n.1335] Text reads merelytaṁ hi tesaṁ, without specifying whattaṁrefers to.Mpexplains that it is the making of the judgment(taṁ pamāṇakaraṇaṁ).will indeed lead to their harm and suffering for a long time.",
    "an6.44:9": "\"Between them, Ānanda, the person who is mild, a pleasant companion, one with whom his fellow monks gladly dwell, who has listenedto the teachings, become learnedin them, and penetratedthemby view, and who attains temporary liberation,surpasses and excels the other person. For what reason? Because the Dhamma-stream carries him along.[n.1336]Imaṁ puggalaṁ dhammasotaṁ nibbahati.Mp:\"The knowledge of insight, occurring strongly, carries him along; it conducts him to the plane of the noble ones.\"But who can know this difference except the Tathāgata?",
    "an6.44:10": "(3) \"Then, Ānanda, in one person anger and conceit are found, and from time to time states of greed[n.1337] Text haslobhadhammā, \"states of greed,\" whichMpglosses as \"simply greed\"(lobho yeva).arise in him. And he has not listenedto the teachings, become learnedin them, and penetratedthemby view, and he does not attain temporary liberation. With the breakup of the body, after death, he heads for deterioration, not for distinction; he is one going to deterioration, not to distinction.",
    "an6.44:11": "(4) \"Then, Ānanda, in one person anger and conceit are found, and from time to time states of greed arise in him. But he has listenedto the teachings, become learnedin them, and penetratedthemby view, and he attains temporary liberation. With the breakup of the body, after death, he heads for distinction, not for deterioration; he is one going to distinction, not to deterioration.",
    "an6.44:12": "\"Ānanda, those who are judgmental will pass such judgment on them …. I alone, or one like me, may pass judgment on people.[n.1338] I follow here the text of the printedCe,with its elisions. The electronic Ce fills in the elisions incorrectly.",
    "an6.44:13": "(5) \"Then, Ānanda, in one person anger and conceit are found, and from time to time he engages in exchanges of words.[n.39] Here and in §6, I read with Cevacīsaṁsārā, which is also the reading inMpCe. Be and Ee havevacīsaṅkhārā.Mpglosses: \"Just utterances in addressing and conversing\"(ālāpasallāpavasena vacanān’eva).Vacīsaṁsārois atAN2.63, where it refers to arguments between factions of monks.And he has not listenedto the teachings, become learnedin them, and penetratedthemby view, and he does not attain temporary liberation. With the breakup of the body, after death, he heads for deterioration, not for distinction; he is one going to deterioration, not to distinction.",
    "an6.44:14": "(6) \"Then, Ānanda, in one person anger and conceit are found, and from time to time he engages in exchanges of words. But he has listenedto the teachings, become learnedin them, and penetratedthemby view, and he attains temporary liberation. With the breakup of the body, after death,he heads for distinction, not for deterioration; he is one going to distinction, not to deterioration.",
    "an6.44:15": "\"Ānanda, those who are judgmental will pass such judgment on them: ‘This one has the same qualities as the other. Why should one be inferior and the other superior?’ Thatjudgmentof theirs will indeed lead to their harm and suffering for a long time.",
    "an6.44:16": "\"Between them, Ānanda, the person in whom anger and conceit are found, and who from time to time engages in exchanges of words, but who has listenedto the teachings, become learnedin them, and penetratedthemby view, and who attains temporary liberation, surpasses and excels the other person. For what reason? Because the Dhamma-stream carries him along. But who can know this difference except the Tathāgata?",
    "an6.44:17": "\"Who, indeed, is the female lay follower Migasālā, a foolish, incompetent woman with a woman's intellect? And who are thosewho havethe knowledge of other persons as superior and inferior?",
    "an6.44:18": "\"Ānanda, if Isidatta had possessed the same kind of virtuous behavior that Purāṇa had, Purāṇa could not have even known his destination. And if Purāṇa had possessed the same kind of wisdom that Isidatta had, Isidatta could not have even known his destination.[n.1340]Mp:\"Purāṇa excelled in virtuous behavior, Isidatta in wisdom. Purāṇa's virtuous behavior matched Isidatta's superior wisdom; Isidatta's wisdom matched Purāṇa's superior virtuous behavior.\"In this way, Ānanda, these two persons were each deficient in one respect.\""
}