{
    "an6.42:1": "Thus have I heard. On one occasion the Blessed One was wandering on tour among the Kosalans together with a large Saṅgha of bhikkhus when he reached the Kosalan brahmin village named Icchānaṅgala. There the Blessed One dwelled in the Icchānaṅgala woodland thicket. The brahmin householders of Icchānaṅgala heard: \"It is said that the ascetic Gotama, the son of the Sakyans who went forth from a Sakyan family, has arrived at Icchānaṅgala and is now dwelling in the Icchānaṅgala woodland thicket. Now a good report about that Master Gotama has circulated thus: ‘That Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One. Having realized by his own direct knowledge the world with its devas, Māra, and Brahmā, this population with its ascetics and brahmins, its devas and humans, he makes it known to others. He teaches a Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; he reveals a spiritual life that is perfectly complete and pure.’ Now it is good to see such arahants.\"",
    "an6.42:2": "Now on that occasion the Venerable Nāgita was the Blessed One's attendant. The Blessed One then addressed the Venerable Nāgita:\"Who is making such an uproar and a racket, Nāgita? One would think it was fishermen at a haul of fish.\"",
    "an6.42:3": "\"Let the Blessed One now consent, Bhante, let the Fortunate One consent. This is now the time for the Blessed One to consent. Wherever the Blessed One will go now, the brahmin householders of town and countryside will incline in the same direction. Just as, when thick drops of rain are pouring down, the water flows down along the slope, so too, wherever the Blessed One will go now, the brahmin householders of town and country will incline in the same direction. For what reason? Because of the Blessed One's virtuous behavior and wisdom.\"",
    "an6.42:4": "\"Let me never come upon fame, Nāgita, and may fame never catch up with me. One who does not gain at will, without trouble or difficulty, this bliss of renunciation … might accept that vile pleasure, that slothful pleasure, the pleasure of gain, honor, and praise.",
    "an6.42:5": "(1) \"Here, Nāgita, I see a bhikkhu dwelling on the outskirts of a villagesitting in a state of concentration. It then occurs to me: ‘Now a monastery attendant or a novice or a co-religionist will cause that venerable one to fall away from that concentration.’[n.1313] I read withCeārāmiko vā samaṇuddeso vā sahadhammiko vā. Neither Be nor Ee includessahadhammiko vā. Be's reading here is very different:idān’ imaṁ āyasmantaṁ ārāmiko vā upaṭṭhahissati samaṇuddeso vā taṁ tamhā samādhimhā cāvessati; \"Now a monastery attendant or a novice will serve this venerable one, which will cause him to fall away from that concentration.\" Ee follows Be, but withghaṭṭessati, \"strike against, offend, provoke,\" instead ofupaṭṭhahissati.For this reason I am not pleased with this bhikkhu's dwelling on the outskirts of a village.",
    "an6.42:6": "(2) \"I see, Nāgita, a forest-dwelling bhikkhu sitting and dozing in the forest. It then occurs to me: ‘Now this venerable one will dispel this sleepiness and fatigue and attend only to the perception of forest, (a state of) oneness.’[n.1314]Araññasaññaṁyeva manasi karissati ekattaṁ.Mp:\"Oneness: he will bring to mind just the perception of the forest, a one-pointed state of uniformity\"(ekasabhāvaṁ, ekaggatābhūtāṁ araññasaññaṁ yeva citte karissati). The wording here is reminiscent ofMN 121, III 104,20–21:araññasaññaṁ paṭicca manasi karoti ekattaṁ, \"he attends to the oneness dependent on the perception of the forest.\"For this reason I am pleased with this bhikkhu's dwelling in the forest.",
    "an6.42:7": "(3) \"I see, Nāgita, a forest-dwelling bhikkhu sitting in the forest in an unconcentrated state. It then occurs to me: ‘Now this venerable one will concentrate his unconcentrated mind or guard his concentrated mind.’ For this reason I am pleased with this bhikkhu's dwelling in the forest.",
    "an6.42:8": "(4) \"I see, Nāgita, a forest-dwelling bhikkhu sitting in the forest in a state of concentration. It then occurs to me: ‘Now this venerable one will liberate his unliberated mind or guard his liberated mind.’ For this reason I am pleased with this bhikkhu's dwelling in the forest.",
    "an6.42:9": "(5) \"I see, Nāgita, a bhikkhu dwelling on the outskirts of a village, who gains robes, almsfood, lodgings, and medicines and provisions for the sick. Desiring gain, honor, and fame, he neglects seclusion; he neglects remote lodgings in forests and jungle groves.Having entered the villages, towns, and capital cities, he takes up his residence. For this reason I am not pleased with this bhikkhu's dwelling on the outskirts of a village.",
    "an6.42:10": "(6) \"I see, Nāgita, a forest-dwelling bhikkhu who gains robes, almsfood, lodgings, and medicines and provisions for the sick. Having dispelled that gain, honor, and praise, he does not neglect seclusion; he does not neglect remote lodgings in forests and jungle groves. For this reason I am pleased with this bhikkhu's dwelling in the forest.",
    "an6.42:11": "\"When, Nāgita, I am traveling on a highway and do not see anyone ahead of me or behind me, even if it is for the purpose of defecating and urinating, on that occasion I am at ease.\"[n.1315]Mp:\"By this much, the Teacher has praised a forest lodging.\""
}