{
    "an6.51:1": "Then the Venerable Ānanda approached the Venerable Sāriputta and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Venerable Sāriputta:",
    "an6.51:2": "\"Friend Sāriputta, how does a bhikkhu get to hear a teaching he has not heard before, not forget those teachings he has already heard, bring to mind those teachings with which he is already familiar,[n.1355]Cetasā samphuṭṭapubbā te ca samudācaranti. The expression is unusual.Mpoffers merely a routine word gloss.and understand what he has not understood?\"",
    "an6.51:3": "\"Here, friend Sāriputta, (1) a bhikkhu learns the Dhamma: the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers. (2) He teaches the Dhamma to others in detail as he has heard it and learned it. () He makes others repeat the Dhamma in detail as they have heard it and learned it. (4) He recites the Dhamma in detail as he has heard it and learned it. (5) He ponders, examines, and mentally inspects the Dhamma as he has heard it and learned it. (6) He enters upon the rains in a residence where there live elder bhikkhus who are learned, heirs to the heritage, experts on the Dhamma, experts on the discipline, experts on the outlines. From time to time he approaches them and inquires: ‘How is this, Bhante? What is the meaning of this?’ Those venerable ones then disclose to him what has not been disclosed, clear up what is obscure, and dispel his perplexity about numerous perplexing points. It is in this way,friend Sāriputta, that a bhikkhu gets to hear a teaching he has not heard before, does not forget those teachings he has already heard, brings to mind those teachings with which he is already familiar, and understands what he has not understood.\"",
    "an6.51:4": "\"It's astounding and amazing, friend, how well this has been stated by the Venerable Ānanda. And we consider the Venerable Ānanda to be one who possesses these six qualities: (1) For the Venerable Ānanda has learned the Dhamma: the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, amazing accounts, and questions-and-answers. (2) He teaches the Dhamma to others in detail as he has heard it and learned it. (3) He makes others repeat the Dhamma in detail as they have heard it and learned itfrom him. () He recites the Dhamma in detail as he has heard it and learned it. (5) He ponders, examines, and mentally inspects the Dhamma as he has heard it and learned it. (6) He enters upon the rains in a residence where there live elder bhikkhus who are highly learned, heirs to the heritage, experts on the Dhamma, experts on the discipline, experts on the outlines. From time to time he approaches them and inquires: ‘How is this, Bhante? What is the meaning of this?’ Those venerable ones then disclose to him what has not been disclosed, clear up what is obscure, and dispel his perplexity about numerous perplexing points.\""
}