{
    "an6.37:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the female lay follower Veḷukaṇṭakī Nandamātā had prepared an offering possessed of six factors for the Saṅgha of bhikkhus headed by Sāriputta and Moggallāna. With the divine eye, which is purified and surpasses the human, the Blessed One saw the female lay follower Veḷukaṇṭakī Nandamātā preparing this offering and he then addressed the bhikkhus:",
    "an6.37:2": "And how is an offering possessed of six factors? Here, the donor has three factors and the recipients have three factors. \"What are the three factors of the donor? (1) The donor is joyful before giving; () she has a placid, confident mind in the act of giving; and (3) she is elated after giving. These are the three factors of the donor.",
    "an6.37:3": "\"What are the three factors of the recipients? Here, (4) the recipients are devoid of lust or are practicing to remove lust; (5) they are devoid of hatred or are practicing to remove hatred; (6) they are devoid of delusion or are practicing to remove delusion. These are the three factors of the recipients.",
    "an6.37:4": "It is not easy to measure the merit of such an offering thus: ‘Just so much is the stream of merit, stream of the wholesome, nutriment of happiness—heavenly, ripening in happiness, conducive to heaven—that leads to what is wished for, desired, and agreeable, to one's welfare and happiness’; rather, it is reckoned simply as an incalculable, immeasurable, great mass of merit.",
    "an6.37:5": "Bhikkhus, just as it is not easy to measure the water in the great oceanthus: ‘There are so many gallons of water,’ or ‘There are so many hundreds of gallons of water,’ or ‘There are so many thousands of gallons of water,’ or ‘There are so many hundreds of thousands of gallons of water,’ but rather it is reckoned simply as an incalculable, immeasurable, great mass of water; so too, it is not easy to measure the merit of such an offering … rather, it is reckoned simply as an incalculable, immeasurable, great mass of merit.\"",
    "an6.37:6": "Prior to giving one is joyful;while giving one settles the mind in trust;after giving one is elated:this is success in the act of offering.",
    "an6.37:7": "When they are devoid of lust and hatred,devoid of delusion, without taints,self-controlled, living the spiritual life,the field for the offering is complete.",
    "an6.37:8": "Having cleansed oneself[n.1307]Ācamayitvāna.Mpexplains this literally: one washes one's hands and feet and cleans one's mouth.and given with one's own hands,the act of charity is very fruitfulfor oneself and in relation to others.",
    "an6.37:9": "Having performed such a charitable deedwith a mind free from miserliness,the wise person, rich in faith,is reborn in a happy, non-afflictive world."
}