{
    "an6.86:1": "\"Bhikkhus, possessing six qualities, even while listening to the good Dhamma one is incapable of entering upon the fixed courseconsisting inrightness in wholesome qualities.[n.433] SeeAN3.22,AN5.5–53,AN3.22, n. 358, andAN5.5, n. 50.What six?One is obstructed by kamma; one is obstructed by defilement; one is obstructed by the resultof kamma; one is without faith; one is without desire; and one is unwise.[n.434]Mp:\"Obstruction by kamma(kammāvaraṇatā)occurs through the five grave deeds with immediate result (seeAN6.87).Obstruction by defilement(kilesāvaraṇatā)occurs through wrong view with fixed resultthat is, a grave wrong view that denies the working of kamma.Obstruction by result(vipākāvaraṇatā)is an unwholesome resultant rebirth or a rootless wholesome resultant rebirth.\" These two types of rebirth consciousness lack the root of wisdom and thus one reborn through them is incapable of attaining the path. One reborn with a two-rooted rebirth consciousness, lacking the root of wisdom, is also incapable of attaining the path. On the role of rebirth consciousness, see CMA 79, 94–95. The kind of desire(chanda)that is needed is wholesome desire, desire to do the good(kattukamyatāchandaṁ).Possessing these six qualities, even while listening to the good Dhamma one is incapable of entering upon the fixed courseconsisting inrightness in wholesome qualities.",
    "an6.86:2": "\"Bhikkhus, possessing six qualities, while listening[n.1435] I followBe,which does not havepihere, as against Ce and Ee, which havepi. In the partly parallelAN5.151–53, Ce and Ee do not havepi. It seems the sense requires thatpishould be excluded; for it is when listening to the good Dhamma that one would expect a person to enter the path. The same applies toAN6.87andAN6.88just below.to the good Dhamma one is capable of entering upon the fixed courseconsisting inrightness in wholesome qualities. What six? One is not obstructed by kamma; one is not obstructed by defilement; one is not obstructed by the resultof kamma; one is endowed with faith; one has desire; and one is wise. Possessing these six qualities, while listening to the good Dhamma one is capable of entering upon the fixed courseconsisting inrightness in wholesome qualities.\""
}