{
    "an7.57:1": "On one occasion the Blessed One was dwelling at Vesālī in the Great Wood in the hall with the peaked roof. Then Sīha the general approached the Blessed One, paid homage to him, sat down to one side, and said:",
    "an7.57:2": "\"Well then, Sīha, I will question you about this matter. You should answer as you see fit.\"",
    "an7.57:3": "\"Why, Bhante, would the arahants first show compassion to the person without faith who is miserly, mean, and abusive? They would first show compassion to the one endowed with faith, a munificent giver who delights in charity.\"",
    "an7.57:4": "(2) \"What do you think, Sīha? Whom would the arahants approach first: the one without faith who is miserly, mean, and abusive, orthe one endowed with faith, a munificent giver who delights in charity?\"",
    "an7.57:5": "(3) \"What do you think, Sīha? From whom would the arahants first receive alms: from the one without faith who is miserly, mean, and abusive, or from the one endowed with faith, a munificent giver who delights in charity?\"",
    "an7.57:6": "(4) \"What do you think, Sīha? To whom would the arahants first teach the Dhamma: to the one without faith who is miserly, mean, and abusive, or to the one endowed with faith, a munificent giver who delights in charity?\"",
    "an7.57:7": "(5) \"What do you think, Sīha? Which person would acquire a good reputation: the one without faith who is miserly, mean, and abusive, or the one endowed with faith, a munificent giver who delights in charity?\"",
    "an7.57:8": "(6) \"What do you think, Sīha? Which person would approach any assembly—whether of khattiyas, brahmins, householders, or ascetics—confidently and composed: the one without faith who is miserly, mean, and abusive, or the one endowed with faith, a munificent giver who delights in charity?\"",
    "an7.57:9": "(7) \"What do you think, Sīha? With the breakup of the body, after death, which person would be reborn in a good destination, in a heavenly world: the one without faith who is miserly, mean, and abusive, or the one endowed with faith, a munificent giver who delights in charity?\"",
    "an7.57:10": "\"Bhante, I do not go by faith in the Blessed One concerning those six directly visible fruits of giving declared by him. I know them, too. For I am a donor, a munificent giver, and the arahants first show compassion to me. I am a donor, a munificent giver, and the arahants first approach me. I am a donor, a munificent giver, and the arahants first receive alms from me. I am a donor, a munificent giver, and the arahants first teach the Dhamma to me. I am a donor, a munificent giver, and I have acquired a good reputation: ‘Sīha the general is a donor, a sponsor, a supporter of the Saṅgha.’I am a donor, a munificent giver, and whatever assembly I approach—whether of khattiyas, brahmins, householders, or ascetics—I approach it confidently and composed. I do not go by faith in the Blessed One concerning these six directly visible fruits of giving declared by him. I know them, too. But when the Blessed One tells me: ‘Sīha, with the breakup of the body, after death, a donor, a munificent giver, is reborn in a good destination, in a heavenly world,’ I do not know this, and here I go by faith in the Blessed One.\""
}