{
    "an7.42:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the morning, the Venerable Sāriputta dressed, took his bowl and robe, and entered Sāvatthī for alms. It then occurred to him:\"It is still too early to walk for alms in Sāvatthī. Let me go to the park of the wanderers of other sects.\"",
    "an7.42:2": "Then the Venerable Sāriputta neither delighted in nor rejected the statement of those wanderers, but rose from his seat and left,thinking: \"I shall find out what the Blessed One has to say about this statement.\"",
    "an7.42:3": "Then, when the Venerable Sāriputta had walked for alms in Sāvatthī, after his meal, on returning from his alms round, he approached the Blessed One, paid homage to him, and sat down to one side.He here reports verbatim the entire course of events and asks:\"Is it possible, Bhante, in this Dhamma and discipline to describe a bhikkhu as ‘ten-less’ by the mere counting of years?\"",
    "an7.42:4": "\"In this Dhamma and discipline, Sāriputta, it isn’t possible to describe a bhikkhu as ‘ten-less’ by the mere counting of years. There are, Sāriputta, these seven bases forbeing‘ten-less’ that I have proclaimed after realizing them for myself with direct knowledge.[n.1501] SeeAN7.20.",
    "an7.42:5": "What seven? Here, (1) a bhikkhu has a keen desire to undertake the training and does not lose his fondness for undertaking the training in the future. (2) He has a strong desire to attend to the Dhamma and does not lose his fondness for attending to the Dhamma in the future. (3) He has a strong desire to remove vain wishes and does not lose his fondness for removing vain wishes in the future. (4) He has a strong desire for seclusion and does not lose his fondness for seclusion in the future. () He has a strong desire to arouse energy and does not lose his fondness for arousing energy in the future. (6) He has a strong desire for mindfulness and alertness and does not lose his fondness for mindfulness and alertness in the future. (7) He has a strong desire to penetrate by view and does not lose his fondness for penetrating by view in the future. These are the seven bases forbeing‘ten-less’ that I have proclaimed after realizing them for myself with direct knowledge."
}