{
    "an7.68:1": "\"Bhikkhus, possessing seven qualities, a bhikkhu is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What seven? Here, a bhikkhu is one who knows the Dhamma, who knows the meaning, who knows himself, who knows moderation, who knows the proper time, who knows the assembly, and who knows the superior and inferior kinds of persons.",
    "an7.68:2": "(1) \"And how is a bhikkhu one who knows the Dhamma? Here, a bhikkhu knows the Dhamma: the discourses, mixed prose and verse, expositions, verses, inspired utterances, quotations, birth stories, marvelous accounts, and questions-and-answers. If a bhikkhu did not know the Dhamma—the discourses … questions-and-answers—he would not be called ‘one who knows the Dhamma.’ But because he knows the Dhamma—the discourses … questions-and-answers—he is called ‘one who knows the Dhamma.’ Thus he is one who knows the Dhamma.",
    "an7.68:3": "(2) \"And how is a bhikkhu one who knows the meaning? Here, a bhikkhu knows the meaning of this and that statement thus: ‘This is the meaning of this statement; this is the meaning of that statement.’ If a bhikkhu did not know the meaning of this and that statement thus … he would not be called ‘one who knows the meaning.’ But because he knows the meaning of this and that statement thus: ‘This is the meaning of this statement;this is the meaning of that statement,’ he is called ‘one who knows the meaning.’ Thus he is one who knows the Dhamma and one who knows the meaning.",
    "an7.68:4": "(3) \"And how is a bhikkhu one who knows himself? Here, a bhikkhu knows himself thus: ‘I have so much faith, virtuous behavior, learning, generosity, wisdom, and discernment.’ If a bhikkhu did not know himself thus: ‘I have so much faith … and discernment,’ he would not be called ‘one who knows himself.’ But because he knows himself thus: ‘I have so much faith … and discernment,’ he is called ‘one who knows himself.’ Thus he is one who knows the Dhamma, one who knows the meaning, and one who knows himself.",
    "an7.68:5": "(4) \"And how is a bhikkhu one who knows moderation? Here, a bhikkhu knows moderation in accepting robes, almsfood, lodgings, and medicines and provisions for the sick. If a bhikkhu did not know moderation in accepting robes … and provisions for the sick, he would not be called ‘one who knows moderation.’ But because he knows moderation in accepting robes, almsfood, lodgings, and medicines and provisions for the sick, he is called ‘one who knows moderation.’ Thus he is one who knows the Dhamma, one who knows the meaning, one who knows himself, and one who knows moderation.",
    "an7.68:6": "(5) \"And how is a bhikkhu one who knows the proper time? Here, a bhikkhu knows the proper time thus: ‘This is the time for learning, this is the time for questioning, this is the time for exertion, this is the time for seclusion.’ If a bhikkhu did not know the proper time—’This is the time for learning … this is the time for seclusion’—he would not be called ‘one who knows the proper time.’ But because he knows the proper time—’This is the time for learning … this is the time for seclusion’—he is called ‘one who knows the proper time.’ Thus he is one who knows the Dhamma, one who knows the meaning, one who knows himself, one who knows moderation, and one who knows the proper time.",
    "an7.68:7": "(6) \"And how is a bhikkhu one who knows the assembly? Here, a bhikkhu knows the assembly: ‘This is an assembly of khattiyas, this is an assembly of brahmins, this is an assembly of householders, this is an assembly of ascetics. Among these, one should approachthis assemblyin such a way;one should stop in such a way; one should act in such a way; one should sit down in such a way; one should speak in such a way; one should remain silent in such a way.’ If a bhikkhu did not know the assembly: ‘This is an assembly of khattiyas … of ascetics. Among these, one should approachthis assemblyin such a way … one should remain silent in such a way’—he would not be called ‘one who knows the assembly.’ But because he knows the assembly—’This is an assembly of khattiyas … of ascetics. Among these, one should approachthis assemblyin such a way … one should remain silent in such a way’—he is called ‘one who knows the assembly.’ Thus he is one who knows the Dhamma, one who knows the meaning, one who knows himself, one who knows moderation, one who knows the proper time, and one who knows the assembly.",
    "an7.68:8": "(7) \"And how is a bhikkhu one who knows the superior and inferior kinds of persons? Here, a bhikkhu understands persons in terms of pairs.[n.155]Dvayena puggalā viditā honti. Here a minor group of seven pairs is nested within the larger group of seven qualities, so that the discourse includes two sets of seven.i\"Two persons: one wants to see the noble ones; one does not want to see the noble ones. The person who does not want to see the noble ones is in that respect blameworthy; the person who wants to see the noble ones is in that respect praiseworthy.",
    "an7.68:9": "ii\"Two persons who want to see the noble ones: one wants to hear the good Dhamma; one does not want to hear the good Dhamma. The person who does not want to hear the good Dhamma is in that respect blameworthy; the person who wants to hear the good Dhamma is in that respect praiseworthy.",
    "an7.68:10": "iii\"Two persons who want to hear the good Dhamma: one listens to the Dhamma with eager ears; one does not listen to the Dhamma with eager ears. The person who does not listen to the Dhamma with eager ears is in that respect blameworthy; the personwho listens to the Dhamma with eager ears is in that respect praiseworthy.",
    "an7.68:11": "iv\"Two persons who listen to the Dhamma with eager ears: one, having heard the Dhamma, retains it in mind; one, having heard the Dhamma, does not retain it in mind. The person who, having heard the Dhamma, does not retain it in mind is in that respect blameworthy; the person who, having heard the Dhamma, retains it in mind is in that respect praiseworthy.",
    "an7.68:12": "v\"Two persons who, having heard the Dhamma, retain it in mind: one examines the meaning of the teachings that have been retained in mind; one does not examine the meaning of the teachings that have been retained in mind. The person who does not examine the meaning of the teachings that have been retained in mind is in that respect blameworthy; the person who examines the meaning of the teachings that have been retained in mind is in that respect praiseworthy.",
    "an7.68:13": "vi\"Two persons who examine the meaning of the teachings that have been retained in mind: one has understood the meaning and the Dhamma and then practices in accordance with the Dhamma; one has not understood the meaning and the Dhamma and does not practice in accordance with the Dhamma. The person who has not understood the meaning and the Dhamma and does not practice in accordance with the Dhamma is in that respect blameworthy; the person who has understood the meaning and the Dhamma and then practices in accordance with the Dhamma is in that respect praiseworthy.",
    "an7.68:14": "vii\"Two persons who have understood the meaning and the Dhamma and then practice in accordance with the Dhamma: one is practicing for his own welfare but not for the welfare of others; one is practicing for his own welfare and for the welfare of others. The person who is practicing for his own welfare but not for the welfare of others is in that respect blameworthy; the person who is practicing for his own welfare and for the welfare of others is in that respect praiseworthy.",
    "an7.68:15": "\"It is in this way that a bhikkhu understands persons in terms of pairs.",
    "an7.68:16": "It is in this way that a bhikkhu is one who knows the superior and inferior kinds of persons."
}