{
    "an7.58:1": "\"Bhikkhus, there are these four things that the Tathāgata does not need to hide and three things about which he is irreproachable.[n.545] This is a \"composite seven,\" arrived at by combining a tetrad and a triad neither of which appears in AN as the theme of an independent sutta. The first tetrad, however, echoesAN5.00.",
    "an7.58:2": "() \"The Tathāgata is one whose verbal behavior is purified. There is no verbal misconduct on the part of the Tathāgata that he might need to hide,thinking: ‘Let others not find this out about me.’",
    "an7.58:3": "() \"The Tathāgata is one whose mental behavior is purified. There is no mental misconduct on the part of the Tathāgata that he might need to hide,thinking: ‘Let others not find this out about me.’",
    "an7.58:4": "() \"The Tathāgata is one whose livelihood is purified. There is no wrong livelihood on the part of the Tathāgata that he might need to hide,thinking: ‘Let others not find this out about me.’",
    "an7.58:5": "\"These are the four things that the Tathāgata does not need to hide.",
    "an7.58:6": "And what are the three things about which he is irreproachable?",
    "an7.58:7": "(6) \"I have well proclaimed to my disciples the practice leading to nibbāna in such a way that, practicing in accordance with itand reachingthe destruction of the taints, they realize for themselves with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwell in it. In regard to this, I do not see any ground on the basis of which an ascetic, brahmin, deva, Māra, Brahmā, or anyone in the world could reasonably reprove me: ‘For such and such reasons, you have not well proclaimed to your disciples[n.1546] I read withBeand Eetava sāvakā, as against Cetathāgatasāvakā.the practice leading to nibbāna in such a way that, practicing in accordance with itand reachingthe destruction of the taints, they realize for themselves with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwell in it.’ Since I do not see any such ground, I dwell secure, fearless, and self-confident.",
    "an7.58:8": "(7) \"My assembly, bhikkhus, consists of many hundreds of disciples who, with the destruction of the taints, have realized for themselves with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwell in it. In regard to this, I do not see any ground on the basis of which an ascetic, brahmin, deva, Māra, Brahmā, or anyone in the world could reasonably reprove me: ‘For such and such reasons, it is not the case that your assembly consists of many hundreds of disciples who have destroyed the taints and realized for themselves with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwell in it.’ Since Ido not see any such ground, I dwell secure, fearless, and self-confident.",
    "an7.58:9": "\"These are the three things about which the Tathāgata is irreproachable.",
    "an7.58:10": "\"These, bhikkhus, are the four things that the Tathāgata does not have to hide and the three things about which he is irreproachable.\""
}