{
    "an7.63:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the morning, the Blessed One dressed, took his bowl and robe, and went to the residence of the householder Anāthapiṇḍika, where he sat down on the seat that was prepared for him.",
    "an7.63:2": "\"Householder, why are people in your residence making such an uproar and a racket? One would think it was fishermen at a haul of fish.\"",
    "an7.63:3": "Then the Blessed One addressed Sujātā: \"Come here, Sujātā.\"",
    "an7.63:4": "\"Sujātā, a man might have seven kinds of wives. What seven? One like a killer, one like a thief, one like a tyrant, one like a mother, one like a sister, one like a friend, and one like a slave. A man might have these seven kinds of wives. Which one are you?\"",
    "an7.63:5": "\"With hateful mind, devoid of sympathy,lusting for others, despising her husband,she seeks to kill the one who bought her with wealth:a wife like this is called a wife and a killer.",
    "an7.63:6": "\"When the woman's husband acquires wealthby toiling at a craft, trade, or farming,she tries to steal it, even ifhe earnsbut little:a wife like this is called a wife and a thief.",
    "an7.63:7": "\"The lazy glutton, unwilling to work,harsh, fierce, rough in speech,a woman who dominates her own supporters:a wife like this is called a wife and a tyrant.",
    "an7.63:8": "\"One always benevolent and sympathetic,who guards her husband as a mother her son,who protects the wealth he earns:a wife like this is called a wife and a mother.",
    "an7.63:9": "\"She who holds her husband in high regardas younger sister her elder brother,conscientious, following her husband's will:a wife like this is called a wife and a sister.",
    "an7.63:10": "\"One who rejoices when she sees her husbandas if seeing a friend after a long absence;well raised, virtuous, devoted to her husband:a wife like this is called a wife and a friend.",
    "an7.63:11": "\"One who remains patient and calm,when threatened with violence by the rod,[n.1559]Vadhadaṇḍatajjitā.Mp:\"When her husband grabs a rod and threatens her with murder, saying: ‘I’ll kill you’\"(daṇḍakaṁ gahetvā vadhena tajjitā, ‘‘ghātessāmi nan\" ti vuttā).who tolerates her husband with a mind free of hate,patient, submissive to her husband's will:a wife like this is called a wife and a slave.",
    "an7.63:12": "\"The types of wives here calleda killer, a thief, and a tyrant,immoral, harsh, disrespectful,with the body's breakup go to hell.",
    "an7.63:13": "\"But the types of wives here calledmother, sister, friend, and slave,firm in virtue, long restrained,with the body's breakup go to heaven.",
    "an7.63:14": "\"A man, Sujātā, might have these seven kinds of wives. Now which one are you?\""
}