{
    "an7.50:1": "Then the brahmin Jāṇussoṇī approached the Blessed One and exchanged greetings with him … and said to him:",
    "an7.50:2": "(1) \"Here, brahmin, some ascetic or brahmin, claiming to be perfectly celibate, does not actually engage in intercourse with women. But he consents to being rubbed, massaged, bathed, and kneaded by them. He relishes this, desires it, and finds satisfaction in it. This is a breach, flaw, blemish, and blotch of the celibate life. He is called one who lives an impure celibate life, one who is fettered by the bond of sexuality. He is not freed from birth, from old age and death, from sorrow, lamentation, pain, dejection, and anguish; he is not freed from suffering, I say.",
    "an7.50:3": "(2) \"Again, some ascetic or brahmin, claiming to be perfectly celibate, does not actually engage in intercourse with women; nor does he consent to being rubbed, massaged, bathed, and kneaded by them. But he jokes with women, plays with them, and amuses himself with them ….",
    "an7.50:4": "(3) \" … he does not joke with women, play with them, and amuse himself with them … but he gazes and stares straight into their eyes ….",
    "an7.50:5": "(4) \" … he does not gaze and stare straight into women's eyes … but he listens to their voices behind a wall or through a rampart as they laugh, talk, sing, or weep ….",
    "an7.50:6": "(5) \" … he does not listen to the voices of women behind a wall or through a rampart as they laugh, talk, sing, or weep … but he recollects laughing, talking, and playing with them in the past ….",
    "an7.50:7": "(6) \" … he does not recollect laughing, talking, and playing with women in the past … but he looks at a householder or a householder's son enjoying himself furnished and endowed with the five objects of sensual pleasure ….",
    "an7.50:8": "(7) \" … he does not look at a householder or a householder's son enjoying himself furnished and endowed with the five objects of sensual pleasure, but he lives the spiritual life aspiring forrebirth ina certain order of devas,thinking: ‘By this virtuous behavior, observance, austerity, or spiritual life I will be a deva or onein the retinueof the devas.’ He relishes this, desires it, and finds satisfaction in it. This, too, is a breach, flaw, blemish, and blotch of the celibate life. He is calledone who lives an impure celibate life, one who is fettered by the bond of sexuality. He is not freed from birth, from old age and death, from sorrow, lamentation, pain, dejection, and anguish; he is not freed from suffering, I say.",
    "an7.50:9": "\"So long, brahmin, as I saw that I had not abandoned one or another of these seven bonds of sexuality, I did not claim to have awakened to the unsurpassed perfect enlightenment in the world with its devas, Māra, and Brahmā, in this population with its ascetics and brahmins, its devas and humans.",
    "an7.50:10": "But when I did not see even one of these seven bonds of sexuality that I had not abandoned, then I claimed to have awakened to the unsurpassed perfect enlightenment in this world with … its devas and humans.",
    "an7.50:11": "When this was said, the brahmin Jāṇussoṇī said to the Blessed One: \"Excellent, Master Gotama! … Let Master Gotama consider me a lay follower who from today has gone for refuge for life.\""
}