{
    "an7.64:1": "\"Bhikkhus, there are these seven things that are gratifying and advantageous to an enemy that come upon an angry man or woman. What seven?",
    "an7.64:2": "() \"Again, an enemy wishes for an enemy: ‘May he sleep badly!’ For what reason? An enemy does not delight when an enemy sleeps well. When an angry person is overcome and oppressed by anger, though he may sleep on a couch spread with rugs, blankets, and covers, with an excellent covering of antelope hide, with a canopy and red bolsters at both ends, still, he sleeps badly. This is the second thing gratifying and advantageous to an enemy that comes upon an angry man or woman.",
    "an7.64:3": "() \"Again, an enemy wishes for an enemy: ‘May he not succeed!’ For what reason? An enemy does not delight in the success of an enemy.When an angry person is overcome and oppressed by anger, if he gets what is harmful, he thinks: ‘I have gotten what is beneficial,’ and if he gets what is beneficial, he thinks: ‘I have gotten what is harmful.’ When, overcome by anger, he gets these things that are diametrically opposed, they lead to his harm and suffering for a long time. This is the third thing gratifying and advantageous to an enemy that comes upon an angry man or woman.",
    "an7.64:4": "() \"Again, an enemy wishes for an enemy: ‘May he not be wealthy!’ For what reason? An enemy does not delight in the wealth of an enemy. When an angry person is overcome and oppressed by anger, kings appropriate for the royal treasury any wealth he has acquired by energetic striving, amassed by the strength of his arms, earned by the sweat of his brow, righteous wealth righteously gained. This is the fourth thing gratifying and advantageous to an enemy that comes upon an angry man or woman.",
    "an7.64:5": "() \"Again, an enemy wishes for an enemy: ‘May he not be famous!’ For what reason? An enemy does not delight in the fame of an enemy. When an angry person is overcome and oppressed by anger, he loses whatever fame he had acquired through heedfulness. This is the fifth thing gratifying and advantageous to an enemy that comes upon an angry man or woman.",
    "an7.64:6": "() \"Again, an enemy wishes for an enemy: ‘May he have no friends!’ For what reason? An enemy does not delight in an enemy having friends. When an angry person is overcome and oppressed by anger, his friends and companions, relatives and family members, avoid him from afar. This is the sixth thing gratifying and advantageous to an enemy that comes upon an angry man or woman.",
    "an7.64:7": "() \"Again, an enemy wishes for an enemy: ‘With the breakup of the body, after death, may he be reborn in the plane of misery, in a bad destination, in the lower world, in hell!’ For what reason? An enemy does not delight in an enemy's going to a good destination. When an angry person is overcome and oppressed by anger, he engages in misconduct by body, speech, and mind. As a consequence, still overcome by anger, with the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell. This is the seventh thing gratifying and advantageous to an enemy that comes upon an angry man or woman.",
    "an7.64:8": "\"These are the seven things gratifying and advantageous to an enemy that come upon an angry man or woman.\"",
    "an7.64:9": "The angry person is ugly;he also sleeps badly;having gained some benefit,he takes it to be harmful.[n.1561]Atho atthaṁ gahetvāna, anatthaṁ adhipajjati. So all three editions, but an older Sri Lankan edition hasadhigacchatiand a Siamese editionpaṭipajjati. All three will work, but with different nuances. The line obviously represents the second danger of anger in the prose portion.Mpsays \"having obtained something profitable, he thinks ‘I have gotten what is harmful’\"(vuddhiṁ gahetvā…anattho me gahito ti sallakkheti). The Chinese counterpart at 618a12has, \"when he should have obtained great wealth, on the contrary he gets what is harmful.\"",
    "an7.64:10": "The angry person,overcome by anger,having slain by body and speech,[n.1562] All three editions havevadhaṁ katvāna, \"having slain,\" which I follow, but there is a variant,vaṇaṁ katvāna, \"having wounded.\"Mpseems to supportsvadhaṁwith its gloss, \"he commits the act of taking life\"(pāṇātipātakammaṁ katvā). The Chinese at 618a15has only, \"the angry person does a bodily or verbal deed.\"incurs the loss of wealth.",
    "an7.64:11": "Maddened by angerhe acquires a bad reputation.His relatives, friends, and loved onesavoid the angry person.",
    "an7.64:12": "Anger is a cause of harm;anger stirs up mental turmoil.People do not recognize the perilthat has arisen from within.",
    "an7.64:13": "The angry person doesn’t know the good;the angry person doesn’t see the Dhamma.There is just blindness and dense gloomwhen anger overcomes a person.",
    "an7.64:14": "When an angry person causes damage,whether easily or with difficulty,later, when the anger has vanished,he is tormented as if burnt by fire.",
    "an7.64:15": "He shows recalcitranceas a fire does a smoky crest.When his anger spreads outward,people become angry on his account.[n.63] The verse presents several difficulties. Pāda a readsdummaṅkuyaṁ padasseti. Hardy, in his Preface to AN Vol. V (pp. v –vi), states that \"dummaṅkusignifies one who is staggering in a disagreeable, censurable, and scandalous manner, because he is not ashamed at his behavior, or the like.\"Mpglosses the word withdubbaṇṇamukhataṁ, \"an ugly facial expression,\" which the Chinese (at 618a21) approximates with. The verb in pāda c,patāyati, is unclear. Mp glosses withnibbattati, \"is produced,\" which is not sufficiently precise. PED offers \"to be spread out\" (perhaps from *sphātayati; see SED svsphaṭ), which I adopt. The Chinese, \"from this is produced hostile envy,\" may be based on a different word in its Indic original, perhapsspṛhayati(see SED svspṛh), which could have arisen from a corruption of something related to *sphātayati.",
    "an7.64:16": "He has no shame or fear of wrong,his speech is not respectful;one overcome by angerhas no islandof safetyat all.",
    "an7.64:17": "I will tell you about the deedsthat produce torment.Listen to them as they are,[n.1564] Reading withCeand Beyathātathaṁ, as against Eeyathākathaṁ.remote from those that are righteous:",
    "an7.64:18": "An angry person slays his father;an angry person slays his own mother;an angry person slays a brahmin;[n.1565]Mpidentifies \"brahmin\" here as an arahant(khīṇāsavabrāhmaṇaṁ).an angry person slays a worldling.",
    "an7.64:19": "The angry worldling slays his mother,the good woman who gave him life,the one by whom he was nurturedand who showed him this world.",
    "an7.64:20": "Those beings, like oneself,each hold their self most dear;yet those who are angry kill themselves in various ways[n.1566]Hanti kuddho puthuttānaṁ. I render this followingMp'sgloss ofputhuttānaṁwithputhu nānākāraṇehi attānaṁ.when they are distraught about diverse matters.",
    "an7.64:21": "Some kill themselves with a sword;some who are distraught swallow poison;some hang themselves with a rope;somejumpinto a mountain gorge.",
    "an7.64:22": "Deeds that involve destroying growth[n.1567]Bhūnahaccāni kammāni. The commentaries consistently glossbhūnahatasimply ashatavuddhi, \"one who destroys growth.\"SED,svbhrūṇa, listsbhrūṇahatias the killing of an embryo, andbhrūṇahatyāas the killing of a learned brahmin.and deeds that cause their own death:when doing such deeds they do not knowthat defeat is born of anger.",
    "an7.64:23": "Thus death's snare hidden in the hearthas taken the form of anger.One should cut it off by self-control,wisdom, energy, andrightview.",
    "an7.64:24": "The wise person should eradicatethis one unwholesomequality.[n.1568] Reading withCeekam etaṁ akusalaṁ, as against Beyathā metaṁ akusalaṁand Eeekam ekaṁ akusalaṁ. I take \"this one unwholesome (quality)\" to be anger.In such a way one should train in the Dhamma:do not yield to recalcitrance.",
    "an7.64:25": "Free from anger, their misery gone,free from delusion,[n.1569] Reading withCevītamohā, as against Be and Eevītalobhā, \"without greed.\"no longer avid,tamed, having abandoned anger,the taintless ones attain nibbāna.[n.1570] Reading with Ce and Beparinibbanti, as against Eeparinibbiṁsu. A variantparinibbissathayields a second-person plural utterance: \"taintless, you will attain nibbāna.\""
}