{
    "an7.22:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha on Mount Vulture Peak. Now on that occasion King Ajātasattu Vedehiputta of Magadha wished to wage war against the Vajjis. He said thus: \"As powerful and mighty as these Vajjis are, I will annihilate them, destroy them, bring calamity and disaster upon them.\"",
    "an7.22:2": "Then King Ajātasattu addressed the chief minister of Magadha, the brahmin Vassakāra: \"Come, brahmin, go to the Blessed One and in my name pay homage to him with your head at his feet. Inquire whether he is fit and healthy, agile and strong, and feeling at ease. Say: ‘Bhante, King Ajātasattu Vedehiputta of Magadha pays homage to the Blessed One with his head at your feet. He inquires whether you are fit and healthy, agile and strong, and feeling at ease.’ Then say thus: ‘Bhante, King Ajātasattu wishes to wage war against the Vajjis. He says thus: \"As powerful and mighty as these Vajjis are, I will annihilate them, destroy them, bring calamity and disaster uponthem.\"’ Learn well how the Blessed One answers you and report it to me, for Tathāgatas do not speak falsely.\"",
    "an7.22:3": "\"Yes, sir,\" the brahmin Vassakāra replied. Then he rose from his seat and went to the Blessed One. He exchanged greetings with the Blessed One, and when they had exchanged greetings and cordial talk, he sat down to one side and said:",
    "an7.22:4": "Now on that occasion the Venerable Ānanda was standing behind the Blessed One fanning him. The Blessed One then addressed the Venerable Ānanda:",
    "an7.22:5": "(2) \"Have you heard, Ānanda, whether the Vajjis are assembling in harmony, adjourning their meetings in harmony, and conducting the affairs of the Vajjis in harmony?\"",
    "an7.22:6": "(3) \"Have you heard, Ānanda, whether the Vajjis do not decree anything that has not been decreed and do not abolish anything that has already been decreed, but undertake and follow the ancient Vajji principles as they have been decreed?\"",
    "an7.22:7": "(4) \"Have you heard, Ānanda, whether the Vajjis honor, respect, esteem, and venerate the Vajji elders and think they should be heeded?\"",
    "an7.22:8": "(5) \"Have you heard, Ānanda, whether the Vajjis do not abduct women and girls from their families and force them to live with them?\"",
    "an7.22:9": "(6) \"Have you heard, Ānanda, whether the Vajjis honor, respect, esteem, and venerate their traditional shrines, both those withinthe cityand those outside, and do not neglect the righteous oblations as given and done to them in the past?\"",
    "an7.22:10": "(7) \"Have you heard, Ānanda, whether the Vajjis provide righteous protection, shelter, and guard for arahants,with the intention: ‘How can those arahants who have not yet come here come to our realm, and how can those arahants who have already come dwell at ease here?’\"",
    "an7.22:11": "Then the Blessed One addressed the brahmin Vassakāra, the chief minister of Magadha: \"On one occasion, brahmin, I was dwelling at Vesālī at the Sārandada Shrine. There I taught the Vajjis these seven principles of non-decline. As long as these seven principles of non-decline continue among the Vajjis, and the Vajjis are seenestablishedin them, only growth is to be expected for them, not decline.\"",
    "an7.22:12": "When this was said, the brahmin Vassakāra said this to the Blessed One: \"If, Master Gotama, the Vajjis were to observe even one among these principles of non-decline, only growth would be expected for them, not decline. What can be said if they observe all seven? King Ajātasattu Vedehiputta of Magadha, Master Gotama, cannot take the Vajjis by war, exceptthrough treachery or internal dissension. And now, Master Gotama, we must be going. We are busy and have much to do.\""
}