{
    "an7.15:1": "\"Bhikkhus, there are these seven kinds of persons found existing in the world similar to those in water. What seven? () Here, some person has gone under once and remains under. (2) Some person has risen up and then goes under. (3) Some person has risen up and stays there. (4) Some person has risen up, sees clearly, and looks around. (5) Some person has risen up and crosses over. (6) Some person has risen up and gained a firm foothold. (7) Some person has risen up, crossed over, and gone beyond, a brahmin who stands on high ground.[n.464]Pāraṅgato thale tiṭṭhati brāhmaṇo. Here, \"brahmin\" is used as a synonym for the arahant. See in this connection4:5 ¶4and SN35:228, IV 57,9–20.",
    "an7.15:2": "(1) \"And how, bhikkhus, is a person one who has gone under once and remains under? Here, some person possesses exclusively black, unwholesome qualities. In this way a person is one who has gone under once and remains under.",
    "an7.15:3": "(2) \"And how is a person one who has risen up and then goes under? Here, some person has risen up, (thinking): ‘Good is faith in (cultivating) wholesome qualities; good is a sense of moral shame in (cultivating) wholesome qualities; good is moral dread in (cultivating) wholesome qualities; good is energy in (cultivating) wholesome qualities; good is wisdom in (cultivating) wholesome qualities.’ However, his faith does not become stable or grow but rather diminishes. His sense of moral shame … moral dread … energy … wisdom does not become stable or grow but rather diminishes. In this way a person is one who has risen up and then goes under.",
    "an7.15:4": "(3) \"And how is a person one who has risen up and stays put?Here, some person has risen up, (thinking): ‘Good is faith in (cultivating) wholesome qualities … good is wisdom in (cultivating) wholesome qualities.’ His faith neither diminishes nor grows; it just stays put. His sense of moral shame … his moral dread … his energy … his wisdom neither diminishes nor grows; it just stays put. In this way a person is one who has risen up and stays put.",
    "an7.15:5": "(4) \"And how is a person one who has risen up, sees clearly, and looks around? Here, some person has risen up, (thinking): ‘Good is faith in (cultivating) wholesome qualities … good is wisdom in (cultivating) wholesome qualities.’ With the utter destruction of three fetters, this person is a stream-enterer, no longer subject to (rebirth in) the lower world, fixed in destiny, heading for enlightenment. It is in this way that a person is one who has risen up, sees clearly, and looks around.",
    "an7.15:6": "(5) \"And how is a person one who has risen up and is crossing over? Here, some person has risen up, (thinking): ‘Good is faith in (cultivating) wholesome qualities … good is wisdom in (cultivating) wholesome qualities.’ With the utter destruction of three fetters and with the diminishing of greed, hatred, and delusion, this person is a once-returner who, after coming back to this world only one more time, will make an end of suffering. It is in this way that a person is one who has risen up and is crossing over.",
    "an7.15:7": "(6) \"And how is a person one who has risen up and attained a firm foothold? Here, some person has risen up, (thinking): ‘Good is faith in (cultivating) wholesome qualities … good is wisdom in (cultivating) wholesome qualities.’ With the utter destruction of the five lower fetters, he is of spontaneous birth, due to attain final nibbāna there without returning from that world. It is in this way that a person is one who has risen up and gained a firm foothold.",
    "an7.15:8": "(7) \"And how is a person one who has risen up, crossed over, and gone beyond, a brahmin who stands on high ground?Here, some person has risen up, (thinking): ‘Good is faith in (cultivating) wholesome qualities; good is a sense of moral shame in (cultivating) wholesome qualities; good is moral dread in (cultivating) wholesome qualities; good is energy in (cultivating) wholesome qualities; good is wisdom in (cultivating) wholesome qualities.’ With the destruction of the taints, he has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. It is in this way that a person is one who has risen up, crossed over, and gone beyond, a brahmin who stands on high ground.",
    "an7.15:9": "\"These, bhikkhus, are the seven kinds of persons found existing in the world similar to those in water.\""
}