{
    "an7.65:1": "\"Bhikkhus, () when there is no sense of moral shame and moral dread, for one deficient in a sense of moral shame and moral dread, (2) restraint of the sense faculties lacks its proximate cause. When there is no restraint of the sense faculties, for one deficient in restraint of the sense faculties, (3) virtuous behavior lacks its proximate cause. When there is no virtuous behavior, for one deficient in virtuous behavior, (4) right concentration lacks its proximate cause. When there is no right concentration, for one deficient in right concentration, (5) the knowledge and vision of things as they really are lacks its proximate cause. When there is no knowledge and vision of things as they really are, for one deficient in the knowledge and vision of things as they really are, (6) disenchantment and dispassion lack their proximate cause. When there is no disenchantment and dispassion, for one deficient in disenchantment and dispassion, (7) the knowledge and vision of liberation lacks its proximate cause.",
    "an7.65:2": "\"Bhikkhus, (1) when there is a sense of moral shame and moral dread, for one possessing a sense of moral shame and moral dread, () restraint of the sense faculties possesses its proximate cause. When there is restraint of the sense faculties, for one who exercises restraint of the sense faculties, (3) virtuous behavior possesses its proximate cause. When there is virtuous behavior, for one whose behavior is virtuous, (4) right concentration possesses its proximate cause. When there is right concentration, for one possessing right concentration, (5) the knowledge and vision of things as they really are possesses its proximate cause. When there is the knowledge and vision of things as they really are, for one possessing the knowledge and vision of things as they really are, (6) disenchantment and dispassion possess their proximate cause. When there is disenchantment and dispassion, for one possessing disenchantment and dispassion, (7) the knowledge and vision of liberation possesses its proximate cause."
}