{
    "an7.71:1": "\"Bhikkhus, when a bhikkhu is not intent on development, even though he forms the wish: ‘May my mind be liberated from the taints by non-clinging!’ yet his mind is not liberated from the taints by non-clinging. For what reason? Because he lacks development. Lacks development of what? () Of the four establishments of mindfulness, (2) the four right strivings, (3) the four bases for psychic potency, (4) the five spiritual faculties, (5) the five powers, (6) the seven factors of enlightenment, and (7) the noble eightfold path.",
    "an7.71:2": "\"Suppose there was a hen with eight, ten, or twelve eggs that she had not properly covered, incubated, and nurtured.Even though she might form the wish: ‘May my chicks pierce their shells with the points of their claws or beaks and hatch safely!’ yet the chicks are incapable of doing so. For what reason? Because the hen had not properly covered, incubated, and nurtured her eggs.",
    "an7.71:3": "\"Bhikkhus, when a bhikkhu is intent on development, even though he does not form the wish: ‘May my mind be liberated from the taints by non-clinging!’ yet his mind is liberated from the taints by non-clinging. For what reason? Because of his development. Development of what? (1) Of the four establishments of mindfulness, (2) the four right strivings, () the four bases for psychic potency, (4) the five spiritual faculties, (5) the five powers, (6) the seven factors of enlightenment, and (7) the noble eightfold path.",
    "an7.71:4": "\"Suppose there was a hen with eight, ten, or twelve eggs that she had properly covered, incubated, and nurtured. Even though she might not form the wish: ‘May my chicks pierce their shells with the points of their claws or beaks and hatch safely!’ yet the chicks are capable of doing so. For what reason? Because the hen had properly covered, incubated, and nurtured her eggs.",
    "an7.71:5": "\"When, bhikkhus, a carpenter or a carpenter's apprentice sees the impressions of his fingers and his thumb on the handle of his adze, he does not know: ‘I have worn away so much of the adze handle today, so much yesterday, so much earlier’; but when it has worn away, he knows that it has worn away. So too, when a bhikkhu is intent on development, even though he does not know: ‘I have worn away so much of the taints today, so much yesterday, so much earlier,’ yet when they are worn away, he knows that they are worn away.",
    "an7.71:6": "\"Suppose, bhikkhus, there was a seafaring ship bound together by lashings that had been worn away in the water for six months. It would be hauled up on dry land during the cold season and its lashings would be further attacked by wind and sun. Inundated by rain from a rain cloud, the lashings would readily deteriorate and rot away. So too, when a bhikkhu is intent on development, his fetters readily collapse and rot away.\""
}