{
    "an7.44:1": "\"Bhikkhus, there are these seven stations for consciousness.[n.502]Viññāṇaṭṭhitiyo. The word is used here in a different sense than at SN22:54, III 54,26, where the fourviññāṇaṭṭhitiyoare the four aggregates functioning as the supports forviññāṇa. In the present sutta they are planes of rebirth.Mpcalls them \"grounds for the rebirth consciousness\"(paṭisandhiviññāṇassa ṭhānāni). The original meaning of the seven, as described here, is probably lost.Mpexplains them against the background of the Abhidhamma distinction among types of rebirth consciousness, for which see CMA 79–80, 20–9.What seven?",
    "an7.44:2": "() \"There are beings that are different in body but identical in perception, such as the devas of Brahmā's company that are reborn through the firstjhāna. This is the second station for consciousness.[n.1504]Mp:\"These are the devas of Brahmā's assembly, Brahmā's ministers, and the great brahmās. Their bodies are different in pervasion according to their respective level, but their perception is the same because they all have the perception pertaining to the first jhāna. The beings in the four planes of misery also belong to this group. Their bodies are different, but they all have arebirthperception that is a rootless unwholesome resultant.\"",
    "an7.44:3": "() \"There are beings that are identical in body but different in perception, such as the devas of streaming radiance. This is the third station for consciousness.[n.1505]Mptakes \"the devas of streaming radiance\"(devā ābhassarā)to represent all three classes of devas pertaining to the second jhāna: those of limited radiance, measureless radiance, and streaming radiance. In each plane, their bodies are identical in that they all have the same pervasion(ekavipphāro va), but their perception is different in that some are without thought but retain examination(avitakka-vicāramattā), while others are without thought and examination(avitakka-avicārā).",
    "an7.44:4": "() \"There are beings that are identical in body and identical in perception, such as the devas of refulgent glory. This is the fourth station for consciousness.[n.1506]Mp:\"The devas of refulgent glory(subhakiṇhā)are identical in body, and also identical in perception because they all have the perception pertaining to the fourth jhāna (in the Abhidhamma scheme of five jhānas). The devas of great fruit (who are reborn through the fifth jhāna of the fivefold scheme) fall under the fourth station of consciousness. The non-percipient beings do not have consciousness and thus are not included.\"",
    "an7.44:5": "() \"There are beings that, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving‘space is infinite,’ belong to the base of the infinity of space. This is the fifth station for consciousness.",
    "an7.44:6": "() \"There are beings that, by completely surmounting the base of the infinity of space,perceiving‘consciousness is infinite,’ belong to the base of the infinity of consciousness. This is the sixth station for consciousness.",
    "an7.44:7": "() \"There are beings that, by completely surmounting the base of the infinity of consciousness,perceiving‘there is nothing,’ belong to the base of nothingness. This is the seventh station for consciousness.",
    "an7.44:8": "\"These, bhikkhus, are the seven stations for consciousness.\"[n.1507] The non-percipient devas and the devas of the base of neither-perception-nor-non-perception are included among the nine abodes of beings (seeAN9.24) but not among the stations of consciousness."
}