{
    "an7.53:1": "Thus have I heard. On one occasion the Venerable Sāriputta and the Venerable Mahāmoggallāna were wandering on tour in Dakkhiṇāgiri together with a large Saṅgha of bhikkhus. Now on that occasion the female lay follower Veḷukaṇṭakī Nandamātā,[n.520] AtAN2.33andAN4.77§4 she is held up as a model for the Buddha’s female lay followers. She is probably identical with Uttarā Nandamātā, declared atAN.262to be the foremost of meditators among female lay followers.having risen as the night was receding, chanted the Pārāyana.",
    "an7.53:2": "Now on that occasion the greatdevaking Vessavaṇa was traveling from north to south on some business. He heard the female lay follower Nandamātā chanting the Pārāyana and stood waiting until the end of her recitation.",
    "an7.53:3": "When the female lay follower Nandamātā had finished, she fell silent. Having understood that the female lay follower Nandamātā had finished her recitation, the greatdevaking Vessavaṇa applauded: \"Good, sister! Good, sister!\"",
    "an7.53:4": "Then when the night had passed the female lay follower Nandamātā had various kinds of delicious food prepared in her own residence. Then, before they had eaten breakfast, the Saṅgha of bhikkhus headed by Sāriputta and Moggallāna arrived in Veḷukaṇṭaka.",
    "an7.53:5": "Then, with her own hands, the female lay follower Nandamātā served and satisfied with various kinds of delicious food the Saṅgha of bhikkhus headed by Sāriputta and Moggallāna. When the Venerable Sāriputta had finished eating and had put away his bowl, she sat down to one side and the Venerable Sāriputta asked her:",
    "an7.53:6": "(1) \"Here, Bhante, having risen as the night was receding, I chanted the Pārāyana ….She here relates, in the first person, the entire incident narrated above, ending with Vessavaṇa's words: \"And this will be your guest's gift tome.\"… Bhante, let whatever merit I may have gained by this act of giving be dedicated to the happiness of the greatdevaking Vessavaṇa.\"",
    "an7.53:7": "\"It's astounding and amazing,[n.1522] A comment is called for about the expressionacchariyaṁ abbhutaṁ. Though often rendered \"wonderful and marvelous,\" the phrase is not always intended to express appreciation but to suggest, rather, astonishment and amazement. Of course, the boundary line between the two senses is porous, as can be seen from the way the English words \"wonderful\" and \"marvelous,\" which now have an appreciative sense, evolved from words connected with astonishment.Nandamātā, that you can converse[n.1523]Beand Ee readsallapissasī ti. Cesallapissatī ti, in the third person, may be an editorial error.directly with such a powerful and influential young deva as the greatdevaking Vessavaṇa.\"",
    "an7.53:8": "(2) \"Bhante, that is not the only astounding and amazing quality of mine. There is another. I had only one son, a dear and beloved boy named Nanda. The rulers seized and abducted him on some pretext and executed him. Bhante, when that boy was arrested or was being put under arrest, when he was in prison or was being imprisoned,[n.1524]Beand Ee readvadhe vā vajjhamāne vā, Cebaddhe vā vajjhamāne vā. The Sinhala translation in Ce mirrors the inconsistency of its Pāli text. I suggest reading, contrary to all three editions,baddhe vā bajjhamāne vā. In this way the three pairs of phrases represent a sequence of arrest, imprisonment, and execution.when he was dead or was being killed, I don’t recall any alteration of my mind.\"[n.1525]Cittassa aññathattaṁ. The expression recurs just below. My rendering is intended to fit both cases. In the present case a spiritually undeveloped woman would normally be distraught, in the case below she would be frightened.",
    "an7.53:9": "(3) \"Bhante, that is notthe only astounding and amazing quality of mine. There is still another. When my husband died, he was reborn in the yakkha realm.[n.1527]Yakkhayoniṁ.Mp:\"The spirit realm is the state of an earth-bound deity(bhummadevatābhāvaṁ).\"Yoniis here used in the sense of \"realm,\" and thus the expressionyakkhayonidoes not imply that yakkhas are born from the womb.He appeared to me in his previous bodily form, but I don’t recall any alteration of my mind.\"",
    "an7.53:10": "(4) \"Bhante, that is not the only astounding and amazing quality of mine. There is still another. I was given to my young husband in marriage when I was a young girl, but I don’t recall ever transgressing against him even in thought, much less by deed.\"",
    "an7.53:11": "(5) \"Bhante, that is not the only astounding and amazing quality of mine. There is still another. Since I declared myself a lay follower, I don’t recall ever intentionally transgressing any training rule.\"",
    "an7.53:12": "(6) \"Bhante, that is not the only astounding and amazing quality of mine. There is still another. For as much as I want, secluded from sensual pleasures, secluded from unwholesome states, I enter and dwell in the first jhāna, which consists of rapture and pleasure born of seclusion, accompanied by thought and examination. With the subsiding of thought and examination, I enter and dwell in the second jhāna, which has internal placidity and unification of mind and consists of rapture and pleasure born of concentration, without thought and examination. With the fading away as well of rapture, I dwell equanimous and, mindful and clearly comprehending, I experience pleasurewith the body; I enter and dwell in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ With the abandoning of pleasure and pain, and with the previous passing away of joy and dejection, I enter and dwell in the fourth jhāna, neither painful nor pleasant, which has purification of mindfulness by equanimity.\"",
    "an7.53:13": "(7) \"Bhante, that is not the only astounding and amazing quality of mine. There is still another. Of the five lower fetters taught by the Blessed One, I don’t see any that I haven’t abandoned.\"[n.1528] This establishes her status as a non-returner, who has abandoned the five lower fetters but not the five higher fetters.",
    "an7.53:14": "Then the Venerable Sāriputta instructed, encouraged, inspired, and gladdened Nandamātā with a Dhamma talk, after which he rose from his seat and departed."
}