{
    "an7.72:1": "Thus have I heard. On one occasion the Blessed One was walking on tour among the Kosalans together with a large Saṅgha of bhikkhus. Then, while traveling along the highway, in a certain spot the Blessed One saw a great mass of fire burning, blazing, and glowing. He left the highway, sat down on the seat prepared for him at the foot of a tree, and addressed the bhikkhus: \"Bhikkhus, do you see that great mass of fire burning, blazing, and glowing?\"",
    "an7.72:2": "(1) \"What do you think, bhikkhus? Which is better, to embrace that great mass of fire, burning, blazing, and glowing, and sit down or lie down next to it, or to embrace a girl with soft and tender hands and feet—whether from a khattiya, brahmin, or householder clan—and sit down or lie down next to her?\"",
    "an7.72:3": "\"I inform you, bhikkhus, I declare to you that for an immoral man of bad character—one of impure and suspect behavior, secretive in his actions, not an ascetic though claiming to be one, not a celibate though claiming to be one, inwardly rotten, corrupt, depraved—it would be far better to embrace that great mass of fire, burning, blazing, and glowing, and sit down or lie down next to it. For what reason? Because on that accounthe might undergo death or deadly pain, but for that reason he would not, with the breakup of the body, after death, be reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an7.72:4": "But when that immoral man … embraces a girl with soft and tender hands and feet—whether from a khattiya, brahmin, or householder clan—and sits down or lies down next to her, this leads to his harm and suffering for a long time. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an7.72:5": "(2) \"What do you think, bhikkhus? Which is better, for a strong man to wrap a tough horsehair rope around both one's shins and tighten it so that it cuts through one's outer skin, inner skin, flesh, sinews, and bone, until it reaches the marrow, or for one to accept the homage of affluent khattiyas, brahmins, or householders?\"",
    "an7.72:6": "\"I inform you, bhikkhus, I declare to you that for an immoral man … it would be far better if a strong man were to wrap a tough horsehair rope around both his shins and tighten it so that it cuts through his outer skin, inner skin, flesh, sinews, and bone, until it reaches the marrow. For what reason? Because on that account he might undergo death or deadly pain, but for that reason he would not, with the breakup of the body, after death, be reborn in the plane of misery, in a bad destination, in the lower world, in hell.But when that immoral man … accepts the homage of affluent khattiyas, brahmins, or householders, this leads to his harm and suffering for a long time. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an7.72:7": "(3) \"What do you think, bhikkhus? Which is better, for a strong man to strike one in the breast with a sharp spear smeared with oil, or for one to accept reverential salutations from affluent khattiyas, brahmins, or householders?\"",
    "an7.72:8": "\"I inform you, bhikkhus, I declare to you that for an immoral man … it would be far better if a strong man were to strike him in the breast with a sharp spear smeared with oil. For what reason? Because on that account he might undergo death or deadly pain, but for that reason he would not, with the breakup of the body, after death, be reborn in the plane of misery, in a bad destination, in the lower world, in hell. But when that immoral man … accepts reverential salutations from affluent khattiyas, brahmins, or householders, this leads to his harm and suffering for a long time. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an7.72:9": "(4) \"What do you think, bhikkhus? Which is better, for a strong man to wrap a hot iron sheet—burning,blazing, and glowing—around one's body, or for one to use a robe given out of faith by affluent khattiyas, brahmins, or householders?\"",
    "an7.72:10": "\"I inform you, bhikkhus, I declare to you that for an immoral man … it would be far better if a strong man were to wrap a hot iron sheet—burning, blazing, and glowing—around his body. For what reason? Because on that account he might undergo death or deadly pain, but for that reason he would not, with the breakup of the body, after death, be reborn in the plane of misery, in a bad destination, in the lower world, in hell. But when that immoral man … makes use of a robe given out of faith by affluent khattiyas, brahmins, or householders, this leads to his harm and suffering for a long time. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an7.72:11": "(5) \"What do you think, bhikkhus? Which is better, for a strong man to force open one's mouth with a hot iron spike—burning, blazing, and glowing—and insert a hot copper ball—burning, blazing, and glowing—which burns one's lips, mouth, tongue, throat, and stomach,[n.1596] I read withEeudaraṁ, as against Ce and Beuraṁ, \"chest.\"and comes out from below taking along one's entrails, or for one to consume almsfood given out of faith by affluent khattiyas, brahmins, or householders?\"",
    "an7.72:12": "\"I inform you, bhikkhus, I declare to you that for an immoral man … it would be far better if a strong man were to force open his mouth with a hot iron spike—burning, blazing, and glowing—and insert a hot copper ball … which burns one's lips … and comes out from below, taking along his entrails. For what reason? Because on that account he might undergo death or deadly pain, but for that reason he would not, with the breakup of the body, after death, be reborn in the plane of misery, in a bad destination, in the lower world, in hell. But when that immoral man … consumes almsfood given out of faith by affluent khattiyas, brahmins, or householders, this leads to his harm and suffering for a long time. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an7.72:13": "(6) \"What do you think, bhikkhus? Which is better, for a strong man to grab one by the head or shouldersand force one to sit or lie down on a hot iron bed or chair—burning, blazing, and glowing—or for one to use a bed and chair given out of faith by affluent khattiyas, brahmins, or householders?\"",
    "an7.72:14": "\"I inform you, bhikkhus, I declare to you that for an immoral man … it would be far better if a strong man were to grab him by the head or shoulders and force him to sit or lie down on a hot iron bed or chair, burning, blazing, and glowing. For what reason? Because on that account he might undergo death or deadly pain, but for that reason he would not, with the breakup of the body, after death, be reborn in the plane of misery, in a bad destination, in the lower world, in hell. But when that immoral man … uses a bed and chair given out of faith by affluent khattiyas, brahmins, or householders, this leads to his harm and suffering for a long time. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an7.72:15": "(7) \"What do you think, bhikkhus? Which is better, for a strong man to grab one, turn one upside down, and throw one into a hot copper cauldron—burning, blazing, and glowing—and while one is boiling there in a swirl of froth, one sometimes rises, sometimes sinks, and sometimes is swept across, or for one to use a dwelling given out of faith by affluent khattiyas,brahmins, or householders?\"",
    "an7.72:16": "\"I inform you, bhikkhus, I declare to you that for an immoral man of bad character—one of impure and suspect behavior, secretive in his actions, not an ascetic though claiming to be one, not a celibate though claiming to be one, inwardly rotten, corrupt, depraved—it would be far better for a strong man to grab him, turn him upside down, and throw him into a hot copper cauldron—burning, blazing, and glowing—so that while he is boiling there in a swirl of froth, he sometimes rises, sometimes sinks, and sometimes is swept across. For what reason? Because on that account he might undergo death or deadly pain, but for that reason he would not, with the breakup of the body, after death, be reborn in the plane of misery, in a bad destination, in the lower world, in hell. But when that immoral man … uses a dwelling given out of faith by affluent khattiyas, brahmins, or householders, this leads to his harm and suffering for a long time. With the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell.",
    "an7.72:17": "\"Therefore, bhikkhus, you should train yourselves thus: ‘When we use robes, almsfood, lodgings, and medicines and provisions for the sick, these services thatothersprovide for us will be of great fruit and benefit to them, and this going forth of ours will not be barren, but fruitful and fertile.’ Thus should you train yourselves. Considering your own good, bhikkhus, it is enough to strive for the goal with heedfulness; considering the good of others,it is enough to strive for the goal with heedfulness; considering the good of both, it is enough to strive for the goal with heedfulness.\"[n.1597] See SN12:22, II 29,16–21.",
    "an7.72:18": "This is what the Blessed One said. Now while this exposition was being spoken, sixty bhikkhus vomited hot blood. Sixty bhikkhus gave up the training and returned to the lower life, saying: \"It is difficult to do, Blessed One, very difficult to do.\" And the minds of sixty bhikkhus were liberated from the taints by non-clinging.[n.1598]Mp,commenting onAN1.53, discusses this passage more fully as follows: \"Those bhikkhus who vomited hot blood had committedpārājikaoffenses. Those who returned to lay life had been going around violating the lesser and minor training rules. And those who attained arahantship had purified their behavior. The Teacher's discourse was fruitful for all three. (Question:) Granted it was fruitful for those who attained arahantship, how was it fruitful for the others? (Reply:) Because if they had not heard this discourse, (the first kind) would have become heedless and would not have been able to abandon their condition. Their evil behavior would have increased and dragged them down to the realms of misery. But when they heard this discourse, they were filled with a sense of urgency. Having abandoned their condition, some became sāmaṇeras (novices), fulfilled the ten precepts, applied themselves to careful attention, and became stream-enterers, once-returners, or non-returners, while some were reborn in the deva world. Thus it was fruitful even for those who had committedpārājikas. If the others had not heard this discourse, as time went on, they would have gradually committedsaṅghādisesasandpārājikas. They would have been reborn in the realms of misery and experienced great suffering. But having heard it, thinking that they could not fulfill the practice all their lives, they gave up the training and returned to lay life. They became settled in the three refuges, observed the five precepts, fulfilled the duty of a lay follower, and became stream-enterers, once-returners, or non-returners, while some were reborn in the deva world. Thus the discourse was fruitful for them, too.\""
}