{
    "an7.29:1": "\"Bhikkhus, these seven things lead to the decline of a lay follower. What seven? () He stops seeing bhikkhus; (2) he neglects listening to the good Dhamma; (3) he does not train in the higher virtuous behavior; (4) he is full of suspicion toward bhikkhus, whether they be elders, newly ordained, or of middle standing; (5) he listens to the Dhamma with a mind bent on criticism, seeking to find faults with it; (6) he seeks a person worthy of offerings among outsiders; (7) he first doesmeritoriousdeeds there.[n.483]Tattha ca pubbakāraṁ karoti. SeeAN5.75,AN6.93.Mp:\"He first gives to those following other creeds and only afterwards to bhikkhus.\"These seven things lead to the decline of a lay follower.",
    "an7.29:2": "\"Bhikkhus, these seven things lead to the non-decline of a lay follower. What seven? (1) He does not stop seeing bhikkhus; () he does not neglect listening to the good Dhamma; (3) he trains in the higher virtuous behavior; (4) he is full of confidence in bhikkhus, whether they be elders, newly ordained, or of middle standing; (5) he listens to the Dhamma with a mind that is not bent on criticism, not seeking to find faults with it; (6) he does not seek a person worthy of offerings among outsiders; (7) he first doesmeritoriousdeeds here. These seven things lead to the non-decline of a lay follower.\"[n.1484]Be,but not Ce or Ee, has the following before the verses: \"This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this.\"",
    "an7.29:3": "The lay follower who stops seeing(bhikkhus) who have developed themselves,who stopshearing the noble ones’ teachings,and does not train in the higher virtue;",
    "an7.29:4": "whose suspicion toward the bhikkhusis ever on the increase;who wants to listen to the good Dhamma",
    "an7.29:5": "with a mind bent on criticism;the lay follower who seeksone worthy of offerings among outsidersand first undertakes to domeritorious deeds toward them:",
    "an7.29:6": "these seven well-taught principlesdescribe what leads to decline.A lay follower who resorts to themfalls away from the good Dhamma.",
    "an7.29:7": "The lay follower who does not stop seeingbhikkhuswho have developed themselves,who listens to the noble ones’ teachings,and trains in the higher virtue;",
    "an7.29:8": "whose confidence in the bhikkhusis ever on the increase;who wants to listen to the good Dhammawith a mind not bent on criticism;",
    "an7.29:9": "the lay follower who seeks noneworthy of offerings among outsiders;but who here first undertakesto do meritorious deeds:",
    "an7.29:10": "these seven well-taught principlesdescribe what leads to non-decline.A lay follower who resorts to themdoes not fall away from the good Dhamma."
}