{
    "an7.74:1": "\"Bhikkhus, in the past there was a teacher named Araka, the founder of a spiritual sect, one without lust for sensual pleasures. The teacher Araka had many hundreds of disciples to whom he taught such a Dhamma as this: ‘Brahmins, short is the life of human beings, limited and fleeting; it has much suffering, much misery. One should wisely understand this.One should do what is wholesome and lead the spiritual life; for none who are born can escape death.",
    "an7.74:2": "(1) \"‘Just as a drop of dew on the tip of a blade of grass will quickly vanish at sunrise and will not last long, so too, brahmins, human life is like a drop of dew. It is limited and fleeting; it has much suffering, much misery. One should wisely understand this. One should do what is wholesome and lead the spiritual life; for none who are born can escape death.",
    "an7.74:3": "(2) \"‘Just as, when thick drops of rain are pouring down, a water bubble will quickly vanish and will not last long, so too, brahmins, human life is like a water bubble. It is limited … for none who are born can escape death.",
    "an7.74:4": "(3) \"‘Just as a line drawn on water with a stick will quickly vanish and will not last long, so too, brahmins, human life is like a line drawn on water with a stick. It is limited … for none who are born can escape death.",
    "an7.74:5": "(4) \"‘Just as a river flowing down from a mountain, going a long distance, with a swift current, carrying along much flotsam, will not stand still for a moment, an instant, a second, but will rush on, swirl, and flow forward, so too, brahmins, human life is like a mountain stream. It is limited … for none who are born can escape death.",
    "an7.74:6": "(5) \"‘Just as a strong man might form a lump of spittle at the tip of his tongue and spit it out without difficulty, so too, brahmins, human life is like a lump of spittle. It is limited … for none who are born can escape death.",
    "an7.74:7": "(6) \"‘Just asa piece of meat thrown into an iron pan heated all day will quickly vanish and will not last long, so too, brahmins, human life is like this piece of meat. It is limited … for none who are born can escape death.",
    "an7.74:8": "(7) \"‘Just as, when a cow to be slaughtered is being led to the slaughterhouse, whatever leg she lifts, she is close to slaughter, close to death, so too, brahmins, human life is like a cow doomed to slaughter. It is limited and fleeting; it has much suffering, much misery. One should wisely understand this. One should do what is wholesome and lead the spiritual life; for none who are born can escape death.’",
    "an7.74:9": "\"But at that time, bhikkhus, the human life span was 60,000 years, and girls were marriageable at the age of five hundred. At that time, people had but six afflictions: cold, heat, hunger, thirst, excrement, and urine. Though people had such long life spans and lived so long, and though their afflictions were so few, still, the teacher Araka gave his disciples such a teaching: ‘Brahmins, short is the life of human beings … for none who are born can escape death.’",
    "an7.74:10": "\"But nowadays, bhikkhus, one could rightly say: ‘Short is the life of human beings, limited and fleeting; it has much suffering, much misery. One should wisely understand this. One should do what is wholesome and lead the spiritual life; for none who are born can escape death.’ For today one who lives long lives for a hundred years or a little more. And when living for a hundred years, one lives just for three hundred seasons: a hundred winters, a hundred summers, and a hundred rains. When living for three hundred seasons, one lives just for twelve hundred months: four hundredwinter months, four hundred summer months, and four hundred months of the rains. When living for twelve hundred months, one lives just for twenty-four hundred fortnights: eight hundred fortnights of winter, eight hundred fortnights of summer, and eight hundred fortnights of the rains.",
    "an7.74:11": "These are the obstacles to meals: one who is angry[n.1602] Reading withCeand Eekupito, as against Bekapimiddho, \"monkey sleep.\"does not eat a meal, one in pain does not eat a meal, one who is ill does not eat a meal, one observing the uposatha does not eat a meal, and when not obtainingfoodone does not eat a meal."
}