{
    "an7.67:1": "\"Bhikkhus, when a king's frontier fortress is well provided with seven appurtenances of a fortress and readily gains, without trouble or difficulty, four kinds of food, it can be called a king's frontier fortress that cannot be assailed by external foes and enemies.",
    "an7.67:2": "\"What are the seven kinds of appurtenances of a fortress with which it is well provided?",
    "an7.67:3": "(2) \"Again, in the king's frontier fortress the moat is dug deep and wide. A king's frontier fortress is well provided with this second appurtenance for protecting its inhabitants and for warding off outsiders.",
    "an7.67:4": "(3) \"Again, in the king's frontier fortress the patrol path is high and wide. A king's frontier fortress is well provided with this third appurtenance for protecting its inhabitants and for warding off outsiders.",
    "an7.67:5": "(4) \"Again, in the king's frontier fortress many weapons are stored, both missiles and hand weapons.[n.180]Salākañceva jevanikañca.Mp:\"Salākaare weapons that can be released(nissaggiya), such as arrows and spears;jevanikaare the other types of weapons, such as one-edge swords.\" SED svśalyaka, gives \"arrow, dart, spear.\" PED definesjevanikaas \"a kind of (missile) weapon,\" but missiles, according toMp,are to be included undersalāka.A king's frontier fortress is well provided with this fourth appurtenance for protecting its inhabitants and for warding off outsiders.",
    "an7.67:6": "(5) \"Again, in the king's frontier fortress many kinds of troops reside, that is, elephant troops, cavalry, charioteers, archers, standard bearers, camp marshals, food servers,ugga-caste warriors, front-line commandoes, great-bull warriors, attack soldiers, shield-bearing soldiers, domestic-slave soldiers.[n.1581] My renderings of these terms, sometimes obscure in the original, are partly based on the explanations given inMp.Here are the explanations I follow for the terms that are not self-evident:Celakā(\"standard-bearers\"): those who, in the fighting, go in front carrying the standards of victory.Calakā(\"camp marshals\"): those who organize the military array thus: \"Let this be the king's place, this is the place for the chief minister,\" etc.Piṇḍadāyikā(\"food servers,\" lit., \"lump-givers\"): forceful great warriors. It is said that they enter the opponents’ army and fly about cutting them up as if into lumps(piṇḍapiṇḍamiva); having risen up, they come out; or else it is those who take food and drink to the warriors in the midst of the battle. (I have translated based on this second derivation, which seems more plausible.)Pakkhandhino(\"front-line commandoes\") are those who ask: \"Whose head or weapon shall we bring?\" and when told, \"His!\" they leap(pakkhandanti)into the midst of battle and bring it.Mahānāgā(\"great-bull warriors\") are warriors who cannot be turned back even when elephants, etc., are coming straight at them.Sūrā(\"attack-soldiers\") are one type of hero, who can cross the ocean even while wearing a coat of mail or carrying armor.Cammayodhino(\"shield-bearing soldiers\") are those who wear a coat of leather mail, or who carry a leather shield as protection against arrows.Dāsakaputtā(\"domestic-slave soldiers\"): deeply affectionate domestic-slave soldiers.Mpexplainsuggā rājaputtāas \"royal sons experienced in battle who have risen higher and higher\"(uggatuggatā saṅgāmāvacarā rājaputtā).Mpthus derives the word fromuggata, but SED says theugrawere \"a mixed tribe (from a Kshatriya father and a Śūdra mother).\" The word, according to SED, means \"powerful, violent, mighty … cruel, fierce.\"A king's frontier fortress is well provided with this fifth appurtenance for protecting its inhabitants and for warding off outsiders.",
    "an7.67:7": "(6) \"Again, in the king's frontier fortress the gatekeeper is wise, competent, and intelligent, one who keeps out strangers and admits acquaintances. A king's frontier fortress is well provided with this sixth appurtenance for protecting its inhabitants and for warding off outsiders.",
    "an7.67:8": "(7) \"Again, in the king's frontier fortress the ramPart 1s high and wide, covered over by a coat of plaster. A king's frontier fortress is well provided with this seventh appurtenance for protecting its inhabitants and for warding off outsiders.",
    "an7.67:9": "And what are the four kinds of food that it readily gains, without trouble or difficulty?",
    "an7.67:10": "(2) \"Again, in the king's frontier fortress much rice and barley are stored up for the delight, relief, and ease of its inhabitants and for warding off outsiders.",
    "an7.67:11": "(3) \"Again, in the king's frontier fortress many foodstuffs—sesame, green gram, and beans[n.1583]Tilamuggamāsāparaṇṇaṁ.Mpresolves thus:tilamuggamāsā ca sesāparaṇṇañca. FollowingMp,I takeaparaṇṇaas a general term of whichtila,mugga, andmāsaare instances. Hence I renderaparaṇṇasimply as \"foodstuffs.\" See Sp IV 784,31–33: \"Byaparaṇṇais meant green gram, beans, sesame,kulatthapulse, bitter gourd, pumpkin, and so forth\"(muggamāsatilakulatthālābukumbhaṇḍādibhedañca aparaṇṇaṁ adhippetaṁ).—are stored up for the delight, relief, and ease of its inhabitants and for warding off outsiders.",
    "an7.67:12": "(4) \"Again, in the king's frontier fortress many medicaments—ghee, butter, oil, honey, molasses, and salt—are stored up for the delight, relief, and ease of its inhabitants and for warding off outsiders.",
    "an7.67:13": "\"When, bhikkhus, a king's frontier fortress is well provided with these seven appurtenances of a fortress, and when it readily gains, without trouble or difficulty, these four kinds of food, it can be said that the king's frontier fortress cannot be assailed by external foes and enemies.",
    "an7.67:14": "(1) \"Just as, bhikkhus, the pillar in the king's frontier fortress has a deep base and is securely planted, immobile and unshakable, for the purpose of protecting its inhabitants and for warding off outsiders, so too the noble disciple is endowed with faith. He places faith in the enlightenment of the Tathāgata thus: ‘The Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’ With faith as his pillar, the noble disciple abandons the unwholesome and develops the wholesome, abandons what is blameworthy and develops what is blameless, and maintains himself in purity. He possesses this first good quality.",
    "an7.67:15": "(2) \"Just as the moat in the king's frontier fortress is dug deep and wide for the purpose of protecting its inhabitants and for warding off outsiders, so too a noble disciple has a sense of moral shame; he is ashamed of bodily, verbal, and mental misconduct; he is ashamed of acquiring bad unwholesome qualities. With a sense of moral shame as the moat, the noble disciple abandons the unwholesome and develops the wholesome, abandons what is blameworthy and develops what is blameless, and maintains himself in purity. He possesses this second good quality.",
    "an7.67:16": "(3) \"Just as the patrol path in the king's frontier fortress is high and wide for the purpose of protecting its inhabitants and for warding off outsiders, so too a noble disciple dreads wrongdoing; he dreads bodily, verbal, and mental misconduct; he dreads acquiring bad unwholesome qualities. With moral dread as the patrol path, the noble disciple abandons the unwholesome and developsthe wholesome, abandons what is blameworthy and develops what is blameless, and maintains himself in purity. He possesses this third good quality.",
    "an7.67:17": "(4) \"Just as many weapons, both missiles and hand weapons, are stored in the king's frontier fortress for the purpose of protecting its inhabitants and for warding off outsiders, so too a noble disciple has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally, mentally investigated, and penetrated well by view. With learning as his weaponry, the noble disciple abandons the unwholesome and develops the wholesome, abandons what is blameworthy and develops what is blameless, and maintains himself in purity. He possesses this fourth good quality.",
    "an7.67:18": "(5) \"Just as many kinds of troops reside in the king's frontier fortress, that is, elephant troops … domestic-slave soldiers, for protecting its inhabitants and for warding off outsiders, so too a noble disciple has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. With energy as his troops, the noble disciple abandons the unwholesome and develops the wholesome, abandons what is blameworthy and develops what is blameless, and maintains himself in purity. He possesses this fifth good quality.",
    "an7.67:19": "(6) \"Just as the gatekeeper in the king's frontier fortress is wise, competent, and intelligent, one who keeps out strangers and admits acquaintances, for protecting its inhabitants and for warding off outsiders,so too a noble disciple is mindful, possessing supreme mindfulness and alertness, one who remembers and recollects what was done and said long ago. With mindfulness as his gatekeeper, the noble disciple abandons the unwholesome and develops the wholesome, abandons what is blameworthy and develops what is blameless, and maintains himself in purity. He possesses this sixth good quality.",
    "an7.67:20": "(7) \"Just as the rampart in the king's frontier fortress is high and wide, covered over by a coat of plaster, for protecting its inhabitants and for warding off outsiders, so too a noble disciple is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering. With wisdom as his coat of plaster, the noble disciple abandons the unwholesome and develops the wholesome, abandons what is blameworthy and develops what is blameless, and maintains himself in purity. He possesses this seventh good quality.",
    "an7.67:21": "\"And what are the four jhānas that constitute the higher mind and are pleasant dwellings in this very life, which he gains at will, without trouble or difficulty?",
    "an7.67:22": "(2) \"Just asmuch rice and barley are stored up in the king's frontier fortress for the delight, relief, and comfort of its inhabitants and for warding off outsiders, so too, with the subsiding of thought and examination, a noble disciple enters and dwells in the second jhāna, which has internal placidity and unification of mind and consists of rapture and pleasure born of concentration, without thought and examination—for his own delight, relief, and comfort, and for entering upon nibbāna.",
    "an7.67:23": "(3) \"Just as many foodstuffs—sesame, green gram, and beans—are stored up in the king's frontier fortress for the delight, relief, and comfort of its inhabitants and for warding off outsiders, so too, with the fading away as well of rapture, a noble disciple dwells equanimous and, mindful and clearly comprehending, he experiences pleasure with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily’—for his own delight, relief, and comfort, and for entering upon nibbāna.",
    "an7.67:24": "(4) \"Just as many medicaments—ghee, butter, oil, honey, molasses, and salt—are stored up in the king's frontier fortress for the delight, relief, and comfort of its inhabitants and for warding off outsiders, so too, with the abandoning of pleasure and pain, and with the previous passing away of joy and dejection, a noble disciple enters and dwells in the fourth jhāna, neither painful nor pleasant, which has purification of mindfulness by equanimity—for his own delight, relief, and comfort, and for entering upon nibbāna.",
    "an7.67:25": "\"When, bhikkhus, a noble disciple possesses these seven good qualities, and when he gains at will, without trouble or difficulty, these four jhānas that constitute the higher mind and are pleasant dwellings in this very life, he is then called a noble disciple who cannot be assailed by Māra, who cannot be assailed by the Evil One.\""
}