{
    "an7.56:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha on Mount Vulture Peak. Then, when the night had advanced, two deities of stunning beauty, illuminating the entire VulturePeak, approached the Blessed One, paid homage to him, and stood to one side. One deity then said to the Blessed One: \"Bhante, these bhikkhunīs are liberated.\"",
    "an7.56:2": "Then, when the night had passed, the Blessed One addressed the bhikkhus: \"Last night, bhikkhus, when the night had advanced, two deities of stunning beauty, illuminating the entire Vulture Peak, approached me, paid homage to me, and stood to one side. One deity then said to me: ‘Bhante, these bhikkhunīs are liberated.’ And the other said: ‘Bhante, these bhikkhunīs are well liberated without residue remaining.’ This is what those deities said, after which they paid homage to me, circumambulated me keeping the right side toward me, and disappeared right there.\"",
    "an7.56:3": "Now on that occasion the Venerable Mahāmoggallāna was sitting not far from the Blessed One. Then it occurred to the Venerable Mahāmoggallāna: \"Which devas know one who has a residue remaining as ‘one with a residue remaining’ and one who has no residue remaining as ‘one without residue remaining’?\"",
    "an7.56:4": "Then, just as a strong man might extend his drawn-in arm or draw in his extended arm, the Venerable Mahāmoggallāna disappeared from Mount Vulture Peak and reappeared in that brahmā world. Having seen the Venerable Mahāmoggallāna coming in the distance, the brahmā Tissasaid to him:",
    "an7.56:5": "\"Do all the devas of Brahmā's company have such knowledge, Tissa?\"",
    "an7.56:6": "\"But those devas of Brahmā's company who are not content with a brahmā's life span, a brahmā's beauty, a brahmā's happiness, a brahmā's glory, a brahmā's authority, and whounderstand as it really is an escape higher than this, know one who has a residue remaining as ‘one with a residue remaining’ and one who has no residue remaining as ‘one without residue remaining.’[n.1541] Of the seven types mentioned in §§1–7, the first two, being arahants, have no residue of defilements; the other five, being trainees, have a residue of defilements.",
    "an7.56:7": "(1) \"Here, respected Moggallāna, when a bhikkhu is liberated in both respects, those devas know him thus: ‘This venerable one is liberated in both respects. As long as his body stands devas and humans will see him, but with the breakup of the body, devas and humans will see him no more.’ It is in this way that those devas know one who has a residue remaining as ‘one with a residue remaining’ and one who has no residue remaining as ‘one without residue remaining.’",
    "an7.56:8": "(2) \"Then, when a bhikkhu is liberated by wisdom, those devas know him thus: ‘This venerable one is liberated by wisdom. As long as his body stands devas and humans will see him, but with the breakup of the body devas and humans will see him no more.’ It is in this way, too, that those devas know one who has a residue remaining ….",
    "an7.56:9": "(3) \"Then, when a bhikkhu is a body witness, those devas know him thus: ‘This venerable one is a body witness. If this venerable one resorts to congenial lodgings, relies on good friends, and harmonizes the spiritual faculties, perhaps he will realize for himself with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness, and having entered upon it, dwell in it.’ It is in this way, too, that those devas know one who has a residue remaining ….",
    "an7.56:10": "(4) \"Then, when a bhikkhu is one attained to view … (5) one liberated by faith … (6) a Dhamma follower, those devas know him thus: ‘This venerable oneis a Dhamma follower. If this venerable one resorts to congenial lodgings, relies on good friends, and harmonizes the spiritual faculties, perhaps he will realize for himself with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness, and having entered upon it, dwell in it.’ It is in this way, too, that those devas know one who has a residue remaining as ‘one with a residue remaining’ and one who has no residue remaining as ‘one without residue remaining.’",
    "an7.56:11": "Then, having delighted and rejoiced in the words of the brahmā Tissa, just as a strong man might extend his drawn-in arm or draw in his extended arm, the Venerable Mahāmoggallāna disappeared from the brahmā world and reappeared on Vulture Peak. He approached the Blessed One, paid homage to him, sat down to one side, and reported to the Blessed One his entire conversation with the brahmā Tissa.",
    "an7.56:12": "The Blessed One said:\"But, Moggallāna, didn’t the brahmā Tissa teach you about the seventh person, the one who dwells in the markless?\"[n.1542] In the normal sevenfold classification of noble persons, the seventh person is the faith follower(saddhānusārī). Here, however, the seventh place is taken by theanimittavihārī, \"one who dwells in the markless.\"Mpsays that the Buddha is actually describing the faith follower as one who practices strong insight(balavavipassakavasena). It explains that \"all marks\" are all marks of permanence and so forth, and the markless mental concentration(animittaṁ cetosamādhiṁ)as the concentration of strong insight(balavavipassanāsamādhiṁ). Possibly Mp is attempting to rationalize a textual discrepancy, which might be indicative of a different understanding of the seventh noble person.",
    "an7.56:13": "(7) \"Here, Moggallāna, through non-attention to all marks, a bhikkhu enters and dwells in the markless mental concentration. Those devas know him thus: ‘Through non-attention to all marks, this venerable one enters and dwells in the markless mental concentration. If this venerable one resorts to congenial lodgings, relies on good friends, and harmonizes the spiritual faculties, perhaps he will realize for himself with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness,and having entered upon it, dwell in it.’ It is in this way, too, that those devas know one who has a residue remaining as ‘one with a residue remaining’ and one who has no residue remaining as ‘one without residue remaining.’\""
}