{
    "an7.61:1": "Thus have I heard. On one occasion the Blessed One was dwelling among the Bhaggas at Suṁsumāragira, in the deer park at Bhesakalā Grove. Now on that occasion the Venerable Mahāmoggallāna was sitting and dozing[n.548]Pacalāyamāno nisinno hoti. Just below,Mpglosses the Buddha’s question, \"Pacalāyasi no?\" with \"Niddāyasi nu\" (\"Are you falling asleep?\"). Mp: \"While depending on the village for alms, Moggallāna had been practicing meditation in the grove. For seven days he had energetically practiced walking meditation and the effort fatigued him. Thus he was dozing off (in the seat) at the end of the walkway.\"at Kallavālamuttagāma among the Magadhans. With the divine eye, which is purified and surpasses the human, the Blessed One saw the Venerable Mahāmoggallāna sitting and dozing. Then, just as a strong man might extend his drawn-in arm or draw in his extended arm, the Blessed One disappeared from the deer park at Bhesakalā Grove, and reappeared before the Venerable Mahāmoggallāna. The Blessed One sat down on the seat that was prepared for him and said:",
    "an7.61:2": "\"Are you dozing, Moggallāna? Are you dozing, Moggallāna?.",
    "an7.61:3": "(2) \"But if you cannot abandon your drowsiness in such a way, you should ponder, examine, and mentally inspect the Dhamma as you have heard it and learned it. By such means, it is possible that your drowsiness will be abandoned.",
    "an7.61:4": "(3) \"But if you cannot abandon your drowsiness in such a way, you should recite in detail the Dhamma as you have heard it and learned it. By such means, it is possible that your drowsiness will be abandoned.",
    "an7.61:5": "(4) \"But if you cannot abandon your drowsiness in such a way, you should pull both ears and rub your limbs with your hands. By such means, it is possible that your drowsiness will be abandoned.",
    "an7.61:6": "(5) \"But if you cannot abandon your drowsiness in such a way, you should get up from your seat, rub your eyes with water, survey all the quarters, and look up at the constellations and stars. By such means, it is possible that your drowsiness will be abandoned.",
    "an7.61:7": "(6) \"But if you cannot abandon your drowsiness in such a way, you should attend to the perception of light; you should undertake the perception of day thus: ‘As by day, so at night; as at night, so by day.’ Thus, with a mind that is open and uncovered, you should develop a mind imbued with luminosity. By such means, it is possible that your drowsiness will be abandoned.",
    "an7.61:8": "(7) \"But if you cannot abandon your drowsiness in such a way, you should undertakethe exercise ofwalking back and forth, perceiving what is behind you and what is in front, with your sense faculties drawn in and your mind collected. By such means, it is possible that your drowsiness will be abandoned.",
    "an7.61:9": "\"But if you cannot abandon your drowsiness in such a way, you should lie down on the right side in the lion's posture, with one foot overlapping the other, mindful and clearly comprehending, after noting in your mind the idea of rising. When you awaken, you should get up quickly,thinking: ‘I will not be intent on the pleasure of rest, the pleasure of sloth, the pleasure of sleep.’ It is in this way, Moggallāna, that you should train yourself.",
    "an7.61:10": "\"Therefore, Moggallāna, you should train yourself thus: ‘We will not approach familiesfor almswith a head swollen with pride.’ It is in this way, Moggallāna, that you should train yourself. It may be, Moggallāna, that a bhikkhu approaches families with a head swollen with pride. Now there are chores to be done in the families, and for this reason, when a bhikkhu turns up, people may not pay attention to him. In such a case the bhikkhu might think: ‘Who has turned this family against me? It seems these people have now become indifferent toward me.’ In this way, through lack of gain one feels humiliated; when feeling humiliated, one becomes restless; when one is restless, one loses one's restraint. The mind of one without restraint is far from concentration.",
    "an7.61:11": "\"Therefore, Moggallāna, you should train yourself thus: ‘We will not engage in contentious talk.’ It is in this way that you should train yourself. When there is contentious talk, an excess of words can be expected. When there is an excess of words, one becomes restless; when one is restless, one loses one's restraint. The mind of one without restraint is far from concentration.",
    "an7.61:12": "When this was said, the Venerable Mahāmoggallāna said to the Blessed One:[n.1549] The following exchange is also atMN37 verse 2-3, but with Sakka as the inquirer.Mpexplains the passage thus: \"Nothing(lit.,not all things)is worth holding to(sabbe dhammā nālaṁ abhinivesāya): here, ‘all things’(sabbe dhammā)are the five aggregates, the twelve sense bases, and the eighteen elements. These are not worth holding to by way of craving and views. Why not? Because they do not exist in the way they are held to. They are held to be permanent, pleasurable, and self, but they turn out to be impermanent, suffering, and non-self. Therefore they are not worth holding to. Onedirectly knows themby the full understanding of the known(ñātapariññāya abhijānāti)as impermanent, suffering, and non-self. Onefully understands themin the same way by the full understanding of scrutinization(tīraṇapariññāya parijānāti).\" The \"all things\" in my translation fromMprelates to the \"nothing\" of the sutta, since the Pāli phrase of the sutta is a negation ofsabbe dhammā(\"not all things\"). On the three kinds of full understanding(pariññā), see Vism 606,18–607,23, Ppn 20.3–6.\"Briefly, Bhante, how is a bhikkhu liberated in the extinction of craving, best among devas and humans: one who has reached the ultimate conclusion, won ultimate security from bondage, lived the ultimate spiritual life, and gained the ultimate consummation?\"",
    "an7.61:13": "\"Here, Moggallāna, a bhikkhu has heard: ‘Nothing is worth holding to.’ When a bhikkhu has heard: ‘Nothing is worth holding to,’ he directly knows all things. Having directly known all things, he fully understands all things. Having fully understood all things, whatever feeling he feels—whether pleasant, painful, or neither painful nor pleasant—he dwells contemplating impermanence in those feelings, contemplating fading away in those feelings, contemplating cessation in those feelings, contemplating relinquishment in those feelings. As he dwells contemplating impermanence … fading away … cessation … relinquishment in those feelings, he does not cling to anything in the world. Not clinging, he is not agitated. Being unagitated, he personally attains nibbāna. He understands: ‘Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.."
}