{
    "an7.62:1": "\"Bhikkhus, do not be afraid of merit. This is a designation for happiness,that is, merit.",
    "an7.62:2": "There I was Brahmā,[n.155]Cehas in bracketssattakkhattuṁ, \"seven times,\" not in Be or Ee. The addition may have been intended to make the prose match the verse.the Great Brahmā, the vanquisher, the unvanquished, the universal seer, the wielder of mastery. I was Sakka, ruler of the devas, thirty-six times. Many hundreds of times I was a wheel-turning monarch, a righteous king who ruled by the Dhamma, a conqueror whose rule extended to the four boundaries, one who had attained stability in his country, who possessed the seven gems. I had these seven gems, that is: the wheel-gem, the elephant-gem, the horse-gem, the jewel-gem, the woman-gem, the treasurer-gem, and the adviser-gem as the seventh. I had over a thousand sons who were heroes, vigorous, able to crush the armies of their enemies. I reigned after conquering this earth as far as its ocean boundaries, not by force and weapons but by the Dhamma.[n.1553] This is a stock description of a wheel-turning monarch. On the seven gems, seeMN 19.6–36, III 17–76.",
    "an7.62:3": "\"If one seeks happiness, look to the resultof merit,the result ofwholesome deeds.For seven years, I developed a loving mind,O bhikkhus, and for seven eonsof dissolution and evolution,I did not come back again to this world.",
    "an7.62:4": "\"When the world was dissolving,I fared on tothe realm ofstreaming radiance.When the world was evolving,I fared on to an empty Brahmāmansion.",
    "an7.62:5": "\"Seven times I was Great Brahmā,the wielder of mastery;thirty-six times I was ruler of the devas,exercising rulership over the devas.",
    "an7.62:6": "\"I was a wheel-turning monarch,the lord of Jambudīpa,[n.1554]EehasJambusaṇḍassa, CeJambudīpassa(perhaps a normalization), BeJambumaṇḍassa.Jambusaṇḍassais atSn 552=Th 822. I use the familiar name Jambudīpa, the \"Rose-Apple Island,\" the greater Indian subcontinent.a head-anointed khattiya,the sovereign among human beings.",
    "an7.62:7": "\"Without force, without weapons,I conquered this earth.I ruled it by righteousness,",
    "an7.62:8": "without violence, by Dhamma,[n.1555] I read withCeand Eeasāhasena dhammena, as against Beasāhasena kammena.exercising rulership by Dhammaover this sphere of the earth.\"I was born into a rich family,with abundant wealth and property,",
    "an7.62:9": "a familyendowed with all sense pleasures,and possessing the seven gems.This is well-taught by the Buddhas,",
    "an7.62:10": "the benefactors of the world:this is the cause of greatness by whichone is called a lord of the earth.[n.1556]Cepathavyo[Eepathabyo]yena vuccati. Be is less satisfactory:pathabyo me na vipajjati.\"I was[n.1557] I read withCeand Eehomihere and in the first line of the next verse. Be hashotiin both places.a king bright with splendor,",
    "an7.62:11": "one with abundant wealth and commodities.I was a lord of Jambudīpa,powerful and glorious.Who, even though of a low birth,would not place trust on hearing this?",
    "an7.62:12": "\"Therefore one desiring the good,aspiring for greatness,should deeply revere the good Dhamma,recollecting the Buddhas’ teaching.\"[n.1558] The verse is also inAN4.21."
}