{
    "an7.55:1": "\"Bhikkhus, I will teach you seven destinations of persons and attainment of nibbāna through non-clinging. Listen and attend closely. I will speak.\"",
    "an7.55:2": "(1) \"Here, a bhikkhu is practicing thus: ‘It might not be, and it might not be mine. It will not be; it will not be mine.[n.153]No c’assa no ca me siyā, na bhavissati na me bhavissati.This cryptic formula occurs in the Nikāyas in two versions. One is ascribed to the annihilationists; the other is the Buddha’s adaptation of it. The annihilationist version reads:no c’ assaṃ no ca me siyā, na bhavissāmi na me bhavissati,“I may not be, and it might not be mine. I will not be, and it will not be mine.” Since the two differ only with respect to two verbs—no c’assamvs.no c’assa,andna bhavissāmivs.na bhavissati—the various recensions sometimes confuse them. From the commentarial glosses, it appears that the confusion had already set in before the age of the commentaries. Readings also differ among different editions of the same text. Generally I prefer the readings inCe.This formula is explicitly identified as an annihilationist view(ucchedadiṭṭhi)atSN :81, III 99,4–6. In AN, at10:9§8, V 63,8–64,, it is said to be the foremost of outside speculative views(etadaggaṃ bāhirakānaṃ diṭṭhigatānaṃ).The Buddha transformed this formula into a theme for contemplation conformable to his own teaching by replacing the first-person verbs with their third-person counterparts. This change shifts the stress from the view of self implicit in the annihilationist version (“I will be annihilated”) to an impersonal perspective that harmonizes with the anattā doctrine. In some texts, for example atSN :55, III 55–58, practicing on the basis of the formula is said to culminate in the destruction of the five lower fetters, that is, in the stage of a non-returner. Sometimes, as in the present sutta, the formula includes a trailer (see below), contemplation of which is said to lead to equanimity. Practice guided by the full formula leads to one of the five levels of non-returner or to arahantship.In the Nikāyas the precise meaning of the formula is never made explicit, which suggests that it may have served as an open guide to contemplation to be filled in by the meditator through personal intuition. The commentaries, including Mp, take the truncated particlec’to representce,“if,” and interpret the two parts of the formula as conditionals. I translate here from Mp (in conformity with its own interpretation): “If it had not been: If, in the past, there had been no kamma producing individual existence; it would not be mine: now I would have no individual existence. There will not be: Now there will be no kamma producing a future individual existence for me; there will not be mine: in the future there will be no individual existence for me.”I dissent from the commentaries on the meaning ofc’,which I take to representca= “and.” The syntax of the phrase as a whole requires this. Skt parallels actually containca(for instance, Udānavarga 15:4, parallel toUd 7.8,¶4, has:no ca syān no ca me syā[n];andMĀ6 contains the character= “and”) in the appropriate places of the formula. As I interpret the meaning, the first “it” refers to the personal five aggregates, the second to the world apprehended through the aggregates. For the worldling this dyad is misconstrued as a duality of self and world; for the noble disciple it is simply the duality of internal and external phenomena. On this basis I would interpret the formula thus: “The five aggregates can be terminated, and the world presented by them can be terminated. I will so strive that the five aggregates will be terminated, (and thus) the world presented by them will be terminated.”The trailer reads in Pāli:yadatthi yaṁ bhūtaṁ taṁ pajahāmī ti upekkhaṁ paṭilabhati. FollowingMp,I understand \"what exists, what has come to be\"(yadatthi yaṁ bhūtaṁ)as the presently existing five aggregates. These have come to be through the craving of previous lives and are being abandoned by the abandonment of the cause for their re-arising in a future life, namely, craving or desire-and-lust.I am abandoning what exists, what has come to be.’ He obtains equanimity. He is not attached to existence; he is not attached to origination. He sees with correct wisdom: ‘There is a higher state that is peaceful,’[n.1533]Atth’uttariṁ padaṁ santaṁ sammappaññāya passati.Mp:\"He sees with path wisdom together with insight, ‘There is a higher peaceful state, nibbāna.’\"yet he has not totally realized that state. He has not totally abandoned the underlying tendency to conceit; he has not totally abandoned the underlying tendency to lust for existence; he has not totally abandoned ignorance.[n.1534] It is the continued presence of these three defilements that distinguishes the non-returner from the arahant, who has eliminated them.With the utter destruction of the five lower fetters he becomes an attainer of nibbāna in the interval.[n.1535] In accordance with the usual Theravāda commentarial position,Mpexplains theantarāparinibbāyīas one who attains nibbāna—the complete extinction of defilements—from the time immediately following rebirth up to the middle of the life span. This position seems contradicted by the similes to follow.",
    "an7.55:3": "(2) \"Then a bhikkhu is practicing thus: ‘It might not be, and it might not be mine. It will not be; it will not be mine. I am abandoning what exists, what has come to be.’ He obtains equanimity. He is not attached to existence; he is not attached to origination. He sees with correct wisdom: ‘There is a higher state that is peaceful,’ yet he has not totally realized that state. He has not totally abandoned the underlying tendency to conceit; he has not totally abandoned the underlying tendency to lust for existence; he has not totally abandoned ignorance. With the utter destruction of the five lower fetters he becomes an attainer of nibbāna in the interval.",
    "an7.55:4": "(3) \"Then a bhikkhu is practicing thus: ‘It might not be, and it might not be mine. It will not be; it will not be mine ….’ … With the utter destruction of the five lower fetters he becomes an attainer of nibbāna in the interval.",
    "an7.55:5": "(4) \"Then a bhikkhu is practicing thus: ‘It might not be, and it might not be mine. It will not be; it will not be mine ….’ … With the utter destruction of the five lower fetters he becomes an attainer of nibbāna upon landing.[n.137]Mpinterprets this person as one who attains nibbāna between the midpoint of the life span and its end. However, the wordupahacca, \"having struck, having hit,\" and the simile of the chip that goes out on hitting the ground, suggest that this type is one who attains nibbāna almost immediately after rebirth.",
    "an7.55:6": "(5) \"Then a bhikkhu is practicing thus: ‘It might not be, and it might not be mine. It will not be; it will not be mine ….’ … With the utter destruction of the five lower fetters he becomes an attainer of nibbāna without exertion.",
    "an7.55:7": "(6) \"Then a bhikkhu is practicing thus: ‘It might not be, and it might not be mine. It will not be; it will not be mine ….’ … With the utter destruction of the five lower fetters he becomes an attainer of nibbāna through exertion.",
    "an7.55:8": "(7) \"Then a bhikkhu is practicing thus: ‘It might not be, and it might not be mine. It will not be; it will not be mine. I am abandoning what exists, what has come to be.’ He obtains equanimity. He is not attached to existence; he is not attached to origination. He sees with correct wisdom: ‘There is a higher state that is peaceful,’ yet he has not totally realized that state. He has not totally abandoned the underlying tendency to conceit; he has not totally abandoned the underlying tendency to lust for existence; he has not totally abandoned ignorance. With the utter destruction of the five lower fetters he becomes one bound upstream, heading toward the Akaniṭṭha realm.[n.1539] SeeAN4.131, n. 2.",
    "an7.55:9": "\"And what, bhikkhus, is attainment of nibbāna through non-clinging? Here, a bhikkhu is practicing thus: ‘It might not be, and it might not be mine. It will not be; it will not be mine. I am abandoning what exists, what has come to be.’ He obtains equanimity. He is not attached to existence; he is not attached to origination. He sees with correct wisdom: ‘There is a higher state that is peaceful,’ and he has totally realized that state. He has totally abandoned the underlying tendency to conceit; he has totally abandoned the underlying tendency to lust for existence; he has totally abandoned ignorance. With the destruction of the taints, he has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. This is called attainment of nibbāna through non-clinging."
}