{
    "an7.73:1": "() \"Bhikkhus, in the past there was a teacher named Sunetta, the founder of a spiritual sect, one without lust for sensual pleasures.[n.599] As atAN6.54, where, however, the chain of past teachers ends at Jotipāla. See tooAN7.66, where Sunetta alone is mentioned.The teacher Sunetta had many hundreds of disciples to whom he taught a Dhamma for companionship with the brahmā world. When he was teaching such a Dhamma, those who did not place confidence in him were, with the breakup of the body, after death, reborn in the plane of misery, in a bad destination, in the lower world, in hell; but those who placed confidence in him were reborn in a good destination, in a heavenly world.",
    "an7.73:2": "\"In the past, bhikkhus, () there was a teacher named Mūgapakkha … (3) there was a teacher named Aranemi … (4) there was a teacher named Kuddāla … (5) there was a teacher named Hatthipāla … (6)there was a teacher named Jotipāla … (7) there was a teacher named Araka, the founder of a spiritual sect, one without lust for sensual pleasures. The teacher Araka had many hundreds of disciples to whom he taught a Dhamma for companionship with the brahmā world. When hewas teaching such a Dhamma, those who did not place confidence in him were, with the breakup of the body, after death, reborn in the plane of misery, in a bad destination, in the lower world, in hell; but those who placed confidence in him were reborn in a good destination, in a heavenly world.",
    "an7.73:3": "\"What do you think, bhikkhus? These seven teachers were founders of spiritual sects, men without lust for sensual pleasures who had retinues of many hundreds of disciples. If, with a mind of hatred, one had insulted and reviled them and their communities of disciples, wouldn’t one have generated much demerit?\"",
    "an7.73:4": "Therefore, bhikkhus, you should train yourselves thus: ‘We will not let hatred toward our fellow monks arise in our minds.’ Thus, bhikkhus, should you train yourselves.\""
}