{
    "an7.21:1": "ThusThus have I heard. On one occasion the Blessed One was dwelling at Vesālī at the Sārandada Shrine. Then a number of Licchavis approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One said this to them.",
    "an7.21:2": "\"And what, Licchavis, are the seven principles of non-decline?",
    "an7.21:3": "\"As long as the Vajjis assemble in harmony, adjourn in harmony, and conduct the affairs of the Vajjis in harmony, only growth is to be expected for them, not decline.",
    "an7.21:4": "\"As long as the Vajjis do not decree anything that has not been decreed or abolish anything that has already been decreed but undertake and follow the ancient Vajji principles as they have been decreed, only growth is to be expected for them, not decline.",
    "an7.21:5": "\"As long as the Vajjis honor, respect, esteem, and venerate the Vajji elders and think they should be heeded, only growth is to be expected for them, not decline.",
    "an7.21:6": "\"As long as the Vajjis do not abduct women and girls from their families and force them to live with them, only growth is to be expected for them, not decline.",
    "an7.21:7": "\"As long as the Vajjis honor, respect, esteem, and venerate their traditional shrines, both those withinthe city[n.145] I add \"the city\" on the basis ofMp'sgloss: \"situated inside the city\"(antonagare ṭhitāni).and those outside,and do not neglect the righteous oblations as given and done to them in the past,[n.146]Mp:\"When people neglect the righteous oblations, the deities do not protect them, and even if they cannot create new suffering, they intensify arisen suffering, such as coughs and headaches, etc.; and in time of war, the people have no allies. But when people don’t neglect the oblations, the deities protect them well, and even if they cannot create new happiness, they remove old illnesses; and when war breaks out, the people have allies.\"only growth is to be expected for them, not decline.",
    "an7.21:8": "\"As long as the Vajjis provide righteous protection, shelter, and guard for arahants,with the intention: ‘How can those arahants who have not yet come here come to our realm, and how can those arahants who have already come dwell at ease here?’ only growth is to be expected for them, not decline.",
    "an7.21:9": "\"Licchavis, as long as these seven principles of non-decline continue among the Vajjis, and the Vajjis are seenestablishedin them, only growth is to be expected for them, not decline.\""
}