{
    "an7.47:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the brahmin Uggatasarīra had made arrangements for a great sacrifice. Five hundred bulls had been led to the post[n.50]Mpsays thatthūṇais the sacrificial post itself:yūpasaṅkhātaṁ thūṇaṁ.for the sacrifice. Five hundred bullocks … Five hundred heifers … Five hundred goats … Five hundred rams had been led to the post for the sacrifice.",
    "an7.47:2": "\"I have heard, Master Gotama, that the kindling of the sacrificial fire and the raising of the sacrificial post are of great fruit and benefit.\"",
    "an7.47:3": "When this was said, the Venerable Ānanda said to the brahmin Uggatasarīra: \"Brahmin, Tathāgatas should not be asked thus: ‘I have heard, Master Gotama, that the kindling of the sacrificial fire and the raising of the sacrificial post are of great fruit and benefit.’ Tathāgatas should be asked: ‘Bhante, I want to kindle the sacrificial fire and raise the sacrificial post. Let the Blessed One exhort me and instruct me in a way that will lead to my welfare and happiness for a long time.’\"",
    "an7.47:4": "Then the brahmin Uggatasarīra said to the Blessed One: \"Master Gotama, I want to kindle the sacrificial fire and raise the sacrificial post. Let Master Gotama exhort me and instruct me in a way that will lead to my welfare and happiness for a long time.\"",
    "an7.47:5": "\"Brahmin, one kindling the sacrificial fire and raising the sacrificial post, even before the sacrifice, raises three knives that are unwholesome and have suffering as their outcome and result. What three? The bodily knife, the verbal knife, and the mental knife.",
    "an7.47:6": "\"Again, brahmin, one kindling the sacrificial fire and raising the sacrificial post, even before the sacrifice, utters such speech as this: ‘Let so many bulls be slain in sacrifice! Let so many bullocks … so many heifers … so many goats … so many rams be slain in sacrifice!’ Though hethinks, ‘Let me do merit,’ he does demerit. Though hethinks, ‘Let me do what is wholesome,’ he does what is unwholesome. Though hethinks, ‘Let me seek the path to a good destination,’ he seeks the path to a bad destination. One kindling the sacrificial fire and raising the sacrificial post, even before the sacrifice, raises this second knife, the verbal one, which is unwholesome and has suffering as its outcome and result.",
    "an7.47:7": "\"Again, brahmin, one kindling the sacrificial fire and raising the sacrificial post, even before the sacrifice, first undertakes the preparations to slay the bulls in sacrifice. He first undertakes the preparations to slay the bullocks in sacrifice … to slay the heifers in sacrifice … to slay the goats in sacrifice … to slay the rams in sacrifice. Though hethinks, ‘Let me do merit,’ he does demerit. Though hethinks, ‘Let me do what is wholesome,’ he does what is unwholesome. Though hethinks, ‘Let me seek the path to a good destination,’ he seeks the path to a bad destination. One kindling the sacrificial fire and raising the sacrificial post, even before the sacrifice, raises this third knife, the bodily one, which is unwholesome and has suffering as its outcome and result.",
    "an7.47:8": "(1) –(3) \"There are, brahmin, these three fires that should be abandoned and avoided and should not be cultivated. What three?The fire of lust, the fire of hatred, and the fire of delusion.",
    "an7.47:9": "(1) \"And why should the fire of lust be abandoned and avoided and not be cultivated? One excited by lust, overcome by lust, with mind obsessed by it, engages in misconduct by body, speech, and mind. As a consequence, with the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell. Therefore this fire of lust should be abandoned and avoided and should not be cultivated.",
    "an7.47:10-11": "(2) –(3) \"And why should the fire of hatred … the fire of delusion be abandoned and avoided and not be cultivated? One who is deluded, overcome by delusion, with mind obsessed by it, engages in misconduct by body, speech, and mind. As a consequence, with the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the lower world, in hell. Therefore this fire of delusion should be abandoned and avoided and should not be cultivated.",
    "an7.47:12": "(4) –(6) \"There are, brahmin, these three fires that should be properly and happily maintained, having honored, respected, esteemed, and venerated them. What three?The fire of those worthy of gifts, the householder's fire, and the fire of those worthy of offerings.",
    "an7.47:13": "(4) \"And what is the fire of those worthy of gifts? One's mother and father are called the fire of those worthy of gifts. For what reason? Because it is from them that one has originated and come to be.[n.1511] Ce and Beatohayaṁ(Eeato ‘yaṁ),brāhmaṇa, āhuto sambhūto.Mpglosses:atohayanti ato hi mātāpitito ayaṁāhutoti āgato. There seems to be a word play here betweenāhutaas representingābhūta, \"originated,\" and as past participle ofājuhati, \"offered, sacrificed.\" See DOP svāhuta1andāhuta2.Therefore, this fire of those worthy of gifts should be properly and happily maintained, having honored, respected, esteemed, and venerated it.",
    "an7.47:14": "(5) \"And what is the householder's fire? One's children, wife, slaves, servants, and workers are called the householder's fire. Therefore, this householder's fire should be properly and happily maintained, having honored, respected, esteemed, and venerated it.",
    "an7.47:15": "(6) \"And what is the fire of those worthy of offerings? Those ascetics and brahmins who refrain from intoxication and heedlessness, who are settled in patience and mildness, who tame themselves, calm themselves, and train themselves for nibbāna are called the fire of those worthy of offerings. Therefore, this fire of those worthy of offerings should be properly and happily maintained, having honored, respected, esteemed, and venerated it.",
    "an7.47:16": "(7) \"But, brahmin, this wood fire should at certain times be ignited, at certain times be looked upon with equanimity, at certain times be extinguished, and at certain times be put aside.\"",
    "an7.47:17": "When this was said, the brahmin Uggatasarīra said to the Blessed One: \"Excellent, Master Gotama! Excellent, Master Gotama! … Let Master Gotama consider me a lay follower who from todayhas gone for refuge for life. Master Gotama, I set free the five hundred bulls and allow them to live. I set free the five hundred bullocks and allow them to live. I set free the five hundred heifers and allow them to live. I set free the five hundred goats and allow them to live. I set free the five hundred rams and allow them to live. Let them eat green grass, drink cool water, and enjoy a cool breeze.\""
}