{
    "an7.69:1": "() \"Bhikkhus, when the foliage of the Tāvatiṁsa devas’pāricchattakacoral tree has turned yellow,[n.586]DPPNexplains that thepāricchattakais a tree growing in the Nandana Grove in the Tāvatiṁsa heaven. It is a hundred leagues in circumference and at its foot is Sakka's stone seat. Thepāricchattakais said to be one of seven trees that last throughout the eon. (I am grateful to Dr. Julie Plummer of the Department of Plant Biology, University of Western Australia, for providing precise botanical terms for the different stages of floral development referred to in this sutta.)the Tāvatiṁsa devas are elated,thinking: ‘The foliage of thepāricchattakacoral tree now has turned yellow. Now it won’t be long before its foliage will fall.’",
    "an7.69:2": "() \"When the foliage of the Tāvatiṁsa devas’pāricchattakacoral tree has fallen, the Tāvatiṁsa devas are elated,thinking: ‘The foliage of thepāricchattakacoral tree now has fallen. Now it won’t be long before its floral initiation occurs.’[n.1587]Na cirass’eva dāni jālakajāto bhavissati.Mp:\"The occasion when the tree gives birth to webs of leaves and flower, which come forth together.\"",
    "an7.69:3": "() \"When the Tāvatiṁsa devas’pāricchattakacoral tree has had its floral initiation, the Tāvatiṁsa devas are elated,thinking: ‘Thepāricchattakacoral tree now has had its floral initiation. Now it won’t be long before its floral differentiation occurs.’[n.1588]Na cirass’eva dāni khārakajāto bhavissati.Mp:\"The occasion when it becomes possessed of a web of leaves and of flowers well divided and growing separately.\"",
    "an7.69:4": "() \"When the Tāvatiṁsa devas’pāricchattakacoral tree has had its floral differentiation, the Tāvatiṁsa devas are elated,thinking: ‘Thepāricchattakacoral tree now has had its floral differentiation. Now it won’t be long before its bud formation occurs.’[n.1589]Ceand Ee:kuḍumalakajāto; Be:kuṭumalakajāto.Mp:\"It starts to bud.\"",
    "an7.69:5": "() \"When the Tāvatiṁsa devas’pāricchattakacoral tree has had its bud formation, the Tāvatiṁsa devas are elated,thinking: ‘Thepāricchattakacoral tree now has had its bud formation. Now it won’t be long beforeits bud burst occurs.’[n.190] Ce and Ee:kokāsakajāto; Be:korakajāto.Mp:\"It acquires flowers that have not yet blossomed, with closed mouths and large bellies.\"",
    "an7.69:6": "() \"When the Tāvatiṁsa devas’pāricchattakacoral tree has had its bud burst, the Tāvatiṁsa devas are elated,thinking: ‘Thepāricchattakacoral tree now has had its bud burst. Now it won’t be long before it fully blossoms.’[n.1591] Ce:sabbapāliphullo; Be and Ee:sabbaphāliphullo.Mp:\"It has flowered fully in all respects.\"",
    "an7.69:7": "() \"When the Tāvatiṁsa devas’pāricchattakacoral tree has fully blossomed, the Tāvatiṁsa devas are elated, and they spend four celestial months at the foot of thepāricchattakacoral tree enjoying themselves furnished and endowed with the five objects of sensual pleasure.",
    "an7.69:8": "When thepāricchattakacoral tree has fully blossomed, a radiance suffuses the area fiftyyojanasall around and a fragrance is carried along with the wind for a hundredyojanas. This is the majesty of thepāricchattakacoral tree.",
    "an7.69:9": "(1) \"So too, bhikkhus, when a noble disciple intends to go forth from the household life into homelessness, on that occasion he is one whose foliage has turned yellow, like the Tāvatiṁsa devas’pāricchattakacoral tree.[n.152] The simile does not merely compare the noble disciple to a coral tree at its different stages but uses the name of the stage to describe the noble disciple's development. He is \"a noble disciple at (such and such stage) like the Tāvatiṁsa devas’pāricchattakacoral tree.\"Eeomits thevaafterdevānaṁ, though it acknowledges this as a variant reading.",
    "an7.69:10": "(2) \"When a noble disciple has shaved off his hair and beard, put on ochre robes, and gone forth from the household life into homelessness, on that occasion he is one whose foliage has fallen, like the Tāvatiṁsa devas’pāricchattakacoral tree.",
    "an7.69:11": "(3) \"When, secluded from sensual pleasures, secluded from unwholesome states, a noble disciple enters and dwells in the first jhāna … on that occasion his floral initiation has occurred, like the Tāvatiṁsa devas’pāricchattakacoral tree.",
    "an7.69:12": "(4) \"When, with the subsiding of thought and examination, a noble disciple enters and dwells in the second jhāna … on that occasion his floral differentiation has occurred, like the Tāvatiṁsa devas’pāricchattakacoral tree.",
    "an7.69:13": "(5) \"When,with the fading away as well of rapture, a noble disciple … enters and dwells in the third jhāna … on that occasion his bud formation has occurred, like the Tāvatiṁsa devas’pāricchattakacoral tree.",
    "an7.69:14": "(6) \"When, with the abandoning of pleasure and pain, and with the previous passing away of joy and dejection, a noble disciple enters and dwells in the fourth jhāna … on that occasion his buds have burst open, like the Tāvatiṁsa devas’pāricchattakacoral tree.",
    "an7.69:15": "(7) \"When, with the destruction of the taints, a noble disciple has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwells in it, on that occasion he has fully blossomed, like the Tāvatiṁsa devas’pāricchattakacoral tree.",
    "an7.69:16": "\"On that occasion, bhikkhus, the earth-dwelling devas raise a cry: ‘This Venerable So-and-So, the pupil of that Venerable One, went forth from the household life into homelessness from such and such a village or town, and now, with the destruction of the taints, he has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwells in it.’ Having heard the cry of the earth-dwelling devas, the devasruled bythe four great kings raise a cry …. Having heard the cry of the devasruled bythe four great kings, the Tāvatiṁsa devas … the Yāma devas … the Tusita devas … the devas who delight in creation … the devas who control what is created by others … the devas of Brahmā's company raise a cry: ‘This Venerable So-and-So … has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, dwells in it.’ Thusat that moment, at that instant, at that second, the cry spreads as far as the brahma world.[n.1593] In a similar way, the cry of the deities, ascending through the celestial realms, occurs at the conclusion of the Buddha’s first discourse. See SN56:11, V 423,17–24,4.This is the spiritual majesty of a bhikkhu whose taints are destroyed.\""
}