{
    "an7.66:1": "On one occasion[n.572]Beand Ee open withevaṁ me sutaṁ.the Blessed One was dwelling at Vesālī in Ambapālī's Grove. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an7.66:2": "\"Bhikkhus, conditioned phenomena are impermanent; conditioned phenomena are unstable; conditioned phenomena are unreliable. It is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate toward them, enough to be liberated from them.",
    "an7.66:3": "\"Bhikkhus, Sineru, the king of mountains, is 84,000yojanasin length and 84,000yojanasin width; it is submerged 84,000yojanasin the great ocean and rises up 84,000yojanasabove the great ocean.[n.157] Theyojanais between seven and nine miles in length.",
    "an7.66:4": "(2) \"There comes a time when, after a long time, a second sun appears. With the appearance of the second sun, the small rivers and lakes dry up and evaporate and no longerexist. So impermanent are conditioned phenomena …. It is enough to be liberated from them.",
    "an7.66:5": "(3) \"There comes a time when, after a long time, a third sun appears. With the appearance of the third sun, the great rivers—the Ganges, the Yamunā, the Aciravatī, the Sarabhū, and the Mahī—dry up and evaporate and no longer exist. So impermanent are conditioned phenomena …. It is enough to be liberated from them.",
    "an7.66:6": "(4) \"There comes a time when, after a long time, a fourth sun appears. With the appearance of the fourth sun, the great lakes from which those great rivers originate—Anotatta, Sīhapapāta, Rathakāra, Kaṇṇamuṇḍa, Kuṇāla, Chaddanta, and Mandākinī—dry up and evaporate and no longer exist. So impermanent are conditioned phenomena …. It is enough to be liberated from them.",
    "an7.66:7": "(5) \"There comes a time when, after a long time, a fifth sun appears. With the appearance of the fifth sun, the waters in the great ocean sink by a hundredyojanas, two hundredyojanas… three hundredyojanas… seven hundredyojanas. The water left in the great ocean stands at the height of seven palm trees, at the height of six palm trees … five palm trees … four palm trees … three palm trees … two palm trees… a mere palm tree. The water left in the great ocean stands at the height of seven fathoms … six fathoms … five fathoms … four fathoms … three fathoms … two fathoms … a fathom … half a fathom … up to the waist … up to the knees … up to the ankles. Just as, in the autumn, when thick drops of rain are pouring down, the waters stand in the hoof prints of cattle here and there, so the waters left in the great ocean will stand here and there (in pools) the size of the hoof prints of cattle. With the appearance of the fifth sun, the water left in the great ocean is not enough even to reach the joints of one's fingers. So impermanent are conditioned phenomena …. It is enough to be liberated from them.",
    "an7.66:8": "(6) \"There comes a time when, after a long time, a sixth sun appears. With the appearance of the sixth sun, this great earth and Sineru, the king of mountains, smoke, fume, and smolder. Just as a potter's fire, when kindled, first smokes, fumes, and smolders, so with the appearance of the sixth sun, this great earth and Sineru, the king of mountains, smoke, fume, and smolder. So impermanent are conditioned phenomena …. It is enough to be liberated from them.",
    "an7.66:9": "(7) \"There comes a time when, after a long time, a seventh sun appears.With the appearance of the seventh sun, this great earth and Sineru, the king of mountains, burst into flames, blaze up brightly, and become one mass of flame. As the great earth and Sineru are blazing and burning, the flame, cast up by the wind, rises even to the brahmā world. As Sineru is blazing and burning, as it is undergoing destruction and being overcome by a great mass of heat, mountain peaks of a hundredyojanasdisintegrate; mountain peaks of two hundredyojanas… three hundredyojanas… four hundredyojanas… five hundredyojanasdisintegrate.",
    "an7.66:10": "\"Bhikkhus, who except those who have seen the truth[n.1574]Aññatra diṭṭhapadehi.Mp:\"Who will believe this, except the noble disciples, stream-enterers who have seen the truth?\" The truth, or state(pada), seen by the stream-enterer is nibbāna, the cessation of suffering.would think or believe:[n.1575]Ko mantā ko saddhātā.MpCeglosses: \"Who is able to discuss this for the sake of generating faith in this, or who has faith in this?\"(ko tassa saddhāpanatthāya mantetuṁ samattho, ko vā tassa saddhātā).Saddhātāis nominative singular of the agent nounsaddhātar. Somantā, which is parallel to it, must be an agent noun frommantar, \"a thinker.\" The Chinese parallel, MĀ 8, has nothing corresponding to Pālimantā. I translate from T I 429b7–11: \"I now tell you, Sineru, the king of mountains, will collapse and be destroyed. Who can believe this, but those who have seen the truth? I now tell you, the waters of the great oceans will dry up and evaporate. Who can believe this, but those who have seen the truth? I now tell you, the great earth will entirely burn up and be destroyed by fire. Who can believe this, but those who have seen the truth?\"‘This great earth and Sineru, the king of mountains, will burn up, be destroyed, and will no longer exist’?",
    "an7.66:11": "\"In the past, bhikkhus, there was a teacher named Sunetta, the founder of a spiritual sect, one without lust for sensual pleasures.[n.1576] He is also mentioned atAN6.54, III 371,16–27.The teacher Sunettahad many hundreds of disciples to whom he taught a Dhamma for companionship with the brahmā world. When he was teaching, those who understood his teaching completely were, with the breakup of the body, after death, reborn in a good destination, in the brahmā world. But of those who did not understand his teaching completely, some were reborn in companionship with the devas who control what is created by others;[n.1577] With this begins the six planes of sense-sphere heavens, from the highest down to the lowest.some in companionship with the devas who delight in creation; some in companionship with the Tusita devas; some in companionship with the Yāma devas; some in companionship with the Tāvatiṁsa devas; some in companionship with the devas (ruled by) the four great kings. Some were reborn in companionship with affluent khattiyas; some in companionship with affluent brahmins; some in companionship with affluent householders.",
    "an7.66:12": "\"Then, bhikkhus, it occurred to the teacher Sunetta: ‘It isn’t fitting that I should have exactly the same future destination as my disciples. Let me develop loving-kindness further.",
    "an7.66:13": "Then for seven years the teacher Sunetta developed a mind of loving-kindness. As a consequence, for seven eons of world-dissolution and evolution he did not come back to this world. When the world was dissolving,he moved on to the (realm of) streaming radiance. When the world was evolving, he was reborn in an empty mansion of Brahmā.[n.1578] The Buddha relates this of himself with reference to his own past lives atAN7.62.",
    "an7.66:14": "For what reason? Because he did not understand and penetrate four things. What four? Noble virtuous behavior, noble concentration, noble wisdom, and noble liberation.",
    "an7.66:15": "\"Virtuous behavior, concentration, wisdom,and unsurpassed liberation:these things the illustrious Gotamaunderstood by himself.",
    "an7.66:16": "\"Having directly known these things,the Buddha taught the Dhamma to the bhikkhus.The Teacher, the end-maker of suffering,the One with Vision, has attained nibbāna.\""
}