{
    "an7.6:1": "\"Bhikkhus, there are these seven kinds of wealth. What seven? The wealth of faith, the wealth of virtuous behavior, the wealth of moral shame, the wealth of moral dread, the wealth of learning, the wealth of generosity, and the wealth of wisdom.",
    "an7.6:2": "(1) \"And what, bhikkhus, is the wealth of faith? Here, a noble disciple is endowed with faith. He places faith in the enlightenment of the Tathāgata thus: ‘The Blessed One is an arahant … the Enlightened One, the Blessed One.’ This is called the wealth of faith.",
    "an7.6:3": "(2) \"And what is the wealth of virtuous behavior? Here, a noble disciple abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from liquor, wine, and intoxicants, the basis for heedlessness. This is called the wealth of virtuous behavior.",
    "an7.6:4": "(3) \"And what is the wealth of moral shame? Here, a noble disciple has a sense of moral shame; he is ashamed of bodily, verbal, and mental misconduct; he is ashamed of acquiring bad, unwholesome qualities. This is called the wealth of moral shame.",
    "an7.6:5": "(4) \"And what is the wealth of moral dread? Here, a noble disciple dreads wrongdoing; he dreads bodily, verbal, and mental misconduct; he dreads acquiring bad, unwholesome qualities. This is called the wealth of moral dread.",
    "an7.6:6": "(5) \"And what is the wealth of learning?Here, a noble disciple has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally, mentally investigated, and penetrated well by view. This is called the wealth of learning.",
    "an7.6:7": "(6) \"And what is the wealth of generosity? Here, a noble disciple dwells at home with a heart devoid of the stain of miserliness, freely generous, openhanded, delighting in relinquishment, one devoted to charity, delighting in giving and sharing. This is called the wealth of generosity.",
    "an7.6:8": "(7) \"And what is the wealth of wisdom? Here, a noble disciple is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering. This is called the wealth of wisdom.",
    "an7.6:9": "\"These, bhikkhus, are the seven kinds of wealth.\"",
    "an7.6:10": "The wealth of faith, the wealth of virtuous behavior,the wealth of moral shame and moral dread,the wealth of learning and generosity,with wisdom, the seventh kind of wealth:",
    "an7.6:11": "when one has these seven kinds of wealth,whether a woman or a man,they say that one is not poor,that one's life is not lived in vain.",
    "an7.6:12": "Therefore an intelligent person,remembering the Buddhas’ teaching,should be intent on faith and virtuous behavior,confidence and vision of the Dhamma."
}