{
    "an7.4:1": "\"Bhikkhus, there are these seven powers. What seven? The power of faith, the power of energy, the power of moral shame, the power of moral dread, the power of mindfulness, the power of concentration, and the power of wisdom.",
    "an7.4:2": "(1) \"And what, bhikkhus, is the power of faith? Here, a noble disciple is endowed with faith. He places faith in the enlightenment of the Tathāgata thus: ‘The Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’ This is called the power of faith.",
    "an7.4:3": "(2) \"And what is the power of energy? Here, a noble disciple has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. This is called the power of energy.",
    "an7.4:4": "(3) \"And what is the power of moral shame? Here, a noble disciple has a sense of moral shame; he is ashamed of bodily, verbal, and mental misconduct; he is ashamedof acquiring bad, unwholesome qualities. This is called the power of moral shame.",
    "an7.4:5": "(4) \"And what is the power of moral dread? Here, a noble disciple dreads wrongdoing; he dreads bodily, verbal, and mental misconduct; he dreads acquiring bad, unwholesome qualities. This is called the power of moral dread.",
    "an7.4:6": "(5) \"And what is the power of mindfulness? Here, a noble disciple is mindful, possessing supreme mindfulness and alertness, one who remembers and recollects what was done and said long ago. This is called the power of mindfulness.",
    "an7.4:7": "(6) \"And what is the power of concentration? Here, secluded from sensual pleasures, secluded from unwholesome states, a noble disciple enters and dwells in the first jhāna … the fourth jhāna. This is called the power of concentration.",
    "an7.4:8": "(7) \"And what is the power of wisdom? Here, a noble disciple is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering. This is called the power of wisdom.",
    "an7.4:9": "\"These, bhikkhus, are the seven powers.\"",
    "an7.4:10": "The power of faith, the power of energy,the powers of moral shame and moral dread;the powers of mindfulness and concentration,and wisdom, the seventh power;a powerful bhikkhu possessing theseis wise and lives happily.",
    "an7.4:11": "He should carefully examine the Dhammaand deeply see the meaning with wisdom.Like the extinguishing of a lampis the emancipation of the mind."
}