{
    "an7.51:1": "\"Bhikkhus, I will teach you a Dhamma exposition on union and disengagement.[n.56]Saṁyogavisaṁyogaṁ dhammapariyāyaṁ. The title might also have been rendered \"connection and disconnection.\"Listen ….",
    "an7.51:2": "\"A woman, bhikkhus, attends internally to her feminine faculty, her feminine comportment, her feminine appearance, her feminine aspect, her feminine desire, her feminine voice, her feminine ornamentation.[n.1517] In Pāli:itthikuttaṁ,itthākappaṁ,itthividhaṁ,itthicchandaṁ,itthissaraṁ,itthālaṅkāraṁ. Apparently it is these seven terms, and their masculine counterparts (withpurisain place ofitthi), that explain the inclusion of this sutta in the Sevens. I translate on the basis of the glosses offered by Mp.She becomes excited by these and takes delight in them. Excited by them, taking delight in them, she attends externally toa man'smasculine faculty, his masculine comportment, his masculine appearance, his masculine aspect, his masculine desire, his masculine voice, his masculine ornamentation. She becomes excited by these and takes delight in them. Excited by them, taking delight in them, she desires union externally, and she also desires the pleasure and joy that arise on account of such union. Beings who are delighted with their femininity enter upon union with men. It is in this way that a woman does not transcend her femininity.",
    "an7.51:3": "\"A man, bhikkhus, attends internally to his masculine faculty, his masculine comportment, his masculine appearance, his masculine aspect, his masculine desire, his masculine voice, his masculine ornamentation. He becomes excited by these and takes delight in them. Excited by them, taking delight in them, he attends externally toa woman'sfeminine faculty, her feminine comportment, her feminine appearance, her feminine aspect, her feminine desire, her feminine voice, her feminine ornamentation. He becomes excited by these and takes delight in them. Excited by them, taking delight in them, he desires union externally, and he also desires the pleasure and joy that arise on account of such union. Beings who are delighted with their masculinity enter upon union with women.It is in this way that a man does not transcend his masculinity. This is how union comes about.",
    "an7.51:4": "And how does disengagement come about?",
    "an7.51:5": "\"A man, bhikkhus, does not attend internally to his masculine faculty … his masculine ornamentation. He does not become excited by these or take delight in them. Not excited by them, not taking delight in them, he does not attend externally toa woman'sfeminine faculty … her feminine ornamentation. He does not become excited by these or take delight in them. Not excited by them, not taking delight in them, he does not desire union externally, nor does he desire the pleasure and joy that arise on account of such union. Beings who are not delighted with their masculinity become disengaged from women. It is in this waythat a man transcends his masculinity."
}