{
    "an7.52:1": "On one occasion the Blessed One was dwelling at Campā on a bank of the Gaggārā Lotus Pond. Then a number of lay followers from Campā approached the Venerable Sāriputta, paid homage to him, sat down to one side, and said to him:",
    "an7.52:2": "Then, on the uposatha day, those lay followers from Campā approached the Venerable Sāriputta, paid homage to him, and stood to one side. Then the Venerable Sāriputta, along with those lay followers, went to the Blessed One. They paid homage to the Blessed One, sat down to one side, and the Venerable Sāriputta said to him:",
    "an7.52:3": "\"Could it be the case, Bhante, that a gift given by someone here is not of great fruit and benefit? And could it be the case that a gift given by someone here is of great fruit and benefit?\"",
    "an7.52:4": "(1) \"Here, Sāriputta, someone gives a gift with expectations, with a bound mind, looking for rewards; he gives a gift, (thinking): ‘Having passed away, I will make use of this.’ He gives that gift to an ascetic or a brahmin: food and drink; clothing and vehicles; garlands, scents, and unguents; bedding, dwellings, and lighting. What do you think, Sāriputta? Might someone give such a gift?\"",
    "an7.52:5": "\"In that case, Sāriputta, he gives a gift with expectations, with a bound mind, looking for rewards; he gives a gift,thinking: ‘Having passed away, I will make use of this.’ Having given such a gift, with the breakup of the body, after death, he is reborn in companionship with the devasruled bythe four great kings.Having exhausted that kamma, psychic potency, glory, and authority, he comes back and returns to this state of being.",
    "an7.52:6": "(2) \"But, Sāriputta, someone does not give a gift with expectations, with a bound mind, looking for rewards; he does not give a gift,thinking: ‘Having passed away, I will make use of this.’ Rather, he gives a gift,thinking: ‘Giving is good.’ …",
    "an7.52:7": "(3) \"He does not give a gift,thinking: ‘Giving is good,’ but rather he gives a gift,thinking: ‘Giving was practiced before by my father and forefathers; I should not abandon this ancient family custom.’ …",
    "an7.52:8": "(4) \"He does not give a gift,thinking: ‘Giving was practiced before … I should not abandon this ancient family custom,’ but rather he gives a gift,thinking: ‘I cook; these people do not cook. It isn’t right that I who cook should not give to those who do not cook.’ …",
    "an7.52:9": "(5) \"He does not give a gift,thinking: ‘I cook … to those who do not cook,’ but rather he gives a gift,thinking: ‘Just as the seers of old—that is, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Angīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, and Bhagu—held those great sacrifices, so I will share a gift.’ …[n.1518] These are the ancient brahmin rishis who were supposedly the composers of the Vedic hymns. They are mentioned in this capacity atAN5.12, III 224,5–6, and 22,28–230,1, and atDN  I 238,21–23, and MN II 16,2–31.",
    "an7.52:10": "(6) \"He does not give a gift,thinking: ‘Just as the seers of old … held those great sacrifices, so I willshare a gift,’ but rather he gives a gift,thinking: ‘When I am giving a gift my mind becomes placid, and elation and joy arise.’ …",
    "an7.52:11": "(7) \"He does not give a gift,thinking: ‘When I am giving a gift my mind becomes placid, and elation and joy arise,’ but rather he gives a gift,thinking: ‘It's an ornament of the mind, an accessory of the mind.’[n.1519] The three editions have slightly different readings. I follow Cecittālaṅkāraṁ cittaparikkhāranti. Neither Be nor Ee have the quotation markerti.Mp:\"It is an ornament, an accessory, of the mind pertaining to serenity and insight\"(samathavipassanācittassa).He gives that gift to an ascetic or a brahmin: food and drink; clothing and vehicles; garlands, scents, and unguents; bedding, dwellings, and lighting. What do you think, Sāriputta? Might someone give such a gift?\"",
    "an7.52:12": "\"In that case, Sāriputta, he does not give a gift with expectations, with a bound mind, looking for rewards; he does not give a gift,thinking: ‘Having passed away, I will make use of this.’ He does not give a gift,thinking: ‘Giving is good.’ He does not give a gift,thinking: ‘Giving was practiced before by my father and forefathers; I should not abandon this ancient family custom.’ He does not give a gift,thinking: ‘I cook; these people do not cook. It isn’t right that I who cook should not give to those who do not cook.’ He does not give a gift,thinking: ‘Just as the seers of old … held those great sacrifices, so I will share a gift.’ He does not give a gift,thinking: ‘When I am giving a gift my mind becomes placid, and elation and joy arise.’ But rather, he gives a gift,thinking: ‘It's an ornament of the mind, an accessory of the mind.’ Having given such a gift, with the breakup of the body, after death, he is reborn in companionship with the devas of Brahmā's company.Having exhausted that kamma, psychic potency, glory, and authority, he does not come back and return to this state of being.",
    "an7.52:13": "\"This, Sāriputta, is the reason why a gift given by someone here is not of great fruit and benefit. And this is the reason why a gift given by someone here is of great fruit and benefit.\""
}