{
    "an7.70:1": "Then, when the Venerable Sāriputta was alone in seclusion, the following course of thought arose in his mind: \"What should a bhikkhu honor, respect, and dwell in dependence on so that he might abandon the unwholesome and develop the wholesome?\"",
    "an7.70:2": "Then it occurred to the Venerable Sāriputta: \"These qualities have been purified and cleansed in me. Let me go to the Blessed One and report them to him. Thus these qualities will be purified in me and will be more widely known as purified.[n.1594] WithBeand Ee, I readparisuddhasaṅkhātatarā, as against Ceparisuddhasaṅkhatatarā.Mpglosses \"they will be purified and stainless to an even greater degree\"(bhiyyosomattāya parisuddhā bhavissanti nimmalā), which I don’t think quite captures the meaning of-saṅkhātatarā. The word can mean \"known as, appearing to be, declared to be,\" and this is the sense that seems relevant here.Suppose a man would find a gold nugget, purified and cleansed. It might occur to him: ‘This golden nugget of mine is purified and cleansed. Let me go and show it to the goldsmiths. Then, when this golden nugget of mine has been shown to the goldsmiths, it will be purified and will be more widely known as purified.’ So too these qualities have been purified and cleansed in me. Let me go to the Blessed One and report them to him. Thus these qualities will be purified in me and will be more widely known as purified.\"",
    "an7.70:3": "Then,in the evening, the Venerable Sāriputta emerged from seclusion and approached the Blessed One. He paid homage to the Blessed One, sat down to one side, and said:",
    "an7.70:4": "\"Here, Bhante, when I was alone in seclusion, the following course of thought arose in my mind …He here relates the entire course of thought stated above, down to:… Thus these qualities will be purified in meand will be more widely known as purified.\"",
    "an7.70:5": "\"Good, good, Sāriputta! A bhikkhu should honor, respect, and dwell in dependence on the Teacher so that he might abandon the unwholesome and develop the wholesome. He should honor, respect, and dwell in dependence on the Dhamma … the Saṅgha … the training … concentration … heedfulness … hospitality so that he might abandon the unwholesome and develop the wholesome.\"",
    "an7.70:6": "When this was said, the Venerable Sāriputta said to the Blessed One: \"Bhante, I understand in detail thus the meaning of this statement that the Blessed One has spoken in brief.",
    "an7.70:7": "\"It is impossible, Bhante, that a bhikkhu who lacks reverence for the Teacher and the Dhamma could have reverence for the Saṅgha. The bhikkhu who lacks reverence for the Teacher and the Dhamma (3) also lacks reverence for the Saṅgha.",
    "an7.70:8": "\"It is impossible, Bhante, that a bhikkhu who lacks reverence for the Teacher, the Dhamma, and the Saṅgha could have reverence for the training. The bhikkhu who lacks reverence for the Teacher, the Dhamma, and the Saṅgha (4) also lacks reverence for the training.",
    "an7.70:9": "\"It is impossible, Bhante, that a bhikkhu who lacks reverence for the Teacher, the Dhamma, and the Saṅgha, and the training could have reverence for concentration. The bhikkhu who lacks reverence for the Teacher, the Dhamma, and the Saṅgha, and the training (5) also lacks reverence for concentration.",
    "an7.70:10": "\"It is impossible, Bhante, that a bhikkhu who lacks reverence for the Teacher, the Dhamma, and the Saṅgha, the training, and concentration could have reverence for heedfulness. The bhikkhu who lacks reverence for the Teacher, the Dhamma, and the Saṅgha, the training, and concentration(6) also lacks reverence for heedfulness.",
    "an7.70:11": "\"It is impossible, Bhante, that a bhikkhu who lacks reverence for the Teacher, the Dhamma, and the Saṅgha, the training, concentration, and heedfulness could have reverence for hospitality. The bhikkhu who lacks reverence for the Teacher, the Dhamma, and the Saṅgha, the training, concentration, and heedfulness (7) also lacks reverence for hospitality.",
    "an7.70:12-14": "\"It is impossible, Bhante, that a bhikkhu who has reverence for the Teacher could lack reverence for the Dhamma. The bhikkhu who (1) has reverence for the Teacher (2) also has reverence for the Dhamma.",
    "an7.70:15": "\"It is impossible, Bhante, that a bhikkhu who has reverence for the Teacher, the Dhamma, and the Saṅgha, the training, concentration, and heedfulness could lack reverence for hospitality. The bhikkhu who has reverence for the Teacher, the Dhamma, and the Saṅgha, the training, concentration, and heedfulness (7) also has reverence for hospitality.",
    "an7.70:16": "\"It is in such a way, Bhante, that I understand in detail the meaning of this statement that the Blessed One has spoken in brief.\"",
    "an7.70:17-22": "\"Good, good, Sāriputta! It is good that you understand in detail the meaning of this statement that I have spoken in brief in such a way. Indeed, Sāriputta, it is impossible that a bhikkhu who lacks reverence for the Teacher could have reverence for the Dhamma ….The Buddha here repeats the entire elaboration by Sāriputta.… The bhikkhu who has reverence for the Teacher, the Dhamma, and the Saṅgha, the training, concentration, and heedfulness also has reverence for hospitality.",
    "an7.70:23": "\"It is in such a way, Sāriputta, that the meaning of this statement that I spoke in brief should be understood in detail.\""
}