{
    "an8.76:1": "\"Bhikkhus, there are these eight accomplishments. What eight?[n.795] The eight accomplishments(sampadā)and their definitions are as inAN8.54, but without the section on the four dissipations of wealth.Accomplishment in initiative, accomplishment in protection, good friendship, balanced living, accomplishment in faith, accomplishment in virtuous behavior, accomplishment in generosity, and accomplishment in wisdom.",
    "an8.76:2": "() \"And what is accomplishment in protection? Here, a clansman sets up protection and guard over the wealth he has acquired by initiative and energy, amassed by the strength of his arms, earned by the sweat of his brow, righteous wealth righteously gained, thinking:‘How can I prevent kings and thieves from taking it, fire from burning it, floods from sweeping it off, and displeasing heirs from taking it?’ This is called accomplishment in protection.",
    "an8.76:3": "() \"And what is good friendship? Here, in whatever village or town a clansman lives, he associates with householders or their sons—whether young but of mature virtue, or old and of mature virtue—who are accomplished in faith, virtuous behavior, generosity, and wisdom; he converses with them and engages in discussions with them. Insofar as they are accomplished in faith, he emulates them with respect to their accomplishment in faith; insofar as they are accomplished in virtuous behavior, he emulates them with respect to their accomplishment in virtuous behavior; insofar as they are accomplished in generosity, he emulates them with respect to their accomplishment in generosity; insofar as they are accomplished in wisdom, he emulates them with respect to their accomplishment in wisdom. This is called good friendship.",
    "an8.76:4": "() \"And what is balanced living? Here, a clansman knows his income and expenditures and leads a balanced life, neither too extravagant nor too frugal, (aware): ‘In this way my income will exceed my expenditures rather than the reverse.’ Just as an appraiser or his apprentice, holding up a scale, knows:‘By so much it has dipped down,by so much it has gone up,’ so a clansman knows his income and expenditures and leads a balanced life, neither too extravagant nor too frugal, (aware): ‘In this way my income will exceed my expenditures rather than the reverse.’",
    "an8.76:5": "() \"And what is accomplishment in faith? Here, a clansman is endowed with faith. He places faith in the enlightenment of the Tathāgata thus:‘The Blessed One is an arahant … teacher of devas and humans, the Enlightened One, the Blessed One.’ This is called accomplishment in faith.",
    "an8.76:6": "() \"And what is accomplishment in virtuous behavior? Here, a clansman abstains from the destruction of life, from taking what is not given, from sexual misconduct, from false speech, and from liquor, wine, and intoxicants, the basis for heedlessness. This is called accomplishment in virtuous behavior.",
    "an8.76:7": "() \"And what is accomplishment in generosity? Here, a clansman dwells at home with a heart devoid of the stain of miserliness, freely generous, openhanded, delighting in relinquishment, one devoted to charity, delighting in giving and sharing. This is called accomplishment in generosity.",
    "an8.76:8": "() \"And what is accomplishment in wisdom?Here, a clansman is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering. This is called accomplishment in wisdom.",
    "an8.76:9": "\"These, bhikkhus, are the eight accomplishments.\"",
    "an8.76:10": "Enterprising in his occupations,heedful in his arrangements,balanced in his way of living,he safeguards the wealth he earns.",
    "an8.76:11": "Endowed with faith, accomplished in virtue,charitable and devoid of miserliness,he constantly purifies the paththat leads to safety in future lives.",
    "an8.76:12": "Thus these eight qualitiesof the faithful seeker of the household lifeare said by the one who is truly named[n.1796]Akkhātā saccanāmena. The one \"truly named\" is the Buddha, since the name \"Buddha\" corresponds to his real stature as an enlightened one. See tooAN6.43, n. 1320.to lead to happiness in both states:",
    "an8.76:13": "To good and welfare in this very life,and to happiness in future lives.Thus for those dwelling at home,their generosity and merit increase."
}