{
    "an8.66:1": "\"Bhikkhus, there are these eight emancipations.[n.776] The wordvimokkhais used here in a specific and limited sense and does not imply irreversible liberation of the mind from all defilements; this latter is usually indicated byakuppā cetovimuttiorcetovimutti paññāvimutti.Mp:\"In what sense are they emancipations? In the sense of releasing(adhimuccanaṭṭhena). In what sense releasing? In the sense of thoroughly freeing from adverse qualities, and in the sense of thoroughly freeing through delight in the object. What is meant isthe mind'soccurrence on the object without constraint, free from worry, like a child sleeping on his father's lap, his body completely relaxed. This second meaning (regarding the object) does not apply to the last emancipation, but only to the others (for in the last emancipation there is no object of perception).\"What eight?",
    "an8.66:2": "() \"One not percipient of forms internally sees forms externally. This is the second emancipation.[n.1778]One not percipient of forms internally sees forms externally(ajjhattaṁ arūpasaññī, bahiddhā rūpāni passati).Mp:\"One who is not percipient of forms internally is one who does not attain form-sphere jhānas based on his own head hairs, etc. What is shown by this are the form-sphere jhānas of one who attains jhāna externally, having done the preliminary work externally.\"",
    "an8.66:3": "() \"One is focused only on ‘beautiful.’ This is the third emancipation.[n.1779]Subhant’eva adhimutto hoti.Mp:\"By this what is shown are jhānas based on extremely purified colorkasiṇas, such as blue, etc.\"Mppoints out that Paṭis, a canonical exegetical treatise, defines the emancipation on the beautiful as the four immeasurable states (loving-kindness, compassion, altruistic joy, and equanimity); see Paṭis II 9,14–26. It seems that the first emancipation comprises the first two bases of overcoming; the second, the second two bases of overcoming; and the third, the remaining four bases of overcoming.",
    "an8.66:4": "() \"With the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving‘space is infinite,’ one enters and dwells in the base of the infinity of space. This is the fourth emancipation.",
    "an8.66:5": "() \"By completely surmounting the base of the infinity of space,perceiving‘consciousness is infinite,’ one enters and dwells in the base of the infinity of consciousness. This is the fifth emancipation.",
    "an8.66:6": "() \"By completely surmounting the base of the infinity of consciousness,perceiving‘there is nothing,’ one enters and dwells in the base of nothingness. This is the sixth emancipation.",
    "an8.66:7": "() \"By completely surmounting the base of nothingness, one enters and dwells in the base of neither-perception-nor-non-perception. This is the seventh emancipation.",
    "an8.66:8": "()\"By completely surmounting the base of neither-perception-nor-non-perception, one enters and dwells in the cessation of perception and feeling.[n.170] On the cessation of perception and feeling(saññāvedayitanirodha), seeMN 43.53, I 296,5–23;MN 44.25–36, 301,30–302,27;SN 41.6, IV 293–95; Vism 702–9, Ppn 23.16–52.This is the eighth emancipation."
}