{
    "an8.65:1": "\"Bhikkhus, there are these eight bases of overcoming.[n.77]Abhibhāyatanāni. From the descriptions both in the text and commentary, it seems that the \"bases of overcoming\" are actually approaches to thekasiṇas, described in detail in Vism, chaps. 4 and 5.Mp:\"Theabhibhāyatanāniare causes of overcoming(abhibhavanakāraṇāni). What do they overcome? The adverse qualities and the objects. For they overcome the adverse qualities opposed to them(paṭipakkhabhāvena paccanīkadhamme)and, through a person's superior knowledge, (they overcome) the objects(puggalassa ñāṇuttariyatāya ārammaṇāni).\"What eight?",
    "an8.65:2": "() \"One percipient of forms internally sees forms externally, measureless, beautiful or ugly. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the second basis of overcoming.[n.1773]Mp:\"As a hungry person who has obtained ample food does not see that meal as large but thinks: ‘Give me seconds and thirds. What will this do for me?’ so a person whose knowledge is emerging, one of clear knowledge, thinks: ‘What is there to attain here? This isn’t a measureless object. It isn’t troublesome for me to obtain one-pointedness of mind.’ Having overcome (those forms), he enters an attainment, and with the arising of the mark he reaches absorption.\"",
    "an8.65:3": "() \"One not percipient of forms internally sees forms externally, limited, beautiful or ugly. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the third basis of overcoming.[n.1774]Mp:\"One not percipient of forms internally sees forms externally(ajjhattaṁ arūpasaññī eko bahiddhā rūpāni passati): This describes one for whom the preliminary work and the mark have arisen externally. Thus both by way of the preliminary work and by way of absorption, he is called one who is not percipient of forms internally (but) sees forms externally.\"",
    "an8.65:4": "() \"One not percipient of forms internally sees forms externally, measureless, beautiful or ugly. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the fourth basis of overcoming.",
    "an8.65:5": "() \"One not percipient of forms internally sees forms externally, blue ones, blue in color, with a blue hue, with a blue tint. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the fifth basis of overcoming.[n.177]Mp:\"From the fifth base of overcoming on, he shows their thorough purification. For these bases are stated by way of purified colors(visuddhavaṇṇavasen’eva).\" The colored bases of overcoming are illustrated by similes below atAN10.29, as well as atDN 16.43(), II 110–11.",
    "an8.65:6": "() \"One not percipient of forms internally sees forms externally, yellow ones, yellow in color, with a yellow hue, with a yellow tint. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the sixth basis of overcoming.",
    "an8.65:7": "() \"One not percipient of forms internally sees forms externally, red ones, red in color, with a red hue, with a red tint. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the seventh basis of overcoming.",
    "an8.65:8": "() \"One not percipient of forms internally sees forms externally, white ones, white in color, with a white hue, with a white tint. Having overcome them, he is percipient thus: ‘I know, I see.’ This is the eighth basis of overcoming."
}