{
    "an8.23:1": "On one occasion the Blessed One was dwelling at Āḷavī at the Aggāḷava Shrine. There the Blessed One addressed the bhikkhus ….",
    "an8.23:2": "Then, in the morning, a certain bhikkhu dressed, took his bowl and robe, and went to the residence of Hatthaka of Āḷavī. When he arrived, he sat down on the seat that was prepared for him. Then Hatthaka of Āḷavī approached the bhikkhu, paid homage to him, and sat down to one side. The bhikkhu then said to him:",
    "an8.23:3": "\"Friend,[n.1681] While Hatthaka is said to be dwelling in a residence(nivesana), unlike the preceding two lay followers, he is not addressed here as \"householder\"(gahapati)but as \"friend\"(āvuso). Whether this is intentional or a transmission error is impossible to determine. AtAN6.12, however, Hatthaka is referred to as a householder(gahapati)whereas some of the other lay disciples in this vagga are called lay followers(upāsaka).the Blessed One declared that you possess seven astounding and amazing qualities. What seven? ‘Bhikkhus, Hatthaka of Āḷavī is endowed with faith. He is virtuous and has a sense of moral shame and moral dread. He is learned, generous, and wise.’ The Blessed One declared that you possess these seven astounding and amazing qualities.\"",
    "an8.23:4-6": "Then that bhikkhu, having received almsfood at the residence of Hatthaka of Āḷavī, rose from his seat and departed. After his meal, on returning from his alms round, he approached the Blessed One,paid homage to him, sat down to one side, (and reported to him all that had happened).[n.1682] The text repeats everything from the bhikkhu's going to Hatthaka's house up to the end of their conversation.",
    "an8.23:7": "(The Blessed One said:) \"Good, good, bhikkhu! That clansman has few desires, since he does not want his inner wholesome qualities to be known by others. Therefore, bhikkhu, you should remember Hatthaka of Āḷavī as one who possesses this eighth astounding and amazing quality, that is, (8) fewness of desires.\""
}