{
    "an8.14:1": "\"Bhikkhus, I will teach you the eight kinds of wild colts and the eight faults of a horse, and I will teach you the eight kinds of persons who are like wild colts and the eight faults of a person. Listen and attend closely. I will speak.\"",
    "an8.14:2": "\"And what, bhikkhus, are the eight kinds of wild colts and the eight faults of a horse?",
    "an8.14:3": "(2) \"Again, when a wild colt is told: ‘Go forward!’ and is being spurred and incited by its trainer, it leaps back andtherebydamages the rail and breaks the triple rod.[n.166]Pacchā laṅghati, kubbaraṁ hanati, tidaṇḍaṁ bhañjati.Mp:\"It kicks up its two hind legs, strikes the chariot's rail, and damages the rail. It breaks the triple rod, the three rods in front of the chariot.\"There is such a kind of wild colt here. This is the second fault of a horse.",
    "an8.14:4": "(3) \"Again, when a wild colt is told: ‘Go forward!’ and is being spurred and incited by its trainer, it loosens its thigh from the chariot pole and crushes the chariot pole.[n.166]Rathīsāya satthiṁ ussajjitvā rathīsaṁyeva ajjhomaddati.Mp:\"Having lowered its head, it throws the yoke to the ground and strikes the chariot pole with its thigh and crushes the chariot pole with its two front feet.\"There is such a kind of wild colt here. This is the third fault of a horse.",
    "an8.14:5": "(4) \"Again, when a wild colt is told: ‘Go forward!’ and is being spurred and incited by its trainer, it takes a wrong path and leads the chariot off the track. There is such a kind of wild colt here. This is the fourth fault of a horse.",
    "an8.14:6": "(5) \"Again, when a wild colt is told: ‘Go forward!’ and is being spurred and incited by its trainer, it leaps up with the front of its body and churns the air with its front feet. There is such a kind of wild colt here. This is the fifth fault of a horse.",
    "an8.14:7": "(6) \"Again, when a wild colt is told: ‘Go forward!’ and is being spurred and incited by its trainer, it does not heed its trainer or the goad[n.1665] I followCeand Ee, which here and below readpatodaṁ, as against Bepatodalaṭṭhi, \"goad and whip.\"but destroys the mouthbit with its teethand sets out wherever it wishes. There is such a kind of wild colt here. This is the sixth fault of a horse.",
    "an8.14:8": "(7) \"Again, when a wild colt is told: ‘Go forward!’ and is being spurred and incited by its trainer, it does not go forward or turn back but stands right there as still as a post. There is such a kind of wild colt here. This is the seventh fault of a horse.",
    "an8.14:9": "(8) \"Again, when a wild colt is told: ‘Go forward!’ and is being spurred and incited by its trainer, it tucks in its front legs and its back legs and sits down right there on all four legs. There is such a kind of wild colt here. This is the eighth fault of a horse.",
    "an8.14:10": "\"And what, bhikkhus, are the eight kinds of persons who are like wild colts and the eight faults of a person?",
    "an8.14:11": "(2) \"Again, when the bhikkhus are reproving a bhikkhu for an offense,he castigates the reprover himself: ‘What right does an incompetent fool like you have to speak? Do you really think you have something to say?’ I say this person is similar to the wild colt that, when told: ‘Go forward!’ and when spurred and incited by its trainer, leaps back andtherebydamages the rail and breaks the triple pole. There is such a kind of person here like a wild colt. This is the second fault of a person.",
    "an8.14:12": "(3) \"Again, when the bhikkhus are reproving a bhikkhu for an offense, he attributes an offense to the reprover himself, saying: ‘You have committed such and such an offense. Make amends for it first.’ I say this person is similar to the wild colt that, when told: ‘Go forward!’ and when spurred and incited by its trainer, loosens its thigh from the chariot pole and crushes the chariot pole. There is such a kind of person here like a wild colt. This is the third fault of a person.",
    "an8.14:13": "(4) \"Again, when the bhikkhus are reproving a bhikkhu for an offense, he answers evasively, diverts the discussion to an irrelevant subject, and displays anger, hatred, and bitterness. I say this person is similar to the wild colt that, when told: ‘Go forward!’ and when spurred and incited by its trainer, takes a wrong path and leads the chariot off the track. There is such a kind of person here like a wild colt. This is the fourth fault of a person.",
    "an8.14:14": "(5) \"Again, when the bhikkhus are reproving a bhikkhu for an offense, he speaks while waving his arms about in the midst of the Saṅgha. I say this person is similar tothe wild colt that, when told: ‘Go forward!’ and when spurred and incited by its trainer, leaps up with the front of its body and churns the air with its front feet. There is such a kind of person here like a wild colt. This is the fifth fault of a person.",
    "an8.14:15": "(6) \"Again, when the bhikkhus are reproving a bhikkhu for an offense, he does not heed the Saṅgha or his reprover but sets out wherever he wishes while still bearing his offense. I say this person is similar to the wild colt that, when told: ‘Go forward!’ and when spurred and incited by its trainer, does not heed its trainer or the goad but destroys the mouthbit with its teeth and sets out wherever it wishes. There is such a kind of person here like a wild colt. This is the sixth fault of a person.",
    "an8.14:16": "(7) \"Again, when the bhikkhus are reproving a bhikkhu for an offense, he does not say, ‘I committed an offense,’ nor does he say, ‘I did not commit an offense,’ but he vexes the Saṅgha by keeping silent. I say this person is similar to the wild colt that, when told: ‘Go forward!’ and when spurred and incited by its trainer, does not go forward or turn back but stands right there as still as a post. There is such a kind of person here like a wild colt. This is the seventh fault of a person.",
    "an8.14:17": "(8) \"Again, when the bhikkhus are reproving a bhikkhu for an offense, he says:‘Why are you making such a fuss about me? Now I’ll reject the training and return to the lower life.’ He then rejects the training, returns to the lower life, and declares: ‘Now you can be satisfied!’ I say this person is similar to the wild colt that, when told: ‘Go forward!’ and when spurred and incited by its trainer, tucks in its front legs and its back legs and sits down right there on all four legs. There is such a kind of person here like a wild colt. This is the eighth fault of a person."
}