{
    "an8.20:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Migāramātā's Mansion in the Eastern Park. Now on that occasion, on the day of the uposatha, the Blessed One was sitting surrounded by the Saṅgha of bhikkhus. Then, as the night advanced, when the first watch passed, the Venerable Ānanda rose from his seat, arranged his upper robe over one shoulder, reverently saluted the Blessed One, and said to him: \"Bhante, the night has advanced; the first watch has passed; the Saṅgha of bhikkhus has been sitting for a long time. Let the Blessed One recite the Pāṭimokkha to the bhikkhus.\"",
    "an8.20:2": "When this was said, the Blessed One was silent.",
    "an8.20:3": "Then it occurred to the Venerable Mahāmoggallāna: \"What person was the Blessed One referring to when he said: ‘This assembly, Ānanda, is impure’?\" Then the Venerable Mahāmoggallāna fixed his attention on the entire Saṅgha of bhikkhus, encompassing their minds with his own mind. He then saw that person sitting in the midst of the Saṅgha of bhikkhus: one who was immoral, of bad character, impure, of suspect behavior, secretive in his actions, not an ascetic though claiming to be one, not a celibate though claiming to be one, inwardly rotten, corrupt, depraved. Having seen him, he rose from his seat, went up to that person, and said to him: \"Get up, friend. The Blessed One has seen you. You cannot live in communion with the bhikkhus.\"",
    "an8.20:4": "When this was said, that person remained silent.",
    "an8.20:5": "Then the Venerable Mahāmoggallāna grabbed that person by the arm, evicted him through the outer gatehouse, and bolted the door. Then he returned to the Blessed One and said to him: \"I have evicted that person, Bhante. The assembly is pure. Let the Blessed One recite the Pāṭimokkha to the bhikkhus.\"\"It's astounding and amazing, Moggallāna, how that hollow man waited[n.1676] I read withCeāgamessati, as against Be and Eeāgamissati.until he was grabbed by the arm.\"",
    "an8.20:6": "Then the Blessed One addressed the bhikkhus: \"Now, bhikkhus, you yourselves should conduct the uposatha and recite the Pāṭimokkha. From today onward, I will no longer do so. It is impossible and inconceivable that the Tathāgata could conduct the uposatha and recite the Pāṭimokkha in an impure assembly.",
    "an8.20:7": "\"The asuras, bhikkhus, see these eight astounding and amazing qualities in the great ocean because of which they take delight in it. What eight?",
    "an8.20:8": "() \"Again, the great ocean is the abode of great beings …… five hundredyojanaslong. This is the eighth astounding and amazing quality that the asuras see in the great ocean because of which they take delight in it.",
    "an8.20:9": "So too, the bhikkhus see eight astounding and amazing qualities in this Dhamma and discipline because of which they take delight in it. What eight?"
}