{
    "an8.2:1": "\"Bhikkhus, there are these eight causes and conditions that lead to obtaining the wisdom fundamental to the spiritual life[n.62]Ādibrahmacariyikāya paññāya.Mp:\"(This is) insight, the wisdom that is the basis for the spiritual life of the path\"(maggabrahmacariyassa ādibhūtāya paññāyā ti vipassanāya).when it has not been obtained and to its increase, maturation, and fulfillment by development after it has been obtained. What eight?",
    "an8.2:2": "() \"As he is living in dependence on the Teacher or on a certain fellow monk in the position of a teacher, toward whom he has set up a keen sense of moral shame and moral dread, affection and reverence, he approaches them from time to time and inquires: ‘How is this, Bhante? What is the meaning of this?’ Those venerable ones then disclose to him what has not been disclosed, clear up what is obscure, and dispel his perplexity about numerous perplexing points. This is the second cause and condition that leads to obtaining the wisdom fundamental to the spiritual life ….",
    "an8.2:3": "() \"Having heard that Dhamma, he resorts to two kinds of withdrawal: withdrawal in body and withdrawal in mind. This is the third cause and condition that leads to obtaining the wisdom fundamental to the spiritual life ….",
    "an8.2:4": "() \"He is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them. This is the fourth cause and condition that leads to obtaining the wisdom fundamental to the spiritual life ….",
    "an8.2:5": "() \"He has learned much, remembers what he has learned, and accumulates what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, which proclaim the perfectly complete and pure spiritual life—such teachings as these he has learned much of, retained in mind, recited verbally, mentally investigated, and penetrated well by view. This is the fifth cause and condition that leads to obtaining the wisdom fundamental to the spiritual life ….",
    "an8.2:6": "() \"He has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. This is the sixth cause and condition that leads to obtaining the wisdom fundamental to the spiritual life ….",
    "an8.2:7": "() \"In the midst of the Saṅgha, he does not engage in rambling and pointless talk. Either he himself speaks on the Dhamma, or he requests someone else to do so, or he adopts noble silence.[n.1622]Ariyaṁ vā tuṇhībhāvaṁ nātimaññati. Lit., \"or he does not look down on noble silence.\"This is the seventh cause and condition that leads to obtaining the wisdom fundamental to the spiritual life ….",
    "an8.2:8": "() \"He dwells contemplating arising and vanishing in the five aggregates subject to clinging: ‘Such is form, such its origin, such its passing away; such is feeling … such is perception … such are volitional activities … such is consciousness, such its origin, such its passing away.’ This is the eighth cause and condition that leads to obtaining the wisdom fundamental to the spiritual life when it has not been obtained and to its increase, maturation, and fulfillment by development after it has been obtained.",
    "an8.2:9": "(1) \"His fellow monks esteem him thus: ‘This venerable one lives in dependence on the Teacher or on a certain fellow monk in the position of a teacher, toward whom he has set up a keen sense of moral shame and moral dread, affection and reverence. This venerable one surely knows and sees.’ This quality leads to affection, respect, esteem, accord, and unity.[n.1623]Piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṁvattati.Mpglossesbhāvanāyahere withbhāvanatthāya guṇasambhāvanāya vā, \"toward (meditative) development or toward esteem for virtues.\" The latter meaning seems to fit the context better. Mp glossessāmaññāyawithsamaṇadhammatthāya, \"for the sake of the ascetic's duty,\" but I think it more likely thatsāmaññāis an abstract noun fromsamāna, meaning \"the same\" or \"similar.\" I translate it as \"accord,\" which agrees well with the following wordekībhāvāya. PED listssāmañña1as meaning \"conformity\" and \"unity.\" The word occurs in this sense as the name of the fifth vagga of the Second Fifty . No Chinese parallel is listed.",
    "an8.2:10": "(2) \"‘As this venerable one is living in dependence on the Teacher or on a certain fellow monk in the position of a teacher …… those venerable ones … dispel his perplexity about numerous perplexing points. This venerable one surely knows and sees.’ This quality, too, leads to affection, respect, esteem, accord, and unity.",
    "an8.2:11": "(3) \"‘Having heard that Dhamma, this venerable one resorts to two kinds of withdrawal: withdrawal in body and withdrawal in mind. This venerable one surely knows and sees.’ This quality, too, leads to affection, respect, esteem, accord, and unity.",
    "an8.2:12": "(4) \"‘This venerable one is virtuous; he dwells restrained by the Pāṭimokkha … he trains in them. This venerable one surely knows and sees.’ This quality, too, leads to affection, respect, esteem, accord, and unity.",
    "an8.2:13": "(5) \"‘This venerable one has learned much … and penetrated well by view. This venerable one surely knows and sees.’ This quality, too, leads to affection, respect, esteem, accord, and unity.",
    "an8.2:14": "(6) \"‘This venerable one has aroused energy for abandoning unwholesome qualities … not casting off the duty of cultivating wholesome qualities. This venerable one surely knows and sees.’ This quality, too, leads to affection, respect, esteem, accord, and unity.",
    "an8.2:15": "(7) \"‘In the midst of the Saṅgha, this venerable one does not engage in rambling and pointless talk … or he adopts noble silence. This venerable one surely knows and sees.’ This quality, too, leads to affection, respect, esteem, accord, and unity.",
    "an8.2:16": "(8) \"‘This venerable one dwells contemplating arising and vanishing in the five aggregates subject to clinging …. This venerable one surely knows and sees.’ This quality, too, leads to affection, respect, esteem, accord, and unity.",
    "an8.2:17": "\"These, bhikkhus, are the eight causes and conditions that lead to obtaining the wisdom fundamental to the spiritual life when it has not been obtained and to its increase, maturation, and fulfillment by development after it has been obtained.\""
}