{
    "an8.6:1": "\"Bhikkhus, these eight worldly conditions revolve around the world, and the world revolves around these eight worldly conditions. What eight? Gain and loss, disrepute and fame, blame and praise, and pleasure and pain. These eight worldly conditions revolve around the world, and the world revolves around these eight worldly conditions.",
    "an8.6:2": "\"Bhikkhus, an uninstructed worldling meets gain and loss, disrepute and fame, blame and praise, and pleasure and pain. An instructed noble disciple also meets gain and loss, disrepute and fame, blame and praise, and pleasure and pain. Whatis the distinction, the disparity, the difference between an instructed noble disciple and an uninstructed worldling with regard to this?\"",
    "an8.6:3": "\"Then listen, bhikkhus, and attend closely. I will speak.\"",
    "an8.6:4": "\"Gain obsesses his mind, and loss obsesses his mind. Fame obsesses his mind, and disrepute obsesses his mind. Blame obsesses his mind, and praise obsesses his mind. Pleasure obsesses his mind, and pain obsesses his mind. He is attracted to gain and repelled by loss. He is attracted to fame and repelled by disrepute. He is attracted to praise and repelled by blame. He is attracted to pleasure and repelled by pain. Thus involved with attraction and repulsion, he is not freed from birth, from old age and death, from sorrow, lamentation, pain, dejection, and anguish; he is not freed from suffering, I say.",
    "an8.6:5": "\"But, bhikkhus, (1) when an instructed noble disciple meets with gain, he reflects thus:‘This gain that I have met is impermanent, suffering, and subject to change.’ He thus understands it as it really is. (2) When he meets with loss … (3) … fame … (4) …disrepute … () … blame … (6) … praise … (7) … pleasure … (8) … pain, he reflects thus:‘This pain that I have met is impermanent, suffering, and subject to change.’ He thus understands it as it really is.",
    "an8.6:6": "\"Gain does not obsess his mind, and loss does not obsess his mind. Fame does not obsess his mind, and disrepute does not obsess his mind. Blame does not obsess his mind, and praise does not obsess his mind. Pleasure does not obsess his mind, and pain does not obsess his mind. He is not attracted to gain or repelled by loss. He is not attracted to fame or repelled by disrepute. He is not attracted to praise or repelled by blame. He is not attracted to pleasure or repelled by pain. Having thus discarded attraction and repulsion, he is freed from birth, from old age and death, from sorrow, lamentation, pain, dejection, and anguish; he is freed from suffering, I say.",
    "an8.6:7": "Gain and loss, disrepute and fame,blame and praise, pleasure and pain:these conditions that people meetare impermanent, transient, and subject to change.",
    "an8.6:8": "A wise and mindful person knows themand sees that they are subject to change.Desirable conditions don’t excite his mindnor is he repelled by undesirable conditions.",
    "an8.6:9": "He has dispelled attraction and repulsion;they are gone and no longer present.Having known the dustless, sorrowless state,he understands rightly and has transcended existence."
}