{
    "an8.19:1": "On one occasion the Blessed One was dwelling at Verañjā at the foot of Naḷeru's neem tree. Then Pahārāda, ruler of the asuras, approached the Blessed One, paid homage to him, and stood to one side. The Blessed One then said to him:",
    "an8.19:2": "\"Pahārāda, do the asuras take delight in the great ocean?\"",
    "an8.19:3": "(2) \"Again, the great ocean is stable and does not overflow its boundaries. This is the second astounding and amazing quality that the asuras see in the great ocean ….",
    "an8.19:4": "(3) \"Again, the great ocean does not associate with a corpse, but quickly carries it to the coast and washes it ashore. This is the third astounding and amazing quality that the asuras see in the great ocean ….",
    "an8.19:5": "(4) \"Again, when the great rivers—the Ganges, the Yamunā, the Aciravatī, the Sarabhū, and the Mahī—reach the great ocean, they give up their former names and designationsand are simply called the great ocean. This is the fourth astounding and amazing quality that the asuras see in the great ocean ….",
    "an8.19:6": "(5) \"Again, whatever streams in the world flow into the great ocean and however much rain falls into it from the sky, neither a decrease nor a filling up can be seen in the great ocean. This is the fifth astounding and amazing quality that the asuras see in the great ocean ….",
    "an8.19:7": "(6) \"Again, the great ocean has but one taste, the taste of salt. This is the sixth astounding and amazing quality that the asuras see in the great ocean ….",
    "an8.19:8": "(7) \"Again, the great ocean contains many precious substances, numerous precious substances such as pearls, gems, lapis lazuli, conch, quartz, coral, silver, gold, rubies, and cats-eye. Thisis the seventh astounding and amazing quality that the asuras see in the great ocean ….",
    "an8.19:9": "(8) \"Again, the great ocean is the abode of great beings such as timis, timingalas, timirapingalas, asuras, nāgas, and gandhabbas.[n.1672] The first three are legendary fish of gigantic size.There are in the great ocean beings with bodies one hundredyojanaslong, two hundred, three hundred, four hundred, and five hundredyojanaslong. This is the eighth astounding and amazing quality that the asuras see in the great ocean because of which they take delight in it.",
    "an8.19:10": "\"But, Bhante, how many astounding and amazing qualities do the bhikkhus see in this Dhamma and discipline because of which they take delight in it?\"",
    "an8.19:11": "(2) \"Just as the great ocean is stable and does not overflow its boundaries, so too, when I have prescribed a training rule for my disciples, they will not transgress it even for life's sake. This is the second astounding and amazing quality that the bhikkhus see in this Dhamma and discipline ….",
    "an8.19:12": "(3) \"Just as the great ocean does not associate with a corpse, but quickly carries it to the coast and washes it ashore, so too, the Saṅgha does not associate with a person who is immoral, of bad character, impure, of suspect behavior, secretive in his actions, not an ascetic though claiming to be one, not a celibate though claiming to be one, inwardly rotten, corrupt, depraved; rather, it quickly assembles and expels him.",
    "an8.19:13": "Even though he is seated in the midst of the Saṅgha of bhikkhus, yet he is far from the Saṅgha and the Saṅgha is far from him.This is the third astounding and amazing quality that the bhikkhus see in this Dhamma and discipline ….",
    "an8.19:14": "(4) \"Just as, when the great rivers … reach the great ocean, they give up their former names and designations and are simply called the great ocean, so too, when members of the four social classes—khattiyas, brahmins, vessas, and suddas—go forth from the household life into homelessness in the Dhamma and discipline proclaimed by the Tathāgata, they give up their former names and clans and are simply called ascetics following the Sakyan son. This is the fourth astounding and amazing quality that the bhikkhus see in this Dhamma and discipline ….",
    "an8.19:15": "(5) \"Just as, whatever streams in the world flow into the great ocean and however much rain falls into it from the sky, neither a decrease nor a filling up can be seen in the great ocean, so too, even if many bhikkhus attain final nibbāna by way of the nibbāna element without residue remaining, neither a decrease nor a filling up can be seen in the nibbāna element.[n.1674]Na tena nibbānadhātuyā ūnattaṁ vā purattaṁ vā paññāyati.Mp:\"When no Buddhas have arisen in countless eons, it is not possible for even one being to attain nibbāna. Yet one cannot say, ‘The nibbāna element is empty.’ And during the time of a Buddha, when countless beings attain the deathless at a single assembly, one cannot say, ‘The nibbāna element has become full.’\"This is the fifth astounding and amazing quality that the bhikkhus see in this Dhamma and discipline ….",
    "an8.19:16": "(6) \"Just as the great ocean has but one taste, the taste of salt, so too, this Dhamma and discipline has but one taste, the taste of liberation. This is the sixth astounding and amazing quality that the bhikkhus see in this Dhamma and discipline ….",
    "an8.19:17": "(7) \"Just as the great ocean contains many precious substances, numerous precious substances such as pearls … cats-eye, so too, this Dhamma and discipline contains many precious substances, numerous precious substances: the four establishments of mindfulness, the four right strivings, the four bases for psychic potency, the five spiritual faculties, the five powers, the seven factors of enlightenment, the noble eightfold path. This is the seventh astounding and amazing quality that the bhikkhus see in this Dhamma and discipline ….",
    "an8.19:18": "(8) \"Just as the great ocean is the abode of great beings such as timis …… gandhabbas; and as there are in the great ocean beings with bodies one hundredyojanaslong … five hundredyojanaslong, so too this Dhamma and discipline is the abode of great beings: the stream-enterer, the one practicing for realization of the fruit of stream-entry; the once-returner, the one practicing for realization of the fruit of once-returning; the non-returner, the one practicing for realization of the fruit of non-returning; the arahant, the one practicing for arahantship. This is the eighth astounding and amazing quality that the bhikkhus see in this Dhamma and discipline because of which they take delight in it.",
    "an8.19:19": "\"These, Pahārāda, are the eight astounding and amazing qualities that the bhikkhus see in this Dhamma and discipline because of which they take delight in it.\""
}