{
    "an8.39:1": "\"Bhikkhus, there are these eight streams of merit, streams of the wholesome, nutriments of happiness—heavenly, ripening in happiness, conducive to heaven—that lead to what is wished for, desired, and agreeable, to one's welfare and happiness.[n.72] SeeAN4.5–52,AN5.45.What eight?",
    "an8.39:2": "() \"Again, a noble disciple has gone for refuge to the Dhamma. This is the second stream of merit … that leads to what is wished for, desired, and agreeable, to one's welfare and happiness.",
    "an8.39:3": "() \"Again, a noble disciple has gone for refuge to the Saṅgha. This is the third stream of merit … that leads to what is wished for, desired, and agreeable, to one's welfare and happiness.",
    "an8.39:4": "\"There are, bhikkhus, these five gifts, great gifts, primal, of long standing, traditional, ancient, unadulterated and never before adulterated, which are not being adulterated and will not be adulterated, not repudiated by wise ascetics and brahmins. What five?",
    "an8.39:5": "() –(8) \"Again, a noble disciple, having abandoned the taking of what is not given, abstains from taking what is not given … abstains from sexual misconduct … abstains from false speech … abstains from liquor, wine, and intoxicants, the basis for heedlessness. By abstaining from liquor, wine, and intoxicants, the basis for heedlessness, the noble disciple gives to an immeasurable number of beings freedom from fear, enmity, and affliction. He himself in turn enjoys immeasurable freedom from fear, enmity, and affliction. This is the fifth gift, a great gift, primal, of long standing, traditional, ancient, unadulterated and never before adulterated, which is not being adulterated and will not be adulterated, not repudiated by wise ascetics and brahmins. This is the eighth stream of merit… that leads to what is wished for, desired, and agreeable, to one's welfare and happiness.",
    "an8.39:6": "\"These, bhikkhus, are the eight streams of merit, streams of the wholesome, nutriments of happiness—heavenly, ripening in happiness, conducive to heaven—that lead to what is wished for, desired, and agreeable, to one's welfare and happiness.\""
}