{
    "an8.87:1": "\"Bhikkhus, when a lay follower possesses eight qualities, the Saṅgha, if it so wishes, may overturn the almsbowl on him.[n.809]Pattaṁ nikkujjeyya. The procedures of overturning the alms-bowl and turning it upright are authorized at Vin II 24–27. See Ṭhānissaro 2007b: 4–2.Mp:\"May overturn the almsbowl on him: They do not actually turn the almsbowl upside down in front of him, but they enact the motion of ‘overturning the almsbowl,’ which means that they do not accept gifts from this person. Similarly, they might decide to abolish this act by enacting a motion to turn the bowl upright(ukkujjeyya), which entitles them to receive his gifts again.\" This procedure was used in Burma during the tumultuous period of late 2007 when the monks decided that the behavior of the military junta toward the Saṅgha merited such a penalty. The monks walked down the streets with their bowls actually turned upside down to express disapproval of the rulers’ actions.What eight?() He tries to prevent bhikkhus from acquiring gains; (2) he tries to bring harm to bhikkhus; (3) he tries to prevent bhikkhus from residingin a certain place; (4) he insults and reviles bhikkhus; (5) he divides bhikkhus from each other; (6) he speaks dispraise of the Buddha; (7) he speaks dispraise of the Dhamma; (8) he speaks dispraise of the Saṅgha. When a lay follower possesses these eight qualities, the Saṅgha, if it so wishes, may overturn the almsbowl on him.",
    "an8.87:2": "\"Bhikkhus, when a lay follower possesses eight qualities, the Saṅgha, if it so wishes, may turn the almsbowl upright on him. What eight? (1) He does not try to prevent bhikkhus from acquiring gains; () he does not try to bring harm to bhikkhus; (3) he does not try to prevent bhikkhus from residingnearby; (4) he does not insult and revile bhikkhus; (5) he does not divide bhikkhus from each other; (6) he speaks praise of the Buddha; (7) he speaks praise of the Dhamma; (8) he speaks praise of the Saṅgha. When a lay follower possesses these eight qualities, the Saṅgha, if it so wishes, may turn the almsbowl upright on him.\""
}