{
    "an8.73:1": "On one occasion the Blessed One was dwelling at Nādika in the brick hall. There the Blessed One addressed the bhikkhus:\"Bhikkhus!\"",
    "an8.73:2": "(1) When this was said, one bhikkhu said to the Blessed One: \"Bhante, I develop mindfulness of death.\"",
    "an8.73:3": "(2) Another bhikkhu said to the Blessed One: \"I too, Bhante, develop mindfulness of death.\"",
    "an8.73:4": "(3) Still another bhikkhu said to the Blessed One: \"I too, Bhante, develop mindfulness of death.\"",
    "an8.73:5": "(4) Still another bhikkhu said to the Blessed One: \"I too, Bhante, develop mindfulness of death.\"",
    "an8.73:6": "(5) Still another bhikkhu said to the Blessed One: \"I too, Bhante, develop mindfulness of death.\"",
    "an8.73:7": "(6) Still another bhikkhu said to the Blessed One: \"I too, Bhante, develop mindfulness of death.\"",
    "an8.73:8": "(7) Still another bhikkhu said to the Blessed One: \"I too, Bhante, develop mindfulness of death.\"",
    "an8.73:9": "(8) Still another bhikkhu said to the Blessed One: \"I too, Bhante, develop mindfulness of death.\"",
    "an8.73:10": "When this was said, the Blessed One said to those bhikkhus: \"Bhikkhus, (1) the bhikkhu who develops mindfulness of death thus: ‘May I live just a night and a day so that I may attend to the Blessed One's teaching. I could then accomplish much!’; and (2) the one who develops mindfulness of death thus:‘May I live just a day so that I may attend to the Blessed One's teaching. I could then accomplish much!’; and (3) the one who develops mindfulness of death thus: ‘May I live just half a day so that I may attend to the Blessed One's teaching. I could then accomplish much!’; and (4) the one who develops mindfulness of death thus: ‘May I live just the length of time it takes to eat a single alms meal so that I may attend to the Blessed One's teaching. I could then accomplish much!’; and (5) the one who develops mindfulness of death thus: ‘May I live just the length of time it takes to eat half an alms meal so that I may attend to the Blessed One's teaching. I could then accomplish much!’; and (6) the one who develops mindfulness of death thus: ‘May I live just the length of time it takes to chew and swallow four or five mouthfuls of food so that I may attend to the Blessed One's teaching. I could then accomplish much!’: these are called bhikkhus who dwell heedlessly. They develop mindfulness of death sluggishly for the destruction of the taints.",
    "an8.73:11": "\"But (7) the bhikkhu who develops mindfulness of death thus: ‘May I live just the length of time it takes to chew and swallow a single mouthful of food so that I may attend to the Blessed One's teaching. I could then accomplish much!’; and (8) the one who develops mindfulness of death thus: ‘May I live just the length of time it takes to breathe out after breathing in, or to breathe in after breathing out, so that I may attend to the Blessed One's teaching. I could then accomplish much!’: these are called bhikkhus who dwell heedfully. They develop mindfulness of death keenly for the destruction of the taints.",
    "an8.73:12": "\"Therefore, bhikkhus, you should train yourselves thus: ‘We will dwell heedfully. We will develop mindfulness of death keenly for the destruction of the taints.’ Thus should you train yourselves.\""
}