{
    "an8.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus: \"Bhikkhus!.",
    "an8.1:2": "\"Bhikkhus, when the liberation of the mind by loving-kindness has been pursued, developed, and cultivated, made a vehicle and basis, carried out, consolidated, and properly undertaken, eight benefits are to be expected. What eight.",
    "an8.1:3": "For one who, ever mindful, developsmeasureless loving-kindness,the fetters thin out as he seesthe destruction of the acquisitions.",
    "an8.1:4": "If, with a mind free from hate,one arouses love toward just one being,one thereby becomes good.Compassionate in mind toward all beings,[n.1616]Sabbe ca pāṇe manasānukampī.Anukampā(the abstract noun ofanukampī)has a slightly different nuance thankaruṇā, the second immeasurable quality.Anukampāusually suggests compassion as a motive for action on behalf of others, whereaskaruṇāgenerally designates a meditative state.the noble one generates abundant merit.",
    "an8.1:5": "Those royal sages who conquered the earthwith its multitudes of beingstraveled around performing sacrifices:the horse sacrifice,[n.1617] I translate on the basis of the Be and Ee readingassamedhaṁ, which accords with the name of the first of this traditional group of sacrifices mentioned elsewhere in the Nikāyas. AtAN4.39these sacrifices are condemned for the harm they inflict on helpless creatures. Ce here readssassamedhaṁ, \"the corn sacrifice,\" the gloss found inMp(both Ce and Be). The gloss is perhaps apologetic, intended to justify the ascription of this sacrifice to the royal sages.the person sacrifice,sammāpāsa,vājapeyya,niraggaḷa.[n.1618] These are the names of other sacrifices.",
    "an8.1:6": "All these are not worth a sixteenth partof a well-developed loving mind,just as the hosts of stars[n.119] Reading withBeand Eetāragaṇā va, as against Cetāragaṇā ca.cannot matcha sixteenth part of the moon's radiance.",
    "an8.1:7": "One who does not kill or enjoin killing,who does not conquer or enjoin conquest,one who has loving-kindness toward all beings[n.1620]Mettaṁso sabbabhūtānaṁ veraṁ tassa na kenaci.Mptakesmettaṁsoto be a compound ofmettāandaṁso, glossing itmettāyamānacittakoṭṭhāso, \"a portion of a loving mind.\" BHSD svaṁśatestifies to the occurrence ofmaitra aṁśain BHS literature;maitreṇāṁśena sphuritvāin Divyāvadāna 60.24 and 61.12.harbors no enmity toward anyone."
}