{
    "an8.51:1": "On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Banyan Tree Park.[n.728] The chronology is unclear to me.Mpsays that at the time this sutta begins the Buddha was living among the Sakyans during hisfirstreturn journey to Kapilavatthu(paṭhamagamanena gantvā viharati). Yet, given that Mahāpajāpatī could go forth only after the death of her husband, the Buddha’s father Suddhodana, and that it seems improbable Suddhodana died during the Buddha’s first return visit to Kapilavatthu, which took place soon after his enlightenment, this fact is hardly credible. It would also lead to an odd anachronism. The Cūḷavagga reports that Ānanda and other prominent Sakyans became monks after the Buddha’s first journey to Kapilavatthu (Vin II 82–83). Ānanda became the Buddha’s attendant twenty years after the enlightenment, when the Buddha was fifty-five, and served the Buddha in this capacity for twenty-five years, right up until the end of his master's life (Th 04–43). In this sutta, however, Ānanda is depicted as the Buddha’s attendantbeforethe founding of the Bhikkhunī Saṅgha. Whether this event occurred shortly after the Buddha’s first return trip to Kapilavatthu, or even five or ten years later, it would still be too early for Ānanda to be serving as his attendant. Thus, unless Ānanda was not actually the Buddha’s attendant at the time, there seems to be a chronological tension between the situation depicted in the sutta and the likely period when women first obtained ordination.Then Mahāpajāpatī Gotamī approached the Blessed One, paid homage to him, stood to one side, and said to him:",
    "an8.51:2": "A second time …",
    "an8.51:3": "A third time Mahāpajāpatī Gotamī said to the Blessed One: \"Bhante, it would be good if women could obtain the going forth from the household life into homelessness in the Dhamma and discipline proclaimed by the Tathāgata.\"",
    "an8.51:4": "Then Mahāpajāpatī Gotamī, thinking: \"The Blessed One does not allow the going forth of women from the household life into homelessness,\" miserable and saddened, wept with a tearful face. She then paid homage to the Blessed One, circumambulated him keeping the right side toward him, and departed.",
    "an8.51:5": "Having stayed in Kapilavatthu as long as he wanted, the Blessed One set out on tour toward Vesālī. Wandering on tour, he eventually arrived at Vesālī, where he dwelled in the hall with the peaked roof in the Great Wood.",
    "an8.51:6": "The Venerable Ānanda saw her standing there in such a condition and said to her:",
    "an8.51:7": "Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Bhante, Mahāpajāpatī Gotamī is standing outside the entrance with her feet swollen and her body covered with dust, miserable and saddened, weeping with a tearful face, because the Blessed One does not allow the going forth of women. Bhante, it would be good if women could obtain the going forth from the household life into homelessness in the Dhamma and discipline proclaimed by the Tathāgata.\"",
    "an8.51:8": "A second time … A third time the Venerable Ānanda said to the Blessed One: \"Bhante, it would be good if women could obtain the going forth from the household life into homelessness in the Dhamma and discipline proclaimed by the Tathāgata.\"",
    "an8.51:9": "Then it occurred to the Venerable Ānanda: \"The Blessed One does not allow the going forth of women from the household life into homelessness. Let me ask the Blessed One for the going forth of women in some other way.\"",
    "an8.51:10": "\"If, Ānanda, Mahāpajāpatī Gotamī accepts eight principles of respect,[n.1733]Aṭṭha garudhamme. The termgarudhammais ambiguous. The wordgarunormally means \"heavy, weighty, grave,\" as for example in the expressiongarukā āpatti, a grave or major offense. Butgaruṁ karoti, lit., \"to make weighty,\" means \"to respect,\" andgarukata, \"respected.\" Thusgarudhammacan mean either a \"heavy, grave rule\" or \"a rule to be respected, a principle of respect.\"Mpendorses the second interpretation: \"Thegarudhammasare principles that are to be treated with respect by the bhikkhunīs who accept them.\" The translators of the Vinaya into Chinese also lean toward this interpretation. Thus in the corresponding passage in the Sarvāstivāda Vinaya (at T XXIII 345b29–c33) they are referred to as, \"eight principles of respect.\" The Mūlasarvāstivāda Vinaya (for instance at T XXIV 350c29) calls them, \"eight principles of honor and respect.\" But the Dharmaguptaka Vinaya (at T XXII 923a27and elsewhere) designates them\"eight principles not to be transgressed throughout life,\" which corresponds to the Pāliyāvajīvaṁ anatikkamanīyo. And the Mahīśasaka Vinaya (at T XXII 185c19) likewise calls them, \"eight principles not to be violated.\"let that itself be her full ordination.[n.1734] It is interesting to note how the subject of the discussion shifts almost imperceptibly from the going forth(pabbajjā)of women to their full ordination(upasampadā). The former refers simply to their leaving the household life, the latter to a formal act of admission into the Saṅgha.",
    "an8.51:11": "(1) \"A bhikkhunī who has been ordained for a hundred years should pay homage to a bhikkhu who has been ordained that same day, should rise up for him, reverentially salute him, and behave courteously toward him. This principle should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts.[n.1735] Mahāpajāpatī later asked the Buddha to permit bhikkhus and bhikkhunīs to pay homage to one anotherand show other signs of respectexclusively on the basis of seniority, without distinction of gender. The Buddha refused and issued a rule: \"Bhikkhus should not pay homage to women, stand up for them, salute them reverentially, or behave respectfully toward them. One who does so commits an offense of wrong doing\"(na bhikkhave mātugāmassa abhivādanaṁ paccuṭṭhānaṁ añjalikammaṁ sāmīcikammaṁ kātabbaṁ; yo kareyya āpatti dukkaṭassa). The incident is at Vin II 257–58.",
    "an8.51:12": "(2) \"A bhikkhunī should not enter upon the rains in a place where there are no bhikkhus.[n.1736] This refers to the three months’ fixed residence during the rainy season.This principle, too, should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts.",
    "an8.51:13": "(3) \"Every half-month a bhikkhunī should ask the Saṅgha of bhikkhus about two things: aboutthe dayof the uposatha, and about coming for the exhortation.[n.1737] Thus on the uposatha day a bhikkhu is assigned the task of giving the bhikkhunīs an exhortation(ovāda). SeeṬhānissaro 2007b:446–47.This principle, too, should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts.",
    "an8.51:14": "(4) \"When a bhikkhunī has observed the rains, she should invite correction before both Saṅghas in regard to three things: in regard to anything seen, heard, or suspected.[n.1738] The \"invitation\"(pavāraṇā)is a ceremony held on the last day of the rains residence at which all the Saṅgha members in order of seniority ask the others to point out any fault they may have committed, whether seen, heard about, or suspected. Each bhikkhu extends the invitation to all the other bhikkhus. By this rule, however, bhikkhunīs are obliged to invite correction from both the bhikkhus and the other bhikkhunīs. SeeṬhānissaro 2007b: 447–48.This principle, too, should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts.",
    "an8.51:15": "(5) \"A bhikkhunī who has committed a grave offense should observe a half-month's penalty period before both Saṅghas.[n.1739] The penalty period(mānatta)is imposed on a monastic guilty of asaṅghādisesaoffense. During this period, the offending bhikkhu must undergo penalization for a period of six days; each day he must also inform all his fellow bhikkhus of his transgression, a humiliating experience. In the case of bhikkhunīs, however, the penalty period lasts two weeks and must be observed in relation to both bhikkhus and bhikkhunīs. For details, see Ṭhānissaro 2007b: 358–73. In this rule, the wordgarudhammahas a different meaning from its use in relation to the eight principles as a set. Here,Mpglosses it asgarukaṁ saṅghādisesāpattiṁ, that is, it is the breach of asaṅghādisesarule. Hüskin (in Mohr and Tsedroen 2010, p. 144) conflates the two senses of the term and thus sees an inconsistency here where there is really none.This principle, too, should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts.",
    "an8.51:16": "(6) \"A probationer who has completed two years of training in the six principles should seek full ordination from both Saṅghas.[n.1740] A probationer(sikkhamānā)is a woman candidate for full ordination who has already gone forth. To complete the requirements for ordination, she is obliged to live for two years observing a special training in regard to six rules(cha dhammā). The six rules—specified at Vin IV 319,24–29in connection with Bhikkhunī Pācittiya 63—involve observingwithout transgressionthe precepts of abstinence from killing any living being, taking what is not given, sexual activity, false speech, intoxicants, and eating at an improper time (between midday and the following daybreak). Breach of any of these rules presumably requires the candidate to revert to the beginning of her two years’ training.This principle, too, should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts.",
    "an8.51:17": "(7) \"A bhikkhunī must in no way insult or revile a bhikkhu. This principle, too, should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts.",
    "an8.51:18": "(8) \"From today on, Ānanda, bhikkhunīs are prohibited from admonishing bhikkhus, but bhikkhus are not prohibited from admonishing bhikkhunīs. This principle, too, should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts.",
    "an8.51:19": "\"If, Ānanda, Mahāpajāpatī Gotamī accepts these eight principles of respect, let that itself be her full ordination.\"[n.1741] In the Vibhaṅga section of the Vinaya Piṭaka, the rules of the Bhikkhunī Pāṭimokkha are shown to have been laid down in response to specific incidents of misbehavior on the part of a certain bhikkhunī (or group of bhikkhunīs). Several of these rules are already included among thegarudhammas. Thusgarudhammas2, 3, 4, and 7 correspond to Bhikkhunī Pācittiyas 56, 59, 57, and 52.Garudhamma6 has counterparts in Bhikkhunī Pācittiyas 63 and 64. The fact that the background stories to these rules show them originating at different points in the early history of the Bhikkhunī Saṅgha casts doubt on the historicity of the present account, which shows the eightgarudhammasbeing laid down at the very beginning of the Bhikkhunī Saṅgha. If the eightgarudhammashad been laid down at the birth of the Bhikkhunī Saṅgha, they would have already been in force and there would have been no need for the Buddha to issue rules to prohibit the same undesirable behavior. He could simply have pointed to the existing rule. The fact that he did issue new rules thus collides with the thesis that the eightgarudhammaswere laid down at the very start of the Bhikkhunī Saṅgha.",
    "an8.51:20": "Then the Venerable Ānanda, having learned these eight principles of respect from the Blessed One, went to Mahāpajāpatī Gotamī and said to her:",
    "an8.51:21": "\"If, Gotamī, you accept eight principles of respect, that itself will be your full ordination:",
    "an8.51:22": "(1) \"A bhikkhunī who has been ordained for a hundred years should pay homage to a bhikkhu who has been ordained that same day, should rise up for him, reverentially salute him, and behave properly toward him. This principle should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts ….",
    "an8.51:23": "(8) \"From today bhikkhunīs are prohibited from admonishing bhikkhus,but bhikkhus are not prohibited from admonishing bhikkhunīs. This principle, too, should be honored, respected, esteemed, and venerated, and should not be transgressed as long as life lasts.",
    "an8.51:24": "\"Bhante Ānanda, if a woman or a man—young, youthful, and fond of ornaments, with head bathed—obtains a garland of blue lotuses, jasmine flowers, or lilies,[n.1742] Foratimuttaka,DOPgives \"a kind of shrub (perhapsOugeinia oojeinensis); its flower.\" Rather than use an obscure Pāli or Latin term, I freely render the name of the flower as \"lilies.\"she or he would accept it with both hands and place it on top of her or his head. In the same way, I accept these eight principles of respect as not to be transgressed as long as life lasts.\"",
    "an8.51:25": "Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said: \"Bhante, Mahāpajāpatī Gotamī has accepted the eight principles of respect as things not to be transgressed as long as life lasts.\"",
    "an8.51:26": "\"If, Ānanda, women had not obtained the going forth from the household life into homelessness in the Dhamma and discipline proclaimed by the Tathāgata, the spiritual life would have been of long duration; the good Dhamma would have stood firm even for a thousand years. However, Ānanda, because women have gone forth from the household life into homelessness in the Dhamma and discipline proclaimed by the Tathāgata, now the spiritual life will not be of long duration; the good Dhamma will last only five hundred years.[n.1743] Assuming the historical authenticity of this passage, if the Buddha had wished to proscribe the ordination of women, it seems he would likely have pointed out this danger to Ānanda at the beginning of their conversation. Ānanda would then have desisted from his effort and women would not have received the right to ordain.",
    "an8.51:27": "\"Just as, Ānanda, prowling burglars[n.1744]Corehi kumbhatthenakehi. Lit, \"bandits who commit pot theft.\"Mp:\"They make a lamp with a pot and by means of its light search for valuable goods in others’ homes.\"easily assail those families that have many women and few men, so in whatever Dhamma and discipline women obtain the going forth from the household life into homelessness, that spiritual life does not last long.",
    "an8.51:28": "\"Just as, Ānanda, when a field of hill rice has ripened,if the bleaching disease attacks it,[n.1745]Setaṭṭhikā rogajāti nipatati.Mp:\"A kind of insect pierces the stalk and enters the middle of the reed. When the stalk is pierced, the sap comes out and cannot reach the top of the paddy plant.\"that field of hill rice does not last long, so in whatever Dhamma and discipline women obtain the going forth from the household life into homelessness, that spiritual life does not last long.",
    "an8.51:29": "\"Just as, Ānanda, when a field of sugar cane has ripened, if the rusting disease attacks it,[n.1746]Mañjiṭṭhikā rogajāti nipatati.Mp:\"The internal reddening of the sugar cane.\"that field of sugar cane does not last long, so in whatever Dhamma and discipline women obtain the going forth from the household life into homelessness, that spiritual life does not last long.",
    "an8.51:30": "\"Just as, Ānanda, a man might build a dyke around a large reservoir as a precaution so that the water would not overflow, so too, as a precaution I have prescribed for bhikkhunīs the eight principles of respect as things not to be transgressed as long as life lasts.\"[n.1747]MpCe: \"By this he shows the following: ‘When a causeway is not built around a large reservoir, whatever water would have remained there if the causeway had first been built does not remain because there is no causeway. So too, these principles of respect have been prescribed in advance, before an incident has arisen, for the purpose of preventing transgression. If they had not been prescribed, then, because women have gone forth, the good Dhamma would have lasted five hundred years. But because they have been laid down in advance, it will continue another five hundred years and thus last for the thousand years originally stated.’ And this expression ‘a thousand years’ is said with reference to arahants who have attained the analytic knowledges(paṭisambhidāpabhedappattakhīṇāsavānaṁ vasen’eva vuttaṁ). Following this, for another thousand years, there appear dry-insight arahants; for another thousand years, non-returners; for another thousand years, once-returners; and for another thousand years, stream-enterers. Thus the good Dhamma of penetration(paṭivedhasaddhammo)will last five thousand years. The Dhamma of learning(pariyattidhammo)will also last this long. For without learning, there is no penetration, and as long as there is learning, there is penetration.\" From the above, we can see that according to the commentary, the allowance for women to go forth will not shorten the life span of the Dhamma; this is because the Buddha laid down the eight principles of respect, which serve as the dyke or causeway."
}