{
    "an8.38:1": "\"Bhikkhus, when a good person is born in a family, it is for the good, welfare, and happiness of many people. It is for the good, welfare, and happiness of () his mother and father, (2) his wife and children, (3) his slaves, workers, and servants, (4) his friends and companions, (5) his departed ancestors, (6) the king, (7) the deities, and (8) ascetics and brahmins.",
    "an8.38:2": "Just as a great rain cloud, nurturing all the crops, appears for the good, welfare, and happiness of many people, so too, when a good person is born in a family, it is for the good, welfare, and happiness of many people. It is for the good, welfare, and happiness of his mother and father …… ascetics and brahmins.\"",
    "an8.38:3": "The wise person, dwelling at home,truly lives for the good of many.Day and night diligent towardhis mother, father, and ancestors,[n.1708]Mpglossespubbewithpaṭhamaṁeva, but I suspect it is an abridgment ofpubbapeta, mentioned in the prose. I translate on the basis of this supposition.he venerates them in accordance with the Dhamma,recollecting what they didfor himin the past.[n.1709] I read these verses as consisting of two six-pāda stanzas and one four-pāda stanza. Ce and Be both divide them into four four-pāda stanzas. Ee does not divide them into stanzas.",
    "an8.38:4": "Firm in faith, the pious man,having known their good qualities,[n.1710] I read withBeand Eeñatvā dhamme ca pesalo, as against Ceñatvā dhamme’dha pesale.venerates the homeless renouncers,the mendicants who lead the spiritual life.[n.1711]Apace brahmacārayo.Mpglosses as ifapacerepresentsapacayati, \"to honor\":brahmacārino apacayati, nīcavuttitaṁ nesaṁ āpajjati. However, DOP takesapacato mean \"not cooking,\" and thus signifying homeless. I follow this with my rendering \"mendicants.\"",
    "an8.38:5": "Beneficial to the king and the devas,beneficial to his relatives and friends,indeed, beneficial to all,well established in the good Dhamma,he has removed the stain of miserlinessand fares on to an auspicious world."
}