{
    "an8.74:1": "On one occasion the Blessed One was dwelling at Nādika in the brick hall. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an8.74:2": "And how is this so?",
    "an8.74:3": "\"This bhikkhu should reflect thus: ‘Do I have any bad unwholesome qualities that have not been abandoned, which might become an obstacle for me if I were to die tonight?’ If, upon review, the bhikkhu knows: ‘I have bad unwholesome qualities that have not been abandoned, which might become an obstacle for me if I were to die tonight,’ then he should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those bad unwholesome qualities.",
    "an8.74:4": "Just as one whose clothes or head had caught fire would put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to extinguishthe fire onhis clothes or head, so that bhikkhushould put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those bad unwholesome qualities.",
    "an8.74:5": "\"But if, upon review, the bhikkhu knows: ‘I do not have any bad unwholesome qualities that have not been abandoned, which might become an obstacle for me if I were to die tonight,’ then he should dwell in that same rapture and joy, training day and night in wholesome qualities.",
    "an8.74:6": "\"But when night has receded and day has approached, a bhikkhu reflects thus: ‘I could die on account of many causes. A snake might bite me … or wild spirits might attack me, and I might die; that would be an obstacle for me.’",
    "an8.74:7": "If, upon review, the bhikkhu knows: ‘I have bad unwholesome qualities that I have not yet abandoned, which might become an obstacle for me if I were to die this day,’ then he should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those bad unwholesome qualities.",
    "an8.74:8": "Just as one whose clothes or head had caught fire would put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to extinguishthe fire onhis clothes or head, so that bhikkhu should put forth extraordinary desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to abandon those bad unwholesome qualities.",
    "an8.74:9": "\"But if, upon review, the bhikkhu knows: ‘I do not have any bad unwholesome qualitiesthat I have not yet abandoned, which might become an obstacle for me if I were to die this day,’ then he should dwell in that same rapture and joy, training day and night in wholesome qualities."
}