{
    "an8.63:1": "Then a certain bhikkhu approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an8.63:2": "(1) \"When, bhikkhu, your mind is firm and well settled internally, and arisen bad unwholesome states do not obsess your mind, then you should train yourself thus:‘I will develop and cultivate the liberation of the mind by loving-kindness, make it a vehicle and basis, carry it out, consolidate it, and properly undertake it.’ Thus should you train yourself.",
    "an8.63:3": "\"When this concentration has been developed and cultivated by you in this way, then you should develop this concentration with thought and examination; you should develop it without thought but with examination only; you should develop it without thought and examination. You should develop it with rapture; you should develop it without rapture; you should develop it accompanied by comfort; and you should develop it accompanied by equanimity.[n.1765]Mp:\"This is the meaning: ‘When, bhikkhu, you have developed this fundamental concentration of loving-kindness in such a way, you should not be satisfied merely with this much, but you should attain four and five jhānas (in the fivefold jhāna scheme) in regard to other meditation objects. Thus you should develop it according to the method \"with thought and examination\" and so forth.’\" While, in the jhāna scheme of the Nikāyas, the transition from the first to the second jhāna is marked by the simultaneous elimination of thought(vitakka)and examination(vicāra), other texts distinguishsamādhias threefold: as with thought and examination, without thought but with examination, and without thought and examination (seeDN .96, III 219,19–20;MN 528.5, III 162,1–16; SN4:, IV 60,11–1). This middle stage ofsamādhigave rise, in the Abhidhamma, to a fivefold scheme of jhānas that inserts, after the first jhāna, a second jhāna that is without thought but with examination. This scheme then renumbers the second, third, and fourth jhānas of the fourfold scheme as the third, fourth, and fifth jhānas to obtain a fivefold scheme. Thesamādhiwith rapture(sappītika)includes the first and second jhānas (of the fourfold scheme); that without rapture(nippītika)includes the third and fourth jhānas. Thesamādhiwith comfort(sātasahagata)is the third jhāna, and thesamādhiwith equanimity(upekkhāsahagata)the fourth jhāna.",
    "an8.63:4": "(2) –() \"When, bhikkhu, this concentration has been developed and well developed by you in this way, then you should train yourself thus: ‘I will develop and cultivate the liberation of the mind by compassion … the liberation of the mind by altruistic joy … the liberation of the mind by equanimity, make it a vehicle and basis, carry it out, consolidate it, and properly undertake it.’ Thus should you train yourself.",
    "an8.63:5": "\"When this concentration has been developed and cultivated[n.1766] I read withEebahulīkato, as against Ce and Besubhāvito.by you in this way, then you should develop this concentration with thought and examination; you should develop it without thought but with examination only; you should develop it without thought and examination. You should develop it with rapture; you should develop it without rapture; you should develop it accompanied by comfort; and you should develop it accompanied by equanimity.",
    "an8.63:6": "(5) \"When, bhikkhu, this concentration has been developed and well developed by you in this way, then you should train yourself thus: ‘I will dwell contemplating the body in the body, ardent, clearly comprehending, mindful, having removed longing and dejection in regard to the world.’ Thus should you train yourself.",
    "an8.63:7": "\"When this concentration has been developed and cultivated by you in this way, then you should develop this concentration with thought and examination; you should develop it without thought but with examinationonly; you should develop it without thought and examination. You should develop it with rapture; you should develop it without rapture; you should develop it accompanied by comfort; and you should develop it accompanied by equanimity.",
    "an8.63:8": "(6) –() \"When, bhikkhu, this concentration has been developed and well developed by you in this way, then you should train yourself thus: ‘I will dwell contemplating feelings in feelings … mind in mind … phenomena in phenomena, ardent, clearly comprehending, mindful, having removed longing and dejection in regard to the world.’ Thus should you train yourself.",
    "an8.63:9": "\"When this concentration has been developed and cultivated by you in this way, then you should develop this concentration with thought and examination; you should develop it without thought but with examination only; you should develop it without thought and examination. You should develop it with rapture; you should develop it without rapture; you should develop it accompanied by comfort; and you should develop it accompanied by equanimity.",
    "an8.63:10": "\"When, bhikkhu, this concentration has been developed and well developed by you in this way, then wherever you walk, you will walk at ease; wherever you stand, you will stand at ease; wherever you sit, you will sit at ease; wherever you lie down, you will lie down at ease.\"",
    "an8.63:11": "Having received such an exhortation from the Blessed One, that bhikkhu rose from his seat, paid homage to the Blessed One, circumambulated him keeping the right side toward him, and departed.[n.1767] This sentence is not inCe,apparently omitted by oversight.Then, dwelling alone, withdrawn, heedful, ardent, and resolute, in no long time that bhikkhu realized for himself with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness, and having entered upon it, he dwelled in it.He directly knew: \"Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.\" And that bhikkhu became one of the arahants."
}