{
    "an8.29:1": "\"Bhikkhus, the uninstructed worldling says: ‘The world has gained the opportunity! The world has gained the opportunity!’[n.688]Khaṇakicco loko. Lit., \"moment-task world.\"Mp:\"One does one's tasks at the moment. Having gained this opportunity, one does one's tasks.\"but he does not know what is an opportunity and what is not an opportunity. There are, bhikkhus, these eight inopportune moments that are not right occasions for living the spiritual life. What eight?",
    "an8.29:2": "() \"Again, a Tathāgata has arisen in the world … and the Dhamma leading to peace, nibbāna, and enlightenment is taught as proclaimed by a Fortunate One. But a person has been reborn in the animal realm. This is the second inopportune moment that is not the right occasion for living the spiritual life.",
    "an8.29:3": "() \"Again, a Tathāgata has arisen in the world … and the Dhamma leading to peace, nibbāna, and enlightenment is taught as proclaimed by a Fortunate One. But a person has been reborn in the sphere of afflicted spirits. This is the third inopportune moment that is not the right occasion for living the spiritual life.",
    "an8.29:4": "() \"Again, a Tathāgata has arisen in the world … and the Dhamma leading to peace, nibbāna, and enlightenment is taught as proclaimed by a Fortunate One. But a person has been reborn in a certain order of long-lived devas.[n.1689]Dīghāyukaṁ devanikāyaṁ.Mp:\"This is said with reference to the order of non-percipient devas(asaññaṁ devanikāyaṁ).\" However, it also seems to apply to the devas of the formless realm, who (because they lack bodies) cannot hear the Buddha or his disciples teach the Dhamma and thus cannot attain even the path of stream-entry.This is the fourth inopportune moment that is not the right occasion for living the spiritual life.",
    "an8.29:5": "() \"Again, a Tathāgata has arisen in the world … and the Dhamma leading to peace, nibbāna, and enlightenment is taught as proclaimed by a Fortunate One. But a person has been reborn in the outlying provinces among the uncouth foreigners,a placeto which bhikkhus, bhikkhunīs, male lay followers, and female lay followers do not travel. This is the fifth inopportune moment that is not the right occasion for living the spiritual life.",
    "an8.29:6": "() \"Again, a Tathāgata has arisen in the world … and the Dhamma leading to peace, nibbāna, and enlightenment is taught as proclaimed by a Fortunate One. A person has been reborn in the central provinces, but he holds wrong view and has a distorted perspective: ‘There is nothing given, nothing sacrificed, nothing offered; there is no fruit or result of good and bad actions; there is no this world, no other world; there is no mother, no father; there are no beings spontaneously reborn; there are in the world no ascetics and brahmins of right conduct and right practice who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’ This is the sixth inopportune moment that is not the right occasion for living the spiritual life.",
    "an8.29:7": "() \"Again, a Tathāgata has arisen in the world … and the Dhamma leading to peace, nibbāna, and enlightenment is taught as proclaimed by a Fortunate One. A person has been reborn in the central provinces, but he is unwise, stupid, obtuse, unable to understand the meaning of what has been well stated and badly stated. This is the seventh inopportune moment that is not the right occasion for living the spiritual life.",
    "an8.29:8": "() \"Again, a Tathāgata has not arisen in the world … and the Dhammaleading to peace, nibbāna, and enlightenment is not taught as proclaimed by a Fortunate One. But a person has been reborn in the central provinces, and he is wise, intelligent, astute, able to understand the meaning of what has been well stated and badly stated. This is the eighth inopportune moment that is not the right occasion for living the spiritual life.",
    "an8.29:9": "\"These are the eight inopportune moments that are not the right occasions for living the spiritual life.",
    "an8.29:10": "\"There is, bhikkhus, one unique opportune moment that is the right occasion for living the spiritual life. What is it? Here, a Tathāgata has arisen in the world, an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, an Enlightened One, a Blessed One, and the Dhamma leading to peace, nibbāna, and enlightenment is taught as proclaimed by a Fortunate One. And a person has been reborn in the central provinces, and he is wise, intelligent, astute, able to understand the meaning of what has been well stated and badly stated. This, bhikkhus, is the one unique opportune moment that is the right occasion for living the spiritual life.\"",
    "an8.29:11": "Having obtained the human statewhen the good Dhamma has been well proclaimed,those who do not seize the momenthave let the right moment slip by.",
    "an8.29:12": "For many inopportune times are spoken of,occasions obstructive to the path;for it is only sometimes, on occasion,that Tathāgatas arise in the world.",
    "an8.29:13": "If one has directly encountered them,(fortune) rarely gained in the world,if one has obtained the human state,and the good Dhamma is being taught,for a person desiring his own good,this is incentive enough to strive.",
    "an8.29:14": "How can one understand the good Dhamma,so that the moment won’t slip by?For those who miss the moment grievewhen they are reborn in hell.",
    "an8.29:15": "One here who has failed to obtainthe fixed course of the good Dhamma,[n.1690]Saddhammassa niyāmataṁ.Mpglosses as the noble path(ariyaṁ maggaṁ).will come to regret it for a long timelike a merchant who has missed a profit.",
    "an8.29:16": "A person hindered by ignorancewho has failed in the good Dhammawill long experience wandering onin (the round of) birth and death.",
    "an8.29:17": "But those who gain the human statewhen the good Dhamma is well proclaimed,have accomplished the Teacher's word,or will do so, or are doing so now.",
    "an8.29:18": "Those who have practiced the path,proclaimed by the Tathāgata,have penetrated the right moment in the worldthe unsurpassed spiritual life.",
    "an8.29:19": "You should dwell without leakages,guarded, ever-mindful in the restraintstaught by the One with Vision,the Kinsman of the Sun.",
    "an8.29:20": "Having cut off all underlying tendenciesthat follow one drifting in Māra's domain,[n.1691] I read withCeand Eemāradheyyasarānuge, as against Bemāradheyyaparānuge.Mp:\"That accompany saṁsāra, called ‘Māra's realm’\"(māradheyyasaṅkhātaṁ saṁsāraṁ anugate).those who attain the destruction of the taints,though in the world, have gone beyond."
}