{
    "an8.34:1": "\"Bhikkhus, a seed sown in a field that possesses eight factors does not bring forth abundant fruits, itsfruitsare not delectable, and it does not yield a profit. What eight factors?",
    "an8.34:2": "\"So too, bhikkhus, a gift given to ascetics and brahmins who possess eight factors is not of great fruit and benefit, and it is not very brilliant or pervasive. What eight factors? Here, the ascetics and brahmins are of wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, and wrong concentration. A gift given to ascetics and brahmins who possess these eight factors is not of great fruit and benefit, and it is not very brilliant or pervasive.",
    "an8.34:3": "\"Bhikkhus, a seed sown in a field that possesses eight factors brings forth abundant fruits, itsfruitsare delectable, and it yields a profit. What eight factors?",
    "an8.34:4": "\"So too, bhikkhus, a gift given to ascetics and brahmins who possess eight factors is of great fruit and benefit, and it is extraordinarily brilliant and pervasive. What eight factors? Here, the ascetics and brahmins are of right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. A gift given to ascetics and brahmins who possess these eight factors is of great fruit and benefit, and it is extraordinarily brilliant and pervasive.\"",
    "an8.34:5": "When the field is excellent,and the seed sown is excellent,and there is an excellent supply of rain,the yield of grain is excellent.[n.1702] In translating these verses, I alternate between \"accomplishment\" and \"excellence\" as renderings forsampadā, and \"accomplished\" and \"excellent\" as renderings forsampanna. In each case I have let my sense of natural English diction determine the appropriate choice.",
    "an8.34:6": "Its health is excellent;its growthtoois excellent;its maturation is excellent;its fruit truly is excellent.",
    "an8.34:7": "So too when one gives excellent foodto those accomplished in virtuous behavior,it arrives at several kinds of excellence,for what one has done is excellent.",
    "an8.34:8": "Therefore if one desires excellencelet a person here be accomplished;one should resort to those accomplished in wisdom;thus one's own accomplishments flourish.",
    "an8.34:9": "One accomplished in true knowledge and conduct,having gained accomplishment of mind,performs action that is accomplishedand accomplishes the good.",
    "an8.34:10": "Having known the world as it is,one should attain accomplishment in view.One accomplished in mind advancesby relying on accomplishment in the path.",
    "an8.34:11": "Having rubbed off all stains,having attained nibbāna,one is then freed from all sufferings:this is total accomplishment."
}