{
    "an8.80:1": "\"Bhikkhus, there are these eight grounds for laziness. What eight?",
    "an8.80:2": "() \"Again, a bhikkhu has done some work. It occurs to him: ‘I’ve done some work. Because of the work, my body has become tired. Let me lie down.’ He lies down. He does not arouse energy … for the realization of the as-yet-unrealized. This is the second ground for laziness.",
    "an8.80:3": "() \"Again, a bhikkhu has to make a trip. It occurs to him: ‘I have to make a trip. While traveling, my body will become tired. Let me lie down.’ He lies down. He does not arouse energy … for the realization of the as-yet-unrealized. This is the third ground for laziness.",
    "an8.80:4": "() \"Again, a bhikkhu has made a trip. It occurs to him: ‘I’ve made a trip. While traveling, my body has become tired. Let me lie down.’ He lies down. He does not arouse energy … for the realization of the as-yet-unrealized. This is the fourth ground for laziness.",
    "an8.80:5": "() \"Again, a bhikkhu has walked for alms in a village or town but has not gotten as much food as he needs, whether coarse or excellent. It occurs to him:‘I’ve walked for alms in the village or town but didn’t get as much food as I need, whether coarse or excellent. My body has become tired and unwieldy. Let me lie down.’ He lies down. He does not arouse energy … for the realization of the as-yet-unrealized. This is the fifth ground for laziness.",
    "an8.80:6": "() \"Again, a bhikkhu has walked for alms in a village or town and has gotten as much food as he needs, whether coarse or excellent. It occurs to him: ‘I’ve walked for alms in the village or town and gotten as much food as I need, whether coarse or excellent. My body has become as heavy and unwieldy as a heap of wet beans. Let me lie down.’ He lies down. He does not arouse energy … for the realization of the as-yet-unrealized. This is the sixth ground for laziness.",
    "an8.80:7": "() \"Again, a bhikkhu is a little ill. It occurs to him: ‘I’m a little ill. I need to lie down. Let me lie down.’ He lies down. He does not arouse energy … for the realization of the as-yet-unrealized. This is the seventh ground for laziness.",
    "an8.80:8": "() \"Again, a bhikkhu has recovered from illness. Soon after recovering, it occurs to him: ‘I’ve recovered from illness; I’ve just recovered from illness. My body is still weak and unwieldy. Let me lie down.’ He lies down. He does not arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. This is the eighth ground for laziness.",
    "an8.80:9": "\"Bhikkhus, there are these eight grounds for arousing energy. What eight?",
    "an8.80:10": "(2) \"Again, a bhikkhu has done some work. It occurs to him: ‘I’ve done some work. While working, it wasn’t possible for me to attend to the teaching of the Buddhas. Let me arouse energy ….’ This is the second ground for arousing energy.",
    "an8.80:11": "(3) \"Again, a bhikkhu has to make a trip. It occurs to him: ‘I have to make a trip. While traveling, it won’t be easy for me to attend to the teaching of the Buddhas. Let me in advance arouse energy ….’ This is the third ground for arousing energy.",
    "an8.80:12": "(4) \"Again, a bhikkhu has made a trip. It occurs to him: ‘I’ve made a trip. While traveling, it wasn’t possible for me to attend to the teaching of the Buddhas. Let me arouse energy ….’ This is the fourth ground for arousing energy.",
    "an8.80:13": "(5) \"Again, a bhikkhu has walked for alms in a village or town but has not gotten as much food as he needs, whether coarse or excellent. It occurs to him: ‘I’ve walked for alms in a village or town but didn’t get as much food as I need, whether coarse or excellent. My body is light and wieldy. Let me arouse energy ….’ This is the fifth ground for arousing energy.",
    "an8.80:14": "(6) \"Again, a bhikkhu has walked for alms in a village or town and has gotten as much food as he needs, whether coarse or excellent. It occurs to him: ‘I’ve walked for alms in the village or town and gotten as much food as I need, whether coarse or excellent. My body is strong and wieldy. Let me arouse energy ….’ This is the sixth ground for arousing energy.",
    "an8.80:15": "(7) \"Again, a bhikkhu is a little ill. It occurs to him: ‘I’m a little ill. It's possible that my illness will grow worse. Let me in advance arouse energy ….’ This is the seventh ground for arousing energy.",
    "an8.80:16": "(8) \"Again, a bhikkhu has recovered from illness. Soon after recovering, it occurs to him: ‘I’ve recovered from illness, just recovered from illness. It is possible that my illness will return. Let me in advance arouse energy for the attainment of the asyet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.’ He arouses energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet unrealized. This is the eighth ground for arousing energy.",
    "an8.80:17": "\"These are the eight grounds for arousing energy.\""
}