{
    "an8.10:1": "On one occasion the Blessed One was dwelling at Campā on a bank of the Gaggārā Lotus Pond. Now on that occasion bhikkhus were reproving a bhikkhu for an offense. When being reproved, that bhikkhu answered evasively, diverted the discussion to an irrelevant subject, and displayed anger, hatred, and resentment.[n.632]Aññenāññaṁ paṭicarati, bahiddhā kathaṁ apanāmeti, kopañca dosañca appaccayañca pātukaroti.",
    "an8.10:2": "Then the Blessed One addressed the bhikkhus:\"Bhikkhus, eject this person! Bhikkhus, eject this person![n.1633] I read withCeand Beniddhamath’etaṁ…niddhamath’etaṁ, as against Eedhamath’etaṁ…niddhamath’etaṁ.This person should be banished. Why should another's son vex you?[n.1634] All readings of this sentence seem confused. Ce haskiṁ vo paraputto vihethīyati, where the passive verb does not seem to fit. Ee haskiṁ vo paraputtā viheṭheti, which links a plural subject to an active singular verb. Be haskiṁ vo tena paraputtena visodhitena, \"What do you have (to do) with that son of another who has been purified?\" which makes no sense in this context. Ee includes still more variants in its footnotes. I take the required reading to be:kiṁ vo paraputto viheṭheyya.Mpdoes not offer an explanation, but the implication seems to be that the troublesome monk, by his behavior, is not a real disciple of the Buddha and thus can be considered a \"son\" (that is, a disciple) of another teacher.",
    "an8.10:3": "\"Suppose that when a field of barley is growing, some blighted barley would appear that would be just chaff and trash among the barley. As long as its head has not come forth, its roots would be just like those of the othercrops, the good barley; its stem would be just like that of the othercrops, the good barley; its leaves would be just like those of the othercrops, the good barley. When, however, its head comes forth, they know it as blighted barley, just chaffand trash among the barley. Then they pull it up by the root and cast it out from the barley field. For what reason? So that it doesn’t spoil the good barley.",
    "an8.10:4": "\"So too, so long as the bhikkhus do not see his offense, a certain person here has the same manner of going forward … and carrying his outer robe and bowl as the good bhikkhus. When, however, they see his offense, they know him as a corruption among ascetics, just chaff and trash among ascetics. Then they expel him. For what reason? So that he doesn’t corrupt the good bhikkhus.",
    "an8.10:5": "\"Suppose that when a large heap of grain is being winnowed, the grains that are firm and pithy form a pile on one side, and the wind blows the spoiled grains and chaff to another side. Then the owners take a broom and sweep them even further away. For what reason? So that they don’t spoil the good grain.",
    "an8.10:6": "\"Suppose a man needs a gutter for a well. He would take a sharp axe and enter the woods. He would strike a number of trees with the blade of his axe.[n.13]Kuṭhāripāsena.DOPis uncertain about the meaning but suggests it might be the ring or blade of the axe. PED has \"throw of an axe.\"When so struck, the firm and pithy trees would give off a dull sound, but those that are inwardly rotten, corrupt, and decayed would give off a hollow sound. The man would cut this tree down at its foot, cut off the crown, thoroughly clean it out, and use it as a gutter for a well.",
    "an8.10:7": "By living together with him, know him asan angry person with evil desires;a denigrator, obstinate, and insolent,envious, miserly, and deceptive.",
    "an8.10:8": "He speaks to people just like an ascetic,addressing themwith a calm voice,but secretly he does evil deeds,holds pernicious views, and lacks respect.",
    "an8.10:9": "Though he is devious, a speaker of lies,you should know him as he truly is;then you should all meet in harmonyand firmly drive him away.",
    "an8.10:10": "Get rid of the trash!Remove the depraved fellows!Sweep the chaff away, non-asceticswho think themselves ascetics!",
    "an8.10:11": "Having banished those of evil desires,of bad conduct and resort,dwell in communion, ever mindful,the pure with the pure;then, in harmony, alert,you will make an end of suffering."
}