{
    "an8.22:1": "On one occasion the Blessed One was dwelling among the Vajjis at Hatthigāma. There the Blessed One addressed the bhikkhus ….",
    "an8.22:2": "Then, in the morning, a certain bhikkhu dressed, took his bowl and robe, and went to the residence of the householder Ugga of Hatthigāma. When he arrived, he sat down on the seat that was prepared for him. Then the householder Ugga of Hatthigāma approached that bhikkhu, paid homage to him, and sat down to one side. The bhikkhu then said to him:",
    "an8.22:3": "\"I don’t know, Bhante, what eight astounding and amazing qualities the Blessed One declared that I possess. However, there are found in me eight astounding and amazing qualities. Listen and attend closely. I will speak.\"",
    "an8.22:4": "(2) \"With a confident mind, I attended on the Blessed One. The Blessed One then gave me a progressive discourse, that is, a talk on giving, virtuous behavior, and heaven; he revealed the danger, degradation, and defilement of sensual pleasures and the benefit of renunciation. When the Blessed One knew that my mind was pliant, softened, rid of hindrances, uplifted, and confident, herevealed that Dhamma teaching special to the Buddhas: suffering, its origin, its cessation, and the path. Then, just as a clean cloth rid of dark spots would readily absorb dye, so too, while I sat in that same seat, the dust-free, stainless Dhamma-eye arose in me: ‘Whatever is subject to origination is all subject to cessation.’ I saw the Dhamma, attained the Dhamma, understood the Dhamma, fathomed the Dhamma, crossed over doubt, got rid of bewilderment, attained self-confidence, and became independent of others in the teaching of the Teacher. Right there I went for refuge to the Buddha, the Dhamma, and the Saṅgha, and undertook the training rules with celibacy as the fifth.[n.1680a]Brahmacariyapañcamāni sikkhāpadāni. These are the usual five precepts, but with \"abstinence from sexual activity\" replacing \"abstinence from sexual misconduct\" as the third precept.This is the second astounding and amazing quality found in me.",
    "an8.22:5": "(3) \"I had four young wives. I then went to them and said: ‘Sisters, I have undertaken the training rules with celibacy as the fifth. If you want, you can enjoy wealth right here and do merits, or go back to your own family circle, or inform me if you want me to give you over to another man.’ My eldest wife then said to me: ‘Young sir, give me to such and such a man.’ I sent for that man, and with my left hand I took my wife, with my right hand I took the ceremonial vase, and I gave her to that man. But even while giving away my young wife, I don’t recall that any alteration took place in my mind. This is the third astounding and amazing quality found in me.",
    "an8.22:6": "(4) \"My family is wealthy but the wealth is shared unreservedly with virtuous people of good character. This is the fourth astounding and amazing quality found in me.",
    "an8.22:7": "(5) \"Whenever I attend on a bhikkhu, I attend on him respectfully, not without respect. If that venerable one teaches me the Dhamma, I listen to it respectfully, not without respect. If he doesn’t teach me the Dhamma, then I teach him the Dhamma. This is the fifth astounding and amazing quality found in me.",
    "an8.22:8": "(6) \"It isn’t unusual that when the Saṅgha has been invited by mefor a meal, deities come and report to me: ‘That bhikkhu, householder, is liberated in both respects. That one is liberated by wisdom. That one is a body witness. That one is attained to view. That one is liberated by faith. That one is a Dhamma follower. That one is a faith follower. That one is virtuous, of good character. That one is immoral, of bad character.’ Still, when I am serving the Saṅgha, I do not recall thinking: ‘Let me give this one little, let me give that one a lot.’ Rather, I give with an equal mind. This is the sixth astounding and amazing quality found in me.",
    "an8.22:9": "(7) \"It isn’t unusual for deities to come and report to me: ‘‘Householder, the Dhamma is well expounded by the Blessed One.’ I then say to those deities: ‘Whether you deities say so or not, the Dhamma is well expounded by the Blessed One.’ Still, I do not recall any mental exultation arising because deities come to me or because I converse with deities. This is the seventh astounding and amazing quality found in me.",
    "an8.22:10": "(8) \"If I were to pass away before the Blessed One, it wouldn’t be surprising if the Blessed One would declare of me: ‘There is no fetter bound by which the householder Ugga of Hatthigāma might return to this world.’[n.1680] This is an alternative way of declaring oneself to be a non-returner. By saying that he will not return to \"this world\"(imaṁ lokaṁ)he indicates that he has eliminated the five lower fetters, which bind one to this world of sensual desire, and also that he is not yet an arahant, who does not return to any state of being.This is the eighth astounding and amazing quality found in me.",
    "an8.22:11": "\"These, Bhante, are eight astounding and amazing qualities found in me. But I don’t know what eight astounding and amazing qualities the Blessed One declared that I possess.\"",
    "an8.22:12": "Then that bhikkhu, having received almsfood at the residence of the householder Ugga of Hatthigāma, rose from his seat and departed. After his meal, on returning from his alms round, he approached the Blessed One, paid homage to him, sat down to one side, and reported to him the entire conversation he had had with the householder Ugga of Hatthigāma.",
    "an8.22:13": "The Blessed One said:\"Good, good, bhikkhu! I had declared that the householder Ugga of Hatthigāma possesses these same eight astounding and amazing qualities that he rightly explained to you. You should remember the householder Ugga of Hatthigāma as one who possesses these eight astounding and amazing qualities.\""
}