{
    "an8.40:1": "() \"Bhikkhus, the destruction of life, repeatedly pursued, developed, and cultivated, is conducive to hell, to the animal realm, and to the sphere of afflicted spirits; for one reborn as a human being the destruction of life at minimum conduces to a short life span.",
    "an8.40:2": "() \"Taking what is not given, repeatedly pursued, developed, and cultivated, is conducive to hell, to the animal realm, and to the sphere of afflicted spirits; for one reborn as a human being taking what is not given at minimum conduces to loss of wealth.",
    "an8.40:3": "() \"Sexual misconduct, repeatedly pursued, developed, and cultivated, is conducive to hell, to the animal realm, and to the sphere of afflicted spirits; for one reborn as a human being sexual misconduct at minimum conduces to enmity and rivalry.",
    "an8.40:4": "() \"False speech, repeatedly pursued, developed, and cultivated, is conducive to hell, to the animal realm, and to the sphere of afflicted spirits; for one reborn as a human being false speech at minimum conduces to false accusations.",
    "an8.40:5": "() \"Divisive speech, repeatedly pursued, developed, and cultivated, is conducive to hell, to the animal realm, and to the sphere of afflicted spirits; for one reborn as a human being divisive speech at minimum conduces to being divided from one's friends.",
    "an8.40:6": "() \"Harsh speech, repeatedly pursued, developed, and cultivated, is conducive to hell, to the animal realm, and to the sphere of afflicted spirits; for one reborn as a human being harsh speech at minimum conduces to disagreeable sounds.",
    "an8.40:7": "() \"Idle chatter, repeatedly pursued, developed, and cultivated, is conducive to hell, to the animal realm, and to the sphere of afflicted spirits; for one reborn as a human being idle chatter at minimum conduces to others distrusting one's words.",
    "an8.40:8": "() \"Drinking liquor and wine, repeatedly pursued, developed, and cultivated, is conducive to hell, to the animal realm, and to the sphere of afflicted spirits; for one reborn as a human being drinking liquor and wine at minimum conduces to madness.\""
}