{
    "an8.35:1": "\"Bhikkhus, there are these eight kinds of rebirth on account of giving. What eight?",
    "an8.35:2": "() \"Someone else gives a gift to an ascetic or a brahmin: food and drink … and lighting. Whatever he gives, he expects something in return. He has heard: ‘The devasruled bythe four great kingsare long-lived, beautiful, and abound in happiness.’ It occurs to him: ‘Oh, with the breakup of the body, after death, may I be reborn in companionship with the devasruled bythe four great kings!’ He sets his mind on this, fixes his mind on this, and develops this state of mind. That aspiration of his, resolved on what is inferior, not developed higher, leads to rebirth there. With the breakup of the body, after death, he is reborn in companionship with the devasruled bythe four great kings—and that is for one who is virtuous, I say, not for one who is immoral. The heart's wish of one who is virtuous succeeds because of his purity.",
    "an8.35:3": "() –(7) \"Someone else gives a gift to an ascetic or a brahmin: food and drink … and lighting. Whatever he gives, he expects something in return. He has heard: ‘The Tāvatiṁsa devas … the Yāma devas … the Tusita devas … the devas who delight in creation … the devas who control what is created by others are long-lived, beautiful, and abound in happiness.’ It occurs to him: ‘Oh, with the breakup of the body, after death, may I be reborn in companionship with the devas who control what is created by others!’ He sets his mind on this, fixes his mind on this, and develops this state of mind. That aspiration of his, resolved on what is inferior, not developed higher, leads to rebirth there. With the breakup of the body, after death, he is reborn in companionship with the devas who control what is created by others—and that is for one who is virtuous, I say, not for one who is immoral. The heart's wish of one who is virtuous succeeds because of his purity.",
    "an8.35:4": "(8) \"Someone else gives a gift to an ascetic or a brahmin: food and drink … and lighting. Whatever he gives, he expects something in return. He has heard: ‘The devas of Brahmā's companyare long-lived, beautiful, and abound in happiness.’ It occurs to him: ‘Oh, with the breakup of the body, after death, may I be reborn in companionship with the devas of Brahmā's company!’ He sets his mind on this, fixes his mind on this, and develops this state of mind. That aspiration of his, resolved on what is inferior, not developed higher, leads to rebirth there. With the breakup of the body, after death, he is reborn in companionship with the devas of Brahmā's company—and that is for one who is virtuous, I say, not for one who is immoral; for one without lust, not for one with lust.[n.1705]Vītarāgassa, no sarāgassa. This is added because rebirth in the brahmā world requires more than the practice of generosity. It must also be supported by the attainment of jhāna, which arises through the fading away of craving for sensual pleasures.The heart's wish of one who is virtuous succeeds because of his purity."
}