{
    "an8.41:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an8.41:2": "\"Bhikkhus, observed complete in eight factors, the uposatha is of great fruit and benefit, extraordinarily brilliant and pervasive. And how is the uposatha observed complete in eight factors, so that it is of great fruit and benefit, extraordinarily brilliant and pervasive?[n.1713] On the noble ones’ uposatha observance, seeAN3.70.",
    "an8.41:3": "(2) \"‘As long as they live the arahants abandon and abstain from taking what is not given; they take only what is given, expect only what is given, and dwell honestly without thoughts of theft. Today, for this night and day, I too shall abandon and abstain from taking what is not given; I shall accept only what is given, expect only what is given, and dwell honestly without thoughts of theft. I shall imitate the arahants in this respect and the uposatha will be observed by me.’ This is the second factor it possesses.",
    "an8.41:4": "(3) \"‘As long as they live the arahants abandon sexual activity and observe celibacy, living apart, abstaining from sexual intercourse, the common person's practice. Today, for this night and day, I too shall abandon sexual activity and observe celibacy, living apart, abstaining from sexual intercourse, the common person's practice. I shall imitate the arahants in this respect and the uposatha will be observed by me.’ This is the third factor it possesses.",
    "an8.41:5": "(4) \"‘As long as they live the arahants abandon and abstain from false speech; they speak truth, adhere to truth; they are trustworthy and reliable, no deceivers of the world. Today, for this night and day, I too shall abandon and abstain from false speech;I shall speak truth, adhere to truth; I shall be trustworthy and reliable, no deceiver of the world. I shall imitate the arahants in this respect and the uposatha will be observed by me.’ This is the fourth factor it possesses.",
    "an8.41:6": "(5) \"‘As long as they live the arahants abandon and abstain from liquor, wine, and intoxicants, the basis for heedlessness. Today, for this night and day, I too shall abandon and abstain from liquor, wine, and intoxicants, the basis for heedlessness. I shall imitate the arahants in this respect and the uposatha will be observed by me.’ This is the fifth factor it possesses.",
    "an8.41:7": "(6) \"‘As long as they live the arahants eat once a day, abstaining from eating at night and from food outside the proper time. Today, for this night and day, I too shall eat once a day, abstaining from eating at night and from food outside the proper time. I shall imitate the arahants in this respect and the uposatha will be observed by me.’ This is the sixth factor it possesses.",
    "an8.41:8": "(7) \"‘As long as they live the arahants abstain from dancing, singing, instrumental music, and unsuitable shows, and from adorning and beautifying themselves by wearing garlands and applying scents and unguents. Today, for this night and day, I too shall abstain from dancing, singing, instrumental music, and unsuitable shows, and from adorning and beautifying myself by wearing garlands and applying scents and unguents. I shall imitate the arahants in this respect and the uposatha will be observed by me.’ This is the seventh factor it possesses.",
    "an8.41:9": "(8) \"‘As long as they live the arahants abandon and abstain from the use of high and luxurious beds; they lie down on a low resting place, either a small bed or a straw mat. Today, for this night and day, I too shall abandon and abstain from the use of high and luxurious beds; I shall lie down on a low resting place, either a small bed or a straw mat. I shall imitate the arahants in this respectand the uposatha will be observed by me.’ This is the eighth factor it possesses.",
    "an8.41:10": "\"It is in this way, bhikkhus, that the uposatha is observed complete in eight factors, so that it is of great fruit and benefit, extraordinarily brilliant and pervasive.\""
}