{
    "an8.64:1": "On one occasion the Blessed One was dwelling at Gayā on Gayāsīsa. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an8.64:2": "() \"It occurred to me, bhikkhus: ‘If I should perceive a light and also see forms, in such a case this knowledge and vision of mine would become even more purified.’[n.1769]Mp:\"Here, knowledge and vision(ñāṇadassana)is the divine eye(dibbacakkhubhūtaṁ).\"",
    "an8.64:3": "So on a later occasion, as I was dwelling heedful, ardent, and resolute, I perceived a light and also saw forms. Yet I did not associate with those deities, converse with them, and engage in a discussion with them.",
    "an8.64:4": "(3) \"It occurred to me, bhikkhus: ‘If I perceive a light and see forms, and also associate with those deities, converse with them, and engage in a discussion with them, in such a case this knowledge and vision of mine would become even more purified.’",
    "an8.64:5": "So on a later occasion, as I was dwelling heedful, ardent, and resolute, I perceived a light and saw forms, and I also associated with those deities, conversed with them, and engaged in a discussion with them. Yet I did not know about those deities: ‘These deities are from this or that order of devas.’",
    "an8.64:6": "(4) \"It occurred to me, bhikkhus: ‘If I perceive a light and see forms, and associate with those deities, converse with them, and engage in a discussion with them, and also know about those deities: ‘These deities are from this or that order of devas,’ in such a case this knowledge and vision of mine would become even more purified.’",
    "an8.64:7": "So on a later occasion, as I was dwelling heedful, ardent, and resolute, I perceived a light and saw forms, and associated with those deities, conversed with them, and engaged in a discussion with them, and I also knew about those deities: ‘These deities are from this or that order of devas.’ Yet I did not know of those deities: ‘After passing away here these deities were reborn there as a result of this kamma.’",
    "an8.64:8": "() \"It occurred to me, bhikkhus: ‘IfiI perceive a light andiisee forms; andiiiI associate with those deities, converse with them, and engage in a discussion with them; andivknow about those deities: ‘These deities are from this or that order of devas’; andv‘After passing away here, these deities were reborn there as a result of this kamma’; andvi‘As a result of this kamma, these deities subsist on such food and experience such pleasure and pain’; andvii‘As a result of this kamma, these deities have a life span of such length’; andviiialso know whether or not I had previously lived together with those deities, in such a case this knowledge and vision of mine would become even more purified.’",
    "an8.64:9": "\"So on a later occasion, as I was dwelling heedful, ardent, and resolute:iI perceived a light andiisaw forms; andiiiI associated with those deities, conversed with them, and engaged in a discussion with them; andivI also knew about those deities: ‘These deities are from this or that order of devas’; andv‘After passing away here, these deities were reborn there as a result of this kamma’; andvi‘As a result of this kamma, these deities subsist on such food and experience such pleasure and pain’; andvii‘As a result of this kamma, these deities have a life span of such length’; andviiiI also knew whether or not I had previously lived together with those deities.[n.1770]Mpassociates these eight facets respectively with the following eight kinds of higher knowledge: (1) the knowledge of the divine eye, (2) the knowledge of spiritual potency, (3) the knowledge encompassing the minds of others, (4) the knowledge of how beings fare in accordance with their kamma, (5) the knowledge of the future, (6) the knowledge of the present, (7) the knowledge of the past, and (8) the knowledge of past lives.Mpcontinues: \"These are the eight knowledges that have come down in the text. But this sutta should be explained by conjoining these with the insight knowledges, the four path knowledges, the four fruition knowledges, the four reviewing knowledges, the four analytical knowledges, and the six knowledges unique to a Buddha.\"",
    "an8.64:10": "\"So long, bhikkhus, as my knowledge and vision about the devas with its eight facets was not well purified, I did not claim to have awakened to the unsurpassed perfect enlightenment in this world with its devas, Māra, and Brahmā, in this population with its ascetics and brahmins, its devas and humans. But when my knowledge and vision about the devas with its eight facets was well purified, then Iclaimed to have awakened to the unsurpassed perfect enlightenment in this world with … its devas and humans. The knowledge and vision arose in me: ‘Unshakable is my liberation of mind; this is my last birth; now there is no more renewed existence.’\""
}