{
    "an8.12:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Now on that occasion, a number of well-known Licchavis had assembled in the meeting hall and were sitting together speaking in many ways in praise of the Buddha, the Dhamma, and the Saṅgha.",
    "an8.12:2": "On that occasion Sīha the general, a disciple of the Nigaṇṭhas, was sitting in that assembly. It then occurred to him: \"Doubtlessly, he must be a Blessed One, an Arahant, a Perfectly Enlightened One. For a number of these well-known Licchavis have assembled in the meeting hall and are sitting together speaking in many ways in praise of the Buddha, the Dhamma, and the Saṅgha. Let me go see that Blessed One, the Arahant, the Perfectly Enlightened One.\"",
    "an8.12:3": "\"Since you are a proponent of deeds, Sīha, why go see the ascetic Gotama, a proponent of non-doing? For the ascetic Gotama is a proponent of non-doing who teaches his Dhamma for the sake of non-doing and thereby guides his disciples.\"[n.1650] It is strange that Mahāvīra (the Nigaṇṭha Nātaputta) is depicted as making such a statement. The Jains certainly must have known that the Buddha also taught a doctrine of kamma, though different from their own.Mpsays that Nātaputta was extremely displeased at Sīha's request and thought to prevent him from going. His words \"destroyed the joy that had arisen in Sīha, as if striking a stray bull with a stick, extinguishing a burning lamp, or turning over a bowl of food.\"",
    "an8.12:4-5": "On a second occasion, a number of well-known Licchavis had assembled in the meeting hall and were sitting together speaking in many ways in praise of the Buddha, the Dhamma, and the Saṅgha ….All as above, except this is now said to occur \"on a second occasion.\"… On a second occasion, Sīha's determination to go see the Blessed One subsided.",
    "an8.12:6": "On a third occasion, a number of well-known Licchavis had assembled in the meeting hall and were sitting together speaking in many ways in praise of the Buddha, the Dhamma, and the Saṅgha. It then occurred to Sīha: \"Doubtlessly, he must be a Blessed One, an Arahant, a Perfectly Enlightened One. For a number of these well-known Licchavis have assembled in the meeting hall and are sitting together speaking in many ways in praise of the Buddha, the Dhamma, and the Saṅgha. What can the Nigaṇṭhas do to me whether or not I obtain their permission? Without having obtained the permission of the Nigaṇṭhas, let me go see that Blessed One, the Arahant, the Perfectly Enlightened One.\"[n.151] I read withBeand Ee:yannūnāhaṁ anapaloketvā va nigaṇṭhe, as against Ceyannūnāhaṁ anapalokitā va nigaṇṭhe. In the previous sentence, withnigaṇṭhāas subject, the past participlesapalokitā vā anapalokitā vāare appropriate as nominatives in agreement with the subject. In this sentence, whereahaṁis the subject, an absolutive signifying an act of Sīha is preferable.",
    "an8.12:7": "Then, with five hundred chariots, Sīha the general set out from Vesālī in the middle of the day in order to see the Blessed One. He went by carriage as far as the ground was suitable for a carriage, and then dismounted from his carriage and entered the monastery grounds on foot. He approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an8.12:8": "\"I have heard this, Bhante: ‘The ascetic Gotama is a proponent of non-doingwho teaches his Dhamma for the sake of non-doing and thereby guides his disciples.’ Do those who speak thus state what has been said by the Blessed One and not misrepresent him with what is contrary to fact? Do they explain in accordance with the Dhamma so that they would not incur any reasonable criticism or ground for censure?[n.1652] SeeAN3.57, n. 416.For we do not want to misrepresent the Blessed One.\"",
    "an8.12:9": "(1) \"There is, Sīha, a way in which one could rightly say of me: ‘The ascetic Gotama is a proponent of non-doing who teaches his Dhamma for the sake of non-doing and thereby guides his disciples.’[n.1653] InAN8.11accusations §§1, 3–7 are leveled against the Buddha.",
    "an8.12:10": "(2) \"There is a way in which one could rightly say of me: ‘The ascetic Gotama is a proponent of deeds who teaches his Dhamma for the sake of deeds and thereby guides his disciples.’",
    "an8.12:11": "(3) \"There is a way in which one could rightly say of me: ‘The ascetic Gotama is an annihilationist who teaches his Dhamma for the sake of annihilation and thereby guides his disciples.’",
    "an8.12:12": "(4) \"There is a way in which one could rightly say of me: ‘The ascetic Gotama is a repeller who teaches his Dhamma for the sake of repulsion and thereby guides his disciples.’",
    "an8.12:13": "(5) \"There is a way in which one could rightly say of me: ‘The ascetic Gotama is an abolitionist who teaches his Dhamma for the sake of abolition and thereby guides his disciples.’",
    "an8.12:14": "(6) \"There is a way in which one could rightly say of me: ‘The ascetic Gotama is a tormentor who teaches his Dhamma for the sake of torment and thereby guides his disciples.’",
    "an8.12:15": "(7) \"There is a way in which one could rightly say of me: ‘The ascetic Gotama is retiring, one who teaches his Dhamma for the sake of retiring and thereby guides his disciples.’",
    "an8.12:16": "(8) \"There is a way in which one could rightly say of me: ‘The ascetic Gotama is a consoler[n.54] Ce and Be haveassāsako; Ee readsassattho, which means \"consoled.\" I am not quite sure how this is intended as a criticism.who teaches his Dhamma for the sake of consolation and thereby guides his disciples.’",
    "an8.12:17": "(1) \"And in what way, Sīha, could one rightly say of me: ‘The ascetic Gotama is a proponent of non-doingwho teaches his Dhamma for the sake of non-doing and thereby guides his disciples’? For I assert the non-doing of bodily, verbal, and mental misconduct; I assert the non-doing of the numerous kinds of bad unwholesome deeds. It is in this way that one could rightly say of me: ‘The ascetic Gotama is a proponent of non-doing who teaches his Dhamma for the sake of non-doing and thereby guides his disciples.’",
    "an8.12:18": "(2)\"And in what way could one rightly say of me: ‘The ascetic Gotama is a proponent of deeds who teaches his Dhamma for the sake of deeds and thereby guides his disciples’? For I assert good bodily, verbal, and mental conduct; I assert the doing of the numerous kinds of wholesome deeds. It is in this way that one could rightly say of me: ‘The ascetic Gotama is a proponent of deeds who teaches his Dhamma for the sake of deeds and thereby guides his disciples.’",
    "an8.12:19": "(3)\"And in what way could one rightly say of me: ‘The ascetic Gotama is an annihilationist who teaches his Dhamma for the sake of annihilation and thereby guides his disciples’? For I assert the annihilation of lust, hatred, and delusion; I assert the annihilation of the numerous kinds of bad unwholesome qualities. It is in this way that one could rightly say of me: ‘The ascetic Gotama is an annihilationist who teaches his Dhamma for the sake of annihilation and thereby guides his disciples.’",
    "an8.12:20": "(4)\"And in what way could one rightly say of me: ‘The ascetic Gotama is a repeller who teaches his Dhamma for the sake of repulsion and thereby guides his disciples’? For I am repelled by bodily, verbal, and mental misconduct; I am repelled by the acquisition of the numerous kinds of bad unwholesome qualities. It is in this way that one could rightly say of me: ‘The ascetic Gotama is a repeller who teaches his Dhamma for the sake of repulsion and thereby guides his disciples.’",
    "an8.12:21": "(5)\"And in what way could one rightly say of me: ‘The ascetic Gotama is an abolitionist who teaches his Dhamma for the sake of abolition and thereby guides his disciples’? For I teach the Dhamma for the abolition of lust, hatred, and delusion;I teach the Dhamma for the abolition of the numerous kinds of bad unwholesome qualities. It is in this way that one could rightly say of me: ‘The ascetic Gotama is an abolitionist who teaches his Dhamma for the sake of abolition and thereby guides his disciples.’",
    "an8.12:22": "(6)\"And in what way could one rightly say of me: ‘The ascetic Gotama is a tormentor who teaches his Dhamma for the sake of tormenting and thereby guides his disciples’? For I assert that bad unwholesome qualities—bodily, verbal, and mental misconduct—are to be burned up. I say that someone is a tormentor when he has abandoned the bad unwholesome qualities that are to be burned up; when he has cut them off at the root, made them like a palm stump, obliterated them so that they are no more subject to future arising. The Tathāgata has abandoned the bad unwholesome qualities that are to be burned up; he has cut them off at the root, made them like a palm stump, obliterated them so that they are no more subject to future arising. It is in this way that one could rightly say of me: ‘The ascetic Gotama is a tormentor who teaches his Dhamma for the sake of tormenting and thereby guides his disciples.’",
    "an8.12:23": "(7)\"And in what way could one rightly say of me: ‘The ascetic Gotama is retiring, one who teaches his Dhamma for the sake of retiring and thereby guides his disciples’? For I say that someone is retiring when he has abandoned the production of renewed existence, the future bed of the womb; when he has cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising. The Tathāgata has abandoned the production of renewed existence, the future bed of the womb; he has cut it off at the root, made it like a palm stump, obliterated it so that it is no more subject to future arising. It is in this way that one could rightly say of me: ‘The ascetic Gotama is retiring, one who teaches his Dhamma for the sake of retiring and thereby guides his disciples.’",
    "an8.12:24": "(8)\"And in what way could one rightly say of me: ‘The ascetic Gotama is a consoler, one who teaches his Dhamma for the sake of consolation and thereby guides his disciples’? For Iam a consoler with the supreme consolation; I teach the Dhamma for the sake of consolation and thereby guide my disciples. It is in this way that one could rightly say of me: ‘The ascetic Gotama is a consoler, one who teaches his Dhamma for the sake of consolation and thereby guides his disciples.’\"[n.1655]Mp:\"Supreme consolation(paramena assāsena): the four paths and four fruits.\"",
    "an8.12:25": "When this was said, Sīha the general said to the Blessed One: \"Excellent, Bhante! Excellent, Bhante! … Let the Blessed One accept me as a lay follower who from today has gone for refuge for life.\"",
    "an8.12:26": "\"Make an investigation, Sīha! It is good for such well-known people like yourself to make an investigation.\"[n.1656] What follows here, up to \"and become independent of others in the teaching of the Teacher,\" closely matches Upāli's experience atMN 56.65–98, I 379,2–380,10.",
    "an8.12:27": "\"Bhante, I am even more satisfied and pleased with the Blessed One for telling me: ‘Make an investigation, Sīha! It is good for such well-known people like yourself to make an investigation.’ For if the members of other sects were to gain me as their disciple, they would carry a banner all over Vesālī announcing:‘Sīha the general has become our disciple.’ But the Blessed One rather tells me: ‘Make an investigation, Sīha! It is good for such well-known people like yourself to make an investigation.’ So for the second time, Bhante, I go to the Blessed One for refuge, to the Dhamma, and to the Saṅgha of bhikkhus. Let the Blessed One accept me as a lay follower who from today has gone for refuge for life.\"",
    "an8.12:28": "Then the Blessed One gave Sīha the general a progressive discourse, that is, a talk on giving, virtuous behavior, and heaven; he revealed the danger, degradation, and defilement of sensual pleasures and the benefit of renunciation. When the Blessed One knew that Sīha's mind was pliant, softened, rid of hindrances, uplifted, and confident, he revealed that Dhamma teaching special to the Buddhas: suffering, its origin, its cessation, and the path. Then, just as a clean cloth rid of dark spots would readily absorb dye, so too, while Sīha the general sat in that same seat, there arose in him the dust-free, stainless Dhamma-eye: ‘Whatever is subject to origination is all subject to cessation.’",
    "an8.12:29": "Sīha the general became one who had seen the Dhamma, attained the Dhamma, understood the Dhamma, fathomed the Dhamma, crossed over doubt, gotten rid of bewilderment, attained self-confidence, and become independent of others in the teaching of the Teacher. He then said to the Blessed One:",
    "an8.12:30": "Then Sīha addressed a man: \"Go, good man, find some meat ready for sale.\"",
    "an8.12:31": "Then, in the morning, the Blessed One dressed, took his bowl and robe, went to Sīha's residence along with the Saṅgha of bhikkhus, and sat down on the seat prepared for him. Now on that occasion a number of Nigaṇṭhaswentfrom street to street and from square to square in Vesālī, thrashing their arms about and crying out: \"Today Sīha the general has slain a plump animal to prepare a meal for the ascetic Gotama! The ascetic Gotama knowingly uses meatobtained from an animal killedespecially for his sake, the act being done on his account.\"",
    "an8.12:32": "Then a man approached Sīha the general and whispered into his ear: \"Sir, you should know that a number of Nigaṇṭhasare goingfrom street to street and from square to square in Vesālī, thrashing their arms about and crying out: ‘Today Sīha the general has slain a plump animal to prepare a meal for the ascetic Gotama! The ascetic Gotama knowingly uses meatobtained from an animal killedespecially for his sake,a deed done on his account.’\"",
    "an8.12:33": "Then, with his own hands, Sīha the general served and satisfied the Saṅgha of bhikkhus headed by the Buddha with the various kinds of excellent food. Then, when the Blessed One had finished eating and had put away his bowl, Sīha sat down to one side. Then the Blessed One instructed, encouraged, inspired, and gladdened Sīha with a Dhamma talk, after which he rose from his seat and departed."
}