{
    "an8.42:1": "\"Bhikkhus, observed complete in eight factors, the uposatha is of great fruit and benefit, extraordinarily brilliant and pervasive. And how is the uposatha observed complete in eight factors, so that it is of great fruit and benefit, extraordinarily brilliant and pervasive?",
    "an8.42:2": "(8) \"‘As long as they live the arahants abandon and abstain from the use of high and luxurious beds; they lie down on a low resting place, either a small bed or a straw mat. Today, for this night and day, I too shall abandon and abstain from the use of high and luxurious beds; I shall lie down on a low resting place, either a small bed or a straw mat. I shall imitate the arahants in this respect and the uposatha will be observed by me.’ This is the eighth factor it possesses.",
    "an8.42:3": "\"To what extent is it of great fruit and benefit? To what extent is it extraordinarily brilliant and pervasive? Suppose one were to exercise sovereignty and kingship over these sixteen great countries abounding in the seven precious substances, that is, (the countries of) the Angans, the Magadhans, the Kāsis, the Kosalans, the Vajjis, the Mallas, the Cetis, the Vangas, the Kurus, the Pañcālas, the Macchas, the Sūrasenas, the Assakas, the Avantis, the Gandhārans, and the Kambojans: this would not be worth a sixteenth part of the uposatha observance complete in those eight factors. For what reason? Because human kingship is poor compared to celestial happiness.",
    "an8.42:4": "\"For the devas (ruled by) the four great kings, a single night and day is equivalent to fifty human years; thirty such days make up a month, and twelve such months make up a year. The life span of those devas is five hundred such celestial years. It is possible, bhikkhus, for a woman or man who observes the uposatha complete in these eight factors, with the breakup of the body, after death, to be reborn in companionship with the devas (ruled by) the four great kings. It was with reference to this that I said human kingship is poor compared to celestial happiness.",
    "an8.42:5": "\"For the Tāvatiṁsa devas, a single night and day is equivalent to a hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of those devas is a thousand such celestial years.It is possible, bhikkhus, for a woman or man who observes the uposatha complete in these eight factors, with the breakup of the body, after death, to be reborn in companionship with the Tāvatiṁsa devas. It was with reference to this that I said human kingship is poor compared to celestial happiness.",
    "an8.42:6": "\"For the Yāma devas, a single night and day is equivalent to two hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of those devas is two thousand such celestial years. It is possible, bhikkhus, for a woman or man who observes the uposatha complete in these eight factors, with the breakup of the body, after death, to be reborn in companionship with the Yāma devas. It was with reference to this that I said human kingship is poor compared to celestial happiness.",
    "an8.42:7": "\"For the Tusita devas, a single night and day is equivalent to four hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of those devas is four thousand such celestial years. It is possible, bhikkhus, for a woman or man who observes the uposatha complete in these eight factors, with the breakup of the body, after death, to be reborn in companionship with the Tusita devas. It was with reference to this that I said human kingship is poor compared to celestial happiness.",
    "an8.42:8": "\"For the devas who delight in creation, a single night and day is equivalent to eight hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of those devas is eight thousand such celestial years. It is possible, bhikkhus, for a woman or manwho observes the uposatha complete in these eight factors, with the breakup of the body, after death, to be reborn in companionship with the devas who delight in creation. It was with reference to this that I said human kingship is poor compared to celestial happiness.",
    "an8.42:9": "\"For the devas who control what is created by others, a single night and day is equivalent to sixteen hundred human years; thirty such days make up a month, and twelve such months make up a year. The life span of those devas is sixteen thousand such celestial years. It is possible, bhikkhus, for a woman or man who observes the uposatha complete in these eight factors, with the breakup of the body, after death, to be reborn in companionship with the devas who control what is created by others. It was with reference to this that I said human kingship is poor compared to celestial happiness.\"",
    "an8.42:10": "One should not kill living beings or take what is not given;[n.1714]  On the noble ones’ uposatha observance, see3:70.one should not speak falsehood or drink intoxicants;one should refrain from sexual activity, from unchastity;one should not eat at night or at an improper time.",
    "an8.42:11": "One should not wear garlands or apply scents;one should sleep on a (low) bed or a mat on the ground;this, they say, is the eight-factored uposathaproclaimed by the Buddha,who reached the end of suffering.",
    "an8.42:12": "As far as the sun and moon revolve,shedding light, so beautiful to gaze upon,dispellers of darkness, moving through the firmament,they shine in the sky, brightening up the quarters.",
    "an8.42:13": "Whatever wealth exists in this sphere—pearls, gems, and excellent beryl,horn gold and mountain gold,and the natural gold calledhaṭaka—",
    "an8.42:14": "those are not worth a sixteenth partof an uposatha complete in the eight factors,just as all the hosts of stars(do not match) the moon's radiance.",
    "an8.42:15": "Therefore a virtuous woman or man,having observed the uposatha complete in eight factorsand having made merit productive of happiness,blameless goes to a heavenly state."
}