{
    "an8.36:1": "\"Bhikkhus, there are these three bases of meritorious activity. What three? The basis of meritorious activity consisting in giving; the basis of meritorious activity consisting in virtuous behavior; and the basis of meritorious activity consisting in meditative development.",
    "an8.36:2": "(1) \"Here, bhikkhus, someone has practiced the basis of meritorious activity consisting in giving to a limited extent; he has practiced the basis of meritorious activity consisting in virtuous behavior to a limited extent; but he has not undertaken the basis of meritorious activity consisting in meditative development. With the breakup of the body, after death, he is reborn among humans in an unfavorable condition.",
    "an8.36:3": "(2) \"Someone else has practiced the basis of meritorious activity consisting in giving to a middling extent; he has practiced the basis of meritorious activity consisting in virtuous behavior to a middling extent; but he has not undertaken the basis of meritorious activity consisting in meditative development. With the breakup of the body, after death, he is reborn among humans in a favorable condition.",
    "an8.36:4": "(3) \"Someone else has practiced the basis of meritorious activity consisting in giving to a superior extent; he has practiced the basis of meritorious activity consisting in virtuous behaviorto a superior extent; but he has not undertaken the basis of meritorious activity consisting in meditative development. With the breakup of the body, after death, he is reborn in companionship with the devasruled bythe four great kings. There the four great kings, who had practiced superlatively the basis of meritorious activity consisting in giving and the basis of meritorious activity consisting in virtuous behavior surpass the devasruled bythe four great kings in ten respects: in celestial life span, celestial beauty, celestial happiness, celestial glory, and celestial authority; and in celestial forms, sounds, odours, tastes, and tactile objects.",
    "an8.36:5": "(4) \"Someone else has practiced the basis of meritorious activity consisting in giving to a superior extent; he has practiced the basis of meritorious activity consisting in virtuous behavior to a superior extent; but he has not undertaken the basis of meritorious activity consisting in meditative development. With the breakup of the body, after death, he is reborn in companionship with the Tāvatiṁsa devas. There Sakka, ruler of the devas, who had practiced superlatively the basis of meritorious activity consisting in giving and the basis of meritorious activity consisting in virtuous behavior, surpasses the Tāvatiṁsa devas in ten respects: in celestial life span … and tactile objects.",
    "an8.36:6": "(5) \"Someone else has practiced the basis of meritorious activity consisting in giving to a superior extent; he has practiced the basis of meritorious activity consisting in virtuous behavior to a superior extent; but he has not undertaken the basis of meritorious activity consisting in meditative development. With the breakup of the body, after death, he is reborn in companionship with the Yāma devas. There the young deva Suyāma, who had practiced superlatively the basis of meritorious activity consisting in giving and the basis of meritorious activity consisting in virtuous behavior, surpasses the Yāma devas in ten respects: in celestial life span … and tactile objects.",
    "an8.36:7": "(6) \"Someone else has practiced the basis of meritorious activity consisting in giving to a superior extent; he has practiced the basis of meritorious activity consisting in virtuous behavior to a superior extent; but he has not undertaken the basis of meritorious activity consisting in meditative development. With the breakup of the body, after death, he is reborn in companionship with the Tusita devas.There the young deva Santusita, who had practiced superlatively the basis of meritorious activity consisting in giving and the basis of meritorious activity consisting in virtuous behavior, surpasses the Tusita devas in ten respects: in celestial life span … and tactile objects.",
    "an8.36:8": "(7) \"Someone else has practiced the basis of meritorious activity consisting in giving to a superior extent; he has practiced the basis of meritorious activity consisting in virtuous behavior to a superior extent; but he has not undertaken the basis of meritorious activity consisting in meditative development. With the breakup of the body, after death, he is reborn in companionship with the devas who delight in creation. There the young deva Sunimmita, who had practiced superlatively the basis of meritorious activity consisting in giving and the basis of meritorious activity consisting in virtuous behavior, surpasses the devas who delight in creation in ten respects: in celestial life span … and tactile objects.",
    "an8.36:9": "(8) \"Someone else has practiced the basis of meritorious activity consisting in giving to a superior extent; he has practiced the basis of meritorious activity consisting in virtuous behavior to a superior extent; but he has not undertaken the basis of meritorious activity consisting in meditative development. With the breakup of the body, after death, he is reborn in companionship with the devas who control what is created by others. There the young deva Vasavattī, who had practiced superlatively the basis of meritorious activity consisting in giving and the basis of meritorious activity consisting in virtuous behavior, surpasses the devas who control what is created by others in ten respects: in celestial life span, celestial beauty, celestial happiness, celestial glory, and celestial authority; and in celestial forms, sounds, odours, tastes, and tactile objects."
}