{
    "an8.46:1": "On one occasion the Blessed One was dwelling at Kosambī in Ghosita's Park. Now on that occasion the Venerable Anuruddha had gone off to pass the day and was in seclusion when a number of agreeable-bodied deities approached him, paid homage to him, stood to one side, and said to him:[n.76] In relation toAN5.33,Mpidentifies these deities with the \"devas who delight in creation\"(nimmānaratino devā). Mp relates the origin of the present sutta thus: \"It is said that those deities, having examined their own glory, asked themselves: ‘How did we obtain such glory?’ Reflecting, they saw Anuruddha and knew: ‘In the past, when he was a wheel-turning monarch, we were his consorts. We accepted his guidance and thus we have obtained this glory. Let's go. We will bring the elder and (together) we will enjoy(anubhavissāma)this glory.’ Thus during the day they approached Anuruddha.\"",
    "an8.46:2": "Then the Venerable Anuruddha thought: \"May all these deities become blue, of blue complexion, with blue clothes and blue ornaments.\" Having known the Venerable Anuruddha's thought, those deities all became blue, of blue complexion, with blue clothes and blue ornaments.",
    "an8.46:3": "Then the Venerable Anuruddha thought: \"May all these deities become yellow … red … white, of white complexion, with white clothes and white ornaments.\" Having known the Venerable Anuruddha's thought, those deities all became white, of white complexion, with white clothes and white ornaments.",
    "an8.46:4": "Then one of those deities sang, one danced, and one snapped her fingers. Just as, when a musical quintet is well trained and its rhythm well coordinated,[n.1717]Suppaṭipatāḷitassa.Paṭipatāḷitais not in PED, but SED svprati>pratitāla, explained as \"in music, a kind of measure.\"MpCe glossessuppaṭipatāḷitassaaspamāṇena ṭhitabhāvajānanatthaṁ suṭṭhu paṭipatāḷitassa, which I would translate: \"well coordinated for the purpose of maintaining a particular measure.\"and it is composed of skilled musicians, its music is exquisite, tantalizing, lovely, captivating, and intoxicating,just so those deities’ performance was exquisite, tantalizing, lovely, captivating, and intoxicating. Thereupon the Venerable Anuruddha drew in his sense faculties.",
    "an8.46:5": "Then those deities,thinking:\"Master Anuruddha is not enjoyingthis,\" disappeared right on the spot.[n.1718]Tā devatā ‘Na khvayyoanuruddho sādiyatī’ ti tatth’ev’ antaradhāyiṁsu.Mp:\"(The deities thought:) ‘Master Anuruddha does not enjoy our dancing and singing. He closes his eyes and refuses to look at us. Why should we go on dancing and singing?’ Then they disappeared right there.\"",
    "an8.46:6-9": "\"Here, Bhante, I had gone off to pass the day and was in seclusion …He reports everything that happened down to:… Then those deities,thinking:‘Master Anuruddha is not enjoyingthis,’ disappeared right on the spot.",
    "an8.46:10": "\"If she possesses eight qualities, Anuruddha, a woman, with the breakup of the body, after death, is reborn in companionship with the agreeable-bodied deities. What eight?[n.1719] The first five items here are substantially identical with those mentioned atAN5.33, except for the grammatical changes needed to adapt to the context.",
    "an8.46:11": "(2)\"She honors, respects, esteems, and venerates those whom her husband respects—his mother and father, ascetics and brahmins—and when they arrive she offers them a seat and water.",
    "an8.46:12": "(3) \"She is skillful and diligent in attending to her husband's domestic chores, whether knitting or weaving; she possesses sound judgment about them in order to carry out and arrange them properly.",
    "an8.46:13": "(4) \"She finds out what her husband's domestic helpers—whether slaves, messengers, or workers—have done and left undone; she finds out the condition of those who are ill; and she distributes to each an appropriate portion of food.",
    "an8.46:14": "(5) \"She guards and protects whatever income her husband brings home—whether money, grain, silver, or gold[n.1720] I read withEerajataṁ vā jātarūpaṁ vā, as atAN5.33. Neither Ce nor Be includesrajataṁhere but all three editions include it atAN8.49just below.—and she is not a spendthrift, thief, wastrel, or squanderer of his earnings.",
    "an8.46:15": "(6) \"She is a female lay follower who has gone for refuge to the Buddha, the Dhamma, and the Saṅgha.",
    "an8.46:16": "(7) \"She is virtuous, abstaining from the destruction of life, taking what is not given, sexual misconduct, false speech, and liquor, wine, and intoxicants, the basis for heedlessness.",
    "an8.46:17": "(8) \"She is generous, one who dwells at home with a heart devoid of the stain of miserliness, freely generous, openhanded, delighting in relinquishment, devoted to charity, delighting in giving and sharing.",
    "an8.46:18": "\"Possessing these eight qualities, Anuruddha, a woman, with the breakup of the body, after death, is reborn in companionship with the agreeable-bodied deities.\"",
    "an8.46:19": "She does not despise her husband,the man who constantly supports her,who ardently and eagerlyalways brings her whatever she wants.[n.1721] I read withBeand Ee (and Ce atAN5.33)sabbakāmāhāraṁ, as against Cesabbakāmadaṁhere.",
    "an8.46:20": "Nor does a good woman scold her husbandwith speech caused by jealousy;[n.1722] All three editions read hereissāvādena. In contrast, inAN5.33the three read this phrase differently. SeeAN5.33, n. 1010.the wise woman shows venerationto all those whom her husband reveres.",
    "an8.46:21": "She rises early, works diligently,manages the domestic help;she treats her husband in agreeable waysand safeguards the wealth he earns.",
    "an8.46:22": "The woman who fulfills her duties thus,following her husband's will and wishes,is reborn among the devascalled \"the agreeable ones.\""
}