{
    "an8.70:1": "On one occasion the Blessed One was dwelling at Vesālī in the hall with the peaked roof in the Great Wood. Then, in the morning, the Blessed One dressed, took his bowl and robe, and entered Vesālī for alms. When he had walked for alms in Vesālī, after his meal, on returning from his alms round, he addressed the Venerable Ānanda: \"Take a sitting cloth, Ānanda. Let us go to the Cāpāla Shrine for the day's dwelling.\"",
    "an8.70:2": "The Blessed One then went to the Cāpāla Shrine, sat down on the seat that was prepared for him, and said to the Venerable Ānanda:",
    "an8.70:3": "\"Delightful is Vesālī, Ānanda. Delightful is the Udena Shrine, delightful the Gotamaka Shrine, delightful the Sattamba Shrine, delightful the Bahuputta Shrine, delightful the Sārandada Shrine, delightful the Cāpāla Shrine. Whoever, Ānanda, has developed and cultivated the four bases for psychic potency, made them a vehicle and basis, carried them out, consolidated them, and properly undertaken them could, if he so wished, live on for an eon or for the remainder of an eon. The Tathāgata, Ānanda, has developed and cultivated the four bases for psychic potency, made them a vehicle and basis, carried them out, consolidated them, and properly undertaken them. If he so wished, the Tathāgata could live on for an eon or for the remainder of an eon.\"[n.1786]Kappaṁ vā tiṭṭheyya kappāvasesaṁ vā.Mpglosseskappa, \"eon,\" asāyukappa, \"the life eon,\" the full normal life span of human beings at a particular time, presently a hundred years.Kappāvasesa, \"the remainder of the eon,\" is explained as a little more than the normal life span of a hundred years.Mpmentions the view of an elder named Mahāsīva, who held that the Buddha could live on for the rest of the cosmic eon, but Mp cites the old commentary as holding that the \"life eon\" alone is intended(idameva aṭṭhakathāya niyāmitaṁ). Nevertheless, nowhere else in the Nikāyas iskappaused in the sense of a normal human life span, and there seems no compelling reason to ascribe to the word as used here a meaning different from the usual one, that is, a cosmic eon.",
    "an8.70:4": "A second time … A third time the Blessed One addressed the Venerable Ānanda: \"Delightful is Vesālī … Delightful is the Udena Shrine … delightful the Cāpāla Shrine. Whoever, Ānanda, has developed and cultivated the four bases for psychic potency … and properly undertaken them could, if he so wished, live on for an eon or for the remainder of an eon. The Tathāgata, Ānanda, has developed and cultivated the four bases for psychic potency, made them a vehicle and basis, carried them out, consolidated them, and properly undertaken them. If he so wished, the Tathāgata could live on for an eon or for the remainder of an eon..",
    "an8.70:5": "Then the Blessed One addressed the Venerable Ānanda: \"You may go, Ānanda, at your own convenience..",
    "an8.70:6": "\"Bhante, let the Blessed One now attain final nibbāna! Let the Fortunate One now attain final nibbāna! Now is the time, Bhante, for the Blessed One's final nibbāna! These words were uttered, Bhante, by the Blessed One:[n.1788] Interestingly, in the Nikāyas no such conversation between the Buddha and Māra is recorded as having taken place earlier in the Buddha’s life. It is referred to only in this sutta and its parallels atDN1.2, andSN51:10.‘I will not attain final nibbāna, Evil One, until there are bhikkhu disciples of mine who are competent, disciplined, self-confident, attained to security from bondage, learned, upholders of the Dhamma, practicing in accordance with the Dhamma, practicing in the proper way, conducting themselves accordingly; who have learned their own teacher's teaching and can explain it, teach it, proclaim it, establish it, disclose it, analyze it, and elucidate it; who can thoroughly refute in reasoned ways the current tenets of others and teach the antidotal Dhamma.’[n.1789] The expressionpattayogakkhemā,“attained to security from bondage,” is in all three editions of AN but is absent from some (but not all) editions of the text’s parallels in DN and SN mentioned in the preceding note. Since the phrase normally denotes the attainment of arahantship, it seems out of place in a description of the lay disciples. Mp comments on all the other expressions here but this, which suggests it was not present in the version available to the commentator.Mpglossessappāṭihāriyaṁ dhammaṁ desentiwith \"they teach the Dhamma so that it is emancipating\"(yāva niyyānikaṁ katvā dhammaṁ desessanti). Mp-ṭ elaborates: \"They explain the Dhamma in such a way that the doctrines of others are demolished and their own doctrine is established; thus, by citing reasons, it brings attainment of the goal (to be) achieved\"(yathā paravādaṁ bhañjitvā sakavādo patiṭṭhahati,evaṁ hetūdāharaṇehi yathādhigatamatthaṁ sampādetvā dhammaṁ kathessanti).",
    "an8.70:7": "Bhante, let the Blessed One now attain final nibbāna! Let the Fortunate One now attain final nibbāna! Now is the time for the Blessed One's final nibbāna!",
    "an8.70:8": "Bhante, let the Blessed One now attain final nibbāna! Let the Fortunate One now attain final nibbāna! Now is the time for the Blessed One's final nibbāna!",
    "an8.70:9": "Bhante, let the Blessed One now attain final nibbāna! Let the Fortunate One now attain final nibbāna! Now is the time, Bhante, for the Blessed One's final nibbāna!\"",
    "an8.70:10": "Then the Blessed One, at the Cāpāla Shrine, mindful and clearly comprehending, let go his vital force.[n.1790]Āyusaṅkhāraṁ ossaji.Mp:\"Having thoroughly set up mindfulness, having limited it by knowledge, he discarded, abandoned, his vital force. The Blessed One did not relinquish his vital force in the way one drops a clod of earth with one's hand, but he resolved, ‘I will enter fruition attainment for only three more months but not beyond that.’\"And when the Blessed One had let go his vital force, a great earthquake occurred, frightening and terrifying, and peals of thunder shook the sky.",
    "an8.70:11": "\"Comparing the incomparable and continued existence,the sage let go the force of existence.Rejoicing internally, concentrated,he broke his own existence like a coat of armor.\"[n.1791] The verse is difficult, especially the first couplet. It is commented on identically by Spk III 254–55, Sv II 557–58,MpIV 153–54, and Ud-a 329–30. The commentaries offer two interpretations, one takingtulaṁandatulaṁas opposites, the other takingtulaṁas the short present participle (=tulento)andatulaṁandsambhavaṁas the opposites. I adopt the second interpretation.",
    "an8.70:12": "Then it occurred to the Venerable Ānanda: \"This earthquake was indeed powerful! This earthquake was indeed very powerful, frightening and terrifying, and peals of thunder shook the sky! What is the cause and condition for a powerful earthquake?\"",
    "an8.70:13": "Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Bhante, this earthquake was indeed powerful! This earthquake was indeed very powerful, frightening and terrifying, and peals of thunder shook the sky! What, Bhante, is the cause and condition for a powerful earthquake?\"",
    "an8.70:14": "\"Ānanda, there are these eight causes and conditions for a powerful earthquake. What eight.",
    "an8.70:15": "(2) \"Again, there is an ascetic or brahmin who possesses psychic potency and has attained mastery of mind, or a deity who is very powerful and mighty. He has developed a limited perception of earth and a measureless perception of water. He makes this earth shake, shudder, and tremble.[n.1792]Ceand Ee havekampeti,saṅkampeti,sampakampeti. Be adds a fourth verb,sampavedheti, which might be rendered \"makes (it) shudder.\" Just below, non-causative counterparts of the three verbs occur in Ce and Ee:kampati,saṅkampati,sampakampati. Be has a fourth,sampavedhati.This is the second cause and condition for a powerful earthquake.",
    "an8.70:16": "(3) \"Again, when the bodhisatta passes away from the Tusita order and, mindful and clearly comprehending, enters his mother's womb, thisearth shakes, shudders, and trembles. This is the third cause and condition for a powerful earthquake.",
    "an8.70:17": "(4) \"Again, when the bodhisatta, mindful and clearly comprehending, emerges from his mother's womb, this earth shakes, shudders, and trembles. This is the fourth cause and condition for a powerful earthquake.",
    "an8.70:18": "(5) \"Again, when the Tathāgata awakens to the unsurpassed perfect enlightenment, this earth shakes, shudders, and trembles. This is the fifth cause and condition for a powerful earthquake.",
    "an8.70:19": "(6) \"Again, when the Tathāgata sets in motion the unsurpassed wheel of the Dhamma, this earth shakes, shudders, and trembles. This is the sixth cause and condition for a powerful earthquake.",
    "an8.70:20": "(7) \"Again, when the Tathāgata, mindful and clearly comprehending, lets go his vital force, this earth shakes, shudders, and trembles. This is the seventh cause and condition for a powerful earthquake.",
    "an8.70:21": "(8) \"Again, when the Tathāgata attains final nibbāna by the nibbāna element without residue remaining, this earth shakes, shudders, and trembles. This is the eighth cause and condition for a powerful earthquake."
}