{
    "an8.61:1": "\"Bhikkhus, there are these eight kinds of persons found existing in the world. What eight?",
    "an8.61:2": "() \"But when a bhikkhu is dwelling in solitude, living independently, a desire arises in him for gain. He rouses himself, strives, and makes an effort to acquire gain. He acquires gain. Due to that gain, he becomes intoxicated, grows heedless, and drifts into heedlessness. This is called a bhikkhu desirous of gain who rouses himself, strives, and makes an effort to acquire gain, and getting it, becomes intoxicated and heedless: he has fallen away from the good Dhamma.",
    "an8.61:3": "() \"But when a bhikkhu is dwelling in solitude, living independently, a desire arises in him for gain. He does not rouse himself, strive, and make an effort to acquire gain. He does not acquire gain. Due to that lack of gain, he sorrows, languishes, and laments; he weeps beating his breast and becomes confused. This is called a bhikkhu desirous of gain who does not rouse himself, strive, and make an effort to acquire gain, and not getting it, sorrows and laments: he has fallen away from the good Dhamma.",
    "an8.61:4": "() \"But when a bhikkhu is dwelling in solitude, living independently, a desire arises in him for gain. He does not rouse himself, strive, and make an effort to acquire gain. Nevertheless, he acquires gain. Due to that gain, he becomes intoxicated, grows heedless, and drifts into heedlessness. This is called a bhikkhu desirous of gain who does not rouse himself, strive, and make an effort to acquire gain, and getting it, becomes intoxicated and heedless: he has fallen away from the good Dhamma.",
    "an8.61:5": "() \"But when a bhikkhu is dwelling in solitude, living independently, a desire arises in him for gain. He rouses himself, strives, and makes an effort to acquire gain. Nevertheless,he fails to acquire gain. He does not sorrow, languish, and lament due to that lack of gain; he does not weep beating his breast and become confused. This is called a bhikkhu desirous of gain who rouses himself, strives, and makes an effort to acquire gain, and not getting it, does not sorrow and lament: he has not fallen away from the good Dhamma.",
    "an8.61:6": "() \"But when a bhikkhu is dwelling in solitude, living independently, a desire arises in him for gain. He rouses himself, strives, and makes an effort to acquire gain. He acquires gain. He does not become intoxicated, grow heedless, and drift into heedlessness due to that gain. This is called a bhikkhu desirous of gain who rouses himself, strives, and makes an effort to acquire gain, and getting it, does not become intoxicated and heedless: he has not fallen away from the good Dhamma.",
    "an8.61:7": "() \"But when a bhikkhu is dwelling in solitude, living independently, a desire arises in him for gain. He does not rouse himself, strive, and make an effort to acquire gain. He does not acquire gain. He does not sorrow, languish, and lament due to that lack of gain; he does not weep beating his breast and become confused. This is called a bhikkhu desirous of gain who does not rouse himself, strive, and make an effort to acquire gain, and not getting it, does not sorrow and lament: he has not fallen away from the good Dhamma.",
    "an8.61:8": "() \"But when a bhikkhu is dwelling in solitude, living independently, a desire arises in him for gain. He does not rouse himself, strive, and make an effort to acquire gain. Nevertheless, he acquires gain. He does not become intoxicated, grow heedless, and drift into heedlessness due to that gain. This is called a bhikkhu desirous of gain who does not rouse himself, strive, and make an effort to acquire gain, and getting it, does not become intoxicated and heedless: he has not fallen away from the good Dhamma.",
    "an8.61:9": "\"These are the eight kinds of persons found existing in the world.\""
}