{
    "an9.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus: \"Bhikkhus!\"",
    "an9.1:2": "\"Bhikkhus, wanderers of other sects may ask you: ‘What, friends, is the proximate cause for the development of the aids to enlightenment?’ If you are asked thus, how would you answer them?\"",
    "an9.1:3": "\"Then listen, bhikkhus, and attend closely. I will speak.\"",
    "an9.1:4": "\"Bhikkhus, if wanderers of other sects should ask you: ‘What, friends, is the proximate cause for the development of the aids to enlightenment?’ you should answer them as follows.",
    "an9.1:5": "(1) \"‘Here, friends, a bhikkhu has good friends, good companions,good comrades. This is the first proximate cause for the development of the aids to enlightenment.",
    "an9.1:6": "(2) \"‘Again, friends, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them. This is the second proximate cause ….",
    "an9.1:7": "(3) \"‘Again, friends, a bhikkhu gets to hear at will, without trouble or difficulty, talk concerned with the austere life that is conducive to opening up the heart, that is, talk on fewness of desires, on contentment, on solitude, on not getting bound upwith others, on arousing energy, on virtuous behavior, on concentration, on wisdom, on liberation, on the knowledge and vision of liberation. This is the third proximate cause ….",
    "an9.1:8": "(4) \"‘Again, friends, a bhikkhu has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. This is the fourth proximate cause ….",
    "an9.1:9": "(5) \"‘Again, friends, a bhikkhu is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering. This is the fifth proximate cause for the development of the aids to enlightenment.’",
    "an9.1:10": "\"When, bhikkhus, a bhikkhu has good friends, good companions, good comrades, it can be expected of him that he will be virtuous, one who dwells restrained by the Pāṭimokkha … will train in them.",
    "an9.1:11": "\"When a bhikkhu has good friends, good companions, good comrades, it can be expected of him that he will get to hear at will, without trouble or difficulty, talk concerned with the austere life that is conducive to opening up the heart, that is, talk on fewness of desires … on the knowledge and vision of liberation.",
    "an9.1:12": "\"When a bhikkhu has good friends, good companions, good comrades, it can be expected of him that he will arouse energyfor abandoning unwholesome qualities … not casting off the duty of cultivating wholesome qualities.",
    "an9.1:13": "\"When a bhikkhu has good friends, good companions, good comrades, it can be expected of him that he will be wise, possessing the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering.",
    "an9.1:14": "\"Having based himself on these five things, the bhikkhu should develop furtheranotherfour things. (6)The perception ofunattractiveness should be developed to abandon lust. (7) Loving-kindness should be developed to abandon ill will. (8) Mindfulness of breathing should be developed to cut off thoughts. (9) The perception of impermanence should be developed to eradicate the conceit ‘I am.’[n.1822] The conceit \"I am\"(asmimāna)is more subtle than personal-existence view(sakkāyadiṭṭhi). Both are removed by the perception of non-self, but whereas the stream-enterer eliminates personal-existence view, only the arahant eliminates the conceit \"I am.\" On this point seeSN22:89. It seems that personal-the perception of non-self consists in theexistence view has a stronger conceptual underpinning than the conceit \"I am,\" which is more closely connected to existential need and therefore can be eliminated only at arahantship.When one perceives impermanence, the perception of non-self is stabilized.[n.1823]Mp:\"When the characteristic of impermanence is seen, the characteristic of non-self is seen. Among the three characteristics, when one is seen, the other two are also seen. Thus it is said: ‘When one perceives impermanence, the perception of non-self is stabilized.’\" Mp-ṭ, commenting onAN9.3, says: \"One who perceives impermanence(aniccasaññino): one who perceives impermanence by way of the contemplation of impermanence, which occurs thus: ‘All conditioned phenomena are impermanent’ because they cease to be after having existed; because they arise and vanish; because they are fragile; because they are temporary; and because they exclude permanence.The perception of non-self is stabilized(anattasaññā saṇṭhāti): the perception of non-self consists in the contemplation of non-self, which occurs thus: ‘All phenomena are non-self’ because they are coreless; because we have no mastery over them; and because they are alien, void, hollow, and empty. This perception is stabilized, firmly established in the mind.\"One who perceives non-self eradicates the conceit ‘I am,’which isnibbāna in this very life.\""
}