{
    "an9.38:1": "Then two brahmin cosmologists[n.932]Lokāyatikā brāhmaṇā. See SN2:48, II 77. Normally, thelokāyatikāare depicted as materialists; here, however, they seem to be simply speculators about the world.approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, they sat down to one side and said to him:",
    "an9.38:2": "\"Master Gotama, Pūraṇa Kassapa claims to be all-knowing and all-seeing and to have all-embracing knowledge and vision: ‘Whether I am walking, standing, sleeping, or awake, knowledge and vision are constantly and continuously present to me.’ He says thus: ‘With infinite knowledge, I dwell knowing and seeing the world to be infinite.’But Nigaṇṭha Nātaputta also claims to be all-knowing and all-seeing and to have all-embracing knowledge and vision: ‘Whether I am walking, standing, sleeping, and awake, knowledge and vision are constantly and continuously present to me.’ He says thus: ‘With infinite knowledge, I dwell knowing and seeing the world to be finite.’[n.1933] Mahāvīra's view of the world is explained in \"Various topics prepared on Jain History by Dr. K. C. Jain and his team\" (http://www.jainworld.com/literature/jainhistory/chapter4. asp): \"It is with regard to these questions (about the world) that Mahāvīra declared: ‘From these alternatives, you cannot arrive at truth; from these alternatives, you are certainly led (astray). The world is eternal as far as that Part 1s concerned which is the substratum(dravya)of the \"world\"; it is not eternal as far as its ever-changing state is concerned.’ In regard to such questions, Mahāvīra's advice to his disciples was neither to support those who maintained that the world is eternal nor those who advocated that it is not eternal. He would have said the same thing regarding such propositions as the world exists and it does not exist; the world is unchangeable; the world is in constant flux; the world has a beginning; the world has no beginning;the world has an end; the world has no end; etc.\" (my italics).When these two claimants to knowledge make claims that are mutually contradictory, who speaks truthfully and who falsely?\"",
    "an9.38:3": "\"Enough, brahmins, let this be: ‘When these two claimants to knowledge make claims that are mutually contradictory, who speaks truthfully and who falsely?’ I will teach you the Dhamma. Listen and attend closely. I will speak.\"",
    "an9.38:4": "\"Suppose, brahmins, there were four men standing in the four quarters possessing supreme movement[n.193]Belacksparamāya gatiyā, found in Ce and Ee.and speed and a supreme stride. Their speed was like that of a light arrow easily shot by a firm-bowed archer—one trained, skillful, and experienced[n.1935]Daḷhadhammā dhanuggaho sikkhito katahattho katūpāsano. Mp's comments on these terms differs slightly from its comments atAN.5(see p. 1690, notes 72 and 725). HereMpsays: \"Firm-bowed archer(daḷhadhammā dhanuggaho): an archer who has taken up a firm bow. A ‘firm bow’(daḷhadhanu)is called the ‘strength of two thousand’(dvisahassathāmaṁ): a bow to which one can attach an arrow with a head made of some metal such as bronze or lead, etc., fit the arrow notch to the string, grasp the bow handle and draw back the string the full length of the arrow shaft, and shoot the arrow up from the ground.Trained(sikkhito): they have studied the craft in their teacher's clan for ten or twelve years.Skillful(katahattho): one who has simply studied a craft is not yet skillful; they are skillful when they have achieved mastery over it.Experienced(katūpāsano): one who has exhibited his craft in the king's court, etc.\"—across the shadow of a palmyra tree. Their stride was such that it could reach from the eastern ocean to the western ocean. Then the person standing in the eastern quarter would say thus: ‘I will reach the end of the world by traveling.’ Having a life span of a hundred years, living for a hundred years, he might travel for a hundred years without pausing except to eat, drink, chew, and taste, to defecate and urinate, and to dispel fatigue with sleep; yet he would die along the way without having reached the end of the world.[n.1936] As at:5(and SN2:26, I 61–62).Then the person standing in the western quarter would say thus … the person standing in the northern quarter would say thus … the person standing in the southern quarter would say thus: ‘I will reach the end of the world by traveling.’ Having a life span of a hundred years, living for a hundred years, he might travel for a hundred years without pausing except to eat, drink, chew, and taste, to defecate and urinate, and to dispel fatigue with sleep; yet he would die along the way without having reached the end of the world. For what reason? I say, brahmins, that by this kind of running[n.1937] Text hasevarūpāya sandhāvanikāyahere, whereasAN.5hasgamanena.Mpglossespadasā dhāvanena, \"running on foot.\"one cannot know, see, or reach the end of the world. And yet I say that without having reached the end of the world there is no making an end of suffering.",
    "an9.38:5": "\"These five objects of sensual pleasure, brahmins, are called ‘the world’ in the Noble One's discipline. What five? Forms cognizable by the eye that are wished for, desired, agreeable, pleasing, connected with sensual pleasure, tantalizing; sounds cognizable by the ear … odours cognizable by the nose … tastes cognizable by the tongue … tactile objects cognizable by the body that are wished for, desired, agreeable, pleasing, connected with sensual pleasure, tantalizing. These five objects of sensual pleasure are called ‘the world’ in the Noble One's discipline.",
    "an9.38:6": "(1) \"Here, brahmins, secluded from sensual pleasures … a bhikkhu enters and dwells in the first jhāna …. This is called a bhikkhu who, having come to the end of the world, dwells at the end of the world. Others say thus of him: ‘He, too, is included in the world; he, too, is not yet released from the world.’ I also say thus: ‘He, too, is included in the world; he, too, is not yet released from the world.’",
    "an9.38:7": "(2) –(4) \"Again, with the subsiding of thought and examination, a bhikkhu enters and dwells in the second jhāna … the third jhāna … the fourth jhāna …. This is called a bhikkhu who, having come to the end of the world, dwells at the end of the world. Others say thus of him: ‘He, too, is included in the world; he, too, is not yet released from the world.’ I also say thus: ‘He, too, is included in the world; he, too, is not yet released from the world.’",
    "an9.38:8": "(5) \"Again, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving‘space is infinite,’ a bhikkhu enters and dwells in the base of the infinity of space. This is called a bhikkhu who, having come to the end of the world, dwells at the end of the world. Others say thus of him: ‘He, too, is included in the world; he, too, is not yet released from the world.’ I also say thus: ‘He, too, is included in the world; he, too, is not yet released from the world.’",
    "an9.38:9": "(6) –(8) \"Again, by completely surmounting the base of the infinity of space,perceiving‘consciousness is infinite,’ a bhikkhu enters and dwells in the base of the infinity of consciousness …. By completely surmounting the base of the infinity of consciousness,perceiving‘there is nothing,’ a bhikkhu enters and dwells in the base of nothingness …. By completely surmounting the base of nothingness, a bhikkhu enters and dwells in the base of neither-perception-nor-non-perception. This is called a bhikkhu who, having come to the end of the world, dwells at the end of the world. Others say thus of him: ‘He, too, is included in the world; he, too, is not yet released from the world.’ I also say thus: ‘He, too, is included in the world; he, too, is not yet released from the world.’",
    "an9.38:10": "(9) \"Again, by completely surmounting the base of neither-perception-nor-non-perception, a bhikkhu enters and dwells in the cessation of perception and feeling, and having seen with wisdom, his taints are utterly destroyed. This is called a bhikkhuwho, having come to the end of the world, dwells at the end of the world, one who has crossed over attachment to the world.\""
}