{
    "an9.41:1": "Thus have I heard. On one occasion the Blessed One was dwelling among the Mallas near the Mallan town named Uruvelakappa.[n.942] WithBeand Ee, I readmallesu, as against Cemalatesu. SN42:is also set at Uruvelakappa, which is said to be a town of the Mallas (see CDB 348).Then, in the morning, the Blessed One dressed, took his bowl and robe, and entered Uruvelakappa for alms. When he had walked for alms in Uruvelakappa, after his meal, on returning from his alms round, he addressed the Venerable Ānanda: \"You stay right here, Ānanda, while I enter the Great Wood to pass the day.\"",
    "an9.41:2": "Then the householder Tapussa approached the Venerable Ānanda, paid homage to him, sat down to one side, and said to him:",
    "an9.41:3": "\"Bhante Ānanda, we laymen enjoy sensual pleasures, delight in sensual pleasures, take delight in sensual pleasures, and rejoice in sensual pleasures. Renunciation seems like a precipice to us. I have heard that in this Dhamma and discipline there are very young bhikkhus, whose minds launch out upon renunciation and become placid, settled, and liberated in it,[n.194]Mpglossesvimuccatihere as \"liberated from the opposing qualities\"(paccanīkadhammehi ca vimuccati). Since all three editions, with the support ofMp,havevimuccati, I translate in conformity with this reading, but I think it likely that the original reading wasadhimuccati, \"resolved upon\" or \"focused on.\" As the text unfolds with respect to the successive meditative attainments, in each case the bodhisatta isvimuccati/adhimuccatiupon the attainmentbeforehe actually achieves it. In such a context being \"focused on\" rather than \"liberated in\" makes better sense.seeing[n.1944]Cehas the genitive pluralpassataṁ, while Be and Ee have the genitive singularpassato.MpBe haspassatoin the lemma and a genitive plural in the gloss:‘Etaṁ santan ti passatoti etaṁ nekkhammaṁ santaṁ vigatadarathapariḷāhan ti evaṁ passantānaṁ bhikkhūnaṁ.Passatois also found in an older Sinhala edition. Possiblypassatoentered the text through an erroneous transposition from the Buddha’s account below, where the singular is appropriate.it as peaceful. Renunciation, Bhante, is the dividing line between the multitude and the bhikkhus in this Dhamma and discipline.\"[n.1945]Mpinterprets renunciation(nekkhamma)here as \"going forth\"(pabbajjā)into homelessness. But the text itself seems to allow renunciation as an internal quality, implicitly identified with firm attainment of the first jhāna.",
    "an9.41:4": "\"This, householder, is a subject that we should see the Blessed One about. Come, let's go to the Blessed One and report this matter to him. We should retain the Blessed One's explanation in mind.\"",
    "an9.41:5": "\"Yes, Bhante,\" the householder Tapussa replied.",
    "an9.41:6": "Then the Venerable Ānanda, together with the householder Tapussa, went to the Blessed One, paid homage to him, sat down to one side, and said: \"Bhante, this householder Tapussa says: ‘Bhante Ānanda, we laymen enjoy sensual pleasures …andrenunciation seems like a precipice to us ….Butthere are very young bhikkhus whose minds …areliberated in it, seeing it as peaceful. Renunciation, Bhante, is the dividing line between the multitude and the bhikkhus in this Dhamma and discipline.’\"",
    "an9.41:7": "\"So it is, Ānanda! So it is, Ānanda![n.1946] I follow the section divisions ofEe,which conform to the paragraph divisions in Be and show the transitions in the discourse better than the divisions in Ce.",
    "an9.41:8": "(2) \"Then, Ānanda, it occurred to me: ‘With the subsiding of thought and examination, let me enter and dwell in the second jhāna ….’ Yet my mind did not launch out upon the absence of thought and become placid, settled, and liberated in it, though I saw it as peaceful. It occurred to me: ‘Why is it that my mind does not launch out upon the absence of thought and become placid, settled, and liberated in it, though I see it as peaceful?’ Then it occurred to me: ‘I have not seen the danger in thoughts and have not cultivated thatinsight; I have not achieved the benefit in the absence of thoughtand have not pursued it. Therefore my mind does not launch out upon the absence of thought and become placid, settled, and liberated in it, though I see it as peaceful.’",
    "an9.41:9": "(3) \"Then, Ānanda, it occurred to me: ‘With the fading away as well of rapture … let me enter and dwell in the third jhāna ….’ Yet my mind did not launch out upon the absence of rapture and become placid, settled, and liberated in it, though I saw it as peaceful. It occurred to me: ‘Why is it that my mind does not launch out upon the absence of rapture and become placid, settled,and liberated in it, though I see it as peaceful?’ Then it occurred to me: ‘I have not seen the danger in rapture and have not cultivated thatinsight; I have not achieved the benefit in the absence of rapture and have not pursued it. Therefore my mind does not launch out upon the absence of rapture and become placid, settled, and liberated in it, though I see it as peaceful.’",
    "an9.41:10": "(4) \"Then, Ānanda, it occurred to me: ‘With the abandoning of pleasure and pain … let me enter and dwell in the fourth jhāna ….’ Yet my mind did not launch out upon the absence of pleasure and pain and become placid, settled, and liberated in it, though I saw it as peaceful. It occurred to me: ‘Why is it that my mind does not launch out upon the absence of pleasure and pain and become placid, settled, and liberated in it, though I see it as peaceful?’ Then it occurred to me: ‘I have not seen the danger in the pleasureconnected withequanimity and have not cultivated thatinsight; I have not achieved the benefit in the absence of pleasure and pain and have not pursued it. Therefore my mind does not launch out upon the absence of pleasure and pain and become placid, settled, and liberated in it, though I see it as peaceful.’",
    "an9.41:11": "(5) \"Then, Ānanda, it occurred to me: ‘With the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving\"space is infinite,\" let me enter and dwell in the base of the infinity of space.’ Yet my mind did not launch out upon the base of the infinity of space and become placid, settled, and liberated in it, though I saw it as peaceful. It occurred to me: ‘Why is it that my mind does not launch out upon the base of the infinity of space and become placid, settled, and liberated in it, though I see it as peaceful?’ Then it occurred to me: ‘I have not seen the danger in forms and have not cultivated thatinsight; I have not achieved the benefit in the base of the infinity of space and have not pursued it. Therefore my mind does not launch out upon the base of the infinity of space and become placid, settled, and liberated in it,though I see it as peaceful.’",
    "an9.41:12": "(6) \"Then, Ānanda, it occurred to me: ‘By completely surmounting the base of the infinity of space,perceiving\"consciousness is infinite,\" let me enter and dwell in the base of the infinity of consciousness.’ Yet my mind did not launch out upon the base of the infinity of consciousness and become placid, settled, and liberated in it, though I saw it as peaceful. It occurred to me: ‘Why is it that my mind does not launch out upon the base of the infinity of consciousness and become placid, settled, and liberated in it, though I see it as peaceful?’ Then it occurred to me: ‘I have not seen the danger in the base of the infinity of space and have not cultivated thatinsight; I have not achieved the benefit in the base of the infinity of consciousness and have not pursued it. Therefore my mind does not launch out upon the base of the infinity of consciousness and become placid, settled, and liberated in it, though I see it as peaceful.’",
    "an9.41:13": "(7) \"Then, Ānanda, it occurred to me: ‘By completely surmounting the base of the infinity of consciousness,perceiving\"there is nothing,\" let me enter and dwell in the base of nothingness.’ Yet my mind did not launch out upon the base of nothingness and become placid, settled, and liberated in it, though I saw it as peaceful. It occurred to me: ‘Why is it that my mind does not launch out upon the base of nothingness and become placid, settled, and liberated in it, though I see it as peaceful?’ Then it occurred to me: ‘I have not seen the danger in the base of the infinity of consciousness and have not cultivated thatinsight; I have not achieved the benefit in the base of nothingness and have not pursued it. Therefore my mind does not launch out upon the base of nothingness and become placid, settled, and liberated in it, though I see it as peaceful.’",
    "an9.41:14": "(8) \"Then, Ānanda, it occurred to me: ‘By completely surmounting the base of nothingness, let me enter and dwell in the base of neither-perception-nor-non-perception.’ Yet my mind did not launch out upon the base of neither-perception-nor-non-perception and become placid, settled, and liberated in it, though I saw it as peaceful. It occurred to me: ‘Why is it that my mind does not launch out upon the base of neither-perceptionnor-non-perception and become placid, settled, and liberated in it, though I see it as peaceful?’ Then it occurred to me: ‘I have not seen the danger in the base of nothingness and have not cultivated thatinsight; I have not achieved the benefit in the base of neither-perception-nor-non-perception and have not pursued it. Therefore my mind does not launch out upon the base of neither-perception-nor-non-perception and become placid, settled, and liberated in it, though I see it as peaceful.’",
    "an9.41:15": "(9) \"Then, Ānanda, it occurred to me: ‘By completely surmounting the base of neither-perception-nor-non-perception, let me enter and dwell in the cessation of perception and feeling.’ Yet my mind did not launch out upon the cessation of perception and feeling and become placid, settled, and liberated in it, though I saw it as peaceful. It occurred to me: ‘Why is it that my mind does not launch out upon the cessation of perception and feeling and become placid, settled, and liberated in it, though I see it as peaceful?’ Then it occurred to me: ‘I have not seen the danger in the base of neither-perception-nor-non-perception and have not cultivated thatinsight; I have not achieved the benefit in the cessation of perception and feeling and have not pursued it. Therefore my mind does not launch out upon the cessation of perception and feeling and become placid, settled, and liberated in it, though I see it as peaceful.’",
    "an9.41:16": "\"So long, Ānanda, as I did not attain and emerge from these nine attainments of progressive dwellings in direct order and reverse order, I did not claim to have awakened to the unsurpassed perfect enlightenment in this world with its devas, Māra, and Brahmā, in this population with its ascetics and brahmins, its devas and humans. But when I attained and emerged from these nine attainments of progressive dwellings in direct order and reverse order, then I claimed to have awakened to the unsurpassed perfect enlightenment in this world with … its devas and humans. The knowledge and vision arose in me: ‘Unshakable is my liberation of mind; this is my last birth; now there is no more renewed existence.’\""
}