{
    "an9.6:1": "There the Venerable Sāriputta addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an9.6:2": "\"Friends, persons should be understood to be twofold: those to be associated with and those not to be associated with.[n.1844] Although the text puts the subject in the singular, I have used the plural, which sounds more natural in English. The text uses the same future participle,sevitabbaṁ(and its negation,asevitabbaṁ), in relation to each subject, but I render it differently as best fits each particular case. The verbsevati, on which the participle is based, has a wide raṅge of meanings and can support all these renderings.Robes, too, should be understood to be twofold: those to be used and those not to be used. Almsfood … Lodgings, too, should be understood to be twofold: those to be used and those not to be used. Villages or towns should be understood to be twofold: those to be resorted to andthose not to be resorted to. Countries or regions should be understood to be twofold: those to be resorted to and those not to be resorted to.",
    "an9.6:3": "(1) \"When it was said: ‘Persons, friends, should be understood to be twofold: those to be associated with and those not to be associated with,’ for what reason was this said? If one knows of a person: ‘When I associate with this person, unwholesome qualities increase in me and wholesome qualities decline; and the requisites of life that should be obtained by one gone forth—robes, almsfood, lodging, and medicines and provisions for the sick—are obtained with difficulty; and the goal of the ascetic life for the sake of which I have gone forth from the household life into homelessness does not reach fulfillment by development for me,’ in that case one should depart from that person any time night or day,[n.1845]Rattibhāgaṁ vā divasabhāgaṁ vā.Mp:\"Having known (this) some time at night, one should leave that very night. But if at night there is danger of attack by wild beasts, etc., one may wait until dawn. Having known (this) some time during the day, one should leave that very day. But if there is danger during the day, one may wait until sunset.\"even without taking leave of him. One should not continue to follow him.[n.1846] I preferEe,which does not includesaṅkhā pi, \"having reflected,\" in the first alternative. Ce and Be both includesaṅkhā piin the first three sections. It seems, however, that reflection only becomes pertinent when there is tension between advantages and disadvantages, as in the second and third alternatives. Since the first alternative poses both material and spiritual disadvantages to staying, the proper choice is immediately evident and does not require reflection.MN 17, I 104–8, which is partly parallel to this sutta, provides a check on the readings.MN 17.2(in Ce, Be, and Ee readings; Ee at I 105,8–10) supports the absence ofsaṅkhā piin Ee text of AN.",
    "an9.6:4": "(2) \"If one knows of a person: ‘When I associate with this person, unwholesome qualities increase in me and wholesome qualities decline; but the requisites of life that should be obtained by one gone forth—robes, almsfood, lodging, and medicines and provisions for the sick—are obtained without difficulty; but still, the goal of the ascetic life, for the sake of which I have gone forth from the household life into homelessness, does not reach fulfillment by development for me,’ in that case, having reflected, one should depart from that person after taking leave of him.[n.187] I read here withEeāpucchā, as against Ce and Beanāpucchā.MN 17.3, in Ce and Be, haveāpucchā, while Ee has neither (at I 105,28 — 29). It would be proper for the bhikkhu to take leave of the person on whom he has been relying—his preceptor or teacher—since the person has at least been kind enough to provide for his material needs. Further, the omission here of the wordsrattibhāgaṁ vā divasabhāgaṁ vā, \"any time night or day,\" suggests there must also be a difference in the manner of departing.One should not continue to follow him.",
    "an9.6:5": "(3) \"If one knows of a person: ‘When I associate with this person, unwholesomequalities decline in me and wholesome qualitie s increase; but the requisites of life that should be obtained by one gone forth—robes, almsfood, lodging, and medicines and provisions for the sick—are obtained with difficulty; still, the goal of the ascetic life, for the sake of which I have gone forth from the household life into homelessness, reaches fulfillment by development for me,’ in that case, having reflected, one should continue to follow that person. One should not depart from him.",
    "an9.6:6": "(4) \"If one knows of a person: ‘When I associate with this person, unwholesome qualities decline in me and wholesome qualities increase; and the requisites of life that should be obtained by one gone forth—robes, almsfood, lodging, and medicines and provisions for the sick—are obtained without difficulty; and the goal of the ascetic life, for the sake of which I have gone forth from the household life into homelessness, reaches fulfillment by development for me,’ in that case one should continue to follow that person as long as one lives. One should not depart from him even if one is dismissed.",
    "an9.6:7": "(5) \"When it was said: ‘Robes, friends, should be understood to be twofold: those to be used and those not to be used,’ for what reason was this said? If one knows of a robe: ‘When I use this robe, unwholesome qualities increase in me and wholesome qualities decline,’ one should not use such a robe. But if one knows of a robe: ‘When I use this robe, unwholesome qualities decline in me and wholesome qualities increase,’ one should use such a robe.When it was said: ‘Robes, friends, should be understood to be twofold: those to be used and those not to be used,’ it is because of this that this was said.",
    "an9.6:8": "(6) \"When it was said: ‘Almsfood, friends, should be understood to be twofold: that to be used and that not to be used,’ for what reason was this said? If one knows of some almsfood: ‘When I use this almsfood, unwholesome qualities increase in me and wholesome qualities decline,’ one should not use such almsfood. But if one knows of some almsfood: ‘When I use this almsfood, unwholesome qualities decline in me and wholesome qualities increase,’ one should use such almsfood. When it was said: ‘Almsfood, friends, should be understood to be twofold: that to be used and that not to be used,’ it is because of this that this was said.",
    "an9.6:9": "(7) \"When it was said: ‘Lodgings, friends, should be understood to be twofold: those to be used and those not to be used,’ for what reason was this said? If one knows of a lodging: ‘When I use this lodging, unwholesome qualities increase in me and wholesome qualities decline,’ one should not use such a lodging. But if one knows of a lodging: ‘When I use this lodging, unwholesome qualities decline in me and wholesome qualities increase,’ one should use such a lodging. When it was said: ‘Lodgings, friends, should be understood to be twofold: those to be used and those not to be used,’ it is because of this that this was said.",
    "an9.6:10": "(8) \"When it was said: ‘Villages or towns, friends, should be understood to be twofold: those to be resorted to and those not to be resorted to,’ for what reason was this said? If one knows of a village or town: ‘When I resort to this village or town, unwholesome qualities increase in me and wholesome qualities decline,’ one should not resort to such a village or town. But if one knows of a village or town: ‘When I resort to this villageor town, unwholesome qualities decline in me and wholesome qualities increase,’ one should resort to such a village or town. When it was said: ‘Villages or towns, friends, should be understood to be twofold: those to be resorted to and those not to be resorted to,’ it is because of this that this was said.",
    "an9.6:11": "(9) \"When it was said: ‘Countries or regions, friends, should be understood to be twofold: those to be resorted to and those not to be resorted to,’ for what reason was this said? If one knows of a country or region: ‘When I resort to this country or region, unwholesome qualities increase in me and wholesome qualities decline,’ one should not resort to such a country or region. But if one knows of a country or region: ‘When I resort to this country or region, unwholesome qualities decline in me and wholesome qualities increase,’ one should resort to such a country or region. When it was said: ‘Countries or regions, friends, should be understood to be twofold: those to be resorted to and those not to be resorted to,’ it is because of this that this was said.\""
}