{
    "an9.3:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Cālikā on Mount Cālikā.[n.830]Mpsays that Cālikā was the name of a city and nearby was a mountain also called Cālikā. They had built a large monastery there and the Blessed One had been dwelling in the monastery, supported by the city.Now on that occasion the Venerable Meghiya was the Blessed One's attendant. Then the Venerable Meghiya approached the Blessed One, paid homage to him, stood to one side, and said to him: \"Bhante, I would like to enter Jantugāma for alms.\"",
    "an9.3:2": "Then, in the morning, the Venerable Meghiya dressed, took his bowl and robe, and entered Jantugāma for alms. When he had walked for alms in Jantugāma, after his meal, on returning from his alms round, he went to the bank of the Kimikālā River. As he was walking and wandering around for exercise along the bank of the Kimikālā River, the Venerable Meghiya sawa lovely and delightful mango grove. It occurred to him: \"This mango grove is truly lovely and delightful, suitable for the striving of a clansman intent on striving. If the Blessed One permits me, I will come back to this mango grove to strive.\"",
    "an9.3:3": "Then the Venerable Meghiya approached the Blessed One, paid homage to him, sat down to one side, and said:",
    "an9.3:4": "\"This morning, Bhante, I dressed, took my bowl and robe, and entered Jantugāma for alms ….All as above, but in the first person.… I thought: ‘This mango grove is truly lovely and delightful, suitable for the striving of a clansman intent on striving. If the Blessed One permits me, I will go back to that mango grove to strive.’ So if the Blessed One would permit me, I will go back to that mango grove to strive.\"",
    "an9.3:5": "A second time the Venerable Meghiya said to the Blessed One: \"Bhante, for the Blessed One there is nothing further to be done and noneed toincrease what has been done.[n.1832] Actually, what occurs \"a second time\" is only the request for permission, not the full statement.Mp:\"There is nothing further to be done(natthi kiñci uttariṁ karaṇīyaṁ): because the four functions have been done respecting the four truths.And no[need]to increase what has been done(katassa vā paṭicayo): no repetition of what he has attained. For the path already developed is not developed again, and there is no repeated abandoning of abandoned defilements.\"But, Bhante, I have something further to be done andneed toincrease what has been done. If the Blessed One would permit me, I will go back to that mango grove to strive.\"",
    "an9.3:6": "A third time the Venerable Meghiya said to the Blessed One: \"Bhante, for the Blessed One there is nothing further to be done and noneed toincrease what has been done. But, Bhante, I have something further to be done andneed toincrease what has been done. If the Blessed One would permit me, I will go back to that mango grove to strive.\"",
    "an9.3:7": "Then the Venerable Meghiya rose from his seat, paid homage to the Blessed One, circumambulated him keeping the right side toward him, and went to the mango grove. He entered and sat down at the foot of a tree to pass the day. Then, while the Venerable Meghiya was dwelling in that mango grove, three kinds of bad unwholesome thoughts frequently occurred to him: sensual thoughts, thoughts of ill will, and thoughts of harming. It then occurred to him: \"This is truly astounding and amazing! I have gone forth out of faith from the household life into homelessness, yet I am still stalked by these three kinds of bad unwholesome thoughts: sensual thoughts, thoughts of ill will, and thoughts of harming.\"[n.1833]Mp:\"In five hundred successive lives he had been a king. There had been a stone slab there where he used to sit. He had come accompanied by three troops of dancing girls to amuse himself in the park. From the time Meghiya sat down there, it seemed as if he were no longer a monk but a king sitting on a regal couch beneath a white parasol, surrounded by his retinue of dancing girls. As he enjoyed his splendor, sensual thoughts arose in him. Just then, he seemed to see two thieves who had been arrested by his men and brought before him. In ordering one to be executed, thoughts of ill will arose in him; and in ordering the other to be imprisoned, thoughts of harming arose. Thus he was enveloped by those unwholesome thoughts like a tree by creepers, or like a honey-eater by honey bees.\"",
    "an9.3:8": "Then the Venerable Meghiya approached the Blessed One, paid homage to him, sat down to one side, and said:",
    "an9.3:9": "\"Here, Bhante, while I was dwelling in that mango grove, three kinds of bad unwholesome thoughts frequently occurred to me: sensual thoughts, thoughts of ill will, and thoughts of harming. It then occurred to me: ‘This is truly astounding and amazing! I have gone forth out of faith from the household life into homelessness, yetI am still stalked by these three kinds of bad unwholesome thoughts: sensual thoughts, thoughts of ill will, and thoughts of harming.’\"",
    "an9.3:10": "\"Meghiya, when liberation of mind has not matured, five things lead to its maturation.[n.1834]Mp:\"Liberation of mind(cetovimutti): liberation of mind from defilements. In the preliminary phase of practice, the mind is liberated from defilements by way of (liberation in) a particular respect(tadaṅgavasena)and by way of suppression(vikkhambhanavasena). In the subsequent phase, it is liberated by way of eradication(samucchedavasena)and by way of tranquilization(paṭipassaddhivasena). When the dispositions have been awakened and matured, insight gives rise to the path, and as insight reaches maturity, liberation of mind is said to have matured. But in their absence it has not yet matured.\"What five?",
    "an9.3:11": "(2) \"Again, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha, possessed of good conduct and resort, seeing danger in minute faults. Having undertaken the training rules, he trains in them. When liberation of mind has not matured, this is the second thing that leads to its maturation.",
    "an9.3:12": "(3) \"Again, a bhikkhu gets to hear at will, without trouble or difficulty, talk concerned with the austere life that is conducive to opening up the heart, that is, talk on fewness of desires, on contentment, on solitude, on not getting bound upwith others, on arousing energy, on virtuous behavior, on concentration, on wisdom, on liberation, on the knowledge and vision of liberation. When liberation of mind has not matured, this is the third thing that leads to its maturation.",
    "an9.3:13": "(4) \"Again, a bhikkhu has aroused energy for abandoning unwholesome qualities and acquiring wholesome qualities; he is strong, firm in exertion, not casting off the duty of cultivating wholesome qualities. When liberation of mind has not matured, this is the fourth thing that leads to its maturation.",
    "an9.3:14": "(5) \"Again, a bhikkhu is wise; he possesses the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering. When liberation of mind has not matured, this is the fifth thing that leads to its maturation.",
    "an9.3:15": "\"When, Meghiya, a bhikkhu has good friends, good companions, good comrades, it can be expected of him that he will be virtuous, one who dwells restrained by the Pāṭimokkha …… will train in them.",
    "an9.3:16": "\"When a bhikkhu has good friends, good companions, good comrades, it can be expected of him that he will get to hear at will, without trouble or difficulty, talk concerned with the austere life that is conducive to opening up the heart, that is, talk on fewness of desires … on the knowledge and vision of liberation.",
    "an9.3:17": "\"When a bhikkhu has good friends, good companions, good comrades, it can be expected of him that he will arouse energy for abandoning unwholesome qualities … not casting off the duty of cultivating wholesome qualities.",
    "an9.3:18": "\"When a bhikkhu has good friends, good companions, good comrades, it can be expected of him that he will be wise, possessing the wisdom that discerns arising and passing away, which is noble and penetrative and leads to the complete destruction of suffering.",
    "an9.3:19": "\"Having based himself on these five things, the bhikkhu should develop furtheranotherfour things. (6)The perception ofunattractiveness should be developed to abandon lust. (7) Loving-kindness should be developed to abandon ill will. (8) Mindfulness of breathing should be developed to cut off thoughts. (9) The perception of impermanence should be developed to eradicate the conceit ‘I am.’ When one perceives impermanence, the perception of non-self is stabilized. One who perceives non-self eradicates the conceit ‘I am,’which isnibbāna in this very life.\""
}