{
    "an9.33:1": "\"Bhikkhus, I will teach the attainment of these nine progressive dwellings.[n.903]Anupubbavihārasamāpattiyo. It is uncertain whether, in this compound,vihārasamāpattiyoshould be interpreted as advanda(\"dwellings and attainments\") or as atappurisa(\"attainments of dwellings\").Mp,with its glossanupaṭipāṭiyā samāpajjitabbavihārā, \"dwellings to be attained in proper sequence,\" suggests it is atappurisa.Listen …. And what, bhikkhus, is the attainment of the nine progressive dwellings?",
    "an9.33:2": "() \"I say ofthat statewhere thought and examination cease and of those who dwell having thoroughly ended thought and examination: ‘Surely, those venerable ones are hungerless and quenched, have crossed over and gone beyond in that particular respect.’ If anyone should say: ‘Where do thought and examination cease? And who are those that dwell having thoroughly ended thought and examination? I do not know this, I do not see this,’ he should be told: ‘Here, friend, with the subsiding of thought and examination, a bhikkhu enters and dwells in the second jhāna …. That is where thought and examination cease, and those are the ones who dwell having thoroughly ended thought and examination.’ Surely, bhikkhus, one who is not crafty or hypocritical should delight and rejoice in this statement, saying: ‘Good!’ Having done so, bowing in reverential salutation, he should attend upon them.",
    "an9.33:3": "() \"I say ofthat statewhere rapture ceases and of those who dwell having thoroughly ended rapture: ‘Surely, those venerable ones are hungerless and quenched, have crossed over and gone beyond in that particular respect.’ If anyone should say: ‘Where does rapture cease? And who are those that dwell having thoroughly ended rapture? I do not know this, I do not see this,’ he should be told: ‘Here, friend, with the fading away as well of rapture … he enters and dwells in the third jhāna …. That is where rapture ceases and those are the oneswho dwell having thoroughly ended rapture.’ Surely, bhikkhus, one who is not crafty or hypocritical should delight and rejoice in this statement, saying: ‘Good!’ Having done so, bowing in reverential salutation, he should attend upon them.",
    "an9.33:4": "() \"I say ofthat statewhere the pleasureconnected withequanimity ceases and of those who dwell having thoroughly ended the pleasureconnected withequanimity:[n.1906]Upekkhāsukha.Mpdoes not comment, but I take the compound to be atappurisarather than thedvanda\"equanimity and pleasure.\" In the fourth jhāna and beyondupekkhā, equanimity, continues but it is no longer accompanied bysukha, pleasant feeling.‘Surely, those venerable ones are hungerless and quenched, have crossed over and gone beyond in that particular respect. If anyone should say: ‘Where does the pleasureconnected withequanimity cease? And who are those that dwell having thoroughly ended the pleasureconnected withequanimity? I do not know this, I do not see this,’ he should be told: ‘Here, friend, with the abandoning of pleasure and pain … a bhikkhu enters and dwells in the fourth jhāna …. That is where the pleasureconnected withequanimity ceases and those are the ones who dwell having thoroughly ended the pleasureconnected withequanimity.’ Surely, bhikkhus, one who is not crafty or hypocritical should delight and rejoice in this statement, saying: ‘Good!’ Having done so, bowing in reverential salutation, he should attend upon them.",
    "an9.33:5": "() \"I say ofthat statewhere perceptions of forms cease and of those who dwell having thoroughly ended perceptions of forms:[n.1907] Ce and Ee have the plural verbnirujjhantihere, but the singularnirujjhatiin §§6–8. Be has the singularnirujjhatihere as well. Again, the subjectrūpasaññācan be read as either singular or plural.‘Surely, those venerable ones are hungerless and quenched, have crossed over and gone beyond in that particular respect.’ If anyone should say: ‘Where do perceptions of forms cease? And who are those that dwell having thoroughly ended perceptions of forms? I do not know this, I do not see this,’ he should be told: ‘Here, friend, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving\"space is infinite,\" a bhikkhu enters and dwells in the base of the infinity of space. That is where perceptions of forms cease and those are the ones who dwell having thoroughly ended perceptions of forms.’ Surely, bhikkhus, one who is not crafty or hypocritical should delight and rejoice in this statement, saying: ‘Good!’ Having done so, bowing in reverential salutation, he should attend upon them.",
    "an9.33:6": "() \"I say ofthat statewhere the perception of the base of the infinity of space ceases and of those who dwell having thoroughly ended the perception of the base of the infinity of space: ‘Surely, those venerable ones are hungerless and quenched, have crossed over and gone beyond in that particular respect.’ If anyone should say: ‘Where does the perception of the base of the infinity of space cease? And who are those that dwell having thoroughly ended the perception of the base of the infinity of space? I do not know this, I do not see this,’ he should be told: ‘Here, friend, by completely surmounting the base of the infinity of space,perceiving\"consciousness is infinite,\" a bhikkhu enters and dwells in the base of the infinity of consciousness. That is where the perception of the base of the infinity of space ceases and those are the ones who dwell having thoroughly ended the perception of the base of the infinity of space.’ Surely, bhikkhus, one who is not crafty or hypocritical should delight and rejoice in this statement, saying: ‘Good!’ Having done so, bowing in reverential salutation, he should attend upon them.",
    "an9.33:7": "() \"I say ofthat statewhere the perception of the base of the infinity of consciousness ceases and of those who dwell having thoroughly ended the perception of the base of the infinity of consciousness: ‘Surely, those venerable ones are hungerless and quenched, have crossed over and gone beyond in that particular respect.’ If anyone should say: ‘Where does the perception of the base of the infinity of consciousness cease? And who are those that dwell having thoroughly ended the perception of the base of the infinity of consciousness? I do not know this, I do not see this,’ he should be told: ‘Here, friend, by completely surmounting the base of the infinity of consciousness,perceiving\"there is nothing,\" a bhikkhu enters and dwells in the base of nothingness. That is where the perception of the base of the infinity of consciousness ceases and those are the ones who dwell having thoroughly ended the perception of the base of the infinity of consciousness.’ Surely, bhikkhus, one who is not crafty or hypocritical should delight and rejoice in this statement, saying: ‘Good!’ Having done so, bowing in reverential salutation, he should attend upon them.",
    "an9.33:8": "() \"I say ofthat statewhere the perception of the base of nothingness ceases and of those who dwell having thoroughly ended the perception of the base of nothingness: ‘Surely, those venerable ones are hungerless and quenched, have crossed over and gone beyond in that particular respect.’ If anyone should say: ‘Where does the perception of the base of nothingness cease? And who are those that dwell having thoroughly ended the perception of the base of nothingness?I do not know this, I do not see this,’ he should be told: ‘Here, friend, by completely surmounting the base of nothingness, a bhikkhu enters and dwells in the base of neither-perception-nor-non-perception. That is where the perception of the base of nothingness ceases and those are the ones who dwell having thoroughly ended the perception of the base of nothingness.’ Surely, bhikkhus, one who is not crafty or hypocritical should delight and rejoice in this statement, saying: ‘Good!’ Having done so, bowing in reverential salutation, he should attend upon them.",
    "an9.33:9": "() \"I say ofthat statewhere the perception of the base of neither-perception-nor-non-perception ceases and of those who dwell having thoroughly ended the perception of the base of neither-perception-nor-non-perception: ‘Surely, those venerable ones are hungerless and quenched, have crossed over and gone beyond in that particular respect.’ If anyone should say: ‘Where does the perception of the base of neither-perception-nor-non-perception cease? And who are those that dwell having thoroughly ended the perception of the base of neither-perception-nor-non-perception? I do not know this, I do not see this,’ he should be told: ‘Here, friend, by completely surmounting the base of neither-perception-nor-non-perception, a bhikkhu enters and dwells in the cessation of perception and feeling. That is where the perception of the base of neither-perception-nor-non-perception ceases and those are the ones who dwell having thoroughly ended the perception of the base of neither-perception-nor-non-perception.’ Surely, bhikkhus, one who is not crafty or hypocritical should delight and rejoice in this statement, saying: ‘Good!’ Having done so, bowing in reverential salutation, he should attend upon them.",
    "an9.33:10": "\"This, bhikkhus, is the attainment of the nine progressive dwellings.\""
}