{
    "an9.19:1": "\"Bhikkhus, last night, when the night had advanced, a number of deities of stunning beauty, illuminating the entire Jeta's Grove, approached me, paid homage to me, and stood to one side.",
    "an9.19:2": "() \"Some other deities approached me and said: ‘In the past, Bhante, when we were human beings, monks approached our homes. We rose up for them and paid homage to them, but we did not offer them seats. Not having fulfilled our duty, full of regret and remorse, we were reborn in an inferior classof deities.’",
    "an9.19:3": "() \"Some other deities approached me and said: ‘In the past, Bhante, when we were human beings, monks approached our homes. We rose up for them, paid homage to them, and offered them seats, but we did not share things with them to the best of our ability and capacity … (4) … we shared things with them to the best of our ability and capacity, but we did not sit close by to listen to the Dhamma … (5) … we sat close by to listen to the Dhamma, but we did not listen to it with eager ears … (6) … we listened to it with eager ears, but having heard it, we did not retain the Dhamma in mind … (7) … having heard it, we retained the Dhamma in mind but we did not examine the meaning of the teachings that had been retained in mind … (8) … we examined the meaning of the teachings that had been retained in mind but we did not understand the meaning and the Dhamma and then practice in accordance with the Dhamma. Not having fulfilled our duty, full of regret and remorse, we were reborn in an inferior classof deities.’",
    "an9.19:4": "(9) \"Some other deities approached me and said: ‘In the past, Bhante, when we were human beings, monks approached our homes.iWe rose up for them,iipaid homage to them,iiioffered them seats, andivshared things with them to the best of our ability and capacity.vWe sat close by to listen to the Dhamma andvilistened to it with eager ears;viihaving heard it, we retained the Dhamma in mind;viiiwe examined the meaning of the teachings that had been retained in mind; andixwe understood the meaning and the Dhamma and then practiced in accordance with the Dhamma. Having fulfilled our duty, free of regret and remorse, we were reborn in a superior classof deities.’"
}