{
    "an9.26:1": "Thus have I heard. On one occasion the Venerable Sāriputta and the Venerable Candikāputta were dwelling at Rājagaha in the Bamboo Grove, the squirrel sanctuary. There the Venerable Candikāputta addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an9.26:2": "Then the Venerable Sāriputta said to the Venerable Candikāputta: \"Friend Candikāputta, it is not in such a way that Devadatta teaches the Dhamma to the bhikkhus. Rather, Devadatta teaches the Dhamma to the bhikkhus thus: ‘When, friends, a bhikkhu's mind is well consolidated by mind,[n.189] All three editions havebhikkhuno cetasā cittaṁ suparicitaṁ hoti. But note that inEe, Sāriputta's statement on Devadatta's way of teaching does not differ from Candikāputta's statement just above. Both havesuparicitaṁ hoti. It is puzzling that the sutta seems to be approving of Devadatta's teaching. Normally we would expect him to be censured for proposing a distorted version of the Dhamma. Perhaps this incident occurred before Devadatta became schismatic.it is fitting for him to declare: \"I understand: Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.\"’\"",
    "an9.26:3": "A second time … A third time the Venerable Candikāputta addressed the bhikkhus: \"Friends, Devadatta teaches the Dhamma to the bhikkhus thus: ‘When, friends, a bhikkhu's mind is consolidated by mind, it is fitting for him to declare: \"I understand: Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.\"’\"",
    "an9.26:4": "A third time the Venerable Sāriputta said to the Venerable Candikāputta: \"Friend Candikāputta, it is not in such a way that Devadatta teaches the Dhamma to the bhikkhus. Rather, Devadatta teaches the Dhamma to the bhikkhus thus: ‘When, friends, a bhikkhu's mind is well consolidated by mind, it is fitting for him to declare: \"I understand: Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.\"’",
    "an9.26:5": "\"And how, friend, is the mind of a bhikkhu well consolidated by mind?(1) His mind is well consolidated by mind (when he knows): ‘My mind is without lust.’ (2) His mind is well consolidated by mind (when he knows): ‘My mind is without hatred.’ (3) His mind is well consolidated by mind (when he knows): ‘My mind is without delusion.’ (4) His mind is well consolidated by mind (when he knows): ‘My mind is not subject to lust.’ () His mind is well consolidated by mind (when he knows): ‘My mind is not subject to hatred.’ (6) His mind is well consolidated by mind (when he knows): ‘My mind is not subject to delusion.’ (7) His mind is well consolidated by mind (when he knows): ‘My mind is not subject to return to sense-sphere existence.’ (8) His mind is well consolidated by mind (when he knows): ‘My mind is not subject to return to form-sphere existence.’ (9) His mind is well consolidated by mind (when he knows): ‘My mind is not subject to return to formless-sphere existence.’[n.1893] §§4–6 are, in Pāli,asarāgadhammaṁ,asadosadhammaṁ,asamoha-dhammaṁ.Mpdoes not gloss them, but the point seems to be that for the arahant lust, hatred, and delusion are no longer even capable of arising again. §§7–9 allude to the three realms of existence.",
    "an9.26:6-7": "\"Suppose, friend, there was a stone pillar eight meters long.[n.1895] Text sayssilāyūpo soḷasakukkuko, a stone pillar sixteenkukkustall. According toDOP, akukkuis 45 cm, about half a meter. Thus the pillar would be about eight meters.Four meters would be below ground and four meters above ground. If a violent rainstorm should then arrive from the east, it would not shake it or make it quake,wobble, and tremble;[n.1896] The number of verbs differ among the editions.Ce, which I follow, has four:n’eva naṁ kampeyya na saṅkampeyya na sampakampeyya na sampavedheyya(but Ce abridges the middle two directions and omits the last verb in relation to the final repetition, apparently an editorial oversight). Ee has three:n’eva naṁ kampeyya na saṅkampeyya na sampavedheyya. Be uses only two verbs:n’eva naṁ saṅkampeyya na sampavedheyya, but three in the simile atAN6.55.if a violent rainstorm should then arrive from the west … from the north … from the south, it would not shake it or make it quake, wobble, and tremble. For what reason? Because the stone pillar is deep in the ground and is securely planted. So too, friend, when a bhikkhu is thus perfectly liberated in mind, even if powerful forms cognizable by the eye come into raṅge of the eye … Even if powerful phenomena cognizable by the mind come into raṅge of the mind, they do not obsess his mind; his mind is not at all affected. It remains steady, attained to imperturbability, and he observes its vanishing.\""
}