{
    "an9.5:1": "\"Bhikkhus, there are these four powers. What four?",
    "an9.5:2": "() \"And what is the power of energy? One generates desire to abandon those qualities that are unwholesome and reckoned as unwholesome; those that are blamable and reckoned as blamable; those that are dark and reckoned as dark; those that should not be cultivated and are reckoned as not to be cultivated; those that are unworthy of the noble ones and reckoned as unworthy of the noble ones. One makes an effort, arouses energy, applies one's mind, and strives for this. One generates desire to obtain all those qualities that are wholesome and reckoned as wholesome; those that are blameless and reckoned as blameless; those that are bright and reckoned as bright; those that should be cultivated and are reckoned as to be cultivated;those that are worthy of the noble ones and reckoned as worthy of the noble ones. One makes an effort, arouses energy, applies one's mind, and strives for this. This is called the power of energy.",
    "an9.5:3": "() \"And what is the power of blamelessness? Here, a noble disciple engages in blameless bodily, verbal, and mental action. This is called the power of blamelessness.",
    "an9.5:4": "() \"And what is the power of sustaining a favorable relationship? There are these four means of sustaining a favorable relationship: giving, endearing speech, beneficent conduct, and impartiality. Among gifts, the best is the gift of the Dhamma. Among types of endearing speech, the best is repeatedly teaching the Dhamma to one who is interested in it and listens with eager ears. Among types of beneficent conduct, the best is when one encourages, settles, and establishes a person without faith in the accomplishment of faith, an immoral person in the accomplishment of virtuous behavior, a miserly person in the accomplishment of generosity, and an unwise person in the accomplishment of wisdom. Among types of impartiality, the best is that a stream-enterer is equal to a stream-enterer, a once-returner is equal to a once-returner, a non-returner is equal to a non-returner, and an arahant is equal to an arahant.[n.183] The explanation of \"impartiality\" given here may be puzzling. Samānattatāis a compound of \"equal\"(samāna)and \"oneself\"(attan). As applied to conduct, it means treating others as one would have them treat oneself, without bias or partiality. Here the word is being used to express the equality between those at the four levels of awakening, all with himself or herself.This is called the power of sustaining a favorable relationship.",
    "an9.5:5": "\"These, bhikkhus, are the four powers. When a noble disciple possesses these four powers, he has transcended five fears. What five? () Fear ofloss oflivelihood, (6) fear of disrepute, (7) fear of timidity in assemblies,(8) fear of death, and (9) fear of a bad destination. The noble disciple reflects thus: ‘I am not afraid on account of my livelihood. Why should I be afraid on account of my livelihood? I have the four powers: the power of wisdom, the power of energy, the power of blamelessness, and the power of sustaining a favorable relationship. An unwise person might be afraid on account of his livelihood; a lazy person might be afraid on account of his livelihood; a person who engages in blamable bodily, verbal, and mental action might be afraid on account of his livelihood; a person who does not sustain favorable relationships might be afraid on account of his livelihood."
}