{
    "an9.35:1": "\"Suppose, bhikkhus, there were a mountain-dwelling cow that was foolish, incompetent, inexperienced, and unskilled in walking on rough mountains.[n.9] Cited at Vism 53,7–54,8, Ppn 4.30, as testimony that one should first master the jhāna one has just attained before attempting to enter the next higher jhāna.It might occur to her: ‘I should go to a region where I have never gone before, eat grass that I have never eaten before, drink water that I have never drunk before.’ She would set down a front foot, and while it is not yet firmly planted, lift up a hind foot. She would not go to a region where she had never gone before, eat grass that she had never eaten before, drink water that she had never drunk before; and she would not return safely to the region where she was staying when it occurred to her: ‘I should go to a region where I have never gone before, eat grass that I have never eaten before, drink water that I have never drunk before.’ For what reason? Because that mountain-dwelling cow was foolish, incompetent, inexperienced, and unskilled in walking on rough mountains.",
    "an9.35:2": "\"It occurs to him: ‘With the subsiding of thought and examination, I should enter and dwell in the second jhāna….’ But he cannot enter and dwell in the second jhāna …. Then it occurs to him: ‘Secluded from sensual pleasures, secluded from unwholesome states, I should enter and dwell in the first jhāna ….’ But he cannot enter and dwell in the first jhāna …. This is called a bhikkhu who has dropped away from both,[n.1913]Ubhato bhaṭṭho.Bhaṭṭhais past participle ofbhassati, to drop away, to droop, to fall off.fallen away from both. He is just like that mountain-dwelling cow that was foolish, incompetent, inexperienced, and unskilled in walking on rough mountains.",
    "an9.35:3": "\"Suppose, bhikkhus, there were a mountain-dwelling cow that was wise, competent, experienced, and skilled in walking on rough mountains. It might occur to her: ‘I should go to a region where I have never gone before, eat grass that I have never eaten before, drink water that I have never drunk before.’ When setting down a front foot, she would firmly plant it, and only then lift up a hind foot. She would go to a region where she had never gone before, eat grass that she had never eaten before, drink water that she had never drunk before; and she would return safely to the region where she was staying when it occurred to her: ‘I should go to a region where I have never gone before, eat grass that I have never eaten before, drink water that I have never drunk before.’ For what reason? Because that mountain-dwelling cow was wise, competent, experienced, and skilled in walking on rough mountains.",
    "an9.35:4": "(2) \"It occurs to him: ‘With the subsiding of thought and examination, I should enter and dwell in the second jhāna ….’ Not injuring[n.191]Anabhihiṁsamāno. I offer only a literal translation. Based on the context I understand the sense to be that he does not force himself to aim prematurely for the higher attainment but masters the preceding one before moving on to the next.the second jhāna, with the subsiding of thought and examination he enters and dwells in the second jhāna …. He pursues that object, develops and cultivates it, and focuses on it well.",
    "an9.35:5": "(3) \"Then it occurs to him: ‘With the fading away as well of rapture… I should enter and dwell in the third jhāna ….’ Not injuring the third jhāna, with the fading away as well of rapture he enters and dwells in the third jhāna …. He pursues that object, develops and cultivates it, and focuses on it well.",
    "an9.35:6": "(4) \"Then it occurs to him: ‘With the abandoning of pleasure and pain … I should enter and dwell in the fourth jhāna ….’ Not injuring the fourth jhāna, with the abandoning of pleasure and pain … he enters and dwells in the fourth jhāna …. He pursues that object, develops and cultivates it, and focuses on it well.",
    "an9.35:7": "(5) \"Then it occurs to him: ‘With the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving\"space is infinite,\" I should enter and dwell in the base of the infinity of space.’ Not injuring the base of the infinity of space, with the complete surmounting of perceptions of forms … he enters and dwells in the base of the infinity of space. He pursues that object, develops and cultivates it, and focuses on it well.",
    "an9.35:8": "(6) \"Then it occurs to him: ‘With the complete surmounting of the base of the infinity of space,perceiving\"consciousness is infinite,\" I should enter and dwell in the base of the infinity of consciousness.’ Not injuring the base of the infinity of consciousness, with the complete surmounting of the base of the infinity of space … he enters and dwells in the base of the infinity of consciousness. He pursues that object, develops and cultivates it, and focuses on it well.",
    "an9.35:9": "(7) \"Then it occurs to him: ‘With the complete surmounting of the base of the infinity of consciousness,perceiving\"there is nothing,\" I should enter and dwell in the base of nothingness.’ Not injuring the base of nothingness, with the complete surmounting of the base of the infinity of consciousness … he enters and dwells in the base of nothingness. He pursues that object, develops and cultivates it, and focuses on it well.",
    "an9.35:10": "(8) \"Then it occurs to him: ‘With the complete surmounting of the base of nothingness, I should enter and dwell in the base of neither-perception-nor-non-perception.’ Not injuring the base of neither-perception-nor-non-perception, with the complete surmounting of the base of nothingness, he enters and dwells in the base of neither-perception-nor-non-perception. He pursues that object, develops and cultivates it,and focuses on it well.",
    "an9.35:11": "(9) \"Then it occurs to him: ‘With the complete surmounting of the base of neither-perception-nor-non-perception, I should enter and dwell in the cessation of perception and feeling.’ Not injuring the cessation of perception and feeling, with the complete surmounting of the base of neither-perception-nor-non-perception, he enters and dwells in the cessation of perception and feeling.",
    "an9.35:12": "\"When, bhikkhus, a bhikkhu enters and emerges from each of these meditative attainments, his mind becomes malleable and wieldy. With the mind malleable and wieldy, his concentration becomes measureless and well developed. With measureless, well-developed concentration, whatever state realizable by direct knowledge he inclines his mind toward to realize by direct knowledge, he is capable of realizing it, there being a suitable basis.",
    "an9.35:13": "\"If he wishes: ‘May I wield the various kinds of psychic potency: having been one, may I become many … may I exercise mastery with the body as far as the brahmā world,’ he is capable of realizing it, there being a suitable basis.",
    "an9.35:14": "\"If he wishes: ‘May I, with the divine ear element, which is purified and surpasses the human, hear both kinds of sounds, the divine and human, those that are far as well as near,’ he is capable of realizing it, there being a suitable basis.",
    "an9.35:15": "\"If he wishes: ‘May I understand the minds of other beings and persons, having encompassed them with my own mind. May I understand … an unliberated mind as unliberated,’ he is capable of realizing it, there being a suitable basis.",
    "an9.35:16": "\"If he wishes: ‘May I recollect my manifold past abodes … with their aspects and details,’ he is capable of realizing it, there being a suitable basis.",
    "an9.35:17": "\"If he wishes: ‘May I, with the divine eye, which is purified and surpasses the human, see beings passing away and being reborn … and understand how beings fare in accordance with their kamma,’ he is capable of realizing it, there being a suitable basis.",
    "an9.35:18": "\"If he wishes: ‘May I, with the destruction of the taints, in this very life enter and dwell in the taintless liberation of mind, liberation by wisdom, having realized it for myself with direct knowledge,’ he is capable of realizing it, there being a suitable basis.\""
}