{
    "an9.13:1": "Then the Venerable Mahākoṭṭhita approached the Venerable Sāriputta and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Venerable Sāriputta:",
    "an9.13:2": "\"Then is the spiritual life lived under the Blessed One for this purpose: ‘Let kammawhose resultis to be experienced in a future life become kammawhose resultI am to experience in this life’?\"",
    "an9.13:3": "\"Now, friend Sāriputta, is the spiritual life lived under the Blessed One for this purpose: ‘Let kammawhose resultis to be experienced as pleasant become kammawhose resultI am to experience as painful?’\"[n.1860] I translate followingBeand Ee, which readdukkhavedaniyaṁ. Ce hassukhavedaniyaṁ, presumably because of the difficulty in seeing why the practitioner would want his kamma to be felt as painful.",
    "an9.13:4": "\"Then is the spiritual life lived under the Blessed One for this purpose: ‘Let kammawhose resultis to be experienced as painful become kammawhose resultI am to experience as pleasant ‘?\"",
    "an9.13:5": "\"Now, friend Sāriputta, is the spiritual life lived under the Blessed One for this purpose: ‘Let my kammawhose resultis to be experienced when it has matured become kammawhose resultI am to experience while it has not matured’?\"[n.1861]Mpglossesparipakkavedanīyaṁasladdhavipākavāraṁ,\"(kamma) that has gained the chance to yield results.\" Its opposite,aparipakkavedanīyaṁ, isaladdhavipākavāraṁ, \"(kamma) that has not gained the chance to yield results.\"",
    "an9.13:6": "\"Then is the spiritual life lived under the Blessed One for this purpose: ‘Let kammawhose resultis to be experienced while it has not matured become kammawhose resultI am to experience when it has matured’?\"",
    "an9.13:7": "\"Now, friend Sāriputta, is the spiritual life lived under the Blessed One for this purpose: ‘Let kammawhose resultis to be experienced copiously become kammawhose resultI am to experience just slightly’?\"",
    "an9.13:8": "\"Thenis the spiritual life lived under the Blessed One for this purpose: ‘Let kammawhose resultis to be experienced just slightly become kammawhose resultI am to experience copiously’?\"",
    "an9.13:9": "\"Now, friend Sāriputta, is the spiritual life lived under the Blessed One for this purpose: ‘Let kammawhose resultis to be experienced become kammawhose resultI am not to experience’?\"[n.1862]Mp-ṭ:\"Kamma to be experiencedis (kamma) that has not yet started to ripen but which is capable of producing results when there is an assemblage of other conditions.Kamma not to be experiencedis classified asahosikamma, etc., which is incapable of ripening because of a deficiency of conditions\"(vedanīyanti paccayantarasamavāye vipākuppādanasamatthaṁ, na āraddhavipākam eva;avedanīyanti paccayavekallena vipaccituṁ asamatthaṁ ahosikammādibhedaṁ). The concept ofahosikamma, kamma that never obtains a chance to ripen, is derived from Paṭis II 78,2–10(Be §234). See too CMA 205.",
    "an9.13:10": "\"Then is the spiritual life lived under the Blessed One for this purpose: ‘Let kammawhose resultis not to be experienced become kammawhose resultI am to experience’?\"",
    "an9.13:11": "\"Friend Sāriputta, when you are asked: ‘Now, friend Sāriputta, is the spiritual life lived under the Blessed One for this purpose: \"Let kammawhose resultis to be experienced in this life become kammawhose resultI am to experience in a future life\"?’ you say: ‘Certainly not, friend.’",
    "an9.13:12-20": "And when you are asked: ‘Then is the spiritual life lived under the Blessed One for this purpose: \"Let kammawhose resultis to be experienced in a future life become kammawhose resultI am to experience in this life\"?’ you say: ‘Certainly not, friend.’ …… When you are asked: ‘Now, friend Sāriputta, is the spiritual life lived under the Blessed One for this purpose: \"Let kammawhose resultis to be experienced become kammawhose resultI am not to experience\"?’ you say: ‘Certainly not, friend.’ And when you are asked: ‘Then is the spiritual life lived under the Blessed One for this purpose: \"Let kammawhose resultis not to be experienced become kammawhose resultI am to experience\"?’ you say: ‘Certainly not, friend.’ Then for what purpose does one live the spiritual life under the Blessed One?\"",
    "an9.13:21": "\"One lives the spiritual life under the Blessed One, friend, for the purpose of knowing, seeing, attaining, realizing, and penetrating what one has not known, seen, attained, realized, and penetrated.\""
}