{
    "an9.27:1": "Then the householder Anāthapiṇḍika approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "an9.27:2": "\"Householder, when a noble disciple has eliminated five perils and enmities and possesses the four factors of stream-entry, he might, if he so wished, declare of himself: ‘I am one finished with hell, the animal realm, and the sphere of afflicted spirits; finished with the plane of misery, the bad destination, the lower world; I am a stream-enterer, no longer subject to (rebirth in) the lower world, fixed in destiny, heading for enlightenment.’[n.1897] Also atAN5.179.",
    "an9.27:3": "\"What are the five perils and enmities that have been eliminated? (1) Householder, one who destroys life, with the destruction of life as condition, creates peril and enmity pertaining to the present life and peril and enmity pertaining to future lives[n.1898] Onbhayaṁ veraṁ pasavati,Mpsays that one obtains the peril of mental fright(cittutrāsabhayaṁ; this favors understandingbhayaas subjective fear rather than objective peril, though I think the latter is actually intended) and enmity as a person(puggalaveraṁ). Spk II 7,17–, commenting on SN12:41, gives a fuller explanation: \"Peril and enmity are one in meaning. Enmity is twofold, external and internal. For if one has killed someone's father, the other thinks: ‘They say he killed my father; I will kill him.’ So the latter takes a sharp knife and pursues the former. The volition arisen in him is called the external enmity (in relation to the future victim). But the other hears, ‘He's coming to kill me’ and decides: ‘I’ll kill him first.’ This is called the internal enmity (in relation to himself). They both pertain to this present life. When the warden of hell sees the murderer reborn in hell, the volition arises in him: ‘I’ll take a blazing iron hammer and strike him’: this is the external enmity pertaining to the future life. And the volition that arises in the victim, ‘He's coming to strike me though I’m faultless; I’ll strike him first,’ is the internal enmity pertaining to the future life. The external enmity is what is called ‘enmity as a person’ in the (old) Commentary.\"and he also experiences mental pain and dejection. One who abstains from the destruction of life does not create such peril and enmity pertaining to the present life or such peril and enmity pertaining to future lives nor does he experience mental pain and dejection. For one who abstains from the destruction of life, that peril and enmity has thus been eliminated.",
    "an9.27:4": "(2) \"One who takes what is not given … (3) who engages in sexual misconduct … () who speaks falsely … (5) who indulges in liquor, wine, and intoxicants, the basis for heedlessness, with indulgence in liquor, wine, and intoxicants as condition, creates peril and enmity pertaining to the present life and peril and enmity pertaining to future lives and he also experiences mental pain and dejection. One who abstains from liquor, wine, and intoxicants, the basis for heedlessness, does not create such peril and enmity pertaining to the present life or such peril and enmity pertaining to future lives nor does he experience mental pain and dejection. For one who abstains from liquor, wine, and intoxicants, the basis for heedlessness, that peril and enmity has thus been eliminated.",
    "an9.27:5": "\"These are the five perils and enmities that have been eliminated.",
    "an9.27:6": "\"And what are the four factors of stream-entry that he possesses? () Here, householder, a noble disciple possesses unwavering confidence in the Buddha thus: ‘The Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’",
    "an9.27:7": "() He possesses unwavering confidence in the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’",
    "an9.27:8": "() He possesses unwavering confidence in the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practicing the good way, practicing the straight way,practicing the true way, practicing the proper way; that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’",
    "an9.27:9": "() He possesses the virtuous behavior loved by the noble ones, unbroken, flawless, unblemished, unblotched, freeing, praised by the wise, ungrasped, leading to concentration. These are the four factors of stream-entry that he possesses.",
    "an9.27:10": "\"Householder, when a noble disciple has eliminated these five perils and enmities and possesses these four factors of stream-entry, he might, if he so wished, declare of himself: ‘I am one finished with hell, the animal realm, and the sphere of afflicted spirits; finished with the plane of misery, the bad destination, the lower world; I am a stream-enterer, no longer subject to (rebirth in) the lower world, fixed in destiny, heading for enlightenment.’\""
}