{
    "an9.40:1": "\"Bhikkhus, when a forest-dwelling bull elephant is heading for its feeding ground, and other elephants—males, females, young ones,[n.94]Hatthikalabhā.Mpglosses as \"very big bull elephants\"(mahantā mahantā nāgā). This, however, begs the question how these bull elephants differ from the main subject of the simile.Ud 4,20–2mentions different types of elephants, among themhatthikalabhā(Eehatthikaḷārā)which Ud-a 250,2–3calls elephant offspring(hatthipotakā). They are there distinguished fromhatthicchāpā, young elephant offspring still being nursed(khīrūpagā dāhārahatthipotakā). I translate in accordance with this explanation.and babies—precede him and break the tops of the grass, the bull elephant is repelled, humiliated, and disgusted with this. When a forest-dwelling bull elephant is heading for its feeding ground, and other elephants—males, females, young ones, and babies—eat the bent and twisted bundle of branches, the bull elephant is repelled, humiliated, and disgusted with this. When a forest-dwelling bull elephant has entered the pool and other elephants—males, females, young ones, and babies—precede him and stir up the water with their trunks, the bull elephant is repelled, humiliated, and disgusted with this. When a forest-dwelling bull elephant has emerged from the pool and female elephants go by brushing against his body, the forest-dwelling bull elephant is repelled, humiliated, and disgusted with this.",
    "an9.40:2": "\"On that occasion it occurs to the forest-dwelling bull elephant: ‘I am presently dwelling hemmed in by other elephants: males, females, young ones, and babies. I eat grass with the tops broken off, and they eat my bent and twisted bundle of branches. I drink muddy water, and when I have come out from the pool, the female elephants go by brushing against my body. Let me dwell alone, withdrawn from the herd.’",
    "an9.40:3": "On that occasion it occurs to the forest-dwelling bull elephant: ‘In the past I dwelled hemmed in by other elephants … and when I came out from the pool, the female elephants went by brushing against my body. But now I dwell alone, withdrawn from the herd. I eat grass without the tops broken off; they do not eat my bent and twisted bundle of branches; I drink clear water; and when I have come out from the pool, the female elephants do not go by brushing against my body.’ Having broken off a bundle of branches with his trunk, having rubbed his body with it, he happily relieves his itches.",
    "an9.40:4": "\"So too, bhikkhus, when a bhikkhu dwells hemmed in by bhikkhus, bhikkhunīs, male and female lay followers, kings and royal ministers, sectarian teachers and the disciples of sectarian teachers, on that occasion it occurs to him: ‘I am presently dwelling hemmed in by bhikkhus, bhikkhunīs, male and female lay followers, kings and royal ministers, sectarian teachers and the disciples of sectarian teachers. Let me dwell alone, withdrawn from company.’",
    "an9.40:5": "Having abandoned longing for the world, he dwells with a mind free from longing; he purifies his mind from longing. Having abandoned ill will and hatred, he dwells with a mind free from ill will, compassionate for the welfare of all living beings; he purifies his mind from ill will and hatred. Having abandoned dullness and drowsiness, he dwells free from dullness and drowsiness, percipient of light, mindful and clearly comprehending; he purifies his mind from dullness and drowsiness. Having abandoned restlessness and remorse, he dwells without agitation, with a mind inwardly peaceful; he purifies his mind from restlessness and remorse. Having abandoned doubt, he dwells having gone beyond doubt, unperplexed about wholesome qualities; he purifies his mind from doubt.",
    "an9.40:6": "(5) \"With the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving‘space is infinite,’ a bhikkhu enters and dwells in the base of the infinity of space. Elated, he relieves his itches."
}