{
    "an9.4:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the Venerable Nandaka was instructing, encouraging, inspiring, and gladdening the bhikkhus in the assembly hall with a Dhamma talk. Then, in the evening, the Blessed One emerged from seclusion and went to the assembly hall. He stood outside the door waiting for the talk to end. When he knew that the talk was finished, he cleared his throatand tapped on the bolt. The bhikkhus opened the door for him.",
    "an9.4:2": "The Blessed One then entered the assembly hall, sat down on the seat that was prepared for him, and said to the Venerable Nandaka: \"You gave the bhikkhus a long exposition of the Dhamma. My back was aching while I stood outside the door waiting for the talk to end.\"",
    "an9.4:3": "When this was said, the Venerable Nandaka, feeling embarrassed, said to the Blessed One: \"Bhante, I did not know that the Blessed One was standing outside the door. If I had known, I wouldn’t have spoken so long.\"",
    "an9.4:4": "Then the Blessed One, having understood the Venerable Nandaka's embarrassment, said to him: \"Good, good, Nandaka! It is proper for clansmen like you who have gone forth out of faith from the household life into homelessness to sit together for the sake of a Dhamma talk. When you assemble, Nandaka, you should do one of two things: either talk on the Dhamma or maintain noble silence.",
    "an9.4:5": "(2) \"A bhikkhu may be endowed with faith and virtuous but he does not gain internal serenity of mind;[n.1837] Be hascetosamādhissathroughout, as against Ce and Eecetosamathassa.thus he is incomplete with respect to that factor. He should fulfill that factor,thinking: ‘How can I be endowed with faith and virtuous, and also gain internal serenity of mind?’ But when a bhikkhu is endowed with faith and is virtuous, and also gains internal serenity of mind, then he is complete with respect to that factor.",
    "an9.4:6": "(3) \"A bhikkhu may be endowed with faith and virtuous, and he may gain internal serenity of mind, but he does not gain the higher wisdom of insight into phenomena;[n.1838]Adhipaññādhammavipassanā, glossed as \"the insight knowledge that comprehends conditioned phenomena\"(saṅkhārapariggāhakavipassanāñāṇa).thus he is incomplete with respect to that factor. Just as a four-legged animal with one lame or defective leg would be incomplete with respect to that limb; so too, when a bhikkhu is endowed with faith and is virtuous, and gains internal serenity of mind, but he does not gain the higher wisdom of insight into phenomena, then he is incomplete with respect to that factor. He should fulfill that factor,thinking: ‘How can I be endowed with faith and virtuous, gain internal serenity of mind, and also gain the higher wisdom of insight into phenomena?’",
    "an9.4:7": "(4) But when a bhikkhu isiendowed with faith andiiis virtuous,iiiand he gains internal serenity of mind andivalso gains the higher wisdom of insight into phenomena, then he is complete with respect to that factor.\"",
    "an9.4:8": "Then, not long after the Blessed One had left, the Venerable Nandaka addressed the bhikkhus: \"Just now, friends, before he rose from his seat and entered his dwelling, the Blessed One revealed the perfectly complete and pure spiritual life in four terms:‘Nandaka, a bhikkhu may be endowed with faith but not virtuous ….Nandaka here repeats the Buddha’s discourse down to:… But when a bhikkhu is endowed with faith and is virtuous, and he gains internal serenity of mind and also gains the higher wisdom of insight into phenomena, then he is complete with respect to that factor.’",
    "an9.4:9": "\"There are, friends, these five benefits in timely listening to the Dhamma, in timely discussion on the Dhamma. What five?",
    "an9.4:10": "(6) \"Again, a bhikkhu teaches the bhikkhus the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; he reveals the spiritual life that is perfectly complete and pure. In whatever way the bhikkhu teaches the bhikkhus the Dhamma that is good in the beginning …andreveals the spiritual life that is perfectly complete and pure, in just that way, in relation to that Dhamma, he experiences inspiration in the meaning and inspiration in the Dhamma.[n.1840]Tathā tathā so tasmiṁ dhamme atthapaṭisaṁvedī ca hoti dhammapaṭisaṁvedī ca; as atAN5.26, III 21–23. SeeAN5.26, n. 990. Strangely, though the theme of this passage is the benefit in listening to and discussing the Dhamma, the second, third, and fourth benefits (and perhaps the first as well) accrue to the monk who isteachingthe Dhamma.This is the second benefit in timely listening to the Dhamma, in timely discussion on the Dhamma.",
    "an9.4:11": "(7) \"Again, a bhikkhu teaches the bhikkhus the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; he reveals the spiritual life that is perfectly complete and pure. In whatever way the bhikkhu teaches the bhikkhus the Dhamma that is good in the beginning …andreveals the spiritual life that is perfectly complete andpure, in just that way he sees in that Dhamma a deep and pithy matter after piercing it through with wisdom.[n.1841]Tathā tathā so tasmiṁ dhamme gambhīraṁ atthapadaṁ paññāya ativijjha passati. SeeAN6, n. 1346.This is the third benefit in timely listening to the Dhamma, in timely discussion on the Dhamma.",
    "an9.4:12": "(8) \"Again, a bhikkhu teaches the bhikkhus the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; he reveals the spiritual life that is perfectly complete and pure. In whatever way the bhikkhu teaches the bhikkhus the Dhamma that is good in the beginning …andreveals the spiritual life that is perfectly complete and pure, in just that way his fellow monks esteem him more highly,thinking: ‘Surely, this venerable has attained or will attain.’ This is the fourth benefit in timely listening to the Dhamma, in timely discussion on the Dhamma.",
    "an9.4:13": "(9) \"Again, a bhikkhu teaches the bhikkhus the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; he reveals the spiritual life that is perfectly complete and pure. In whatever way the bhikkhu teaches the bhikkhus the Dhamma that is good in the beginning …andreveals the spiritual life that is perfectly complete and pure, on hearing that Dhamma those bhikkhus there who are trainees, who have not attained their heart's ideal, who dwell aspiring for the unsurpassed security from bondage, arouse energy for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized. But having heard that Dhamma, those bhikkhus who are arahants, whose taints are destroyed, who have lived the spiritual life, done what had to be done, laid down the burden, reached their own goal, utterly destroyed the fetters of existence, and are completely liberated through final knowledge,are devoted simply to a pleasant dwelling in this very life. This is the fifth benefit in timely listening to the Dhamma, in timely discussion on the Dhamma.\""
}