{
    "an9.22:1": "\"Bhikkhus, I will teach you the three kinds of wild colts and the three kinds of persons who are like wild colts; the three kinds of good horses and the three kinds of persons who are like good horses; the three kinds of excellent thoroughbred horses and the three kinds of excellent thoroughbred persons.[n.886] This sutta combines the three triads defined separately inAN3.40– 42. Hence this may be considered a composite nine. We meet here the same divergence in readings in the second group of horses as we met earlier: Ce and Eetayo assasadassā, as against Betayo assaparassā.Listen and attend closely. I will speak.\"",
    "an9.22:2": "\"And what, bhikkhus, are the three kinds of wild colts? (1) Here, one kind of wild colt possesses speed but not beauty or the right proportions. () Another kind of wild colt possesses speed and beauty but not the right proportions. (3) And still another kind of wild colt possesses speed, beauty, and the right proportions. These are the three kinds of wild colts.",
    "an9.22:3": "\"And what, bhikkhus, are the three kinds of persons who are like wild colts? (1) Here, one kind of person who is like a wild colt possesses speed but not beauty or the right proportions. (2) Another kind of person who is like a wild colt possesses speed and beauty but not the right proportions. () And still another kind of person who is like a wild colt possesses speed, beauty, and the right proportions.",
    "an9.22:4": "(1) \"And how, bhikkhus, does a person who is like a wild colt possess speed but not beauty or the right proportions? Here, a bhikkhu understands as it really is: ‘This is suffering,’ and ‘This is the origin of suffering,’ and ‘This is the cessation of suffering,’ and ‘This is the way leading to the cessation of suffering.’This, I say, is his speed. But when asked a question pertaining to the Dhamma or the discipline, he falters and does not answer. This, I say, is his lack of beauty. And he does not gain robes, almsfood, lodgings, and medicines and provisions for the sick. This, I say, is his lack of the right proportions. In this way a person who is like a wild colt possesses speed but not beauty or the right proportions.",
    "an9.22:5": "(2) \"And how does a person who is like a wild colt possess speed and beauty but not the right proportions? Here, a bhikkhu understands as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ This, I say, is his speed. And when asked a question pertaining to the Dhamma or the discipline, he answers and does not falter. This, I say, is his beauty. But he does not gain robes … and provisions for the sick. This, I say, is his lack of the right proportions. In this way a person who is like a wild colt possesses speed and beauty but not the right proportions.",
    "an9.22:6": "(3) \"And how does a person who is like a wild colt possess speed, beauty, and the right proportions? Here, a bhikkhu understands as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering.’ This, I say, is his speed. And when asked a question pertaining to the Dhamma or the discipline, he answers and does not falter. This, I say, is his beauty.And he gains robes … and provisions for the sick. This, I say, is his right proportions. In this way a person who is like a wild colt possesses speed, beauty, and the right proportions. These are the three kinds of persons who are like wild colts.",
    "an9.22:7": "\"And what, bhikkhus, are the three kinds of good horses? (4) –(6) Here, one kind of good horse … (as above for the wild colts) … possesses speed, beauty, and the right proportions. These are the three kinds of good horses.[n.188] The text is abridged thus in all three editions.",
    "an9.22:8": "\"And what, bhikkhus, are the three kinds of persons who are like good horses? (4) –(6) Here, one person who is like a good horse … (as above for the persons who are like wild colts) … possesses speed, beauty, and the right proportions.",
    "an9.22:9": "(4) –(6) \"And how, bhikkhus, does a person who is like a good horse … possess speed, beauty, and the right proportions? Here, with the utter destruction of the five lower fetters, a bhikkhu is one of spontaneous birth, due to attain final nibbāna there without ever returning from that world. This, I say, is his speed. And when asked a question pertaining to the Dhamma and the discipline, he answers and does not falter. This, I say, is his beauty. And he gains robes … and provisions for the sick. This, I say, is his right proportions. In this way a person who is like a good horse possesses speed, beauty, and the right proportions. These are the three kinds of persons that are like good horses.",
    "an9.22:10": "\"And what, bhikkhus, are the three kinds of excellent thoroughbred horses? (7) –(9) Here, one kind of excellent thoroughbred horse … (as above for the wild colts) … possesses speed, beauty, and the right proportions.These are the three kinds of excellent thoroughbred horses.",
    "an9.22:11": "\"And what, bhikkhus, are the three kinds of excellent thoroughbred persons? (7) –(9) Here, one kind of excellent thoroughbred person … (as above for the persons who are like wild colts) … possesses speed, beauty, and the right proportions.",
    "an9.22:12": "(7) –(9) \"And how, bhikkhus, does an excellent thoroughbred person … possess speed, beauty, and the right proportions? Here, with the destruction of the taints, a bhikkhu has realized for himself with direct knowledge, in this very life, the taintless liberation of mind, liberation by wisdom, and having entered upon it, he dwells in it. This, I say, is his speed. And when asked a question pertaining to the Dhamma and the discipline, he answers and does not falter. This, I say, is his beauty. And he gains robes, almsfood, lodgings, and medicines and provisions for the sick. This, I say, is his right proportions. In this way an excellent thoroughbred person possesses speed, beauty, and the right proportions. These, bhikkhus, are the three kinds of excellent thoroughbred persons.\""
}