{
    "an9.43:1": "\"It is said, friend, ‘a body witness, a body witness.’[n.955]MN 90.9, I 478,4–8offers a formal definition of the body witness(kāyasakkhī)as a person who \"contacts with the body and abides in those emancipations that are peaceful and formless, transcending forms, and some of his taints are destroyed by his seeing with wisdom.\" In the present sutta, however, the term \"body witness\" does not conform to this formal definition but is explained on the basis of a word play. Strictly speaking, the one who attains the complete destruction of the taints is no longer a body witness, a category restricted to those still in training.In what way has the Blessed One spoken of a body witness?\"",
    "an9.43:2": "(1) \"Here, friend, secluded from sensual pleasures … a bhikkhu enters and dwells in the first jhāna …. He dwells having contacted that base with the body in whatever wayit is attained.[n.1956]Yathā yathā ca tadāyatanaṁ tathā tathā naṁ kāyena phusitvā viharati.Mp:\"Through whatever means or in whatever way there is that base consisting in the first jhāna, by that same means, or in that same way, he dwells having contacted that attainment with the coexistent mental body(sahajātanāmakāyena phusitvā).\"To this extent the Blessed One has spoken of a body witness in a provisional sense.",
    "an9.43:3": "(2) –(4) \"Again, friend, with the subsiding of thought and examination, a bhikkhu enters and dwells in the second jhāna … the third jhāna … the fourth jhāna …. He dwells having contacted that base with the body in whatever wayit is attained. To this extent, too, the Blessed One has spoken of a body witness in a provisional sense.",
    "an9.43:4": "(5) –(8) \"Again, friend, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity, aware that ‘space is infinite,’ a bhikkhu enters and dwells in the base of the infinity of space … the base of the infinity of consciousness … the base of nothingness … the base of neither-perception-nor-non-perception. He dwells having contacted that base with the body in whatever wayit is attained. To this extent, too, the Blessed One has spoken of a body witness in a provisional sense.",
    "an9.43:5": "(9) \"Again, friend, by completely surmounting the base of neither-perception-nor-non-perception, he enters and dwells in the cessation of perception and feeling, and having seen with wisdom, his taints are utterly destroyed. He dwells having contacted that base with the body in whatever wayit is attained. To this extent, friend, the Blessed One has spoken of a body witness in a non-provisional sense.\"[n.197] As suggested by the previous note, here the term \"nonprovisional sense\" is itself being used in a loose, \"provisional\" sense. In the strict, non-provisional sense, such a disciple is not a body witness, for the real body witness has still not reached arahantship."
}