{
    "an9.36:1": "() \"Bhikkhus, I say that the destruction of the taints occurs in dependence on the first jhāna. (2) I say that the destruction of the taints also occurs in dependence on the second jhāna. (3) I say that the destruction of the taints also occurs in dependence on the third jhāna. (4) I say that the destruction of the taints also occurs in dependence on the fourth jhāna. (5) I say that the destruction of the taints also occurs in dependence on the base of the infinity of space. (6) I say that the destruction of the taints also occurs in dependence on the base of the infinity of consciousness. (7) I say that the destruction of the taints also occurs in dependence on the base of nothingness. (8) I say that the destruction of the taints also occurs in dependence on the base of neither-perception-nor-non-perception. (9) I say that the destruction of the taints also occurs in dependence on the cessation of perception and feeling.",
    "an9.36:2": "(1) \"When it was said: ‘Bhikkhus, I say that the destruction of the taints occurs in dependence on the first jhāna,’ for what reason was this said? Here, secluded from sensual pleasures … a bhikkhu enters and dwells in the first jhāna …. He considers whatever phenomena exist there pertaining to form, feeling, perception, volitional activities, and consciousness as impermanent, suffering, an illness, a boil, a dart, misery, affliction, alien, disintegrating,empty, and non-self.[n.1915]Mp:\"The characteristic of impermanence is stated by way of two terms: impermanent and disintegrating(aniccato,palokato). The characteristic of non-self is stated by way of three terms: alien(parato), empty(suññato), and non-self(anattato). The characteristic of suffering is stated by the other six terms: suffering(dukkhato), an illness(rogato), a boil(gaṇḍato), a dart(sallato), misery(aghato), and affliction(ābādhato).He turns his mind away from those phenomena and directs it to the deathless element thus: ‘This is peaceful, this is sublime, that is, the stilling of all activities, the relinquishing of all acquisitions, the destruction of craving, dispassion, cessation, nibbāna.’[n.1916]Mp:\"He directs the mind of insight(vipassanācitta)to the unconditioned deathless element by way of hearing, by way of praise, by way of learning, and by way of concepts thus: ‘Nibbāna is peaceful.’ He directs the mind of the path(maggacitta)to nibbāna simply by making it an object(ārammaṇakaraṇavasen’eva), not by saying, ‘This is peaceful, this is sublime.’ The meaning is that he directs his mind there, penetrating it in this mode.\"If he is firm in this, he attains the destruction of the taints. But if he does not attain the destruction of the taints because of that lust for the Dhamma, because of that delight in the Dhamma,[n.1917]Ten’eva dhammarāgena tāya dhammanandiyā.Mp:\"By desire and attachment to the Dhamma of serenity and insight. So too for ‘delight in the Dhamma.’ If he can fully exhaust desire and attachment to serenity and insight, he attains arahantship. If not, he becomes a non-returner.\" Mp-ṭ: \"Having abandoned the desire and lust for serenity and insight leading to the lower paths, if he is unable to exhaust the desire for (serenity and insight) leading to the supreme path, he becomes settled in the stage of non-returning.\"then, with the utter destruction of the five lower fetters, he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an9.36:3": "\"Just as an archer or an archer's apprentice undergoes training on a straw man or a heap of clay, and then at a later time becomes a long-distance shooter, a sharp-shooter, one who splits a great body,[n.1918] SeeAN4.181,AN4.196.so too, secluded from sensual pleasures … a bhikkhu enters and dwells in the first jhāna. He considers whatever phenomena exist there pertaining to form, feeling, perception, volitional activities, and consciousness as impermanent … he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an9.36:4": "(2) –() \"When it was said: ‘Bhikkhus, I say that the destruction of the taints also occurs in dependence on the second jhāna … the third jhāna … the fourth jhāna …",
    "an9.36:6": "(5) \"When it was said: ‘Bhikkhus, I say that the destruction of the taints also occurs in dependence on the base of the infinity of space,’ for what reason was this said? Here, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving‘space is infinite,’ a bhikkhu enters and dwells in the base of the infinity of space. He considers whatever phenomena exist there pertaining to feeling, perception, volitional activities, and consciousness[n.1919] Note thatrūpa, form, is omitted in describing the formless attainments.Mp:\"In the formless attainment there is utterly no form; with reference to this, form is not included.\"as impermanent, suffering, an illness, a boil, a dart, misery, affliction, alien, disintegrating, empty, and non-self. He turns his mind away from those phenomena and directs it to the deathless element thus: ‘This is peaceful, this is sublime, that is, the stilling of all activities, the relinquishing of all acquisitions, the destruction of craving, dispassion, cessation, nibbāna.’ If he is firm in this, he attains the destruction of the taints. But if he does not attain the destruction of the taints because of that lust for the Dhamma, because of that delight in the Dhamma, then, with the utter destruction of the five lower fetters, he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an9.36:7": "\"Just as an archer or an archer's apprentice undergoes training on a straw man or a heap of clay, and then at a later time becomes a long-distance shooter, a sharp-shooter, one who splits a great body, so too, with the complete surmounting of perceptions of forms … a bhikkhu enters and dwells in the base of the infinity of space. He considers whatever phenomena exist there pertaining to feeling, perception, volitional activities, and consciousness as impermanent …. But if he does not attain the destruction of the taints … he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an9.36:8": "(6) –(7) \"When it was said: ‘Bhikkhus, I say that the destruction of the taints also occurs in dependence on the base of the infinity of consciousness … the base of nothingness,’ for what reason was this said?Here, with the complete surmounting of the base of the infinity of consciousness,perceiving‘there is nothing,’ a bhikkhu enters and dwells in the base of nothingness. He considers whatever phenomena exist there pertaining to feeling, perception, volitional activities, and consciousness as impermanent …. But if he does not attain the destruction of the taints … he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an9.36:9": "\"Just as an archer or an archer's apprentice undergoes training on a straw man or a heap of clay, and then at a later time becomes a long-distance shooter, a sharp-shooter, one who splits a great body, so too, with the complete surmounting of the base of the infinity of consciousness … a bhikkhu enters and dwells in the base of nothingness. He considers whatever phenomena exist there pertaining to feeling, perception, volitional activities, and consciousness as impermanent …. But if he does not attain the destruction of the taints … he becomes one of spontaneous birth, due to attain final nibbāna there without ever returning from that world.",
    "an9.36:10": "(8) –(9) \"Thus, bhikkhus, there is penetration to final knowledge as far as meditative attainments accompanied by perception reach. But these two bases—the base of neither-perception-nor-non-perception and the cessation of perception and feeling—I say are to be described by meditative bhikkhus skilled in attainments and skilled in emerging from attainments after they have attained them and emerged from them.\"[n.1921] There are some differences between the readings in Ce, Ee, and Be. I follow Ce:jhāyīh’ete bhikkhave bhikkhūhi samāpattikusalehi samāpattivuṭṭhānakusalehi samāpajjitvā vuṭṭhahitvā samakkhātabbānī ti vadāmi. Ee basically agrees with Ce but printsjhāyī h’ete, as if it had a nominative subject followed by emphatichi.Mp:\"Describedmeans to be properly declared, to be explained, extolled, praised simply as ‘peaceful and sublime’\"(samakkhātabbānīti sammā akkhātabbāni, ‘‘santāni paṇītānī’’ ti evaṁ kevalaṁ ācikkhitabbāni thometabbāni vaṇṇetabbāni)."
}