{
    "an9.7:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha on Mount Vulture Peak. Then the wanderer Sutavā approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Blessed One:",
    "an9.7:2": "\"Bhante, on one occasion the Blessed One was dwelling right here in Rājagaha, the Mountain Fort.[n.1848]Giribbaja, a name for Rājagaha, because of the surrounding mountains.At that time, in the presence of the Blessed One, I heard and learned this: ‘Sutavā, a bhikkhu who is an arahant—one whose taints are destroyed, who has lived the spiritual life, done what had to be done, laid downthe burden, reached his own goal, utterly destroyed the fetters of existence, one completely liberated through final knowledge—is incapable of transgression in five cases. He is incapable of intentionally depriving a living being of life; he is incapable of taking by way of theft what is not given; he is incapable of engaging in sexual intercourse; he is incapable of deliberately speaking falsehood; he is incapable of storing things up in order to enjoy sensual pleasures as he did in the past when a layman.’ Bhante, did I hear that correctly from the Blessed One, grasp it correctly, attend to it correctly, remember it correctly?\"",
    "an9.7:3": "\"Yes, Sutavā, you heard that correctly, grasped it correctly, attended to it correctly, remembered it correctly. In the past, Sutavā, and also now I say thus: ‘A bhikkhu who is an arahant—one whose taints are destroyed … one completely liberated through final knowledge—is incapable of transgression in nine cases. (1) He is incapable of intentionally depriving a living being of life; (2) he is incapable of taking by way of theft what is not given; () he is incapable of engaging in sexual intercourse; (4) he is incapable of deliberately speaking falsehood; (5) he is incapable of storing things up in order to enjoy sensual pleasures as he did in the past when a layman; (6) he is incapable of rejecting the Buddha; (7) he is incapable of rejecting the Dhamma; (8) he is incapable of rejecting the Saṅgha; (9) he is incapable of rejecting the training.’[n.1849]Abhabbo khīṇāsavo bhikkhu sikkhaṁ paccakkhātuṁ. This means, in effect, that he is incapable of giving up the monastic training and returning to lay life. I am following the reading ofCe.Be and Ee have the last four items ofAN9.8here, and their version of the latter has the last four items of the present sutta. Hence in Ee, page 71 falls inAN9.8of the Ce version, following \"a wrong course on account of fear.\"In the past, Sutavā, and also now I say thus: ‘A bhikkhu who is an arahant—one whose taints are destroyed … one completely liberated through final knowledge—is incapable of transgression in these nine cases.’\""
}