{
    "an9.42:1": "Thus have I heard. On one occasion the Venerable Ānanda was dwelling at Kosambī in Ghosita's Park. Then the Venerable Udāyī approached the Venerable Ānanda and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Venerable Ānanda:",
    "an9.42:2": "\"‘The sage, the withdrawn chief bull,the Buddha who awakened to jhāna,the One of Broad Wisdom has foundthe opening amid confinement.’[n.1950] The verse occurs at SN:7, I 48.Beand Ee have a faulty reading of pāda a in AN,sambādhe gataṁ okāsaṁ, as against Cesambādhe vata okāsaṁ. The Be and Ee text of SN:7readsvata. Also, in pāda b, Ce hasavindi, Eeavidā, two aorist forms meaning \"knew.\" But Be hasavidvā, \"unknowing, ignorant,\" which is hard to account for. In SN:7Be also reads the verb asavindi.",
    "an9.42:3": "\"What, friend, has the Blessed One spoken of as confinement and what as the achievement of an opening in the midst of confinement?\"[n.1951] SeeAN9.7.",
    "an9.42:4": "(1) \"Here, friend, secluded from sensual pleasures … a bhikkhu enters and dwells in the first jhāna …. To this extent the Blessed One has spoken of the achievement of an opening amid confinement in a provisional sense.[n.1952]Pariyāyena.Mp:\"For a single reason(ekena kāraṇena). For the first jhāna is called the achievement of an opening with respect merely to the absence of confinement by sensuality, not in every respect.\"There, too, there is confinement. And what is the confinement there?Whatever thought and examination have not ceased there is the confinement in this case.",
    "an9.42:5": "(2) \"Again, friend, with the subsiding of thought and examination, a bhikkhu enters and dwells in the second jhāna …. To this extent, too, the Blessed One has spoken of the achievement of an opening amid confinement in a provisional sense. There, too, there is confinement. And what is the confinement there? Whatever rapture has not ceased there is the confinement in this case.",
    "an9.42:6": "(3) \"Again, friend, with the fading away of rapture, a bhikkhu enters and dwells in the third jhāna …. To this extent, too, the Blessed One has spoken of the achievement of an opening amid confinement in a provisional sense. There, too, there is confinement. And what is the confinement there? Whatever pleasureconnected withequanimity has not ceased there is the confinement in this case.",
    "an9.42:7": "(4) \"Again, friend, with the abandoning of pleasure and pain … a bhikkhu enters and dwells in the fourth jhāna …. To this extent, too, the Blessed One has spoken of the achievement of an opening amid confinement in a provisional sense. There, too, there is confinement. And what is the confinement there? Whatever perception of form[n.1953]Yadeva tattha rūpasaññā aniruddhā hoti. The singular verbhotiindicates that \"perception\" in the singular is intended here. In the immediately following paragraph, however,rūpasaññānaṁandpaṭighasaññānaṁare genitive plurals.has not ceased there is the confinement in this case.",
    "an9.42:8": "(5) \"Again, friend, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving‘space is infinite,’ a bhikkhu enters and dwells in the base of the infinity of space. To this extent, too, the Blessed One has spoken of the achievement of an opening amid confinement in a provisional sense. There, too, there is confinement. And what is the confinement there? Whatever perception of the base of the infinity of space has not ceased there is the confinement in this case.",
    "an9.42:9": "(6) \"Again, friend, by completely surmounting the base of the infinity of space,perceiving‘consciousness is infinite,’ a bhikkhuenters and dwells in the base of the infinity of consciousness. To this extent, too, the Blessed One has spoken of the achievement of an opening amid confinement in a provisional sense. There, too, there is confinement. And what is the confinement there? Whatever perception of the base of the infinity of consciousness has not ceased there is the confinement in this case.",
    "an9.42:10": "(7) \"Again, friend, by completely surmounting the base of the infinity of consciousness,perceiving‘there is nothing,’ a bhikkhu enters and dwells in the base of nothingness. To this extent, too, the Blessed One has spoken of the achievement of an opening amid confinement in a provisional sense. There, too, there is confinement. And what is the confinement there? Whatever perception of the base of nothingness has not ceased there is the confinement in this case.",
    "an9.42:11": "(8) \"Again, friend, by completely surmounting the base of nothingness, a bhikkhu enters and dwells in the base of neither-perception-nor-non-perception. To this extent, too, the Blessed One has spoken of the achievement of an opening amid confinement in a provisional sense. There, too, there is confinement. And what is the confinement there? Whatever perception of the base of neither-perception-nor-non-perception has not ceased there is the confinement in this case.",
    "an9.42:12": "(9) \"Again, by completely surmounting the base of neither-perception-nor-non-perception, a bhikkhu enters and dwells in the cessation of perception and feeling, and having seen with wisdom, his taints are utterly destroyed. To this extent, friend, the Blessed One has spoken of the achievement of an opening amid confinement in a non-provisional sense.\"[n.1954]Nippariyāyena.Mp:\"Not just for a single reason, but because it abandons all confinement, the destruction of the taints is called the achievement of an opening in every way.\""
}