{
    "an9.11:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then the Venerable Sāriputta approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "an9.11:2": "Now on that occasion the Venerable Mahāmoggallāna and the Venerable Ānanda took a key and wandered from dwelling to dwelling,calling out: \"Come forth, venerables! Come forth, venerables! Now the Venerable Sāriputta will roar his lion's roar in the presence of the Blessed One!\"",
    "an9.11:3": "(1) \"Bhante, one who has not established mindfulness directed to the body in regard to his own body might strike a fellow monk and then set out on tour without apologizing.",
    "an9.11:4": "Just as they throw pure and impure things on the earth—feces, urine, spittle, pus, and blood—yet the earth is not repelled, humiliated, or disgusted because of this; sotoo, Bhante, I dwell with a mind like the earth, vast, exalted, and measureless, without enmity and ill will.",
    "an9.11:5": "Just as they wash pure and impure things in water—feces, urine, spittle, pus, and blood—yet the water is not repelled, humiliated, or disgusted because of this; so too, Bhante, I dwell with a mind like water, vast, exalted, and measureless, without enmity and ill will.",
    "an9.11:6": "Just as fire burns pure and impure things—feces, urine, spittle, pus, and blood—yet the fire is not repelled, humiliated, or disgusted because of this; so too, Bhante, I dwell with a mind like fire, vast, exalted, and measureless, without enmity and ill will.",
    "an9.11:7": "Just as air blows upon pure and impure things—feces, urine, spittle, pus, and blood—yet the air is not repelled, humiliated, or disgusted because of this; so too, Bhante, I dwell with a mind like air, vast, exalted, and measureless, without enmity and ill will.",
    "an9.11:8": "Just as a duster wipes off pure and impure things—feces, urine, spittle, pus, and blood—yet the duster is not repelled, humiliated, or disgusted because of this; so too, Bhante, I dwell with a mind like a duster, vast, exalted, and measureless, without enmity and ill will.",
    "an9.11:9": "Just as an outcast boy or girl, clad in rags and holding a vessel, enters a village or town with a humble mind; so too, Bhante, I dwell with a mind like an outcast boy, vast, exalted, and measureless, without enmity and ill will.",
    "an9.11:10": "Just as a bull with his horns cut, mild, well tamed and well trained, wanders from street to street and from square to square without hurting anyone with its feet or horns; so too, Bhante, I dwell with a mind like that of a bull with horns cut, vast, exalted, and measureless, without enmity and ill will.",
    "an9.11:11": "Just as a woman or a man—young, youthful, and fond of ornaments, with head bathed—would berepelled, humiliated, and disgusted if the carcass of a snake, a dog, or a human being were slung around her or his neck; so too, Bhante, I am repelled, humiliated, and disgusted by this foul body.",
    "an9.11:12": "Just as a person might carry around a cracked and perforated bowl of liquid fat that oozes and drips; so too, Bhante, I carry around this cracked and perforated body that oozes and drips.",
    "an9.11:13": "Then thataccusingbhikkhu rose from his seat, arranged his upper robe over one shoulder, prostrated himself with his head at the Blessed One's feet, and said to the Blessed One: \"Bhante, I have committed a transgression in that I so foolishly, stupidly, and unskillfully slandered the Venerable Sāriputta on grounds that are untrue, baseless, and false. Bhante, may the Blessed One accept my transgression seen as a transgression for the sake of future restraint.\"",
    "an9.11:14": "The Blessed One then addressed the Venerable Sāriputta: \"Sāriputta, pardon this hollow man before his head splits into seven pieces right there.\""
}