{
    "an9.12:1": "On one occasion the Blessed One was dwelling at Sāvatthī at Jeta's Grove, Anāthapiṇḍika's Park. Then, in the morning, the Venerable Sāriputta dressed, took his bowl and robe, and entered Sāvatthī for alms. It then occurred to him: \"It is still too early to walk for alms in Sāvatthī. Let me go to the park of the wanderers of other sects.\"[n.854] As atAN7.42.",
    "an9.12:2-3": "Now on that occasion those wanderers had assembled and were sitting together when this conversation arose among them: \"Friends, anyone who passes away with a residue remaining is not freed from hell, the animal realm, or the sphere of afflicted spirits; he is not freed from the plane of misery, the bad destination, the lower world.\"",
    "an9.12:4": "\"Who,[n.1855] I read (twice) withCeand Beke ca, as against Eekeci.Sāriputta, are those foolish and incompetent wanderers of other sects and who are those that know one with a residue remaining as ‘one with a residue remaining’ and one without residue remaining as ‘one without residue remaining’?[n.1856] The contrast is betweensa-upādisesaṁandanupādisesaṁ.Mpglosses these respectively assa-upādānasesaṁ, \"with a residue of clinging,\" andupādānasesarahitaṁ, \"devoid of a residue of clinging.\" SeeAN7.56, which also speaks about those with a residue remaining and those without residue remaining.",
    "an9.12:5": "\"These nine persons, Sāriputta, passing away with a residue remaining, are freed from hell, the animal realm, and the sphere of afflicted spirits; freed from the plane of misery, the bad destination, the lower world. What nine?",
    "an9.12:6": "(2) –(5) \"Again, some person fulfills virtuous behavior and concentration but cultivates wisdom only to a moderate extent. With the utter destruction of the five lower fetters, this person is an attainer of nibbāna upon landing … an attainer of nibbāna without exertion … an attainer of nibbāna through exertion … one bound upstream, heading toward the Akaniṭṭha realm. This is the fifth person, passing away with a residue remaining, who is freed from hell … the lower world.",
    "an9.12:7": "(6) \"Again, some person fulfills virtuous behavior but cultivates concentration and wisdom only to a moderate extent. With the utter destruction of three fetters and with the diminishing of greed, hatred, and delusion, this person is a once-returner who, after coming back to this world only one more time, makes an end of suffering. This is the sixth person, passing away with a residue remaining, who is freed from hell … the lower world.",
    "an9.12:8": "(7) \"Again, some person fulfills virtuous behavior but cultivates concentration and wisdom only to a moderate extent. With the utter destruction of three fetters, this person is a one-seed attainer who, after being reborn once more as a human being,makes an end of suffering. This is the seventh person, passing away with a residue remaining, who is freed from hell … the lower world.",
    "an9.12:9": "(8) \"Again, some person fulfills virtuous behavior but cultivates concentration and wisdom only to a moderate extent. With the utter destruction of three fetters, this person is a family-to-family attainer who, after roaming and wandering on among good families two or three times, makes an end of suffering. This is the eighth person, passing away with a residue remaining, who is freed from hell … the lower world.",
    "an9.12:10": "(9) \"Again, some person fulfills virtuous behavior but cultivates concentration and wisdom only to a moderate extent. With the utter destruction of three fetters, this person is a seventimes-at-most attainer who, after roaming and wandering on among devas and humans seven times at most, makes an end of suffering. This is the ninth person, passing away with a residue remaining, who is freed from hell, the animal realm, and the sphere of afflicted spirits; freed from the plane of misery, the bad destination, the lower world.",
    "an9.12:11": "\"Who, Sāriputta, are those foolish and incompetent wanderers of other sects, and who are those that know one with a residue remaining as ‘one with a residue remaining’ and one without residue remaining as ‘one without residue remaining’?"
}