{
    "an9.39:1": "\"Bhikkhus, in the past a battle was fought between the devas and the asuras. In that battle, the asuras were victorious and the devas were defeated. Defeated, the devas fled north, pursued by the asuras. Then it occurred to the devas: ‘The asuras are still pursuing us. Let's engage them in battle a second time.’ A second time the devas fought a battle with the asuras, and a second time the asuras were victorious and the devas were defeated. Defeated, the devas[n.938]Ceand Ee add herebhītā, \"frightened,\" but it seems this word belongs only in the third case, when the devas flee to their city. In Be it occurs only in relation to the third case.fled north, pursued by the asuras.",
    "an9.39:3": "\"In the past, bhikkhus, a battle was fought between the devas and the asuras. In that battle, the devas were victorious and the asuras were defeated. Defeated, the asuras fled south, pursued by the devas. Then it occurred to the asuras: ‘The devas are still pursuing us. Let's engage them in battle a second time.’ A second time the asuras fought a battle with the devas, and a second time the devas were victorious and the asuras were defeated. Defeated, the asuras fled south, pursued by the devas.",
    "an9.39:4": "Then it occurred to the asuras: ‘The devas are still pursuing us. Let's engage them in battle a third time.’ A third time the asuras fought a battle with the devas, and a third time the devas were victorious and the asuras were defeated. Defeated and frightened, the asuras entered their city.",
    "an9.39:5": "(1) \"So too, bhikkhus, when, secluded from sensual pleasures … a bhikkhu enters and dwells in the first jhāna … on that occasion it occurs to the bhikkhu: ‘Now I am secure from dangerand Māra cannot do anything to me.’ It also occurs to Māra the Evil One: ‘Now the bhikkhu is secure against danger and I cannot do anything to him.’",
    "an9.39:6": "(2) –(4) \"When, with the subsiding of thought and examination, a bhikkhu enters and dwells in the second jhāna … the third jhāna … the fourth jhāna … on that occasion it occurs to the bhikkhu: ‘Now I am secure from danger and Māra cannot do anything to me.’ It also occurs to Māra the Evil One: ‘Now the bhikkhu is secure from danger and I cannot do anything to him.’",
    "an9.39:7": "(5) \"When, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving‘space is infinite,’ a bhikkhu enters and dwells in the base of the infinity of space, on that occasion he is called a bhikkhu who has blinded Māra,[n.1939] All three editions read hereantamakāsi māraṁ. Presumably their editors took this to mean, \"who has made an end to Māra.\" But this is certainly wrong, for two reasons: first, grammatically, this would require the genitivemārassa; and second, it is not true that a meditator in jhāna has \"made an end to Māra.\" Elsewhere we findandhamakāsi māraṁ(at MN I 159,19, I 160,5,10, I 14,15–16, and I 15,5), \"he made Māra blind\" or \"blinded Māra,\" which makes better sense. Ps II 163,4–8, commenting on MN I 159,19, explains: \"He blinded Māra: he did not destroy Māra's eyes, but when a bhikkhu has attained jhāna as a basis for insight, Māra is unable to see the object of his mind. Hence it is said: ‘He blinded Māra’\"(andhamakāsi māran ti na mārassa akkhīni bhindi. Vipassanāpādakajjhānaṁ samāpannassa pana bhikkhuno imaṁ nāma ārammaṇaṁ nissāya cittaṁ vattatī ti māro passituṁ na sakkoti. Tena vuttaṁ \"andhamakāsi māran\" ti).put out Māra's eyes without a trace,[n.1940]Apadaṁ vadhitvā māracakkhuṁ.Mp:\"Put out Māra's eyes without a trace: destroyed (them) completely, without remainder(nippadaṁ niravasesaṁ vadhitvā).\" At MN I 159,19–160,12and MN I 14,15–15,6this whole statement is made aboutall ninemeditative attainments, including the four jhānas. There thus seems to be a difference between the textual lineages about the extent to which this statement applies.and gone beyond sight of the Evil One.",
    "an9.39:8": "(6) –(9) \"When, bhikkhus, by completely surmounting the base of the infinity of space,perceiving‘consciousness is infinite,’ a bhikkhu enters and dwells in the base of the infinity of consciousness …. When, by completely surmounting the base of the infinity of consciousness,perceiving‘there is nothing,’ a bhikkhu enters and dwells in the base of nothingness …. When, by completely surmounting the base of nothingness, a bhikkhu enters and dwells in the base of neither-perception-nor-non-perception …. When, by completely surmounting the base of neither-perception-nor-non-perception, a bhikkhu enters and dwells in the cessation of perception and feeling, and having seen with wisdom, his taints are utterly destroyed, on that occasion he is called a bhikkhu who has blinded Māra, put out Māra's eyes, gone beyond sight of the Evil One, and crossed over attachment to the world.\""
}