{
    "an9.20:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then the householder Anāthapiṇḍika approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One asked him:",
    "an9.20:2": "\"Are alms given in your family, householder?\"",
    "an9.20:3": "\"If, householder, one gives alms, whether coarse or excellent, and one gives respectfully, gives considerately, gives with one's own hand, gives what would not be discarded, gives with a view of future consequences, then wherever the result of that gift is produced for one, one's mind inclines toward the enjoyment of superb food, toward the enjoyment of superb clothing, toward the enjoyment of superb vehicles, toward the enjoyment of whatever is superb among the five objects of sensual pleasure. Also, one's children and wives, and one's slaves, servants, and workers, want to listen to one, lend an ear, and apply their minds to understand. For what reason? Just this is the result of actions that are done respectfully.",
    "an9.20:4": "\"In the past, householder, there was a brahmin named Velāma. He gave such a great alms offering as this:[n.1878] Presumably it is the nine types of gifts that justify including this sutta in the Nines. There seems to be no other ninefold scheme to explain its place in thisnipāta.(1) eighty-four thousand golden bowls filled with silver; (2) eighty-four thousand silver bowls filled with gold; (3) eighty-four thousand bronze bowls filled with bullion; () eighty-four thousand elephants with golden ornaments, golden banners, covered with nets of gold thread; (5) eighty-four thousand chariots with upholstery of lion skins, tiger skins, leopard skins, and saffron-dyed blankets, with golden ornaments, golden banners, covered with nets of gold thread; (6) eighty-four thousand milk cows with jute tethers[n.1879] Cesandassanāni; Besandhanāni; Eesanthanāni.Mpdoes not provide a gloss and PED does not offer a useful definition under any of those readings. But in PEDsandānais defined as \"cord, tether, fetter.\"and bronze pails;[n.1880]Mpglosseskaṁsūpadhāraṇāniasrajatamayakhīrapaṭicchakāni, \"silver receptacles for the milk.\" I am not aware thatkaṁsacan mean silver. DOP svkaṁsasays thatkaṁsūpadhāraṇacan mean \"yielding a pailful of milk,orwith a metal milking-pail.\"Mpadds that the horns of the milk cows were covered with sheaths of gold; people tied garlands of jasmine around their necks, attached ornaments to their four feet, spread an excellent jute cloth over their backs, and tied a golden bell around their necks. Such ways of adorning cattle, though less costly, are still practiced in India today.(7) eighty-four thousand maidens adorned with jeweled earrings; (8) eighty-four thousand couchesspread with rugs, blankets, and covers, with excellent coverings of antelope hide, with canopies and red bolsters at both ends; (9) eighty-four thousandkoṭis[n.1881]Mpsays that conventionally onekoṭiis twenty pairs of cloth, but here ten garments is meant.of cloths made of fine linen, fine silk, fine wool, and fine cotton. How much more of food and drink, snacks, meals, refreshments, and beverages?[n.1882]Annassa pānassa khajjassa bhojjassa leyyassa peyyassa.Leyya, fromlihati, to lick, could mean something to be licked, perhaps things like honey, molasses, and palm sugar.It seemed to be flowing like rivers.",
    "an9.20:5": "\"You might think, householder: ‘He was someone else, the brahmin Velāma who on that occasion gave that great alms offering.’ But you should not look at it in such a way. I myself was the brahmin Velāma who on that occasion gave that great alms offering.",
    "an9.20:6": "Even more fruitful than the great alms offering that the brahmin Velāma gave would it be to feed one person accomplished in view.",
    "an9.20:7": "Even more fruitful than the great alms offering that the brahmin Velāma gave, and feeding a hundred persons accomplished in view, would it be to feed one once-returner.",
    "an9.20:8": "Even more fruitful than the great alms offering that the brahmin Velāma gave, and feeding a hundred once-returners, would it be to feed one non-returner. Even more fruitful than … feeding a hundred non-returners, would it be to feed one arahant. Even more fruitful than … feeding a hundred arahants, would it be to feed one paccekabuddha.Even more fruitful than … feeding a hundred paccekabuddhas, would it be to feed the Tathāgata, the Arahant, the Perfectly Enlightened One … would it be to feed the Saṅgha of bhikkhus headed by the Buddha … would it be to build a dwelling dedicated to the Saṅgha of the four quarters … would it be for one with a mind of confidence to go for refuge to the Buddha, the Dhamma, and the Saṅgha … would it be for one with a mind of confidence to undertake the five training rules: to abstain from the destruction of life, to abstain from taking what is not given, to abstain from sexual misconduct, to abstain from false speech, to abstain from liquor, wine, and intoxicants, the basis for heedlessness. Even more fruitful … would it be to develop a mind of loving-kindness even for the time it takes to pull a cow's udder.",
    "an9.20:9": "\"Even more fruitful, householder, than the great alms offering that the brahmin Velāma gave, and feeding one person accomplished in view, and feeding a hundred persons accomplished in view; and feeding one once-returner, and feeding a hundred once-returners; and feeding one non-returner, and feeding a hundred non-returners; and feeding one arahant, and feeding a hundred arahants; and feeding one paccekabuddha, and feeding a hundred paccekabuddhas; and feeding the Tathāgata, the Arahant, the Perfectly Enlightened One; and feeding the Saṅgha of bhikkhus headed by the Buddha; and building a dwelling dedicated to the Saṅgha of the four quarters; and for one with a mind of confidence to go for refuge to the Buddha, the Dhamma, and the Saṅgha; and for one with a mind of confidence to undertake the five training rules: to abstain from the destruction of life … to abstain from liquor, wine, and intoxicants, the basis for heedlessness; and for one to develop a mind of loving-kindness even for the time it takes to pull a cow's udder,would it be to develop the perception of impermanence just for the time of a finger snap.\"[n.1883]Mp:\"Theperception of impermanenceis strong insight that has reached the peak and is an immediate condition for the path\"(aniccasaññanti maggassa anantarapaccayabhāvena sikhāpattabalavavipassanaṁ)."
}