{
    "an9.34:1": "Thus have I heard. On one occasion the Venerable Sāriputta was dwelling at Rājagaha in the Bamboo Grove, the squirrel sanctuary. There the Venerable Sāriputta addressed the bhikkhus: \"Friends, bhikkhus!\" \"Friend!\" those bhikkhus replied. The Venerable Sāriputta said this:",
    "an9.34:2": "(1) \"Here, friends, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna, which consists of rapture and pleasure born of seclusion, accompanied by thought and examination. If, while that bhikkhu is dwelling in this way, perception and attention accompanied by sensuality occur in him, he feels it as an affliction. Just as pain might arise for one feeling pleasure only to afflict him, so too if that perception and attention accompanied by sensuality occur in him, he feels it as an affliction. But the Blessed One has called affliction suffering. In this way it can be understood how nibbāna is happiness.[n.1909] Brahmāli comments: \"Since nibbāna is ‘extinguishment’ (of suffering), any partial extinguishment of suffering is a partial kind of nibbāna.\"",
    "an9.34:3": "(2) \"Again, with the subsiding of thought and examination, a bhikkhu enters and dwells in the second jhāna …. If, while that bhikkhu is dwelling in this way, perception and attention accompanied by thoughtoccur in him, he feels it as an affliction. Just as pain might arise for one feeling pleasure only to afflict him, so too if that perception and attention accompanied by thought occur in him, he feels it as an affliction. But the Blessed One has called affliction suffering. In this way, too, it can be understood how nibbāna is happiness.",
    "an9.34:4": "(3) \"Again, with the fading away as well of rapture … he enters and dwells in the third jhāna …. If, while that bhikkhu is dwelling in this way, perception and attention accompanied by rapture occur in him, he feels it as an affliction …. In this way, too, it can be understood how nibbāna is happiness.",
    "an9.34:5": "(4) \"Again, with the abandoning of pleasure and pain … a bhikkhu enters and dwells in the fourth jhāna …. If, while that bhikkhu is dwelling in this way, perception and attention accompanied by the pleasureconnected withequanimity[n.1910] Though all three editions here readupe(k)khāsahagatā saññāmanasikārā, I follow the Burmese and Sinhala manuscripts referred to in a note inEe,which readupe(k)khāsukhasahagatā saññāmanasikārā. This fits better with the exposition inAN9.33§4 andAN9.41§4 than the readingupe(k)khāsahagatāin all three printed editions.occur in him, he feels it as an affliction …. In this way, too, it can be understood how nibbāna is happiness.",
    "an9.34:6": "(5) \"Again, with the complete surmounting of perceptions of forms, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity,perceiving‘space is infinite,’ a bhikkhu enters and dwells in the base of the infinity of space. If, while that bhikkhu is dwelling in this way, perception and attention accompanied by forms occur in him, he feels it as an affliction ….… In this way, too, it can be understood how nibbāna is happiness.",
    "an9.34:7": "(6) \"Again, by completely surmounting the base of the infinity of space,perceiving‘consciousness is infinite,’ a bhikkhu enters and dwells in the base of the infinity of consciousness. If, while that bhikkhu is dwelling in this way, perception and attention accompanied by the base of the infinity of space occur in him, he feels it as an affliction …. In this way, too, it can be understood how nibbāna is happiness.",
    "an9.34:8": "(7) \"Again, by completely surmounting the base of the infinity of consciousness,perceiving‘there is nothing,’ a bhikkhu enters and dwells in the base of nothingness. If, while that bhikkhu is dwelling in this way, perception and attention accompanied by the base of the infinity of consciousness occur in him, he feels it as an affliction …. In this way, too, it can be understood how nibbāna is happiness.",
    "an9.34:9": "(8) \"Again, by completely surmounting the base of nothingness, a bhikkhu enters and dwells in the base of neither-perception-nor-non-perception. If, while that bhikkhu is dwelling in this way, perception and attention accompanied by the base of nothingness occur in him, he feels it as an affliction. Just as pain might arise for one feeling pleasure only to afflict him, so too if that perception and attention accompanied by the base of nothingness occur in him, he feels it as an affliction. But the Blessed One has called affliction suffering. In this way, too, it can be understood how nibbāna is happiness.",
    "an9.34:10": "(9) \"Again, by completely surmounting the base of neither-perception-nor-non-perception, a bhikkhu enters and dwells in the cessation of perception and feeling, and having seen with wisdom, his taints are utterly destroyed.",
    "an9.34:11": "In this way, too, it can be understood how nibbāna is happiness.\""
}