{
    "an9.37:1": "On one occasion the Venerable Ānanda was dwelling at Kosambi in Ghosita's Park. There the Venerable Ānanda addressed the bhikkhus: \"Friends, bhikkhus!\"",
    "an9.37:2": "\"It's astounding and amazing, friends, that the Blessed One, the Arahant, the Perfectly Enlightened One, who knows and sees, has discovered the achievement of an opening in the midst of confinement:[n.19] On the meaning of \"confinement\"(sambādha), seeAN9.4below.for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and dejection, for the achievement of the method, for the realization of nibbāna.[n.193] This is the same as the well-known opening statement of the Satipaṭṭhāna Sutta, atDN .1, II 90,8–11;MN 10., I 55,3–56,. It also occurs in AN atAN3.74,AN4.194.AN6.6, andAN10.95.(1) The eye itself as well as those forms will actually be present,and yet one will not experience that base.[n.194]Mp:\"The eye itself…will actually be present(tadeva nāma cakkhuṁ bhavissati): the sensitive substance of the eye is itself unimpaired.As well as those forms(te rūpā): that visible-form object itself will have come into raṅge.And yet one does not experience that base(tañcāyatanaṁ no paṭisaṁvedissati): and yet one does not know that visible-form base.\" I may be wrong in assuming that the nine items are to be obtained by totaling the five kinds of sensory experience with the four formless meditations. Possibly the nine were to be obtained by including the four jhānas (which may have dropped out of the text) with the four formless meditations, and then adding, as the ninth, the special state of concentration referred to at the end of the sutta.() The ear itself as well as those sounds will actually be present, and yet one will not experience that base. (3) The nose itself as well as those odours will actually be present, and yet one will not experience that base. (4) The tongue itself as well as those tastes will actually be present, and yet one will not experience that base. (5) The body itself as well as those tactile objects will actually be present, and yet one will not experience that base.\"",
    "an9.37:3": "When this was said, the Venerable Udāyī said this to the Venerable Ānanda: \"Is it, friend Ānanda, while one is actually percipient or while one is non-percipient that one does not experience that base?\"",
    "an9.37:4": "\"But, friend, of what is one percipient when one does not experience that base?\"",
    "an9.37:5": "(7) \"Again, friend, by completely surmounting the base of the infinity of space,perceiving‘consciousness is infinite,’ a bhikkhu enters and dwells in the base of the infinity of consciousness. When one is thus percipient one does not experience that base.",
    "an9.37:6": "(8) \"Again, friend, by completely surmounting the base of the infinity of consciousness,perceiving‘there is nothing,’ a bhikkhu enters and dwells in the base of nothingness. When one is thus percipient one does not experience that base.[n.1925]Ceand Be both havetihere, indicating the end of a quotation, which suggests that the speaker of the next paragraph is Udāyī. Yet it is clear that Ānanda himself is still speaking. Thus, it seems,tiis an error and should be deleted from Ce and Be. Ee does not haveti.",
    "an9.37:7": "\"Once, friend, I was dwelling at Sāketa in the deer park at Añjana Grove. Then the bhikkhunī Jaṭilagāhiyā[n.1926] SoCeand Ee. Be has the name as Jaṭilavāsikā.Mpsays that she was a resident of Jaṭila city(jaṭilanagaravāsinī). Thejaṭilaswere matted-hair ascetics, but it is questionable whether they were ever numerous enough to constitute a city.approached me, paid homage to me, stood to one side, and said: ‘Bhante Ānanda, the concentration that does not lean forward and does not bend back,[n.192]Mp:\"Does not lean forwardby way of lust, anddoes not bend backby way of hatred\"(rāgavasena na abhinato, dosavasena na apanato).and that is not reined in and checked by forcefully suppressingthe defilements[n.1928] SeeAN5.2. HereMpcomments: \"It is steady, not because one has forcefully and vigorously reined in and suppressed the defilements, but because it has arisen when the defilements are cut off.\"—by being liberated, it is steady; by being steady, it is content; by being content, one is not agitated.[n.1929]Vimuttattā ṭhito, ṭhitattā santusito, santusitattā no paritassati. This sequence is also atSN III 45,13–14, 46,4–5, 54,1–2, 55,34–35, 58,23–24. It is on the basis of the latter passages that I see a change in the subject of the last phrase of the AN text, from \"it,\" referring to thesamādhi, to \"one,\" the person who attains it. While in the AN passage, the participles are masculine singular and thus may be interpreted as referring either to thesamādhior to the person, the SN parallels read:Vimuttattā ṭhitaṁ. Ṭhitattā santusitaṁ. Santusitattā na paritassati. Aparitassaṁ paccattaññeva parinibbāyati. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānātī ti. The neuter singular participles indicate that the subject of the first two phrases iscittaṁ, but withsantusitattā na paritassati, the subject seems to shift fromcittaṁto the person attaining liberation. We can infer by analogy that in the present passage a similar shift occurs, in this case fromsamādhito the person who attains it.Bhante Ānanda, what did the Blessed One say this concentration has as its fruit?’[n.1930]Ayaṁ, bhante Ānanda, samādhi kiṁphalo vutto bhagavatā. The question is ambiguous. It could mean either, \"Of what did the Blessed One say this concentration is the fruit?\" or \"What did the Blessed One say this concentration has as its fruit?\"Mptakes it in the former way, but there are arguments in favor of the latter (see next note).",
    "an9.37:8": "(9) \"When she asked me this, I replied: ‘Sister, the concentration that does not lean forward and does not bend back, and that is not reined in and checked by forcefully suppressingthe defilements—by being liberated, it is steady; by being steady, it is content; by being content, one is not agitated. The Blessed One said this concentration has final knowledge as its fruit.’[n.1931]Ayaṃ, bhagini, samādhi aññāphalo vutto bhagavatā.The compoundaññāphalocould be interpreted either as atappurisa(“this concentration is the fruit of final knowledge”) or as abāhubbīhi(“this concentration has final knowledge as its fruit”). In the former case, thesamādhiis to be identified with the fruit; in the latter, with an achievement preceding the fruit.Mptakes it in the former sense, as the fruit itself: “The nun asks about the concentration of the fruit of arahantship(arahattaphalasamādhi).Final knowledge is arahantship. The Blessed One has spoken of this concentration of the fruit of arahantship. [The intention is:] When one is percipient with the perception of the fruit of arahantship, one does not experience that base.” However, the questionkiṃphalāoccurs repeatedly at SN V 11,22–120,19, where it must mean: “What does it have as its fruit?” And in5:25we findpañcahi, bhikkhave, aṅgehi anuggahitā sammādiṭṭhi ca cetovimuttiphalā hoti … paññāvimuttiphalā ca hoti.The sense here is not that right view is the fruit of liberation of mind and liberation by wisdom, but that right view has liberation of mind and liberation by wisdom as its fruit. Further, in3:101, a samādhi described in exactly the same terms as this one is shown to be the supporting condition for the six higher knowledges, the last of which is the “the taintless liberation of mind, liberation by wisdom.” By analogy, it follows that thissamādhiis not the fruit of final knowledge, but one that yields final knowledge.There is a Chinese parallel to this last portion of the sutta,SĀ557 at T II 146a12–29. In this version, when the bhikkhunī asks Ānanda the question about the concentration of mind without characteristics (=animitta cetosamādhi), he replies that the Buddha said this concentration \"is the fruit of wisdom, the reward of wisdom\" (, which has the same ambiguity that I mentioned in the preceding note).When one is thus percipient too, friend, one does not experience that base.\""
}