{
    "snp1.5:83": "“I ask the muni, one of abundant wisdom,”“the Buddha, lord of the Dhamma, rid of craving,supreme among bipeds, the most excellent of trainers:how many ascetics are there in the world? Please tell me this.” (1)",
    "snp1.5:84": "“There are four kinds of ascetics; there is no fifth,“Being asked in person, let me explain them to you:the conqueror of the path,I followPj II’s explanation ofmaggajina, as against Norman’s suggestion thatjinais derived fromjña.Maggena sabbakilese vijitāvī. Norman (GD174–75) takesmaggajinoto be from Sktmārga-jñaand thus to be equivalent tomaggaññū, with thesvarabhaktivowel added. However, I findPj II’s explanation cogent enough to accept “conqueror” as the intended sense. In Sn alone, the Buddha is referred to asjinaat372a,379b,697d,698a, and996a.Maggajinooccurs atTherigata 1230, glossed atTh-aIII 191,32 withmaggena vijitakileso. The Chinese versions of the sutta, atTI 18b16,TI 167c21, andTI 183b10 all render the first ascetic as道殊勝, which could mean “one victorious over the path,” hence corresponding tomaggajino. The fragmentary Skt version is ambivalent, withmārgajñaḥ(= Pālimaggaññū) in the initial enumeration of types (= verse ) butmārgajinaṃin the questions about the types (= verse 85).the teacher of the path,the one who lives on the path, and the defiler of the path.” (2)",
    "snp1.5:85": "“Whom do the buddhas call a conqueror of the path?”“How is one without equal as a shower of the path?I read withBeandCemaggakkhāyī, as againstEemaggajjhāyī. SeeGD175.Being asked, tell me about one who lives on the path,and explain to me the defiler of the path.” (3)",
    "snp1.5:87": "“One here who, having known the supreme as supreme,explains and analyzes the Dhamma right here,the muni who has cut off doubt, without impulse,is the second bhikkhu,Dutiyaṃ bhikkhunaṃ. I take this as an accusative singular.Bhikkhunaṃcan be taken as either genitive plural (=bhikkhūnaṃ) or accusative singular. I treat it as accusative singular. Commenting ondutiyaṃ bhikkhunaṃ, Norman (atGD176) says that sincebhikkhunaṃ“is certainly accusative singular inverse 513, it is probably the same here.”whom they call a teacher of the path. (5)",
    "snp1.5:88": "“The one on the well-taught trail of the Dhammawho lives on the path, controlled and mindful,resorting to blameless ways of conduct,is the third bhikkhu, whom they call one living on the path. (6)",
    "snp1.5:89": "“Having taken on the dress of the disciplined,one who is brazen, a corrupter of families, impudent,hypocritical, uncontrolled, chaff,living as a dissembler: he is the defiler of the path. (7)",
    "snp1.5:90": "“When a householder who is learned, wise,a noble disciple, has penetrated these, [18]since he knows, ‘They are not all like him,’I take the correct reading to ben’etādisāti(<na+etādisā), as in the lemma ofPj II(Ee).Eehasne ‘tādisā’ti, withnean accusative object. Be hasnetādisā ti, which is ambiguous, and Cete tādisā ti, which agrees in sense with Ee. I take the correct reading to ben’etādisāti(<na+etādisā), as in the lemma ofPj II(Ee). The Skt supports this with its readingsarvenāpy evaṃvidhā bhavanti, wherenais the negation andevaṃvidhācorresponds toetādisā..on seeing such, he does not forsake his faith.On the basis of the Skt parallel, I would change the nominativesaddhāto accusativesaddhaṃ.For how could one equate them:the undefiled with the defiled, the pure with the impure?” (8)"
}