{
    "snp1.12:207": "207From intimacy peril has arisen;\nfrom an abode there arises dust.\nWithout an abode, without intimacy:\nthis truly is the muni’s vision. (1)",
    "snp1.12:208": "208One who, having cut off what has arisen,\nwould not foster what is arising or nurture it —\nthey call him a muni living alone:\nthat great rishi saw the state of peace. (2) [36]",
    "snp1.12:209": "209Having comprehended the grounds, having crushed the seed,\nhe would not nurture it with moisture.\nTruly, that muni, a seer of the final end of birth,\nhaving abandoned thought, cannot be designated. (3)",
    "snp1.12:210": "210Having known all residences,\nnot desiring any one of them, he who is\ntruly a muni, devoid of greed, greedless,\ndoes not endeavor, for he has gone beyond. (4)",
    "snp1.12:211": "211One who has overcome all, all-knowing, very wise,\nuntainted among all things,\nwho has cast off all, liberated in the destruction of craving:\nhe is one the wise know as a muni. (5)",
    "snp1.12:212": "212One with the power of wisdom,\nequipped with good behavior and observances,\nconcentrated, delighting in jhāna, mindful,\nfreed from ties, not barren, without influxes:\nhe, too, is one the wise know as a muni. (6)",
    "snp1.12:213": "213Living alone, a muni, heedful,\nnot swayed by blame and praise —\nlike a lion not alarmed among sounds,\nlike the wind not caught in a net,\nlike a lotus not tainted by water,\na leader of others, not by others led:\nhe, too, is one the wise know as a muni. (7) [37]",
    "snp1.12:214": "214One who remains steadfast like a pillar at a ford\nwhen others speak provocative words about some matter;\nwho is devoid of lust, with well-concentrated faculties:\nhe, too, is one the wise know as a muni. (8)",
    "snp1.12:215": "215One who is inwardly firm, straight as a shuttle,\ndisgusted with actions that are evil,\nwho investigates the uneven and the even:\nhe, too, is one the wise know as a muni. (9)",
    "snp1.12:216": "216One self-controlled does nothing evil;\nwhen young and middle-aged, the muni is restrained.\nIrreproachable, he does not scold anyone:\nhe, too, is one the wise know as a muni. (10)",
    "snp1.12:217": "217Whether from the top, the middle, or the remainder,\nwhatever food an alms-collector may receive,\nhe does not think to praise it or disparage it:\nhe, too, is one the wise know as a muni. (11)",
    "snp1.12:218": "218The muni who lives abstinent from sexual union,\nwho even in youth is not bound anywhere,\nabstinent from vanity and heedlessness, fully released:\nhe, too, is one the wise know as a muni. (12)",
    "snp1.12:219": "219Having known the world, a seer of the supreme goal,\nan impartial one who has crossed the flood and ocean, [38]\nwhose knots are cut, unattached, without influxes:\nhe, too, is one the wise know as a muni. (13)",
    "snp1.12:220": "220The two are dissimilar, their dwelling and conduct far apart:\nthe layman supporting a wife and the ascetic owning nothing.\nThe layman is unrestrained in harming other beings,\nwhile the muni, ever restrained, protects living beings. (14)",
    "snp1.12:221": "221Just as the blue-necked peacock, flying in the sky,\nnever approaches the speed of a goose,\nso the layman is no match for the bhikkhu,\na muni meditating secluded in the woods. (15)"
}