{
    "snp1.5:83": "83“I ask the muni, one of abundant wisdom,”\n“the Buddha, lord of the Dhamma, rid of craving,\nsupreme among bipeds, the most excellent of trainers:\nhow many ascetics are there in the world? Please tell me this.” (1)",
    "snp1.5:84": "84“There are four kinds of ascetics; there is no fifth,\n“Being asked in person, let me explain them to you:\nthe conqueror of the path,I follow Pj II’s explanation of maggajina, as against Norman’s suggestion that jina is derived from jña. Maggena sabbakilese vijitāvī. Norman (GD 174–75) takes maggajino to be from Skt mārga-jña and thus to be equivalent to maggaññū, with the svarabhakti vowel added. However, I find Pj II’s explanation cogent enough to accept “conqueror” as the intended sense. In Sn alone, the Buddha is referred to as jina at 372a, 379b, 697d, 698a, and 996a. Maggajino occurs at Therigata 1230, glossed at Th-a III 191,32 with maggena vijitakileso. The Chinese versions of the sutta, at T I 18b16, T I 167c21, and T I 183b10 all render the first ascetic as 道殊勝, which could mean “one victorious over the path,” hence corresponding to maggajino. The fragmentary Skt version is ambivalent, with mārgajñaḥ (= Pāli maggaññū) in the initial enumeration of types (= verse 84) but mārgajinaṃ in the questions about the types (= verse 85). the teacher of the path,\nthe one who lives on the path, and the defiler of the path.” (2)",
    "snp1.5:85": "85“Whom do the buddhas call a conqueror of the path?”\n\n“How is one without equal as a shower of the path?I read with Be and Ce maggakkhāyī, as against Ee maggajjhāyī. See GD 175.\nBeing asked, tell me about one who lives on the path,\nand explain to me the defiler of the path.” (3)",
    "snp1.5:87": "87“One here who, having known the supreme as supreme,\nexplains and analyzes the Dhamma right here,\nthe muni who has cut off doubt, without impulse,\nis the second bhikkhu,Dutiyaṃ bhikkhunaṃ. I take this as an accusative singular. Bhikkhunaṃ can be taken as either genitive plural (= bhikkhūnaṃ) or accusative singular. I treat it as accusative singular. Commenting on dutiyaṃ bhikkhunaṃ, Norman (at GD 176) says that since bhikkhunaṃ “is certainly accusative singular in verse 513, it is probably the same here.” whom they call a teacher of the path. (5)",
    "snp1.5:88": "88“The one on the well-taught trail of the Dhamma\nwho lives on the path, controlled and mindful,\nresorting to blameless ways of conduct,\nis the third bhikkhu, whom they call one living on the path. (6)",
    "snp1.5:89": "89“Having taken on the dress of the disciplined,\none who is brazen, a corrupter of families, impudent,\nhypocritical, uncontrolled, chaff,\nliving as a dissembler: he is the defiler of the path. (7)",
    "snp1.5:90": "90“When a householder who is learned, wise,\na noble disciple, has penetrated these, [18]\nsince he knows, ‘They are not all like him,’I take the correct reading to be n’etādisā ti (< na + etādisā), as in the lemma of Pj II (Ee). Ee has ne ‘tādisā’ ti, with ne an accusative object. Be has netādisā ti, which is ambiguous, and Ce te tādisā ti, which agrees in sense with Ee. I take the correct reading to be n’etādisā ti (< na + etādisā), as in the lemma of Pj II (Ee). The Skt supports this with its reading sarve nāpy evaṃvidhā bhavanti, where na is the negation and evaṃvidhā corresponds to etādisā..\non seeing such, he does not forsake his faith.On the basis of the Skt parallel, I would change the nominative saddhā to accusative saddhaṃ.For how could one equate them:\nthe undefiled with the defiled, the pure with the impure?” (8)"
}