{
    "snp1.3:35": "35Having put down the rod toward all beings,\nnot harming a single one among them,\none should not desire a son, how then a companion?\nOne should live alone like a rhinoceros horn. (1)",
    "snp1.3:36": "36For one who has formed bonds, there is affection;Be and Ce have the plural here, bhavanti snehā, while Ee has the singular bhavati sneho. Pj II has the singular in the lemma: Be bhavati sneho, Ce and Ee bhavati sineho\nfollowing on affection, this suffering arises.\nDiscerning the danger born of affection,\none should live alone like a rhinoceros horn. (2)",
    "snp1.3:37": "37Sympathizing with friends dear to one’s heart,\nwith mind attached, one forsakes the good.\nSeeing this peril in intimacy,\none should live alone like a rhinoceros horn. (3)",
    "snp1.3:38": "38As widespread bamboo becomes entwined,\njust so is concern for wives and sons. [7]\nBut like a bamboo shoot, not getting stuck,Be sajjamāno must be a typographical error. Nidd II 219 (Be) and Pj II (Be) both read asajjamāno.\none should live alone like a rhinoceros horn. (4)",
    "snp1.3:39": "39As a deer unbound in the forest\ngoes off to graze wherever it wants,\nso a wise person, looking out for freedom,\nshould live alone like a rhinoceros horn. (5)",
    "snp1.3:40": "40One is addressed in the midst of companions,\nwhether resting, standing, going, or traveling.\nLooking out for the freedom that is not coveted,\none should live alone like a rhinoceros horn. (6)",
    "snp1.3:41": "41There is play and delight in the midst of companions,\nand affection for one’s sons is vast.\nAverse to separation from those who are dear,\none should live alone like a rhinoceros horn. (7)",
    "snp1.3:42": "42. At home in the four directions, unrepelled,\ncontented with anything whatsoever,\nenduring obstacles, fearless,\none should live alone like a rhinoceros horn. (8)",
    "snp1.3:": "43. Even some monastics are hard to please;\nso, too, householders living at home.\nBeing unconcerned about others’ sons,\none should live alone like a rhinoceros horn. (9)",
    "snp1.3:44": "44. Having discarded the marks of a layman\nlike a koviḷāra tree whose leaves are shed,Reading saṃsīnapatto with Ce and Ee in both text and Pj II, as against Be sañchinnapatto. [8]\nhaving cut off a layman’s bonds, the hero\nshould live alone like a rhinoceros horn. (10)",
    "snp1.3:45": "45. If one should find a judicious companion,\na fellow wanderer, of good behavior, resolute,\nhaving overcome all obstacles, one should\nlive with him, satisfied and mindful.The verse is identical with Dhp 328 (11)",
    "snp1.3:46": "46. But if one does not find a judicious companion,\na fellow wanderer, of good behavior, resolute,\nlike a king who has abandoned a conquered realm,Or, on the alternative interpretation suggested by Pj II, “the country he has ruled.” On King Sutasoma, see Ja no. 537 (V 455 foll.); on King Mahājanaka, Ja no. 539 (VI 30 foll.). It seems that Pj II is offering two interpretations of raṭṭhaṃ vijitaṃ. On the first, beginning with yathā paṭirājā, vijitaṃ is taken as the past participle meaning “conquered.” On the second, illustrated by the examples of King Sutasoma and King Mahājanaka, who both renounced their own kingdoms — not realms they had conquered — vijitaṃ is taken simply as a synonym of raṭṭhaṃ. In support of the second alternative, Norman writes (GD 159): “We may assume then that vijitaṃ and raṭṭhaṃ are in apposition, with vijitaṃ simply meaning ‘kingdom,’ with no idea of conquest.” An alternative interpretation, not in the commentary but better suited to the context, is that the king abandons his own country when it has been conquered by others.\none should live alone like a rhinoceros horn.The first three lines are identical with Dhp329a-c. (12)",
    "snp1.3:47": "47. Surely, we praise the excellence of companionship:\none should resort to companions one’s equal or better.\nNot obtaining these, as one who eats blamelessly\none should live alone like a rhinoceros horn. (13)",
    "snp1.3:48": "48. Having seen radiant [bracelets] of gold,\nskillfully fashioned by a goldsmith,\nclashing together in pairs on the arm,\none should live alone like a rhinoceros horn. (14)",
    "snp1.3:49": "49Thus if I had a partner, I would incur\n[fond] words of address or verbal friction.\nLooking out for this peril in the future,\none should live alone like a rhinoceros horn. (15)",
    "snp1.3:50": "50Sensual pleasures are colorful, sweet, delightful,\nbut in their diversity they agitate the mind.\nHaving seen danger in the strands of sensual pleasure,\none should live alone like a rhinoceros horn. (16)",
    "snp1.3:51": "51“This is adversity, a boil, disaster,\nan illness, a dart, and peril for me”:\nhaving seen this peril in the strands of sensual pleasure,\none should live alone like a rhinoceros horn. (17) [9]",
    "snp1.3:52": "52Cold and heat, hunger, thirst,\nwind, the hot sun, gadflies, and serpents:\nhaving patiently endured all these,\none should live alone like a rhinoceros horn. (18)",
    "snp1.3:53": "53As an elephant that has abandoned the herd —\nwith massive back, lotus-like, eminent —\nmay live in the forest as he pleases,\none should live alone like a rhinoceros horn. (19)",
    "snp1.3:54": "54It is impossible that one who delights in company\nmight attain even temporary liberation.\nHaving attended to the word of the Kinsman of the Sun,\none should live alone like a rhinoceros horn. (20)",
    "snp1.3:55": "55“I have transcended the contortions of views,\nreached the fixed course, obtained the path.\nI have aroused knowledge, I’m not to be led by others”:\none should live alone like a rhinoceros horn. (21)",
    "snp1.3:56": "56Without greed, without scheming,\nwithout thirst, not denigrating,\nwith stains and delusion blown away,\nwithout wishes for anything in all the world,\none should live alone like a rhinoceros horn. (22)",
    "snp1.3:57": "57One should avoid an evil companion,\nwho shows what is harmful, one settled in unrighteousness.\nOne should not freely associate\nwith one who is intent and heedless;\none should live alone like a rhinoceros horn. (23) [10]",
    "snp1.3:58": "58One should resort to the learned, a bearer of Dhamma,\nan eminent friend gifted with ingenuity.\nHaving known the benefits and removed doubt,\none should live alone like a rhinoceros horn. (24)",
    "snp1.3:59": "59Having found no satisfaction in the world\nwith play, delight, and sensual pleasures,\nnot taking any interest in them,\nrefraining from ornaments, a speaker of truth,\none should live alone like a rhinoceros horn. (25)",
    "snp1.3:60": "60Having abandoned children and wife,\nfather and mother, wealth, grain, and relatives,\nsensual pleasures according to the limit,\none should live alone like a rhinoceros horn. (26)",
    "snp1.3:61": "61“This is a tie, the happiness here is slight,\ngiving little gratification; the suffering here is more,\nthis is a hook”: having known thus, a thoughtful person\nshould live alone like a rhinoceros horn. (27)",
    "snp1.3:62": "62Having sundered the fetters,\nlike a fish in the water that has broken a net,\nlike a fire not returning to what has been burnt,\none should live alone like a rhinoceros horn. (28)",
    "snp1.3:63": "63With downcast gaze, not footloose,\nwith guarded faculties, with protected mind,\nunpolluted, not feverish with passion,\none should live alone like a rhinoceros horn. (29)",
    "snp1.3:64": "64Having cast off the marks of a layman\nlike a pāricchattaka tree that has shed its leaves,In pāda b of the verse, Be and Ce have sañchannapatto, as against Ee saṃchinnapatto, “whose leaves have fallen.” Norman, at GD 164–65, accepts sañchannapatto but suggests channa may be from Skt śanna (root śad), “fallen, decayed, withered” (SED). Jayawickrama accepts the Ee reading and renders the phrase “with its leaves destroyed.” Nidd II 261 has sañchannapatto, explained as “covered with foliage, with thick shade” (bahalapattapalāso sandacchāyo). Regardless of the reading and the commentarial attempts to construe the sense, the simile, it seems, must convey the idea of shedding leaves to match the way a renouncer sheds his layman’s garb in taking on the ochre robes. [11]\nclothed in ochre robes, having renounced,\none should live alone like a rhinoceros horn. (30)",
    "snp1.3:65": "65Not arousing greed for tastes, not hankering for them;\nnot nourishing others, walking for alms without skipping houses;\nwith a mind unbound to this or that family,\none should live alone like a rhinoceros horn. (31)",
    "snp1.3:66": "66Having abandoned the five obstructions of mind,\nhaving dispelled all mental defilements,\nindependent, having cut off affection and hatred,\none should live alone like a rhinoceros horn. (32)",
    "snp1.3:67": "67Having left behind pleasure and pain\nand previously [discarded] joy and dejection,\nhaving gained purified equanimity and serenity,\none should live alone like a rhinoceros horn. (33)",
    "snp1.3:68": "68With energy aroused to attain the supreme goal,\nwith unsluggish mind and robust practice,\nfirmly persistent, equipped with strength and power,\none should live alone like a rhinoceros horn. (34)",
    "snp1.3:69": "69Not neglecting seclusion and jhāna,\nalways acting in accordance with the teachings,\nhaving explored the danger in states of existence,\none should live alone like a rhinoceros horn. (35)",
    "snp1.3:70": "70Yearning for craving’s destruction, heedful,\nintelligent, learned, mindful,\nhaving comprehended the Dhamma,\nfixed in destiny, vigorous in striving,\none should live alone like a rhinoceros horn. (36) [12]",
    "snp1.3:71": "71Like a lion unalarmed among sounds,\nlike the wind not caught in a net,\nuntainted like a lotus by water,\none should live alone like a rhinoceros horn. (37)",
    "snp1.3:72": "72Like the lion, king of beasts,\nwho has fangs as its strength,\nwho lives by attacking and overpowering,\none should resort to remote lodgings;\none should live alone like a rhinoceros horn. (38)",
    "snp1.3:73": "73At the right time pursuing liberation by loving-kindness,\nequanimity, compassion, and altruistic joy,Pj II explains that the four brahmavihāras are stated out of sequence for metrical reasons.\nnot antagonized by the whole world,\none should live alone like a rhinoceros horn. (39)",
    "snp1.3:74": "74Having abandoned lust, hatred, and delusion,\nhaving sundered the fetters [that keep one bound],\nnot terrified at the extinction of life,\none should live alone like a rhinoceros horn. (40)",
    "snp1.3:75": "75They resort to you and serve you for a motive;\nfriends without motive are today very rare.\nImpure people are wise about their own good:\none should live alone like a rhinoceros horn. (41)"
}