{
    "snp2.12:343": "343“We askAll three editions use the plural pucchāma, but Th 1272 has the singular pucchāmi. the teacher of perfect wisdom,\nthe cutter-off of doubts in this very life:\na bhikkhu passed away at Aggāḷava,\none well known, famous, inwardly quenched. (1)",
    "snp2.12:344": "344“Nigrodhakappa was his name,\nwhich you, Blessed One, gave to the brahmin.\nEnergetic, he lived intent on release,\npaying homage to you, the one who shows the durable. (2)",
    "snp2.12:345": "345“O Sakya, we too all wish to know\nabout that disciple, O universal eye.\nFully attentive, our ears are ready to hear;\nyou are our teacher; you are unsurpassed. (3)",
    "snp2.12:346": "346“Cut off our doubt! Tell me this:\nannounce he attained nibbāna, you of broad wisdom.\nSpeak up in our midst, O universal eye,\nlike thousand-eyed Sakka among the devas. (4)",
    "snp2.12:347": "347“Whatever knots are here, paths of delusion,\nfactions of ignorance, bases of doubt, [61]\non reaching the Tathāgata, they no longer exist;\nfor he is the supreme eye for humans. (5)",
    "snp2.12:348": "348“If no man would ever dispel the defilements\nas a wind might dispel a mass of clouds,\nthe entire world would be enshrouded, utter darkness,\nand even brilliant men would not shine. (6)",
    "snp2.12:349": "349“But wise men are makers of light.\nI consider you, O hero,I read with Be vīra, as against Ce and Ee dhīra. The gloss in Pj II, padhānaviriyasamannāgata, indicates that vīra was the reading available to the commentator. to be such a one.\nKnowing, we come to one endowed with insight:\nin the assemblies, disclose to us [the fate of] Kappa. (7)",
    "snp2.12:350": "350“Quickly send forth your lovely voice, O lovely one!With Be, I would insert a space, reading vaggu vagguṃ, taking vaggu as a vocative and vagguṃ in apposition to giraṃ.\nLike a goose that has stretched out, gently honk\nwith your rounded voice, well-modulated.\nWe are all upright: let us hear you! (8)",
    "snp2.12:351": "351“He has abandoned birth and death entirely;\nhaving pressed the pure one, I will make him speak the Dhamma.\nFor worldlings cannot act on their wishes,\nbut for the tathāgatas, action is based on comprehension. (9)",
    "snp2.12:352": "352“This excellent declaration of yours\nhas been accepted [as coming] from one of upright wisdom.\nThis last reverential salutation is offered.\nKnowing, do not delude us, you of perfect wisdom. (10)",
    "snp2.12:353": "353“Having understood the noble Dhamma from top to bottom,\nknowing, do not delude us, O one of perfect energy. [62]\nAs one afflicted by heat in summer longs for water,\nI long for your word: so pour down the sound!I read with Be and Ce sutaṃ pavassa, as against Ee sutassavassa. (11)",
    "snp2.12:354": "354“Was the beneficial spiritual life\nthat Kappāyana led not lived in vain by him?\nDid he attain nibbāna or did a residue remain?\nLet us hear just how he was liberated.” (12)",
    "snp2.12:355": "355“He cut off craving here for name-and-form,”\n“the stream of the Dark One that had long lay dormant.\nHe crossed over birth and death entirely.”\nThus spoke the Blessed One, chief of the five. (13)",
    "snp2.12:356": "356“Having heard your word,\nI am pleased, O best of rishis.\nIndeed, my question was not in vain;\nthe brahmin did not deceive me. (14)",
    "snp2.12:357": "357“The Buddha’s disciple was one\nwho acted in accordance with what he said.\nHe cut through the net of Death,\nextended tightly by the Deceiver. (15)",
    "snp2.12:358": "358“Kappiya, O Blessed One,\nsaw the origin of clinging.\nKappāyana, indeed, overcame\nthe domain of Death so hard to cross.” (16) [63]"
}