{
    "snp2.1:222": "[39] Whatever beings are gathered here,whether of the earth or in the sky,may all beings indeed be happyand then listen carefully to what is said. (1)",
    "snp2.1:223": "Therefore, O beings, all of you listen;show loving-kindness to the human population,who day and night bring you offerings;therefore, being heedful, protect them. (2)",
    "snp2.1:224": "Whatever treasure exists here or beyond,or the sublime gem in the heavens,there is none equal to the Tathāgata.This too is the sublime gem in the Buddha:by this truth, may there be safety! (3)",
    "snp2.1:225": "Destruction, dispassion, the deathless, the sublime,which Sakyamuni, concentrated, attained:there is nothing equal to that Dhamma.This too is the sublime gem in the Dhamma:by this truth, may there be safety! (4)",
    "snp2.1:226": "The purity that the supreme Buddha praised,which they call concentration without interval — [40]the equal of that concentration does not exist.This too is the sublime gem in the Dhamma:by this truth, may there be safety! (5)",
    "snp2.1:227": "The eight persons praised by the goodconstitute these four pairs.These, worthy of offerings, are the Fortunate One’s disciples;gifts given to them yield abundant fruit.This too is the sublime gem in the Sangha:by this truth, may there be safety! (6)",
    "snp2.1:228": "Those who strived well with a firm mind,who are desireless in Gotama’s teaching,have reached attainment, having plunged into the deathless,enjoying perfect peace obtained free of charge.This too is the sublime gem in the Sangha:by this truth, may there be safety! (7)",
    "snp2.1:229": "As a gate post, planted in the ground,would be unshakable by the four winds,similarly I speak of the good personwho, having experienced them, sees the noble truths.This too is the sublime gem in the Sangha:by this truth, may there be safety! (8)",
    "snp2.1:230": "Those who have cognized the noble truthswell taught by the one of deep wisdom,even if they are extremely heedless,do not take an eighth existence.This too is the sublime gem in the Sangha:by this truth, may there be safety! (9)",
    "snp2.1:231": "Together with one’s achievement of visionthree things are discarded: [41]the view of the personal entity and doubt,and whatever good behavior and observances there are.One is also freed from the four planes of miseryBecounts this line as the beginning of a new verse, which it numbers 234. Such a division seems arbitrary, even mistaken. I followCeandEe, which treat this as a single verse of eight lines.and is incapable of doing six deeds.This too is the sublime gem in the Sangha:by this truth, may there be safety! (10)",
    "snp2.1:232": "Although one does a bad deedby body, speech, or mind,one is incapable of concealing it;such inability is stated for one who has seen the state.This too is the sublime gem in the Sangha:by this truth, may there be safety! (11)",
    "snp2.1:233": "Like a woodland thicket with flowering crestsin a summer month, in the first of the summer,just so he taught the excellent Dhamma,leading to nibbāna, for the supreme welfare.This too is the sublime gem in the Buddha:by this truth, may there be safety! (12)",
    "snp2.1:234": "The excellent one, knower of the excellent,giver of the excellent, bringer of the excellent,the unsurpassed one taught the excellent Dhamma.This too is the sublime gem in the Buddha:by this truth, may there be safety! (13)",
    "snp2.1:235": "The old is destroyed, there is no new origination,their minds are dispassionate toward future existence.With seeds destroyed, with no desire for growth, [42]those wise ones are extinguished like this lamp.This too is the sublime gem in the Sangha:by this truth, may there be safety! (14)",
    "snp2.1:236": "Whatever beings are gathered here,whether of the earth or in the sky,we pay homage to the thus-gone Buddha,venerated by devas and humans: may there be safety! (15)",
    "snp2.1:237": "Whatever beings are gathered here,whether of the earth or in the sky,we pay homage to the thus-gone Dhamma,venerated by devas and humans: may there be safety! (16)",
    "snp2.1:238": "Whatever beings are gathered here,whether of the earth or in the sky,we pay homage to the thus-gone Sangha,venerated by devas and humans: may there be safety! (17)"
}