{
    "snp2.2:239": "239“Wild millet, grains from grasses, highland pulses,\ngreen leaves, tubers, and squashes:\neating these, righteously obtained, the good\ndo not speak lies, desiring sensual pleasures. (1)",
    "snp2.2:240": "240“But eating food well prepared, well flavored,\ngiven by others, presented with respect, delicious, [43]\nenjoying a dish of fine rice,\nyou eat I read bhuñjasi/bhuñjasī with Be and the lemma in all three editions of Pj II, as against Ce and Ee bhuñjatī. carrion, O Kassapa! (2)",
    "snp2.2:241": "241“You said, O kinsman of Brahmā,\n‘Carrion is not proper for me,’\nyet you are enjoying a dish of fine rice,\nwell prepared with the flesh of fowl.\nI ask you about this matter, Kassapa:\nwhat do you take to be carrion?” (3)",
    "snp2.2:242": "242“Destruction of life, beating, mutilating, binding;\ntheft, false speech, fraudulence and cheating,\nstudying useless subjects, resorting to the wives of others:\nthis is carrion, but not the eating of meat. (4)",
    "snp2.2:243": "243“People here uncontrolled in sensual pleasures,\ngreedy for tastes, mixed up with impurity,\nwho hold the nihilist view, warped, stubborn:\nthis is carrion, but not the eating of meat. (5)",
    "snp2.2:244": "244“Those who are rough, violent, backbiters,\nbetrayers of friends, cruel-hearted, arrogant,\nmiserly, who do not give to anyone:\nthis is carrion, but not the eating of meat. (6) [44]",
    "snp2.2:245": "245“Anger, vanity, obstinacy, recalcitrance,\nhypocrisy, envy, and boastfulness,\nhaughtiness, and intimacy with the bad:\nthis is carrion, but not the eating of meat. (7)",
    "snp2.2:246": "246“Those ill behaved, debt-evaders, slanderers,\ncrooked in their dealings, dissemblers here;\nvile men who here commit wicked deeds:\nthis is carrion, but not the eating of meat. (8)",
    "snp2.2:247": "247“Those people here uncontrolled toward living beings,\nwho steal from others, intent on inflicting harm,\nimmoral, cruel, harsh, disrespectful:\nthis is carrion, but not the eating of meat. (9)",
    "snp2.2:248": "248“Those who are greedy toward these, hostile, transgressors,\never intent, who are heading for darkness after death,\nbeings who fall head first into hell:\nthis is carrion, but not the eating of meat. (10)",
    "snp2.2:249": "249“Neither [avoiding] fish and meat nor fasting,\nnor nakedness, a shaven head, matted locks, dirt, or rough antelope hides,\nnor tending the sacrificial fire,\nor the many austerities in the world aimed at immortality,\nsacred hymns, oblations, sacrifices, and seasonal penances,\npurify a mortal who has not overcome doubt. (11) [45]",
    "snp2.2:250": "250“One guarded over the sense doors\nshould live with sense faculties understood,Reading viditindriyo with Be and Ce and all three editions of Pj II, as against Ee vijitindriyo. While vijitindriyo makes better sense, the gloss by Pj II, ñātapariññāya chaḷindriyāni viditvā pākaṭāni katvā careyya, confirms that the commentator read viditindriyo.\nfirm in Dhamma, delighting in honesty and mildness.\nA wise one who has overcome the ties,\nwho has abandoned all suffering,\nis not tainted by things seen and heard.” (12)",
    "snp2.2:251": "251Thus the Blessed One repeatedly explained this matter;\nthe master of the sacred hymns understood it.\nThe muni, free of carrion, unattached, hard to lead,\nelucidated it with variegated verses. (13)",
    "snp2.2:252": "252Having heard the Buddha’s well-spoken word,\nwhich was free of carrion, dispelling all suffering,\nhumble in mind [Tissa] venerated the Tathāgata,\nand right there declared he would go forth. (14)"
}