{
    "snp2.14:376": "376“I ask you, Gotama, one of broad wisdom:\nHow does a good disciple act,\nwhether one who has gone from home to homelessness\nor those lay followers who live at home? (1)",
    "snp2.14:377": "377“For you know the course and destination\nof the world together with its devas.\nThere is none equal to you, one who shows the subtle meaning,\nfor they say you are the excellent Buddha. (2)",
    "snp2.14:378": "378“Having directly experienced all knowledge,\nyou reveal the Dhamma, taking compassion on beings.\nYour coverings are removed, you are the universal eye;\nstainless, you shine radiantly in all the world. (3) [67]",
    "snp2.14:379": "379“Erāvaṇa, the nāga king, came into your presence\nwhen he heard you are ‘the Conqueror.’\nHaving consulted with you, he departedNorman reads mantayitvā jagāma. Jagāma is a perfect form of gacchati. Pj II 369,16 accepts the received reading of the verb ajjhagamā and comments: ajjhagamā ti adhiagamā, gato ti vuttaṃ hoti. Norman (GD 230) adopts von Hinüber’s suggestion that we read here “an historically correct perfect form jagāma,” which “not only corrects the metre, but also gives a better sense, since we need a translation ‘went away,’ which a form from adhigam– would not give.”\n[saying] “Excellent,” delighted to have heard [your words]. (4)",
    "snp2.14:380": "380“King Vessavaṇa Kuvera also approached you,\ninquiring about the Dhamma.\nWhen questioned, you answered him, O wise one,\nand he too, having listened, was delighted. (5)",
    "snp2.14:381": "381“Adherents of other sects given to debate,\nwhether Ājīvikas or Nigaṇṭhas,\nall fail to overtake you in wisdom,\nas one standing cannot overtake one walking swiftly. (6)",
    "snp2.14:382": "382“These brahmins given to debate,\nand also some who are elder brahmins,\nare all dependent on you for the meaning,\nas are others who think themselves debaters. (7)",
    "snp2.14:383": "383“For this Dhamma, subtle and blissful,\nhas been well proclaimed by you, O Blessed One.\nAll wish to hear that alone: when asked,\ndeclare it to us, supreme Buddha.I read here with Be and Ce taṃ no vada as against Ee tvaṃ no vada. Pj II recognizes the latter as a variant but gives primacy to the former. (8)",
    "snp2.14:384": "384“All these bhikkhus sitting together\nand the lay followers as well [wish] to hear it.\nLet them hear the Dhamma realized by the stainless one\nas the devas listen to Vāsava’s well-spoken words.”Vāsava is another name for Sakka, ruler of the devas. (9)",
    "snp2.14:385": "385“Listen to me, bhikkhus, I will proclaim to you\nthe cleansing Dhamma; all retain it in mind.I read here with Ce and Ee dharātha, as against Be carātha. [68]\nA thoughtful person, seeing the good,\nshould adopt that deportment proper for a monk. (10)",
    "snp2.14:386": "386“A bhikkhu should not wander at the wrong time;\nbut at the proper time he should walk to the village for alms.Ce and Ee have gāmaṃ as against Be gāme.\nFor ties stick to one given to untimely wandering;\nhence the buddhas do not wander at the wrong time. (11)",
    "snp2.14:387": "387“Forms and sounds, tastes and odors,\nand tactile objects drive beings mad.\nHaving removed desire for these things,\nat the proper time one should enter for the morning meal. (12)",
    "snp2.14:388": "388“Then, having obtained alms on the occasion,\nhaving returned alone, one should sit down in seclusion.\nReflecting inwardly, one should not let one’s mind\nwander outside but should keep oneself collected. (13)",
    "snp2.14:389": "389“If he should converse with a disciple,\nor with anyone else, or with a bhikkhu,\nhe should speak about the sublime Dhamma;\nhe should not slander or criticize others. (14)",
    "snp2.14:390": "390“For some contend in debate,\nbut we do not praise those of slight wisdom.\nTies from here and there stick to them,\nfor they send their minds far away. (15)",
    "snp2.14:391": "391“Alms, a dwelling with bed and seat,\nand water to wash the dirt from his cloak:\nhaving heard the Dhamma taught by the Fortunate One,\na disciple of the one of excellent wisdom\nshould use these reflectively. (16)",
    "snp2.14:392": "392“For in regard to almsfood, a lodging,\nand water to wash the dirt from his cloak, [69]\na bhikkhu will not cling to these things,\nas a water drop does not cling to a lotus leaf. (17)",
    "snp2.14:393": "393“Now let me tell you the householder’s duty,\nhow one should act to become a good disciple.\nFor this entire duty of a bhikkhu\ncannot be carried out by one with possessions. (18)",
    "snp2.14:394": "394“Having put down the rod toward all beings,\ntoward those in the world both firm and frail,\none should not kill living beings or cause to kill,\nnor should one approve of others who kill. (19)",
    "snp2.14:395": "395“Next, a disciple should not knowingly\ntake anything not given anywhere.\nOne should not cause stealing or approve of theft;\none should entirely avoid taking anything not given. (20)",
    "snp2.14:396": "396“A wise person should avoid impure conduct\nas one would avoid a blazing pit of coals.\nBut if one is incapable of the celibate life,\none should not transgress with another’s spouse. (21)",
    "snp2.14:397": "397“One who has entered a council or an assembly\nshould not speak falsely to anyone.\nOne should not make others lie or approve of false speech.\nOne should entirely avoid speaking untruth. (22)",
    "snp2.14:398": "398“A householder who espouses this Dhamma\nshould not indulge in intoxicating drink.\nHe should not make others drink or approve of drinking,\nhaving understood that this ends in madness. (23)",
    "snp2.14:399": "399“Because of intoxication, foolish people do evil deeds,\nand they make other heedless folk do such deeds. [70]\nOne should avoid this basis of demerit,\ndelightful to fools, causing madness and delusion. (24)",
    "snp2.14:400": "400“One should not kill living beings or take what is not given;\none should not speak falsely or drink intoxicants.\nOne should abstain from sex, from impure conduct;\none should not eat at night [and] outside the prescribed time. (25)",
    "snp2.14:401": "401“One should not wear garlands or apply perfumes;\none should sleep on a bed or a mat on the ground.\nFor this, they say, is the eightfold uposatha observance\ntaught by the Buddha, who has reached the end of suffering. (26)",
    "snp2.14:402": "402“Hence confident in mind, having observed\nthe uposatha complete with its eight factors\non the fourteenth, fifteenth, and eighth of the fortnight\nand during special periods, (27)",
    "snp2.14:403": "403“in the morning the wise person\nwho has observed the uposatha,\nrejoicing with a confident mind,\nshould distribute food and drink\nto the Bhikkhu Sangha in a fitting way. (28)",
    "snp2.14:404": "404“One should righteously support mother and father;\none should engage in a righteous business.\nA heedful layperson, observing this practice,\nreaches the devas called self-luminous.” (29) [71]"
}