{
    "snp2.13:359": "359“I ask the muni, one of abundant wisdom,\nwho has crossed over, gone beyond, attained nibbāna, inwardly firm:\nhaving renounced the home life and discarded sensual pleasures,\nhow would that bhikkhu properly wander in the world?” (1)",
    "snp2.13:360": "360“When he was uprooted [concern with] blessings,”\n“with portents,Reading uppātā with Be and Ce, defined by DOP as “an unusual or startling event, taken as a portent.” dreams, and lucky signs,\nwhen he has abandoned the defects of blessings,\nthat bhikkhu would properly wander in the world. (2)",
    "snp2.13:361": "361“A bhikkhu should remove lust for sensual pleasures,\nfor pleasures both human and celestial;\nhaving transcended existence, having penetrated the Dhamma,\nhe would properly wander in the world. (3)",
    "snp2.13:362": "362“Having put behind him divisive words,\na bhikkhu should discard anger and meanness;\nwhen he has abandoned attraction and repulsion,\nhe would properly wander in the world. (4)",
    "snp2.13:363": "363“Having abandoned what is pleasing and displeasing,\nwithout clinging, not depending on anything,\nutterly released from things that fetter,\nhe would properly wander in the world. (5)",
    "snp2.13:364": "364“He does not find a core in acquisitions,\nhaving removed desire and lust for things taken up;\nnot dependent, not to be led by others,\nhe would properly wander in the world. (6) [64]",
    "snp2.13:365": "365“Not hostile by speech, mind, and deed,\nhaving rightly understood the Dhamma,\naspiring for the state of nibbāna,\nhe would properly wander in the world. (7)",
    "snp2.13:366": "366“A bhikkhu should not be elated, thinking, ‘He venerates me,’\nand though insulted, he should not nurture resentment;\nhe should not be intoxicated over food gained from others:\nhe would properly wander in the world. (8)",
    "snp2.13:367": "367“Having abandoned greed and existence,\na bhikkhu refraining from wounding and binding,\nwho has overcome perplexity, without darts:\nhe would properly wander in the world. (9)",
    "snp2.13:368": "368“Having understood what is suitable for himself,\na bhikkhu would not injure anyone in the world;\nhaving understood the Dhamma as it is,\nhe would properly wander in the world. (10)",
    "snp2.13:369": "369“One who has no latent tendencies at all,\nwhose unwholesome roots have been uprooted,\nwho is wishless, without expectations:\nhe would properly wander in the world. (11) [65]",
    "snp2.13:370": "370“One with influxes destroyed, with conceit abandoned,\nwho has transcended the entire pathway of lust,\ntamed, quenched, inwardly firm,\nhe would properly wander in the world. (12)",
    "snp2.13:371": "371“Endowed with faith, learned, a seer of the fixed course,\na wise one who, among partisans, does not take sides,\nhaving removed greed, hatred, aversion,\nhe would properly wander in the world. (13)",
    "snp2.13:372": "372“A purified conqueror whose coverings are removed,\na master of things, gone beyond, without impulse,\nskilled in the knowledge of the cessation of conditioned things,\nhe would properly wander in the world. (14)",
    "snp2.13:373": "373“One who has overcome mental constructs\nabout things past and future,\nhaving overcome, wise about purity,\nreleased from all the sense bases,\nhe would properly wander in the world. (15)",
    "snp2.13:374": "374“Having known the state, having penetrated the Dhamma,\nhaving seen clearly the abandoning of the influxes,\nwith the utter destruction of all acquisitions,Reading with Ee and Pj II sabbūpadhīnaṃ parikkhayā, as against Be sabbupadhīnaṃ parikkhayāno and Ce sabbupadhinaṃ parikkhayāno.\nhe would properly wander in the world.” (16)",
    "snp2.13:375": "375“Surely, Blessed One, it is just so:\none who dwells thus is a tamed bhikkhu [66]\nand has transcended all the things that fetter:\nhe would properly wander in the world.” (17)"
}