{
    "snp3.4:455": "“I am not a brahmin nor am I a prince;I am not a vessa or anything else.Having fully understood the clan of worldlings,owning nothing, with reflection I live in the world. (1)",
    "snp3.4:456": "“Clad in my cloak, homeless I wander,with my head shaved, fully quenched within.Since I am unattached to people here,it is unfitting, brahmin, to ask me about my clan.” (2) [81]",
    "snp3.4:457": "[The brahmin Sundarikabhāradvāja said:] “Brahmins, sir, ask other brahmins: ‘Is the worthy one a brahmin?’”Eeprints this sentence as prose but includes it under verse  (in its numbering scheme).Benumbers it as if it were a distinct two-line verse andCeincorporates it as part of the verse that includes the following lines. In several of the following stanzas, too, it is uncertain whether the lines are to be taken as prose or verse. For details, see Norman’s comments on each verse inGD.",
    "snp3.4:458": "“On what ground have many rishis, men, khattiyas, and brahminshere in the world performed sacrifices to the deities?”",
    "snp3.4:459": "“Surely, this offering of his must succeed,”“since we have seen such a Veda-master.It is because we have not seen those like youthat other people eat the sacrificial cake.” (5)",
    "snp3.4:460": "“Therefore, brahmin, as you seek the good,approach me here and ask your question.Perhaps you may find here one at peace,smokeless, untroubled, desireless, and very wise.” (6)",
    "snp3.4:461": "“Master Gotama, since I delight in sacrificeI wish to hold a sacrifice but do not understand.Let the worthy one instruct me: [82]please tell me where an offering succeeds.” (7)",
    "snp3.4:462": "“Ask not of social class but ask of conduct:fire indeed is produced from any wood.Though from a low family a steadfast muniis a thoroughbred restrained by moral shame. (8)",
    "snp3.4:464": "“Those homeless ones who have abandoned sensual pleasures,who are well self-controlled, straight as a shuttle:a brahmin who would sacrifice intent on meritshould make a timely oblation to them.The text here changes from the singular to the plural.(10)",
    "snp3.4:465": "“Those devoid of lust, with well-concentrated faculties,freed like the moon from the grip of Rāhu:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (11)",
    "snp3.4:466": "“Those who wander in the world without attachments,always mindful, having abandoned things taken as ‘mine’:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (12)",
    "snp3.4:467": "“Having renounced sensual pleasures, faring triumphant,he who has known the end of birth and death, [83]who has attained nibbāna, cool as a lake:the Tathāgata is worthy of the sacrificial cake. (13)",
    "snp3.4:468": "“The same as the righteous, far from the unrighteous,I translate this line in accordance with its evident meaning rather than in compliance with the interpretation proposed byPj II. Following the commentarial interpretation, the linesamo samehi visamehi dūrewould be translated: “Equal to equals, far from unequals.” I render the lemma here to accord with the commentarial interpretation, but I translate the text according to my understanding of the intended meaning. The line, as I see it, involves a word play.Samameans both “equal” and “righteous, virtuous,” whilevisamameans both “different, unequal” and “unrighteous, unvirtuous.” The verse can thus be read as asserting that the Buddha is an equal of the righteous but far from the unrighteous. SeeSNI.7caranti visame samaṃ;SN2.8ariyānaṃ samo maggo, ariyā hi visame samā; andAN11.11 verse 4,ariyasāvako visamagatāya pajāya samappatto viharati.the Tathāgata is one of boundless wisdom,untainted here or beyond:the Tathāgata is worthy of the sacrificial cake. (14)",
    "snp3.4:469": "“He in whom there is no hypocrisy and conceit,devoid of greed, with no sense of ‘mine,’ desireless,with anger dispersed, inwardly well quenched,that brahmin has abandoned the stain of sorrow:the Tathāgata is worthy of the sacrificial cake. (15)",
    "snp3.4:470": "“He who has abandoned the residence of the mind,who has no possessions at all,clinging to nothing here or beyond:the Tathāgata is worthy of the sacrificial cake. (16)",
    "snp3.4:471": "“He who is concentrated, who has crossed the flood,and has known the Dhamma with the supreme view,whose influxes are destroyed, who bears his final body:the Tathāgata is worthy of the sacrificial cake. (17)",
    "snp3.4:472": "“He whose influxes of existence and caustic speechare burnt up, vanished, and no longer exist,that Veda-master in every way released:the Tathāgata is worthy of the sacrificial cake. (18)",
    "snp3.4:473": "“He who has overcome the ties, for whom there are no ties,who among those held by conceit is not held by conceit, [84]who has fully understood suffering with its field and ground:the Tathāgata is worthy of the sacrificial cake. (19)",
    "snp3.4:474": "“He who is not dependent on desire, a seer of seclusion,who has overcome the view made known by others,for whom there are no bases of any kind:the Tathāgata is worthy of the sacrificial cake. (20)",
    "snp3.4:475": "“He who has penetrated phenomena far and near,for whom they are burnt up, vanished, and no longer exist,who is peaceful, liberated in the destruction of clinging:the Tathāgata is worthy of the sacrificial cake. (21)",
    "snp3.4:476": "“He who has seen the destructionand end of the fetters and of birth,who has entirely dispelled the pathway of lust,pure, faultless, stainless, flawless:the Tathāgata is worthy of the sacrificial cake. (22)",
    "snp3.4:477": "“He who, by himself, does not perceive a self,I translate on the basis ofEe, which readsyo attanāattānaṃ nānupassati.Behasyo attano attānaṃ nānupassati, whileCehasyo attanāttānaṃ nānupassati, which seems to supportEe.concentrated, upright, inwardly firm,who is without impulse, not barren, free from doubt:the Tathāgata is worthy of the sacrificial cake. (23)",
    "snp3.4:478": "“He for whom there are no delusions within,and whose knowledge sees into all phenomena,who bears his final bodily form,and has attained enlightenment — unsurpassed, auspicious —to this extent there is purity of the spirit:the Tathāgata is worthy of the sacrificial cake.” (24) [85]",
    "snp3.4:479": "“Let my offering be a truthful offering,since I have found such a Veda-master.Brahmā himself has been made manifest:let the Blessed One receive it from me;let the Blessed One enjoy my sacrificial cake.”Eeprints the last two lines here as prose,BeandCerepresent them as verse. Norman writes: “I am uncertain about the metre” (GD250).(25)",
    "snp3.4:480": "“Food over which verses have been recited is not to be eaten by me;this, brahmin, is not the principle of those who see.The buddhas reject food over which verses have been recited;there being such a principle, brahmin, this is their conduct. (26)",
    "snp3.4:481": "“Serve with other food and drinkthe consummate one, the great rishi,one with influxes destroyed, with regret stilled,for he is the field for one seeking merit.” (27)",
    "snp3.4:482": "“Please [tell me], Blessed One, so that I might understandwho should eat the offering of one like meseeking someone at the time of sacrifice,after having met your teaching?” (28)",
    "snp3.4:483": "“One in whom aggression has disappeared,whose mind is unsullied,who is freed from sensual desires,who has dispelled dullness; (29)",
    "snp3.4:484": "“one who has removed the boundaries,who is skilled in birth and death,a muni possessed of munihood,one like that who has come to the sacrifice. (30)",
    "snp3.4:485": "“Having removed the frown,pay homage to him with reverential salutation.Venerate him with food and drink:in such a way the offerings flourish.” (31) [86]",
    "snp3.4:486": "“The honorable Buddha deserves the sacrificial cake,he is the unsurpassed field of merit,the receptacle of sacrifice for all the world:what is given to the worthy one brings great fruit.” (32)"
}