{
    "snp3.11:679": "The rishi Asita, while passing the day,saw the Tāvatiṃsa devas, joyful and ecstatic.Having honored Indra, clad in clean garments,carrying streamers, they were proclaiming exuberant praise. (1) [132]",
    "snp3.11:680": "Having seen the devas exultant and elated,having shown them respect, he said this to them:“For what reason is the group of devas exuberantly jubilant?Why do you take streamers and swirl them around? (2)",
    "snp3.11:681": "“Even when there was a battle with the asuras,when the gods were victorious and the asuras defeated,even then there was no such excitement.What wonder have the gods seen that they rejoice? (3)",
    "snp3.11:682": "“They whistle and sing and play music;they clap their arms and dance around.I ask you, dwellers on Mount Meru’s peak:dear sirs, quickly dispel my bafflement.” (4)",
    "snp3.11:683": "“In Lumbinī, a village in the Sakyan country,the Bodhisatta — the excellent gem, unequaled — has been borninto the human world for well-being and happiness;hence we are so delighted and extremely jubilant. (5)",
    "snp3.11:684": "“He is the best of all beings, the foremost person,the chief bull of men, the best of all creatures. [133]He will turn the wheel in the grove named for the rishis,Isivhaye vane. This alludes to Isipatana, where the Buddha gave his first discourse.roaring like a powerful lion, the lord of beasts.” (6)",
    "snp3.11:685": "Having heard that utterance, he quickly descended,and then approached the residence of Suddhodana.Having sat down there, he said to the Sakyans:“Where is the prince? I too wish to see him.” (7)",
    "snp3.11:686": "Then the Sakyans showed Asita their son,who was radiant with splendor and of perfect color;the prince shone like gold burnishedin the mouth of a furnace by one highly skilled. (8)",
    "snp3.11:687": "Having seen the prince blazing like a crested flame,pure like the moon, lord of stars, moving in the sky,like the beaming autumn sun freed from clouds,already delighted, he gained abundant joy. (9)",
    "snp3.11:688": "The gods held up a parasol in the skywith multiple ribs and a thousand circles.Golden-handled chowries moved up and down,but none were seen holding the chowries or parasol. (10) [134]",
    "snp3.11:689": "The matted-hair rishi named “Black Glory,”having seen him like a gold nugget on a red blanket,with the white parasol being held over his head,received him, elated and happy. (11)",
    "snp3.11:690": "Then, having received the Sakyan bull,examining him, the master of marks and hymnswas pleased in mind and emitted a cry:“He is unsurpassed, the best of bipeds.” (12)",
    "snp3.11:691": "Then, recollecting his own departure,he became dismayed and shed bitter tears.Seeing this, the Sakyans asked the weeping rishi:“Will some misfortune befall the prince?” (13)",
    "snp3.11:692": "Seeing the Sakyans dismayed, the rishi said:“I do not foresee harm for the prince.There will be no obstacle for him,not the least, so set your minds at ease. (14)",
    "snp3.11:693": "“This prince will reach the foremost enlightenment;one of supremely purified sight, compassionate for many people,he will set in motion the wheel of the Dhamma;his spiritual life will become widespread. (15) [135]",
    "snp3.11:694": "“But the remainder of my life here is not long;my death will occur in the interval.I will not hear the Dhamma of the one unequaled in fortitude.Hence I am troubled, distressed, and dejected.” (16)",
    "snp3.11:695": "Having brought the Sakyans abundant joy,the holy man left the palace.Out of compassion for his own nephew,he enjoined him in the Dhammaof the one unequaled in fortitude. (17)",
    "snp3.11:696": "“When you hear from another the word ‘buddha,’[and] ‘one who attained enlightenmentrevealsReadingvivaratiwithBeas againstCeandEevicarati.the foremost Dhamma,’having gone to him, asking about his doctrine,lead the spiritual life under that Blessed One.” (18)",
    "snp3.11:697": "Instructed by such a one with benevolent mind,whose vision of the future was supremely purified,Nālaka, one with a store of accumulated merit,expecting the Conqueror, dwelled with guarded faculties. (19)",
    "snp3.11:698": "Having heard the word about the Conquerorsetting in motion the excellent wheel [of the Dhamma],having gone, he saw the chief rishi and was pleased. [136]Since [the time for] Asita’s instruction had arrived,he asked the excellent muni about supreme munihood. (20)",
    "snp3.11:699": "“This statement of Asitahas been known by me to be true to fact.Therefore I ask you, O Gotama,one who has gone beyond all phenomena. (21)",
    "snp3.11:700": "“Since I have entered the homeless life,seeking sustenance on alms round,being asked, O muni, please explain to memunihood, the ultimate way.” (22)",
    "snp3.11:701": "“I will describe munihood to you,”“hard to practice and hard to master.Come, I will tell you about it —brace yourself and be firm. (23)",
    "snp3.11:702": "“One should have the same attitudeBeandCereadsamānabhāgaṃ, as againstEesamānabhāvaṃ. The lemma ofPj IIin all three editions has –bhāgaṃ, as does the Skt parallel at Mvu III 387,6.whether one is insulted or venerated in the village.One should guard against anger in the mind;one should keep calm, without being elated. (24) [137]",
    "snp3.11:703": "“Diverse impressions high and lowcome forth like flames in a forest.Women try to seduce a muni —do not let them seduce you! (25)",
    "snp3.11:704": "“Refraining from sexual intercourse,having given up sensual pleasures fine and coarse;one should not be hostile or attachedto living beings both frail and firm. (26)",
    "snp3.11:705": "“[Reflecting] ‘As I am, so are they;as they are, so am I,’having taken oneself as the criterion,one should not kill or cause others to kill. (27)",
    "snp3.11:706": "“Having given up desire and greedfor that to which the worldling is attached,one with vision should practiceso that one may cross this inferno. (28)",
    "snp3.11:707": "“Not filling one’s belly, moderate in food,one should be of few desires, without longing.One is hungerless with respect to desire;desireless, one is quenched. (29)",
    "snp3.11:708": "“Having wandered on alms round,he should resort to the woods.Staying at the foot of a tree,the muni should take his seat. (30)",
    "snp3.11:709": "“That steadfast one intent on jhānashould take delight in the woods.He should meditate at the foot of a tree,making himself fully content. (31)",
    "snp3.11:710": "“Then, with the passing of the night,he should approach the village.He should not welcome invitationsand offerings brought from the village. (32)",
    "snp3.11:711": "“When the muni has come to the village,he should not behave rashly among families.Having cut off talk aimed at getting food,he should not utter suggestive words. (33)",
    "snp3.11:712": "“‘I received something, that is good;I received nothing, that is fine.’In both situations remaining impartial,he returns to the tree itself. (34) [138]",
    "snp3.11:713": "“Wandering with bowl in hand,not dumb though considered dumb,one should not scorn a small offeringnor should one despise the giver. (35)",
    "snp3.11:714": "“High and low is the practicetaught by the Ascetic.They do not go in two ways to the far shore;[yet] it is not experienced in a single way. (36)",
    "snp3.11:715": "“For one who has no diffusion,for a bhikkhu who has cut off the stream,who has abandoned what is to be done and not done,no fever [of defilements] exists. (37)",
    "snp3.11:716": "“I will describe munihood to you,”“One should treat it like the blade of a razor.Having pressed one’s palate with the tongue,exert control over one’s belly. (38)",
    "snp3.11:717": "“One should not be sluggish in mind,nor should one ponder much.Be unpolluted, unattached,with the spiritual life as one’s support. (39)",
    "snp3.11:718": "“One should train in a solitary seatand in the exercise of an ascetic.It is solitude that is called munihood.If you will delight alone,I read pāda deko ce abhiramissasiwithBeandEe.you will light up the ten directions.Atha bhāsihi(Bebhāhisi)dasadisāappears to be an extra line.Pj IIsuggests it belongs with the next verse, but it makes better sense here, as inBe. Either way we would wind up with an irregular verse of five lines.(40)",
    "snp3.11:719": "“Having heard the acclaim of the wise,of the meditators who have renounced sensual pleasures,my follower should develop even morea sense of moral shame and faith. (41) [139]",
    "snp3.11:720": "“Understand this by way of riversand in terms of clefts and ravines.The creeks flow on noisily,but silently the great rivers flow. (42)",
    "snp3.11:721": "“What is empty makes a noise;what is full is ever quiet.The fool is like a half-full barrel,the wise man like a full lake. (43)",
    "snp3.11:722": "“When the Ascetic speaks much,AsPj IIexplains,samaṇohere refers to the Buddha.it is meaningful and beneficial.Knowing, he teaches the Dhamma;knowing, he speaks much. (44)",
    "snp3.11:723": "“But one who, knowing, is self-controlled,who, knowing, does not speak much:that muni is worthy of munihood;that muni has achieved munihood.” (45)"
}