{
    "snp3.5:487": "“I ask Master Gotama, the bountiful one,”“wearing an ochre robe, wandering homeless:when a householder devoted to charity, a lord of giving,wanting merit, sacrifices intent on merit, [88]by giving food and drink to others here,in sacrificing, howReadingkathaṃwithBeas againstCeandEekattha, “where?” All three editions ofPj IIreadkathaṃin the construal.is his offering purified?” (1)",
    "snp3.5:488": "“When a householder devoted to charity, a lord of giving, ,“wanting merit, sacrifices intent on merit,giving food and drink to others here:such a one succeeds through those worthy of offerings.” (2)",
    "snp3.5:489": "“When a householder, a lord of giving, devoted to charity,”“wanting merit, sacrifices intent on merit,giving food and drink to others here:describe, Blessed One, those worthy of offerings.” (3)",
    "snp3.5:490": "“Those who wander unattached in the world,owning nothing, consummate, self-controlled:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (4)",
    "snp3.5:491": "“Those who have cut off all fetters and bondage,tamed, liberated, untroubled, desireless:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (5)",
    "snp3.5:492": "“Those who are released from all fetters,tamed, liberated, untroubled, desireless:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (6)",
    "snp3.5:493": "“Those who have abandoned lust, hatred, and delusion,whose influxes are destroyed, who have lived the spiritual life:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (7)",
    "snp3.5:494": "“Those in whom there is no hypocrisy and conceit, [89]who are devoid of greed, with no sense of ‘mine,’ desireless:Bereads pādas abyesu na māyā vasati na māno, khīṇāsavā vūsitabrahmacariyā, followed by the refrain.Bethen adds another verse in which pādas ab readye vītalobhā amamā nirāsā, khīṇāsavā vūsitabrahmacariyā, followed by the refrain. InCeandEe, which I follow, the additional verse is absent. Rather, in verse  the first line of the additional verse inBebecomes pāda b, and there is no linekhīṇāsavā vūsitabrahmacariyā.a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (8)",
    "snp3.5:495": "“Those who have not fallen prey to cravings,who, having crossed the flood, wander with no sense of ‘mine’:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (9)",
    "snp3.5:496": "“Those who have no craving for anything in the world,for any state of existence here or beyond:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (10)",
    "snp3.5:497": "“Those homeless ones who have abandoned sensual pleasures,who are well self-controlled, straight as a shuttle:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (11)",
    "snp3.5:498": "“Those devoid of lust, with well-concentrated faculties,freed like the moon from the grip of Rāhu:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (12)",
    "snp3.5:499": "“Those who are at peace, devoid of lust, not irritated,for whom there are no destinations, having abandoned them here:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (13)",
    "snp3.5:500": "“Those who have entirely cast off birth and death,who have overcome all perplexity:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (14)",
    "snp3.5:501": "“Those who wander in the world as islands in themselves,owning nothing, in every way released:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (15)",
    "snp3.5:502": "“Those here who know this just as it is:‘This is the last life, there is no renewed existence’:a brahmin who would sacrifice intent on meritshould make a timely oblation to them. (16) [90]",
    "snp3.5:503": "“A Veda-master, delighting in jhāna, mindful,attained to enlightenment, the refuge of many:a brahmin who would sacrifice intent on meritshould make a timely offering to him.”In this verse the subject changes from the pluralyeof the preceding verses (with its attributes also in the plural) to the singularyo vedagū, and the recipient of the offering changes, correspondingly, from pluraltesuto singulartamhi.(17)",
    "snp3.5:504": "“Surely my questions were not asked in vain;the Blessed One has described for me those worthy of offerings.You know this matter just as it is;for this Dhamma has been thus understood by you. (18)",
    "snp3.5:505": "“When a householder devoted to charity,”“a lord of giving, wanting merit, sacrifices intent on merit,giving food and drink to others here, declare to me,Blessed One, the excellence of the sacrifice.” (19)",
    "snp3.5:506": "“Undertake sacrifice, and when sacrificing,\n“make the mind placid in every way.For one sacrificing, the sacrifice is the basis:established upon this, one discards faults. (20)",
    "snp3.5:507": "“One devoid of lust, having removed hatred,developing a measureless mind of loving-kindness,constantly heedful day and night,pervades all directions measurelessly.” (21)",
    "snp3.5:508": "“Who is purified, freed, and bound?By what means does one go to the brahma world?Ken’attanā gacchati brahmalokaṃ. I render this line in accordance with the gloss ofPj II:ken’attanā ti kena kāraṇena. Text hasken’attanā gacchati brahmalokaṃ, which Pj II glossesken’attanā ti kena kāraṇena. The reflexive use of instrumentalattanāis common in Pāli, but apart from verses 477, 756, and 1119 there is almost no explicit discussion in Sn of the opposition between views ofattāand the Buddha’s teaching ofanattā. I therefore think it unlikely that the brahmin asked his question with the view of anattā, a substantial self, as the underlying premise. The Buddha’s reply does not challenge such an assumption, andPj IIevidently takesattanāin a simple reflexive sense. I have translated the line in compliance with the comment that takesattanāas equivalent tokāraṇena, “cause, means.” Jayawickrama treatsattanāas the reflexive pronoun in his rendering of the line: “With (the aid of what) does one go to the world of Brahma oneself?” Norman, however, translates it as if the speaker had assumed a metaphysical entity: “With what self does one go to the Brahma-world?”Since I do not know, O muni, please tell me when asked.The Blessed One is Brahmā made manifest, seen by me today, [91]for in truth you are like Brahmā to us.How is one reborn in the brahma world, O luminous one?” (22)",
    "snp3.5:509": "“One who performs a sacrifice with the threefold excellence,\n“such a one should accomplish it with those worthy of offerings.Having sacrificed thus, one rightly devoted to charityis reborn in the brahma world, I say.” (23)"
}