{
    "snp3.10:657": "“When a person has taken birthan axe is born inside his mouthwith which the fool cuts himselfby uttering wrongful speech. (1)",
    "snp3.10:658": "“One who praises a person deserving blame,or blames a person deserving praise,collects bad luck with his mouth,by which he finds no happiness. (2)",
    "snp3.10:659": "“Slight is this bad luck:the loss of one’s wealth at dice,[the loss] of all including oneself.It is much worse bad luckto harbor hate against the holy ones.Yo sugatesu manaṃ padosaye.Sugata, literally “well gone,” is used most often as a unique epithet of the Buddha. In that context I render it “the fortunate one.” Here, however, it is applied to all who have “gone well” along the eightfold path and realized “the good state,” nibbāna(3)",
    "snp3.10:661": "“The speaker of slander goes to hell,so too one who, having acted, says: ‘I didn’t do it.’Having passed away, both are the same,men of base actions in the next world. (5)",
    "snp3.10:662": "“When one defames an innocent man,a pure person without blemish,the evil falls back on the fool himselflike fine dust thrown against the wind.”In adding closing quotation marks, I followPj II, which ascribes the next series of verses to Moggallāna or (according to some) Mahābrahmā.(6)",
    "snp3.10:663": "“One intent upon the quality of greedreviles others by means of speech; [128]faithless, mean, stingy, miserly,he is intent upon divisive speech. (7)",
    "snp3.10:664": "“Foul-mouthed, liar, ignoble one,abortionist, evil one, wrongdoer,base person, unlucky man, low born:do not speak much here, you who are bound for hell. (8)",
    "snp3.10:665": "“You scatter dust to your harm,when you, evildoer, malign the good.Having done many bad deeds,you will go to the abyss for a long time. (9)",
    "snp3.10:666": "“For no one’s kamma is ever lost;since it returns, its owner obtains it.In the other world the dullard,the evildoer, sees suffering in himself. (10)",
    "snp3.10:667": "“He arrives at the place of impalement,which has iron hooks, sharp blades, and iron stakes. [129]Then there is the food, which is like a ballof hot iron, as is appropriate. (11)",
    "snp3.10:668": "“When speaking, [the wardens of hell]do not speak sweetly.In this verse and those that follow, I assign in brackets the subjects of the action based on the ascriptions inPj II.They do not hasten; they do not offer shelter.Those [hell beings] lie on coals spread out;they enter a blazing mass of fire. (12)",
    "snp3.10:669": "“And capturing them in a net,there [the wardens] strike them with iron hammers;[the hell beings] come upon blinding gloom,which is extended like a mist. (13)",
    "snp3.10:670": "“Then they enter the Copper Cauldron,which is a blazing mass of fire;they are boiled in them for a long time,rising and sinking in the masses of fire. (14)",
    "snp3.10:671": "“Then the evildoer is cooked therein [copper] mixed with pus and blood. [130]Whatever region he resorts to,he is afflictedI read withBeandCekilissati, as againstEekilijjati, whichPj IIrecognizes as an alternative. This is a gloss on the unusual termārajayārajayā.DOPexplains the word as from the imperative ofārajayati, causative ofārañjati, “pierces, scores, marks.”on making contact there. (15)",
    "snp3.10:672": "“There the evildoer is cookedin water that is the abode of worms.There is not even a shore to which to go,for the pots all around are all alike. (16)",
    "snp3.10:673": "“Then they enter the Wood of Sword Leaves,which is so sharp that their bodies are cut to pieces.Having grabbed the tongue with a hook,repeatedly slashing it, [the wardens] strike it. (17)",
    "snp3.10:674": "“Then they approach the impassable Vetaraṇī,with its sharp blades, with razor blades.The dullards fall into it —those evildoers who have done evil deeds. (18) [131]",
    "snp3.10:675": "“While they are weeping there,brown and spotted dogs devour them,I followPj II, which explains that “brown [and] spotted” in pāda b should be connected with “dogs” in pāda c rather than with “ravens” in pāda b (sāmā sabalā ti etaṃ parato soṇā ti iminā yojetabbaṃ).as do flocks of ravens and very greedy jackals,HereCeandEehavepaṭigijjhā; so too the Thai edition.Behaspaṭigiddhā.Paṭigiddhā ti suṭṭhu sañjātagedhā hutvā,mahāgijjhāti eke. All three editions ofPj IIreadpaṭigiddhāin the lemma, butCeandEeand the Thai edition of Sn all havepaṭigijjhā. “Large vultures” may be explained by the fact that Pāligijjhameans “vulture.” SincePj IIdoes not cite an alternative reading in Sn, I assume its author and those he cites hadpaṭigiddhāin their source.while hawks and crows stab at them. (19)",
    "snp3.10:676": "“Difficult is this life here,which the evildoer sees.Therefore, in the remainder of one’s life here,a person should be dutiful and not be heedless.” (20)",
    "snp3.10:678": "As painful as the hells are said to be here,for just so long one must dwell there;therefore one should always guard speech and mindtoward those who are pure, virtuous, full of good qualities. (22)"
}