{
    "snp3.8:574": "Without a sign, unknownis the life of mortals here —it is difficult and short,and conjoined with suffering. (1) [113]",
    "snp3.8:575": "For there is no way by whichthose who have been born will not die.Death occurs also when one has reached old age:for such is the nature of living beings. (2)",
    "snp3.8:576": "Just as when fruits have ripened,there is always fear of their falling;I accept Norman’s suggestion that we readniccaṃforpāto.Tena tāni phalāni pāto pāto niccakālaṃ patanti, nesaṃ pāto patanato bhayaṃ hoti, patanā bhayaṃ hotī ti attho. Following Norman (seeGD270), I takeniccaṃto be the preferred reading.Pj II, it seems, is trying to explain the verse on the basis of bothpātoandniccaṃ.JaIV 127,3hasphalānamiva pakkānaṃ, niccaṃ patanato bhayaṃ. The paraphrase atJaIV 128,6–8clearly supportsniccaṃ:pakkānaṃ phalānaṃ pakkakālato paṭṭhāya “idāni vaṇṭā chijjitvā patissanti, idāni patissantī” ti patanato bhayaṃ niccaṃ dhuvaṃ ekaṃsikameva bhavati.so for mortals who have taken birth,there is always fear of death. (3)",
    "snp3.8:577": "Just as the clay potsproduced by a potterall finally end up by breaking,such is the life of mortals. (4)",
    "snp3.8:578": "Both the young and the old,both the foolish and the wise,all go under the control of death;all have death as their destination. (5)",
    "snp3.8:579": "When those overpowered by deathare going from here to the next world,I adopt the variantparalokito, divided asparalok’ito, following Norman atGD73.the father cannot protect his son,nor can one protect one’s relatives. (6)",
    "snp3.8:580": "Even as the relatives are looking onand wailing profusely,see how each of the mortals is led awaylike a cow to be slaughtered. (7)",
    "snp3.8:581": "Thus the world is strickenby death and by old age;therefore the wise do not sorrow,having understood the way of the world. (8)",
    "snp3.8:582": "You who do not know the pathby which he has come or gone,not perceiving either end,yet lament without purpose. (9)",
    "snp3.8:583": "If while he is lamenting,a bewildered person, injuring himself,could derive some benefit,a wise person too would do the same. (10)",
    "snp3.8:584": "It is not by weeping or sorrowingthat one attains peace of mind.One’s suffering arises still moreand one’s body is harmed. (11) [114]",
    "snp3.8:585": "One becomes thin and pale,and one inflicts injury upon oneself.The departed are not thereby sustained;thus lamentation is useless. (12)",
    "snp3.8:586": "Without abandoning sorrow,a person incurs still more suffering.Bemoaning the one who has died,one comes under the control of sorrow. (13)",
    "snp3.8:587": ">Behold others, too, about to depart,people who fare according to their kamma:living beings just trembling here,having come under the control of death. (14)",
    "snp3.8:588": "In whatever way they conceive it,it turns out otherwise.Such is separation:see the way of the world! (15)",
    "snp3.8:589": "Even if a person were to livefor a hundred years or longer,there is separation from one’s group of relativeswhen one abandons life here. (16)",
    "snp3.8:590": "Therefore, having heard it from the arahant,one should stop lamentation.Having seen that he has departed and died,realize, “I cannot [bring the dead back to life].”Literally “It is not possible for me.” I add the phrase in brackets based onPj II.(17)",
    "snp3.8:591": "Just as, if one’s shelter were blazing,one would extinguish the fire with water,so too a sensible person —wise, learned, skilled —would quickly blow away arisen sorrow,as the wind does a tuft of cotton wool. (18)",
    "snp3.8:592": "[Blow away] lamentation and muttering,and one’s own dejection:seeking happiness for oneself,one should draw out the dart from oneself. (19)",
    "snp3.8:593": "With the dart drawn out, unattached,having attained peace of mind,having overcome all sorrow,sorrowless, one is quenched. (20) [115]"
}