{
    "snp3.7:548": "“You are perfect in body, delightful,well born and lovely to behold.O Blessed One, golden is your color,your teeth so white, you are full of vigor. (1)",
    "snp3.7:549": "“The features possessedby a well-born man are allto be found on your body,these marks of a great man. (2)",
    "snp3.7:550": "“With clear eyes, bright face,stately, erect as a flame,amid this group of asceticsyou shine like the sun. (3)",
    "snp3.7:551": "“A bhikkhu so lovely to look onwith skin of a golden sheen —why do you, one of supreme beauty,adopt the state of an ascetic? (4)",
    "snp3.7:552": "“You are fit to be a king,a wheel-turning monarch, lord of charioteers,a victor in all the four quarters,lord of the Jambu Continent. [109] (5)",
    "snp3.7:553": "“With khattiyas and great princesall devoted to your service,as king above kings, as a ruler of people,you should exercise rulership, Gotama.” (6)",
    "snp3.7:554": "“I am already a king,“I am the unsurpassed king of the Dhamma,I turn the wheel by means of the Dhamma,the wheel that cannot be turned back.” (7)",
    "snp3.7:555": "“You claim to be an enlightened one,”“You say, Gotama,‘I am the unsurpassed king of the Dhamma.I turn the wheel by means of the Dhamma.’ (8)",
    "snp3.7:556": "“Who is your general, that disciplewho follows after the Teacher?Who is it who helps you turnthis wheel that you set in motion?” (9)",
    "snp3.7:557": "“The wheel set in motion by me,“the unsurpassed wheel of Dhamma,Sāriputta, the Tathāgata’s offspring,helps to keep turning. (10)",
    "snp3.7:558": "“What should be directly known is directly known,what should be developed has been developed,what should be abandoned has been abandoned:therefore, brahmin, I am a buddha. (11)",
    "snp3.7:559": "“So remove your doubt about meand be convinced, brahmin!For it is rare to gain the sightof the enlightened ones. (12) [110]",
    "snp3.7:560": "“I am one whose appearanceis rarely encountered in the world.I am the Enlightened One,brahmin, the unsurpassed surgeon. (13)",
    "snp3.7:561": "“I have become Brahmā, peerless,one who has crushed Māra’s army.Having mastered all my enemies,I rejoice, without fear from anywhere.” (14)",
    "snp3.7:562": "“Sirs, hear this,” (said Sela),“as the One with Vision has spoken,the surgeon, the mighty hero,who roars like a lion in the forest. (15)",
    "snp3.7:563": "“Who having seen him, even one of dark birth,would not place confidence in him,the one who has become Brahmā, incomparable,the one who has crushed Māra’s army? (16)",
    "snp3.7:564": "“Whoever wishes may follow me;who does not wish to may depart.Here I will go forth under him,this man of excellent wisdom.” (17)",
    "snp3.7:565": "“If, sir, you now approve of the teachingof the Perfectly Enlightened One,we too will go forth under him,this man of excellent wisdom.” (18)",
    "snp3.7:566": "“There are three hundred brahmins herewho implore you, making salutations.Let us live the spiritual lifeunder you, O Blessed One.” (19)",
    "snp3.7:567": "“The spiritual life is well proclaimed,“directly visible, immediate,where the going forth will not be barrenfor one who trains heedfully.” (20)Then the brahmin Sela and his assembly received the going forth under the Blessed One, and they received the full ordination.Then, when the night had ended, the jaṭila Keṇiya had goodfood of various kinds prepared in his own hermitage [111] and had the time announced to the Blessed One: “It is time, Master Gotama, the meal is ready.” Then, in the morning, the Blessed One dressed, and taking his bowl and outer robe, he went with the Sangha of bhikkhus to the hermitage of the jaṭila Keṇiya and sat down on the seat made ready.Then, with his own hands, the jaṭila Keṇiya served and satisfied the Sangha of bhikkhus headed by the Buddha with various kinds of good food. When the Blessed One had eaten and had put aside his bowl, the jaṭila Keṇiya took a low seat and sat down on one side. Thereupon the Blessed One expressed appreciation with these verses:568“Fire offerings are the best of sacrifices,Sāvittī the best of Vedic hymns.The best of human beings is a king,the sea the best for flowing rivers. (21)569“The moon is the best of celestial bodies,the sun the best of things that shine.For those desiring merit, the Sanghais best for those who sacrifice.” (22)When the Blessed One had expressed his appreciation with these stanzas, he rose from his seat and departed.Then, the Venerable Sela and his assembly, dwelling alone, withdrawn, heedful, ardent, and resolute, before long [112] realized for themselves with direct knowledge, in this very life, that unsurpassed consummation of the spiritual life for the sake of which clansmen rightly go forth from the household life into homelessness, and having entered upon it, they dwelled in it. They directly knew: “Finished is birth, the spiritual life has been lived, what had to be done has been done, there is no more coming back to any state of being.” And the Venerable Sela together with his assembly became arahants.Then the Venerable Sela together with his assembly approached the Blessed One. Having arranged his upper robe on one shoulder, extending his hands in reverential salutation toward the Blessed One, the Venerable Sela addressed him with verses:570“This is the eighth day, One with Vision,since we went to you for refuge.In these seven nights, Blessed One,we have been tamed in your teaching. (23)571“You are the Buddha, you are the Teacher,you are the muni, the conqueror of Māra.Having cut off the latent tendencies,crossed over, you lead this population across.The verse is identical with verse 545.(24)572“You have transcended the acquisitions,you have sundered the influxes.You are a lion, without clinging,you have abandoned fear and dread.The verse is identical with verse 546.(25)573“Here these three hundred bhikkhus standsaluting you with reverence.Extend your feet, O hero:let these nāgas pay homage to the Teacher.” (26)",
    "snp3.7:568": "“Fire offerings are the best of sacrifices,Sāvittī the best of Vedic hymns.The best of human beings is a king,the sea the best for flowing rivers. (21)",
    "snp3.7:569": "“The moon is the best of celestial bodies,the sun the best of things that shine.For those desiring merit, the Sanghais best for those who sacrifice.” (22)",
    "snp3.7:570": "“This is the eighth day, One with Vision,since we went to you for refuge.In these seven nights, Blessed One,we have been tamed in your teaching. (23)",
    "snp3.7:571": "“You are the Buddha, you are the Teacher,you are the muni, the conqueror of Māra.Having cut off the latent tendencies,crossed over, you lead this population across.The verse is identical with verse 545.(24)",
    "snp3.7:572": "“You have transcended the acquisitions,you have sundered the influxes.You are a lion, without clinging,you have abandoned fear and dread.The verse is identical with verse 546.(25)",
    "snp3.7:573": "“Here these three hundred bhikkhus standsaluting you with reverence.Extend your feet, O hero:let these nāgas pay homage to the Teacher.” (26)"
}