{
    "snp4.15:935": "“Fear has arisen from one who has taken up the rod:see the people engaged in strife.I will tell you of my sense of urgency,how I was stirred by a sense of urgency. (1) [183]",
    "snp4.15:936": "“Having seen the population tremblinglike fish in a pool with little water,having seen them hostile to one another,fear came upon me. (2)",
    "snp4.15:937": "“The world was insubstantial all around;all the directions were in turmoil.Desiring an abode for myself,I did not see [any place] unoccupied. (3)",
    "snp4.15:938": "“Having seen those hostile at the end,discontent came upon me.Then I saw the dart here,hard to see, nestled in the heart. (4)",
    "snp4.15:939": "“When one is struck by that dartone runs astray in all directions.But having drawn out that dart,one does not run, does not sink.”Reading withBeandCenasīdati, as againstEenisīdati.(5)",
    "snp4.15:940": "There the trainings are recited:Tattha sikkhānugīyanti.This seems to be a remark by the compilers that was absorbed into the sutta.Tannimittaṃ hatthisikkhādikā anekā sikkhā kathīyanti uggayhanti vā. The two glosses onsikkhānugīyantiin Pj II — explained even more elaborately in Niddesa — suggest the authors were uncertain whether to take the expression as resolvable intosikkhāanugīyantiorsikkhāuggayhant(in the latter case with –n– presumably serving as a liaison consonant). Norman says (GD 363): “The fact that the commentaries give two explanations . . . seems to indicate that the pāda was not fully understood.” He proposes the line is not an integral part of the verse, but “an instruction to the reciter which has become embedded in the text . . . an interpolation, although clearly it is a very old one.” The Arthapada does not have a corresponding line, which supports Norman’s supposition.The trainings mentioned in pāda a should likely be connected with the last pāda, where “training” is indicated by the optative verb:sikkhe nibbānamattano. The following verses can then be seen as detailing the training. Norman renders the line, “At that point the precepts are recited,” and Jayawickrama has: “Recounted in song is the training therein.” I believe Paññobhāsa was misled by the layout in Be into his rendering, “Therein training rules are recited which are ties in the world,” which wrongly identifiessikkhāwithgathitāni.Yāni loke gadhitānishould be seen, rather, as a relative clause completed byna tesu pasuto siyā.“Whatever bondsI read withCeandEegathitāni.there are in the world,one should not be intent on them.Having entirely pierced through sensual pleasures,one should train for one’s own nibbāna. (6)",
    "snp4.15:941": "“One should be truthful, not impudent,without hypocrisy, devoid of divisive speech.Without anger, a muni should cross overthe evil of greed and miserliness. (7)",
    "snp4.15:942": "“One should vanquish sleepiness, torpor, and dullness;one should not keep company with heedlessness.A person whose mind is set on nibbānashould not persist in arrogance. (8) [184]",
    "snp4.15:943": "“One should not be led into false speech;one should not engender affection for form.One should fully understand conceit,and one should refrain from rashness. (9)",
    "snp4.15:944": "“One should not delight in the old;one should not form a liking for the new.One should not sorrow over what is diminishing;one should not be attached to an attraction. (10)",
    "snp4.15:945": "“I call greed the great flood,I call longing the rapids,the basis, compulsion,Though all three editions havepakappanaṃ, withPj II(Be) I readpakampanaṃ(kampanaṃinCeandEe).the swamp of sensuality hard to overcome. (11)",
    "snp4.15:946": "“Not deviating from truth, a muni,a brahmin, stands on high ground.Having relinquished all,he is indeed called peaceful. (12)",
    "snp4.15:947": "“One who truly is a knower, a Veda-master,having known the Dhamma, is independent.Living rightly in the world,he does not long for anything here. (13)",
    "snp4.15:948": "“One here who has crossed over sensual pleasures,the tie so hard to overcome in the world,who has cut off the stream, without bonds,does not sorrow, does not hope. (14)",
    "snp4.15:949": "“Dry up what pertains to the past;let there be nothing afterward.If you do not grasp in the middle,you will live in peace. (15)",
    "snp4.15:950": "“One who does not claim as ‘mine’anything at all here in name-and-form,who does not sorrow over what is nonexistent,truly does not lose out in the world. (16)",
    "snp4.15:951": "“One for whom nothing is takenas ‘this is mine’ or ‘[this belongs] to others,’not finding anything to be taken as ‘mine,’does not sorrow, thinking: ‘It is not mine.’ (17) [185]",
    "snp4.15:952": "“Not bitter, not greedy,without impulse, everywhere the same —when asked about one who is unshakable,I call that the benefit. (18)",
    "snp4.15:953": "“For one without impulse, who understands,there is no activation at all.Reading withCekāci nisaṅkhiti.Abstaining from instigation,he sees security everywhere. (19)",
    "snp4.15:954": "“The muni does not speak of himselfas among equals, inferiors, or superiors.Peaceful, without miserliness,he does not take, does not reject” —so said the Blessed One. (20)"
}