{
    "snp4.9:835": "“Having seen Taṇhā, Aratī, and Ragā,I did not have any desire for sexual intercourse,so why [should I desire] this, full of urine and feces?I would not wish to touch her even with my foot.” (1) [164]",
    "snp4.9:836": "“If you do not wish a gem such as this,a woman desired by many rulers of men,what kind of view, behavior, observances, lifestyle,existence, and rebirth do you assert?” (2)",
    "snp4.9:837": "“Having decided among teachings,“it does not occur to one, ‘I assert this,’[about a view] tightly grasped.But seeing into views, not grasping any of them,investigating, I saw the peace within.” (3)",
    "snp4.9:838": "“Indeed, muni, you speak without graspingthose judgments that have been formulated,”“As to that matter called ‘the peace within,’how is it proclaimed by the wise?” (4)",
    "snp4.9:839": "“Not by view, nor by learning, nor by knowledge,“nor do I speak of purity through good behavior and observances;but neither without view, without learning, without knowledge,without good behavior, without observances — not in that way.But having relinquished these, not grasping any of them,peaceful, not dependent, one should not hanker for existence.” (5)",
    "snp4.9:840": "“If indeed it is not by view, by learning, nor by knowledge,”“nor by good behavior and observances, that one speaks of purity; [165]nor without view, without learning, without knowledge,without good behavior and observances — not in that way,I think this is an utterly confused teaching;some fall back on purity by means of view.” (6)",
    "snp4.9:841": "“Asking repeatedly while dependent on a view,“you have become baffled over things tightly grasped.But from this you have not gained even an inkling;hence you consider it utterly confused. (7)",
    "snp4.9:842": "“One who thinks himself equal, superior, or inferiormight engage in disputes because of this.Not shaking among these three discriminations,he does not think ‘equal, superior.’ (8)",
    "snp4.9:843": "“Why would that brahmin assert, ‘It’s true,’or with whom would he dispute, ‘It’s false’?When for him there is no ‘equal’ and ‘unequal,’with whom would he engage in debate? (9)",
    "snp4.9:844": "“Having left home to roam without abode,in the village the muni is intimate with none.Void of sensual pleasures, without preferences,he would not engage in contentious talk with people. (10)",
    "snp4.9:845": "“When he wanders detached from things in the world,the nāga would not grasp and assert them. [166]As a thorny-stalked lotus, born in the water,Reading withCeandEeelambujaṃ kaṇṭakaṃ vārijaṃ yathā.Behasjalambujaṃ.is untainted by water and mud,just so the muni, a proponent of peace, free of greed,is untainted by sensual pleasures and the world. (11)",
    "snp4.9:846": "“Because of a viewReading withCeandEediṭṭhiyāas againstBediṭṭhiyāyako.or an opiniona Veda-master does not become conceited,for he does not identify with them.Not led by kamma or by what is heard,he is not drawn to any abodes. (12)",
    "snp4.9:847": "“For one detached from perception there are no knots;for one liberated by wisdom there are no delusions.But those who have grasped perceptions and viewswander in the world creating friction.” (13)"
}