{
    "snp4.14:915": "“I ask you, Kinsman of the Sun, great rishi,about seclusion and the state of peace.How having seen does a bhikkhu attain nibbāna,not clinging to anything in the world?” (1)",
    "snp4.14:916": "“By reflection, he should stop [the conceit] ‘I am,’the entire root of concepts due to proliferation,”“Whatever cravings there may be internally,he should always train mindfully for their removal. (2)",
    "snp4.14:917": "“Whatever one might know,whether internally or externally,one should not be obstinate on that account,for that is not called quenching by the good. (3)",
    "snp4.14:918": "“Because of this one should not think oneself better,nor should one consider oneself inferior or equal.Being affected in various ways,one should not persist in positioning oneself. (4)",
    "snp4.14:919": "“It is internally that he should achieve peace;a bhikkhu should not seek peace through another.For one who is at peace within himself,there is nothing taken up, much less rejected. (5) [180]",
    "snp4.14:920": "“Just as in the middle of the oceanno wave arises, but the ocean remains steady,so too he should be steady, without impulse;a bhikkhu should not cause a swelling anywhere.” (6)",
    "snp4.14:921": "“The one with opened eyes declaredthe Dhamma he witnessed, the removal of obstacles.Speak about the practice, venerable one,the Pātimokkha and also concentration.” (7)",
    "snp4.14:922": "“One should not be restless with the eyes,one should block the ears against village gossip.One should not be greedy for tastes,and one should not take anything in the world as ‘mine.’ (8)",
    "snp4.14:923": "“When he is touched by a contact,a bhikkhu should not lament anywhere.He should not long for any state of existence,nor should he tremble amid fearful conditions. (9)",
    "snp4.14:924": "“Having obtained food and drink,things to eat or clothes to wear,he should not hoard them,nor be agitated if he does not obtain them. (10)",
    "snp4.14:925": "“He should be a meditator, not one with restless feet;he should refrain from regret; he should not be heedless.A bhikkhu should dwell amid seats and beds[in lodgings] where there is little noise. (11) [181]",
    "snp4.14:926": "“He should not overindulge in sleep;he should be devoted to wakefulness, ardent.He should abandon indolence, hypocrisy, laughing, and playfulness,sexual intercourse, and personal ornamentation. (12)",
    "snp4.14:927": "“He should not employ Atharva spells,or interpret dreams, signs, or constellations.My follower would not decipher animal cries,or practice healing or making women fertile. (13)",
    "snp4.14:928": "“A bhikkhu should not be shaken by blame,nor should he be elated when praised.He should dispel greed and miserliness,as well as anger and slanderous speech. (14)",
    "snp4.14:929": "“A bhikkhu should not engage in buying and selling;he should not do anything that incurs criticism.He should not form intimacy in the village;he should not address people from a desire for gain. (15)",
    "snp4.14:930": "“A bhikkhu should not be boastful,and he should not utter insinuating speech.He should not train himself in impudence;he should not utter contentious talk. (16)",
    "snp4.14:931": "“He should not be led into false speech,nor should he deliberately do anything deceptive. [182]Because of his way of life, his wisdom,or his good behavior and observances,he should not despise another. (17)",
    "snp4.14:932": "“When provoked, having heard many wordsfrom ascetics who speak profusely,he should not respond to them harshly,for the good do not retaliate. (18)",
    "snp4.14:933": "“Having understood this Dhamma, investigating,a bhikkhu should always train mindfully.Having known quenching as peace,he should not be heedless in Gotama’s teaching. (19)",
    "snp4.14:934": "“For he is a conqueror who is himself unconquered;he saw the Dhamma as a witness, not by hearsay.Apparently “he” (so) here refers to “that Blessed One,” the Buddha, in pāda c, not to the monk.Therefore, heedful in that Blessed One’s teaching,always honoring it, one should train in accordance with it.” (20)"
}