{
    "snp4.8:824": "“‘Here alone is purity,’ they declare;they say there is no purification in other teachings.Declaring whatever they depend on to be excellent,many are entrenched in separate truths. (1)",
    "snp4.8:825": "“Desiring debate, having plunged into the assembly,in pairs they accuse one another of being a fool.Those of different convictions assert their argument,desiring praise, claiming to be skilled. (2)",
    "snp4.8:826": "“Keen on speaking in the midst of the assembly,wishing for praise, he becomes anxious.If his assertion is rejected, he feels humiliated.Upset by blame, he seeks a flaw [in his opponent]. (3) [162]",
    "snp4.8:827": "“If they say his assertion is defective,and the judges consider it rejected,the loser laments and sorrows,he moans: ‘He surpassed me.’ (4)",
    "snp4.8:828": "“These disputes have arisen among ascetics;in relation to them, one becomes elated and dejected.Having seen this, too, one should desist from arguments,for there is no other benefit than praise and gain. (5)",
    "snp4.8:829": "“If, however, he is praised there,having declared his doctrine in the midst of the assembly,he is thrilled by this and swells with pride,having obtained the benefit that accords with his wish. (6)",
    "snp4.8:830": "“Though his pride is the ground of distress,he yet speaks from conceit and arrogance.Having seen this, too, one should not dispute;for the skilled say this does not bring purity. (7)",
    "snp4.8:831": "“Just as a hero, nourished on the king’s food,comes thundering, desiring an opponent,rush off in his direction, Sūra;I takesūrahere, which means “hero,” to be a short form of the adversary’s name, Pasūra.already in the past, there was no scope for a fight. (8)",
    "snp4.8:832": "“When they grasp a view and argue,and assert, ‘This alone is true,’ [163]tell them: ‘When a debate has arisenthere is no opponent for you here.’ (9)",
    "snp4.8:833": "“But among those who live remote,who do not oppose a view with other views,what will you obtain, Pasūra, from thosewho grasp nothing here as supreme? (10)",
    "snp4.8:834": "“But now you have come brooding,devising speculative views in your mind.You have confronted one who is cleansed:indeed, you won’t be able to succeed.” (11)"
}