{
    "snp4.11:862": "“From where do quarrels and disputes arise,lamentation, sorrow, and miserliness?From where do conceit and arrogance arisealong with slander? Please tell me this.” (1)",
    "snp4.11:863": "“Quarrels and disputes arise from what is pleasing,as do lamentation, sorrow, and miserliness,conceit and arrogance along with slander.Quarrels and disputes are connected with miserliness,and slanders occur when disputes arise.”In the Pāli itself this is a verse of five pādas.(2) [169]",
    "snp4.11:864": "“From what do pleasing things in the world originate,and those states of greed that spread through the world?From what do longing and fulfillment originate,which a person has about the future?” (3)",
    "snp4.11:865": "“Pleasing things in the world originate from desire,as do those states of greed that spread through the world.From this originate the longing and fulfillmentthat a person has about the future.” (4)",
    "snp4.11:866": "“From what in the world does desire originate?And from what do judgments too arise,and anger, false speech, and perplexity,and those [other] things the Ascetic has mentioned?” (5)",
    "snp4.11:867": "“Desire originates based on what they sayis ‘pleasant’ or ‘unpleasant’ in the world.Having seen the vanishing and coming-to-be of forms,a person forms a judgment in the world. (6)",
    "snp4.11:868": "“Anger, false speech, and perplexity:these things, too, arise when that dyad exists.One perplexed should train on the path of knowledge;having known, the Ascetic stated these things.” (7)",
    "snp4.11:869": "“From what do the pleasant and unpleasant originate?When what does not exist do these not come to be?As to this matter of vanishing and coming-to-be,tell me from what it originates.” (8)",
    "snp4.11:870": "“The pleasant and unpleasant originate from contact;when contact does not exist, these do not come to be. [170]As to this matter of vanishing and coming-to-be,I tell you that it originates from this.” (9)",
    "snp4.11:871": "“From what in the world does contact originate?From what do possessions too arise?When what does not exist is there no taking as ‘mine’?When what has vanished do contacts not touch one?” (10)",
    "snp4.11:872": "“ContactsWithCeandEe, I read the pluralphassā.Behas the singularphasso, as does the citation of the verse in Niddesa.are dependent upon name and form;possessions are based on desire.When desire does not exist,AgainstEeicchā na santyā, I read withBeandCethe locative absoluteicchāy’asantyā. This is the reading of the line as cited in Niddesa, supported by the gloss.there is no taking as ‘mine.’When form has vanished, contacts do not touch one.” (11)",
    "snp4.11:873": "“How must one attain for form to vanish?How do pleasure and pain also vanish?Please tell me this, how they vanish.We would like to know that — such is my thought.” (12)",
    "snp4.11:874": "“Not percipient through perception,not percipient through disturbed perception,not altogether without perception,not percipient of what has vanished:form vanishes for one who has so attained,for concepts due to proliferation are based on perception.” (13)",
    "snp4.11:875": "“You explained to us whatever we asked you.Let us now ask something else: please tell me this. [171]Do some wise men here say that at this pointthis is the foremost purity of the spirit,or do they speak of it as different from this?”This is another five pāda verse.(14)",
    "snp4.11:876": "“Some wise men here say that at this pointthis is the foremost purity of the spirit.ButI readpan’ekehere withBeandCe, as againstEepun’eke.some among them, claiming to be skilled,speak of an attainment without residue remaining. (15)",
    "snp4.11:877": "“Having known these to be ‘dependent,’and having known the dependencies, the muni, the investigator,having known, liberated, does not enter disputes;the wise one does not come upon various states of existence.” (16)"
}