{
    "snp4.13:895": "“Those who are settled in views,who dispute, saying, ‘This alone is truth’:do all of them receive only blame,or do some there also win praise?” (1) [175]",
    "snp4.13:896": "“This [praise] is slight, not sufficient for peace;I say there are two fruits of disputes.Having seen this too, one should not dispute,seeing as security the stage of non-dispute. (2)",
    "snp4.13:897": "“Whatever commonplace opinions there are,a wise person does not get involved in them.Why would one uninvolved become involvedwhen he does not acquiesce in what is seen and heard? (3)",
    "snp4.13:898": "“Those who take good behavior as supremespeak of purity through self-control.Having taken up an observance, they settle on it,thinking: ‘Let’s train right here, then there would be purity.’I follow Norman in readingsuddhihere in place ofsuddhiṃ, found in all three editions.Claiming to be skilled, they are led back into existence. (4)",
    "snp4.13:899": "“If he has fallen away from good behavior and observances,he trembles because he has failed in his action.He longs and yearns for purity here,like one on a journey who has lost his caravan. (5)",
    "snp4.13:900": "“But having abandoned all good behavior and observances,and these deeds, blameworthy and blameless, [176]not yearning for either purity or impurity,one should live detached, not grasping peace. (6)",
    "snp4.13:901": "“Dependent on austerity or scrupulousness,WithEe, I readtapūpanissāya, followed by Norman.BeandCehavetamūpanissāya. As in the text, I read here with Eetapūpanissāyajigucchitaṃ vā. Be and Ce havetamūpanissāyain their editions of Niddesa as well as in the text. However, as Norman points out (GD350), the explanation in Niddesa (tapojigucchavādā tapojigucchasārā tapojigucchanissitā) points totapūpanissāyaas the correct reading. This is further confirmed byNidd I-aII 367. Jayawickrama is ambiguous: he readstamūpanissāyabut translates “Depending either on it (austerity), which is despised . . .” Paññobhāsa, takingtamūpanissāyaas asandhioftamo upanissāya, renders “Depending upon ignorant darkness,” but there is no exegetical support for this and it is not idiomatic.Jigucchitaṃcan be understood as a past participle used as a noun.or on what is seen, heard, or sensed,running onward, they declare purity,not rid of craving for various states of existence. (7)",
    "snp4.13:902": "“For one who yearns there are longingsand trembling too over things mentally formulated;but for one here who has no passing away or rebirth,why would he tremble and for what would he long?” (8)",
    "snp4.13:903": "“The teaching that some here say is supreme,others say that the same is inferior.Which assertion of theirs could be truewhen they all claim to be skilled?” (9)",
    "snp4.13:904": "“They say their own teaching is complete,but they say the other’s teaching is inferior.Having quarreled thus, they go on disputing,as they each say their own opinion is true. (10)",
    "snp4.13:905": "“If one is inferior when disparaged by an opponent,no one would be distinguished among teachings.For they each say the other’s teaching is inferior,while firmly advocating their own. (11) [177]",
    "snp4.13:906": "“And their veneration of their own teachingI read withCeandEesadhammapūjā ca pana tath’eva.Be’ssaddhammapūjāshould be corrected.is done just as they praise their own ways.All their assertions would be truthful,since for them purity is exclusively their own. (12)",
    "snp4.13:907": "“For a brahmin there is no being led by others,no selecting among teachings and grasping tightly.Therefore he has overcome disputes,since he does not regard another teaching as supreme. (13)",
    "snp4.13:908": "“Saying, ‘I know, I see, it is just like this,’some here fall back on purity through a view.If one has seen, what good is this to himself?Having gone too far, they assert purity by another. (14)",
    "snp4.13:909": "“Seeing, a person will see name-and-form;having seen, it is just these that he will know.Granted, let him see much or little,the skillful say purity is not won in that way. (15)",
    "snp4.13:910": "“A dogmatist is not easily disciplined,Reading withBeandCesubbinayoforEesuddhināyo.Pj II(Ee) also hassubbinayoin the lemma.one preferring a formulated view.Claiming that the good is found in what he depends on,as a proponent of purity, he saw things that way there. (16)",
    "snp4.13:911": "“Having comprehended,I followBehere in reading the absolutivesaṅkhā, as againstCeandEe, which have the present participlesaṅkhaṃ.Pj IIand Niddesa both gloss the word as an absolutive.a brahmindoes not take up mental constructs;he is not a pursuer of views nor a kinsman of knowledge. [178]Having known the commonplace opinions,he maintains equanimity while others grasp. (17)",
    "snp4.13:912": "“Having loosened the knots here in the world,the muni does not take sides in arisen disputes.He is peaceful among the restless, equanimous,without grasping while others grasp. (18)",
    "snp4.13:913": "“Having abandoned past influxes, not creating new ones,he does not go along with desire, nor is he a dogmatist.Released from speculative views, the wise person,free of self-reproach, is not tainted by the world. (19)",
    "snp4.13:914": "“He is remote from all phenomena,from whatever is seen, heard, or sensed.With his burden dropped, released,Reading withBevippamutto, as againstCeandEevippayutto.the muni, not given to mental construction,does not desist, does not yearn” —so said the Blessed One. (20) [179]"
}