{
    "snp4.16:955": "“I have never before seen,”“nor have I ever heard it from anyone —a teacher of such lovely speech,leader of a group, who has come from Tusita, (1)",
    "snp4.16:956": "“as the One with Vision is seenin the world together with its devas.Having dispelled all darkness,alone, he achieved delight. (2) [186]",
    "snp4.16:957": "“To the Buddha, unattached, impartial,not a schemer, one who has come as leader of a group,I have come in need with a questionon behalf of the many here who are bound. (3)",
    "snp4.16:958": "“When a bhikkhu is repulsedand resorts to a solitary seat,to the foot of a tree or a charnel ground,or [to a seat] in mountain caves, (4)",
    "snp4.16:959": "“to various sorts of lodgings,how many fearful things are therebecause of which a bhikkhu should not tremblein a lodging with little noise? (5)",
    "snp4.16:960": "“How many obstacles in the worldconfront one going to the untraveled region,I read withBeandCeagataṃ disaṃ, as againstEeamataṃ disaṃ.Pj IIand Niddesa clearly comment onagataṃ.[obstacles] that a bhikkhu must overcomewhen living in a remote lodging? (6)",
    "snp4.16:961": "“What ways of speech should he adopt?On what resorts here should he rely?What should be the good behavior and observancesof a bhikkhu who is resolute? (7)",
    "snp4.16:962": "“Having taken up what training,dwelling unified, judicious, mindful,should he blow away his own stainsas a smith [removes the flaws] of silver?” (8)",
    "snp4.16:963": "“As one who understands I will tell youin accordance with the Dhamma,“what is comfortable for one who is repulsed,if, wishing for enlightenment,he resorts to a solitary lodging. (9)",
    "snp4.16:964": "“A wise one, a mindful bhikkhu of bounded conduct,should not be afraid of five perils:gadflies and other flies, creeping serpents,encounters with people, four-footed animals, (10) [187]",
    "snp4.16:965": "“nor should he fear followers of other teachings,even when he sees the many fears they pose.One seeking the good should conquerany other obstacles [he encounters]. (11)",
    "snp4.16:966": "“Afflicted by illness and hunger,he should endure cold and excessive heat.The homeless one, affected by these in many ways,should remain firm, exerting energy. (12)",
    "snp4.16:967": "“He should not commit theft or speak falsely;he should suffuse the frail and firm with loving-kindness.If he should recognize any blemish of the mind,he should dispel it as ‘a faction of the Dark One.’ (13)",
    "snp4.16:968": "“He should not come under the control of anger and arrogance,but should dig them up by their root too.Then, withstanding the pleasing and displeasing,he should conquer them as well. (14)",
    "snp4.16:969": "“Giving precedence to wisdom, rejoicing in the good,he should suppress those obstacles.He should vanquish discontent with remote lodgings;he should vanquish the four factors of lamentation. (15)",
    "snp4.16:970": "“ ‘What will I eat? Where will I eat?Alas, I slept badly! Where will I sleep?’:one in training, wandering without abode,should remove these thoughts of lamentation. (16) [188]",
    "snp4.16:971": "“Having obtained a meal and clothing in time,he should know moderation for the sake of contentment here.Guarded in these things,Reading withBeandCeso tesu.Eesotesushould be corrected.wandering restrained in the village,even when provoked, he should not utter harsh speech. (17)",
    "snp4.16:972": "“His eyes should be downcast;he should not have restless feet;intent on jhāna, he should be wakeful.Inwardly concentrated, based on equanimity,he should cut off regret and inclination to thought. (18)",
    "snp4.16:973": "“If reproached with words, a mindful one should welcome them;he should break through a barren heart toward fellow monastics.He should utter wholesome speech, but not to excess;he should not intend [speech] that people might blame. (19)",
    "snp4.16:974": "“Further, there are five kinds of dust in the world,for the removal of which a mindful one should train.One should vanquish lust for forms and sounds,for tastes, odors, and tactile objects. (20)",
    "snp4.16:975": "“A bhikkhu who is mindful, well liberated in mind,should remove desire for these things. [189]At the proper time rightly investigating the Dhamma,unified, he should destroy darkness” —so said the Blessed One. (21)"
}