{
    "snp4.12:878": "“Settled each in his own view,contending, the skilled make diverse assertions:‘One who knows this has understood the Dhamma;rejecting this, one is not consummate.’ (1)",
    "snp4.12:879": "“Having contended thus, they disputeand say: ‘The opponent is a fool, unskilled.’Which assertion among these is truthful,for they all claim to be skilled?” (2) [172]",
    "snp4.12:880": "“If one who does not affirm the opponent’s doctrineis thereby a fool, a brute,Note 205. Reading withCeandEebālo magoas againstBebālomako.deficient in wisdom,all indeed are fools, utterly deficient in wisdom:for all these are settled in their views. (3)",
    "snp4.12:881": "“But if by their own view they are cleansed,There are both negative and affirmative readings of this line. I follow the affirmative reading ofEesandiṭṭhiyā ce pana vīvadātā, as against the negative readings ofCesandiṭṭhiyā c’eva na vevadātāandBesandiṭṭhiyā c’eva na vīvadātā.Pj IIglosses on the basis of the negative reading but admits the affirmative as an alternative.pure in wisdom, skilled, intelligent,there is none among them defective in wisdom,for their views are similarly taken up. (4)",
    "snp4.12:882": "“I do not say, ‘This is correct,’as the fools in pairs say to one another.They all take their own view to be true;therefore they consider the opponent a fool.” (5)",
    "snp4.12:883": "“That which some say is ‘true, correct,’others say is ‘hollow, false.’Having contended thus, they dispute.Why don’t ascetics speak in unison?” (6)",
    "snp4.12:884": "“Truth, indeed, is one — there is no second;a person who understands this would not dispute.Note 207. I read the text as inBeandCe, yasmiṃ pajā no vivade pajānaṃ, which is supported byPj II.Eehasyasmiṃ pajāno vivade pajānaṃ.These proclaim their own diverse truths;therefore ascetics do not speak in unison.” (7) [173]",
    "snp4.12:885": "“But why do they assert diverse truths,those proponents who claim to be skilled?Are those truths actually many and diverse,or do they follow a line of reasoning?” (8)",
    "snp4.12:886": "“Truths surely are not many and diverse,except by [mistakenly] perceiving permanent things in the world.But having formulated reasoning about views,they assert the dyad ‘true’ and ‘false.’ (9)",
    "snp4.12:887": "“The seen, heard, good behavior and observances,the sensed — dependent on these, he shows disdain.Based on a judgment, derisive,he says: ‘The opponent is a fool, unskilled.’ (10)",
    "snp4.12:888": "“As he considers the opponent a fool,on the same ground he describes himself as ‘skilled.’Of his own accord, claiming himself skilled,he disdains the other, yet speaks in the same way.Reading withCeandEetath’evaas againstBetadeva.(11)",
    "snp4.12:889": "“Inflated by that extremist view,intoxicated with conceit, thinking himself perfect,on his own accord he has mentally anointed himself,for that view of his is taken up in such a manner. (12)",
    "snp4.12:890": "“If one is deficient because of the opponent’s word,the opponent himself is similarly deficient in wisdom.But if he is himself a master of knowledge, a wise man,then there is no fool among ascetics. (13) [174]",
    "snp4.12:891": "“Those who assert a teachingdifferent from this to be defectivehave failed to reach purity:thus the sectarians speak in separate ways,for they are attached to their own views. (14)",
    "snp4.12:892": "“‘Here only is purity’ they assert;they say there is no purification in other teachings.Thus, too, the sectarians, separately entrenched,firmly assert their own way there. (15)",
    "snp4.12:893": "“Asserting firmly his own way,what opponent here could one consider a fool?He himself would just provoke strifeby calling his opponent a fool of impure character. (16)",
    "snp4.12:894": "“Based on a judgment, taking himself as the measure,he enters upon further disputes in the world.Having abandoned all judgments,a person does not create strife in the world.” (17)"
}