{
    "snp5.7:1077": "“There are munis in the world,”“so people say, but how is this so?Do they declare one who has knowledge a munior one following a particular way of life?” (1)",
    "snp5.7:1078": "“Not by view, nor by learning, nor by knowledge,Nanda, do the skilled here speak of a muni. [208]They are munis, I say, who live remote,untroubled, without wishes.” (2)",
    "snp5.7:1079": "“Those ascetics and brahmins,”“who say that purity [is gained] through the seen and heard,that purity [is gained], too, by good behavior and observances,who say purity [is gained] through numerous methods —living restrainedEeyathāhere and just below in the reply should be corrected toyatā, as inBeandCe.there, Blessed One, have theycrossed over birth and old age, dear sir?I ask you, Blessed One. Please answer me.” (3)",
    "snp5.7:1080": "“Those ascetics and brahmins,“who say that purity [is gained] through the seen and heard,that purity [is gained], too, by good behavior and observances,who say purity [is gained] through numerous methods —though they live restrained there, I saythey have not crossed over birth and old age.” (4)",
    "snp5.7:1081": "“Those ascetics and brahmins,”“who say that purity [is gained] through the seen and heard,that purity [is gained], too, by good behavior and observances,who say purity [is gained] through numerous methods —if, O muni, you say they have not crossed the flood,InCethis line begins a new verse, while inBeandEethis line and those that follow are included in the same verse as the preceding lines.[209]then who in the world of devas and humanshas crossed over birth and old age, dear sir?I ask you, Blessed One. Please answer me.” (5)",
    "snp5.7:1082": "“I do not say of all ascetics and brahmins,“that they are shrouded by birth and old age.Those here who have abandoned the seen, the heard and sensed,and all good behavior and observances,who have abandoned, too, everything of numerous kinds,who, having fully understood craving, are without influxes:those, I say, are ‘persons who have crossed the flood.’ ” (6)",
    "snp5.7:1083": "“I delight in this word of the great rishi.Well procaimed, O Gotama, is the state without acquisitions.Those here who have abandoned the seen, heard, and sensed,as well as all good behavior and observances,who have abandoned, too, everything of numerous kinds,who, having fully understood craving, are without influxes:I too say: ‘They have crossed the flood.’ ” (7)"
}