{
    "snp5.6:1069": "“Alone, Sakya, unsupported,”“I am not able to cross over the great flood.Declare to me a basis, O universal eye,supported by which I might cross over this flood.”I read the verb as the first persontareyyaṃ, withBeandCeand all three editions ofNidd II, as againstEetareyya.(1)",
    "snp5.6:1070": "“Contemplating nothingness, mindful,“supported by ‘there is not,’ cross over the flood. [206]Having abandoned sensual pleasures, refraining from perplexity,night and day see into the destruction of craving.” (2)",
    "snp5.6:1071": "“One devoid of lust for all sensual pleasures,”“supported by nothingness, having discarded all else,liberated in the supreme emancipation of perception:All three editions havevimuttohere butCehasdhimutto(=adhimutto) in the parallel line of the next verse.Pj IIdoes not cite the line, but Niddesa hasdhimutto. In the text, I readvimuttowithBeandEeas againstCedhimutto(=adhimutto).Pj IIdoes not gloss the word.Nidd IIglossesadhimutto tatrādhimutto tadadhimutto. Despite this, it seems this meditator has already attained the base of nothingness, which would correspond better tovimutto. In contrast,adhimuttosuggests resolution on attaining it.would he stay there without departing?” (3)",
    "snp5.6:1072": "“One devoid of lust for all sensual pleasures,“supported by nothingness, having discarded all else,liberated in the supreme emancipation of perception,would stay there without departing.” (4)",
    "snp5.6:1073": "“If he would stay there without departingeven for a multitude of years, O universal eye,would he become cool, liberated right there —[or] would the consciousness of such a one pass away?”Ee’sbhavethashould be corrected tocavetha. I have added “or” in brackets, following the explanations of Niddesa andPj II. Norman, however, does not see alternatives here, but translates:“If he should remain there . . . would consciousness disappear for him in such a state?”(5)",
    "snp5.6:1074": "“As a flame, thrown by a gust of wind,“goes out and cannot be designated, [207]so the muni, liberated from the mental body,goes out and cannot be designated.” (6)",
    "snp5.6:1075": "“But does one who has gone out not exist,or else is he intact through eternity?Explain this matter clearly to me, O muni,for this Dhamma has been understood by you.” (7)",
    "snp5.6:1076": "“There is no measure of one who has gone out,“There is no means by which they might speak of him.When all phenomena have been uprooted,all pathways of speech are also uprooted.” (8)"
}