{
    "snp5.4:1049": "“I ask you a question, Blessed One, please tell me this,” .“I consider you a Veda-master, one inwardly developed.From where have these sufferings arisenin their many forms in the world?” (1) [202]",
    "snp5.4:1050": "“You have asked me about the origin of suffering,“As one who understands, I will tell you this.Sufferings in their many forms in the worldoriginate based on acquisition.The last two pādas of this stanza, together with the next, constitute verse 728, a six-pāda stanza.(2)",
    "snp5.4:1051": "“The ignorant dullard who creates acquisitionencounters suffering again and again.Therefore, understanding,Behaspajānaṃas againstCeandEehi jānaṃ. Niddesa haspajānaṃ, which is supported by the synonyms that follow. In verse 728 bothCeand Ee havepajānaṃ.one should not create acquisition,contemplating it as the genesis and origin of suffering.” (3)",
    "snp5.4:1052": "“You have told us what we asked.Let me ask you another — please speak on this.How do the wise cross over the flood,over birth and old age, sorrow and lamenting?Explain this to me clearly, muni,for this Dhamma has been understood by you.” (4)",
    "snp5.4:1053": "“I will proclaim this Dhamma to you,“seen in this very life, no matter of hearsay,having understood which, living mindfully,one can cross over attachment to the world.” (5)",
    "snp5.4:1054": "“And I delight, great rishi,in that supreme Dhamma,having understood which, living mindfully,one can cross over attachment to the world.” (6)",
    "snp5.4:1055": "“Whatever you comprehend,“above, below, and across in the middle, [203]having dispelled delight and attachment to these,consciousness would not persist in existence. (7)",
    "snp5.4:1056": "“A bhikkhu so dwelling, mindful, heedful,having given up taking things as ‘mine,’right here such a wise one might abandon suffering:birth and old age, sorrow and lamenting.” (8)",
    "snp5.4:1057": "“I delight in this word of the great rishi;well procaimed, Gotama, is the state without acquisitions.Certainly the Blessed One has abandoned suffering,for this Dhamma has been understood by you. (9)",
    "snp5.4:1058": "“Surely they too can abandon sufferingwhom you, muni, would constantly exhort.Therefore, having met you, O nāga, I pay homage:perhaps the Blessed One would constantly exhort me.” (10)",
    "snp5.4:1059": "“Whatever brahmin you may know to be a Veda-master,owning nothing, unattached to sensual pleasures and existence,he has certainly crossed this flood,and crossed to the beyond, he is unbarren, rid of doubt. (11)",
    "snp5.4:1060": "“And the wise man here, the Veda-master,having loosened this tie to various states of existence, [204]rid of craving, untroubled, wishless,has crossed over birth and old age, I say.” (12)"
}