{
    "sn1.38:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā rājagahe vihārati maddakucchismiṁ migadāye. Tena kho pana samayena bhagavato pādo sakalikāya khato hoti. Bhusā sudaṁ bhagavato vedanā vattanti sārīrikā vedanā dukkhā tibbā kharā kaṭukā asātā amanāpā; tā sudaṁ bhagavā sato sampajāno adhivāseti avihaññamāno. Atha kho bhagavā catugguṇaṁ saṅghāṭiṁ paññāpetvā dakkhiṇena passena sīhaseyyaṁ kappeti pāde pādaṁ accādhāya sato sampajāno.",
    "sn1.38:2": "Atha kho sattasatā satullapakāyikā devatāyo abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṁ maddakucchiṁ obhāsetvā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhaṁsu.",
    "sn1.38:3": "Atha kho aparā devatā bhagavato santike imaṁ udānaṁ udānesi: \"sīho vata, bho, samaṇo gotamo; sīhavatā ca samuppannā sārīrikā vedanā dukkhā tibbā kharā kaṭukā asātā amanāpā sato sampajāno adhivāseti avihaññamāno\"ti.",
    "sn1.38:4": "Atha kho aparā devatā bhagavato santike imaṁ udānaṁ udānesi: \"ājānīyo vata, bho, samaṇo gotamo; ājānīyavatā ca samuppannā sārīrikā vedanā dukkhā tibbā kharā kaṭukā asātā amanāpā sato sampajāno adhivāseti avihaññamāno\"ti.",
    "sn1.38:5": "Atha kho aparā devatā bhagavato santike imaṁ udānaṁ udānesi: \"nisabho vata, bho, samaṇo gotamo; nisabhavatā ca samuppannā sārīrikā vedanā dukkhā tibbā kharā kaṭukā asātā amanāpā sato sampajāno adhivāseti avihaññamāno\"ti.",
    "sn1.38:6": "Atha kho aparā devatā bhagavato santike imaṁ udānaṁ udānesi: \"dhorayho vata, bho, samaṇo gotamo; dhorayhavatā ca samuppannā sārīrikā vedanā dukkhā tibbā kharā kaṭukā asātā amanāpā sato sampajāno adhivāseti avihaññamāno\"ti.",
    "sn1.38:7": "Atha kho aparā devatā bhagavato santike imaṁ udānaṁ udānesi: \"danto vata, bho, samaṇo gotamo; dantavatā ca samuppannā sārīrikā vedanā dukkhā tibbā kharā kaṭukā asātā amanāpā sato sampajāno adhivāseti avihaññamāno\"ti.",
    "sn1.38:8": "Atha kho aparā devatā bhagavato santike imaṁ udānaṁ udānesi: \"passa samādhiṁ subhāvitaṁ cittañca suvimuttaṁ, na cābhinataṁ na cāpanataṁ na ca sasaṅkhāraniggayhavāritagataṁ. Yo evarūpaṁ purisanāgaṁ purisasīhaṁ purisaājānīyaṁ purisanisabhaṁ purisadhorayhaṁ purisadantaṁ atikkamitabbaṁ maññeyya kimaññatra adassanā\"ti.",
    "sn1.38:9": "\"Pañcavedā sataṁ samaṁ,Tapassī brāhmaṇā caraṁ;Cittañca nesaṁ na sammā vimuttaṁ,Hīnattharūpā na pāraṅgamā te.",
    "sn1.38:10": "Taṇhādhipannā vatasīlabaddhā,Lūkhaṁ tapaṁ vassasataṁ carantā;Cittañca nesaṁ na sammā vimuttaṁ,Hīnattharūpā na pāraṅgamā te.",
    "sn1.38:11": "Na mānakāmassa damo idhatthi,Na monamatthi asamāhitassa;Eko araññe vihāraṁ pamatto,Na maccudheyyassa tareyya pāran\"ti.",
    "sn1.38:12": "\"Mānaṁ pahāya susamāhitatto,Sucetaso sabbadhi vippamutto;Eko araññe vihāramappamatto,Sa maccudheyyassa tareyya pāran\"ti."
}