{
    "sn10.8:1": "Ekaṁ samayaṁ bhagavā rājagahe vihārati sītavane. Tena kho pana samayena anāthapiṇḍiko gahapati rājagahaṁ anuppatto hoti kenacideva karaṇīyena. Assosi kho anāthapiṇḍiko gahapati: \"buddho kira loke uppanno\"ti. Tāvadeva ca pana bhagavantaṁ dassanāya upasaṅkamitukāmo hoti. Athassa anāthapiṇḍikassa gahapatissa etadahosi: \"akālo kho ajja bhagavantaṁ dassanāya upasaṅkamituṁ. Sve dānāhaṁ kālena bhagavantaṁ dassanāya gamissāmī\"ti buddhagatāya satiyā nipajji. Rattiyā sudaṁ tikkhattuṁ vuṭṭhāsi pabhātanti maññamāno. Atha kho anāthapiṇḍiko gahapati yena sivathikadvāraṁ tenupasaṅkami. Amanussā dvāraṁ vivariṁsu. Atha kho anāthapiṇḍikassa gahapatissa nagaramhā nikkhamantassa āloko antaradhāyi, andhakāro pāturahosi, bhayaṁ chambhitattaṁ lomahaṁso udapādi, tatova puna nivattitukāmo ahosi. Atha kho sivako yakkho antarahito saddamanussāvesi:",
    "sn10.8:2": "\"Sataṁ hatthī sataṁ assā,Sataṁ assatarīrathā;Sataṁ kaññāsahassāni,Āmukkamaṇikuṇḍalā;Ekassa padavītihārassa,Kalaṁ nāgghanti soḷasiṁ.",
    "sn10.8:3": "Abhikkama gahapati,abhikkama gahapati;Abhikkamanaṁ te seyyo,no paṭikkamanan\"ti.",
    "sn10.8:4": "Atha kho anāthapiṇḍikassa gahapatissa andhakāro antaradhāyi, āloko pāturahosi, yaṁ ahosi bhayaṁ chambhitattaṁ lomahaṁso, so paṭippassambhi. Dutiyampi kho anāthapiṇḍikassa gahapatissa āloko antaradhāyi, andhakāro pāturahosi, bhayaṁ chambhitattaṁ lomahaṁso udapādi, tatova puna nivattitukāmo ahosi. Dutiyampi kho sivako yakkho antarahito saddamanussāvesi:",
    "sn10.8:5": "\"Sataṁ hatthī sataṁ assā,… pe …Kalaṁ nāgghanti soḷasiṁ.",
    "sn10.8:6": "Abhikkama gahapati,abhikkama gahapati;Abhikkamanaṁ te seyyo,no paṭikkamanan\"ti.",
    "sn10.8:7": "Atha kho anāthapiṇḍikassa gahapatissa andhakāro antaradhāyi, āloko pāturahosi, yaṁ ahosi bhayaṁ chambhitattaṁ lomahaṁso, so paṭippassambhi. Tatiyampi kho anāthapiṇḍikassa gahapatissa āloko antaradhāyi, andhakāro pāturahosi, bhayaṁ chambhitattaṁ lomahaṁso udapādi, tatova puna nivattitukāmo ahosi. Tatiyampi kho sivako yakkho antarahito saddamanussāvesi:",
    "sn10.8:8": "\"Sataṁ hatthī sataṁ assā,… pe …Kalaṁ nāgghanti soḷasiṁ.",
    "sn10.8:9": "Abhikkama gahapati,abhikkama gahapati;Abhikkamanaṁ te seyyo,no paṭikkamanan\"ti.",
    "sn10.8:10": "Atha kho anāthapiṇḍikassa gahapatissa andhakāro antaradhāyi, āloko pāturahosi, yaṁ ahosi bhayaṁ chambhitattaṁ lomahaṁso, so paṭippassambhi.Atha kho anāthapiṇḍiko gahapati yena sītavanaṁ yena bhagavā tenupasaṅkami.",
    "sn10.8:11": "Tena kho pana samayena bhagavā rattiyā paccūsasamayaṁ paccuṭṭhāya abbhokāse caṅkamati. Addasā kho bhagavā anāthapiṇḍikaṁ gahapatiṁ dūratova āgacchantaṁ. Disvāna caṅkamā orohitvā paññatte āsane nisīdi. Nisajja kho bhagavā anāthapiṇḍikaṁ gahapatiṁ etadavoca: \"ehi, sudattā\"ti.Atha kho anāthapiṇḍiko gahapati, nāmena maṁ bhagavā ālapatīti, haṭṭho udaggo tattheva bhagavato pādesu sirasā nipatitvā bhagavantaṁ etadavoca: \"Kacci, bhante, bhagavā sukhamasayitthā\"ti?",
    "sn10.8:12": "\"Sabbadā ve sukhaṁ seti,brāhmaṇo parinibbuto;Yo na limpati kāmesu,sītibhūto nirūpadhi.",
    "sn10.8:13": "Sabbā āsattiyo chetvā,vineyya hadaye daraṁ;Upasanto sukhaṁ seti,santiṁ pappuyya cetasā\"ti."
}