{
    "sn11.13:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā vesāliyaṁ vihārati mahāvane kūṭāgārasālāyaṁ. Atha kho mahāli licchavī yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho mahāli licchavī bhagavantaṁ etadavoca:",
    "sn11.13:2": "\"Diṭṭho kho, bhante, bhagavatā sakko devānamindo\"ti?",
    "sn11.13:3": "\"Diṭṭho kho me, mahāli, sakko devānamindo\"ti.",
    "sn11.13:4": "\"So hi nūna, bhante, sakkapatirūpako bhavissati. Duddaso hi, bhante, sakko devānamindo\"ti.",
    "sn11.13:5": "\"Sakkañca khvāhaṁ, mahāli, pajānāmi sakkakaraṇe ca dhamme, yesaṁ dhammānaṁ samādinnattā sakko sakkattaṁ ajjhagā, tañca pajānāmi.",
    "sn11.13:6": "Sakko, mahāli, devānamindo pubbe manussabhūto samāno magho nāma māṇavo ahosi, tasmā maghavāti vuccati.",
    "sn11.13:7": "Sakko, mahāli, devānamindo pubbe manussabhūto samāno sakkaccaṁ dānaṁ adāsi, tasmā sakkoti vuccati.",
    "sn11.13:8": "Sakko, mahāli, devānamindo pubbe manussabhūto samāno pure dānaṁ adāsi, tasmā purindadoti vuccati.",
    "sn11.13:9": "Sakko, mahāli, devānamindo pubbe manussabhūto samāno āvasathaṁ adāsi, tasmā vāsavoti vuccati.",
    "sn11.13:10": "Sakko, mahāli, devānamindo sahassampi atthānaṁ muhuttena cinteti, tasmā sahassakkhoti vuccati.",
    "sn11.13:11": "Sakkassa, mahāli, devānamindassa sujā nāma asurakaññā pajāpati, tasmā sujampatīti vuccati.",
    "sn11.13:12": "Sakko, mahāli, devānamindo devānaṁ tāvatiṁsānaṁ issariyādhipaccaṁ rajjaṁ kāreti, tasmā devānamindoti vuccati.",
    "sn11.13:13": "Sakkassa, mahāli, devānamindassa pubbe manussabhūtassa satta vatapadāni samattāni samādinnāni ahesuṁ, yesaṁ samādinnattā sakko sakkattaṁ ajjhagā. Katamāni satta vatapadāni? Yāvajīvaṁ mātāpettibharo assaṁ, yāvajīvaṁ kule jeṭṭhāpacāyī assaṁ, yāvajīvaṁ saṇhavāco assaṁ, yāvajīvaṁ apisuṇavāco assaṁ, yāvajīvaṁ vigatamalamaccherena cetasā agāraṁ ajjhāvaseyyaṁ muttacāgo payatapāṇi vossaggarato yācayogo dānasaṁvibhāgarato, yāvajīvaṁ saccavāco assaṁ, yāvajīvaṁ akkodhano assaṁ – sacepi me kodho uppajjeyya, khippameva naṁ paṭivineyyanti. Sakkassa, mahāli, devānamindassa pubbe manussabhūtassa imāni satta vatapadāni samattāni samādinnāni ahesuṁ, yesaṁ samādinnattā sakko sakkattaṁ ajjhagāti.",
    "sn11.13:14": "Mātāpettibharaṁ jantuṁ,kule jeṭṭhāpacāyinaṁ;Saṇhaṁ sakhilasambhāsaṁ,pesuṇeyyappahāyinaṁ.",
    "sn11.13:15": "Maccheravinaye yuttaṁ,saccaṁ kodhābhibhuṁ naraṁ;Taṁ ve devā tāvatiṁsā,āhu sappuriso itī\"ti."
}