{
    "sn12.24:1": "Rājagahe vihārati veḷuvane. Atha kho āyasmā sāriputto pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya rājagahaṁ piṇḍāya pāvisi. Atha kho āyasmato sāriputtassa etadahosi: \"atippago kho tāva rājagahe piṇḍāya carituṁ. Yannūnāhaṁ yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkameyyan\"ti.",
    "sn12.24:2": "Atha kho āyasmā sāriputto yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkami; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho āyasmantaṁ sāriputtaṁ te aññatitthiyā paribbājakā etadavocuṁ:",
    "sn12.24:3": "\"Santāvuso sāriputta, eke samaṇabrāhmaṇā kammavādā sayaṅkataṁ dukkhaṁ paññapenti. Santi panāvuso sāriputta, eke samaṇabrāhmaṇā kammavādā paraṅkataṁ dukkhaṁ paññapenti. Santāvuso sāriputta, eke samaṇabrāhmaṇā kammavādā sayaṅkatañca paraṅkatañca dukkhaṁ paññapenti. Santi panāvuso sāriputta, eke samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ dukkhaṁ paññapenti. Idha, panāvuso sāriputta, samaṇo gotamo kiṁvādī kimakkhāyī? Kathaṁ byākaramānā ca mayaṁ vuttavādino ceva samaṇassa gotamassa assāma, na ca samaṇaṁ gotamaṁ abhūtena abbhācikkheyyāma, dhammassa cānudhammaṁ byākareyyāma, na ca koci sahadhammiko vādānupāto gārayhaṁ ṭhānaṁ āgaccheyyā\"ti?",
    "sn12.24:4": "\"Paṭiccasamuppannaṁ kho, āvuso, dukkhaṁ vuttaṁ bhagavatā. Kiṁ paṭicca? Phassaṁ paṭicca. Iti vadaṁ vuttavādī ceva bhagavato assa, na ca bhagavantaṁ abhūtena abbhācikkheyya, dhammassa cānudhammaṁ byākareyya, na ca koci sahadhammiko vādānupāto gārayhaṁ ṭhānaṁ āgaccheyya.",
    "sn12.24:5": "Tatrāvuso, ye te samaṇabrāhmaṇā kammavādā sayaṅkataṁ dukkhaṁ paññapenti tadapi phassapaccayā. Yepi te samaṇabrāhmaṇā kammavādā paraṅkataṁ dukkhaṁ paññapenti tadapi phassapaccayā. Yepi te samaṇabrāhmaṇā kammavādā sayaṅkatañca paraṅkatañca dukkhaṁ paññapenti tadapi phassapaccayā. Yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ dukkhaṁ paññapenti tadapi phassapaccayā.",
    "sn12.24:6": "Tatrāvuso, ye te samaṇabrāhmaṇā kammavādā sayaṅkataṁ dukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjati. Yepi te samaṇabrāhmaṇā kammavādā paraṅkataṁ dukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjati. Yepi te samaṇabrāhmaṇā kammavādā sayaṅkatañca paraṅkatañca dukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjati. Yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ dukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjatī\"ti.",
    "sn12.24:7": "Assosi kho āyasmā ānando āyasmato sāriputtassa tehi aññatitthiyehi paribbājakehi saddhiṁ imaṁ kathāsallāpaṁ. Atha kho āyasmā ānando rājagahe piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando yāvatako āyasmato sāriputtassa tehi aññatitthiyehi paribbājakehi saddhiṁ ahosi kathāsallāpo taṁ sabbaṁ bhagavato ārocesi.",
    "sn12.24:8": "\"Sādhu sādhu, Ānanda, yathā taṁ sāriputto sammā byākaramāno byākareyya. Paṭiccasamuppannaṁ kho, Ānanda, dukkhaṁ vuttaṁ mayā. Kiṁ paṭicca? Phassaṁ paṭicca. Iti vadaṁ vuttavādī ceva me assa, na ca maṁ abhūtena abbhācikkheyya, dhammassa cānudhammaṁ byākareyya, na ca koci sahadhammiko vādānupāto gārayhaṁ ṭhānaṁ āgaccheyya.",
    "sn12.24:9": "TatrĀnanda, ye te samaṇabrāhmaṇā kammavādā sayaṅkataṁ dukkhaṁ paññapenti tadapi phassapaccayā. Yepi te … pe … yepi te … pe … yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ dukkhaṁ paññapenti tadapi phassapaccayā.",
    "sn12.24:10": "TatrĀnanda, yepi te samaṇabrāhmaṇā kammavādā sayaṅkataṁ dukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjati. Yepi te … pe … yepi te … pe … yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ dukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjati.",
    "sn12.24:11": "Ekamidāhaṁ, Ānanda, samayaṁ idheva rājagahe viharāmi veḷuvane kalandakanivāpe. Atha khvāhaṁ, Ānanda, pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya rājagahaṁ piṇḍāya pāvisiṁ. Tassa mayhaṁ, Ānanda, etadahosi: ‘atippago kho tāva rājagahe piṇḍāya carituṁ. Yannūnāhaṁ yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkameyyan’ti.",
    "sn12.24:12": "Atha khvāhaṁ, Ānanda, yena aññatitthiyānaṁ paribbājakānaṁ ārāmo tenupasaṅkamiṁ; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṁ sammodiṁ. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁ. Ekamantaṁ nisinnaṁ kho maṁ, Ānanda, te aññatitthiyā paribbājakā etadavocuṁ:",
    "sn12.24:13": "‘Santāvuso gotama, eke samaṇabrāhmaṇā kammavādā sayaṅkataṁ dukkhaṁ paññapenti. Santi panāvuso gotama, eke samaṇabrāhmaṇā kammavādā paraṅkataṁ dukkhaṁ paññapenti. Santāvuso gotama, eke samaṇabrāhmaṇā kammavādā sayaṅkatañca paraṅkatañca dukkhaṁ paññapenti. Santi panāvuso gotama, eke samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ dukkhaṁ paññapenti. Idha no āyasmā gotamo kiṁvādī kimakkhāyī? Kathaṁ byākaramānā ca mayaṁ vuttavādino ceva āyasmato gotamassa assāma, na ca āyasmantaṁ gotamaṁ abhūtena abbhācikkheyyāma, dhammassa cānudhammaṁ byākareyyāma, na ca koci sahadhammiko vādānupāto gārayhaṁ ṭhānaṁ āgaccheyyā’ti?",
    "sn12.24:14": "Evaṁ vuttāhaṁ, Ānanda, te aññatitthiye paribbājake etadavocaṁ: ‘paṭiccasamuppannaṁ kho, āvuso, dukkhaṁ vuttaṁ mayā. Kiṁ paṭicca? Phassaṁ paṭicca. Iti vadaṁ vuttavādī ceva me assa, na ca maṁ abhūtena abbhācikkheyya, dhammassa cānudhammaṁ byākareyya, na ca koci sahadhammiko vādānupāto gārayhaṁ ṭhānaṁ āgaccheyyāti.",
    "sn12.24:15": "Tatrāvuso, ye te samaṇabrāhmaṇā kammavādā sayaṅkataṁ dukkhaṁ paññapenti tadapi phassapaccayā. Yepi te … pe … yepi te … pe … yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ dukkhaṁ paññapenti tadapi phassapaccayā.",
    "sn12.24:16": "Tatrāvuso, ye te samaṇabrāhmaṇā kammavādā sayaṅkataṁ dukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjati. Yepi te … pe … yepi te … pe … yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ dukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjatī’\"ti.",
    "sn12.24:17": "\"Acchariyaṁ bhante, abbhutaṁ bhante. Yatra hi nāma ekena padena sabbo attho vutto bhavissati. Siyā nu kho, bhante, esevattho vitthārena vuccamāno gambhīro ceva assa gambhīrāvabhāso cā\"ti?",
    "sn12.24:18": "\"Tena hĀnanda, taññevettha paṭibhātū\"ti. \"Sace maṁ, bhante, evaṁ puccheyyuṁ: ‘jarāmaraṇaṁ, āvuso Ānanda, kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavan’ti? Evaṁ puṭṭhohaṁ, bhante, evaṁ byākareyyaṁ: ‘jarāmaraṇaṁ kho, āvuso, jātinidānaṁ jātisamudayaṁ jātijātikaṁ jātipabhavan’ti. Evaṁ puṭṭhohaṁ, bhante, evaṁ byākareyyaṁ.",
    "sn12.24:19": "Sace maṁ, bhante, evaṁ puccheyyuṁ: ‘jāti panāvuso Ānanda, kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā’ti? Evaṁ puṭṭhohaṁ, bhante, evaṁ byākareyyaṁ: ‘jāti kho, āvuso, bhavanidānā bhavasamudayā bhavajātikā bhavappabhavā’ti. Evaṁ puṭṭhohaṁ, bhante, evaṁ byākareyyaṁ.",
    "sn12.24:20": "Sace maṁ, bhante, evaṁ puccheyyuṁ: ‘bhavo panāvuso Ānanda, kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo’ti? Evaṁ puṭṭhohaṁ, bhante, evaṁ byākareyyaṁ: ‘bhavo kho, āvuso, upādānanidāno upādānasamudayo upādānajātiko upādānappabhavo’ti. Evaṁ puṭṭhohaṁ, bhante, evaṁ byākareyyaṁ.",
    "sn12.24:21": "Sace maṁ, bhante, evaṁ puccheyyuṁ – upādānaṁ panāvuso … pe … taṇhā panāvuso … pe … vedanā panāvuso … pe … sace maṁ, bhante, evaṁ puccheyyuṁ: ‘phasso panāvuso Ānanda, kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo’ti? Evaṁ puṭṭhohaṁ, bhante, evaṁ byākareyyaṁ: ‘phasso kho, āvuso, saḷāyatananidāno saḷāyatanasamudayo saḷāyatanajātiko saḷāyatanappabhavo’ti. ‘Channaṁ tveva, āvuso, phassāyatanānaṁ asesavirāganirodhā phassanirodho; phassanirodhā vedanānirodho; vedanānirodhā taṇhānirodho; taṇhānirodhā upādānanirodho; upādānanirodhā bhavanirodho; bhavanirodhā jātinirodho; jātinirodhā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā nirujjhanti. Evametassa kevalassa dukkhakkhandhassa nirodho hotī’ti. Evaṁ puṭṭhohaṁ, bhante, evaṁ byākareyyan\"ti."
}