{
    "sn12.36:1": "Sāvatthiyaṁ vihārati. \"Avijjāpaccayā, bhikkhave, saṅkhārā; saṅkhārapaccayā viññāṇaṁ … pe … evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "sn12.36:2": "‘Katamaṁ jarāmaraṇaṁ, kassa ca panidaṁ jarāmaraṇan’ti iti vā, bhikkhave, yo vadeyya, ‘aññaṁ jarāmaraṇaṁ, aññassa ca panidaṁ jarāmaraṇan’ti iti vā, bhikkhave, yo vadeyya, ubhayametaṁ ekatthaṁ byañjanameva nānaṁ. ‘Taṁ jīvaṁ taṁ sarīraṁ’ iti vā, bhikkhave, diṭṭhiyā sati brahmacariyavāso na hoti. ‘Aññaṁ jīvaṁ aññaṁ sarīraṁ’ iti vā, bhikkhave, diṭṭhiyā sati brahmacariyavāso na hoti. Ete te, bhikkhave, ubho ante anupāgamma majjhena tathāgato dhammaṁ deseti: ‘jātipaccayā jarāmaraṇan’ti.",
    "sn12.36:3": "Katamā jāti … pe … katamo bhavo … katamaṁ upādānaṁ … katamā taṇhā … katamā vedanā … katamo phasso … katamaṁ saḷāyatanaṁ … katamaṁ nāmarūpaṁ … katamaṁ viññāṇaṁ … katame saṅkhārā, kassa ca panime saṅkhārāti iti vā, bhikkhave, yo vadeyya, ‘aññe saṅkhārā aññassa ca panime saṅkhārā’ti iti vā, bhikkhave, yo vadeyya, ubhayametaṁ ekatthaṁ byañjanameva nānaṁ. ‘Taṁ jīvaṁ taṁ sarīraṁ’ iti vā, bhikkhave, diṭṭhiyā sati brahmacariyavāso na hoti. ‘Aññaṁ jīvaṁ aññaṁ sarīraṁ’ iti vā, bhikkhave, diṭṭhiyā sati brahmacariyavāso na hoti. Ete te, bhikkhave, ubho ante anupāgamma majjhena tathāgato dhammaṁ deseti: ‘avijjāpaccayā saṅkhārā’ti.",
    "sn12.36:4": "Avijjāya tveva, bhikkhave, asesavirāganirodhā yānissa tāni visūkāyikāni visevitāni vipphanditāni kānici kānici. ‘Katamaṁ jarāmaraṇaṁ, kassa ca panidaṁ jarāmaraṇaṁ’ iti vā, ‘aññaṁ jarāmaraṇaṁ, aññassa ca panidaṁ jarāmaraṇaṁ’ iti vā, ‘taṁ jīvaṁ taṁ sarīraṁ’ iti vā, ‘aññaṁ jīvaṁ, aññaṁ sarīraṁ’ iti vā. Sabbānissa tāni pahīnāni bhavanti ucchinnamūlāni tālāvatthukatāni anabhāvaṅkatāni āyatiṁ anup pāda dhammāni.",
    "sn12.36:5": "Avijjāya tveva, bhikkhave, asesavirāganirodhā yānissa tāni visūkāyikāni visevitāni vipphanditāni kānici kānici. Katamā jāti … pe … katamo bhavo … katamaṁ upādānaṁ … katamā taṇhā … katamā vedanā … katamo phasso … katamaṁ saḷāyatanaṁ … katamaṁ nāmarūpaṁ … katamaṁ viññāṇaṁ … ‘katame saṅkhārā, kassa ca panime saṅkhārā’ iti vā, ‘aññe saṅkhārā, aññassa ca panime saṅkhārā’ iti vā; ‘taṁ jīvaṁ taṁ sarīraṁ’ iti vā, ‘aññaṁ jīvaṁ aññaṁ sarīraṁ’ iti vā. Sabbānissa tāni pahīnāni bhavanti ucchinnamūlāni tālāvatthukatāni anabhāvaṅkatāni āyatiṁ anup pāda dhammānī\"ti."
}