{
    "sn12.50:1": "Sāvatthiyaṁ vihārati. \"Na, bhikkhave, sutavato ariyasāvakassa evaṁ hoti: ‘kiṁ nu kho kismiṁ sati kiṁ hoti, kissuppādā kiṁ uppajjati? Kismiṁ sati saṅkhārā honti, kismiṁ sati viññāṇaṁ hoti, kismiṁ sati nāmarūpaṁ hoti, kismiṁ sati saḷāyatanaṁ hoti, kismiṁ sati phasso hoti, kismiṁ sati vedanā hoti, kismiṁ sati taṇhā hoti, kismiṁ sati upādānaṁ hoti, kismiṁ sati bhavo hoti, kismiṁ sati jāti hoti, kismiṁ sati jarāmaraṇaṁ hotī’ti?",
    "sn12.50:2": "Atha kho, bhikkhave, sutavato ariyasāvakassa aparappaccayā ñāṇamevettha hoti: ‘imasmiṁ sati idaṁ hoti, imassuppādā idaṁ uppajjati. Avijjāya sati saṅkhārā honti; saṅkhāresu sati viññāṇaṁ hoti; viññāṇe sati nāmarūpaṁ hoti; nāmarūpe sati saḷāyatanaṁ hoti; saḷāyatane sati phasso hoti; phasse sati vedanā hoti; vedanāya sati taṇhā hoti; taṇhāya sati upādānaṁ hoti; upādāne sati bhavo hoti; bhave sati jāti hoti; jātiyā sati jarāmaraṇaṁ hotī’ti. So evaṁ pajānāti: ‘evamayaṁ loko samudayatī’ti.",
    "sn12.50:3": "Na, bhikkhave, sutavato ariyasāvakassa evaṁ hoti: ‘kiṁ nu kho kismiṁ asati kiṁ na hoti, kissa nirodhā kiṁ nirujjhati? Kismiṁ asati saṅkhārā na honti, kismiṁ asati viññāṇaṁ na hoti, kismiṁ asati nāmarūpaṁ na hoti, kismiṁ asati saḷāyatanaṁ na hoti, kismiṁ asati phasso na hoti, kismiṁ asati vedanā na hoti, kismiṁ asati taṇhā na hoti … pe … upādānaṁ … bhavo … jāti … kismiṁ asati jarāmaraṇaṁ na hotī’ti?",
    "sn12.50:4": "Atha kho, bhikkhave, sutavato ariyasāvakassa aparappaccayā ñāṇamevettha hoti: ‘imasmiṁ asati idaṁ na hoti, imassa nirodhā idaṁ nirujjhati. Avijjāya asati saṅkhārā na honti; saṅkhāresu asati viññāṇaṁ na hoti; viññāṇe asati nāmarūpaṁ na hoti; nāmarūpe asati saḷāyatanaṁ na hoti … pe … jātiyā asati jarāmaraṇaṁ na hotī’ti. So evaṁ pajānāti: ‘evamayaṁ loko nirujjhatī’ti.",
    "sn12.50:5": "Yato kho, bhikkhave, ariyasāvako evaṁ lokassa samudayañca atthaṅgamañca yathābhūtaṁ pajānāti, ayaṁ vuccati, bhikkhave, ariyasāvako diṭṭhisampanno itipi, dassanasampanno itipi, āgato imaṁ saddhammaṁ itipi, passati imaṁ saddhammaṁ itipi, sekkhena ñāṇena samannāgato itipi, sekkhāya vijjāya samannāgato itipi, dhammasotaṁ samāpanno itipi, ariyo nibbedhikapañño itipi, amatadvāraṁ āhacca tiṭṭhati itipī\"ti.",
    "sn12.50:6": "Dve pañcaverabhayā vuttā,dukkhaṁ loko ca ñātikaṁ;Aññataraṁ jāṇussoṇi ca,lokāyatikena aṭṭhamaṁ;Dve ariyasāvakā vuttā,vaggo tena pavuccatīti."
}