{
    "sn12.23:1": "Sāvatthiyaṁ vihārati. \"Jānato ahaṁ, bhikkhave, passato āsavānaṁ khayaṁ vadāmi, no ajānato no apassato. Kiñca, bhikkhave, jānato kiṁ passato āsavānaṁ khayo hoti? Iti rūpaṁ iti rūpassa samudayo iti rūpassa atthaṅgamo, iti vedanā … pe … iti saññā … iti saṅkhārā … iti viññāṇaṁ iti viññāṇassa samudayo iti viññāṇassa atthaṅgamoti. Evaṁ kho, bhikkhave, jānato evaṁ passato āsavānaṁ khayo hoti.",
    "sn12.23:2": "Yampissa taṁ, bhikkhave, khayasmiṁ khayeñāṇaṁ, tampi saupanisaṁ vadāmi, no anupanisaṁ. Kā ca, bhikkhave, khayeñāṇassa upanisā? ‘Vimuttī’tissa vacanīyaṁ.",
    "sn12.23:3": "Kā ca, bhikkhave, samādhissa upanisā? ‘Sukhan’tissa vacanīyaṁ.",
    "sn12.23:4": "Kā ca, bhikkhave, saddhāya upanisā? ‘Dukkhan’tissa vacanīyaṁ.",
    "sn12.23:5": "Kā ca, bhikkhave, taṇhāya upanisā? ‘Vedanā’tissa vacanīyaṁ … pe",
    "sn12.23:6": "Iti kho, bhikkhave, avijjūpanisā saṅkhārā, saṅkhārūpanisaṁ viññāṇaṁ, viññāṇūpanisaṁ nāmarūpaṁ, nāmarūpūpanisaṁ saḷāyatanaṁ, saḷāyatanūpaniso phasso, phassūpanisā vedanā, vedanūpanisā taṇhā, taṇhūpanisaṁ upādānaṁ, upādānūpaniso bhavo, bhavūpanisā jāti, jātūpanisaṁ dukkhaṁ, dukkhūpanisā saddhā, saddhūpanisaṁ pāmojjaṁ, pāmojjūpanisā pīti, pītūpanisā passaddhi, passaddhūpanisaṁ sukhaṁ, sukhūpaniso samādhi, samādhūpanisaṁ yathābhūtañāṇadassanaṁ, yathābhūtañāṇadassanūpanisā nibbidā, nibbidūpaniso virāgo, virāgūpanisā vimutti, vimuttūpanisaṁ khayeñāṇaṁ.",
    "sn12.23:7": "Seyyathāpi, bhikkhave, uparipabbate thullaphusitake deve vassante taṁ udakaṁ yathāninnaṁ pavattamānaṁ pabbatakandarapadarasākhā paripūreti. Pabbatakandarapadarasākhāparipūrā kusobbhe paripūrenti. Kusobbhā paripūrā mahāsobbhe paripūrenti. Mahāsobbhā paripūrā kunnadiyo paripūrenti. Kunnadiyo paripūrā mahānadiyo paripūrenti. Mahānadiyo paripūrā mahāsamuddaṁ paripūrenti.",
    "sn12.23:8": "Evameva kho, bhikkhave, avijjūpanisā saṅkhārā, saṅkhārūpanisaṁ viññāṇaṁ, viññāṇūpanisaṁ nāmarūpaṁ, nāmarūpūpanisaṁ saḷāyatanaṁ, saḷāyatanūpaniso phasso, phassūpanisā vedanā, vedanūpanisā taṇhā, taṇhūpanisaṁ upādānaṁ, upādānūpaniso bhavo, bhavūpanisā jāti, jātūpanisaṁ dukkhaṁ, dukkhūpanisā saddhā, saddhūpanisaṁ pāmojjaṁ, pāmojjūpanisā pīti, pītūpanisā passaddhi, passaddhūpanisaṁ sukhaṁ, sukhūpaniso samādhi, samādhūpanisaṁ yathābhūtañāṇadassanaṁ, yathābhūtañāṇadassanūpanisā nibbidā, nibbidūpaniso virāgo, virāgūpanisā vimutti, vimuttūpanisaṁ khayeñāṇan\"ti."
}