{
    "sn12.61:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā sāvatthiyaṁ vihārati jetavane anāthapiṇḍikassa ārāme …",
    "sn12.61:2": "Yañca kho etaṁ, bhikkhave, vuccati cittaṁ itipi, mano itipi, viññāṇaṁ itipi, tatrāssutavā puthujjano nālaṁ nibbindituṁ nālaṁ virajjituṁ nālaṁ vimuccituṁ. Taṁ kissa hetu? Dīgharattañhetaṁ, bhikkhave, assutavato puthujjanassa ajjhositaṁ mamāyitaṁ parāmaṭṭhaṁ: ‘etaṁ mama, esohamasmi, eso me attā’ti. Tasmā tatrāssutavā puthujjano nālaṁ nibbindituṁ nālaṁ virajjituṁ nālaṁ vimuccituṁ.",
    "sn12.61:3": "Varaṁ, bhikkhave, assutavā puthujjano imaṁ cātumahābhūtikaṁ kāyaṁ attato upagaccheyya, na tveva cittaṁ. Taṁ kissa hetu? Dissatāyaṁ, bhikkhave, cātumahābhūtiko kāyo ekampi vassaṁ tiṭṭhamāno dvepi vassāni tiṭṭhamāno tīṇipi vassāni tiṭṭhamāno cattāripi vassāni tiṭṭhamāno pañcapi vassāni tiṭṭhamāno dasapi vassāni tiṭṭhamāno vīsatipi vassāni tiṭṭhamāno tiṁsampi vassāni tiṭṭhamāno cattārīsampi vassāni tiṭṭhamāno paññāsampi vassāni tiṭṭhamāno vassasatampi tiṭṭhamāno, bhiyyopi tiṭṭhamāno.",
    "sn12.61:4": "Yañca kho etaṁ, bhikkhave, vuccati cittaṁ itipi, mano itipi, viññāṇaṁ itipi, taṁ rattiyā ca divasassa ca aññadeva uppajjati aññaṁ nirujjhati. Seyyathāpi, bhikkhave, makkaṭo araññe pavane caramāno sākhaṁ gaṇhati, taṁ muñcitvā aññaṁ gaṇhati, taṁ muñcitvā aññaṁ gaṇhati; evameva kho, bhikkhave, yamidaṁ vuccati cittaṁ itipi, mano itipi, viññāṇaṁ itipi, taṁ rattiyā ca divasassa ca aññadeva uppajjati aññaṁ nirujjhati.",
    "sn12.61:5": "Tatra, bhikkhave, sutavā ariyasāvako paṭiccasamup pāda ṁyeva sādhukaṁ yoniso manasi karoti: ‘iti imasmiṁ sati idaṁ hoti, imassuppādā idaṁ uppajjati; imasmiṁ asati idaṁ na hoti, imassa nirodhā idaṁ nirujjhati – yadidaṁ avijjāpaccayā saṅkhārā; saṅkhārapaccayā viññāṇaṁ … pe … evametassa kevalassa dukkhakkhandhassa samudayo hoti. Avijjāya tveva asesavirāganirodhā saṅkhāranirodho; saṅkhāranirodhā viññāṇanirodho … pe … evametassa kevalassa dukkhakkhandhassa nirodho hotī’ti.",
    "sn12.61:6": "Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako rūpasmimpi nibbindati, vedanāyapi nibbindati, saññāyapi nibbindati, saṅkhāresupi nibbindati, viññāṇasmimpi nibbindati; nibbindaṁ virajjati, virāgā vimuccati, vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānātī\"ti."
}