{
    "sn12.25:1": "Sāvatthiyaṁ vihārati. Atha kho āyasmā bhūmijo sāyanhasamayaṁ paṭisallānā vuṭṭhito yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā bhūmijo āyasmantaṁ sāriputtaṁ etadavoca:",
    "sn12.25:2": "\"Santāvuso sāriputta, eke samaṇabrāhmaṇā kammavādā sayaṅkataṁ sukhadukkhaṁ paññapenti. Santi panāvuso sāriputta, eke samaṇabrāhmaṇā kammavādā paraṅkataṁ sukhadukkhaṁ paññapenti. Santāvuso sāriputta, eke samaṇabrāhmaṇā kammavādā sayaṅkatañca paraṅkatañca sukhadukkhaṁ paññapenti. Santi panāvuso sāriputta, eke samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ sukhadukkhaṁ paññapenti. Idha no, āvuso sāriputta, bhagavā kiṁvādī kimakkhāyī, kathaṁ byākaramānā ca mayaṁ vuttavādino ceva bhagavato assāma, na ca bhagavantaṁ abhūtena abbhācikkheyyāma, dhammassa cānudhammaṁ byākareyyāma, na ca koci sahadhammiko vādānupāto gārayhaṁ ṭhānaṁ āgaccheyyā\"ti?",
    "sn12.25:3": "\"Paṭiccasamuppannaṁ kho, āvuso, sukhadukkhaṁ vuttaṁ bhagavatā. Kiṁ paṭicca? Phassaṁ paṭicca. Iti vadaṁ vuttavādī ceva bhagavato assa, na ca bhagavantaṁ abhūtena abbhācikkheyya, dhammassa cānudhammaṁ byākareyya, na ca koci sahadhammiko vādānupāto gārayhaṁ ṭhānaṁ āgaccheyya.",
    "sn12.25:4": "Tatrāvuso, ye te samaṇabrāhmaṇā kammavādā sayaṅkataṁ sukhadukkhaṁ paññapenti, tadapi phassapaccayā. Yepi te … pe … yepi te … pe … yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ sukhadukkhaṁ paññapenti, tadapi phassapaccayā.",
    "sn12.25:5": "Tatrāvuso, ye te samaṇabrāhmaṇā kammavādā sayaṅkataṁ sukhadukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjati. Yepi te … pe … yepi te … pe … yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ sukhadukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjatī\"ti.",
    "sn12.25:6": "Assosi kho āyasmā ānando āyasmato sāriputtassa āyasmatā bhūmijena saddhiṁ imaṁ kathāsallāpaṁ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando yāvatako āyasmato sāriputtassa āyasmatā bhūmijena saddhiṁ ahosi kathāsallāpo taṁ sabbaṁ bhagavato ārocesi.",
    "sn12.25:7": "\"Sādhu sādhu, Ānanda, yathā taṁ sāriputto sammā byākaramāno byākareyya. Paṭiccasamuppannaṁ kho, Ānanda, sukhadukkhaṁ vuttaṁ mayā. Kiṁ paṭicca? Phassaṁ paṭicca. Iti vadaṁ vuttavādī ceva me assa, na ca maṁ abhūtena abbhācikkheyya, dhammassa cānudhammaṁ byākareyya, na ca koci sahadhammiko vādānupāto gārayhaṁ ṭhānaṁ āgaccheyya.",
    "sn12.25:8": "TatrĀnanda, ye te samaṇabrāhmaṇā kammavādā sayaṅkataṁ sukhadukkhaṁ paññapenti tadapi phassapaccayā. Yepi te … pe … yepi te … pe … yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ sukhadukkhaṁ paññapenti tadapi phassapaccayā.",
    "sn12.25:9": "TatrĀnanda, ye te samaṇabrāhmaṇā kammavādā sayaṅkataṁ sukhadukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjati. Yepi te … pe … yepi te … pe … yepi te samaṇabrāhmaṇā kammavādā asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ sukhadukkhaṁ paññapenti, te vata aññatra phassā paṭisaṁvedissantīti netaṁ ṭhānaṁ vijjati.",
    "sn12.25:10": "Kāye vā hĀnanda, sati kāyasañcetanāhetu uppajjati ajjhattaṁ sukhadukkhaṁ. Vācāya vā hĀnanda, sati vacīsañcetanāhetu uppajjati ajjhattaṁ sukhadukkhaṁ. Mane vā hĀnanda, sati manosañcetanāhetu uppajjati ajjhattaṁ sukhadukkhaṁ avijjāpaccayā ca.",
    "sn12.25:11": "Sāmaṁ vā taṁ, Ānanda, kāyasaṅkhāraṁ abhisaṅkharoti, yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. Pare vā taṁ, Ānanda, kāyasaṅkhāraṁ abhisaṅkharonti, yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. Sampajāno vā taṁ, Ānanda, kāyasaṅkhāraṁ abhisaṅkharoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. Asampajāno vā taṁ, Ānanda, kāyasaṅkhāraṁ abhisaṅkharoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ.",
    "sn12.25:12": "Sāmaṁ vā taṁ, Ānanda, vacīsaṅkhāraṁ abhisaṅkharoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. Pare vā taṁ, Ānanda, vacīsaṅkhāraṁ abhisaṅkharonti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. Sampajāno vā taṁ, Ānanda … pe … asampajāno vā taṁ, Ānanda, vacīsaṅkhāraṁ abhisaṅkharoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ.",
    "sn12.25:13": "Sāmaṁ vā taṁ, Ānanda, manosaṅkhāraṁ abhisaṅkharoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. Pare vā taṁ, Ānanda, manosaṅkhāraṁ abhisaṅkharonti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. Sampajāno vā taṁ, Ānanda … pe … asampajāno vā taṁ, Ānanda, manosaṅkhāraṁ abhisaṅkharoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ.",
    "sn12.25:14": "Imesu, Ānanda, dhammesu avijjā anupatitā. Avijjāya tveva, Ānanda, asesavirāganirodhā so kāyo na hoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. Sā vācā na hoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. So mano na hoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhaṁ. Khettaṁ taṁ na hoti … pe … vatthu taṁ na hoti … pe … āyatanaṁ taṁ na hoti … pe … adhikaraṇaṁ taṁ na hoti yaṁpaccayāssa taṁ uppajjati ajjhattaṁ sukhadukkhan\"ti."
}