{
    "sn12.51:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā sāvatthiyaṁ vihārati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti.",
    "sn12.51:2": "\"Kittāvatā nu kho, bhikkhave, bhikkhu parivīmaṁsamāno parivīmaṁseyya sabbaso sammā dukkhakkhayāyā\"ti?",
    "sn12.51:3": "\"Idha, bhikkhave, bhikkhu parivīmaṁsamāno parivīmaṁsati: ‘Yaṁ kho idaṁ anekavidhaṁ nānappakārakaṁ dukkhaṁ loke uppajjati jarāmaraṇaṁ; idaṁ nu kho dukkhaṁ kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ? Kismiṁ sati jarāmaraṇaṁ hoti, kismiṁ asati jarāmaraṇaṁ na hotī’ti? So parivīmaṁsamāno evaṁ pajānāti: ‘Yaṁ kho idaṁ anekavidhaṁ nānappakārakaṁ dukkhaṁ loke uppajjati jarāmaraṇaṁ, idaṁ kho dukkhaṁ jātinidānaṁ jātisamudayaṁ jātijātikaṁ jātippabhavaṁ. Jātiyā sati jarāmaraṇaṁ hoti, jātiyā asati jarāmaraṇaṁ na hotī’ti.",
    "sn12.51:4": "So jarāmaraṇañca pajānāti, jarāmaraṇasamudayañca pajānāti, jarāmaraṇanirodhañca pajānāti, yā ca jarāmaraṇanirodhasāruppagāminī paṭipadā tañca pajānāti, tathā paṭipanno ca hoti anudhammacārī; ayaṁ vuccati, bhikkhave, bhikkhu sabbaso sammā dukkhakkhayāya paṭipanno jarāmaraṇanirodhāya.",
    "sn12.51:5": "Athāparaṁ parivīmaṁsamāno parivīmaṁsati: ‘jāti panāyaṁ kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā, kismiṁ sati jāti hoti, kismiṁ asati jāti na hotī’ti? So parivīmaṁsamāno evaṁ pajānāti: ‘jāti bhavanidānā bhavasamudayā bhavajātikā bhavappabhavā; bhave sati jāti hoti, bhave asati jāti na hotī’ti.",
    "sn12.51:6": "So jātiñca pajānāti, jātisamudayañca pajānāti, jātinirodhañca pajānāti, yā ca jātinirodhasāruppagāminī paṭipadā tañca pajānāti, tathā paṭipanno ca hoti anudhammacārī; ayaṁ vuccati, bhikkhave, bhikkhu sabbaso sammā dukkhakkhayāya paṭipanno jātinirodhāya.",
    "sn12.51:7": "Athāparaṁ parivīmaṁsamāno parivīmaṁsati: ‘bhavo panāyaṁ kiṁnidāno … pe … upādānaṁ panidaṁ kiṁnidānaṁ … taṇhā panāyaṁ kiṁnidānā … vedanā … phasso … saḷāyatanaṁ panidaṁ kiṁnidānaṁ … nāmarūpaṁ panidaṁ … viññāṇaṁ panidaṁ … saṅkhārā panime kiṁnidānā kiṁsamudayā kiṁjātikā kiṁpabhavā; kismiṁ sati saṅkhārā honti, kismiṁ asati saṅkhārā na hontī’ti? So parivīmaṁsamāno evaṁ pajānāti: ‘saṅkhārā avijjānidānā avijjāsamudayā avijjājātikā avijjāpabhavā; avijjāya sati saṅkhārā honti, avijjāya asati saṅkhārā na hontī’ti.",
    "sn12.51:8": "So saṅkhāre ca pajānāti, saṅkhārasamudayañca pajānāti, saṅkhāranirodhañca pajānāti, yā ca saṅkhāranirodhasāruppagāminī paṭipadā tañca pajānāti, tathā paṭipanno ca hoti anudhammacārī; ayaṁ vuccati, bhikkhave, bhikkhu sabbaso sammā dukkhakkhayāya paṭipanno saṅkhāranirodhāya.",
    "sn12.51:9": "Avijjāgato yaṁ, bhikkhave, purisapuggalo puññañce saṅkhāraṁ abhisaṅkharoti, puññūpagaṁ hoti viññāṇaṁ. Apuññañce saṅkhāraṁ abhisaṅkharoti, apuññūpagaṁ hoti viññāṇaṁ. Āneñjañce saṅkhāraṁ abhisaṅkharoti āneñjūpagaṁ hoti viññāṇaṁ. Yato kho, bhikkhave, bhikkhuno avijjā pahīnā hoti vijjā uppannā, so avijjāvirāgā vijjuppādā neva puññābhisaṅkhāraṁ abhisaṅkharoti na apuññābhisaṅkhāraṁ abhisaṅkharoti na āneñjābhisaṅkhāraṁ abhisaṅkharoti. Anabhisaṅkharonto anabhisañcetayanto na kiñci loke upādiyati; anupādiyaṁ na paritassati, aparitassaṁ paccattaññeva parinibbāyati. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti.",
    "sn12.51:10": "So sukhañce vedanāṁ vedayati, sā aniccāti pajānāti, anajjhositāti pajānāti, anabhinanditāti pajānāti. Dukkhañce vedanāṁ vedayati, sā aniccāti pajānāti, anajjhositāti pajānāti, anabhinanditāti pajānāti. Adukkhamasukhañce vedanāṁ vedayati, sā aniccāti pajānāti, anajjhositāti pajānāti, anabhinanditāti pajānāti.",
    "sn12.51:11": "So kāyapariyantikaṁ vedanāṁ vedayamāno kāyapariyantikaṁ vedanāṁ vedayāmīti pajānāti, jīvitapariyantikaṁ vedanāṁ vedayamāno jīvitapariyantikaṁ vedanāṁ vedayāmīti pajānāti. Kāyassa bhedā uddhaṁ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissanti, sarīrāni avasissantīti pajānāti.",
    "sn12.51:12": "Seyyathāpi, bhikkhave, puriso kumbhakārapākā uṇhaṁ kumbhaṁ uddharitvā same bhūmibhāge paṭisisseyya. Tatra yāyaṁ usmā sā tattheva vūpasameyya, kapallāni avasisseyyuṁ. Evameva kho, bhikkhave, bhikkhu kāyapariyantikaṁ vedanāṁ vedayamāno kāyapariyantikaṁ vedanāṁ vedayāmīti pajānāti, jīvitapariyantikaṁ vedanāṁ vedayamāno jīvitapariyantikaṁ vedanāṁ vedayāmīti pajānāti. Kāyassa bhedā uddhaṁ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissanti, sarīrāni avasissantīti pajānāti.",
    "sn12.51:13": "Taṁ kiṁ maññatha, bhikkhave, api nu kho khīṇāsavo bhikkhu puññābhisaṅkhāraṁ vā abhisaṅkhareyya apuññābhisaṅkhāraṁ vā abhisaṅkhareyya āneñjābhisaṅkhāraṁ vā abhisaṅkhareyyā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:14": "\"Sabbaso vā pana saṅkhāresu asati, saṅkhāranirodhā api nu kho viññāṇaṁ paññāyethā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:15": "\"Sabbaso vā pana viññāṇe asati, viññāṇanirodhā api nu kho nāmarūpaṁ paññāyethā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:16": "\"Sabbaso vā pana nāmarūpe asati, nāmarūpanirodhā api nu kho saḷāyatanaṁ paññāyethā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:17": "\"Sabbaso vā pana saḷāyatane asati, saḷāyatananirodhā api nu kho phasso paññāyethā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:18": "\"Sabbaso vā pana phasse asati, phassanirodhā api nu kho vedanā paññāyethā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:19": "\"Sabbaso vā pana vedanāya asati, vedanānirodhā api nu kho taṇhā paññāyethā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:20": "\"Sabbaso vā pana taṇhāya asati, taṇhānirodhā api nu kho upādānaṁ paññāyethā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:21": "\"Sabbaso vā pana upādāne asati, upādānanirodhā api nu kho bhavo paññāyethā\"ti. \"No hetaṁ, bhante\".",
    "sn12.51:22": "\"Sabbaso vā pana bhave asati, bhavanirodhā api nu kho jāti paññāyethā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:23": "\"Sabbaso vā pana jātiyā asati, jātinirodhā api nu kho jarāmaraṇaṁ paññāyethā\"ti? \"No hetaṁ, bhante\".",
    "sn12.51:24": "\"Sādhu sādhu, bhikkhave, evametaṁ, bhikkhave, netaṁ aññathā. Saddahatha me taṁ, bhikkhave, adhimuccatha, nikkaṅkhā ettha hotha nibbicikicchā. Esevanto dukkhassā\"ti."
}