{
    "sn12.28:1": "Sāvatthiyaṁ vihārati. \"Tatra kho … pe … idha, bhikkhave, bhikkhu jarāmaraṇaṁ pajānāti, jarāmaraṇasamudayaṁ pajānāti, jarāmaraṇanirodhaṁ pajānāti, jarāmaraṇanirodhagāminiṁ paṭipadāṁ pajānāti, jātiṁ pajānāti … pe … bhavaṁ pajānāti … upādānaṁ pajānāti … taṇhāṁ pajānāti … vedanāṁ pajānāti … phassaṁ pajānāti … saḷāyatanaṁ pajānāti … nāmarūpaṁ pajānāti … viññāṇaṁ pajānāti … saṅkhāre pajānāti, saṅkhārasamudayaṁ pajānāti, saṅkhāranirodhaṁ pajānāti, saṅkhāranirodhagāminiṁ paṭipadāṁ pajānāti.",
    "sn12.28:2": "Katamañca, bhikkhave, jarāmaraṇaṁ? Yā tesaṁ tesaṁ sattānaṁ tamhi tamhi sattanikāye jarā jīraṇatā khaṇḍiccaṁ pāliccaṁ valittacatā āyuno saṁhāni indriyānaṁ paripāko – ayaṁ vuccati jarā. Yā tesaṁ tesaṁ sattānaṁ tamhā tamhā sattanikāyā cuti cavanatā bhedo antaradhānaṁ maccu maraṇaṁ kālakiriyā khandhānaṁ bhedo kaḷevarassa nikkhepo; idaṁ vuccati maraṇaṁ. Iti ayañca jarā idañca maraṇaṁ. Idaṁ vuccati, bhikkhave, jarāmaraṇaṁ. Jātisamudayā jarāmaraṇasamudayo; jātinirodhā jarāmaraṇanirodho. Ayameva ariyo aṭṭhaṅgiko maggo jarāmaraṇanirodhagāminī paṭipadā. Seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn12.28:3": "Katamā ca, bhikkhave, jāti … pe … katamo ca, bhikkhave, bhavo … katamañca, bhikkhave, upādānaṁ … katamā ca, bhikkhave, taṇhā … vedanā … phasso … saḷāyatanaṁ … nāmarūpaṁ … viññāṇaṁ … .",
    "sn12.28:4": "Katame ca, bhikkhave, saṅkhārā? Tayome, bhikkhave, saṅkhārā – kāyasaṅkhāro, vacīsaṅkhāro, cittasaṅkhāro. Ime vuccanti, bhikkhave, saṅkhārā. Avijjāsamudayā saṅkhārasamudayo; avijjānirodhā saṅkhāranirodho. Ayameva ariyo aṭṭhaṅgiko maggo saṅkhāranirodhagāminī paṭipadā. Seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn12.28:5": "Yato kho, bhikkhave, bhikkhu evaṁ jarāmaraṇaṁ pajānāti, evaṁ jarāmaraṇasamudayaṁ pajānāti, evaṁ jarāmaraṇanirodhaṁ pajānāti, evaṁ jarāmaraṇanirodhagāminiṁ paṭipadāṁ pajānāti, evaṁ jātiṁ pajānāti … pe … bhavaṁ … upādānaṁ … taṇhāṁ … vedanāṁ … phassaṁ … saḷāyatanaṁ … nāmarūpaṁ … viññāṇaṁ … saṅkhāre … saṅkhārasamudayaṁ … saṅkhāranirodhaṁ … evaṁ saṅkhāranirodhagāminiṁ paṭipadāṁ pajānāti. Ayaṁ vuccati, bhikkhave, bhikkhu diṭṭhisampanno itipi, dassanasampanno itipi, āgato imaṁ saddhammaṁ itipi, passati imaṁ saddhammaṁ itipi, sekkhena ñāṇena samannāgato itipi, sekkhāya vijjāya samannāgato itipi, dhammasotaṁ samāpanno itipi, ariyo nibbedhikapañño itipi, amatadvāraṁ āhacca tiṭṭhati itipī\"ti."
}