{
    "sn12.64:1": "Sāvatthiyaṁ vihārati. \"Cattārome, bhikkhave, āhārā bhūtānaṁ vā sattānaṁ ṭhitiyā sambhavesīnaṁ vā anuggahāya. Katame cattāro? Kabaḷīkāro āhāro oḷāriko vā sukhumo vā, phasso dutiyo, manosañcetanā tatiyā, viññāṇaṁ catutthaṁ. Ime kho, bhikkhave, cattāro āhārā bhūtānaṁ vā sattānaṁ ṭhitiyā sambhavesīnaṁ vā anuggahāya.",
    "sn12.64:2": "Kabaḷīkāre ce, bhikkhave, āhāre atthi rāgo atthi nandī atthi taṇhā, patiṭṭhitaṁ tattha viññāṇaṁ virūḷhaṁ. Yattha patiṭṭhitaṁ viññāṇaṁ virūḷhaṁ, atthi tattha nāmarūpassa avakkanti. Yattha atthi nāmarūpassa avakkanti, atthi tattha saṅkhārānaṁ vuddhi. Yattha atthi saṅkhārānaṁ vuddhi, atthi tattha āyatiṁ punabbhavābhinibbatti. Yattha atthi āyatiṁ punabbhavābhinibbatti, atthi tattha āyatiṁ jātijarāmaraṇaṁ. Yattha atthi āyatiṁ jātijarāmaraṇaṁ, sasokaṁ taṁ, bhikkhave, sadaraṁ saupāyāsanti vadāmi.",
    "sn12.64:3": "Phasse ce, bhikkhave, āhāre … pe … manosañcetanāya ce, bhikkhave, āhāre … viññāṇe ce, bhikkhave, āhāre atthi rāgo atthi nandī atthi taṇhā, patiṭṭhitaṁ tattha viññāṇaṁ virūḷhaṁ. Yattha patiṭṭhitaṁ viññāṇaṁ virūḷhaṁ, atthi tattha nāmarūpassa avakkanti. Yattha atthi nāmarūpassa avakkanti, atthi tattha saṅkhārānaṁ vuddhi. Yattha atthi saṅkhārānaṁ vuddhi, atthi tattha āyatiṁ punabbhavābhinibbatti. Yattha atthi āyatiṁ punabbhavābhinibbatti, atthi tattha āyatiṁ jātijarāmaraṇaṁ. Yattha atthi āyatiṁ jātijarāmaraṇaṁ, sasokaṁ taṁ, bhikkhave, sadaraṁ saupāyāsanti vadāmi.",
    "sn12.64:4": "Seyyathāpi, bhikkhave, rajako vā cittakārako vā sati rajanāya vā lākhāya vā haliddiyā vā nīliyā vā mañjiṭṭhāya vā suparimaṭṭhe vā phalake bhittiyā vā dussapaṭṭe vā itthirūpaṁ vā purisarūpaṁ vā abhinimmineyya sabbaṅgapaccaṅgaṁ; evameva kho, bhikkhave, kabaḷīkāre ce āhāre atthi rāgo atthi nandī atthi taṇhā, patiṭṭhitaṁ tattha viññāṇaṁ virūḷhaṁ. Yattha patiṭṭhitaṁ viññāṇaṁ virūḷhaṁ, atthi tattha nāmarūpassa avakkanti. Yattha atthi nāmarūpassa avakkanti, atthi tattha saṅkhārānaṁ vuddhi. Yattha atthi saṅkhārānaṁ vuddhi, atthi tattha āyatiṁ punabbhavābhinibbatti. Yattha atthi āyatiṁ punabbhavābhinibbatti, atthi tattha āyatiṁ jātijarāmaraṇaṁ. Yattha atthi āyatiṁ jātijarāmaraṇaṁ, sasokaṁ taṁ, bhikkhave, sadaraṁ saupāyāsanti vadāmi.",
    "sn12.64:5": "Phasse ce, bhikkhave, āhāre … pe … manosañcetanāya ce, bhikkhave, āhāre … viññāṇe ce, bhikkhave, āhāre atthi rāgo atthi nandī atthi taṇhā, patiṭṭhitaṁ tattha viññāṇaṁ virūḷhaṁ. Yattha patiṭṭhitaṁ viññāṇaṁ virūḷhaṁ, atthi tattha nāmarūpassa avakkanti. Yattha atthi nāmarūpassa avakkanti, atthi tattha saṅkhārānaṁ vuddhi. Yattha atthi saṅkhārānaṁ vuddhi, atthi tattha āyatiṁ punabbhavābhinibbatti. Yattha atthi āyatiṁ punabbhavābhinibbatti, atthi tattha āyatiṁ jātijarāmaraṇaṁ. Yattha atthi āyatiṁ jātijarāmaraṇaṁ, sasokaṁ taṁ, bhikkhave, sadaraṁ saupāyāsanti vadāmi.",
    "sn12.64:6": "Kabaḷīkāre ce, bhikkhave, āhāre natthi rāgo natthi nandī natthi taṇhā, appatiṭṭhitaṁ tattha viññāṇaṁ avirūḷhaṁ. Yattha appatiṭṭhitaṁ viññāṇaṁ avirūḷhaṁ, natthi tattha nāmarūpassa avakkanti. Yattha natthi nāmarūpassa avakkanti, natthi tattha saṅkhārānaṁ vuddhi. Yattha natthi saṅkhārānaṁ vuddhi, natthi tattha āyatiṁ punabbhavābhinibbatti. Yattha natthi āyatiṁ punabbhavābhinibbatti, natthi tattha āyatiṁ jātijarāmaraṇaṁ. Yattha natthi āyatiṁ jātijarāmaraṇaṁ, asokaṁ taṁ, bhikkhave, adaraṁ anupāyāsanti vadāmi.",
    "sn12.64:7": "Phasse ce, bhikkhave, āhāre … pe … manosañcetanāya ce, bhikkhave, āhāre … viññāṇe ce, bhikkhave, āhāre natthi rāgo natthi nandī natthi taṇhā, appatiṭṭhitaṁ tattha viññāṇaṁ avirūḷhaṁ. Yattha appatiṭṭhitaṁ viññāṇaṁ avirūḷhaṁ, natthi tattha nāmarūpassa avakkanti. Yattha natthi nāmarūpassa avakkanti, natthi tattha saṅkhārānaṁ vuddhi. Yattha natthi saṅkhārānaṁ vuddhi, natthi tattha āyatiṁ punabbhavābhinibbatti. Yattha natthi āyatiṁ punabbhavābhinibbatti, natthi tattha āyatiṁ jātijarāmaraṇaṁ. Yattha natthi āyatiṁ jātijarāmaraṇaṁ, asokaṁ taṁ, bhikkhave, adaraṁ anupāyāsanti vadāmi.",
    "sn12.64:8": "Seyyathāpi, bhikkhave, kūṭāgāraṁ vā kūṭāgārasālaṁ vā uttarāya vā dakkhiṇāya vā pācīnāya vā vātapānā sūriye uggacchante vātapānena rasmi pavisitvā kvāssa patiṭṭhitā\"ti? \"Pacchimāyaṁ, bhante, bhittiyan\"ti.",
    "sn12.64:9": "Phasse ce, bhikkhave, āhāre … manosañcetanāya ce, bhikkhave, āhāre … viññāṇe ce, bhikkhave, āhāre natthi rāgo natthi nandī natthi taṇhā, appatiṭṭhitaṁ tattha viññāṇaṁ avirūḷhaṁ. Yattha appatiṭṭhitaṁ viññāṇaṁ avirūḷhaṁ, natthi tattha nāmarūpassa avakkanti. Yattha natthi nāmarūpassa avakkanti, natthi tattha saṅkhārānaṁ vuddhi. Yattha natthi saṅkhārānaṁ vuddhi, natthi tattha āyatiṁ punabbhavābhinibbatti. Yattha natthi āyatiṁ punabbhavābhinibbatti, natthi tattha āyatiṁ jātijarāmaraṇaṁ. Yattha natthi āyatiṁ jātijarāmaraṇaṁ asokaṁ taṁ, bhikkhave, adaraṁ anupāyāsanti vadāmī\"ti."
}