{
    "sn12.20:1": "Sāvatthiyaṁ vihārati. \"Paṭiccasamup pāda ñca vo, bhikkhave, desessāmi paṭiccasamuppanne ca dhamme. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "sn12.20:2": "\"Katamo ca, bhikkhave, paṭiccasamuppādo? Jātipaccayā, bhikkhave, jarāmaraṇaṁ. Uppādā vā tathāgatānaṁ anuppādā vā tathāgatānaṁ, ṭhitāva sā dhātu dhammaṭṭhitatā dhammaniyāmatā idappaccayatā. Taṁ tathāgato abhisambujjhati abhisameti. Abhisambujjhitvā abhisametvā ācikkhati deseti paññāpeti paṭṭhapeti vivarati vibhajati uttānīkaroti. ‘Passathā’ti cāha: ‘jātipaccayā, bhikkhave, jarāmaraṇaṁ’.",
    "sn12.20:3": "Bhavapaccayā, bhikkhave, jāti … pe … upādānapaccayā, bhikkhave, bhavo … taṇhāpaccayā, bhikkhave, upādānaṁ … vedanāpaccayā, bhikkhave, taṇhā … phassapaccayā, bhikkhave, vedanā … saḷāyatanapaccayā, bhikkhave, phasso … nāmarūpapaccayā, bhikkhave, saḷāyatanaṁ … viññāṇapaccayā, bhikkhave, nāmarūpaṁ … saṅkhārapaccayā, bhikkhave, viññāṇaṁ … avijjāpaccayā, bhikkhave, saṅkhārā uppādā vā tathāgatānaṁ anuppādā vā Tathāgatanaṁ, ṭhitāva sā dhātu dhammaṭṭhitatā dhammaniyāmatā idappaccayatā. Taṁ tathāgato abhisambujjhati abhisameti. Abhisambujjhitvā abhisametvā ācikkhati deseti paññāpeti paṭṭhapeti vivarati vibhajati uttānīkaroti. ‘Passathā’ti cāha: ‘avijjāpaccayā, bhikkhave, saṅkhārā’.",
    "sn12.20:4": "Katame ca, bhikkhave, paṭiccasamuppannā dhammā? Jarāmaraṇaṁ, bhikkhave, aniccaṁ saṅkhataṁ paṭiccasamuppannaṁ khayadhammaṁ vayadhammaṁ virāgadhammaṁ nirodhadhammaṁ. Jāti, bhikkhave, aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā. Bhavo, bhikkhave, anicco saṅkhato paṭiccasamuppanno khayadhammo vayadhammo virāgadhammo nirodhadhammo. Upādānaṁ bhikkhave … pe … taṇhā, bhikkhave … vedanā, bhikkhave … phasso, bhikkhave … saḷāyatanaṁ, bhikkhave … nāmarūpaṁ, bhikkhave … viññāṇaṁ, bhikkhave … saṅkhārā, bhikkhave … avijjā, bhikkhave, aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā. Ime vuccanti, bhikkhave, paṭiccasamuppannā dhammā.",
    "sn12.20:5": "Yato kho, bhikkhave, ariyasāvakassa ‘ayañca paṭiccasamuppādo, ime ca paṭiccasamuppannā dhammā’ yathābhūtaṁ sammappaññāya sudiṭṭhā honti, so vata pubbantaṁ vā paṭidhāvissati: ‘ahosiṁ nu kho ahaṁ atītamaddhānaṁ, nanu kho ahosiṁ atītamaddhānaṁ, kiṁ nu kho ahosiṁ atītamaddhānaṁ, kathaṁ nu kho ahosiṁ atītamaddhānaṁ, kiṁ hutvā kiṁ ahosiṁ nu kho ahaṁ atītamaddhānan’ti; aparantaṁ vā upadhāvissati: ‘bhavissāmi nu kho ahaṁ anāgatamaddhānaṁ, nanu kho bhavissāmi anāgatamaddhānaṁ, kiṁ nu kho bhavissāmi anāgatamaddhānaṁ, kathaṁ nu kho bhavissāmi anāgatamaddhānaṁ, kiṁ hutvā kiṁ bhavissāmi nu kho ahaṁ anāgatamaddhānan’ti; etarahi vā paccuppannaṁ addhānaṁ ajjhattaṁ kathaṅkathī bhavissati: ‘Ahaṁ nu khosmi, no nu khosmi, kiṁ nu khosmi, kathaṁ nu khosmi, ayaṁ nu kho satto kuto āgato, so kuhiṁ gamissatī’ti – netaṁ ṭhānaṁ vijjati.",
    "sn12.20:6": "Āhāraṁ phagguno ceva,Dve ca samaṇabrāhmaṇā;Kaccānagotta dhammakathikaṁ,Acelaṁ timbarukena ca;Bālapaṇḍitato ceva,Dasamo paccayena cāti."
}