{
    "sn12.22:1": "Sāvatthiyaṁ vihārati. \"Dasabalasamannāgato, bhikkhave, tathāgato catūhi ca vesārajjehi samannāgato āsabhaṁ ṭhānaṁ paṭijānāti, parisāsu sīhanādaṁ nadati, brahmacakkaṁ pavatteti: ‘iti rūpaṁ iti rūpassa samudayo iti rūpassa atthaṅgamo, iti vedanā iti vedanāya samudayo iti vedanāya atthaṅgamo, iti saññā iti saññāya samudayo iti saññāya atthaṅgamo, iti saṅkhārā iti saṅkhārānaṁ samudayo iti saṅkhārānaṁ atthaṅgamo, iti viññāṇaṁ iti viññāṇassa samudayo iti viññāṇassa atthaṅgamo. Iti imasmiṁ sati idaṁ hoti, imassuppādā idaṁ uppajjati; imasmiṁ asati idaṁ na hoti imassa nirodhā idaṁ nirujjhati. Yadidaṁ avijjāpaccayā saṅkhārā; saṅkhārapaccayā viññāṇaṁ … pe … evametassa kevalassa dukkhakkhandhassa samudayo hoti. Avijjāya tveva asesavirāganirodhā saṅkhāranirodho; saṅkhāranirodhā viññāṇanirodho … pe … evametassa kevalassa dukkhakkhandhassa nirodho hoti’.",
    "sn12.22:2": "Evaṁ svākkhāto, bhikkhave, mayā dhammo uttāno vivaṭo pakāsito chinnapilotiko. Evaṁ svākkhāte kho, bhikkhave, mayā dhamme uttāne vivaṭe pakāsite chinnapilotike alameva saddhāpabbajitena kulaputtena vīriyaṁ ārabhituṁ: ‘kāmaṁ taco ca nhāru ca aṭṭhi ca avasissatu, sarīre upassussatu maṁsalohitaṁ. Yaṁ taṁ purisathāmena purisavīriyena purisaparakkamena pattabbaṁ, na taṁ apāpuṇitvā vīriyassa saṇṭhānaṁ bhavissatī’ti.",
    "sn12.22:3": "Dukkhaṁ, bhikkhave, kusīto vihārati vokiṇṇo pāpakehi akusalehi dhammehi, mahantañca sadatthaṁ parihāpeti. Āraddhavīriyo ca kho, bhikkhave, sukhaṁ vihārati pavivitto pāpakehi akusalehi dhammehi, mahantañca sadatthaṁ paripūreti. Na, bhikkhave, hīnena aggassa patti hoti. Aggena ca kho, bhikkhave, aggassa patti hoti. Maṇḍapeyyamidaṁ, bhikkhave, brahmacariyaṁ, satthā sammukhībhūto. Tasmātiha, bhikkhave, vīriyaṁ ārabhatha appattassa pattiyā, anadhigatassa adhigamāya, asacchikatassa sacchikiriyāya. ‘Evaṁ no ayaṁ amhākaṁ pabbajjā avañjhā bhavissati saphalā saudrayā. Yesañca mayaṁ paribhuñjāma cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṁ tesaṁ te kārā amhesu mahapphalā bhavissanti mahānisaṁsā’ti – evañhi vo, bhikkhave, sikkhitabbaṁ."
}