{
    "sn12.27:1": "Sāvatthiyaṁ vihārati. \"Avijjāpaccayā, bhikkhave, saṅkhārā; saṅkhārapaccayā viññāṇaṁ … pe … evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "sn12.27:2": "Katamañca, bhikkhave, jarāmaraṇaṁ? Yā tesaṁ tesaṁ sattānaṁ tamhi tamhi sattanikāye jarā jīraṇatā khaṇḍiccaṁ pāliccaṁ valittacatā āyuno saṁhāni indriyānaṁ paripāko – ayaṁ vuccati jarā. Yā tesaṁ tesaṁ sattānaṁ tamhā tamhā sattanikāyā cuti cavanatā bhedo antaradhānaṁ maccu maraṇaṁ kālakiriyā khandhānaṁ bhedo kaḷevarassa nikkhepo; idaṁ vuccati maraṇaṁ. Iti ayañca jarā idañca maraṇaṁ. Idaṁ vuccati, bhikkhave, jarāmaraṇaṁ. Jātisamudayā jarāmaraṇasamudayo; jātinirodhā jarāmaraṇanirodho. Ayameva ariyo aṭṭhaṅgiko maggo jarāmaraṇanirodhagāminī paṭipadā. Seyyathidaṁ – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi.",
    "sn12.27:3": "Katamā ca, bhikkhave, jāti … pe … katamo ca, bhikkhave, bhavo … katamañca, bhikkhave, upādānaṁ … katamā ca, bhikkhave, taṇhā … katamā ca, bhikkhave, vedanā … katamo ca, bhikkhave, phasso … katamañca, bhikkhave, saḷāyatanaṁ … katamañca, bhikkhave, nāmarūpaṁ … katamañca, bhikkhave, viññāṇaṁ … ?",
    "sn12.27:4": "Katame ca, bhikkhave, saṅkhārā? Tayome, bhikkhave, saṅkhārā – kāyasaṅkhāro, vacīsaṅkhāro, cittasaṅkhāro. Ime vuccanti, bhikkhave, saṅkhārā. Avijjāsamudayā saṅkhārasamudayo; avijjānirodhā saṅkhāranirodho. Ayameva ariyo aṭṭhaṅgiko maggo saṅkhāranirodhagāminī paṭipadā. Seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn12.27:5": "Yato kho, bhikkhave, ariyasāvako evaṁ paccayaṁ pajānāti, evaṁ paccayasamudayaṁ pajānāti, evaṁ paccayanirodhaṁ pajānāti, evaṁ paccayanirodhagāminiṁ paṭipadāṁ pajānāti. Ayaṁ vuccati, bhikkhave, ariyasāvako diṭṭhisampanno itipi, dassanasampanno itipi, āgato imaṁ saddhammaṁ itipi, passati imaṁ saddhammaṁ itipi, sekkhena ñāṇena samannāgato itipi, sekkhāya vijjāya samannāgato itipi, dhammasotaṁ samāpanno itipi, ariyo nibbedhikapañño itipi, amatadvāraṁ āhacca tiṭṭhati itipī\"ti."
}