{
    "sn12.66:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā kurūsu vihārati kammāsadhammaṁ nāma kurūnaṁ nigamo. Tatra kho bhagavā bhikkhū āmantesi: \"bhikkhavo\"ti.",
    "sn12.66:2": "Evaṁ vutte, āyasmā ānando bhagavantaṁ etadavoca: \"etassa, bhagavā, kālo; etassa, sugata, kālo; yaṁ bhagavā antaraṁ sammasaṁ bhāseyya. Bhagavato sutvā bhikkhū dhāressantī\"ti.",
    "sn12.66:3": "\"Idha, bhikkhave, bhikkhu sammasamāno sammasati antaraṁ sammasaṁ: ‘Yaṁ kho idaṁ anekavidhaṁ nānappakārakaṁ dukkhaṁ loke uppajjati jarāmaraṇaṁ. Idaṁ kho dukkhaṁ kiṁnidānaṁ kiṁsamudayaṁ kiṁjātikaṁ kiṁpabhavaṁ, kismiṁ sati jarāmaraṇaṁ hoti, kismiṁ asati jarāmaraṇaṁ na hotī’ti?",
    "sn12.66:4": "Athāparaṁ sammasamāno sammasati antaraṁ sammasaṁ: ‘upadhi panāyaṁ kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo, kismiṁ sati upadhi hoti, kismiṁ asati upadhi na hotī’ti?",
    "sn12.66:5": "Athāparaṁ sammasamāno sammasati antaraṁ sammasaṁ: ‘taṇhā panāyaṁ kattha uppajjamānā uppajjati, kattha nivisamānā nivisatī’ti?",
    "sn12.66:6": "Ye hi keci, bhikkhave, atītamaddhānaṁ samaṇā vā brāhmaṇā vā yaṁ loke piyarūpaṁ sātarūpaṁ taṁ niccato addakkhuṁ sukhato addakkhuṁ attato addakkhuṁ ārogyato addakkhuṁ khemato addakkhuṁ. Te taṇhāṁ vaḍḍhesuṁ. Ye taṇhāṁ vaḍḍhesuṁ te upadhiṁ vaḍḍhesuṁ. Ye upadhiṁ vaḍḍhesuṁ te dukkhaṁ vaḍḍhesuṁ. Ye dukkhaṁ vaḍḍhesuṁ te na parimucciṁsu jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, na parimucciṁsu dukkhasmāti vadāmi.",
    "sn12.66:7": "Yepi hi keci, bhikkhave, anāgatamaddhānaṁ samaṇā vā brāhmaṇā vā yaṁ loke piyarūpaṁ sātarūpaṁ taṁ niccato dakkhissanti sukhato dakkhissanti attato dakkhissanti ārogyato dakkhissanti khemato dakkhissanti. Te taṇhāṁ vaḍḍhissanti. Ye taṇhāṁ vaḍḍhissanti te upadhiṁ vaḍḍhissanti. Ye upadhiṁ vaḍḍhissanti te dukkhaṁ vaḍḍhissanti. Ye dukkhaṁ vaḍḍhissanti te na parimuccissanti jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, na parimuccissanti dukkhasmāti vadāmi.",
    "sn12.66:8": "Yepi hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā yaṁ loke piyarūpaṁ sātarūpaṁ taṁ niccato passanti sukhato passanti attato passanti ārogyato passanti khemato passanti. Te taṇhāṁ vaḍḍhenti. Ye taṇhāṁ vaḍḍhenti te upadhiṁ vaḍḍhenti. Ye upadhiṁ vaḍḍhenti te dukkhaṁ vaḍḍhenti. Ye dukkhaṁ vaḍḍhenti te na parimuccanti jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, na parimuccanti dukkhasmāti vadāmi.",
    "sn12.66:9": "Seyyathāpi, bhikkhave, āpānīyakaṁso vaṇṇasampanno gandhasampanno rasasampanno. So ca kho visena saṁsaṭṭho. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. Tamenaṁ evaṁ vadeyyuṁ: ‘Ayaṁ te, ambho purisa, āpānīyakaṁso vaṇṇasampanno gandhasampanno rasasampanno; so ca kho visena saṁsaṭṭho. Sace ākaṅkhasi piva. Pivato hi kho taṁ chādessati vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana tatonidānaṁ maraṇaṁ vā nigacchasi maraṇamattaṁ vā dukkhan’ti. So taṁ āpānīyakaṁsaṁ sahasā appaṭisaṅkhā piveyya, nappaṭinissajjeyya. So tatonidānaṁ maraṇaṁ vā nigaccheyya maraṇamattaṁ vā dukkhaṁ.",
    "sn12.66:10": "Ye ca kho keci, bhikkhave, atītamaddhānaṁ samaṇā vā brāhmaṇā vā yaṁ loke piyarūpaṁ sātarūpaṁ taṁ aniccato addakkhuṁ dukkhato addakkhuṁ anattato addakkhuṁ rogato addakkhuṁ bhayato addakkhuṁ, te taṇhāṁ pajahiṁsu. Ye taṇhāṁ pajahiṁsu te upadhiṁ pajahiṁsu. Ye upadhiṁ pajahiṁsu te dukkhaṁ pajahiṁsu. Ye dukkhaṁ pajahiṁsu te parimucciṁsu jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, parimucciṁsu dukkhasmāti vadāmi.",
    "sn12.66:11": "Yepi hi keci, bhikkhave, anāgatamaddhānaṁ samaṇā vā brāhmaṇā vā yaṁ loke piyarūpaṁ sātarūpaṁ taṁ aniccato dakkhissanti dukkhato dakkhissanti anattato dakkhissanti rogato dakkhissanti bhayato dakkhissanti, te taṇhāṁ pajahissanti. Ye taṇhāṁ pajahissanti … pe … parimuccissanti dukkhasmāti vadāmi.",
    "sn12.66:12": "Yepi hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā yaṁ loke piyarūpaṁ sātarūpaṁ taṁ aniccato passanti dukkhato passanti anattato passanti rogato passanti bhayato passanti, te taṇhāṁ pajahanti. Ye taṇhāṁ pajahanti te upadhiṁ pajahanti. Ye upadhiṁ pajahanti te dukkhaṁ pajahanti. Ye dukkhaṁ pajahanti te parimuccanti jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, parimuccanti dukkhasmāti vadāmi.",
    "sn12.66:13": "Seyyathāpi, bhikkhave, āpānīyakaṁso vaṇṇasampanno gandhasampanno rasasampanno. So ca kho visena saṁsaṭṭho. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. Tamenaṁ evaṁ vadeyyuṁ: ‘Ayaṁ te, ambho purisa, āpānīyakaṁso vaṇṇasampanno gandhasampanno rasasampanno so ca kho visena saṁsaṭṭho. Sace ākaṅkhasi piva. Pivato hi kho taṁ chādessati vaṇṇenapi gandhenapi rasenapi; pivitvā ca pana tatonidānaṁ maraṇaṁ vā nigacchasi maraṇamattaṁ vā dukkhan’ti. Atha kho, bhikkhave, tassa purisassa evamassa: ‘sakkā kho me ayaṁ surāpipāsitā pānīyena vā vinetuṁ dadhimaṇḍakena vā vinetuṁ bhaṭṭhaloṇikāya vā vinetuṁ loṇasovīrakena vā vinetuṁ, na tvevāhaṁ taṁ piveyyaṁ, yaṁ mama assa dīgharattaṁ hitāya sukhāyā’ti. So taṁ āpānīyakaṁsaṁ paṭisaṅkhā na piveyya, paṭinissajjeyya. So tatonidānaṁ na maraṇaṁ vā nigaccheyya maraṇamattaṁ vā dukkhaṁ. Evameva kho, bhikkhave, ye hi keci atītamaddhānaṁ samaṇā vā brāhmaṇā vā yaṁ loke piyarūpaṁ sātarūpaṁ taṁ aniccato addakkhuṁ dukkhato addakkhuṁ anattato addakkhuṁ rogato addakkhuṁ bhayato addakkhuṁ, te taṇhāṁ pajahiṁsu. Ye taṇhāṁ pajahiṁsu te upadhiṁ pajahiṁsu. Ye upadhiṁ pajahiṁsu te dukkhaṁ pajahiṁsu. Ye dukkhaṁ pajahiṁsu te parimucciṁsu jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, parimucciṁsu dukkhasmāti vadāmi.",
    "sn12.66:14": "Yepi hi keci, bhikkhave, anāgatamaddhānaṁ … pe … etarahi samaṇā vā brāhmaṇā vā yaṁ loke piyarūpaṁ sātarūpaṁ taṁ aniccato passanti dukkhato passanti anattato passanti rogato passanti bhayato passanti, te taṇhāṁ pajahanti. Ye taṇhāṁ pajahanti te upadhiṁ pajahanti. Ye upadhiṁ pajahanti te dukkhaṁ pajahanti. Ye dukkhaṁ pajahanti te parimuccanti jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, parimuccanti dukkhasmāti vadāmī\"ti."
}