{
    "sn12.70:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā rājagahe vihārati veḷuvane kalandakanivāpe.",
    "sn12.70:2": "Tena kho pana samayena susimo paribbājako rājagahe paṭivasati mahatiyā paribbājakaparisāya saddhiṁ. Atha kho susimassa paribbājakassa parisā susimaṁ paribbājakaṁ etadavocuṁ: \"ehi tvaṁ, āvuso susima, samaṇe gotame brahmacariyaṁ cara. Tvaṁ dhammaṁ pariyāpuṇitvā amhe vāceyyāsi. Taṁ mayaṁ dhammaṁ pariyāpuṇitvā gihīnaṁ bhāsissāma. Evaṁ mayampi sakkatā bhavissāma garukatā mānitā pūjitā apacitā lābhino cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānan\"ti.",
    "sn12.70:3": "Atha kho āyasmā ānando susimaṁ paribbājakaṁ ādāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca: \"Ayaṁ, bhante, susimo paribbājako evamāha: ‘icchāmahaṁ, āvuso Ānanda, imasmiṁ dhammavinaye brahmacariyaṁ caritun’\"ti.",
    "sn12.70:4": "Tena kho pana samayena sambahulehi bhikkhūhi bhagavato santike aññā byākatā hoti: \"khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyāti pajānāmā\"ti. Assosi kho āyasmā susimo: \"sambahulehi kira bhikkhūhi bhagavato santike aññā byākatā: ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāmā\"ti. Atha kho āyasmā susimo yena te bhikkhū tenupasaṅkami; upasaṅkamitvā tehi bhikkhūhi saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā susimo te bhikkhū etadavoca: \"Saccaṁ kirāyasmantehi bhagavato santike aññā byākatā: ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāmā\"ti?",
    "sn12.70:5": "\"Api pana tumhe āyasmanto evaṁ jānantā evaṁ passantā anekavihitaṁ iddhividhaṁ paccanubhotha – ekopi hutvā bahudhā hotha, bahudhāpi hutvā eko hotha; āvibhāvaṁ, tirobhāvaṁ, tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamānā gacchatha, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karotha, seyyathāpi udake; udakepi abhijjamāne gacchatha, seyyathāpi pathaviyaṁ; ākāsepi pallaṅkena kamatha, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parimasatha parimajjatha, yāva brahmalokāpi kāyena vasaṁ vattethā\"ti?",
    "sn12.70:6": "\"Api pana tumhe āyasmanto evaṁ jānantā evaṁ passantā dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇātha dibbe ca mānuse ca ye dūre santike cā\"ti?",
    "sn12.70:7": "\"Api pana tumhe āyasmanto evaṁ jānantā evaṁ passantā parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānātha – sarāgaṁ vā cittaṁ sarāgaṁ cittanti pajānātha; vītarāgaṁ vā cittaṁ vītarāgaṁ cittanti pajānātha; sadosaṁ vā cittaṁ sadosaṁ cittanti pajānātha; vītadosaṁ vā cittaṁ vītadosaṁ cittanti pajānātha; samohaṁ vā cittaṁ samohaṁ cittanti pajānātha; vītamohaṁ vā cittaṁ vītamohaṁ cittanti pajānātha; saṅkhittaṁ vā cittaṁ saṅkhittaṁ cittanti pajānātha; vikkhittaṁ vā cittaṁ vikkhittaṁ cittanti pajānātha; mahaggataṁ vā cittaṁ mahaggataṁ cittanti pajānātha; amahaggataṁ vā cittaṁ amahaggataṁ cittanti pajānātha; sauttaraṁ vā cittaṁ sauttaraṁ cittanti pajānātha; anuttaraṁ vā cittaṁ anuttaraṁ cittanti pajānātha; samāhitaṁ vā cittaṁ samāhitaṁ cittanti pajānātha; asamāhitaṁ vā cittaṁ asamāhitaṁ cittanti pajānātha; vimuttaṁ vā cittaṁ vimuttaṁ cittanti pajānātha; avimuttaṁ vā cittaṁ avimuttaṁ cittanti pajānāthā\"ti?",
    "sn12.70:8": "\"Api pana tumhe āyasmanto evaṁ jānantā evaṁ passantā anekavihitaṁ pubbenivāsaṁ anussaratha, seyyathidaṁ – ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattārīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi, anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe: ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhapaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhapaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarathā\"ti?",
    "sn12.70:9": "\"Api pana tumhe āyasmanto evaṁ jānantā evaṁ passantḍā dibbena cakkhunā visuddhena atikkantamānusakena satte passatha cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānātha: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā, ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā, ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti, iti dibbena cakkhunā visuddhena atikkantamānusakena satte passatha cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāthā\"ti?",
    "sn12.70:10": "\"Api pana tumhe āyasmanto evaṁ jānantā evaṁ passantā ye te santā vimokkhā atikkamma rūpe āruppā, te kāyena phusitvā vihārathā\"ti?",
    "sn12.70:11": "\"Ettha dāni āyasmanto idañca veyyākaraṇaṁ imesañca dhammānaṁ asamāpatti; idaṁ no, āvuso, kathan\"ti?",
    "sn12.70:12": "\"Na khvāhaṁ imassa āyasmantānaṁ saṅkhittena bhāsitassa vitthārena atthaṁ ājānāmi. Sādhu me āyasmanto tathā bhāsantu yathāhaṁ imassa āyasmantānaṁ saṅkhittena bhāsitassa vitthārena atthaṁ ājāneyyan\"ti.",
    "sn12.70:13": "Atha kho āyasmā susimo uṭṭhāyāsanā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā susimo yāvatako tehi bhikkhūhi saddhiṁ ahosi kathāsallāpo taṁ sabbaṁ bhagavato ārocesi.",
    "sn12.70:14": "\"Na khvāhaṁ, bhante, imassa bhagavatā saṅkhittena bhāsitassa vitthārena atthaṁ ājānāmi. Sādhu me, bhante, bhagavā tathā bhāsatu yathāhaṁ imassa bhagavatā saṅkhittena bhāsitassa vitthārena atthaṁ ājāneyyan\"ti.",
    "sn12.70:15": "Taṁ kiṁ maññasi, susima, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti? \"Dukkhaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti? \"No hetaṁ, bhante\".",
    "sn12.70:16": "\"Tasmātiha, susima, yaṁ kiñci rūpaṁ atītānāgatapaccuppannaṁ ajjhattaṁ vā bahiddhā vā oḷārikaṁ vā sukhumaṁ vā hīnaṁ vā paṇītaṁ vā yaṁ dūre santike vā, sabbaṁ rūpaṁ netaṁ mama nesohamasmi na meso attāti; evametaṁ yathābhūtaṁ sammappaññāya daṭṭhabbaṁ.",
    "sn12.70:17": "Evaṁ passaṁ, susima, sutavā ariyasāvako rūpasmimpi nibbindati, vedanāyapi nibbindati, saññāyapi nibbindati, saṅkhāresupi nibbindati, viññāṇasmimpi nibbindati. Nibbindaṁ virajjati, virāgā vimuccati, vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti.",
    "sn12.70:18": "‘Jātipaccayā jarāmaraṇan’ti, susima, passasī\"ti?",
    "sn12.70:19": "\"‘Jātinirodhā jarāmaraṇanirodho’ti, susima, passasī\"ti?",
    "sn12.70:20": "\"Api pana tvaṁ, susima, evaṁ jānanto evaṁ passanto anekavihitaṁ iddhividhaṁ paccanubhosi – ekopi hutvā bahudhā hosi, bahudhāpi hutvā eko hosi; āvibhāvaṁ, tirobhāvaṁ, tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchasi, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karosi, seyyathāpi udake; udakepi abhijjamāno gacchasi, seyyathāpi pathaviyaṁ; ākāsepi pallaṅkena kamasi, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parimasasi parimajjasi, yāva brahmalokāpi kāyena vasaṁ vattesī\"ti?",
    "sn12.70:21": "\"Api pana tvaṁ, susima, evaṁ jānanto evaṁ passanto dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇasi dibbe ca mānuse ca ye dūre santike cā\"ti?",
    "sn12.70:22": "\"Api pana tvaṁ, susima, evaṁ jānanto evaṁ passanto parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāsi – sarāgaṁ vā cittaṁ sarāgaṁ cittanti pajānāsi … pe … vimuttaṁ vā cittaṁ vimuttaṁ cittanti pajānāsī\"ti?",
    "sn12.70:23": "\"Api pana tvaṁ, susima, evaṁ jānanto evaṁ passanto anekavihitaṁ pubbenivāsaṁ anussarasi, seyyathidaṁ – ekampi jātiṁ … pe … iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarasī\"ti?",
    "sn12.70:24": "\"Api pana tvaṁ, susima, evaṁ jānanto evaṁ passanto dibbena cakkhunā visuddhena atikkantamānusakena satte passasi cavamāne … pe … yathākammūpage satte pajānāsī\"ti?",
    "sn12.70:25": "\"Api pana tvaṁ, susima, evaṁ jānanto evaṁ passanto ye te santā vimokkhā atikkamma rūpe āruppā, te kāyena phusitvā vihārasī\"ti?",
    "sn12.70:26": "\"Ettha dāni, susima, idañca veyyākaraṇaṁ imesañca dhammānaṁ asamāpatti, idaṁ no, susima, kathan\"ti?",
    "sn12.70:27": "Atha kho āyasmā susimo bhagavato pādesu sirasā nipatitvā bhagavantaṁ etadavoca: \"Accayo maṁ, bhante, accagamā yathābālaṁ yathāmūḷhaṁ yathāakusalaṁ, yvāhaṁ evaṁ svākkhāte dhammavinaye dhammatthenako pabbajito. Tassa me, bhante, bhagavā accayaṁ accayato paṭiggaṇhātu āyatiṁ saṁvarāyā\"ti.",
    "sn12.70:28": "\"Taggha tvaṁ, susima, accayo accagamā yathābālaṁ yathāmūḷhaṁ yathāakusalaṁ, yo tvaṁ evaṁ svākkhāte dhammavinaye dhammatthenako pabbajito. Seyyathāpi, susima, coraṁ āgucāriṁ gahetvā rañño dasseyyuṁ: ‘Ayaṁ te, deva, coro āgucārī, imassa yaṁ icchasi taṁ daṇḍaṁ paṇehī’ti. Tamenaṁ rājā evaṁ vadeyya: ‘gacchatha, bho, imaṁ purisaṁ daḷhāya rajjuyā pacchābāhaṁ gāḷhabandhanaṁ bandhitvā khuramuṇḍaṁ karitvā kharassarena paṇavena rathiyāya rathiyaṁ siṅghāṭakena siṅghāṭakaṁ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṁ chindathā’ti. Tamenaṁ rañño purisā daḷhāya rajjuyā pacchābāhaṁ gāḷhabandhanaṁ bandhitvā khuramuṇḍaṁ karitvā kharassarena paṇavena rathiyāya rathiyaṁ siṅghāṭakena siṅghāṭakaṁ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṁ chindeyyuṁ. Taṁ kiṁ maññasi, susima, api nu so puriso tatonidānaṁ dukkhaṁ domanassaṁ paṭisaṁvediyethā\"ti?",
    "sn12.70:29": "\"Yaṁ kho so, susima, puriso tatonidānaṁ dukkhaṁ domanassaṁ paṭisaṁvediyetha. Yā evaṁ svākkhāte dhammavinaye dhammatthenakassa pabbajjā, ayaṁ tato dukkhavipākatarā ca kaṭukavipākatarā ca, api ca vinipātāya saṁvattati. Yato ca kho tvaṁ, susima, accayaṁ accayato disvā yathādhammaṁ paṭikarosi taṁ te mayaṁ paṭiggaṇhāma. Vuddhi hesā, susima, ariyassa vinaye yo accayaṁ accayato disvā yathādhammaṁ paṭikaroti, āyatiñca saṁvaraṁ āpajjatī\"ti.",
    "sn12.70:30": "Dve assutavatā vuttā,puttamaṁsena cāparaṁ;Atthirāgo ca nagaraṁ,sammasaṁ naḷakalāpiyaṁ;Kosambī upayanti ca,dasamo susimena cāti."
}