{
    "sn12.67:1": "Ekaṁ samayaṁ āyasmā ca sāriputto āyasmā ca mahākoṭṭhiko bārāṇasiyaṁ vihāranti isipatane migadāye. Atha kho āyasmā mahākoṭṭhiko sāyanhasamayaṁ paṭisallānā vuṭṭhito yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā mahākoṭṭhiko āyasmantaṁ sāriputtaṁ etadavoca:",
    "sn12.67:2": "\"Kiṁ nu kho, āvuso sāriputta, sayaṅkatā jāti, paraṅkatā jāti, sayaṅkatā ca paraṅkatā ca jāti, udāhu asayaṅkārā aparaṅkārā adhiccasamuppannā jātī\"ti?",
    "sn12.67:3": "\"Kiṁ nu kho, āvuso sāriputta, sayaṅkato bhavo … pe … sayaṅkataṁ upādānaṁ … sayaṅkatā taṇhā … sayaṅkatā vedanā … sayaṅkato phasso … sayaṅkataṁ saḷāyatanaṁ … sayaṅkataṁ nāmarūpaṁ, paraṅkataṁ nāmarūpaṁ, sayaṅkatañca paraṅkatañca nāmarūpaṁ, udāhu asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ nāmarūpan\"ti? \"Na kho, āvuso koṭṭhika, sayaṅkataṁ nāmarūpaṁ, na paraṅkataṁ nāmarūpaṁ, na sayaṅkatañca paraṅkatañca nāmarūpaṁ, nāpi asayaṅkāraṁ aparaṅkāraṁ, adhiccasamuppannaṁ nāmarūpaṁ. Api ca viññāṇapaccayā nāmarūpan\"ti.",
    "sn12.67:4": "\"Kiṁ nu kho, āvuso sāriputta, sayaṅkataṁ viññāṇaṁ, paraṅkataṁ viññāṇaṁ, sayaṅkatañca paraṅkatañca viññāṇaṁ, udāhu asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ viññāṇan\"ti?",
    "sn12.67:5": "\"Idāneva kho mayaṁ āyasmato sāriputtassa bhāsitaṁ evaṁ ājānāma: ‘Na khvāvuso koṭṭhika, sayaṅkataṁ nāmarūpaṁ, na paraṅkataṁ nāmarūpaṁ, na sayaṅkatañca paraṅkatañca nāmarūpaṁ, nāpi asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ nāmarūpaṁ. Api ca viññāṇapaccayā nāmarūpan’ti.",
    "sn12.67:6": "Idāneva ca pana mayaṁ āyasmato sāriputtassa bhāsitaṁ evaṁ ājānāma: ‘Na khvāvuso koṭṭhika, sayaṅkataṁ viññāṇaṁ, na paraṅkataṁ viññāṇaṁ, na sayaṅkatañca paraṅkatañca viññāṇaṁ, nāpi asayaṅkāraṁ aparaṅkāraṁ adhiccasamuppannaṁ viññāṇaṁ. Api ca nāmarūpapaccayā viññāṇan’ti.",
    "sn12.67:7": "Yathā kathaṁ panāvuso sāriputta, imassa bhāsitassa attho daṭṭhabbo\"ti?",
    "sn12.67:8": "\"Acchariyaṁ, āvuso sāriputta; abbhutaṁ, āvuso sāriputta. Yāvasubhāsitañcidaṁ āyasmatā sāriputtena. Idañca pana mayaṁ āyasmato sāriputtassa bhāsitaṁ imehi chattiṁsāya vatthūhi anumodāma:",
    "sn12.67:9": "‘Jarāmaraṇassa ce, āvuso, bhikkhu nibbidāya virāgāya nirodhāya dhammaṁ deseti, dhammakathiko bhikkhūti alaṁvacanāya. Jarāmaraṇassa ce, āvuso, bhikkhu nibbidāya virāgāya nirodhāya paṭipanno hoti, dhammānudhammappaṭipanno bhikkhūti alaṁvacanāya. Jarāmaraṇassa ce, āvuso, bhikkhu nibbidā virāgā nirodhā anupādā vimutto hoti, diṭṭhadhammanibbānappatto bhikkhūti alaṁvacanāya."
}