{
    "sn12.63:1": "Sāvatthiyaṁ … \"cattārome, bhikkhave, āhārā bhūtānaṁ vā sattānaṁ ṭhitiyā sambhavesīnaṁ vā anuggahāya. Katame cattāro? Kabaḷīkāro āhāro oḷāriko vā sukhumo vā, phasso dutiyo, manosañcetanā tatiyā, viññāṇaṁ catutthaṁ. Ime kho, bhikkhave, cattāro āhārā bhūtānaṁ vā sattānaṁ ṭhitiyā sambhavesīnaṁ vā anuggahāya.",
    "sn12.63:2": "Kathañca, bhikkhave, kabaḷīkāro āhāro daṭṭhabbo? Seyyathāpi, bhikkhave, dve jāyampatikā parittaṁ sambalaṁ ādāya kantāramaggaṁ paṭipajjeyyuṁ. Tesamassa ekaputtako piyo manāpo. Atha kho tesaṁ, bhikkhave, dvinnaṁ jāyampatikānaṁ kantāragatānaṁ yā parittā sambalamattā, sā parikkhayaṁ pariyādānaṁ gaccheyya. Siyā ca nesaṁ kantārāvaseso anatiṇṇo. Atha kho tesaṁ, bhikkhave, dvinnaṁ jāyampatikānaṁ evamassa: ‘amhākaṁ kho yā parittā sambalamattā sā parikkhīṇā pariyādiṇṇā. Atthi cāyaṁ kantārāvaseso anittiṇṇo. Yannūna mayaṁ imaṁ ekaputtakaṁ piyaṁ manāpaṁ vadhitvā vallūrañca soṇḍikañca karitvā puttamaṁsāni khādantā evaṁ taṁ kantārāvasesaṁ nitthareyyāma, mā sabbeva tayo vinassimhā’ti. Atha kho te, bhikkhave, dve jāyampatikā taṁ ekaputtakaṁ piyaṁ manāpaṁ vadhitvā vallūrañca soṇḍikañca karitvā puttamaṁsāni khādantā evaṁ taṁ kantārāvasesaṁ nitthareyyuṁ. Te puttamaṁsāni ceva khādeyyuṁ, ure ca paṭipiseyyuṁ: ‘kahaṁ, ekaputtaka, kahaṁ, ekaputtakā’ti.",
    "sn12.63:3": "Taṁ kiṁ maññatha, bhikkhave, api nu te davāya vā āhāraṁ āhāreyyuṁ, madāya vā āhāraṁ āhāreyyuṁ, maṇḍanāya vā āhāraṁ āhāreyyuṁ, vibhūsanāya vā āhāraṁ āhāreyyun\"ti?",
    "sn12.63:4": "Kathañca, bhikkhave, phassāhāro daṭṭhabbo? Seyyathāpi, bhikkhave, gāvī niccammā kuṭṭañce nissāya tiṭṭheyya. Ye kuṭṭanissitā pāṇā te naṁ khādeyyuṁ. Rukkhañce nissāya tiṭṭheyya, ye rukkhanissitā pāṇā te naṁ khādeyyuṁ. Udakañce nissāya tiṭṭheyya, ye udakanissitā pāṇā te naṁ khādeyyuṁ. Ākāsañce nissāya tiṭṭheyya, ye ākāsanissitā pāṇā te naṁ khādeyyuṁ. Yaṁ yadeva hi sā, bhikkhave, gāvī niccammā nissāya tiṭṭheyya, ye tannissitā pāṇā te naṁ khādeyyuṁ.",
    "sn12.63:5": "Kathañca, bhikkhave, manosañcetanāhāro daṭṭhabbo? Seyyathāpi, bhikkhave, aṅgārakāsu sādhikaporisā puṇṇā aṅgārānaṁ vītaccikānaṁ vītadhūmānaṁ. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukhakāmo dukkhappaṭikūlo. Tamenaṁ dve balavanto purisā nānābāhāsu gahetvā taṁ aṅgārakāsuṁ upakaḍḍheyyuṁ. Atha kho, bhikkhave, tassa purisassa ārakāvassa cetanā ārakā patthanā ārakā paṇidhi. Taṁ kissa hetu? Evañhi, bhikkhave, tassa purisassa hoti: ‘imañcāhaṁ aṅgārakāsuṁ papatissāmi, tatonidānaṁ maraṇaṁ vā nigacchāmi maraṇamattaṁ vā dukkhan’ti.",
    "sn12.63:6": "Kathañca, bhikkhave, viññāṇāhāro daṭṭhabbo? Seyyathāpi, bhikkhave, coraṁ āgucāriṁ gahetvā rañño dasseyyuṁ: ‘Ayaṁ te, deva, coro āgucārī, imassa yaṁ icchasi taṁ daṇḍaṁ paṇehī’ti. Tamenaṁ rājā evaṁ vadeyya: ‘gacchatha, bho, imaṁ purisaṁ pubbaṇhasamayaṁ sattisatena hanathā’ti. Tamenaṁ pubbaṇhasamayaṁ sattisatena haneyyuṁ. Atha rājā majjhanhikasamayaṁ evaṁ vadeyya: ‘ambho, kathaṁ so puriso’ti? ‘Tatheva, deva, jīvatī’ti. Tamenaṁ rājā evaṁ vadeyya: ‘gacchatha, bho, taṁ purisaṁ majjhanhikasamayaṁ sattisatena hanathā’ti. Tamenaṁ majjhanhikasamayaṁ sattisatena haneyyuṁ. Atha rājā sāyanhasamayaṁ evaṁ vadeyya: ‘ambho, kathaṁ so puriso’ti? ‘Tatheva, deva, jīvatī’ti. Tamenaṁ rājā evaṁ vadeyya: ‘gacchatha, bho, taṁ purisaṁ sāyanhasamayaṁ sattisatena hanathā’ti. Tamenaṁ sāyanhasamayaṁ sattisatena haneyyuṁ."
}