{
    "sn12.31:1": "Ekaṁ samayaṁ bhagavā sāvatthiyaṁ vihārati. Tatra kho bhagavā āyasmantaṁ sāriputtaṁ āmantesi: \"vuttamidaṁ, sāriputta, pārāyane ajitapañhe:",
    "sn12.31:2": "‘Ye ca saṅkhātadhammāse,ye ca sekkhā puthū idha;Tesaṁ me nipako iriyaṁ,puṭṭho pabrūhi mārisā’ti.",
    "sn12.31:3": "Imassa nu kho, sāriputta, saṅkhittena bhāsitassa kathaṁ vitthārena attho daṭṭhabbo\"ti?",
    "sn12.31:4": "Dutiyampi kho bhagavā āyasmantaṁ sāriputtaṁ āmantesi … pe … dutiyampi kho āyasmā sāriputto tuṇhī ahosi. Tatiyampi kho bhagavā āyasmantaṁ sāriputtaṁ āmantesi: \"vuttamidaṁ, sāriputta, pārāyane ajitapañhe:",
    "sn12.31:5": "‘Ye ca saṅkhātadhammāse,ye ca sekkhā puthū idha;Tesaṁ me nipako iriyaṁ,puṭṭho pabrūhi mārisā’ti.",
    "sn12.31:6": "Imassa nu kho, sāriputta, saṅkhittena bhāsitassa kathaṁ vitthārena attho daṭṭhabbo\"ti?",
    "sn12.31:7": "\"Bhūtamidanti, sāriputta, passasī\"ti?",
    "sn12.31:8": "Kathañca, bhante, saṅkhātadhammo hoti? Bhūtamidanti, bhante, yathābhūtaṁ sammappaññāya passati. Bhūtamidanti yathābhūtaṁ sammappaññāya disvā bhūtassa nibbidā virāgā nirodhā anupādā vimutto hoti. Tadāhārasambhavanti yathābhūtaṁ sammappaññāya passati. Tadāhārasambhavanti yathābhūtaṁ sammappaññāya disvā āhārasambhavassa nibbidā virāgā nirodhā anupādā vimutto hoti. Tadāhāranirodhā yaṁ bhūtaṁ taṁ nirodhadhammanti yathābhūtaṁ sammappaññāya passati. Tadāhāranirodhā yaṁ bhūtaṁ taṁ nirodhadhammanti yathābhūtaṁ sammappaññāya disvā nirodhadhammassa nibbidā virāgā nirodhā anupādā vimutto hoti. Evaṁ kho, bhante, saṅkhātadhammo hoti.",
    "sn12.31:9": "‘Ye ca saṅkhātadhammāse,ye ca sekkhā puthū idha;Tesaṁ me nipako iriyaṁ,puṭṭho pabrūhi mārisā’ti.",
    "sn12.31:10": "Imassa khvāhaṁ, bhante, saṅkhittena bhāsitassa evaṁ vitthārena atthaṁ ājānāmī\"ti.",
    "sn12.31:11": "\"Sādhu sādhu, sāriputta, bhūtamidanti, sāriputta, yathābhūtaṁ sammappaññāya passati. Bhūtamidanti yathābhūtaṁ sammappaññāya disvā bhūtassa nibbidāya virāgāya nirodhāya paṭipanno hoti. Tadāhārasambhavanti yathābhūtaṁ sammappaññāya passati. Tadāhārasambhavanti yathābhūtaṁ sammappaññāya disvā āhārasambhavassa nibbidāya virāgāya nirodhāya paṭipanno hoti. Tadāhāranirodhā yaṁ bhūtaṁ taṁ nirodhadhammanti yathābhūtaṁ sammappaññāya passati. Tadāhāranirodhā yaṁ bhūtaṁ taṁ nirodhadhammanti yathābhūtaṁ sammappaññāya disvā nirodhadhammassa nibbidāya virāgāya nirodhāya paṭipanno hoti. Evaṁ kho, sāriputta, sekkho hoti.",
    "sn12.31:12": "Kathañca, sāriputta, saṅkhātadhammo hoti? Bhūtamidanti, sāriputta, yathābhūtaṁ sammappaññāya passati. Bhūtamidanti yathābhūtaṁ sammappaññāya disvā bhūtassa nibbidā virāgā nirodhā anupādā vimutto hoti. Tadāhārasambhavanti yathābhūtaṁ sammappaññāya passati. Tadāhārasambhavanti yathābhūtaṁ sammappaññāya disvā āhārasambhavassa nibbidā virāgā nirodhā anupādā vimutto hoti. Tadāhāranirodhā yaṁ bhūtaṁ taṁ nirodhadhammanti yathābhūtaṁ sammappaññāya passati. Tadāhāranirodhā yaṁ bhūtaṁ taṁ nirodhadhammanti yathābhūtaṁ sammappaññā disvā nirodhadhammassa nibbidā virāgā nirodhā anupādā vimutto hoti. Evaṁ kho, sāriputta, saṅkhātadhammo hoti. Iti kho, sāriputta, yaṁ taṁ vuttaṁ pārāyane ajitapañhe:",
    "sn12.31:13": "‘Ye ca saṅkhātadhammāse,ye ca sekkhā puthū idha;Tesaṁ me nipako iriyaṁ,puṭṭho pabrūhi mārisā’ti.",
    "sn12.31:14": "Imassa kho, sāriputta, saṅkhittena bhāsitassa evaṁ vitthārena attho daṭṭhabbo\"ti."
}