{
    "sn12.60:1": "Ekaṁ samayaṁ bhagavā kurūsu vihārati kammāsadhammaṁ nāma kurūnaṁ nigamo. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca: \"acchariyaṁ, bhante, abbhutaṁ, bhante. Yāva gambhīro cāyaṁ, bhante, paṭiccasamuppādo gambhīrāvabhāso ca, atha ca pana me uttānakuttānako viya khāyatī\"ti.",
    "sn12.60:2": "\"Mā hevaṁ, Ānanda, mā hevaṁ, Ānanda. Gambhīro cāyaṁ, Ānanda, paṭiccasamuppādo gambhīrāvabhāso ca. Etassa, Ānanda, dhammassa ananubodhā appaṭivedhā evamayaṁ pajā tantākulakajātā kulagaṇṭhikajātā muñjapabbajabhūtā apāyaṁ duggatiṁ vinipātaṁ saṁsāraṁ nātivattati.",
    "sn12.60:3": "Upādāniyesu, Ānanda, dhammesu assādānupassino vihārato taṇhā pavaḍḍhati. Taṇhāpaccayā upādānaṁ; upādānapaccayā bhavo; bhavapaccayā jāti; jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "sn12.60:4": "Seyyathāpi, Ānanda, mahārukkho. Tassa yāni ceva mūlāni adhogamāni, yāni ca tiriyaṅgamāni, sabbāni tāni uddhaṁ ojaṁ abhiharanti. Evañhi so, Ānanda, mahārukkho tadāhāro tadupādāno ciraṁ dīghamaddhānaṁ tiṭṭheyya. Evameva kho, Ānanda, upādāniyesu dhammesu assādānupassino vihārato taṇhā pavaḍḍhati. Taṇhāpaccayā upādānaṁ; upādānapaccayā bhavo … pe … evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "sn12.60:5": "Upādāniyesu, Ānanda, dhammesu ādīnavānupassino vihārato taṇhā nirujjhati. Taṇhānirodhā upādānanirodho; upādānanirodhā bhavanirodho … pe … evametassa kevalassa dukkhakkhandhassa nirodho hoti.",
    "sn12.60:6": "Seyyathāpi, Ānanda, mahārukkho. Atha puriso āgaccheyya kuddālapiṭakaṁ ādāya. So taṁ rukkhaṁ mūle chindeyya, mūle chetvā palikhaṇeyya, palikhaṇitvā mūlāni uddhareyya antamaso usīranāḷimattānipi. So taṁ rukkhaṁ khaṇḍākhaṇḍikaṁ chindeyya. Khaṇḍākhaṇḍikaṁ chinditvā phāleyya; phāletvā sakalikaṁ sakalikaṁ kareyya, sakalikaṁ sakalikaṁ karitvā vātātape visoseyya, vātātape visosetvā agginā ḍaheyya, agginā ḍahetvā masiṁ kareyya, masiṁ karitvā mahāvāte vā ophuṇeyya, nadiyā vā sīghasotāya pavāheyya. Evañhi so, Ānanda, mahārukkho ucchinnamūlo assa tālāvatthukato anabhāvaṅkato āyatiṁ anup pāda dhammo.",
    "sn12.60:7": "Parivīmaṁsanupādānaṁ,dve ca saṁyojanāni ca;Mahārukkhena dve vuttā,taruṇena ca sattamaṁ;Nāmarūpañca viññāṇaṁ,nidānena ca te dasāti."
}