{
    "sn12.2:1": "Sāvatthiyaṁ vihārati. \"Paṭiccasamup pāda ṁ vo, bhikkhave, desessāmi vibhajissāmi. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "sn12.2:2": "\"Katamo ca, bhikkhave, paṭiccasamuppādo? Avijjāpaccayā, bhikkhave, saṅkhārā; saṅkhārapaccayā viññāṇaṁ; viññāṇapaccayā nāmarūpaṁ; nāmarūpapaccayā saḷāyatanaṁ; saḷāyatanapaccayā phasso; phassapaccayā vedanā; vedanāpaccayā taṇhā; taṇhāpaccayā upādānaṁ; upādānapaccayā bhavo; bhavapaccayā jāti; jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "sn12.2:3": "Katamañca, bhikkhave, jarāmaraṇaṁ? Yā tesaṁ tesaṁ sattānaṁ tamhi tamhi sattanikāye jarā jīraṇatā khaṇḍiccaṁ pāliccaṁ valittacatā āyuno saṁhāni indriyānaṁ paripāko; ayaṁ vuccati jarā. Yā tesaṁ tesaṁ sattānaṁ tamhā tamhā sattanikāyā cuti cavanatā bhedo antaradhānaṁ maccu maraṇaṁ kālakiriyā khandhānaṁ bhedo kaḷevarassa nikkhepo, idaṁ vuccati maraṇaṁ. Iti ayañca jarā, idañca maraṇaṁ. Idaṁ vuccati, bhikkhave, jarāmaraṇaṁ.",
    "sn12.2:4": "Katamā ca, bhikkhave, jāti? Yā tesaṁ tesaṁ sattānaṁ tamhi tamhi sattanikāye jāti sañjāti okkanti abhinibbatti khandhānaṁ pātubhāvo āyatanānaṁ paṭilābho. Ayaṁ vuccati, bhikkhave, jāti.",
    "sn12.2:5": "Katamo ca, bhikkhave, bhavo? Tayome, bhikkhave, bhavā – kāmabhavo, rūpabhavo, arūpabhavo. Ayaṁ vuccati, bhikkhave, bhavo.",
    "sn12.2:6": "Katamañca, bhikkhave, upādānaṁ? Cattārimāni, bhikkhave, upādānāni – kāmupādānaṁ, diṭṭhupādānaṁ, sīlabbatupādānaṁ, attavādupādānaṁ. Idaṁ vuccati, bhikkhave, upādānaṁ.",
    "sn12.2:7": "Katamā ca, bhikkhave, taṇhā? Chayime, bhikkhave, taṇhākāyā – rūpataṇhā, saddataṇhā, gandhataṇhā, rasataṇhā, phoṭṭhabbataṇhā, dhammataṇhā. Ayaṁ vuccati, bhikkhave, taṇhā.",
    "sn12.2:8": "Katamā ca, bhikkhave, vedanā? Chayime, bhikkhave, vedanākāyā – cakkhusamphassajā vedanā, sotasamphassajā vedanā, ghānasamphassajā vedanā, jivhāsamphassajā vedanā, kāyasamphassajā vedanā, manosamphassajā vedanā. Ayaṁ vuccati, bhikkhave, vedanā.",
    "sn12.2:9": "Katamo ca, bhikkhave, phasso? Chayime, bhikkhave, phassakāyā – cakkhusamphasso, sotasamphasso, ghānasamphasso, jivhāsamphasso, kāyasamphasso, manosamphasso. Ayaṁ vuccati, bhikkhave, phasso.",
    "sn12.2:10": "Katamañca, bhikkhave, saḷāyatanaṁ? Cakkhāyatanaṁ, sotāyatanaṁ, ghānāyatanaṁ, jivhāyatanaṁ, kāyāyatanaṁ, manāyatanaṁ – idaṁ vuccati, bhikkhave, saḷāyatanaṁ.",
    "sn12.2:11": "Katamañca, bhikkhave, nāmarūpaṁ? Vedanā, saññā, cetanā, phasso, manasikāro – idaṁ vuccati nāmaṁ. Cattāro ca mahābhūtā, catunnañca mahābhūtānaṁ upādāyarūpaṁ. Idaṁ vuccati rūpaṁ. Iti idañca nāmaṁ, idañca rūpaṁ. Idaṁ vuccati, bhikkhave, nāmarūpaṁ.",
    "sn12.2:12": "Katamañca, bhikkhave, viññāṇaṁ? Chayime, bhikkhave, viññāṇakāyā – cakkhuviññāṇaṁ, sotaviññāṇaṁ, ghānaviññāṇaṁ, jivhāviññāṇaṁ, kāyaviññāṇaṁ, manoviññāṇaṁ. Idaṁ vuccati, bhikkhave, viññāṇaṁ.",
    "sn12.2:13": "Katame ca, bhikkhave, saṅkhārā? Tayome, bhikkhave, saṅkhārā – kāyasaṅkhāro, vacīsaṅkhāro, cittasaṅkhāro. Ime vuccanti, bhikkhave, saṅkhārā.",
    "sn12.2:14": "Katamā ca, bhikkhave, avijjā? Yaṁ kho, bhikkhave, dukkhe aññāṇaṁ, dukkhasamudaye aññāṇaṁ, dukkhanirodhe aññāṇaṁ, dukkhanirodhagāminiyā paṭipadāya aññāṇaṁ. Ayaṁ vuccati, bhikkhave, avijjā.",
    "sn12.2:15": "Iti kho, bhikkhave, avijjāpaccayā saṅkhārā; saṅkhārapaccayā viññāṇaṁ … pe … evametassa kevalassa dukkhakkhandhassa samudayo hoti. Avijjāya tveva asesavirāganirodhā saṅkhāranirodho; saṅkhāranirodhā viññāṇanirodho … pe … evametassa kevalassa dukkhakkhandhassa nirodho hotī\"ti."
}