{
    "sn14.12:1": "Sāvatthiyaṁ vihārati. \"Sanidānaṁ, bhikkhave, uppajjati kāmavitakko, no anidānaṁ; sanidānaṁ uppajjati byā pāda vitakko, no anidānaṁ; sanidānaṁ uppajjati vihiṁsāvitakko, no anidānaṁ.",
    "sn14.12:2": "Kathañca, bhikkhave, sanidānaṁ uppajjati kāmavitakko, no anidānaṁ; sanidānaṁ uppajjati byā pāda vitakko, no anidānaṁ; sanidānaṁ uppajjati vihiṁsāvitakko, no anidānaṁ? Kāmadhātuṁ, bhikkhave, paṭicca uppajjati kāmasaññā, kāmasaññaṁ paṭicca uppajjati kāmasaṅkappo, kāmasaṅkappaṁ paṭicca uppajjati kāmacchando, kāmacchandaṁ paṭicca uppajjati kāmapariḷāho, kāmapariḷāhaṁ paṭicca uppajjati kāmapariyesanā. Kāmapariyesanaṁ, bhikkhave, pariyesamāno assutavā puthujjano tīhi ṭhānehi micchā paṭipajjati – kāyena, vācāya, manasā.",
    "sn14.12:3": "Byā pāda dhātuṁ, bhikkhave, paṭicca uppajjati byā pāda saññā, byā pāda saññaṁ paṭicca uppajjati byā pāda saṅkappo … pe … byā pāda cchando … byā pāda pariḷāho … byā pāda pariyesanā … byā pāda pariyesanaṁ, bhikkhave, pariyesamāno assutavā puthujjano tīhi ṭhānehi micchā paṭipajjati – kāyena, vācāya, manasā.",
    "sn14.12:4": "Vihiṁsādhātuṁ, bhikkhave, paṭicca uppajjati vihiṁsāsaññā; vihiṁsāsaññaṁ paṭicca uppajjati vihiṁsāsaṅkappo … pe … vihiṁsāchando … vihiṁsāpariḷāho … vihiṁsāpariyesanā … vihiṁsāpariyesanaṁ, bhikkhave, pariyesamāno assutavā puthujjano tīhi ṭhānehi micchā paṭipajjati – kāyena, vācāya, manasā.",
    "sn14.12:5": "Seyyathāpi, bhikkhave, puriso ādittaṁ tiṇukkaṁ sukkhe tiṇadāye nikkhipeyya; no ce hatthehi ca pādehi ca khippameva nibbāpeyya. Evañhi, bhikkhave, ye tiṇakaṭṭhanissitā pāṇā te anayabyasanaṁ āpajjeyyuṁ. Evameva kho, bhikkhave, yo hi koci samaṇo vā brāhmaṇo vā uppannaṁ visamagataṁ saññaṁ na khippameva pajahati vinodeti byantīkaroti anabhāvaṁ gameti, so diṭṭhe ceva dhamme dukkhaṁ vihārati savighātaṁ saupāyāsaṁ sapariḷāhaṁ; kāyassa ca bhedā paraṁ maraṇā duggati pāṭikaṅkhā.",
    "sn14.12:6": "Sanidānaṁ, bhikkhave, uppajjati nekkhammavitakko, no anidānaṁ; sanidānaṁ uppajjati abyā pāda vitakko, no anidānaṁ; sanidānaṁ uppajjati avihiṁsāvitakko, no anidānaṁ.",
    "sn14.12:7": "Kathañca, bhikkhave, sanidānaṁ uppajjati nekkhammavitakko, no anidānaṁ; sanidānaṁ uppajjati abyā pāda vitakko, no anidānaṁ; sanidānaṁ uppajjati avihiṁsāvitakko, no anidānaṁ? Nekkhammadhātuṁ, bhikkhave, paṭicca uppajjati nekkhammasaññā, nekkhammasaññaṁ paṭicca uppajjati nekkhammasaṅkappo, nekkhammasaṅkappaṁ paṭicca uppajjati nekkhammacchando, nekkhammacchandaṁ paṭicca uppajjati nekkhammapariḷāho, nekkhammapariḷāhaṁ paṭicca uppajjati nekkhammapariyesanā; nekkhammapariyesanaṁ, bhikkhave, pariyesamāno sutavā ariyasāvako tīhi ṭhānehi sammā paṭipajjati – kāyena, vācāya, manasā.",
    "sn14.12:8": "Abyā pāda dhātuṁ, bhikkhave, paṭicca uppajjati abyā pāda saññā, abyā pāda saññaṁ paṭicca uppajjati abyā pāda saṅkappo … pe … abyā pāda cchando … abyā pāda pariḷāho … abyā pāda pariyesanā, abyā pāda pariyesanaṁ, bhikkhave, pariyesamāno sutavā ariyasāvako tīhi ṭhānehi sammā paṭipajjati – kāyena, vācāya, manasā.",
    "sn14.12:9": "Avihiṁsādhātuṁ, bhikkhave, paṭicca uppajjati avihiṁsāsaññā, avihiṁsāsaññaṁ paṭicca uppajjati avihiṁsāsaṅkappo, avihiṁsāsaṅkappaṁ paṭicca uppajjati avihiṁsāchando, avihiṁsāchandaṁ paṭicca uppajjati avihiṁsāpariḷāho, avihiṁsāpariḷāhaṁ paṭicca uppajjati avihiṁsāpariyesanā; avihiṁsāpariyesanaṁ, bhikkhave, pariyesamāno sutavā ariyasāvako tīhi ṭhānehi sammā paṭipajjati – kāyena, vācāya, manasā.",
    "sn14.12:10": "Seyyathāpi, bhikkhave, puriso ādittaṁ tiṇukkaṁ sukkhe tiṇadāye nikkhipeyya; tamenaṁ hatthehi ca pādehi ca khippameva nibbāpeyya. Evañhi, bhikkhave, ye tiṇakaṭṭhanissitā pāṇā te na anayabyasanaṁ āpajjeyyuṁ. Evameva kho, bhikkhave, yo hi koci samaṇo vā brāhmaṇo vā uppannaṁ visamagataṁ saññaṁ khippameva pajahati vinodeti byantīkaroti anabhāvaṁ gameti, so diṭṭhe ceva dhamme sukhaṁ vihārati avighātaṁ anupāyāsaṁ apariḷāhaṁ; kāyassa ca bhedā paraṁ maraṇā sugati pāṭikaṅkhā\"ti."
}