{
    "sn14.18:1": "Sāvatthiyaṁ vihārati. \"Dhātusova, bhikkhave, sattā saṁsandanti samenti. Assaddhā assaddhehi saddhiṁ saṁsandanti samenti; ahirikā ahirikehi saddhiṁ saṁsandanti samenti; duppaññā duppaññehi saddhiṁ saṁsandanti samenti; saddhā saddhehi saddhiṁ saṁsandanti samenti; hirimanā hirimanehi saddhiṁ saṁsandanti samenti; paññavanto paññavantehi saddhiṁ saṁsandanti samenti. Atītampi kho, bhikkhave, addhānaṁ dhātusova sattā saṁsandiṁsu samiṁsu … pe … anāgatampi kho, bhikkhave, addhānaṁ dhātusova sattā saṁsandissanti samessanti … pe … .",
    "sn14.18:2": "Etarahipi kho, bhikkhave, paccuppannaṁ addhānaṁ dhātusova sattā saṁsandanti samenti. Assaddhā assaddhehi saddhiṁ saṁsandanti samenti; ahirikā ahirikehi saddhiṁ saṁsandanti samenti, duppaññā duppaññehi saddhiṁ saṁsandanti samenti; saddhā saddhehi saddhiṁ saṁsandanti samenti; hirimanā hirimanehi saddhiṁ saṁsandanti samenti; paññavanto paññavantehi saddhiṁ saṁsandanti samentīti.",
    "sn14.18:3": "Dhātusova, bhikkhave, sattā saṁsandanti samenti. Assaddhā assaddhehi saddhiṁ saṁsandanti samenti; anottappino anottappīhi saddhiṁ saṁsandanti samenti; duppaññā duppaññehi saddhiṁ saṁsandanti samenti; saddhā saddhehi saddhiṁ saṁsandanti samenti; ottappino ottappīhi saddhiṁ saṁsandanti samenti; paññavanto paññavantehi saddhiṁ saṁsandanti samenti … pe … paṭhamavāro viya vitthāretabbo.(2)",
    "sn14.18:4": "Dhātusova, bhikkhave … pe … assaddhā assaddhehi saddhiṁ saṁsandanti samenti; appassutā appassutehi saddhiṁ saṁsandanti samenti; duppaññā duppaññehi saddhiṁ saṁsandanti samenti; saddhā saddhehi saddhiṁ saṁsandanti samenti; bahussutā bahussutehi saddhiṁ saṁsandanti samenti, paññavanto paññavantehi saddhiṁ saṁsandanti samenti … pe … .(3)",
    "sn14.18:5": "Dhātusova, bhikkhave … pe … assaddhā assaddhehi saddhiṁ saṁsandanti samenti; kusītā kusītehi saddhiṁ saṁsandanti samenti; duppaññā duppaññehi saddhiṁ saṁsandanti samenti; saddhā saddhehi saddhiṁ saṁsandanti samenti; āraddhavīriyā āraddhavīriyehi saddhiṁ saṁsandanti samenti; paññavanto paññavantehi saddhiṁ saṁsandanti samenti … pe … .(4)",
    "sn14.18:6": "Dhātusova, bhikkhave … pe … assaddhā assaddhehi saddhiṁ saṁsandanti samenti; muṭṭhassatino muṭṭhassatīhi saddhiṁ saṁsandanti samenti; duppaññā duppaññehi saddhiṁ saṁsandanti samenti; saddhā saddhehi saddhiṁ saṁsandanti samenti; upaṭṭhitassatino upaṭṭhitassatīhi saddhiṁ saṁsandanti samenti; paññavanto paññavantehi saddhiṁ saṁsandanti samentī\"ti … pe … .(5)"
}