{
    "sn14.17:1": "Sāvatthiyaṁ vihārati. \"Dhātusova, bhikkhave, sattā saṁsandanti samenti. Assaddhā assaddhehi saddhiṁ saṁsandanti samenti; ahirikā ahirikehi saddhiṁ saṁsandanti samenti; anottappino anottappīhi saddhiṁ saṁsandanti samenti; appassutā appassutehi saddhiṁ saṁsandanti samenti; kusītā kusītehi saddhiṁ saṁsandanti samenti; muṭṭhassatino muṭṭhassatīhi saddhiṁ saṁsandanti samenti; duppaññā duppaññehi saddhiṁ saṁsandanti samenti.",
    "sn14.17:2": "Atītampi kho, bhikkhave, addhānaṁ dhātusova sattā saṁsandiṁsu samiṁsu. Assaddhā assaddhehi saddhiṁ saṁsandiṁsu samiṁsu; ahirikā ahirikehi saddhiṁ saṁsandiṁsu samiṁsu; anottappino anottappīhi saddhiṁ saṁsandiṁsu samiṁsu; appassutā appassutehi saddhiṁ saṁsandiṁsu samiṁsu; kusītā kusītehi saddhiṁ saṁsandiṁsu samiṁsu; muṭṭhassatino muṭṭhassatīhi saddhiṁ saṁsandiṁsu samiṁsu; duppaññā duppaññehi saddhiṁ saṁsandiṁsu samiṁsu.",
    "sn14.17:3": "Anāgatampi kho, bhikkhave, addhānaṁ dhātusova sattā saṁsandissanti samessanti. Assaddhā assaddhehi saddhiṁ saṁsandissanti samessanti; ahirikā ahirikehi saddhiṁ saṁsandissanti samessanti; anottappino anottappīhi saddhiṁ … pe … appassutā appassutehi saddhiṁ … pe … kusītā kusītehi saddhiṁ … pe … muṭṭhassatino muṭṭhassatīhi saddhiṁ … pe … duppaññā duppaññehi saddhiṁ saṁsandissanti samessanti.",
    "sn14.17:4": "Etarahipi kho, bhikkhave, paccuppannaṁ addhānaṁ dhātusova sattā saṁsandanti samenti. Assaddhā assaddhehi saddhiṁ saṁsandanti samenti; ahirikā ahirikehi saddhiṁ … pe … anottappino anottappīhi saddhiṁ … pe … appassutā appassutehi saddhiṁ … pe … kusītā kusītehi saddhiṁ … pe … muṭṭhassatino muṭṭhassatīhi saddhiṁ saṁsandanti samenti; duppaññā duppaññehi saddhiṁ saṁsandanti samenti.",
    "sn14.17:5": "Dhātusova, bhikkhave, sattā saṁsandanti samenti. Saddhā saddhehi saddhiṁ saṁsandanti samenti; hirimanā hirimanehi saddhiṁ saṁsandanti samenti; ottappino ottappīhi saddhiṁ saṁsandanti samenti; bahussutā bahussutehi saddhiṁ saṁsandanti samenti; āraddhavīriyā āraddhavīriyehi saddhiṁ saṁsandanti samenti; upaṭṭhitassatino upaṭṭhitassatīhi saddhiṁ saṁsandanti samenti; paññavanto paññavantehi saddhiṁ saṁsandanti samenti. Atītampi kho, bhikkhave, addhānaṁ … pe … anāgatampi kho, bhikkhave … pe … etarahipi kho, bhikkhave, paccuppannaṁ addhānaṁ dhātusova sattā saṁsandanti samenti. Saddhā saddhehi saddhiṁ … pe … paññavanto paññavantehi saddhiṁ saṁsandanti samentī\"ti."
}