{
    "sn16.13:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā sāvatthiyaṁ vihārati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā mahākassapo bhagavantaṁ etadavoca:",
    "sn16.13:2": "Seyyathāpi, kassapa, na tāva jātarūpassa antaradhānaṁ hoti yāva na jātarūpappatirūpakaṁ loke uppajjati. Yato ca kho, kassapa, jātarūpappatirūpakaṁ loke uppajjati, atha kho jātarūpassa antaradhānaṁ hoti. Evameva kho, kassapa, na tāva saddhammassa antaradhānaṁ hoti yāva na saddhammappatirūpakaṁ loke uppajjati. Yato ca kho, kassapa, saddhammappatirūpakaṁ loke uppajjati, atha saddhammassa antaradhānaṁ hoti.",
    "sn16.13:3": "Na kho, kassapa, pathavīdhātu saddhammaṁ antaradhāpeti, na āpodhātu saddhammaṁ antaradhāpeti, na tejodhātu saddhammaṁ antaradhāpeti, na vāyodhātu saddhammaṁ antaradhāpeti; atha kho idheva te uppajjanti moghapurisā ye imaṁ saddhammaṁ antaradhāpenti.",
    "sn16.13:4": "Pañca khome, kassapa, okkamaniyā dhammā saddhammassa sammosāya antaradhānāya saṁvattanti. Katame pañca? Idha, kassapa, bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari agāravā vihāranti appatissā, dhamme agāravā vihāranti appatissā, saṅghe agāravā vihāranti appatissā, sikkhāya agāravā vihāranti appatissā, samādhismiṁ agāravā vihāranti appatissā – ime kho, kassapa, pañca okkamaniyā dhammā saddhammassa sammosāya antaradhānāya saṁvattanti.",
    "sn16.13:5": "Pañca khome, kassapa, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṁvattanti. Katame pañca? Idha, kassapa, bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari sagāravā vihāranti sappatissā, dhamme sagāravā vihāranti sappatissā, saṅghe sagāravā vihāranti sappatissā, sikkhāya sagāravā vihāranti sappatissā, samādhismiṁ sagāravā vihāranti sappatissā – ime kho, kassapa, pañca dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṁvattantī\"ti.",
    "sn16.13:6": "Santuṭṭhañca anottappī,candūpamaṁ kulūpakaṁ;Jiṇṇaṁ tayo ca ovādā,jhānābhiññā upassayaṁ;Cīvaraṁ paraṁmaraṇaṁ,saddhammappatirūpakanti."
}