{
    "sn16.3:1": "Sāvatthiyaṁ vihārati. \"Candūpamā, bhikkhave, kulāni upasaṅkamatha – apakasseva kāyaṁ, apakassa cittaṁ, niccanavakā kulesu appagabbhā. Seyyathāpi, bhikkhave, puriso jarudapānaṁ vā olokeyya pabbatavisamaṁ vā nadīviduggaṁ vā – apakasseva kāyaṁ, apakassa cittaṁ; evameva kho, bhikkhave, candūpamā kulāni upasaṅkamatha – apakasseva kāyaṁ, apakassa cittaṁ, niccanavakā kulesu appagabbhā.",
    "sn16.3:2": "Kassapo, bhikkhave, candūpamo kulāni upasaṅkamati – apakasseva kāyaṁ, apakassa cittaṁ, niccanavako kulesu appagabbho. Taṁ kiṁ maññatha, bhikkhave, kathaṁrūpo bhikkhu arahati kulāni upasaṅkamitun\"ti?",
    "sn16.3:3": "Atha kho bhagavā ākāse pāṇiṁ cālesi. \"Seyyathāpi, bhikkhave, ayaṁ ākāse pāṇi na sajjati na gayhati na bajjhati; evameva kho, bhikkhave, yassa kassaci bhikkhuno kulāni upasaṅkamato kulesu cittaṁ na sajjati na gayhati na bajjhati: ‘labhantu lābhakāmā, puññakāmā karontu puññānī’ti; yathāsakena lābhena attamano hoti sumano, evaṁ paresaṁ lābhena attamano hoti sumano; evarūpo kho, bhikkhave, bhikkhu arahati kulāni upasaṅkamituṁ.",
    "sn16.3:4": "Kassapassa, bhikkhave, kulāni upasaṅkamato kulesu cittaṁ na sajjati na gayhati na bajjhati: ‘labhantu lābhakāmā, puññakāmā karontu puññānī’ti; yathāsakena lābhena attamano hoti sumano; evaṁ paresaṁ lābhena attamano hoti sumano.",
    "sn16.3:5": "Taṁ kiṁ maññatha, bhikkhave, kathaṁrūpassa bhikkhuno aparisuddhā dhammadesanā hoti, kathaṁrūpassa bhikkhuno parisuddhā dhammadesanā hotī\"ti?",
    "sn16.3:6": "\"Yo hi koci, bhikkhave, bhikkhu evaṁcitto paresaṁ dhammaṁ deseti: ‘aho vata me dhammaṁ suṇeyyuṁ, sutvā ca pana dhammaṁ pasīdeyyuṁ, pasannā ca me pasannākāraṁ kareyyun’ti; evarūpassa kho, bhikkhave, bhikkhuno aparisuddhā dhammadesanā hoti.",
    "sn16.3:7": "Yo ca kho, bhikkhave, bhikkhu evaṁcitto paresaṁ dhammaṁ deseti: ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhīti. Aho vata me dhammaṁ suṇeyyuṁ, sutvā ca pana dhammaṁ ājāneyyuṁ, ājānitvā ca pana tathattāya paṭipajjeyyun’ti. Iti dhammasudhammataṁ paṭicca paresaṁ dhammaṁ deseti, kāruññaṁ paṭicca anuddayaṁ paṭicca anukampāṁ upādāya paresaṁ dhammaṁ deseti. Evarūpassa kho, bhikkhave, bhikkhuno parisuddhā dhammadesanā hoti.",
    "sn16.3:8": "Kassapo, bhikkhave, evaṁcitto paresaṁ dhammaṁ deseti: ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhīti. Aho vata me dhammaṁ suṇeyyuṁ, sutvā ca pana dhammaṁ ājāneyyuṁ, ājānitvā ca pana tathattāya paṭipajjeyyun’ti. Iti dhammasudhammataṁ paṭicca paresaṁ dhammaṁ deseti, kāruññaṁ paṭicca anuddayaṁ paṭicca anukampāṁ upādāya paresaṁ dhammaṁ deseti."
}