{
    "sn16.11:1": "Ekaṁ samayaṁ āyasmā mahākassapo rājagahe vihārati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā ānando dakkhiṇagirismiṁ cārikaṁ carati mahatā bhikkhusaṅghena saddhiṁ.",
    "sn16.11:2": "Tena kho pana samayena āyasmato ānandassa tiṁsamattā saddhivihārino bhikkhū sikkhaṁ paccakkhāya hīnāyāvattā bhavanti yebhuyyena kumārabhūtā.",
    "sn16.11:3": "\"Tayo kho, bhante kassapa, atthavase paṭicca bhagavatā kulesu tikabhojanaṁ paññattaṁ – dummaṅkūnaṁ puggalānaṁ niggahāya pesalānaṁ bhikkhūnaṁ phāsuvihārāya, mā pāpicchā pakkhaṁ nissāya saṅghaṁ bhindeyyuṁ, kulānuddayatāya ca. Ime kho, bhante kassapa, tayo atthavase paṭicca bhagavatā kulesu tikabhojanaṁ paññattan\"ti.",
    "sn16.11:4": "\"Atha kiñcarahi tvaṁ, āvuso Ānanda, imehi navehi bhikkhūhi indriyesu aguttadvārehi bhojane amattaññūhi jāgariyaṁ ananuyuttehi saddhiṁ cārikaṁ carasi? Sassaghātaṁ maññe carasi, kulūpaghātaṁ maññe carasi. Olujjati kho te, āvuso Ānanda, parisā; palujjanti kho te, āvuso, navappāyā. Na vāyaṁ kumārako mattamaññāsī\"ti.",
    "sn16.11:5": "\"Api me, bhante kassapa, sirasmiṁ palitāni jātāni. Atha ca pana mayaṁ ajjāpi āyasmato mahākassapassa kumārakavādā na muccāmā\"ti.",
    "sn16.11:6": "Assosi kho thullanandā bhikkhunī: \"ayyena kira mahākassapena ayyo ānando vedehamuni kumārakavādena apasādito\"ti.",
    "sn16.11:7": "Atha kho thullanandā bhikkhunī anattamanā anattamanavācaṁ nicchāresi: \"Kiṁ pana ayyo mahākassapo aññatitthiyapubbo samāno ayyaṁ Ānandaṁ vedehamuniṁ kumārakavādena apasādetabbaṁ maññatī\"ti. Assosi kho āyasmā mahākassapo thullanandāya bhikkhuniyā imaṁ vācaṁ bhāsamānāya.",
    "sn16.11:8": "Atha kho āyasmā mahākassapo āyasmantaṁ Ānandaṁ etadavoca: \"tagghāvuso Ānanda, thullanandāya bhikkhuniyā sahasā appaṭisaṅkhā vācā bhāsitā. Yatvāhaṁ, āvuso, kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajito, nābhijānāmi aññaṁ satthāraṁ uddisitā, aññatra tena bhagavatā arahatā sammāsambuddhena.",
    "sn16.11:9": "So evaṁ pabbajito samāno addhānamaggappaṭipanno addasaṁ bhagavantaṁ antarā ca rājagahaṁ antarā ca nāḷandaṁ bahuputte cetiye nisinnaṁ. Disvāna me etadahosi: ‘satthārañca vatāhaṁ passeyyaṁ, bhagavantameva passeyyaṁ; sugatañca vatāhaṁ passeyyaṁ, bhagavantameva passeyyaṁ; sammāsambuddhañca vatāhaṁ passeyyaṁ; bhagavantameva passeyyan’ti. So khvāhaṁ, āvuso, tattheva bhagavato pādesu sirasā nipatitvā bhagavantaṁ etadavocaṁ: ‘satthā me, bhante, bhagavā, sāvakohamasmi; satthā me, bhante, bhagavā, sāvakohamasmī’ti.",
    "sn16.11:10": "Tasmātiha te, kassapa, evaṁ sikkhitabbaṁ: \"tibbaṁ me hirottappaṁ paccupaṭṭhitaṁ bhavissati theresu navesu majjhimesū\"ti. Evañhi te, kassapa, sikkhitabbaṁ.",
    "sn16.11:11": "Tasmātiha te, kassapa, evaṁ sikkhitabbaṁ: \"yaṁ kiñci dhammaṁ suṇissāmi kusalūpasaṁhitaṁ sabbaṁ taṁ aṭṭhiṁ katvā manasi karitvā sabbacetasā samannāharitvā ohitasoto dhammaṁ suṇissāmī\"ti. Evañhi te, kassapa, sikkhitabbaṁ.",
    "sn16.11:12": "Tasmātiha te, kassapa, evaṁ sikkhitabbaṁ: \"sātasahagatā ca me kāyagatāsati na vijahissatī\"ti. Evañhi te, kassapa, sikkhitabbanti’.",
    "sn16.11:13": "Atha kho maṁ, āvuso, bhagavā iminā ovādena ovaditvā uṭṭhāyāsanā pakkāmi. Sattāhameva khvāhaṁ, āvuso, saraṇo raṭṭhapiṇḍaṁ bhuñjiṁ aṭṭhamiyā aññā udapādi.",
    "sn16.11:14": "Atha kho, āvuso, bhagavā maggā okkamma yena aññataraṁ rukkhamūlaṁ tenupasaṅkami. Atha khvāhaṁ, āvuso, paṭapilotikānaṁ saṅghāṭiṁ catugguṇaṁ paññapetvā bhagavantaṁ etadavocaṁ: ‘idha, bhante, bhagavā nisīdatu, yaṁ mamassa dīgharattaṁ hitāya sukhāyā’ti. Nisīdi kho, āvuso, bhagavā paññatte āsane. Nisajja kho maṁ, āvuso, bhagavā etadavoca: ‘mudukā kho tyāyaṁ, kassapa, paṭapilotikānaṁ saṅghāṭī’ti. ‘Paṭiggaṇhātu me, bhante, bhagavā paṭapilotikānaṁ saṅghāṭiṁ anukampāṁ upādāyā’ti. ‘Dhāressasi pana me tvaṁ, kassapa, sāṇāni paṁsukūlāni nibbasanānī’ti. ‘Dhāressāmahaṁ, bhante, bhagavato sāṇāni paṁsukūlāni nibbasanānī’ti. So khvāhaṁ, āvuso, paṭapilotikānaṁ saṅghāṭiṁ bhagavato pādāsiṁ. Ahaṁ pana bhagavato sāṇāni paṁsukūlāni nibbasanāni paṭipajjiṁ.",
    "sn16.11:15": "Yañhi taṁ, āvuso, sammā vadamāno vadeyya: ‘bhagavato putto oraso mukhato jāto dhammajo dhammanimmito dhammadāyādo, paṭiggahitāni sāṇāni paṁsukūlāni nibbasanānī’ti, mamaṁ taṁ sammā vadamāno vadeyya: ‘bhagavato putto oraso mukhato jāto dhammajo dhammanimmito dhammadāyādo, paṭiggahitāni sāṇāni paṁsukūlāni nibbasanānī’ti.",
    "sn16.11:16": "Ahaṁ kho, āvuso, yāvade ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharāmi. Ahaṁ kho, āvuso, yāvade ākaṅkhāmi … pe … (navannaṁ anupubbavihārasamāpattīnaṁ pañcannañca abhiññānaṁ evaṁ vitthāro veditabbo.)",
    "sn16.11:17": "Ahaṁ kho, āvuso, āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharāmi;",
    "sn16.11:18": "Cavittha ca pana thullanandā bhikkhunī brahmacariyamhāti."
}