{
    "sn16.2:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ āyasmā ca mahākassapo āyasmā ca sāriputto bārāṇasiyaṁ vihāranti isipatane migadāye. Atha kho āyasmā sāriputto sāyanhasamayaṁ paṭisallānā vuṭṭhito yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmatā mahākassapena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā sāriputto āyasmantaṁ mahākassapaṁ etadavoca:",
    "sn16.2:2": "\"Kittāvatā nu kho, āvuso, anātāpī hoti anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya; kittāvatā ca panāvuso, ātāpī hoti ottappī bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā\"ti? \"Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṁvatteyyun’ti na ātappaṁ karoti, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṁvatteyyun’ti na ātappaṁ karoti, ‘anuppannā me kusalā dhammā nuppajjamānā anatthāya saṁvatteyyun’ti na ātappaṁ karoti, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṁvatteyyun’ti na ātappaṁ karoti. Evaṁ kho, āvuso, anātāpī hoti.",
    "sn16.2:3": "Kathañcāvuso, anottappī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṁvatteyyun’ti na ottappati, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṁvatteyyun’ti na ottappati, ‘anuppannā me kusalā dhammā nuppajjamānā anatthāya saṁvatteyyun’ti na ottappati, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṁvatteyyun’ti na ottappati.",
    "sn16.2:4": "Kathañcāvuso, ātāpī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṁvatteyyun’ti ātappaṁ karoti, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṁvatteyyun’ti ātappaṁ karoti, anuppannā me kusalā dhammā … pe … ātappaṁ karoti. Evaṁ kho, āvuso, ātāpī hoti.",
    "sn16.2:5": "Kathañcāvuso, ottappī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṁvatteyyun’ti ottappati, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṁvatteyyun’ti ottappati, ‘anuppannā me kusalā dhammā anuppajjamānā anatthāya saṁvatteyyun’ti ottappati, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṁvatteyyun’ti ottappati."
}