{
    "sn16.10:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ āyasmā mahākassapo sāvatthiyaṁ vihārati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ānando pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahākassapaṁ etadavoca: \"āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā\"ti.",
    "sn16.10:2": "Atha kho āyasmā mahākassapo pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya āyasmatā ānandena pacchāsamaṇena yena aññataro bhikkhunupassayo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho sambahulā bhikkhuniyo yenāyasmā mahākassapo tenupasaṅkamiṁsu; upasaṅkamitvā āyasmantaṁ mahākassapaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho tā bhikkhuniyo āyasmā mahākassapo dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṁsesi. Atha kho āyasmā mahākassapo tā bhikkhuniyo dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṁsetvā uṭṭhāyāsanā pakkāmi.",
    "sn16.10:3": "Atha kho thullatissā bhikkhunī anattamanā anattamanavācaṁ nicchāresi: \"Kiṁ pana ayyo mahākassapo, ayyassa ānandassa vedehamunino sammukhā dhammaṁ bhāsitabbaṁ maññati? Seyyathāpi nāma sūcivāṇijako sūcikārassa santike sūciṁ vikketabbaṁ maññeyya; evameva ayyo mahākassapo ayyassa ānandassa vedehamunino sammukhā dhammaṁ bhāsitabbaṁ maññatī\"ti.",
    "sn16.10:4": "Assosi kho āyasmā mahākassapo thullatissāya bhikkhuniyā imaṁ vācaṁ bhāsamānāya. Atha kho āyasmā mahākassapo āyasmantaṁ Ānandaṁ etadavoca: \"Kiṁ nu kho, āvuso Ānanda, ahaṁ sūcivāṇijako, tvaṁ sūcikāro; udāhu ahaṁ sūcikāro, tvaṁ sūcivāṇijako\"ti?",
    "sn16.10:5": "Taṁ kiṁ maññasi, āvuso Ānanda, api nu tvaṁ bhagavato sammukhā bhikkhusaṅghe upanīto: ‘Ahaṁ, bhikkhave, yāvade ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharāmi. Ānandopi, bhikkhave, yāvade ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja vihāratī’\"ti?",
    "sn16.10:6": "\"Ahaṁ kho, āvuso, bhagavato sammukhā bhikkhusaṅghe upanīto: ‘Ahaṁ, bhikkhave, yāvade ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharāmi. Kassapopi, bhikkhave, yāvade ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi … pe … paṭhamaṁ jhānaṁ upasampajja vihāratī’ti … pe … . (Navannaṁ anupubbavihārasamāpattīnaṁ pañcannañca abhiññānaṁ evaṁ vitthāro veditabbo.)",
    "sn16.10:7": "Taṁ kiṁ maññasi, āvuso Ānanda, api nu tvaṁ bhagavato sammukhā bhikkhusaṅghe upanīto: ‘Ahaṁ, bhikkhave, āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharāmi. Ānandopi, bhikkhave, āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāratī’\"ti? \"No hetaṁ, bhante\".",
    "sn16.10:8": "\"Ahaṁ kho, āvuso, bhagavato sammukhā bhikkhusaṅghe upanīto: ‘Ahaṁ, bhikkhave, āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharāmi. Kassapopi, bhikkhave, āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāratī’ti.",
    "sn16.10:9": "Sattaratanaṁ vā, āvuso, nāgaṁ aḍḍhaṭṭhamaratanaṁ vā tālapattikāya chādetabbaṁ maññeyya, yo me cha abhiññā chādetabbaṁ maññeyyā\"ti.",
    "sn16.10:10": "Cavittha ca pana thullatissā bhikkhunī brahmacariyamhāti."
}