{
    "sn16.5:1": "Evaṁ me sutaṁ … rājagahe veḷuvane. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho āyasmantaṁ mahākassapaṁ bhagavā etadavoca: \"jiṇṇosi dāni tvaṁ, kassapa, garukāni ca te imāni sāṇāni paṁsukūlāni nibbasanāni. Tasmātiha tvaṁ, kassapa, gahapatāni ceva cīvarāni dhārehi, nimantanāni ca bhuñjāhi, mama ca santike viharāhī\"ti.",
    "sn16.5:2": "\"Ahaṁ kho, bhante, dīgharattaṁ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva piṇḍapātikattassa ca vaṇṇavādī, paṁsukūliko ceva paṁsukūlikattassa ca vaṇṇavādī, tecīvariko ceva tecīvarikattassa ca vaṇṇavādī, appiccho ceva appicchatāya ca vaṇṇavādī, santuṭṭho ceva santuṭṭhiyā ca vaṇṇavādī, pavivitto ceva pavivekassa ca vaṇṇavādī, asaṁsaṭṭho ceva asaṁsaggassa ca vaṇṇavādī, āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī\"ti.",
    "sn16.5:3": "\"Kiṁ pana tvaṁ, kassapa, atthavasaṁ sampassamāno dīgharattaṁ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva … pe … paṁsukūliko ceva … tecīvariko ceva … appiccho ceva … santuṭṭho ceva … pavivitto ceva … asaṁsaṭṭho ceva … āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī\"ti?",
    "sn16.5:4": "\"Dve khvāhaṁ, bhante, atthavase sampassamāno dīgharattaṁ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva … pe … paṁsukūliko ceva … tecīvariko ceva … appiccho ceva … santuṭṭho ceva … pavivitto ceva … asaṁsaṭṭho ceva … āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī.",
    "sn16.5:5": "Attano ca diṭṭhadhammasukhavihāraṁ sampassamāno, pacchimañca janataṁ anukampamāno: ‘appeva nāma pacchimā janatā diṭṭhānugatiṁ āpajjeyyuṁ. Ye kira te ahesuṁ buddhānubuddhasāvakā te dīgharattaṁ āraññikā ceva ahesuṁ āraññikattassa ca vaṇṇavādino … pe … piṇḍapātikā ceva ahesuṁ … pe … paṁsukūlikā ceva ahesuṁ … tecīvarikā ceva ahesuṁ … appicchā ceva ahesuṁ … santuṭṭhā ceva ahesuṁ … pavivittā ceva ahesuṁ … asaṁsaṭṭhā ceva ahesuṁ … āraddhavīriyā ceva ahesuṁ vīriyārambhassa ca vaṇṇavādino’ti. Te tathattāya paṭipajjissanti, tesaṁ taṁ bhavissati dīgharattaṁ hitāya sukhāya.",
    "sn16.5:6": "Ime khvāhaṁ, bhante, dve atthavase sampassamāno dīgharattaṁ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva … pe … paṁsukūliko ceva … tecīvariko ceva … appiccho ceva … santuṭṭho ceva … pavivitto ceva … asaṁsaṭṭho ceva … āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī\"ti.",
    "sn16.5:7": "\"Sādhu sādhu, kassapa. Bahujanahitāya kira tvaṁ, kassapa, paṭipanno bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṁ. Tasmātiha tvaṁ, kassapa, sāṇāni ceva paṁsukūlāni dhārehi nibbasanāni, piṇḍāya ca carāhi, araññe ca viharāhī\"ti."
}