{
    "sn2.29:1": "Sāvatthinidānaṁ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho āyasmantaṁ Ānandaṁ bhagavā etadavoca: \"tuyhampi no, Ānanda, sāriputto ruccatī\"ti?",
    "sn2.29:2": "\"Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyya? Paṇḍito, bhante, āyasmā sāriputto. Mahāpañño, bhante, āyasmā sāriputto. Puthupañño, bhante, āyasmā sāriputto. Hāsapañño, bhante, āyasmā sāriputto. Javanapañño, bhante, āyasmā sāriputto. Tikkhapañño, bhante, āyasmā sāriputto. Nibbedhikapañño, bhante, āyasmā sāriputto. Appiccho, bhante, āyasmā sāriputto. Santuṭṭho, bhante, āyasmā sāriputto. Pavivitto, bhante, āyasmā sāriputto. Asaṁsaṭṭho, bhante, āyasmā sāriputto. Āraddhavīriyo, bhante, āyasmā sāriputto. Vattā, bhante, āyasmā sāriputto. Vacanakkhamo, bhante, āyasmā sāriputto. Codako, bhante, āyasmā sāriputto. Pāpagarahī, bhante, āyasmā sāriputto. Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyyā\"ti?",
    "sn2.29:3": "\"Evametaṁ, Ānanda, evametaṁ, Ānanda. Kassa hi nāma, Ānanda, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa sāriputto na rucceyya? Paṇḍito, Ānanda, sāriputto. Mahāpañño, Ānanda, sāriputto. Puthupañño, Ānanda, sāriputto. Hāsapañño, Ānanda, sāriputto. Javanapañño, Ānanda, sāriputto. Tikkhapañño, Ānanda, sāriputto. Nibbedhikapañño, Ānanda, sāriputto. Appiccho, Ānanda, sāriputto. Santuṭṭho, Ānanda, sāriputto. Pavivitto, Ānanda, sāriputto. Asaṁsaṭṭho, Ānanda, sāriputto. Āraddhavīriyo, Ānanda, sāriputto. Vattā, Ānanda, sāriputto. Vacanakkhamo, Ānanda, sāriputto. Codako, Ānanda, sāriputto. Pāpagarahī, Ānanda, sāriputto. Kassa hi nāma, Ānanda, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa sāriputto na rucceyyā\"ti?",
    "sn2.29:4": "Atha kho susimo devaputto āyasmato sāriputtassa vaṇṇe bhaññamāne mahatiyā devaputtaparisāya parivuto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho susimo devaputto bhagavantaṁ etadavoca:",
    "sn2.29:5": "\"Evametaṁ, bhagavā, evametaṁ, sugata. Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyya? Paṇḍito, bhante, āyasmā sāriputto. Mahāpañño, bhante, puthupañño, bhante, hāsapañño, bhante, javanapañño, bhante, tikkhapañño, bhante, nibbedhikapañño, bhante, appiccho, bhante, santuṭṭho, bhante, pavivitto, bhante, asaṁsaṭṭho, bhante, āraddhavīriyo, bhante, vattā, bhante, vacanakkhamo, bhante, codako, bhante, pāpagarahī, bhante, āyasmā sāriputto. Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyya?",
    "sn2.29:6": "Ahampi hi, bhante, yaññadeva devaputtaparisaṁ upasaṅkamiṁ, etadeva bahulaṁ saddaṁ suṇāmi: ‘paṇḍito āyasmā sāriputto; mahāpañño āyasmā, puthupañño āyasmā, hāsapañño āyasmā, javanapañño āyasmā, tikkhapañño āyasmā, nibbedhikapañño āyasmā, appiccho āyasmā, santuṭṭho āyasmā, pavivitto āyasmā, asaṁsaṭṭho āyasmā, āraddhavīriyo āyasmā, vattā āyasmā, vacanakkhamo āyasmā, codako āyasmā, pāpagarahī āyasmā sāriputto’ti. Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyyā\"ti?",
    "sn2.29:7": "Atha kho susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṁseti.",
    "sn2.29:8": "Seyyathāpi nāma maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato paṇḍukambale nikkhitto bhāsate ca tapate ca virocati ca; evamevaṁ susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṁseti.",
    "sn2.29:9": "Seyyathāpi nāma nikkhaṁ jambonadaṁ dakkhakammāraputtaukkāmukhasukusalasampahaṭṭhaṁ paṇḍukambale nikkhittaṁ bhāsate ca tapate ca virocati ca; evamevaṁ susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṁseti.",
    "sn2.29:10": "Seyyathāpi nāma saradasamaye viddhe vigatavalāhake deve rattiyā paccūsasamayaṁ osadhitārakā bhāsate ca tapate ca virocati ca; evamevaṁ susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṁseti.",
    "sn2.29:11": "Seyyathāpi nāma saradasamaye viddhe vigatavalāhake deve ādicco nabhaṁ abbhussakkamāno sabbaṁ ākāsagataṁ tamagataṁ abhivihacca bhāsate ca tapate ca virocati ca; evamevaṁ susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṁseti.",
    "sn2.29:12": "Atha kho susimo devaputto āyasmantaṁ sāriputtaṁ ārabbha bhagavato santike imaṁ gāthaṁ abhāsi:",
    "sn2.29:13": "\"Paṇḍitoti samaññāto,sāriputto akodhano;Appiccho sorato danto,satthuvaṇṇābhato isī\"ti.",
    "sn2.29:14": "Atha kho bhagavā āyasmantaṁ sāriputtaṁ ārabbha susimaṁ devaputtaṁ gāthāya paccabhāsi:",
    "sn2.29:15": "\"Paṇḍitoti samaññāto,sāriputto akodhano;Appiccho sorato danto,kālaṁ kaṅkhati sudanto\"ti."
}