{
    "sn22.94:1": "Sāvatthinidānaṁ. \"Nāhaṁ, bhikkhave, lokena vivadāmi, lokova mayā vivadati. Na, bhikkhave, dhammavādī kenaci lokasmiṁ vivadati. Yaṁ, bhikkhave, natthisammataṁ loke paṇḍitānaṁ, ahampi taṁ ‘natthī’ti vadāmi. Yaṁ, bhikkhave, atthisammataṁ loke paṇḍitānaṁ, ahampi taṁ ‘atthī’ti vadāmi.",
    "sn22.94:2": "Kiñca, bhikkhave, natthisammataṁ loke paṇḍitānaṁ, yamahaṁ ‘natthī’ti vadāmi? Rūpaṁ, bhikkhave, niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ natthisammataṁ loke paṇḍitānaṁ; ahampi taṁ ‘natthī’ti vadāmi. Vedanā … saññā … saṅkhārā … viññāṇaṁ niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ natthisammataṁ loke paṇḍitānaṁ; ahampi taṁ ‘natthī’ti vadāmi.",
    "sn22.94:3": "Kiñca, bhikkhave, atthisammataṁ loke paṇḍitānaṁ, yamahaṁ ‘atthī’ti vadāmi? Rūpaṁ, bhikkhave, aniccaṁ dukkhaṁ vipariṇāmadhammaṁ atthisammataṁ loke paṇḍitānaṁ; ahampi taṁ ‘atthī’ti vadāmi. Vedanā aniccā … pe … viññāṇaṁ aniccaṁ dukkhaṁ vipariṇāmadhammaṁ atthisammataṁ loke paṇḍitānaṁ; ahampi taṁ ‘atthī’ti vadāmi. Idaṁ kho, bhikkhave, atthisammataṁ loke paṇḍitānaṁ; ahampi taṁ ‘atthī’ti vadāmi.",
    "sn22.94:4": "Atthi, bhikkhave, loke lokadhammo, taṁ tathāgato abhisambujjhati abhisameti; abhisambujjhitvā abhisametvā taṁ ācikkhati deseti paññapeti paṭṭhapeti vivarati vibhajati uttānīkaroti.",
    "sn22.94:5": "Kiñca, bhikkhave, loke lokadhammo, taṁ tathāgato abhisambujjhati abhisameti, abhisambujjhitvā abhisametvā ācikkhati deseti paññapeti paṭṭhapeti vivarati vibhajati uttānīkaroti?",
    "sn22.94:6": "Yo, bhikkhave, tathāgatena evaṁ ācikkhiyamāne desiyamāne paññapiyamāne paṭṭhapiyamāne vivariyamāne vibhajiyamāne uttānīkariyamāne na jānāti na passati tamahaṁ, bhikkhave, bālaṁ puthujjanaṁ andhaṁ acakkhukaṁ ajānantaṁ apassantaṁ kinti karomi.",
    "sn22.94:7": "Yo, bhikkhave, tathāgatena evaṁ ācikkhiyamāne desiyamāne paññapiyamāne paṭṭhapiyamāne vivariyamāne vibhajiyamāne uttānīkariyamāne na jānāti na passati tamahaṁ, bhikkhave, bālaṁ puthujjanaṁ andhaṁ acakkhukaṁ ajānantaṁ apassantaṁ kinti karomi.",
    "sn22.94:8": "Seyyathāpi, bhikkhave, uppalaṁ vā padumaṁ vā puṇḍarīkaṁ vā udake jātaṁ udake saṁvaḍḍhaṁ udakā accuggamma ṭhāti anupalittaṁ udakena; evameva kho, bhikkhave, tathāgato loke jāto loke saṁvaḍḍho lokaṁ abhibhuyya vihārati anupalitto lokenā\"ti."
}