{
    "sn22.84:1": "Sāvatthinidānaṁ. Tena kho pana samayena āyasmā tisso bhagavato pitucchāputto sambahulānaṁ bhikkhūnaṁ evamāroceti: \"api me, āvuso, madhurakajāto viya kāyo; disāpi me na pakkhāyanti; dhammāpi maṁ na paṭibhanti; thinamiddhañca me cittaṁ pariyādāya tiṭṭhati; anabhirato ca brahmacariyaṁ carāmi; hoti ca me dhammesu vicikicchā\"ti.",
    "sn22.84:2": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ: \"Āyasmā, bhante, tisso bhagavato pitucchāputto sambahulānaṁ bhikkhūnaṁ evamāroceti: ‘api me, āvuso, madhurakajāto viya kāyo; disāpi me na pakkhāyanti; dhammāpi maṁ na paṭibhanti; thinamiddhañca me cittaṁ pariyādāya tiṭṭhati; anabhirato ca brahmacariyaṁ carāmi; hoti ca me dhammesu vicikicchā’\"ti.",
    "sn22.84:3": "Atha kho bhagavā aññataraṁ bhikkhuṁ āmantesi: \"ehi tvaṁ, bhikkhu, mama vacanena tissaṁ bhikkhuṁ āmantehī\"ti.",
    "sn22.84:4": "\"Sādhu sādhu, tissa. Evañhetaṁ, tissa, hoti. Yathā taṁ rūpe avigatarāgassa … vedanāya … saññāya … saṅkhāresu avigatarāgassa … pe … tesaṁ saṅkhārānaṁ vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā\"ti?",
    "sn22.84:5": "\"Sādhu sādhu, tissa. Evañhetaṁ, tissa, hoti. Yathā taṁ saṅkhāresu anigatarāgassa, viññāṇe avigatarāgassa avigatacchandassa avigatapemassa avigatapipāsassa avigatapariḷāhassa avigātataṇhassa, tassa viññāṇassa vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā\"ti?",
    "sn22.84:6": "\"Sādhu sādhu, tissa. Evañhetaṁ, tissa, hoti. Yathā taṁ viññāṇe avigatarāgassa. Taṁ kiṁ maññasi, tissa, rūpe vigatarāgassa vigatacchandassa vigatapemassa vigatapipāsassa vigatapariḷāhassa vigātataṇhassa, tassa rūpassa vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā\"ti?",
    "sn22.84:7": "\"Sādhu sādhu, tissa. Evañhetaṁ, tissa, hoti. Yathā taṁ rūpe vigatarāgassa … vedanāya … saññāya … saṅkhāresu vigatarāgassa … viññāṇe vigatarāgassa vigatacchandassa vigatapemassa vigatapipāsassa vigatapariḷāhassa vigātataṇhassa tassa viññāṇassa vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā\"ti?",
    "sn22.84:8": "\"Sādhu sādhu, tissa. Evañhetaṁ, tissa, hoti. Yathā taṁ viññāṇe vigatarāgassa. Taṁ kiṁ maññasi, tissa, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Vedanā … saññā … saṅkhārā … viññāṇaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Tasmātiha … pe … evaṁ passaṁ … pe … nāparaṁ itthattāyāti pajānāti.",
    "sn22.84:9": "Seyyathāpi, tissa, dve purisā – eko puriso amaggakusalo, eko puriso maggakusalo. Tamenaṁ so amaggakusalo puriso amuṁ maggakusalaṁ purisaṁ maggaṁ puccheyya. So evaṁ vadeyya: ‘ehi, bho purisa, ayaṁ maggo. Tena muhuttaṁ gaccha. Tena muhuttaṁ gantvā dakkhissasi dvedhāpathaṁ, tattha vāmaṁ muñcitvā dakkhiṇaṁ gaṇhāhi. Tena muhuttaṁ gaccha. Tena muhuttaṁ gantvā dakkhissasi tibbaṁ vanasaṇḍaṁ. Tena muhuttaṁ gaccha. Tena muhuttaṁ gantvā dakkhissasi mahantaṁ ninnaṁ pallalaṁ. Tena muhuttaṁ gaccha. Tena muhuttaṁ gantvā dakkhissasi sobbhaṁ papātaṁ. Tena muhuttaṁ gaccha. Tena muhuttaṁ gantvā dakkhissasi samaṁ bhūmibhāgaṁ ramaṇīyan’ti.",
    "sn22.84:10": "Upamā kho myāyaṁ, tissa, katā atthassa viññāpanāya. Ayaṁ cevettha attho: ‘puriso amaggakusalo’ti kho, tissa, puthujjanassetaṁ adhivacanaṁ. ‘Puriso maggakusalo’ti kho, tissa, tathāgatassetaṁ adhivacanaṁ arahato sammāsambuddhassa. ‘Dvedhāpatho’ti kho, tissa, vicikicchāyetaṁ adhivacanaṁ. ‘Vāmo maggo’ti kho, tissa, aṭṭhaṅgikassetaṁ micchāmaggassa adhivacanaṁ, seyyathidaṁ – micchādiṭṭhiyā … pe … micchāsamādhissa. ‘Dakkhiṇo maggo’ti kho, tissa, ariyassetaṁ aṭṭhaṅgikassa maggassa adhivacanaṁ, seyyathidaṁ – sammādiṭṭhiyā … pe … sammāsamādhissa. ‘Tibbo vanasaṇḍo’ti kho, tissa, avijjāyetaṁ adhivacanaṁ. ‘Mahantaṁ ninnaṁ pallalan’ti kho, tissa, kāmānametaṁ adhivacanaṁ. ‘Sobbho papāto’ti kho, tissa, kodhūpāyāsassetaṁ adhivacanaṁ. ‘Samo bhūmibhāgo ramaṇīyo’ti kho, tissa, nibbānassetaṁ adhivacanaṁ.",
    "sn22.84:11": "Idamavoca bhagavā. Attamano āyasmā tisso bhagavato bhāsitaṁ abhinandīti."
}