{
    "sn22.38:1": "Sāvatthinidānaṁ. Ekamantaṁ nisinnaṁ kho āyasmantaṁ Ānandaṁ bhagavā etadavoca:",
    "sn22.38:2": "\"Sace taṁ, Ānanda, evaṁ puccheyyuṁ: ‘katamesaṁ, āvuso Ānanda, dhammānaṁ uppādo paññāyittha, vayo paññāyittha, ṭhitassa aññathattaṁ paññāyittha? Katamesaṁ dhammānaṁ uppādo paññāyissati, vayo paññāyissati, ṭhitassa aññathattaṁ paññāyissati? Katamesaṁ dhammānaṁ uppādo paññāyati, vayo paññāyati, ṭhitassa aññathattaṁ paññāyatī’ti? Evaṁ puṭṭho tvaṁ, Ānanda, kinti byākareyyāsī\"ti?",
    "sn22.38:3": "Yaṁ kho, āvuso, rūpaṁ ajātaṁ apātubhūtaṁ; tassa uppādo paññāyissati, vayo paññāyissati, ṭhitassa aññathattaṁ paññāyissati. Yā vedanā ajātā apātubhūtā; tassā uppādo paññāyissati, vayo paññāyissati, ṭhitāya aññathattaṁ paññāyissati. Yā saññā … pe … ye saṅkhārā ajātā apātubhūtā; tesaṁ uppādo paññāyissati, vayo paññāyissati, ṭhitassa aññathattaṁ paññāyissati. Yaṁ viññāṇaṁ ajātaṁ apātubhūtaṁ; tassa uppādo paññāyissati, vayo paññāyissati, ṭhitassa aññathattaṁ paññāyissati. Imesaṁ kho, āvuso, dhammānaṁ uppādo paññāyissati, vayo paññāyissati, ṭhitassa aññathattaṁ paññāyissati.",
    "sn22.38:4": "Yaṁ kho, āvuso, rūpaṁ jātaṁ pātubhūtaṁ; tassa uppādo paññāyati, vayo paññāyati, ṭhitassa aññathattaṁ paññāyati. Yā vedanā jātā pātubhūtā … pe … yā saññā … ye saṅkhārā jātā pātubhūtā; tesaṁ uppādo paññāyati, vayo paññāyati, ṭhitassa aññathattaṁ paññāyati. Yaṁ viññāṇaṁ jātaṁ pātubhūtaṁ tassa uppādo paññāyati, vayo paññāyati, ṭhitassa aññathattaṁ paññāyati. Imesaṁ kho, āvuso, dhammānaṁ uppādo paññāyati, vayo paññāyati, ṭhitassa aññathattaṁ paññāyatī’ti.",
    "sn22.38:5": "\"Sādhu sādhu, Ānanda. Yaṁ kho, Ānanda, rūpaṁ atītaṁ niruddhaṁ vipariṇataṁ; tassa uppādo paññāyittha, vayo paññāyittha, ṭhitassa aññathattaṁ paññāyittha. Yā vedanā … yā saññā … ye saṅkhārā … yaṁ viññāṇaṁ atītaṁ niruddhaṁ vipariṇataṁ; tassa uppādo paññāyittha, vayo paññāyittha, ṭhitassa aññathattaṁ paññāyittha. Imesaṁ kho, Ānanda, dhammānaṁ uppādo paññāyittha, vayo paññāyittha, ṭhitassa aññathattaṁ paññāyittha.",
    "sn22.38:6": "Yaṁ kho, Ānanda, rūpaṁ ajātaṁ apātubhūtaṁ; tassa uppādo paññāyissati, vayo paññāyissati, ṭhitassa aññathattaṁ paññāyissati. Yā vedanā … yā saññā … ye saṅkhārā … yaṁ viññāṇaṁ ajātaṁ apātubhūtaṁ; tassa uppādo paññāyissati, vayo paññāyissati, ṭhitassa aññathattaṁ paññāyissati. Imesaṁ kho, Ānanda, dhammānaṁ uppādo paññāyissati, vayo paññāyissati, ṭhitassa aññathattaṁ paññāyissati.",
    "sn22.38:7": "Yaṁ kho, Ānanda, rūpaṁ jātaṁ pātubhūtaṁ; tassa uppādo paññāyati, vayo paññāyati, ṭhitassa aññathattaṁ paññāyati. Yā vedanā jātā pātubhūtā … yā saññā … ye saṅkhārā … yaṁ viññāṇaṁ jātaṁ pātubhūtaṁ; tassa uppādo paññāyati, vayo paññāyati, ṭhitassa aññathattaṁ paññāyati. Imesaṁ kho, Ānanda, dhammānaṁ uppādo paññāyati, vayo paññāyati, ṭhitassa aññathattaṁ paññāyatīti. Evaṁ puṭṭho tvaṁ, Ānanda, evaṁ byākareyyāsī\"ti."
}