{
    "sn22.3:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ āyasmā mahākaccāno avantīsu vihārati kuraraghare papāte pabbate. Atha kho hāliddikāni gahapati yenāyasmā mahākaccāno tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahākaccānaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho hāliddikāni gahapati āyasmantaṁ mahākaccānaṁ etadavoca:",
    "sn22.3:2": "‘Okaṁ pahāya aniketasārī,Gāme akubbaṁ muni santhavāni;Kāmehi ritto apurakkharāno,Kathaṁ na viggayha janena kayirā’ti.",
    "sn22.3:3": "Imassa nu kho, bhante, bhagavatā saṅkhittena bhāsitassa kathaṁ vitthārena attho daṭṭhabbo\"ti?",
    "sn22.3:4": "\"Rūpadhātu kho, gahapati, viññāṇassa oko. Rūpadhāturāgavinibandhañca pana viññāṇaṁ ‘okasārī’ti vuccati. Vedanādhātu kho, gahapati, viññāṇassa oko. Vedanādhāturāgavinibandhañca pana viññāṇaṁ ‘okasārī’ti vuccati. Saññādhātu kho, gahapati, viññāṇassa oko. Saññādhāturāgavinibandhañca pana viññāṇaṁ ‘okasārī’ti vuccati. Saṅkhāradhātu kho, gahapati, viññāṇassa oko. Saṅkhāradhāturāgavinibandhañca pana viññāṇaṁ ‘okasārī’ti vuccati. Evaṁ kho, gahapati, okasārī hoti.",
    "sn22.3:5": "Kathañca, gahapati, anokasārī hoti? Rūpadhātuyā kho, gahapati, yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā te tathāgatassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anup pāda dhammā. Tasmā tathāgato ‘anokasārī’ti vuccati. Vedanādhātuyā kho, gahapati … saññādhātuyā kho, gahapati … saṅkhāradhātuyā kho, gahapati … viññāṇadhātuyā kho, gahapati, yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā te tathāgatassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anup pāda dhammā. Tasmā tathāgato ‘anokasārī’ti vuccati. Evaṁ kho, gahapati, anokasārī hoti.",
    "sn22.3:6": "Kathañca, gahapati, niketasārī hoti? Rūpanimittaniketavisāravinibandhā kho, gahapati, ‘niketasārī’ti vuccati. Saddanimitta … pe … gandhanimitta … rasanimitta … phoṭṭhabbanimitta … dhammanimittaniketavisāravinibandhā kho, gahapati, ‘niketasārī’ti vuccati. Evaṁ kho, gahapati, niketasārī hoti.",
    "sn22.3:7": "Kathañca, gahapati, aniketasārī hoti? Rūpanimittaniketavisāravinibandhā kho, gahapati, tathāgatassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anup pāda dhammā. Tasmā tathāgato ‘aniketasārī’ti vuccati. Saddanimitta … gandhanimitta … rasanimitta … phoṭṭhabbanimitta … dhammanimittaniketavisāravinibandhā kho, gahapati, tathāgatassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anup pāda dhammā. Tasmā tathāgato ‘aniketasārī’ti vuccati. Evaṁ kho, gahapati, aniketasārī hoti.",
    "sn22.3:8": "Kathañca, gahapati, gāme santhavajāto hoti? Idha, gahapati, ekacco gihīhi saṁsaṭṭho vihārati sahanandī sahasokī, sukhitesu sukhito, dukkhitesu dukkhito, uppannesu kiccakaraṇīyesu attanā tesu yogaṁ āpajjati. Evaṁ kho, gahapati, gāme santhavajāto hoti.",
    "sn22.3:9": "Kathañca, gahapati, gāme na santhavajāto hoti? Idha, gahapati, bhikkhu gihīhi asaṁsaṭṭho vihārati na sahanandī na sahasokī na sukhitesu sukhito na dukkhitesu dukkhito, uppannesu kiccakaraṇīyesu na attanā tesu yogaṁ āpajjati. Evaṁ kho, gahapati, gāme na santhavajāto hoti.",
    "sn22.3:10": "Kathañca, gahapati, kāmehi aritto hoti? Idha, gahapati, ekacco kāmesu avigatarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigātataṇho. Evaṁ kho, gahapati, kāmehi aritto hoti.",
    "sn22.3:11": "Kathañca, gahapati, kāmehi ritto hoti? Idha, gahapati, ekacco kāmesu vigatarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigātataṇho. Evaṁ kho, gahapati, kāmehi ritto hoti.",
    "sn22.3:12": "Kathañca, gahapati, purakkharāno hoti? Idha, gahapati, ekaccassa evaṁ hoti: ‘evaṁrūpo siyaṁ anāgatamaddhānaṁ, evaṁvedano siyaṁ anāgatamaddhānaṁ, evaṁsañño siyaṁ anāgatamaddhānaṁ, evaṁsaṅkhāro siyaṁ anāgatamaddhānaṁ, evaṁviññāṇo siyaṁ anāgatamaddhānan’ti. Evaṁ kho, gahapati, purakkharāno hoti.",
    "sn22.3:13": "Kathañca, gahapati, apurakkharāno hoti? Idha, gahapati, ekaccassa na evaṁ hoti: ‘evaṁrūpo siyaṁ anāgatamaddhānaṁ, evaṁvedano siyaṁ anāgatamaddhānaṁ, evaṁsañño siyaṁ anāgatamaddhānaṁ, evaṁsaṅkhāro siyaṁ anāgatamaddhānaṁ, evaṁviññāṇo siyaṁ anāgatamaddhānan’ti. Evaṁ kho, gahapati, apurakkharāno hoti.",
    "sn22.3:14": "Kathañca, gahapati, kathaṁ viggayha janena kattā hoti? Idha, gahapati, ekacco evarūpiṁ kathaṁ kattā hoti: ‘Na tvaṁ imaṁ dhammavinayaṁ ājānāsi; ahaṁ imaṁ dhammavinayaṁ ājānāmi. Kiṁ tvaṁ imaṁ dhammavinayaṁ ājānissasi? Micchāpaṭipanno tvamasi; ahamasmi sammāpaṭipanno. Pure vacanīyaṁ pacchā avaca; pacchā vacanīyaṁ pure avaca. Sahitaṁ me, asahitaṁ te. Adhiciṇṇaṁ te viparāvattaṁ. Āropito te vādo; cara vādappamokkhāya. Niggahitosi; nibbeṭhehi vā sace pahosī’ti. Evaṁ kho, gahapati, kathaṁ viggayha janena kattā hoti.",
    "sn22.3:15": "Kathañca, gahapati, kathaṁ na viggayha janena kattā hoti? Idha, gahapati, bhikkhu na evarūpiṁ kathaṁ kattā hoti: ‘Na tvaṁ imaṁ dhammavinayaṁ ājānāsi … pe … nibbeṭhehi vā sace pahosī’ti. Evaṁ kho, gahapati, kathaṁ na viggayha janena kattā hoti.",
    "sn22.3:16": "Iti kho, gahapati, yaṁ taṁ vuttaṁ bhagavatā aṭṭhakavaggiye māgaṇḍiyapañhe:",
    "sn22.3:17": "‘Okaṁ pahāya aniketasārī,Gāme akubbaṁ munisanthavāni;Kāmehi ritto apurakkharāno,Kathaṁ na viggayha janena kayirā’ti.",
    "sn22.3:18": "Imassa kho, gahapati, bhagavatā saṅkhittena bhāsitassa evaṁ vitthārena attho daṭṭhabbo\"ti."
}