{
    "sn22.95:1": "Ekaṁ samayaṁ bhagavā ayujjhāyaṁ vihārati gaṅgāya nadiyā tīre. Tatra kho bhagavā bhikkhū āmantesi:",
    "sn22.95:2": "\"Seyyathāpi, bhikkhave, ayaṁ gaṅgā nadī mahantaṁ pheṇapiṇḍaṁ āvaheyya. Tamenaṁ cakkhumā puriso passeyya nijjhāyeyya yoniso upaparikkheyya. Tassa taṁ passato nijjhāyato yoniso upaparikkhato rittakaññeva khāyeyya, tucchakaññeva khāyeyya, asārakaññeva khāyeyya. Kiñhi siyā, bhikkhave, pheṇapiṇḍe sāro? Evameva kho, bhikkhave, yaṁ kiñci rūpaṁ atītānāgatapaccuppannaṁ … pe … yaṁ dūre santike vā taṁ bhikkhu passati nijjhāyati yoniso upaparikkhati. Tassa taṁ passato nijjhāyato yoniso upaparikkhato rittakaññeva khāyati, tucchakaññeva khāyati, asārakaññeva khāyati. Kiñhi siyā, bhikkhave, rūpe sāro?",
    "sn22.95:3": "Seyyathāpi, bhikkhave, saradasamaye thullaphusitake deve vassante udake udakapubbuḷaṁ uppajjati ceva nirujjhati ca. Tamenaṁ cakkhumā puriso passeyya nijjhāyeyya yoniso upaparikkheyya. Tassa taṁ passato nijjhāyato yoniso upaparikkhato rittakaññeva khāyeyya, tucchakaññeva khāyeyya, asārakaññeva khāyeyya. Kiñhi siyā, bhikkhave, udakapubbuḷe sāro? Evameva kho, bhikkhave, yā kāci vedanā atītānāgatapaccuppannā … pe … yā dūre santike vā taṁ bhikkhu passati nijjhāyati yoniso upaparikkhati. Tassa taṁ passato nijjhāyato yoniso upaparikkhato rittakaññeva khāyati, tucchakaññeva khāyati, asārakaññeva khāyati. Kiñhi siyā, bhikkhave, vedanāya sāro?",
    "sn22.95:4": "Seyyathāpi, bhikkhave, gimhānaṁ pacchime māse ṭhite majjhanhike kāle marīcikā phandati. Tamenaṁ cakkhumā puriso passeyya nijjhāyeyya yoniso upaparikkheyya. Tassa taṁ passato nijjhāyato yoniso upaparikkhato rittakaññeva khāyeyya, tucchakaññeva khāyeyya … pe … kiñhi siyā, bhikkhave, marīcikāya sāro? Evameva kho, bhikkhave, yā kāci saññā … pe … .",
    "sn22.95:5": "Seyyathāpi, bhikkhave, puriso sāratthiko sāragavesī sārapariyesanaṁ caramāno tiṇhaṁ kuṭhāriṁ ādāya vanaṁ paviseyya. So tattha passeyya mahantaṁ kadalikkhandhaṁ ujuṁ navaṁ akukkukajātaṁ. Tamenaṁ mūle chindeyya; mūle chetvā agge chindeyya, agge chetvā pattavaṭṭiṁ vinibbhujeyya. So tassa pattavaṭṭiṁ vinibbhujanto pheggumpi nādhigaccheyya, kuto sāraṁ. Tamenaṁ cakkhumā puriso passeyya nijjhāyeyya yoniso upaparikkheyya. Tassa taṁ passato nijjhāyato yoniso upaparikkhato rittakaññeva khāyeyya, tucchakaññeva khāyeyya, asārakaññeva khāyeyya. Kiñhi siyā, bhikkhave, kadalikkhandhe sāro? Evameva kho, bhikkhave, ye keci saṅkhārā atītānāgatapaccuppannā … pe … ye dūre santike vā taṁ bhikkhu passati nijjhāyati yoniso upaparikkhati. Tassa taṁ passato nijjhāyato yoniso upaparikkhato rittakaññeva khāyati, tucchakaññeva khāyati, asārakaññeva khāyati. Kiñhi siyā, bhikkhave, saṅkhāresu sāro?",
    "sn22.95:6": "Seyyathāpi, bhikkhave, māyākāro vā māyākārantevāsī vā catumahāpathe māyaṁ vidaṁseyya. Tamenaṁ cakkhumā puriso passeyya nijjhāyeyya yoniso upaparikkheyya. Tassa taṁ passato nijjhāyato yoniso upaparikkhato rittakaññeva khāyeyya, tucchakaññeva khāyeyya, asārakaññeva khāyeyya. Kiñhi siyā, bhikkhave, māyāya sāro? Evameva kho, bhikkhave, yaṁ kiñci viññāṇaṁ atītānāgatapaccuppannaṁ … pe … yaṁ dūre santike vā, taṁ bhikkhu passati nijjhāyati yoniso upaparikkhati. Tassa taṁ passato nijjhāyato yoniso upaparikkhato rittakaññeva khāyati, tucchakaññeva khāyati, asārakaññeva khāyati. Kiñhi siyā, bhikkhave, viññāṇe sāro?",
    "sn22.95:7": "Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako rūpasmimpi nibbindati, vedanāyapi … saññāyapi … saṅkhāresupi … viññāṇasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati. Vimuttasmiṁ vimuttamiti ñāṇaṁ hoti … pe … nāparaṁ itthattāyāti pajānāti\".",
    "sn22.95:8": "Idamavoca bhagavā. Idaṁ vatvāna sugato athāparaṁ etadavoca satthā:",
    "sn22.95:9": "\"Pheṇapiṇḍūpamaṁ rūpaṁ,vedanā bubbuḷūpamā;Marīcikūpamā saññā,saṅkhārā kadalūpamā;Māyūpamañca viññāṇaṁ,desitādiccabandhunā.",
    "sn22.95:10": "Yathā yathā nijjhāyati,yoniso upaparikkhati;Rittakaṁ tucchakaṁ hoti,yo naṁ passati yoniso.",
    "sn22.95:11": "Imañca kāyaṁ ārabbha,bhūripaññena desitaṁ;Pahānaṁ tiṇṇaṁ dhammānaṁ,rūpaṁ passatha chaḍḍitaṁ.",
    "sn22.95:12": "Āyu usmā ca viññāṇaṁ,yadā kāyaṁ jahantimaṁ;Apaviddho tadā seti,parabhattaṁ acetanaṁ.",
    "sn22.95:13": "Etādisāyaṁ santāno,māyāyaṁ bālalāpinī;Vadhako esa akkhāto,sāro ettha na vijjati.",
    "sn22.95:14": "Evaṁ khandhe avekkheyya,bhikkhu āraddhavīriyo;Divā vā yadi vā rattiṁ,sampajāno paṭissato.",
    "sn22.95:15": "Jaheyya sabbasaṁyogaṁ,kareyya saraṇattano;Careyyādittasīsova,patthayaṁ accutaṁ padan\"ti."
}