{
    "sn22.7:1": "Sāvatthinidānaṁ. \"Upādāparitassanañca vo, bhikkhave, desessāmi anupādāaparitassanañca. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "sn22.7:2": "\"Kathañca, bhikkhave, upādāparitassanā hoti? Idha, bhikkhave, assutavā puthujjano ariyānaṁ adassāvī ariyadhammassa akovido ariyadhamme avinīto, sappurisānaṁ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto rūpaṁ attato samanupassati, rūpavantaṁ vā attānaṁ; attani vā rūpaṁ, rūpasmiṁ vā attānaṁ. Tassa taṁ rūpaṁ vipariṇamati aññathā hoti. Tassa rūpavipariṇāmaññathābhāvā rūpavipariṇāmānuparivatti viññāṇaṁ hoti. Tassa rūpavipariṇāmānuparivattijā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso pariyādānā uttāsavā ca hoti vighātavā ca apekkhavā ca upādāya ca paritassati.",
    "sn22.7:3": "vedanāṁ attato samanupassati, vedanāvantaṁ vā attānaṁ; attani vā vedanāṁ, vedanāya vā attānaṁ. Tassa sā vedanā vipariṇamati aññathā hoti. Tassa vedanāvipariṇāmaññathābhāvā vedanāvipariṇāmānuparivatti viññāṇaṁ hoti. Tassa vedanāvipariṇāmānuparivattijā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso pariyādānā uttāsavā ca hoti vighātavā ca apekkhavā ca upādāya ca paritassati.",
    "sn22.7:4": "Saññaṁ attato samanupassati … pe … saṅkhāre attato samanupassati, saṅkhāravantaṁ vā attānaṁ; attani vā saṅkhāre, saṅkhāresu vā attānaṁ. Tassa te saṅkhārā vipariṇamanti aññathā honti. Tassa saṅkhāravipariṇāmaññathābhāvā saṅkhāravipariṇāmānuparivatti viññāṇaṁ hoti. Tassa saṅkhāravipariṇāmānuparivattijā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso pariyādānā uttāsavā ca hoti vighātavā ca apekkhavā ca upādāya ca paritassati.",
    "sn22.7:5": "Viññāṇaṁ attato samanupassati, viññāṇavantaṁ vā attānaṁ; attani vā viññāṇaṁ, viññāṇasmiṁ vā attānaṁ. Tassa taṁ viññāṇaṁ vipariṇamati aññathā hoti. Tassa viññāṇavipariṇāmaññathābhāvā viññāṇavipariṇāmānuparivatti viññāṇaṁ hoti. Tassa viññāṇavipariṇāmānuparivattijā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso pariyādānā uttāsavā ca hoti vighātavā ca apekkhavā ca upādāya ca paritassati. Evaṁ kho, bhikkhave, upādāparitassanā hoti.",
    "sn22.7:6": "Kathañca, bhikkhave, anupādāaparitassanā hoti? Idha, bhikkhave, sutavā ariyasāvako ariyānaṁ dassāvī ariyadhammassa kovido ariyadhamme suvinīto, sappurisānaṁ dassāvī sappurisadhammassa kovido sappurisadhamme suvinīto na rūpaṁ attato samanupassati, na rūpavantaṁ vā attānaṁ; na attani vā rūpaṁ, na rūpasmiṁ vā attānaṁ. Tassa taṁ rūpaṁ vipariṇamati aññathā hoti. Tassa rūpavipariṇāmaññathābhāvā na rūpavipariṇāmānuparivatti viññāṇaṁ hoti. Tassa na rūpavipariṇāmānuparivattijā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso apariyādānā na cevuttāsavā hoti na ca vighātavā na ca apekkhavā, anupādāya ca na paritassati.",
    "sn22.7:7": "Na vedanāṁ attato samanupassati, na vedanāvantaṁ vā attānaṁ; na attani vā vedanāṁ, na vedanāya vā attānaṁ. Tassa sā vedanā vipariṇamati aññathā hoti. Tassa vedanāvipariṇāmaññathābhāvā na vedanāvipariṇāmānuparivatti viññāṇaṁ hoti. Tassa na vedanāvipariṇāmānuparivattijā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso apariyādānā na cevuttāsavā hoti na ca vighātavā na ca apekkhavā, anupādāya ca na paritassati.",
    "sn22.7:8": "Na saññaṁ … pe … na saṅkhāre attato samanupassati, na saṅkhāravantaṁ vā attānaṁ; na attani vā saṅkhāre, na saṅkhāresu vā attānaṁ. Tassa te saṅkhārā vipariṇamanti aññathā honti. Tassa saṅkhāravipariṇāmaññathābhāvā na saṅkhāravipariṇāmānuparivatti viññāṇaṁ hoti. Tassa na saṅkhāravipariṇāmānuparivattijā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso apariyādānā na cevuttāsavā hoti na ca vighātavā na ca apekkhavā, anupādāya ca na paritassati.",
    "sn22.7:9": "Na viññāṇaṁ attato samanupassati, na viññāṇavantaṁ vā attānaṁ … pe … tassa taṁ viññāṇaṁ vipariṇamati aññathā hoti. Tassa viññāṇavipariṇāmaññathābhāvā na viññāṇavipariṇāmānuparivatti viññāṇaṁ hoti. Tassa na viññāṇavipariṇāmānuparivattijā paritassanā dhammasamuppādā cittaṁ pariyādāya tiṭṭhanti. Cetaso apariyādānā na cevuttāsavā hoti na ca vighātavā na ca apekkhavā, anupādāya ca na paritassati."
}