{
    "sn22.87:1": "Ekaṁ samayaṁ bhagavā rājagahe vihārati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā vakkali kumbhakāranivesane vihārati ābādhiko dukkhito bāḷhagilāno. Atha kho āyasmā vakkali upaṭṭhāke āmantesi:",
    "sn22.87:2": "Atha kho bhagavā nivāsetvā pattacīvaramādāya yenāyasmā vakkali tenupasaṅkami. Addasā kho āyasmā vakkali bhagavantaṁ dūratova āgacchantaṁ. Disvāna mañcake samadhosi. Atha kho bhagavā āyasmantaṁ vakkaliṁ etadavoca: \"Alaṁ, vakkali, mā tvaṁ mañcake samadhosi. Santimāni āsanāni paññattāni; tatthāhaṁ nisīdissāmī\"ti.",
    "sn22.87:3": "\"Alaṁ, vakkali, kiṁ te iminā pūtikāyena diṭṭhena? Yo kho, vakkali, dhammaṁ passati so maṁ passati; yo maṁ passati so dhammaṁ passati. Dhammañhi, vakkali, passanto maṁ passati; maṁ passanto dhammaṁ passati.",
    "sn22.87:4": "Taṁ kiṁ maññasi, vakkali, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti? \"Dukkhaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti? \"No hetaṁ, bhante\". \"Vedanā … saññā … saṅkhārā … viññāṇaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\" … pe … eso me attāti? \"No hetaṁ, bhante\". \"Tasmātiha … pe … evaṁ passaṁ … pe … nāparaṁ itthattāyāti pajānātī\"ti.",
    "sn22.87:5": "Atha kho bhagavā āyasmantaṁ vakkaliṁ iminā ovādena ovaditvā uṭṭhāyāsanā yena gijjhakūṭo pabbato tena pakkāmi.",
    "sn22.87:6": "Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi: \"etha tumhe, bhikkhave, yena vakkali bhikkhu tenupasaṅkamatha; upasaṅkamitvā vakkaliṁ bhikkhuṁ evaṁ vadetha:",
    "sn22.87:7": "‘Suṇāvuso tvaṁ, vakkali, bhagavato vacanaṁ dvinnañca devatānaṁ. Imaṁ, āvuso, rattiṁ dve devatāyo abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṁ gijjhakūṭaṁ obhāsetvā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhaṁsu. Ekamantaṁ ṭhitā kho, āvuso, ekā devatā bhagavantaṁ etadavoca – vakkali, bhante, bhikkhu vimokkhāya cetetīti. Aparā devatā bhagavantaṁ etadavoca – so hi nūna, bhante, suvimutto vimuccissatīti. Bhagavā ca taṁ, āvuso vakkali, evamāha – mā bhāyi, vakkali; mā bhāyi, vakkali. Apāpakaṁ te maraṇaṁ bhavissati, apāpikā kālakiriyā’\"ti.",
    "sn22.87:8": "Atha kho āyasmā vakkali upaṭṭhāke āmantesi: \"etha maṁ, āvuso, mañcakā oropetha. Kathañhi nāma mādiso ucce āsane nisīditvā tassa bhagavato sāsanaṁ sotabbaṁ maññeyyā\"ti.",
    "sn22.87:9": "Atha kho te bhikkhū yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ: \"vakkali, bhante, bhikkhu ābādhiko dukkhito bāḷhagilāno; so bhagavato pāde sirasā vandati; evañca vadeti: ‘rūpaṁ aniccaṁ. Tāhaṁ, bhante, na kaṅkhāmi. Yadaniccaṁ taṁ dukkhanti na vicikicchāmi. Yadaniccaṁ dukkhaṁ vipariṇāmadhammaṁ, natthi me tattha chando vā rāgo vā pemaṁ vāti na vicikicchāmi. Vedanā … saññā … saṅkhārā … viññāṇaṁ aniccaṁ. Tāhaṁ, bhante, na kaṅkhāmi. Yadaniccaṁ taṁ dukkhanti na vicikicchāmi. Yadaniccaṁ dukkhaṁ vipariṇāmadhammaṁ, natthi me tattha chando vā rāgo vā pemaṁ vāti na vicikicchāmī’\"ti.",
    "sn22.87:10": "Atha kho bhagavā bhikkhū āmantesi: \"āyāma, bhikkhave, yena isigilipassaṁ kāḷasilā tenupasaṅkamissāma; yattha vakkalinā kulaputtena satthamāharitan\"ti.",
    "sn22.87:11": "Tena kho pana samayena dhūmāyitattaṁ timirāyitattaṁ gacchateva purimaṁ disaṁ, gacchati pacchimaṁ disaṁ, gacchati uttaraṁ disaṁ, gacchati dakkhiṇaṁ disaṁ, gacchati uddhaṁ disaṁ, gacchati adho disaṁ, gacchati anudisaṁ. Atha kho bhagavā bhikkhū āmantesi: \"passatha no tumhe, bhikkhave, etaṁ dhūmāyitattaṁ timirāyitattaṁ gacchateva purimaṁ disaṁ … pe … gacchati anudisan\"ti."
}