{
    "sn22.89:1": "Ekaṁ samayaṁ sambahulā therā bhikkhū kosambiyaṁ vihāranti ghositārāme. Tena kho pana samayena āyasmā khemako badarikārāme vihārati ābādhiko dukkhito bāḷhagilāno. Atha kho therā bhikkhū sāyanhasamayaṁ paṭisallānā vuṭṭhitā āyasmantaṁ dāsakaṁ āmantesuṁ: \"ehi tvaṁ, āvuso dāsaka, yena khemako bhikkhu tenupasaṅkama; upasaṅkamitvā khemakaṁ bhikkhuṁ evaṁ vadehi: ‘therā taṁ, āvuso khemaka, evamāhaṁsu – kacci te, āvuso, khamanīyaṁ, kacci yāpanīyaṁ, kacci dukkhā vedanā paṭikkamanti no abhikkamanti, paṭikkamosānaṁ paññāyati no abhikkamo’\"ti?",
    "sn22.89:2": "Atha kho āyasmā dāsako yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā there bhikkhū etadavoca: \"khemako, āvuso, bhikkhu evamāha: ‘Na me, āvuso, khamanīyaṁ … pe … abhikkamosānaṁ paññāyati no paṭikkamo’\"ti. \"Ehi tvaṁ, āvuso dāsaka, yena khemako bhikkhu tenupasaṅkama; upasaṅkamitvā khemakaṁ bhikkhuṁ evaṁ vadehi: ‘therā taṁ, āvuso khemaka, evamāhaṁsu – pañcime, āvuso, upādānakkhandhā vuttā bhagavatā, seyyathidaṁ – rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Imesu āyasmā khemako pañcasu upādānakkhandhesu kiñci attaṁ vā attaniyaṁ vā samanupassatī’\"ti?",
    "sn22.89:3": "\"Evamāvuso\"ti kho āyasmā dāsako therānaṁ bhikkhūnaṁ paṭissutvā yenāyasmā khemako tenupasaṅkami; upasaṅkamitvā … pe … therā taṁ, āvuso khemaka, evamāhaṁsu: \"pañcime, āvuso, upādānakkhandhā vuttā bhagavatā, seyyathidaṁ – rūpupādānakkhandho … pe … viññāṇupādānakkhandho. Imesu āyasmā khemako pañcasu upādānakkhandhesu kiñci attaṁ vā attaniyaṁ vā samanupassatī\"ti?",
    "sn22.89:4": "Atha kho āyasmā dāsako yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā there bhikkhū etadavoca: \"khemako, āvuso, bhikkhu evamāha: ‘pañcime, āvuso, upādānakkhandhā vuttā bhagavatā, seyyathidaṁ – rūpupādānakkhandho … pe … viññāṇupādānakkhandho. Imesu khvāhaṁ, āvuso, pañcasu upādānakkhandhesu na kiñci attaṁ vā attaniyaṁ vā samanupassāmī’\"ti. \"Ehi tvaṁ, āvuso dāsaka, yena khemako bhikkhu tenupasaṅkama; upasaṅkamitvā khemakaṁ bhikkhuṁ evaṁ vadehi: ‘therā taṁ, āvuso khemaka, evamāhaṁsu – pañcime, āvuso, upādānakkhandhā vuttā bhagavatā, seyyathidaṁ – rūpupādānakkhandho … pe … viññāṇupādānakkhandho. No ce kirāyasmā khemako imesu pañcasu upādānakkhandhesu kiñci attaṁ vā attaniyaṁ vā samanupassati. Tenahāyasmā khemako arahaṁ khīṇāsavo’\"ti.",
    "sn22.89:5": "\"Evamāvuso\"ti kho āyasmā dāsako therānaṁ bhikkhūnaṁ paṭissutvā yenāyasmā khemako … pe … therā taṁ, āvuso khemaka, evamāhaṁsu: \"pañcime, āvuso, upādānakkhandhā vuttā bhagavatā, seyyathidaṁ – rūpupādānakkhandho … pe … viññāṇupādānakkhandho; no ce kirāyasmā khemako imesu pañcasu upādānakkhandhesu kiñci attaṁ vā attaniyaṁ vā samanupassati, tenahāyasmā khemako arahaṁ khīṇāsavo\"ti.",
    "sn22.89:6": "Atha kho āyasmā dāsako yena therā bhikkhū … pe … there bhikkhū etadavoca: \"khemako, āvuso, bhikkhu evamāha – pañcime, āvuso, upādānakkhandhā vuttā bhagavatā, seyyathidaṁ – rūpupādānakkhandho … pe … viññāṇupādānakkhandho. Imesu khvāhaṁ, āvuso, pañcasu upādānakkhandhesu na kiñci attaṁ vā attaniyaṁ vā samanupassāmi, na camhi arahaṁ khīṇāsavo; api ca me, āvuso, pañcasu upādānakkhandhesu ‘asmī’ti adhigataṁ, ‘ayamahamasmī’ti na ca samanupassāmī\"ti.",
    "sn22.89:7": "\"Ehi tvaṁ, āvuso dāsaka, yena khemako bhikkhu tenupasaṅkama; upasaṅkamitvā khemakaṁ bhikkhuṁ evaṁ vadehi: ‘therā taṁ, āvuso khemaka, evamāhaṁsu – yametaṁ, āvuso khemaka, asmīti vadesi, kimetaṁ asmīti vadesi? Rūpaṁ asmīti vadesi, aññatra rūpā asmīti vadesi, vedanāṁ … saññaṁ … saṅkhāre … viññāṇaṁ asmīti vadesi, aññatra viññāṇā asmīti vadesi. Yametaṁ, āvuso khemaka, asmīti vadesi. Kimetaṁ asmīti vadesī’\"ti?",
    "sn22.89:8": "\"Evamāvuso\"ti kho āyasmā dāsako therānaṁ bhikkhūnaṁ paṭissutvā yenāyasmā khemako tenupasaṅkami; upasaṅkamitvā āyasmantaṁ khemakaṁ etadavoca – therā taṁ, āvuso khemaka, evamāhaṁsu: \"yametaṁ, āvuso khemaka, ‘asmī’ti vadesi, kimetaṁ ‘asmī’ti vadesi? Rūpaṁ ‘asmī’ti vadesi aññatra rūpā ‘asmī’ti vadesi? vedanāṁ … saññaṁ … saṅkhāre … viññāṇaṁ ‘asmī’ti vadesi aññatra viññāṇā ‘asmī’ti vadesi? Yametaṁ, āvuso khemaka, ‘asmī’ti vadesi, kimetaṁ ‘asmī’ti vadesī\"ti?",
    "sn22.89:9": "Atha kho āyasmā khemako daṇḍamolubbha yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā therehi bhikkhūhi saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho āyasmantaṁ khemakaṁ therā bhikkhū etadavocuṁ: \"yametaṁ, āvuso khemaka, ‘asmī’ti vadesi, kimetaṁ ‘asmī’ti vadesi?",
    "sn22.89:10": "Seyyathāpi, āvuso, uppalassa vā padumassa vā puṇḍarīkassa vā gandho. Yo nu kho evaṁ vadeyya: ‘pattassa gandho’ti vā ‘vaṇṇassa gandho’ti vā ‘kiñjakkhassa gandho’ti vā sammā nu kho so vadamāno vadeyyā\"ti?",
    "sn22.89:11": "Kiñcāpi, āvuso, ariyasāvakassa pañcorambhāgiyāni saṁyojanāni pahīnāni bhavanti, atha khvassa hoti: ‘yo ca pañcasu upādānakkhandhesu anusahagato asmīti māno, asmīti chando, asmīti anusayo asamūhato. So aparena samayena pañcasu upādānakkhandhesu udayabbayānupassī vihārati – iti rūpaṁ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā … iti saññā … iti saṅkhārā … iti viññāṇaṁ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti. Tassimesu pañcasu upādānakkhandhesu udayabbayānupassino vihārato yopissa hoti pañcasu upādānakkhandhesu anusahagato ‘asmī’ti, māno ‘asmī’ti, chando ‘asmī’ti anusayo asamūhato, sopi samugghātaṁ gacchati.",
    "sn22.89:12": "Seyyathāpi, āvuso, vatthaṁ saṅkiliṭṭhaṁ malaggahitaṁ. Tamenaṁ sāmikā rajakassa anupadajjuṁ. Tamenaṁ rajako ūse vā khāre vā gomaye vā sammadditvā acche udake vikkhāleti. Kiñcāpi taṁ hoti vatthaṁ parisuddhaṁ pariyodātaṁ, atha khvassa hoti yeva anusahagato ūsagandho vā khāragandho vā gomayagandho vā asamūhato. Tamenaṁ rajako sāmikānaṁ deti. Tamenaṁ sāmikā gandhaparibhāvite karaṇḍake nikkhipanti. Yopissa hoti anusahagato ūsagandho vā khāragandho vā gomayagandho vā asamūhato, sopi samugghātaṁ gacchati.",
    "sn22.89:13": "Evaṁ vutte, therā bhikkhū āyasmantaṁ khemakaṁ etadavocuṁ: \"na kho mayaṁ āyasmantaṁ khemakaṁ vihesāpekhā pucchimha, api cāyasmā khemako pahosi tassa bhagavato sāsanaṁ vitthārena ācikkhituṁ desetuṁ paññāpetuṁ paṭṭhapetuṁ vivarituṁ vibhajituṁ uttānīkātuṁ. Tayidaṁ āyasmatā khemakena tassa bhagavato sāsanaṁ vitthārena ācikkhitaṁ desitaṁ paññāpitaṁ paṭṭhapitaṁ vivaritaṁ vibhajitaṁ uttānīkatan\"ti.",
    "sn22.89:14": "Idamavoca āyasmā khemako. Attamanā therā bhikkhū āyasmato khemakassa bhāsitaṁ abhinanduṁ. Imasmiñca pana veyyākaraṇasmiṁ bhaññamāne saṭṭhimattānaṁ therānaṁ bhikkhūnaṁ anupādāya āsavehi cittāni vimucciṁsu, āyasmato khemakassa cāti."
}