{
    "sn22.5:1": "Evaṁ me sutaṁ—​… pe … sāvatthiyaṁ … tatra kho … pe … etadavoca:",
    "sn22.5:2": "Ko ca, bhikkhave, rūpassa samudayo, ko vedanāya samudayo, ko saññāya samudayo, ko saṅkhārānaṁ samudayo, ko viññāṇassa samudayo? Idha, bhikkhave, bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati.",
    "sn22.5:3": "Kiñca abhinandati abhivadati ajjhosāya tiṭṭhati? Rūpaṁ abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa rūpaṁ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjati nandī. Yā rūpe nandī tadupādānaṁ. Tassupādānapaccayā bhavo; bhavapaccayā jāti; jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "sn22.5:4": "vedanāṁ abhinandati … pe … saññaṁ abhinandati … saṅkhāre abhinandati … viññāṇaṁ abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa viññāṇaṁ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjati nandī. Yā viññāṇe nandī tadupādānaṁ. Tassupādānapaccayā bhavo; bhavapaccayā jāti; jātipaccayā … pe … evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "sn22.5:5": "Ayaṁ, bhikkhave, rūpassa samudayo; ayaṁ vedanāya samudayo; ayaṁ saññāya samudayo; ayaṁ saṅkhārānaṁ samudayo; ayaṁ viññāṇassa samudayo.",
    "sn22.5:6": "Ko ca, bhikkhave, rūpassa atthaṅgamo, ko vedanāya … ko saññāya … ko saṅkhārānaṁ … ko viññāṇassa atthaṅgamo?",
    "sn22.5:7": "Idha, bhikkhave, nābhinandati nābhivadati nājjhosāya tiṭṭhati.",
    "sn22.5:8": "Kiñca nābhinandati nābhivadati nājjhosāya tiṭṭhati? Rūpaṁ nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa rūpaṁ anabhinandato anabhivadato anajjhosāya tiṭṭhato yā rūpe nandī sā nirujjhati. Tassa nandīnirodhā upādānanirodho; upādānanirodhā bhavanirodho … pe … evametassa kevalassa dukkhakkhandhassa nirodho hoti.",
    "sn22.5:9": "vedanāṁ nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa vedanāṁ anabhinandato anabhivadato anajjhosāya tiṭṭhato yā vedanāya nandī sā nirujjhati. Tassa nandīnirodhā upādānanirodho; upādānanirodhā bhavanirodho … pe … evametassa kevalassa dukkhakkhandhassa nirodho hoti.",
    "sn22.5:10": "Saññaṁ nābhinandati … pe … saṅkhāre nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa saṅkhāre anabhinandato anabhivadato anajjhosāya tiṭṭhato yā saṅkhāresu nandī sā nirujjhati. Tassa nandīnirodhā upādānanirodho; upādānanirodhā bhavanirodho … pe … evametassa kevalassa dukkhakkhandhassa nirodho hoti.",
    "sn22.5:11": "Viññāṇaṁ nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa viññāṇaṁ anabhinandato anabhivadato anajjhosāya tiṭṭhato yā viññāṇe nandī sā nirujjhati. Tassa nandīnirodhā upādānanirodho … pe … evametassa kevalassa dukkhakkhandhassa nirodho hoti.",
    "sn22.5:12": "Ayaṁ, bhikkhave, rūpassa atthaṅgamo, ayaṁ vedanāya atthaṅgamo, ayaṁ saññāya atthaṅgamo, ayaṁ saṅkhārānaṁ atthaṅgamo, ayaṁ viññāṇassa atthaṅgamo\"ti."
}