{
    "sn22.80:1": "Ekaṁ samayaṁ bhagavā sakkesu vihārati kapilavatthusmiṁ nigrodhārāme.",
    "sn22.80:2": "Atha kho bhagavato rahogatassa paṭisallīnassa evaṁ cetaso parivitakko udapādi: \"Mayā kho bhikkhusaṅgho pabāḷho. Santettha bhikkhū navā acirapabbajitā adhunāgatā imaṁ dhammavinayaṁ. Tesaṁ mamaṁ apassantānaṁ siyā aññathattaṁ siyā vipariṇāmo. Seyyathāpi nāma vacchassa taruṇassa mātaraṁ apassantassa siyā aññathattaṁ siyā vipariṇāmo; evameva santettha bhikkhū navā acirapabbajitā adhunāgatā imaṁ dhammavinayaṁ tesaṁ mamaṁ apassantānaṁ siyā aññathattaṁ siyā vipariṇāmo. Seyyathāpi nāma bījānaṁ taruṇānaṁ udakaṁ alabhantānaṁ siyā aññathattaṁ siyā vipariṇāmo; evameva santettha … pe … tesaṁ mamaṁ alabhantānaṁ dassanāya siyā aññathattaṁ siyā vipariṇāmo. Yannūnāhaṁ yatheva mayā pubbe bhikkhusaṅgho anuggahito, evameva etarahi anuggaṇheyyaṁ bhikkhusaṅghan\"ti.",
    "sn22.80:3": "Atha kho brahmā sahampati bhagavato cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya pasāritaṁ vā bāhaṁ samiñjeyya; evameva – brahmaloke antarahito bhagavato purato pāturahosi. Atha kho brahmā sahampati ekaṁsaṁ uttarāsaṅgaṁ karitvā yena bhagavā tenañjaliṁ paṇāmetvā bhagavantaṁ etadavoca: \"evametaṁ, bhagavā, evametaṁ, sugata. Bhagavatā, bhante, bhikkhusaṅgho pabāḷho. Santettha bhikkhū navā acirapabbajitā adhunāgatā imaṁ dhammavinayaṁ. Tesaṁ bhagavantaṁ apassantānaṁ siyā aññathattaṁ siyā vipariṇāmo. Seyyathāpi nāma vacchassa taruṇassa mātaraṁ apassantassa siyā aññathattaṁ siyā vipariṇāmo; evameva santettha bhikkhū navā acirapabbajitā adhunāgatā imaṁ dhammavinayaṁ tesaṁ bhagavantaṁ apassantānaṁ siyā aññathattaṁ siyā vipariṇāmo. Seyyathāpi nāma bījānaṁ taruṇānaṁ udakaṁ alabhantānaṁ siyā aññathattaṁ siyā vipariṇāmo; evameva santettha bhikkhū navā acirapabbajitā adhunāgatā imaṁ dhammavinayaṁ, tesaṁ bhagavantaṁ alabhantānaṁ dassanāya siyā aññathattaṁ siyā vipariṇāmo. Abhinandatu, bhante, bhagavā bhikkhusaṅghaṁ; abhivadatu, bhante, bhagavā bhikkhusaṅghaṁ. Yatheva bhagavatā pubbe bhikkhusaṅgho anuggahito, evameva etarahi anuggaṇhātu bhikkhusaṅghan\"ti.",
    "sn22.80:4": "Adhivāsesi bhagavā tuṇhībhāvena. Atha kho brahmā sahampati bhagavato adhivāsanaṁ viditvā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā tatthevantaradhāyi.",
    "sn22.80:5": "Atha kho bhagavā sāyanhasamayaṁ paṭisallānā vuṭṭhito yena nigrodhārāmo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā tathārūpaṁ iddhābhisaṅkhāraṁ abhisaṅkhāsi yathā te bhikkhū ekadvīhikāya sārajjamānarūpā yenāhaṁ tenupasaṅkameyyuṁ. Tepi bhikkhū ekadvīhikāya sārajjamānarūpā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinne kho te bhikkhū bhagavā etadavoca:",
    "sn22.80:6": "\"Antamidaṁ, bhikkhave, jīvikānaṁ yadidaṁ piṇḍolyaṁ. Abhisāpoyaṁ, bhikkhave, lokasmiṁ piṇḍolo vicarasi pattapāṇīti. Tañca kho etaṁ, bhikkhave, kulaputtā upenti atthavasikā, atthavasaṁ paṭicca; neva rājābhinītā, na corābhinītā, na iṇaṭṭā, na bhayaṭṭā, na ājīvikāpakatā; api ca kho otiṇṇāmha jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi dukkhotiṇṇā dukkhaparetā appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethāti.",
    "sn22.80:7": "Evaṁ pabbajito cāyaṁ, bhikkhave, kulaputto. So ca hoti abhijjhālu kāmesu tibbasārāgo byāpannacitto paduṭṭhamanasaṅkappo muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo. Seyyathāpi, bhikkhave, chavālātaṁ ubhatopadittaṁ majjhe gūthagataṁ, neva gāme kaṭṭhatthaṁ pharati, nāraññe kaṭṭhatthaṁ pharati. Tathūpamāhaṁ, bhikkhave, imaṁ puggalaṁ vadāmi gihibhogā ca parihīno, sāmaññatthañca na paripūreti.",
    "sn22.80:8": "Tayome, bhikkhave, akusalavitakkā – kāmavitakko, byā pāda vitakko, vihiṁsāvitakko. Ime ca bhikkhave, tayo akusalavitakkā kva aparisesā nirujjhanti? Catūsu vā satipaṭṭhānesu suppatiṭṭhitacittassa vihārato animittaṁ vā samādhiṁ bhāvayato. Yāvañcidaṁ, bhikkhave, alameva animitto samādhi bhāvetuṁ. Animitto, bhikkhave, samādhi bhāvito bahulīkato mahapphalo hoti mahānisaṁso.",
    "sn22.80:9": "Dvemā, bhikkhave, diṭṭhiyo – bhavadiṭṭhi ca vibhavadiṭṭhi ca. Tatra kho, bhikkhave, sutavā ariyasāvako iti paṭisañcikkhati: ‘atthi nu kho taṁ kiñci lokasmiṁ yamahaṁ upādiyamāno na vajjavā assan’ti? So evaṁ pajānāti: ‘Natthi nu kho taṁ kiñci lokasmiṁ yamahaṁ upādiyamāno na vajjavā assaṁ. Ahañhi rūpaññeva upādiyamāno upādiyeyyaṁ vedanāññeva … saññaññeva … saṅkhāreyeva viññāṇaññeva upādiyamāno upādiyeyyaṁ. Tassa me assa upādānapaccayā bhavo; bhavapaccayā jāti; jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhaveyyuṁ. Evametassa kevalassa dukkhakkhandhassa samudayo assā’ti.",
    "sn22.80:10": "Taṁ kiṁ maññatha, bhikkhave, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti? \"Dukkhaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti? \"No hetaṁ, bhante\". \"Vedanā … saññā … saṅkhārā … viññāṇaṁ … pe … tasmātiha, bhikkhave, …"
}