{
    "sn22.85:1": "Ekaṁ samayaṁ āyasmā sāriputto sāvatthiyaṁ vihārati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena yamakassa nāma bhikkhuno evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ hoti: \"Tathāhaṁ bhagavatā dhammaṁ desitaṁ ājānāmi, yathā khīṇāsavo bhikkhu kāyassa bhedā ucchijjati vinassati, na hoti paraṁ maraṇā\"ti.",
    "sn22.85:2": "Assosuṁ kho sambahulā bhikkhū yamakassa kira nāma bhikkhuno evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ hoti: \"Tathāhaṁ bhagavatā dhammaṁ desitaṁ ājānāmi, yathā khīṇāsavo bhikkhu kāyassa bhedā ucchijjati vinassati, na hoti paraṁ maraṇā\"ti. Atha kho te bhikkhū yenāyasmā yamako tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā yamakena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū āyasmantaṁ yamakaṁ etadavocuṁ:",
    "sn22.85:3": "\"Saccaṁ kira te, āvuso yamaka, evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ: ‘tathāhaṁ bhagavatā dhammaṁ desitaṁ ājānāmi, yathā khīṇāsavo bhikkhu kāyassa bhedā ucchijjati vinassati, na hoti paraṁ maraṇā’\"ti? \"Evaṁ khvāhaṁ, āvuso, bhagavatā dhammaṁ desitaṁ ājānāmi: ‘khīṇāsavo bhikkhu kāyassa bhedā ucchijjati vinassati, na hoti paraṁ maraṇā’\"ti.",
    "sn22.85:4": "\"Mā, āvuso yamaka, evaṁ avaca, mā bhagavantaṁ abbhācikkhi. Na hi sādhu bhagavato abbhācikkhanaṁ. Na hi bhagavā evaṁ vadeyya: ‘khīṇāsavo bhikkhu kāyassa bhedā ucchijjati vinassati, na hoti paraṁ maraṇā’\"ti.",
    "sn22.85:5": "Yato kho te bhikkhū nāsakkhiṁsu āyasmantaṁ yamakaṁ etasmā pāpakā diṭṭhigatā vivecetuṁ, atha kho te bhikkhū uṭṭhāyāsanā yenāyasmā sāriputto tenupasaṅkamiṁsu; upasaṅkamitvā āyasmantaṁ sāriputtaṁ etadavocuṁ: \"yamakassa nāma, āvuso sāriputta, bhikkhuno evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ: ‘tathāhaṁ bhagavatā dhammaṁ desitaṁ ājānāmi yathā khīṇāsavo bhikkhu kāyassa bhedā ucchijjati vinassati, na hoti paraṁ maraṇā’ti. Sādhāyasmā sāriputto yena yamako bhikkhu tenupasaṅkamatu anukampāṁ upādāyā\"ti. Adhivāsesi kho āyasmā sāriputto tuṇhībhāvena.",
    "sn22.85:6": "\"Saccaṁ kira te, āvuso yamaka, evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ: ‘tathāhaṁ bhagavatā dhammaṁ desitaṁ ājānāmi, yathā khīṇāsavo bhikkhu kāyassa bhedā ucchijjati vinassati, na hoti paraṁ maraṇā’\"ti?",
    "sn22.85:7": "\"Taṁ kiṁ maññasi, āvuso yamaka, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, āvuso\". \"Vedanā niccā … saññā … saṅkhārā … viññāṇaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, āvuso\". \"Tasmātiha … pe … evaṁ passaṁ … pe … nāparaṁ itthattāyāti pajānāti.",
    "sn22.85:8": "Taṁ kiṁ maññasi, āvuso yamaka, rūpaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, āvuso\" …  \"vedanāṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, āvuso\" …  \"saññaṁ … saṅkhāre … viññāṇaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, āvuso\".",
    "sn22.85:9": "\"Taṁ kiṁ maññasi, āvuso yamaka, rūpasmiṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, āvuso\". \"Aññatra rūpā tathāgatoti samanupassasī\"ti? \"No hetaṁ, āvuso\". \"Vedanāya … aññatra vedanāya … pe … saññāya … aññatra saññāya … saṅkhāresu … aññatra saṅkhārehi … viññāṇasmiṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, āvuso\". \"Aññatra viññāṇā tathāgatoti samanupassasī\"ti? \"No hetaṁ, āvuso\".",
    "sn22.85:10": "\"Taṁ kiṁ maññasi, āvuso yamaka, rūpaṁ … vedanāṁ … saññaṁ … saṅkhāre … viññāṇaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, āvuso\".",
    "sn22.85:11": "\"Taṁ kiṁ maññasi, āvuso yamaka, ayaṁ so arūpī … avedano … asaññī … asaṅkhāro … aviññāṇo tathāgatoti samanupassasī\"ti? \"No hetaṁ, āvuso\".",
    "sn22.85:12": "\"Ahu kho me taṁ, āvuso sāriputta, pubbe aviddasuno pāpakaṁ diṭṭhigataṁ; idañca panāyasmato sāriputtassa dhammadesanaṁ sutvā tañceva pāpakaṁ diṭṭhigataṁ pahīnaṁ, dhammo ca me abhisamito\"ti.",
    "sn22.85:13": "\"Sace taṁ, āvuso yamaka, evaṁ puccheyyuṁ: ‘yo so, āvuso yamaka, bhikkhu arahaṁ khīṇāsavo so kāyassa bhedā paraṁ maraṇā kiṁ hotī’ti? Evaṁ puṭṭho tvaṁ, āvuso yamaka, kinti byākareyyāsī\"ti?",
    "sn22.85:14": "\"Sādhu sādhu, āvuso yamaka. Tena hāvuso yamaka, upamaṁ te karissāmi etasseva atthassa bhiyyoso mattāya ñāṇāya. Seyyathāpi, āvuso yamaka, gahapati vā gahapatiputto vā aḍḍho mahaddhano mahābhogo; so ca ārakkhasampanno. Tassa kocideva puriso uppajjeyya anatthakāmo ahitakāmo ayogakkhemakāmo jīvitā voropetukāmo. Tassa evamassa: ‘Ayaṁ kho gahapati vā gahapatiputto vā aḍḍho mahaddhano mahābhogo; so ca ārakkhasampanno; nāyaṁ sukaro pasayha jīvitā voropetuṁ. Yannūnāhaṁ anupakhajja jīvitā voropeyyan’ti.",
    "sn22.85:15": "Taṁ kiṁ maññasi, āvuso yamaka, yadā hi so puriso amuṁ gahapatiṁ vā gahapatiputtaṁ vā upasaṅkamitvā evaṁ āha: ‘upaṭṭhaheyyaṁ taṁ, bhante’ti, tadāpi so vadhakova. Vadhakañca pana santaṁ na aññāsi: ‘vadhako me’ti. Yadāpi so upaṭṭhahati pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī, tadāpi so vadhakova. Vadhakañca pana santaṁ na aññāsi: ‘vadhako me’ti. Yadāpi naṁ rahogataṁ viditvā tiṇhena satthena jīvitā voropeti, tadāpi so vadhakova. Vadhakañca pana santaṁ na aññāsi: ‘vadhako me’\"ti.",
    "sn22.85:16": "So aniccaṁ rūpaṁ ‘aniccaṁ rūpan’ti yathābhūtaṁ nappajānāti. Aniccaṁ vedanāṁ ‘aniccā vedanā’ti yathābhūtaṁ nappajānāti. Aniccaṁ saññaṁ ‘aniccā saññā’ti yathābhūtaṁ nappajānāti. Anicce saṅkhāre ‘aniccā saṅkhārā’ti yathābhūtaṁ nappajānāti. Aniccaṁ viññāṇaṁ ‘aniccaṁ viññāṇan’ti yathābhūtaṁ nappajānāti.",
    "sn22.85:17": "Dukkhaṁ rūpaṁ ‘dukkhaṁ rūpan’ti yathābhūtaṁ nappajānāti. Dukkhaṁ vedanāṁ … dukkhaṁ saññaṁ … dukkhe saṅkhāre … dukkhaṁ viññāṇaṁ ‘dukkhaṁ viññāṇan’ti yathābhūtaṁ nappajānāti.",
    "sn22.85:18": "Anattaṁ rūpaṁ ‘anattā rūpan’ti yathābhūtaṁ nappajānāti. Anattaṁ vedanāṁ … anattaṁ saññaṁ … anatte saṅkhāre … anattaṁ viññāṇaṁ ‘anattaṁ viññāṇan’ti yathābhūtaṁ nappajānāti.",
    "sn22.85:19": "Saṅkhataṁ rūpaṁ ‘saṅkhataṁ rūpan’ti yathābhūtaṁ nappajānāti. Saṅkhataṁ vedanāṁ … saṅkhataṁ saññaṁ … saṅkhate saṅkhāre … saṅkhataṁ viññāṇaṁ ‘saṅkhataṁ viññāṇan’ti yathābhūtaṁ nappajānāti.",
    "sn22.85:20": "Vadhakaṁ rūpaṁ ‘vadhakaṁ rūpan’ti yathābhūtaṁ nappajānāti. Vadhakaṁ vedanāṁ ‘vadhakā vedanā’ti … vadhakaṁ saññaṁ ‘vadhakā saññā’ti … vadhake saṅkhāre ‘vadhakā saṅkhārā’ti yathābhūtaṁ nappajānāti. Vadhakaṁ viññāṇaṁ ‘vadhakaṁ viññāṇan’ti yathābhūtaṁ nappajānāti.",
    "sn22.85:21": "So rūpaṁ upeti upādiyati adhiṭṭhāti ‘attā me’ti. vedanāṁ … saññaṁ … saṅkhāre … viññāṇaṁ upeti upādiyati adhiṭṭhāti ‘attā me’ti. Tassime pañcupādānakkhandhā upetā upādinnā dīgharattaṁ ahitāya dukkhāya saṁvattanti.",
    "sn22.85:22": "Sutavā ca kho, āvuso, ariyasāvako ariyānaṁ dassāvī … pe … sappurisadhamme suvinīto na rūpaṁ attato samanupassati, na rūpavantaṁ attānaṁ; na attani rūpaṁ, na rūpasmiṁ attānaṁ.",
    "sn22.85:23": "So aniccaṁ rūpaṁ ‘aniccaṁ rūpan’ti yathābhūtaṁ pajānāti. Aniccaṁ vedanāṁ … aniccaṁ saññaṁ … anicce saṅkhāre … aniccaṁ viññāṇaṁ ‘aniccaṁ viññāṇan’ti yathābhūtaṁ pajānāti.",
    "sn22.85:24": "Dukkhaṁ rūpaṁ ‘dukkhaṁ rūpan’ti yathābhūtaṁ pajānāti. Dukkhaṁ vedanāṁ … dukkhaṁ saññaṁ … dukkhe saṅkhāre … dukkhaṁ viññāṇaṁ ‘dukkhaṁ viññāṇan’ti yathābhūtaṁ pajānāti.",
    "sn22.85:25": "Anattaṁ rūpaṁ ‘anattā rūpan’ti yathābhūtaṁ pajānāti. Anattaṁ vedanāṁ … anattaṁ saññaṁ … anatte saṅkhāre … anattaṁ viññāṇaṁ ‘anattā viññāṇan’ti yathābhūtaṁ pajānāti.",
    "sn22.85:26": "Saṅkhataṁ rūpaṁ ‘saṅkhataṁ rūpan’ti yathābhūtaṁ pajānāti. Saṅkhataṁ vedanāṁ … saṅkhataṁ saññaṁ … saṅkhate saṅkhāre … saṅkhataṁ viññāṇaṁ ‘saṅkhataṁ viññāṇan’ti yathābhūtaṁ pajānāti.",
    "sn22.85:27": "Vadhakaṁ rūpaṁ ‘vadhakaṁ rūpan’ti yathābhūtaṁ pajānāti. Vadhakaṁ vedanāṁ … vadhakaṁ saññaṁ … vadhake saṅkhāre ‘vadhakā saṅkhārā’ti yathābhūtaṁ pajānāti. Vadhakaṁ viññāṇaṁ ‘vadhakaṁ viññāṇan’ti yathābhūtaṁ pajānāti.",
    "sn22.85:28": "So rūpaṁ na upeti, na upādiyati, nādhiṭṭhāti: ‘attā me’ti. vedanāṁ … saññaṁ … saṅkhāre … viññāṇaṁ na upeti, na upādiyati, nādhiṭṭhāti: ‘attā me’ti. Tassime pañcupādānakkhandhā anupetā anupādinnā dīgharattaṁ hitāya sukhāya saṁvattantī\"ti."
}