{
    "sn22.86:1": "Ekaṁ samayaṁ bhagavā vesāliyaṁ vihārati mahāvane kūṭāgārasālāyaṁ. Tena kho pana samayena āyasmā anurādho bhagavato avidūre araññakuṭikāyaṁ vihārati. Atha kho sambahulā aññatitthiyā paribbājakā yenāyasmā anurādho tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā anurādhena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te aññatitthiyā paribbājakā āyasmantaṁ anurādhaṁ etadavocuṁ:",
    "sn22.86:2": "Evaṁ vutte, āyasmā anurādho te aññatitthiye paribbājake etadavoca: \"yo so āvuso tathāgato uttamapuriso paramapuriso paramapattipatto taṁ tathāgato aññatra imehi catūhi ṭhānehi paññāpayamāno paññāpeti: ‘hoti tathāgato paraṁ maraṇā’ti vā, ‘Na hoti tathāgato paraṁ maraṇā’ti vā, ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’ti vā, ‘neva hoti na na hoti tathāgato paraṁ maraṇā’ti vā\"ti.",
    "sn22.86:3": "Atha kho āyasmato anurādhassa acirapakkantesu tesu aññatitthiyesu paribbājakesu etadahosi: \"Sace kho maṁ te aññatitthiyā paribbājakā uttariṁ pañhaṁ puccheyyuṁ. Kathaṁ byākaramāno nu khvāhaṁ tesaṁ aññatitthiyānaṁ paribbājakānaṁ vuttavādī ceva bhagavato assaṁ, na ca bhagavantaṁ abhūtena abbhācikkheyyaṁ, dhammassa cānudhammaṁ byākareyyaṁ, na ca koci sahadhammiko vādānuvādo gārayhaṁ ṭhānaṁ āgaccheyyā\"ti?",
    "sn22.86:4": "Atha kho āyasmā anurādho yena bhagavā tenupasaṅkami; upasaṅkamitvā … pe … ekamantaṁ nisinno kho āyasmā anurādho bhagavantaṁ etadavoca: \"Idhāhaṁ, bhante, bhagavato avidūre araññakuṭikāyaṁ viharāmi. Atha kho, bhante, sambahulā aññatitthiyā paribbājakā yenāhaṁ tenupasaṅkamiṁsu … pe … maṁ etadavocuṁ: ‘yo so, āvuso anurādha, tathāgato uttamapuriso paramapuriso paramapattipatto taṁ tathāgato imesu catūsu ṭhānesu paññāpayamāno paññāpeti – hoti tathāgato paraṁ maraṇāti vā, na hoti … hoti ca na ca hoti, neva hoti na na hoti tathāgato paraṁ maraṇāti vā’\"ti?",
    "sn22.86:5": "Evaṁ vuttāhaṁ, bhante, te aññatitthiye paribbājake etadavocaṁ: \"yo so, āvuso, tathāgato uttamapuriso paramapuriso paramapattipatto, taṁ tathāgato aññatra imehi catūhi ṭhānehi paññāpayamāno paññāpeti: ‘hoti tathāgato paraṁ maraṇā’ti vā … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’ti vāti. Evaṁ vutte, bhante, te aññatitthiyā paribbājakā maṁ etadavocuṁ: ‘so cāyaṁ bhikkhu na vo bhavissati acirapabbajito thero vā pana bālo abyatto’ti. Atha kho maṁ, bhante, te aññatitthiyā paribbājakā navavādena ca bālavādena ca apasādetvā uṭṭhāyāsanā pakkamiṁsu.",
    "sn22.86:6": "Tassa mayhaṁ, bhante, acirapakkantesu tesu aññatitthiyesu paribbājakesu etadahosi: ‘sace kho maṁ te aññatitthiyā paribbājakā uttariṁ pañhaṁ puccheyyuṁ. Kathaṁ byākaramāno nu khvāhaṁ tesaṁ aññatitthiyānaṁ paribbājakānaṁ vuttavādī ceva bhagavato assaṁ, na ca bhagavantaṁ abhūtena abbhācikkheyyaṁ, dhammassa cānudhammaṁ byākareyyaṁ, na ca koci sahadhammiko vādānuvādo gārayhaṁ ṭhānaṁ āgaccheyyā’\"ti?",
    "sn22.86:7": "\"Taṁ kiṁ maññasi, anurādha, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti? \"Dukkhaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti? \"No hetaṁ, bhante\". \"Vedanā … saññā … saṅkhārā … viññāṇaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\" … pe … tasmātiha … pe … evaṁ passaṁ … pe … nāparaṁ itthattāyāti pajānāti\".",
    "sn22.86:8": "\"Taṁ kiṁ maññasi, anurādha, rūpaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"vedanāṁ … saññaṁ … saṅkhāre … viññāṇaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\".",
    "sn22.86:9": "\"Taṁ kiṁ maññasi, anurādha, rūpasmiṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Aññatra rūpā tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Vedanāya … pe … aññatra vedanāya … pe … saññāya … aññatra saññāya … saṅkhāresu … aññatra saṅkhārehi … viññāṇasmiṁ … aññatra viññāṇā tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\".",
    "sn22.86:10": "\"Taṁ kiṁ maññasi, anurādha, rūpaṁ … vedanā … saññā … saṅkhārā … viññāṇaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\".",
    "sn22.86:11": "\"Taṁ kiṁ maññasi, anurādha, ayaṁ so arūpī … avedano … asaññī … asaṅkhāro … aviññāṇo tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\".",
    "sn22.86:12": "\"Ettha ca te, anurādha, diṭṭheva dhamme saccato thetato tathāgate anupalabbhiyamāne kallaṁ nu te taṁ veyyākaraṇaṁ: ‘yo so, āvuso, tathāgato uttamapuriso paramapuriso paramapattipatto taṁ tathāgato aññatra imehi catūhi ṭhānehi paññāpayamāno paññāpeti – hoti tathāgato paraṁ maraṇāti vā … na hoti … hoti ca na ca hoti … neva hoti na na hoti tathāgato paraṁ maraṇāti vā’\"ti?",
    "sn22.86:13": "\"Sādhu sādhu, anurādha. Pubbe cāhaṁ, anurādha, etarahi ca dukkhañceva paññapemi, dukkhassa ca nirodhan\"ti."
}