{
    "sn22.88:1": "Ekaṁ samayaṁ bhagavā rājagahe vihārati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā assaji kassapakārāme vihārati ābādhiko dukkhito bāḷhagilāno. Atha kho āyasmā assaji upaṭṭhāke āmantesi: \"etha tumhe, āvuso, yena bhagavā tenupasaṅkamatha; upasaṅkamitvā mama vacanena bhagavato pāde sirasā vandatha: ‘assaji, bhante, bhikkhu ābādhiko dukkhito bāḷhagilāno. So bhagavato pāde sirasā vandatī’ti. Evañca vadetha: ‘sādhu kira, bhante, bhagavā yena assaji bhikkhu tenupasaṅkamatu anukampāṁ upādāyā’\"ti. \"Evamāvuso\"ti kho te bhikkhū āyasmato assajissa paṭissutvā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ: \"assaji, bhante, bhikkhu ābādhiko … pe … sādhu kira, bhante, bhagavā yena assaji bhikkhu tenupasaṅkamatu anukampāṁ upādāyā\"ti. Adhivāsesi bhagavā tuṇhībhāvena.",
    "sn22.88:2": "Atha kho bhagavā sāyanhasamayaṁ paṭisallānā vuṭṭhito yenāyasmā assaji tenupasaṅkami. Addasā kho āyasmā assaji bhagavantaṁ dūratova āgacchantaṁ. Disvāna mañcake samadhosi. Atha kho bhagavā āyasmantaṁ assajiṁ etadavoca: \"Alaṁ, assaji, mā tvaṁ mañcake samadhosi. Santimāni āsanāni paññattāni, tatthāhaṁ nisīdissāmī\"ti. Nisīdi bhagavā paññatte āsane. Nisajja kho bhagavā āyasmantaṁ assajiṁ etadavoca: \"Kacci te, assaji, khamanīyaṁ, kacci yāpanīyaṁ … pe … paṭikkamosānaṁ paññāyati no abhikkamo\"ti?",
    "sn22.88:3": "\"Na me, bhante, khamanīyaṁ … pe … abhikkamosānaṁ paññāyati no paṭikkamo\"ti.",
    "sn22.88:4": "Taṁ kiṁ maññasi, assaji, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\" … pe … viññāṇaṁ … pe … \"tasmātiha … pe … evaṁ passaṁ … pe … nāparaṁ itthattāyāti pajānātīti.",
    "sn22.88:5": "Seyyathāpi, assaji, telañca paṭicca, vaṭṭiñca paṭicca, telappadīpo jhāyeyya; tasseva telassa ca vaṭṭiyā ca pariyādānā anāhāro nibbāyeyya. Evameva kho, assaji, bhikkhu kāyapariyantikaṁ vedanāṁ vedayamāno ‘kāyapariyantikaṁ vedanāṁ vedayāmī’ti pajānāti. Jīvitapariyantikaṁ vedanāṁ vedayamāno ‘jīvitapariyantikaṁ vedanāṁ vedayāmī’ti pajānāti. ‘Kāyassa bhedā uddhaṁ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti pajānātī\"ti."
}