{
    "sn22.81:1": "Ekaṁ samayaṁ bhagavā kosambiyaṁ vihārati ghositārāme.",
    "sn22.81:2": "Atha kho aññataro bhikkhu acirapakkantassa bhagavato yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṁ Ānandaṁ etadavoca: \"esāvuso Ānanda, bhagavā sāmaṁ senāsanaṁ saṁsāmetvā pattacīvaramādāya anāmantetvā upaṭṭhāke anapaloketvā bhikkhusaṅghaṁ eko adutiyo cārikaṁ pakkanto\"ti.",
    "sn22.81:3": "Atha kho bhagavā anupubbena cārikaṁ caramāno yena pālileyyakaṁ tadavasari. Tatra sudaṁ bhagavā pālileyyake vihārati bhaddasālamūle.",
    "sn22.81:4": "Atha kho āyasmā ānando tehi bhikkhūhi saddhiṁ yena pālileyyakaṁ bhaddasālamūlaṁ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinne kho te bhikkhū bhagavā dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṁsesi. Tena kho pana samayena aññatarassa bhikkhuno evaṁ cetaso parivitakko udapādi: \"Kathaṁ nu kho jānato kathaṁ passato anantarā āsavānaṁ khayo hotī\"ti?",
    "sn22.81:5": "Kathañca, bhikkhave, jānato kathaṁ passato anantarā āsavānaṁ khayo hoti? Idha bhikkhave, assutavā puthujjano ariyānaṁ adassāvī ariyadhammassa akovido ariyadhamme avinīto, sappurisānaṁ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto rūpaṁ attato samanupassati. Yā kho pana sā, bhikkhave, samanupassanā saṅkhāro so. So pana saṅkhāro kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo? Avijjāsamphassajena, bhikkhave, vedayitena phuṭṭhassa assutavato puthujjanassa uppannā taṇhā; tatojo so saṅkhāro.",
    "sn22.81:6": "Na heva kho rūpaṁ attato samanupassati; api ca kho rūpavantaṁ attānaṁ samanupassati. Yā kho pana sā, bhikkhave, samanupassanā saṅkhāro so. So pana saṅkhāro kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo? Avijjāsamphassajena, bhikkhave, vedayitena phuṭṭhassa assutavato puthujjanassa uppannā taṇhā; tatojo so saṅkhāro. Iti kho, bhikkhave, sopi saṅkhāro anicco saṅkhato paṭiccasamuppanno. Sāpi taṇhā … sāpi vedanā … sopi phasso … sāpi avijjā aniccā saṅkhatā paṭiccasamuppannā. Evampi kho, bhikkhave, jānato evaṁ passato anantarā āsavānaṁ khayo hoti.",
    "sn22.81:7": "Na heva kho rūpaṁ attato samanupassati, na rūpavantaṁ attānaṁ samanupassati; api ca kho attani rūpaṁ samanupassati. Yā kho pana sā, bhikkhave, samanupassanā saṅkhāro so. So pana saṅkhāro kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo? Avijjāsamphassajena, bhikkhave, vedayitena phuṭṭhassa assutavato puthujjanassa uppannā taṇhā; tatojo so saṅkhāro. Iti kho, bhikkhave, sopi saṅkhāro anicco saṅkhato paṭiccasamuppanno. Sāpi taṇhā … sāpi vedanā … sopi phasso … sāpi avijjā aniccā saṅkhatā paṭiccasamuppannā. Evampi kho, bhikkhave, jānato evaṁ passato anantarā āsavānaṁ khayo hoti.",
    "sn22.81:8": "Na heva kho rūpaṁ attato samanupassati, na rūpavantaṁ attānaṁ samanupassati, na attani rūpaṁ samanupassati; api ca kho rūpasmiṁ attānaṁ samanupassati. Yā kho pana sā, bhikkhave, samanupassanā saṅkhāro so. So pana saṅkhāro kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo? Avijjāsamphassajena, bhikkhave, vedayitena phuṭṭhassa assutavato puthujjanassa uppannā taṇhā; tatojo so saṅkhāro. Iti kho, bhikkhave, sopi saṅkhāro anicco saṅkhato paṭiccasamuppanno. Sāpi taṇhā … sāpi vedanā … sopi phasso … sāpi avijjā aniccā saṅkhatā paṭiccasamuppannā. Evampi kho, bhikkhave, jānato … pe … āsavānaṁ khayo hoti.",
    "sn22.81:9": "Na heva kho rūpaṁ attato samanupassati, na rūpavantaṁ attānaṁ, na attani rūpaṁ, na rūpasmiṁ attānaṁ samanupassati; api ca kho vedanāṁ attato samanupassati, api ca kho vedanāvantaṁ attānaṁ samanupassati, api ca kho attani vedanāṁ samanupassati, api ca kho vedanāya attānaṁ samanupassati; api ca kho saññaṁ … api ca kho saṅkhāre attato samanupassati, api ca kho saṅkhāravantaṁ attānaṁ samanupassati, api ca kho attani saṅkhāre samanupassati, api ca kho saṅkhāresu attānaṁ samanupassati; api ca kho viññāṇaṁ attato samanupassati, api ca kho viññāṇavantaṁ attānaṁ, api ca kho attani viññāṇaṁ, api ca kho viññāṇasmiṁ attānaṁ samanupassati. Yā kho pana sā, bhikkhave, samanupassanā saṅkhāro so. So pana saṅkhāro kiṁnidāno … pe … kiṁpabhavo? Avijjāsamphassajena, bhikkhave, vedayitena phuṭṭhassa assutavato puthujjanassa uppannā taṇhā; tatojo so saṅkhāro. Iti kho, bhikkhave, sopi saṅkhāro anicco saṅkhato paṭiccasamuppanno. Sāpi taṇhā … sāpi vedanā … sopi phasso … sāpi avijjā aniccā saṅkhatā paṭiccasamuppannā. Evaṁ kho, bhikkhave, jānato evaṁ passato anantarā āsavānaṁ khayo hoti.",
    "sn22.81:10": "Na heva kho rūpaṁ attato samanupassati, na vedanāṁ attato samanupassati, na saññaṁ … na saṅkhāre … na viññāṇaṁ attato samanupassati; api ca kho evaṁdiṭṭhi hoti: ‘so attā so loko, so pecca bhavissāmi nicco dhuvo sassato avipariṇāmadhammo’ti. Yā kho pana sā, bhikkhave, sassatadiṭṭhi saṅkhāro so. So pana saṅkhāro kiṁnidāno … pe … evampi kho, bhikkhave, jānato evaṁ passato anantarā āsavānaṁ khayo hoti.",
    "sn22.81:11": "Na heva kho rūpaṁ attato samanupassati, na vedanāṁ … na saññaṁ … na saṅkhāre … na viññāṇaṁ attato samanupassati; nāpi evaṁdiṭṭhi hoti: ‘so attā so loko, so pecca bhavissāmi nicco dhuvo sassato avipariṇāmadhammo’ti. Api ca kho evaṁdiṭṭhi hoti: ‘no cassaṁ no ca me siyā nābhavissaṁ na me bhavissatī’ti. Yā kho pana sā, bhikkhave, ucchedadiṭṭhi saṅkhāro so. So pana saṅkhāro kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo? Avijjāsamphassajena, bhikkhave, vedayitena phuṭṭhassa assutavato puthujjanassa uppannā taṇhā; tatojo so saṅkhāro. Iti kho, bhikkhave, sopi saṅkhāro anicco … pe … evampi kho, bhikkhave, jānato evaṁ passato anantarā āsavānaṁ khayo hoti.",
    "sn22.81:12": "Na heva kho rūpaṁ attato samanupassati, na vedanāṁ … na saññaṁ … na saṅkhāre … na viññāṇaṁ attato samanupassati … pe … na viññāṇasmiṁ attato samanupassati, nāpi evaṁdiṭṭhi hoti: ‘so attā so loko, so pecca bhavissāmi nicco dhuvo sassato avipariṇāmadhammo’ti; nāpi evaṁdiṭṭhi hoti: ‘no cassaṁ no ca me siyā nābhavissaṁ na me bhavissatī’ti; api ca kho kaṅkhī hoti vicikicchī aniṭṭhaṅgato saddhamme. Yā kho pana sā, bhikkhave, kaṅkhītā vicikicchitā aniṭṭhaṅgatatā saddhamme saṅkhāro so. So pana saṅkhāro kiṁnidāno kiṁsamudayo kiṁjātiko kiṁpabhavo? Avijjāsamphassajena, bhikkhave, vedayitena phuṭṭhassa assutavato puthujjanassa uppannā taṇhā; tatojo so saṅkhāro."
}