{
    "sn22.57:1": "Sāvatthinidānaṁ. \"Sattaṭṭhānakusalo, bhikkhave, bhikkhu tividhūpaparikkhī imasmiṁ dhammavinaye kevalī vusitavā uttamapurisoti vuccati.",
    "sn22.57:2": "Katamañca, bhikkhave, rūpaṁ? Cattāro ca mahābhūtā, catunnañca mahābhūtānaṁ upādāya rūpaṁ. Idaṁ vuccati, bhikkhave, rūpaṁ. Āhārasamudayā rūpasamudayo; āhāranirodhā rūpanirodho. Ayameva ariyo aṭṭhaṅgiko maggo rūpanirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn22.57:3": "Yaṁ rūpaṁ paṭicca uppajjati sukhaṁ somanassaṁ – ayaṁ rūpassa assādo. Yaṁ rūpaṁ aniccaṁ dukkhaṁ vipariṇāmadhammaṁ – ayaṁ rūpassa ādīnavo. Yo rūpasmiṁ chandarāgavinayo chandarāgappahānaṁ – idaṁ rūpassa nissaraṇaṁ.",
    "sn22.57:4": "Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ rūpaṁ abhiññāya, evaṁ rūpasamudayaṁ abhiññāya, evaṁ rūpanirodhaṁ abhiññāya, evaṁ rūpanirodhagāminiṁ paṭipadāṁ abhiññāya; evaṁ rūpassa assādaṁ abhiññāya, evaṁ rūpassa ādīnavaṁ abhiññāya, evaṁ rūpassa nissaraṇaṁ abhiññāya rūpassa nibbidāya virāgāya nirodhāya paṭipannā, te suppaṭipannā. Ye suppaṭipannā, te imasmiṁ dhammavinaye gādhanti.",
    "sn22.57:5": "Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ rūpaṁ abhiññāya, evaṁ rūpasamudayaṁ abhiññāya, evaṁ rūpanirodhaṁ abhiññāya, evaṁ rūpanirodhagāminiṁ paṭipadāṁ abhiññāya; evaṁ rūpassa assādaṁ abhiññāya, evaṁ rūpassa ādīnavaṁ abhiññāya, evaṁ rūpassa nissaraṇaṁ abhiññāya rūpassa nibbidā virāgā nirodhā anupādā vimuttā, te suvimuttā. Ye suvimuttā, te kevalino. Ye kevalino vaṭṭaṁ tesaṁ natthi paññāpanāya.",
    "sn22.57:6": "Katamā ca, bhikkhave, vedanā? Chayime, bhikkhave, vedanākāyā – cakkhusamphassajā vedanā … pe … manosamphassajā vedanā. Ayaṁ vuccati, bhikkhave, vedanā. Phassasamudayā vedanāsamudayo; phassanirodhā vedanānirodho. Ayameva ariyo aṭṭhaṅgiko maggo vedanānirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn22.57:7": "Yaṁ vedanāṁ paṭicca uppajjati sukhaṁ somanassaṁ – ayaṁ vedanāya assādo. Yā vedanā aniccā dukkhā vipariṇāmadhammā – ayaṁ vedanāya ādīnavo. Yo vedanāya chandarāgavinayo chandarāgappahānaṁ – idaṁ vedanāya nissaraṇaṁ.",
    "sn22.57:8": "Ye hi, keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ vedanāṁ abhiññāya, evaṁ vedanāsamudayaṁ abhiññāya, evaṁ vedanānirodhaṁ abhiññāya, evaṁ vedanānirodhagāminiṁ paṭipadāṁ abhiññāya; evaṁ vedanāya assādaṁ abhiññāya, evaṁ vedanāya ādīnavaṁ abhiññāya, evaṁ vedanāya nissaraṇaṁ abhiññāya vedanāya nibbidāya virāgāya nirodhāya paṭipannā, te suppaṭipannā. Ye suppaṭipannā, te imasmiṁ dhammavinaye gādhanti.",
    "sn22.57:9": "Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ vedanāṁ abhiññāya … pe … vaṭṭaṁ tesaṁ natthi paññāpanāya.",
    "sn22.57:10": "Katamā ca, bhikkhave, saññā? Chayime, bhikkhave, saññākāyā – rūpasaññā, saddasaññā, gandhasaññā, rasasaññā, phoṭṭhabbasaññā, dhammasaññā. Ayaṁ vuccati, bhikkhave, saññā. Phassasamudayā saññāsamudayo; phassanirodhā saññānirodho. Ayameva ariyo aṭṭhaṅgiko maggo saññānirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi … pe … vaṭṭaṁ tesaṁ natthi paññāpanāya.",
    "sn22.57:11": "Katame ca, bhikkhave, saṅkhārā? Chayime, bhikkhave, cetanākāyā – rūpasañcetanā … pe … dhammasañcetanā. Ime vuccanti, bhikkhave, saṅkhārā. Phassasamudayā saṅkhārasamudayo; phassanirodhā saṅkhāranirodho. Ayameva ariyo aṭṭhaṅgiko maggo saṅkhāranirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn22.57:12": "Yaṁ saṅkhāre paṭicca uppajjati sukhaṁ somanassaṁ – ayaṁ saṅkhārānaṁ assādo. Ye saṅkhārā aniccā dukkhā vipariṇāmadhammā – ayaṁ saṅkhārānaṁ ādīnavo. Yo saṅkhāresu chandarāgavinayo chandarāgappahānaṁ – idaṁ saṅkhārānaṁ nissaraṇaṁ.",
    "sn22.57:13": "Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ saṅkhāre abhiññāya, evaṁ saṅkhārasamudayaṁ abhiññāya, evaṁ saṅkhāranirodhaṁ abhiññāya, evaṁ saṅkhāranirodhagāminiṁ paṭipadāṁ abhiññāya … pe … saṅkhārānaṁ nibbidāya virāgāya nirodhāya paṭipannā te suppaṭipannā. Ye suppaṭipannā, te imasmiṁ dhammavinaye gādhanti … pe … vaṭṭaṁ tesaṁ natthi paññāpanāya.",
    "sn22.57:14": "Katamañca, bhikkhave, viññāṇaṁ? Chayime, bhikkhave, viññāṇakāyā – cakkhuviññāṇaṁ, sotaviññāṇaṁ, ghānaviññāṇaṁ, jivhāviññāṇaṁ, kāyaviññāṇaṁ, manoviññāṇaṁ. Idaṁ vuccati, bhikkhave, viññāṇaṁ. Nāmarūpasamudayā viññāṇasamudayo; nāmarūpanirodhā viññāṇanirodho. Ayameva ariyo aṭṭhaṅgiko maggo viññāṇanirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn22.57:15": "Yaṁ viññāṇaṁ paṭicca uppajjati sukhaṁ somanassaṁ – ayaṁ viññāṇassa assādo. Yaṁ viññāṇaṁ aniccaṁ dukkhaṁ vipariṇāmadhammaṁ – ayaṁ viññāṇassa ādīnavo. Yo viññāṇasmiṁ chandarāgavinayo chandarāgappahānaṁ – idaṁ viññāṇassa nissaraṇaṁ.",
    "sn22.57:16": "Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ viññāṇaṁ abhiññāya, evaṁ viññāṇasamudayaṁ abhiññāya, evaṁ viññāṇanirodhaṁ abhiññāya, evaṁ viññāṇanirodhagāminiṁ paṭipadāṁ abhiññāya; evaṁ viññāṇassa assādaṁ abhiññāya, evaṁ viññāṇassa ādīnavaṁ abhiññāya, evaṁ viññāṇassa nissaraṇaṁ abhiññāya viññāṇassa nibbidāya virāgāya nirodhāya paṭipannā, te suppaṭipannā. Ye suppaṭipannā, te imasmiṁ dhammavinaye gādhanti.",
    "sn22.57:17": "Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ viññāṇaṁ abhiññāya, evaṁ viññāṇasamudayaṁ abhiññāya, evaṁ viññāṇanirodhaṁ abhiññāya, evaṁ viññāṇanirodhagāminiṁ paṭipadāṁ abhiññāya; evaṁ viññāṇassa assādaṁ abhiññāya, evaṁ viññāṇassa ādīnavaṁ abhiññāya, evaṁ viññāṇassa nissaraṇaṁ abhiññāya viññāṇassa nibbidā virāgā nirodhā anupādā vimuttā, te suvimuttā. Ye suvimuttā, te kevalino. Ye kevalino vaṭṭaṁ tesaṁ natthi paññāpanāya.",
    "sn22.57:18": "Kathañca, bhikkhave, bhikkhu tividhūpaparikkhī hoti? Idha, bhikkhave, bhikkhu dhātuso upaparikkhati, āyatanaso upaparikkhati, paṭiccasamup pāda so upaparikkhati."
}