{
    "sn22.101:1": "Sāvatthinidānaṁ. \"Jānato ahaṁ, bhikkhave, passato āsavānaṁ khayaṁ vadāmi, no ajānato no apassato. Kiñca, bhikkhave, jānato kiṁ passato āsavānaṁ khayo hoti? ‘Iti rūpaṁ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā … iti saññā … iti saṅkhārā … iti viññāṇaṁ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti – evaṁ kho, bhikkhave, jānato evaṁ passato āsavānaṁ khayo hoti.",
    "sn22.101:2": "Bhāvanānuyogaṁ ananuyuttassa, bhikkhave, bhikkhuno vihārato kiñcāpi evaṁ icchā uppajjeyya: ‘aho vata me anupādāya āsavehi cittaṁ vimucceyyā’ti, atha khvassa neva anupādāya āsavehi cittaṁ vimuccati. Taṁ kissa hetu? ‘Abhāvitattā’ tissa vacanīyaṁ. Kissa abhāvitattā? Abhāvitattā catunnaṁ satipaṭṭhānānaṁ, abhāvitattā catunnaṁ sammappadhānānaṁ, abhāvitattā catunnaṁ iddhipādānaṁ, abhāvitattā pañcannaṁ indriyānaṁ, abhāvitattā pañcannaṁ balānaṁ, abhāvitattā sattannaṁ bojjhaṅgānaṁ, abhāvitattā ariyassa aṭṭhaṅgikassa maggassa.",
    "sn22.101:3": "Seyyathāpi, bhikkhave, kukkuṭiyā aṇḍāni aṭṭha vā dasa vā dvādasa vā. Tānassu kukkuṭiyā na sammā adhisayitāni, na sammā pariseditāni, na sammā paribhāvitāni. Kiñcāpi tassā kukkuṭiyā evaṁ icchā uppajjeyya: ‘aho vata me kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṁ padāletvā sotthinā abhinibbhijjeyyun’ti, atha kho abhabbāva te kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṁ padāletvā sotthinā abhinibbhijjituṁ. Taṁ kissa hetu? Tathā hi pana, bhikkhave, kukkuṭiyā aṇḍāni aṭṭha vā dasa vā dvādasa vā; tāni kukkuṭiyā na sammā adhisayitāni, na sammā pariseditāni, na sammā paribhāvitāni.",
    "sn22.101:4": "Bhāvanānuyogaṁ anuyuttassa, bhikkhave, bhikkhuno vihārato kiñcāpi na evaṁ icchā uppajjeyya: ‘aho vata me anupādāya āsavehi cittaṁ vimucceyyā’ti, atha khvassa anupādāya āsavehi cittaṁ vimuccati. Taṁ kissa hetu? ‘Bhāvitattā’tissa vacanīyaṁ. Kissa bhāvitattā? Bhāvitattā catunnaṁ satipaṭṭhānānaṁ, bhāvitattā catunnaṁ sammappadhānānaṁ, bhāvitattā catunnaṁ iddhipādānaṁ, bhāvitattā pañcannaṁ indriyānaṁ, bhāvitattā pañcannaṁ balānaṁ, bhāvitattā sattannaṁ bojjhaṅgānaṁ, bhāvitattā ariyassa aṭṭhaṅgikassa maggassa.",
    "sn22.101:5": "Seyyathāpi, bhikkhave, kukkuṭiyā aṇḍāni aṭṭha vā dasa vā dvādasa vā. Tānassu kukkuṭiyā sammā adhisayitāni, sammā pariseditāni, sammā paribhāvitāni. Kiñcāpi tassā kukkuṭiyā na evaṁ icchā uppajjeyya: ‘aho vata me kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṁ padāletvā sotthinā abhinibbhijjeyyun’ti, atha kho bhabbāva te kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṁ padāletvā sotthinā abhinibbhijjituṁ. Taṁ kissa hetu? Tathā hi pana, bhikkhave, kukkuṭiyā aṇḍāni aṭṭha vā dasa vā dvādasa vā; tānassu kukkuṭiyā sammā adhisayitāni, sammā pariseditāni, sammā paribhāvitāni.",
    "sn22.101:6": "Seyyathāpi, bhikkhave, palagaṇḍassa vā palagaṇḍantevāsissa vā vāsijaṭe dissanteva aṅgulipadāni dissati aṅguṭṭhapadaṁ. No ca khvassa evaṁ ñāṇaṁ hoti: ‘ettakaṁ vata me ajja vāsijaṭassa khīṇaṁ, ettakaṁ hiyyo, ettakaṁ pare’ti. Atha khvassa khīṇe khīṇantveva ñāṇaṁ hoti."
}