{
    "sn22.49:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā rājagahe vihārati veḷuvane kalandakanivāpe. Atha kho soṇo gahapatiputto yena bhagavā tenupasaṅkami … pe … ekamantaṁ nisinnaṁ kho soṇaṁ gahapatiputtaṁ bhagavā etadavoca:",
    "sn22.49:2": "\"Ye hi keci, soṇa, samaṇā vā brāhmaṇā vā aniccena rūpena dukkhena vipariṇāmadhammena ‘seyyohamasmī’ti vā samanupassanti; ‘sadisohamasmī’ti vā samanupassanti; ‘hīnohamasmī’ti vā samanupassanti; kimaññatra yathābhūtassa adassanā?",
    "sn22.49:3": "Ye ca kho keci, soṇa, samaṇā vā brāhmaṇā vā aniccena rūpena dukkhena vipariṇāmadhammena ‘seyyohamasmī’tipi na samanupassanti; ‘sadisohamasmī’tipi na samanupassanti; ‘hīnohamasmī’tipi na samanupassanti; kimaññatra yathābhūtassa dassanā? Aniccāya vedanāya … aniccāya saññāya … aniccehi saṅkhārehi … aniccena viññāṇena dukkhena vipariṇāmadhammena ‘seyyohamasmī’tipi na samanupassanti; ‘sadisohamasmī’tipi na samanupassanti; ‘hīnohamasmī’tipi na samanupassanti; kimaññatra yathābhūtassa dassanā?",
    "sn22.49:4": "Taṁ kiṁ maññasi, soṇa, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti? \"Dukkhaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti? \"No hetaṁ, bhante\".",
    "sn22.49:5": "\"Tasmātiha, soṇa, yaṁ kiñci rūpaṁ atītānāgatapaccuppannaṁ ajjhattaṁ vā bahiddhā vā oḷārikaṁ vā sukhumaṁ vā hīnaṁ vā paṇītaṁ vā yaṁ dūre santike vā, sabbaṁ rūpaṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti evametaṁ yathābhūtaṁ sammappaññāya daṭṭhabbaṁ.",
    "sn22.49:6": "Yā kāci vedanā … yā kāci saññā … ye keci saṅkhārā … yaṁ kiñci viññāṇaṁ atītānāgatapaccuppannaṁ ajjhattaṁ vā bahiddhā vā oḷārikaṁ vā sukhumaṁ vā hīnaṁ vā paṇītaṁ vā yaṁ dūre santike vā, sabbaṁ viññāṇaṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti evametaṁ yathābhūtaṁ sammappaññāya daṭṭhabbaṁ.",
    "sn22.49:7": "Evaṁ passaṁ, soṇa, sutavā ariyasāvako rūpasmimpi nibbindati, vedanāyapi nibbindati, saññāyapi nibbindati, saṅkhāresupi nibbindati, viññāṇasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati. Vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānātī\"ti."
}