{
    "sn22.2:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā sakkesu vihārati devadahaṁ nāma sakyānaṁ nigamo. Atha kho sambahulā pacchābhūmagamikā bhikkhū yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ:",
    "sn22.2:2": "\"Apalokito pana vo, bhikkhave, sāriputto\"ti?",
    "sn22.2:3": "Tena kho pana samayena āyasmā sāriputto bhagavato avidūre aññatarasmiṁ eḷagalāgumbe nisinno hoti. Atha kho te bhikkhū bhagavato bhāsitaṁ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā yenāyasmā sāriputto tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā sāriputtena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū āyasmantaṁ sāriputtaṁ etadavocuṁ:",
    "sn22.2:4": "\"Santi hāvuso, nānāverajjagataṁ bhikkhuṁ pañhaṁ pucchitāro – khattiyapaṇḍitāpi brāhmaṇapaṇḍitāpi gahapatipaṇḍitāpi samaṇapaṇḍitāpi. Paṇḍitā hāvuso, manussā vīmaṁsakā: ‘kiṁvādī panāyasmantānaṁ satthā kimakkhāyī’ti, kacci vo āyasmantānaṁ dhammā sussutā suggahitā sumanasikatā sūpadhāritā suppaṭividdhā paññāya, yathā byākaramānā āyasmanto vuttavādino ceva bhagavato assatha, na ca bhagavantaṁ abhūtena abbhācikkheyyātha, dhammassa cānudhammaṁ byākareyyātha, na ca koci sahadhammiko vādānuvādo gārayhaṁ ṭhānaṁ āgaccheyyā\"ti?",
    "sn22.2:5": "\"Dūratopi kho mayaṁ, āvuso, āgaccheyyāma āyasmato sāriputtassa santike etassa bhāsitassa atthamaññātuṁ. Sādhu vatāyasmantaṁyeva sāriputtaṁ paṭibhātu etassa bhāsitassa attho\"ti.",
    "sn22.2:6": "\"Santi hāvuso, nānāverajjagataṁ bhikkhuṁ pañhaṁ pucchitāro – khattiyapaṇḍitāpi … pe … samaṇapaṇḍitāpi. Paṇḍitā hāvuso, manussā vīmaṁsakā: ‘kiṁvādī panāyasmantānaṁ satthā kimakkhāyī’ti? Evaṁ puṭṭhā tumhe, āvuso, evaṁ byākareyyātha: ‘chandarāgavinayakkhāyī kho no, āvuso, satthā’ti.",
    "sn22.2:7": "Evaṁ byākatepi kho, āvuso, assuyeva uttariṁ pañhaṁ pucchitāro – khattiyapaṇḍitāpi … pe … samaṇapaṇḍitāpi. Paṇḍitā hāvuso, manussā vīmaṁsakā: ‘kismiṁ panāyasmantānaṁ chandarāgavinayakkhāyī satthā’ti? Evaṁ puṭṭhā tumhe, āvuso, evaṁ byākareyyātha: ‘rūpe kho, āvuso, chandarāgavinayakkhāyī satthā, vedanāya … saññāya … saṅkhāresu … viññāṇe chandarāgavinayakkhāyī satthā’ti.",
    "sn22.2:8": "Evaṁ byākatepi kho, āvuso, assuyeva uttariṁ pañhaṁ pucchitāro – khattiyapaṇḍitāpi … pe … samaṇapaṇḍitāpi. Paṇḍitā hāvuso, manussā vīmaṁsakā: ‘kiṁ panāyasmantānaṁ ādīnavaṁ disvā rūpe chandarāgavinayakkhāyī satthā, vedanāya … saññāya … saṅkhāresu … viññāṇe chandarāgavinayakkhāyī satthā’ti? Evaṁ puṭṭhā tumhe, āvuso, evaṁ byākareyyātha: ‘rūpe kho, āvuso, avigatarāgassa avigatacchandassa avigatapemassa avigatapipāsassa avigatapariḷāhassa avigātataṇhassa tassa rūpassa vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā. Vedanāya … saññāya … saṅkhāresu avigatarāgassa … pe … avigātataṇhassa tesaṁ saṅkhārānaṁ vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā. Viññāṇe avigatarāgassa avigatacchandassa avigatapemassa avigatapipāsassa avigatapariḷāhassa avigātataṇhassa tassa viññāṇassa vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā. Idaṁ kho no, āvuso, ādīnavaṁ disvā rūpe chandarāgavinayakkhāyī satthā, vedanāya … saññāya … saṅkhāresu … viññāṇe chandarāgavinayakkhāyī satthā’ti.",
    "sn22.2:9": "Evaṁ byākatepi kho, āvuso, assuyeva uttariṁ pañhaṁ pucchitāro – khattiyapaṇḍitāpi brāhmaṇapaṇḍitāpi gahapatipaṇḍitāpi samaṇapaṇḍitāpi. Paṇḍitā hāvuso, manussā vīmaṁsakā: ‘kiṁ panāyasmantānaṁ ānisaṁsaṁ disvā rūpe chandarāgavinayakkhāyī satthā, vedanāya … saññāya … saṅkhāresu … viññāṇe chandarāgavinayakkhāyī satthā’ti? Evaṁ puṭṭhā tumhe, āvuso, evaṁ byākareyyātha: ‘rūpe kho, āvuso, vigatarāgassa vigatacchandassa vigatapemassa vigatapipāsassa vigatapariḷāhassa vigātataṇhassa tassa rūpassa vipariṇāmaññathābhāvā nuppajjanti sokaparidevadukkhadomanassupāyāsā. Vedanāya … saññāya … saṅkhāresu vigatarāgassa vigatacchandassa vigatapemassa vigatapipāsassa vigatapariḷāhassa vigātataṇhassa tesaṁ saṅkhārānaṁ vipariṇāmaññathābhāvā nuppajjanti sokaparidevadukkhadomanassupāyāsā. Viññāṇe vigatarāgassa vigatacchandassa vigatapemassa vigatapipāsassa vigatapariḷāhassa vigātataṇhassa tassa viññāṇassa vipariṇāmaññathābhāvā nuppajjanti sokaparidevadukkhadomanassupāyāsā. Idaṁ kho no, āvuso, ānisaṁsaṁ disvā rūpe chandarāgavinayakkhāyī satthā, vedanāya … saññāya … saṅkhāresu … viññāṇe chandarāgavinayakkhāyī satthā’ti.",
    "sn22.2:10": "Akusale cāvuso, dhamme upasampajja vihārato diṭṭhe ceva dhamme sukho vihāro abhavissa avighāto anupāyāso apariḷāho, kāyassa ca bhedā paraṁ maraṇā sugati pāṭikaṅkhā, nayidaṁ bhagavā akusalānaṁ dhammānaṁ pahānaṁ vaṇṇeyya. Yasmā ca kho, āvuso, akusale dhamme upasampajja vihārato diṭṭhe ceva dhamme dukkho vihāro savighāto saupāyāso sapariḷāho, kāyassa ca bhedā paraṁ maraṇā duggati pāṭikaṅkhā, tasmā bhagavā akusalānaṁ dhammānaṁ pahānaṁ vaṇṇeti.",
    "sn22.2:11": "Kusale cāvuso, dhamme upasampajja vihārato diṭṭhe ceva dhamme dukkho vihāro abhavissa savighāto saupāyāso sapariḷāho, kāyassa ca bhedā paraṁ maraṇā duggati pāṭikaṅkhā, nayidaṁ bhagavā kusalānaṁ dhammānaṁ upasampadaṁ vaṇṇeyya. Yasmā ca kho, āvuso, kusale dhamme upasampajja vihārato diṭṭhe ceva dhamme sukho vihāro avighāto anupāyāso apariḷāho, kāyassa ca bhedā paraṁ maraṇā sugati pāṭikaṅkhā, tasmā bhagavā kusalānaṁ dhammānaṁ upasampadaṁ vaṇṇetī\"ti.",
    "sn22.2:12": "Idamavocāyasmā sāriputto. Attamanā te bhikkhū āyasmato sāriputtassa bhāsitaṁ abhinandunti."
}