{
    "sn22.56:1": "Sāvatthinidānaṁ. \"Pañcime, bhikkhave, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho.",
    "sn22.56:2": "Kathañca catuparivaṭṭaṁ? Rūpaṁ abbhaññāsiṁ, rūpasamudayaṁ abbhaññāsiṁ, rūpanirodhaṁ abbhaññāsiṁ, rūpanirodhagāminiṁ paṭipadāṁ abbhaññāsiṁ; vedanāṁ … saññaṁ … saṅkhāre … viññāṇaṁ abbhaññāsiṁ, viññāṇasamudayaṁ abbhaññāsiṁ, viññāṇanirodhaṁ abbhaññāsiṁ, viññāṇanirodhagāminiṁ paṭipadāṁ abbhaññāsiṁ.",
    "sn22.56:3": "Katamañca, bhikkhave, rūpaṁ? Cattāro ca mahābhūtā catunnañca mahābhūtānaṁ upādāya rūpaṁ. Idaṁ vuccati, bhikkhave, rūpaṁ. Āhārasamudayā rūpasamudayo; āhāranirodhā rūpanirodho. Ayameva ariyo aṭṭhaṅgiko maggo rūpanirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn22.56:4": "Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ rūpaṁ abhiññāya, evaṁ rūpasamudayaṁ abhiññāya, evaṁ rūpanirodhaṁ abhiññāya, evaṁ rūpanirodhagāminiṁ paṭipadāṁ abhiññāya rūpassa nibbidāya virāgāya nirodhāya paṭipannā, te suppaṭipannā. Ye suppaṭipannā, te imasmiṁ dhammavinaye gādhanti.",
    "sn22.56:5": "Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ rūpaṁ abhiññāya … pe … evaṁ rūpanirodhagāminiṁ paṭipadāṁ abhiññāya, rūpassa nibbidā virāgā nirodhā anupādā vimuttā te suvimuttā. Ye suvimuttā te kevalino. Ye kevalino vaṭṭaṁ tesaṁ natthi paññāpanāya.",
    "sn22.56:6": "Katamā ca, bhikkhave, vedanā? Chayime, bhikkhave, vedanākāyā – cakkhusamphassajā vedanā, sotasamphassajā vedanā, ghānasamphassajā vedanā, jivhāsamphassajā vedanā, kāyasamphassajā vedanā, manosamphassajā vedanā. Ayaṁ vuccati, bhikkhave, vedanā. Phassasamudayā vedanāsamudayo; phassanirodhā vedanānirodho. Ayameva ariyo aṭṭhaṅgiko maggo vedanānirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn22.56:7": "Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ vedanāṁ abhiññāya, evaṁ vedanāsamudayaṁ abhiññāya, evaṁ vedanānirodhaṁ abhiññāya, evaṁ vedanānirodhagāminiṁ paṭipadāṁ abhiññāya vedanāya nibbidāya virāgāya nirodhāya paṭipannā, te suppaṭipannā. Ye suppaṭipannā, te imasmiṁ dhammavinaye gādhanti.",
    "sn22.56:8": "Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ vedanāṁ abhiññāya … pe … evaṁ vedanānirodhagāminiṁ paṭipadāṁ abhiññāya … pe … vaṭṭaṁ tesaṁ natthi paññāpanāya.",
    "sn22.56:9": "Katamā ca, bhikkhave, saññā? Chayime, bhikkhave, saññākāyā – rūpasaññā, saddasaññā, gandhasaññā, rasasaññā, phoṭṭhabbasaññā, dhammasaññā. Ayaṁ vuccati, bhikkhave, saññā. Phassasamudayā saññāsamudayo; phassanirodhā saññānirodho. Ayameva ariyo aṭṭhaṅgiko maggo saññānirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi … pe … vaṭṭaṁ tesaṁ natthi paññāpanāya.",
    "sn22.56:10": "Katame ca, bhikkhave, saṅkhārā? Chayime, bhikkhave, cetanākāyā – rūpasañcetanā, saddasañcetanā, gandhasañcetanā, rasasañcetanā, phoṭṭhabbasañcetanā, dhammasañcetanā. Ime vuccanti, bhikkhave, saṅkhārā. Phassasamudayā saṅkhārasamudayo; phassanirodhā saṅkhāranirodho. Ayameva ariyo aṭṭhaṅgiko maggo saṅkhāranirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn22.56:11": "Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ saṅkhāre abhiññāya, evaṁ saṅkhārasamudayaṁ abhiññāya, evaṁ saṅkhāranirodhaṁ abhiññāya, evaṁ saṅkhāranirodhagāminiṁ paṭipadāṁ abhiññāya saṅkhārānaṁ nibbidāya virāgāya nirodhāya paṭipannā, te suppaṭipannā. Ye suppaṭipannā, te imasmiṁ dhammavinaye gādhanti.",
    "sn22.56:12": "Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ saṅkhāre abhiññāya, evaṁ saṅkhārasamudayaṁ abhiññāya, evaṁ saṅkhāranirodhaṁ abhiññāya, evaṁ saṅkhāranirodhagāminiṁ paṭipadāṁ abhiññāya saṅkhārānaṁ nibbidā virāgā nirodhā anupādā vimuttā, te suvimuttā. Ye suvimuttā, te kevalino. Ye kevalino vaṭṭaṁ tesaṁ natthi paññāpanāya.",
    "sn22.56:13": "Katamañca, bhikkhave, viññāṇaṁ? Chayime, bhikkhave, viññāṇakāyā – cakkhuviññāṇaṁ, sotaviññāṇaṁ, ghānaviññāṇaṁ, jivhāviññāṇaṁ, kāyaviññāṇaṁ, manoviññāṇaṁ. Idaṁ vuccati, bhikkhave, viññāṇaṁ. Nāmarūpasamudayā viññāṇasamudayo; nāmarūpanirodhā viññāṇanirodho. Ayameva ariyo aṭṭhaṅgiko maggo viññāṇanirodhagāminī paṭipadā, seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn22.56:14": "Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ viññāṇaṁ abhiññāya, evaṁ viññāṇasamudayaṁ abhiññāya, evaṁ viññāṇanirodhaṁ abhiññāya, evaṁ viññāṇanirodhagāminiṁ paṭipadāṁ abhiññāya viññāṇassa nibbidāya virāgāya nirodhāya paṭipannā, te suppaṭipannā. Ye suppaṭipannā, te imasmiṁ dhammavinaye gādhanti.",
    "sn22.56:15": "Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā evaṁ viññāṇaṁ abhiññāya, evaṁ viññāṇasamudayaṁ abhiññāya, evaṁ viññāṇanirodhaṁ abhiññāya, evaṁ viññāṇanirodhagāminiṁ paṭipadāṁ abhiññāya viññāṇassa nibbidā virāgā nirodhā anupādā vimuttā, te suvimuttā. Ye suvimuttā, te kevalino. Ye kevalino vaṭṭaṁ tesaṁ natthi paññāpanāyā\"ti."
}