{
    "sn22.79:1": "Sāvatthinidānaṁ. \"Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā anekavihitaṁ pubbenivāsaṁ anussaramānā anussaranti sabbete pañcupādānakkhandhe anussaranti etesaṁ vā aññataraṁ. Katame pañca?",
    "sn22.79:2": "Kiñca, bhikkhave, rūpaṁ vadetha? Ruppatīti kho, bhikkhave, tasmā ‘rūpan’ti vuccati. Kena ruppati? Sītenapi ruppati, uṇhenapi ruppati, jighacchāyapi ruppati, pipāsāyapi ruppati, ḍaṁsamakasavātātapasarīsapasamphassenapi ruppati. Ruppatīti kho, bhikkhave, tasmā ‘rūpan’ti vuccati.",
    "sn22.79:3": "Kiñca, bhikkhave, vedanāṁ vadetha? Vedayatīti kho, bhikkhave, tasmā ‘vedanā’ti vuccati. Kiñca vedayati? Sukhampi vedayati, dukkhampi vedayati, adukkhamasukhampi vedayati. Vedayatīti kho, bhikkhave, tasmā ‘vedanā’ti vuccati.",
    "sn22.79:4": "Kiñca, bhikkhave, saññaṁ vadetha? Sañjānātīti kho, bhikkhave, tasmā ‘saññā’ti vuccati. Kiñca sañjānāti? Nīlampi sañjānāti, pītakampi sañjānāti, lohitakampi sañjānāti, odātampi sañjānāti. Sañjānātīti kho, bhikkhave, tasmā ‘saññā’ti vuccati.",
    "sn22.79:5": "Kiñca, bhikkhave, saṅkhāre vadetha? Sankhatamabhisaṅkharontīti kho, bhikkhave, tasmā ‘saṅkhārā’ti vuccati. Kiñca saṅkhatamabhisaṅkharonti? Rūpaṁ rūpattāya saṅkhatamabhisaṅkharonti, vedanāṁ vedanattāya saṅkhatamabhisaṅkharonti, saññaṁ saññattāya saṅkhatamabhisaṅkharonti, saṅkhāre saṅkhārattāya saṅkhatamabhisaṅkharonti, viññāṇaṁ viññāṇattāya saṅkhatamabhisaṅkharonti. Sankhatamabhisaṅkharontīti kho, bhikkhave, tasmā ‘saṅkhārā’ti vuccati.",
    "sn22.79:6": "Kiñca, bhikkhave, viññāṇaṁ vadetha? Vijānātīti kho, bhikkhave, tasmā ‘viññāṇan’ti vuccati. Kiñca vijānāti? Ambilampi vijānāti, tittakampi vijānāti, kaṭukampi vijānāti, madhurampi vijānāti, khārikampi vijānāti, akhārikampi vijānāti, loṇikampi vijānāti, aloṇikampi vijānāti. Vijānātīti kho, bhikkhave, tasmā ‘viññāṇan’ti vuccati.",
    "sn22.79:7": "Tatra, bhikkhave, sutavā ariyasāvako iti paṭisañcikkhati: ‘Ahaṁ kho etarahi rūpena khajjāmi. Atītampāhaṁ addhānaṁ evameva rūpena khajjiṁ, seyyathāpi etarahi paccuppannena rūpena khajjāmi. Ahañceva kho pana anāgataṁ rūpaṁ abhinandeyyaṁ, anāgatampāhaṁ addhānaṁ evameva rūpena khajjeyyaṁ, seyyathāpi etarahi paccuppannena rūpena khajjāmī’ti. So iti paṭisaṅkhāya atītasmiṁ rūpasmiṁ anapekkho hoti; anāgataṁ rūpaṁ nābhinandati; paccuppannassa rūpassa nibbidāya virāgāya nirodhāya paṭipanno hoti.",
    "sn22.79:8": "‘Ahaṁ kho etarahi vedanāya khajjāmi. Atītampāhaṁ addhānaṁ evameva vedanāya khajjiṁ, seyyathāpi etarahi paccuppannāya vedanāya khajjāmi. Ahañceva kho pana anāgataṁ vedanāṁ abhinandeyyaṁ; anāgatampāhaṁ addhānaṁ evameva vedanāya khajjeyyaṁ, seyyathāpi etarahi paccuppannāya vedanāya khajjāmī’ti. So iti paṭisaṅkhāya atītāya vedanāya anapekkho hoti; anāgataṁ vedanāṁ nābhinandati; paccuppannāya vedanāya nibbidāya virāgāya nirodhāya paṭipanno hoti.",
    "sn22.79:9": "‘Ahaṁ kho etarahi saññāya khajjāmi … pe … ahaṁ kho etarahi saṅkhārehi khajjāmi. Atītampāhaṁ addhānaṁ evameva saṅkhārehi khajjiṁ, seyyathāpi etarahi paccuppannehi saṅkhārehi khajjāmīti. Ahañceva kho pana anāgate saṅkhāre abhinandeyyaṁ; anāgatampāhaṁ addhānaṁ evameva saṅkhārehi khajjeyyaṁ, seyyathāpi etarahi paccuppannehi saṅkhārehi khajjāmī’ti. So iti paṭisaṅkhāya atītesu saṅkhāresu anapekkho hoti; anāgate saṅkhāre nābhinandati; paccuppannānaṁ saṅkhārānaṁ nibbidāya virāgāya nirodhāya paṭipanno hoti.",
    "sn22.79:10": "‘Ahaṁ kho etarahi viññāṇena khajjāmi. Atītampi addhānaṁ evameva viññāṇena khajjiṁ, seyyathāpi etarahi paccuppannena viññāṇena khajjāmi. Ahañceva kho pana anāgataṁ viññāṇaṁ abhinandeyyaṁ; anāgatampāhaṁ addhānaṁ evameva viññāṇena khajjeyyaṁ, seyyathāpi etarahi paccuppannena viññāṇena khajjāmī’ti. So iti paṭisaṅkhāya atītasmiṁ viññāṇasmiṁ anapekkho hoti; anāgataṁ viññāṇaṁ nābhinandati; paccuppannassa viññāṇassa nibbidāya virāgāya nirodhāya paṭipanno hoti.",
    "sn22.79:11": "Taṁ kiṁ maññatha, bhikkhave, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti? \"Dukkhaṁ, bhante\". \"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti? \"No hetaṁ, bhante\".",
    "sn22.79:12": "Ayaṁ vuccati, bhikkhave, ariyasāvako apacināti, no ācināti; pajahati, na upādiyati; visineti, na ussineti; vidhūpeti, na sandhūpeti.",
    "sn22.79:13": "Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako rūpasmimpi nibbindati, vedanāyapi … saññāyapi … saṅkhāresupi … viññāṇasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati. Vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti.",
    "sn22.79:14": "Ayaṁ vuccati, bhikkhave, bhikkhu nevācināti na apacināti, apacinitvā ṭhito neva pajahati na upādiyati, pajahitvā ṭhito neva visineti na ussineti, visinetvā ṭhito neva vidhūpeti na sandhūpeti.",
    "sn22.79:15": "‘Namo te purisājañña,namo te purisuttama;Yassa te nābhijānāma,yampi nissāya jhāyasī’\"ti."
}