{
    "sn22.60:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā vesāliyaṁ vihārati mahāvane kūṭāgārasālāyaṁ. Atha kho mahāli licchavi yena bhagavā tenupasaṅkami … pe … ekamantaṁ nisinno kho mahāli licchavi bhagavantaṁ etadavoca:",
    "sn22.60:2": "\"Pūraṇo, bhante, kassapo evamāha: ‘Natthi hetu natthi paccayo sattānaṁ saṅkilesāya; ahetū appaccayā sattā saṅkilissanti. Natthi hetu natthi paccayo sattānaṁ visuddhiyā; ahetū appaccayā sattā visujjhantī’ti. Idha bhagavā kimāhā\"ti?",
    "sn22.60:3": "\"Atthi, mahāli, hetu atthi paccayo sattānaṁ saṅkilesāya; sahetū sappaccayā sattā saṅkilissanti. Atthi, mahāli, hetu, atthi paccayo sattānaṁ visuddhiyā; sahetū sappaccayā sattā visujjhantī\"ti.",
    "sn22.60:4": "\"Katamo pana, bhante, hetu katamo paccayo sattānaṁ saṅkilesāya; kathaṁ sahetū sappaccayā sattā saṅkilissantī\"ti?",
    "sn22.60:5": "\"Rūpañca hidaṁ, mahāli, ekantadukkhaṁ abhavissa dukkhānupatitaṁ dukkhāvakkantaṁ anavakkantaṁ sukhena, nayidaṁ sattā rūpasmiṁ sārajjeyyuṁ. Yasmā ca kho, mahāli, rūpaṁ sukhaṁ sukhānupatitaṁ sukhāvakkantaṁ anavakkantaṁ dukkhena, tasmā sattā rūpasmiṁ sārajjanti; sārāgā saṁyujjanti; saṁyogā saṅkilissanti. Ayaṁ kho, mahāli, hetu, ayaṁ paccayo sattānaṁ saṅkilesāya; evaṁ sahetū sappaccayā sattā saṅkilissanti.",
    "sn22.60:6": "Vedanā ca hidaṁ, mahāli, ekantadukkhā abhavissa dukkhānupatitā dukkhāvakkantā anavakkantā sukhena, nayidaṁ sattā vedanāya sārajjeyyuṁ. Yasmā ca kho, mahāli, vedanā sukhā sukhānupatitā sukhāvakkantā anavakkantā dukkhena, tasmā sattā vedanāya sārajjanti; sārāgā saṁyujjanti; saṁyogā saṅkilissanti. Ayampi kho, mahāli, hetu, ayaṁ paccayo sattānaṁ saṅkilesāya. Evampi sahetū sappaccayā sattā saṅkilissanti.",
    "sn22.60:7": "Saññā ca hidaṁ, mahāli … pe … saṅkhārā ca hidaṁ, mahāli, ekantadukkhā abhavissaṁsu dukkhānupatitā dukkhāvakkantā anavakkantā sukhena, nayidaṁ sattā saṅkhāresu sārajjeyyuṁ. Yasmā ca kho, mahāli, saṅkhārā sukhā sukhānupatitā sukhāvakkantā anavakkantā dukkhena, tasmā sattā saṅkhāresu sārajjanti; sārāgā saṁyujjanti; saṁyogā saṅkilissanti. Ayampi kho, mahāli, hetu, ayaṁ paccayo sattānaṁ saṅkilesāya. Evampi sahetū sappaccayā sattā saṅkilissanti.",
    "sn22.60:8": "Viññāṇañca hidaṁ, mahāli, ekantadukkhaṁ abhavissa dukkhānupatitaṁ dukkhāvakkantaṁ anavakkantaṁ sukhena, nayidaṁ sattā viññāṇasmiṁ sārajjeyyuṁ. Yasmā ca kho, mahāli, viññāṇaṁ sukhaṁ sukhānupatitaṁ sukhāvakkantaṁ anavakkantaṁ dukkhena, tasmā sattā viññāṇasmiṁ sārajjanti; sārāgā saṁyujjanti; saṁyogā saṅkilissanti. Ayampi kho, mahāli, hetu ayaṁ paccayo sattānaṁ saṅkilesāya. Evampi sahetū sappaccayā sattā saṅkilissantī\"ti.",
    "sn22.60:9": "\"Katamo pana, bhante, hetu katamo paccayo sattānaṁ visuddhiyā; kathaṁ sahetū sappaccayā sattā visujjhantī\"ti?",
    "sn22.60:10": "Vedanā ca hidaṁ, mahāli, ekantasukhā abhavissa … pe … saññā ca hidaṁ, mahāli … pe … saṅkhārā ca hidaṁ, mahāli, ekantasukhā abhavissaṁsu … pe … viññāṇañca hidaṁ, mahāli, ekantasukhaṁ abhavissa sukhānupatitaṁ sukhāvakkantaṁ anavakkantaṁ dukkhena, nayidaṁ sattā viññāṇasmiṁ nibbindeyyuṁ. Yasmā ca kho, mahāli, viññāṇaṁ dukkhaṁ dukkhānupatitaṁ dukkhāvakkantaṁ anavakkantaṁ sukhena, tasmā sattā viññāṇasmiṁ nibbindanti; nibbindaṁ virajjanti; virāgā visujjhanti. Ayaṁ kho, mahāli, hetu, ayaṁ paccayo, sattānaṁ visuddhiyā. Evampi sahetū sappaccayā sattā visujjhantī\"ti."
}