{
    "sn22.97:1": "Sāvatthinidānaṁ. Ekamantaṁ nisinno kho so bhikkhu bhagavantaṁ etadavoca: \"atthi nu kho, bhante, kiñci rūpaṁ yaṁ rūpaṁ niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ sassatisamaṁ tatheva ṭhassati? Atthi nu kho, bhante, kāci vedanā yā vedanā niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṁ tatheva ṭhassati? Atthi nu kho, bhante, kāci saññā … pe … keci saṅkhārā, ye saṅkhārā niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṁ tatheva ṭhassanti? Atthi nu kho, bhante, kiñci viññāṇaṁ, yaṁ viññāṇaṁ niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ sassatisamaṁ tatheva ṭhassatī\"ti? \"Natthi kho, bhikkhu, kiñci rūpaṁ, yaṁ rūpaṁ niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ sassatisamaṁ tatheva ṭhassati. Natthi kho, bhikkhu, kāci vedanā … kāci saññā … keci saṅkhārā … pe … kiñci viññāṇaṁ, yaṁ viññāṇaṁ niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ sassatisamaṁ tatheva ṭhassatī\"ti.",
    "sn22.97:2": "Atha kho bhagavā parittaṁ nakhasikhāyaṁ paṁsuṁ āropetvā taṁ bhikkhuṁ etadavoca: \"ettakampi kho, bhikkhu, rūpaṁ natthi niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ sassatisamaṁ tatheva ṭhassati. Ettakañcepi, bhikkhu, rūpaṁ abhavissa niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ, nayidaṁ brahmacariyavāso paññāyetha sammā dukkhakkhayāya. Yasmā ca kho, bhikkhu, ettakampi rūpaṁ natthi niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ, tasmā brahmacariyavāso paññāyati sammā dukkhakkhayāya\".",
    "sn22.97:3": "Ettakāpi kho, bhikkhu, vedanā natthi niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṁ tatheva ṭhassati. Ettakā cepi, bhikkhu, vedanā abhavissa niccā dhuvā sassatā avipariṇāmadhammā, na yidaṁ brahmacariyavāso paññāyetha sammā dukkhakkhayāya. Yasmā ca kho, bhikkhu, ettakāpi vedanā natthi niccā dhuvā sassatā avipariṇāmadhammā, tasmā brahmacariyavāso paññāyati sammā dukkhakkhayāya.",
    "sn22.97:4": "Ettakāpi kho, bhikkhu, saññā natthi … pe … ettakāpi kho, bhikkhu, saṅkhārā natthi niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṁ tatheva ṭhassanti. Ettakā cepi, bhikkhu, saṅkhārā abhavissaṁsu niccā dhuvā sassatā avipariṇāmadhammā, na yidaṁ brahmacariyavāso paññāyetha sammā dukkhakkhayāya. Yasmā ca kho, bhikkhu, ettakāpi saṅkhārā natthi niccā dhuvā sassatā avipariṇāmadhammā, tasmā brahmacariyavāso paññāyati sammā dukkhakkhayāya.",
    "sn22.97:5": "Ettakampi kho, bhikkhu, viññāṇaṁ natthi niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ sassatisamaṁ tatheva ṭhassati. Ettakampi kho, bhikkhu, viññāṇaṁ abhavissa niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ, na yidaṁ brahmacariyavāso paññāyetha sammā dukkhakkhayāya. Yasmā ca kho, bhikkhu, ettakampi viññāṇaṁ natthi niccaṁ dhuvaṁ sassataṁ avipariṇāmadhammaṁ, tasmā brahmacariyavāso paññāyati sammā dukkhakkhayāya.",
    "sn22.97:6": "Taṁ kiṁ maññasi, bhikkhu, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\". \"Vedanā … saññā … saṅkhārā … viññāṇaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\" … pe … \"tasmātiha … pe … evaṁ passaṁ … pe … nāparaṁ itthattāyāti pajānātī\"ti."
}