{
    "sn24.5:1": "Sāvatthinidānaṁ. \"Kismiṁ nu kho, bhikkhave, sati kiṁ upādāya, kiṁ abhinivissa evaṁ diṭṭhi uppajjati: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ, natthi hutaṁ, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko; natthi ayaṁ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā; natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṁ parañca lokaṁ sayaṁ abhiññā sacchikatvā pavedenti. Cātumahābhūtiko ayaṁ puriso yadā kālaṁ karoti pathavī pathavīkāyaṁ anupeti anupagacchati, āpo āpokāyaṁ anupeti anupagacchati, tejo tejokāyaṁ anupeti anupagacchati, vāyo vāyokāyaṁ anupeti anupagacchati. Ākāsaṁ indriyāni saṅkamanti. Āsandipañcamā purisā mataṁ ādāya gacchanti. Yāva āḷāhanā padāni paññāyanti. Kāpotakāni aṭṭhīni bhavanti. Bhassantā āhutiyo. Dattupaññattaṁ yadidaṁ dānaṁ. Tesaṁ tucchaṁ musā vilāpo ye keci atthikavādaṁ vadanti. Bāle ca paṇḍite ca kāyassa bhedā ucchijjanti vinassanti na honti paraṁ maraṇā’\"ti? \"Bhagavaṁmūlakā no, bhante, dhammā … pe …",
    "sn24.5:2": "\"Rūpe kho, bhikkhave, sati, rūpaṁ upādāya, rūpaṁ abhinivissa evaṁ diṭṭhi uppajjati: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ … pe … kāyassa bhedā ucchijjanti vinassanti na honti paraṁ maraṇā’ti. Vedanāya sati … pe … saññāya sati … saṅkhāresu sati … viññāṇe sati, viññāṇaṁ upādāya, viññāṇaṁ abhinivissa evaṁ diṭṭhi uppajjati: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ … pe … kāyassa bhedā ucchijjanti vinassanti na honti paraṁ maraṇā’ti.",
    "sn24.5:3": "Taṁ kiṁ maññatha, bhikkhave, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante … pe … api nu taṁ anupādāya evaṁ diṭṭhi uppajjeyya: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ … pe … kāyassa bhedā ucchijjanti vinassanti na honti paraṁ maraṇā’\"ti? \"No hetaṁ, bhante\". \"Vedanā … saññā … saṅkhārā … viññāṇaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante … pe … api nu taṁ anupādāya evaṁ diṭṭhi uppajjeyya: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ … pe … kāyassa bhedā ucchijjanti vinassanti na honti paraṁ maraṇā’\"ti? \"No hetaṁ, bhante\". \"Yampidaṁ diṭṭhaṁ sutaṁ mutaṁ viññātaṁ pattaṁ pariyesitaṁ anuvicaritaṁ manasā tampi niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante … pe … api nu taṁ anupādāya evaṁ diṭṭhi uppajjeyya: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ … pe … ye keci atthikavādaṁ vadanti; bāle ca paṇḍite ca kāyassa bhedā ucchijjanti vinassanti na honti paraṁ maraṇā’\"ti? \"No hetaṁ, bhante\".",
    "sn24.5:4": "\"Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti … pe … dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṁ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano\"ti."
}