{
    "sn24.6:1": "Sāvatthinidānaṁ. \"Kismiṁ nu kho, bhikkhave, sati, kiṁ upādāya, kiṁ abhinivissa evaṁ diṭṭhi uppajjati: ‘karoto kārayato chindato chedāpayato pacato pācāpayato socato socāpayato kilamato kilamāpayato phandato phandāpayato pāṇamatipātayato adinnaṁ ādiyato sandhiṁ chindato nillopaṁ harato ekāgārikaṁ karoto paripanthe tiṭṭhato paradāraṁ gacchato musā bhaṇato karoto na karīyati pāpaṁ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekamaṁsakhalaṁ ekamaṁsapuñjaṁ kareyya, natthi tatonidānaṁ pāpaṁ, natthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṁ gaccheyya; hananto ghātento chindanto chedāpento pacanto pācento, natthi tatonidānaṁ pāpaṁ, natthi pāpassa āgamo. Uttarāñcepi gaṅgāya tīraṁ gaccheyya; dadanto dāpento yajanto yajāpento, natthi tatonidānaṁ puññaṁ, natthi puññassa āgamo. Dānena damena saṁyamena saccavajjena natthi puññaṁ natthi puññassa āgamo’\"ti.",
    "sn24.6:2": "\"Rūpe kho, bhikkhave, sati, rūpaṁ upādāya, rūpaṁ abhinivissa evaṁ diṭṭhi uppajjati: ‘karoto kārayato … pe … natthi puññaṁ natthi puññassa āgamo’ti. Vedanāya sati … pe … saññāya sati … saṅkhāresu sati … viññāṇe sati, viññāṇaṁ upādāya, viññāṇaṁ abhinivissa evaṁ diṭṭhi uppajjati: ‘karoto kārayato … pe … natthi puññaṁ natthi puññassa āgamo’ti.",
    "sn24.6:3": "Taṁ kiṁ maññatha, bhikkhave, rūpaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante\" … pe … api nu taṁ anupādāya evaṁ diṭṭhi uppajjeyya: ‘karoto … pe … natthi puññaṁ natthi puññassa āgamo\"ti? \"No hetaṁ, bhante\". \"Vedanā … saññā … saṅkhārā … viññāṇaṁ niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante … pe … api nu taṁ anupādāya evaṁ diṭṭhi uppajjeyya: ‘karoto kārayato … pe … natthi puññaṁ natthi puññassa āgamo’\"ti? \"No hetaṁ, bhante\". \"Yampidaṁ diṭṭhaṁ sutaṁ mutaṁ viññātaṁ pattaṁ pariyesitaṁ anuvicaritaṁ manasā tampi niccaṁ vā aniccaṁ vā\"ti? \"Aniccaṁ, bhante … pe … api nu taṁ anupādāya evaṁ diṭṭhi uppajjeyya: ‘karoto kārayato … pe … natthi puññaṁ natthi puññassa āgamo’\"ti? \"No hetaṁ, bhante\".",
    "sn24.6:4": "\"Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti … pe … dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṁ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano\"ti."
}