{
    "sn3.25:1": "Sāvatthinidānaṁ. Ekamantaṁ nisinnaṁ kho rājānaṁ pasenadiṁ kosalaṁ bhagavā etadavoca: \"handa kuto nu tvaṁ, mahārāja, āgacchasi divā divassā\"ti? \"Yāni tāni, bhante, raññaṁ khattiyānaṁ muddhāvasittānaṁ issariyamadamattānaṁ kāmagedhapariyuṭṭhitānaṁ janapadatthāvariyappattānaṁ mahantaṁ pathavimaṇḍalaṁ abhivijiya ajjhāvasantānaṁ rājakaraṇīyāni bhavanti, tesu khvāhaṁ, etarahi ussukkamāpanno\"ti.",
    "sn3.25:2": "\"Taṁ kiṁ maññasi, mahārāja, idha te puriso āgaccheyya puratthimāya disāya saddhāyiko paccayiko. So taṁ upasaṅkamitvā evaṁ vadeyya: ‘yagghe, mahārāja, jāneyyāsi, ahaṁ āgacchāmi puratthimāya disāya. Tatthaddasaṁ mahantaṁ pabbataṁ abbhasamaṁ, sabbe pāṇe nippothento āgacchati. Yaṁ te, mahārāja, karaṇīyaṁ, taṁ karohī’ti. Atha dutiyo puriso āgaccheyya pacchimāya disāya … pe … atha tatiyo puriso āgaccheyya uttarāya disāya … atha catuttho puriso āgaccheyya dakkhiṇāya disāya saddhāyiko paccayiko. So taṁ upasaṅkamitvā evaṁ vadeyya: ‘yagghe, mahārāja, jāneyyāsi, ahaṁ āgacchāmi dakkhiṇāya disāya. Tatthaddasaṁ mahantaṁ pabbataṁ abbhasamaṁ sabbe pāṇe nippothento āgacchati. Yaṁ te, mahārāja, karaṇīyaṁ taṁ karohī’ti. Evarūpe te, mahārāja, mahati mahabbhaye samuppanne dāruṇe manussakkhaye dullabhe manussatte kimassa karaṇīyan\"ti?",
    "sn3.25:3": "\"Evarūpe me, bhante, mahati mahabbhaye samuppanne dāruṇe manussakkhaye dullabhe manussatte kimassa karaṇīyaṁ aññatra dhammacariyāya aññatra samacariyāya aññatra kusalakiriyāya aññatra puññakiriyāyā\"ti?",
    "sn3.25:4": "\"Ārocemi kho te, mahārāja, paṭivedemi kho te, mahārāja, adhivattati kho taṁ, mahārāja, jarāmaraṇaṁ. Adhivattamāne ce te, mahārāja, jarāmaraṇe kimassa karaṇīyan\"ti?",
    "sn3.25:5": "\"Evametaṁ, mahārāja, evametaṁ, mahārāja. Adhivattamāne jarāmaraṇe kimassa karaṇīyaṁ aññatra dhammacariyāya samacariyāya kusalakiriyāya puññakiriyāyā\"ti?",
    "sn3.25:6": "\"Yathāpi selā vipulā,nabhaṁ āhacca pabbatā;Samantānupariyāyeyyuṁ,nippothento catuddisā.",
    "sn3.25:7": "Evaṁ jarā ca maccu ca,adhivattanti pāṇine;Khattiye brāhmaṇe vesse,sudde caṇḍālapukkuse;Na kiñci parivajjeti,sabbamevābhimaddati.",
    "sn3.25:8": "Na tattha hatthīnaṁ bhūmi,na rathānaṁ na pattiyā;Na cāpi mantayuddhena,sakkā jetuṁ dhanena vā.",
    "sn3.25:9": "Tasmā hi paṇḍito poso,sampassaṁ atthamattano;Buddhe dhamme ca saṅghe ca,dhīro saddhāṁ nivesaye.",
    "sn3.25:10": "Yo dhammaṁ cari kāyena,vācāya uda cetasā;Idheva naṁ pasaṁsanti,pecca sagge pamodatī\"ti.",
    "sn3.25:11": "Puggalo ayyikā loko,issattaṁ pabbatūpamā;Desitaṁ buddhaseṭṭhena,imaṁ kosalapañcakanti."
}