{
    "sn3.21:1": "Sāvatthinidānaṁ. Atha kho rājā pasenadi kosalo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho rājānaṁ pasenadiṁ kosalaṁ bhagavā etadavoca: \"cattārome, mahārāja puggalā santo saṁvijjamānā lokasmiṁ. Katame cattāro? Tamotamaparāyano, tamojotiparāyano, jotitamaparāyano, jotijotiparāyano.",
    "sn3.21:2": "Kathañca, mahārāja puggalo tamotamaparāyano hoti? Idha, mahārāja, ekacco puggalo nīce kule paccājāto hoti, caṇḍālakule vā venakule vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā vācāya duccaritaṁ caritvā manasā duccaritaṁ caritvā, kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati.",
    "sn3.21:3": "Seyyathāpi, mahārāja, puriso andhakārā vā andhakāraṁ gaccheyya, tamā vā tamaṁ gaccheyya, lohitamalā vā lohitamalaṁ gaccheyya. Tathūpamāhaṁ, mahārāja, imaṁ puggalaṁ vadāmi. Evaṁ kho, mahārāja, puggalo tamotamaparāyano hoti.",
    "sn3.21:4": "Kathañca, mahārāja, puggalo tamojotiparāyano hoti? Idha, mahārāja, ekacco puggalo nīce kule paccājāto hoti, caṇḍālakule vā venakule vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca kho hoti dubbaṇṇo duddasiko okoṭimako bavhābādho, kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena sucaritaṁ carati, vācāya sucaritaṁ carati, manasā sucaritaṁ carati. So kāyena sucaritaṁ caritvā vācāya sucaritaṁ caritvā manasā sucaritaṁ caritvā, kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati.",
    "sn3.21:5": "Seyyathāpi, mahārāja, puriso pathaviyā vā pallaṅkaṁ āroheyya, pallaṅkā vā assapiṭṭhiṁ āroheyya, assapiṭṭhiyā vā hatthikkhandhaṁ āroheyya, hatthikkhandhā vā pāsādaṁ āroheyya. Tathūpamāhaṁ, mahārāja, imaṁ puggalaṁ vadāmi. Evaṁ kho, mahārāja, puggalo tamojotiparāyano hoti.",
    "sn3.21:6": "Kathañca, mahārāja, puggalo jotitamaparāyano hoti? Idha, mahārāja, ekacco puggalo ucce kule paccājāto hoti, khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā, aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe. So ca hoti abhirūpo dassanīyo pāsādiko, paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṁ carati, vācāya duccaritaṁ carati, manasā duccaritaṁ carati. So kāyena duccaritaṁ caritvā vācāya duccaritaṁ caritvā manasā duccaritaṁ caritvā, kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati.",
    "sn3.21:7": "Seyyathāpi, mahārāja, puriso pāsādā vā hatthikkhandhaṁ oroheyya, hatthikkhandhā vā assapiṭṭhiṁ oroheyya, assapiṭṭhiyā vā pallaṅkaṁ oroheyya, pallaṅkā vā pathaviṁ oroheyya, pathaviyā vā andhakāraṁ paviseyya. Tathūpamāhaṁ, mahārāja, imaṁ puggalaṁ vadāmi. Evaṁ kho, mahārāja, puggalo jotitamaparāyano hoti.",
    "sn3.21:8": "Kathañca, mahārāja, puggalo jotijotiparāyano hoti? Idha, mahārāja, ekacco puggalo ucce kule paccājāto hoti, khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā, aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe. So ca hoti abhirūpo dassanīyo pāsādiko, paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena sucaritaṁ carati, vācāya sucaritaṁ carati, manasā sucaritaṁ carati. So kāyena sucaritaṁ caritvā vācāya sucaritaṁ caritvā manasā sucaritaṁ caritvā, kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjati.",
    "sn3.21:9": "Seyyathāpi, mahārāja, puriso pallaṅkā vā pallaṅkaṁ saṅkameyya, assapiṭṭhiyā vā assapiṭṭhiṁ saṅkameyya, hatthikkhandhā vā hatthikkhandhaṁ saṅkameyya, pāsādā vā pāsādaṁ saṅkameyya. Tathūpamāhaṁ, mahārāja, imaṁ puggalaṁ vadāmi. Evaṁ kho, mahārāja, puggalo jotijotiparāyano hoti.",
    "sn3.21:10": "\"Daliddo puriso rāja,assaddho hoti maccharī;Kadariyo pāpasaṅkappo,micchādiṭṭhi anādaro.",
    "sn3.21:11": "Samaṇe brāhmaṇe vāpi,aññe vāpi vanibbake;Akkosati paribhāsati,natthiko hoti rosako.",
    "sn3.21:12": "Dadamānaṁ nivāreti,yācamānāna bhojanaṁ;Tādiso puriso rāja,mīyamāno janādhipa;Upeti nirayaṁ ghoraṁ,tamotamaparāyano.",
    "sn3.21:13": "Daliddo puriso rāja,saddho hoti amaccharī;Dadāti seṭṭhasaṅkappo,abyaggamanaso naro.",
    "sn3.21:14": "Samaṇe brāhmaṇe vāpi,aññe vāpi vanibbake;Uṭṭhāya abhivādeti,samacariyāya sikkhati.",
    "sn3.21:15": "Dadamānaṁ na vāreti,yācamānāna bhojanaṁ;Tādiso puriso rāja,mīyamāno janādhipa;Upeti tidivaṁ ṭhānaṁ,tamojotiparāyano.",
    "sn3.21:16": "Aḍḍho ce puriso rāja,assaddho hoti maccharī;Kadariyo pāpasaṅkappo,micchādiṭṭhi anādaro.",
    "sn3.21:17": "Samaṇe brāhmaṇe vāpi,aññe vāpi vanibbake;Akkosati paribhāsati,natthiko hoti rosako.",
    "sn3.21:18": "Dadamānaṁ nivāreti,yācamānāna bhojanaṁ;Tādiso puriso rāja,mīyamāno janādhipa;Upeti nirayaṁ ghoraṁ,jotitamaparāyano."
}