{
    "sn3.14:1": "Sāvatthinidānaṁ. Atha kho rājā māgadho ajātasattu vedehiputto caturaṅginiṁ senaṁ sannayhitvā rājānaṁ pasenadiṁ kosalaṁ abbhuyyāsi yena kāsi. Assosi kho rājā pasenadi kosalo: \"rājā kira māgadho ajātasattu vedehiputto caturaṅginiṁ senaṁ sannayhitvā mamaṁ abbhuyyāto yena kāsī\"ti. Atha kho rājā pasenadi kosalo caturaṅginiṁ senaṁ sannayhitvā rājānaṁ māgadhaṁ ajātasattuṁ vedehiputtaṁ paccuyyāsi yena kāsi. Atha kho rājā ca māgadho ajātasattu vedehiputto rājā ca pasenadi kosalo saṅgāmesuṁ. Tasmiṁ kho pana saṅgāme rājā māgadho ajātasattu vedehiputto rājānaṁ pasenadiṁ kosalaṁ parājesi. Parājito ca rājā pasenadi kosalo sakameva rājadhāniṁ sāvatthiṁ paccuyyāsi.",
    "sn3.14:2": "Atha kho sambahulā bhikkhū pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya sāvatthiṁ piṇḍāya pavisiṁsu. Sāvatthiyaṁ piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ:",
    "sn3.14:3": "\"Idha, bhante, rājā māgadho ajātasattu vedehiputto caturaṅginiṁ senaṁ sannayhitvā rājānaṁ pasenadiṁ kosalaṁ abbhuyyāsi yena kāsi. Assosi kho, bhante, rājā pasenadi kosalo: ‘rājā kira māgadho ajātasattu vedehiputto caturaṅginiṁ senaṁ sannayhitvā mamaṁ abbhuyyāto yena kāsī’ti. Atha kho, bhante, rājā pasenadi kosalo caturaṅginiṁ senaṁ sannayhitvā rājānaṁ māgadhaṁ ajātasattuṁ vedehiputtaṁ paccuyyāsi yena kāsi. Atha kho, bhante, rājā ca māgadho ajātasattu vedehiputto rājā ca pasenadi kosalo saṅgāmesuṁ. Tasmiṁ kho pana, bhante, saṅgāme rājā māgadho ajātasattu vedehiputto rājānaṁ pasenadiṁ kosalaṁ parājesi. Parājito ca, bhante, rājā pasenadi kosalo sakameva rājadhāniṁ sāvatthiṁ paccuyyāsī\"ti.",
    "sn3.14:4": "\"Rājā, bhikkhave, māgadho ajātasattu vedehiputto pāpamitto pāpasahāyo pāpasampavaṅko; rājā ca kho, bhikkhave, pasenadi kosalo kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko. Ajjeva, bhikkhave, rājā pasenadi kosalo imaṁ rattiṁ dukkhaṁ seti parājito\"ti. Idamavoca … pe …",
    "sn3.14:5": "\"Jayaṁ veraṁ pāsavāti,dukkhaṁ seti parājito;Upasanto sukhaṁ seti,hitvā jayaparājayan\"ti."
}