{
    "sn3.18:1": "Sāvatthinidānaṁ. Ekamantaṁ nisinno kho rājā pasenadi kosalo bhagavantaṁ etadavoca: \"idha mayhaṁ, bhante, rahogatassa paṭisallīnassa evaṁ cetaso parivitakko udapādi: ‘svākkhāto bhagavatā dhammo, so ca kho kalyāṇamittassa kalyāṇasahāyassa kalyāṇasampavaṅkassa, no pāpamittassa no pāpasahāyassa no pāpasampavaṅkassā’\"ti.",
    "sn3.18:2": "\"Evametaṁ, mahārāja, evametaṁ, mahārāja. Svākkhāto, mahārāja, mayā dhammo. So ca kho kalyāṇamittassa kalyāṇasahāyassa kalyāṇasampavaṅkassa, no pāpamittassa no pāpasahāyassa no pāpasampavaṅkassāti.",
    "sn3.18:3": "Ekamidāhaṁ, mahārāja, samayaṁ sakkesu viharāmi nagarakaṁ nāma sakyānaṁ nigamo. Atha kho, mahārāja, ānando bhikkhu yenāhaṁ tenupasaṅkami; upasaṅkamitvā maṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho, mahārāja, ānando bhikkhu maṁ etadavoca: ‘upaḍḍhamidaṁ, bhante, brahmacariyassa – yadidaṁ kalyāṇamittatā kalyāṇasahāyatā kalyāṇasampavaṅkatā’ti.",
    "sn3.18:4": "Evaṁ vuttāhaṁ, mahārāja, Ānandaṁ bhikkhuṁ etadavocaṁ: ‘mā hevaṁ, Ānanda, mā hevaṁ, Ānanda. Sakalameva hidaṁ, Ānanda, brahmacariyaṁ – yadidaṁ kalyāṇamittatā kalyāṇasahāyatā kalyāṇasampavaṅkatā. Kalyāṇamittassetaṁ, Ānanda, bhikkhuno pāṭikaṅkhaṁ kalyāṇasahāyassa kalyāṇasampavaṅkassa ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāvessati ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkarissati.",
    "sn3.18:5": "Kathañca, Ānanda, bhikkhu kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti, ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti? IdhĀnanda, bhikkhu sammādiṭṭhiṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ, sammāsaṅkappaṁ bhāveti … sammāvācaṁ bhāveti … sammākammantaṁ bhāveti … sammāājīvaṁ bhāveti … sammāvāyāmaṁ bhāveti … sammāsatiṁ bhāveti … sammāsamādhiṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ. Evaṁ kho, Ānanda, bhikkhu kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti, ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti. Tadamināpetaṁ, Ānanda, pariyāyena veditabbaṁ yathā sakalamevidaṁ brahmacariyaṁ – yadidaṁ kalyāṇamittatā kalyāṇasahāyatā kalyāṇasampavaṅkatāti.",
    "sn3.18:6": "Mamañhi, Ānanda, kalyāṇamittaṁ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, byādhidhammā sattā byādhito parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Iminā kho etaṁ, Ānanda, pariyāyena veditabbaṁ yathā sakalamevidaṁ brahmacariyaṁ – yadidaṁ kalyāṇamittatā kalyāṇasahāyatā kalyāṇasampavaṅkatā’ti.",
    "sn3.18:7": "Tasmātiha te, mahārāja, evaṁ sikkhitabbaṁ: ‘kalyāṇamitto bhavissāmi kalyāṇasahāyo kalyāṇasampavaṅko’ti. Evañhi te, mahārāja, sikkhitabbaṁ.",
    "sn3.18:8": "Kalyāṇamittassa te, mahārāja, kalyāṇasahāyassa kalyāṇasampavaṅkassa ayaṁ eko dhammo upanissāya vihātabbo – appamādo kusalesu dhammesu.",
    "sn3.18:9": "Appamattassa te, mahārāja, vihārato appamādaṁ upanissāya, itthāgārassa anuyantassa evaṁ bhavissati: ‘rājā kho appamatto vihārati, appamādaṁ upanissāya. Handa mayampi appamattā viharāma, appamādaṁ upanissāyā’ti.",
    "sn3.18:10": "Appamattassa te, mahārāja, vihārato appamādaṁ upanissāya, khattiyānampi anuyantānaṁ evaṁ bhavissati: ‘rājā kho appamatto vihārati appamādaṁ upanissāya. Handa mayampi appamattā viharāma, appamādaṁ upanissāyā’ti.",
    "sn3.18:11": "Appamattassa te, mahārāja, vihārato appamādaṁ upanissāya, balakāyassapi evaṁ bhavissati: ‘rājā kho appamatto vihārati appamādaṁ upanissāya. Handa mayampi appamattā viharāma, appamādaṁ upanissāyā’ti.",
    "sn3.18:12": "Appamattassa te, mahārāja, vihārato appamādaṁ upanissāya, negamajānapadassapi evaṁ bhavissati: ‘rājā kho appamatto vihārati, appamādaṁ upanissāya. Handa mayampi appamattā viharāma, appamādaṁ upanissāyā’ti?",
    "sn3.18:13": "Appamattassa te, mahārāja, vihārato appamādaṁ upanissāya, attāpi gutto rakkhito bhavissati – itthāgārampi guttaṁ rakkhitaṁ bhavissati, kosakoṭṭhāgārampi guttaṁ rakkhitaṁ bhavissatī\"ti. Idamavoca … pe …",
    "sn3.18:14": "\"Bhoge patthayamānena,uḷāre aparāpare;Appamādaṁ pasaṁsanti,puññakiriyāsu paṇḍitā;Appamatto ubho atthe,adhiggaṇhāti paṇḍito.",
    "sn3.18:15": "Diṭṭhe dhamme ca yo attho,yo cattho samparāyiko;Atthābhisamayā dhīro,paṇḍitoti pavuccatī\"ti."
}