{
    "sn35.88:1": "Atha kho āyasmā puṇṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā … pe … ekamantaṁ nisinno kho āyasmā puṇṇo bhagavantaṁ etadavoca: \"sādhu me, bhante, bhagavā saṅkhittena dhammaṁ desetu, yamahaṁ bhagavato dhammaṁ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyyan\"ti.",
    "sn35.88:2": "\"Santi kho, puṇṇa, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. Tañce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa taṁ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjati nandī. ‘Nandisamudayā dukkhasamudayo, puṇṇā’ti vadāmi … pe … santi kho, puṇṇa, jivhāviññeyyā rasā … pe … santi kho, puṇṇa, manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. Tañce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa taṁ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjati nandī. ‘Nandisamudayā dukkhasamudayo, puṇṇā’ti vadāmi.",
    "sn35.88:3": "Santi kho, puṇṇa, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. Tañce bhikkhu nābhinandati nābhivadati nājjhosāya tiṭṭhati, tassa taṁ anabhinandato anabhivadato anajjhosāya tiṭṭhato nirujjhati nandī. ‘Nandinirodhā dukkhanirodho, puṇṇā’ti vadāmi … pe … santi kho, puṇṇa, manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. Tañce bhikkhu nābhinandati nābhivadati nājjhosāya tiṭṭhati, tassa taṁ anabhinandato anabhivadato anajjhosāya tiṭṭhato nirujjhati nandī. ‘Nandinirodhā dukkhanirodho, puṇṇā’ti vadāmi.",
    "sn35.88:4": "Iminā tvaṁ, puṇṇa, mayā saṅkhittena ovādena ovadito katamasmiṁ janapade viharissasī\"ti?",
    "sn35.88:5": "\"Caṇḍā kho, puṇṇa, sunāparantakā manussā; pharusā kho, puṇṇa, sunāparantakā manussā. Sace taṁ, puṇṇa, sunāparantakā manussā akkosissanti paribhāsissanti, tatra te, puṇṇa, kinti bhavissatī\"ti?",
    "sn35.88:6": "\"Sace maṁ, bhante, sunāparantakā manussā akkosissanti paribhāsissanti, tatra me evaṁ bhavissati: ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṁ me nayime pāṇinā pahāraṁ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī\"ti.",
    "sn35.88:7": "\"Sace pana te, puṇṇa, sunāparantakā manussā pāṇinā pahāraṁ dassanti, tatra pana te, puṇṇa, kinti bhavissatī\"ti?",
    "sn35.88:8": "\"Sace me, bhante, sunāparantakā manussā pāṇinā pahāraṁ dassanti, tatra me evaṁ bhavissati: ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṁ me nayime leḍḍunā pahāraṁ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī\"ti.",
    "sn35.88:9": "\"Sace pana te, puṇṇa, sunāparantakā manussā leḍḍunā pahāraṁ dassanti, tatra pana te, puṇṇa, kinti bhavissatī\"ti?",
    "sn35.88:10": "\"Sace me, bhante, sunāparantakā manussā leḍḍunā pahāraṁ dassanti, tatra me evaṁ bhavissati: ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṁ me nayime daṇḍena pahāraṁ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī\"ti.",
    "sn35.88:11": "\"Sace pana puṇṇa, sunāparantakā manussā daṇḍena pahāraṁ dassanti, tatra pana te, puṇṇa, kinti bhavissatī\"ti?",
    "sn35.88:12": "\"Sace me, bhante, sunāparantakā manussā daṇḍena pahāraṁ dassanti, tatra me evaṁ bhavissati: ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṁ me nayime satthena pahāraṁ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī\"ti.",
    "sn35.88:13": "\"Sace pana te, puṇṇa, sunāparantakā manussā satthena pahāraṁ dassanti, tatra pana te, puṇṇa, kinti bhavissatī\"ti?",
    "sn35.88:14": "\"Sace me, bhante, sunāparantakā manussā satthena pahāraṁ dassanti, tatra me evaṁ bhavissati: ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṁ maṁ nayime tiṇhena satthena jīvitā voropentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī\"ti.",
    "sn35.88:15": "\"Sace pana taṁ, puṇṇa, sunāparantakā manussā tiṇhena satthena jīvitā voropessanti, tatra pana te, puṇṇa, kinti bhavissatī\"ti?",
    "sn35.88:16": "\"Sace maṁ, bhante, sunāparantakā manussā tiṇhena satthena jīvitā voropessanti, tatra me evaṁ bhavissati: ‘santi kho tassa bhagavato sāvakā kāyena ca jīvitena ca aṭṭīyamānā harāyamānā jigucchamānā satthahārakaṁ pariyesanti, taṁ me idaṁ apariyiṭṭhaññeva satthahārakaṁ laddhan’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī\"ti.",
    "sn35.88:17": "\"Sādhu sādhu, puṇṇa. Sakkhissasi kho tvaṁ, puṇṇa, iminā damūpasamena samannāgato sunāparantasmiṁ janapade vatthuṁ. Yassadāni tvaṁ, puṇṇa, kālaṁ maññasī\"ti.",
    "sn35.88:18": "Atha kho āyasmā puṇṇo bhagavato vacanaṁ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā senāsanaṁ saṁsāmetvā pattacīvaramādāya yena sunāparanto janapado tena cārikaṁ pakkāmi. Anupubbena cārikaṁ caramāno yena sunāparanto janapado tadavasari. Tatra sudaṁ āyasmā puṇṇo sunāparantasmiṁ janapade vihārati. Atha kho āyasmā puṇṇo tenevantaravassena pañcamattāni upāsakasatāni paṭivedesi. Tenevantaravassena pañcamattāni upāsikāsatāni paṭivedesi. Tenevantaravassena tisso vijjā sacchākāsi. Tenevantaravassena parinibbāyi.",
    "sn35.88:19": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṁsu … pe … ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ: \"yo so, bhante, puṇṇo nāma kulaputto bhagavatā saṅkhittena ovādena ovadito, so kālaṅkato. Tassa kā gati ko abhisamparāyo\"ti?",
    "sn35.88:20": "\"Paṇḍito, bhikkhave, puṇṇo kulaputto, paccapādi dhammassānudhammaṁ, na ca maṁ dhammādhikaraṇaṁ vihesesi. Parinibbuto, bhikkhave, puṇṇo kulaputto\"ti."
}