{
    "sn35.89:1": "Atha kho āyasmā bāhiyo yena bhagavā tenupasaṅkami … pe … ekamantaṁ nisinno kho āyasmā bāhiyo bhagavantaṁ etadavoca: \"sādhu me, bhante, bhagavā saṅkhittena dhammaṁ desetu, yamahaṁ bhagavato dhammaṁ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyyan\"ti.",
    "sn35.89:2": "\"Taṁ kiṁ maññasi, bāhiya, cakkhu niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.89:3": "\"Aniccaṁ, bhante\".",
    "sn35.89:4": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.89:5": "\"Dukkhaṁ, bhante\".",
    "sn35.89:6": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.89:7": "\"No hetaṁ, bhante\".",
    "sn35.89:8": "\"Rūpā niccā vā aniccā vā\"ti?",
    "sn35.89:9": "\"Aniccā, bhante\" … pe … cakkhuviññāṇaṁ … pe … cakkhusamphasso … pe … yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.89:10": "\"Aniccaṁ, bhante\".",
    "sn35.89:11": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.89:12": "\"Dukkhaṁ, bhante\".",
    "sn35.89:13": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.89:14": "\"No hetaṁ, bhante\".",
    "sn35.89:15": "\"Evaṁ passaṁ, bāhiya, sutavā ariyasāvako cakkhusmimpi nibbindati, rūpesupi nibbindati, cakkhuviññāṇepi nibbindati, cakkhusamphassepi nibbindati … pe … yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati; vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānātī\"ti.",
    "sn35.89:16": "Atha kho āyasmā bāhiyo bhagavato bhāsitaṁ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā pakkāmi. Atha kho āyasmā bāhiyo eko vūpakaṭṭho appamatto ātāpī pahitatto vihāranto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti, tadanuttaraṁ – brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāsi. \"Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā\"ti abbhaññāsi. Aññataro ca panāyasmā bāhiyo arahataṁ ahosīti."
}