{
    "sn35.74:1": "Sāvatthinidānaṁ. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami … pe … ekamantaṁ nisinno kho so bhikkhu bhagavantaṁ etadavoca: \"amukasmiṁ, bhante, vihāre aññataro bhikkhu navo appaññāto ābādhiko dukkhito bāḷhagilāno. Sādhu, bhante, bhagavā yena so bhikkhu tenupasaṅkamatu anukampāṁ upādāyā\"ti.",
    "sn35.74:2": "Atha kho bhagavā navavādañca sutvā gilānavādañca, \"appaññāto bhikkhū\"ti iti viditvā yena so bhikkhu tenupasaṅkami. Addasā kho so bhikkhu bhagavantaṁ dūratova āgacchantaṁ. Disvāna mañcake samadhosi. Atha kho bhagavā taṁ bhikkhuṁ etadavoca: \"Alaṁ, bhikkhu, mā tvaṁ mañcake samadhosi. Santimāni āsanāni paññattāni, tatthāhaṁ nisīdissāmī\"ti. Nisīdi bhagavā paññatte āsane. Nisajja kho bhagavā taṁ bhikkhuṁ etadavoca: \"Kacci te, bhikkhu, khamanīyaṁ, kacci yāpanīyaṁ, kacci dukkhā vedanā paṭikkamanti no abhikkamanti, paṭikkamosānaṁ paññāyati no abhikkamo\"ti?",
    "sn35.74:3": "\"Na me, bhante, khamanīyaṁ, na yāpanīyaṁ, bāḷhā me dukkhā vedanā abhikkamanti no paṭikkamanti, abhikkamosānaṁ paññāyati no paṭikkamo\"ti.",
    "sn35.74:4": "\"Kacci te, bhikkhu, na kiñci kukkuccaṁ, na koci vippaṭisāro\"ti?",
    "sn35.74:5": "\"Taggha me, bhante, anappakaṁ kukkuccaṁ, anappako vippaṭisāro\"ti.",
    "sn35.74:6": "\"Kacci pana taṁ, bhikkhu, attā sīlato upavadatī\"ti?",
    "sn35.74:7": "\"Na kho maṁ, bhante, attā sīlato upavadatī\"ti.",
    "sn35.74:8": "\"No ce kira te, bhikkhu, attā sīlato upavadati, atha kiñca te kukkuccaṁ ko ca vippaṭisāro\"ti?",
    "sn35.74:9": "\"Na khvāhaṁ, bhante, sīlavisuddhatthaṁ bhagavatā dhammaṁ desitaṁ ājānāmī\"ti.",
    "sn35.74:10": "\"No ce kira tvaṁ, bhikkhu, sīlavisuddhatthaṁ mayā dhammaṁ desitaṁ ājānāsi, atha kimatthaṁ carahi tvaṁ, bhikkhu, mayā dhammaṁ desitaṁ ājānāsī\"ti?",
    "sn35.74:11": "\"Rāgavirāgatthaṁ khvāhaṁ, bhante, bhagavatā dhammaṁ desitaṁ ājānāmī\"ti.",
    "sn35.74:12": "\"Sādhu sādhu, bhikkhu. Sādhu kho tvaṁ, bhikkhu, rāgavirāgatthaṁ mayā dhammaṁ desitaṁ ājānāsi. Rāgavirāgattho hi, bhikkhu, mayā dhammo desito.",
    "sn35.74:13": "\"Aniccaṁ, bhante\".",
    "sn35.74:14": "\" … pe … Sotaṁ … ghānaṁ … jivhā … kāyo … mano nicco vā anicco vā\"ti?",
    "sn35.74:15": "\"Anicco, bhante\".",
    "sn35.74:16": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.74:17": "\"Dukkhaṁ, bhante\".",
    "sn35.74:18": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.74:19": "\"No hetaṁ, bhante\".",
    "sn35.74:20": "\"Evaṁ passaṁ, bhikkhu, sutavā ariyasāvako cakkhusmimpi nibbindati, sotasmimpi nibbindati … pe … manasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati; vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti … pe … nāparaṁ itthattāyā’ti pajānātī\"ti.",
    "sn35.74:21": "Idamavoca bhagavā. Attamano so bhikkhu bhagavato bhāsitaṁ abhinandi. Imasmiñca pana veyyākaraṇasmiṁ bhaññamāne tassa bhikkhuno virajaṁ vītamalaṁ dhammacakkhuṁ udapādi: \"yaṁ kiñci samudayadhammaṁ sabbaṁ taṁ nirodhadhamman\"ti."
}