{
    "sn35.116:1": "\"Nāhaṁ, bhikkhave, gamanena lokassa antaṁ ñāteyyaṁ, daṭṭheyyaṁ, patteyyanti vadāmi. Na ca panāhaṁ, bhikkhave, appatvā lokassa antaṁ dukkhassa antakiriyaṁ vadāmī\"ti.",
    "sn35.116:2": "Atha kho tesaṁ bhikkhūnaṁ etadahosi: \"Ayaṁ kho āyasmā ānando satthu ceva saṁvaṇṇito, sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā ānando imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā ānando tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ Ānandaṁ etamatthaṁ paṭipuccheyyāmā\"ti.",
    "sn35.116:3": "Atha kho te bhikkhū yenāyasmā ānando tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā ānandena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū āyasmantaṁ Ānandaṁ etadavocuṁ:",
    "sn35.116:4": "\"Idaṁ kho no, āvuso Ānanda, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘nāhaṁ, bhikkhave, gamanena lokassa antaṁ ñāteyyaṁ, daṭṭheyyaṁ, patteyyanti vadāmi. Na ca panāhaṁ, bhikkhave, appatvā lokassa antaṁ dukkhassa antakiriyaṁ vadāmī’ti. Tesaṁ no, āvuso, amhākaṁ acirapakkantassa bhagavato etadahosi: ‘idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho – nāhaṁ, bhikkhave, gamanena lokassa antaṁ ñāteyyaṁ, daṭṭheyyaṁ, patteyyanti vadāmi. Na ca panāhaṁ, bhikkhave, appatvā lokassa antaṁ dukkhassa antakiriyaṁ vadāmīti. Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā’ti? Tesaṁ no, āvuso, amhākaṁ etadahosi: ‘Ayaṁ kho, āvuso, āyasmā ānando satthu ceva saṁvaṇṇito, sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā ānando imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā ānando tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ Ānandaṁ etamatthaṁ paṭipuccheyyāmā’ti. Vibhajatāyasmā ānando\"ti.",
    "sn35.116:5": "\"Seyyathāpi, āvuso, puriso sāratthiko sāragavesī sārapariyesanaṁ caramāno mahato rukkhassa tiṭṭhato sāravato atikkammeva, mūlaṁ atikkammeva, khandhaṁ sākhāpalāse sāraṁ pariyesitabbaṁ maññeyya; evaṁ sampadamidaṁ āyasmantānaṁ satthari sammukhībhūte taṁ bhagavantaṁ atisitvā amhe etamatthaṁ paṭipucchitabbaṁ maññatha. So hāvuso, bhagavā jānaṁ jānāti, passaṁ passati – cakkhubhūto, ñāṇabhūto, dhammabhūto, brahmabhūto, vattā, pavattā, atthassa ninnetā, amatassa dātā, dhammassāmī, tathāgato. So ceva panetassa kālo ahosi yaṁ bhagavantaṁyeva etamatthaṁ paṭipuccheyyātha. Yathā vo bhagavā byākareyya tathā vo dhāreyyāthā\"ti.",
    "sn35.116:6": "\"Addhāvuso Ānanda, bhagavā jānaṁ jānāti, passaṁ passati – cakkhubhūto, ñāṇabhūto, dhammabhūto, brahmabhūto, vattā, pavattā, atthassa ninnetā, amatassa dātā, dhammassāmī, tathāgato. So ceva panetassa kālo ahosi yaṁ bhagavantaṁyeva etamatthaṁ paṭipuccheyyāma. Yathā no bhagavā byākareyya tathā naṁ dhāreyyāma. Api cāyasmā ānando satthu ceva saṁvaṇṇito, sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā ānando imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Vibhajatāyasmā ānando agaruṁ karitvā\"ti.",
    "sn35.116:7": "\"Tenahāvuso, suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "sn35.116:8": "\"Yaṁ kho vo, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘nāhaṁ, bhikkhave, gamanena lokassa antaṁ ñāteyyaṁ, daṭṭheyyaṁ, patteyyanti vadāmi. Na ca panāhaṁ, bhikkhave, appatvā lokassa antaṁ dukkhassa antakiriyaṁ vadāmī’ti, imassa khvāhaṁ, āvuso, bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ ājānāmi. Yena kho, āvuso, lokasmiṁ lokasaññī hoti lokamānī – ayaṁ vuccati ariyassa vinaye loko. Kena cāvuso, lokasmiṁ lokasaññī hoti lokamānī? Cakkhunā kho, āvuso, lokasmiṁ lokasaññī hoti lokamānī. Sotena kho, āvuso … ghānena kho, āvuso … jivhāya kho, āvuso, lokasmiṁ lokasaññī hoti lokamānī. Kāyena kho, āvuso … manena kho, āvuso, lokasmiṁ lokasaññī hoti lokamānī. Yena kho, āvuso, lokasmiṁ lokasaññī hoti lokamānī – ayaṁ vuccati ariyassa vinaye loko.",
    "sn35.116:9": "\"Evamāvuso\"ti kho te bhikkhū āyasmato ānandassa paṭissutvā uṭṭhāyāsanā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ:",
    "sn35.116:10": "\"Yaṁ kho no, bhante, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘nāhaṁ, bhikkhave, gamanena lokassa antaṁ ñāteyyaṁ, daṭṭheyyaṁ, patteyyanti vadāmi. Na ca panāhaṁ, bhikkhave, appatvā lokassa antaṁ dukkhassa antakiriyaṁ vadāmī’ti. Tesaṁ no, bhante, amhākaṁ acirapakkantassa bhagavato etadahosi: ‘idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho – nāhaṁ, bhikkhave, gamanena lokassa antaṁ ñāteyyaṁ, daṭṭheyyaṁ, patteyyanti vadāmi. Na ca panāhaṁ, bhikkhave, appatvā lokassa antaṁ dukkhassa antakiriyaṁ vadāmīti. Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā’ti? Tesaṁ no, bhante, amhākaṁ etadahosi: ‘Ayaṁ kho āyasmā ānando satthu ceva saṁvaṇṇito, sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā ānando imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā ānando tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ Ānandaṁ etamatthaṁ paṭipuccheyyāmā’ti. Atha kho mayaṁ, bhante, yenāyasmā ānando tenupasaṅkamimha; upasaṅkamitvā āyasmantaṁ Ānandaṁ etamatthaṁ paṭipucchimha. Tesaṁ no, bhante, āyasmatā ānandena imehi ākārehi imehi padehi imehi byañjanehi attho vibhatto\"ti.",
    "sn35.116:11": "\"Paṇḍito, bhikkhave, ānando; mahāpañño, bhikkhave, ānando. Mañcepi tumhe, bhikkhave, etamatthaṁ paṭipuccheyyātha, ahampi taṁ evamevaṁ byākareyyaṁ yathā taṁ ānandena byākataṁ. Eso cevetassa attho, evañca naṁ dhāreyyāthā\"ti."
}