{
    "sn35.62:1": "\"Sabbupādānapariyādānāya vo, bhikkhave, dhammaṁ desessāmi. Taṁ suṇātha. Katamo ca, bhikkhave, sabbupādānapariyādānāya dhammo?",
    "sn35.62:2": "Taṁ kiṁ maññatha, bhikkhave, cakkhu niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.62:3": "\"Aniccaṁ, bhante\".",
    "sn35.62:4": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.62:5": "\"Dukkhaṁ, bhante\".",
    "sn35.62:6": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.62:7": "\"No hetaṁ, bhante\".",
    "sn35.62:8": "\"Rūpā … pe … cakkhuviññāṇaṁ niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.62:9": "\"Aniccaṁ, bhante\" … pe … .",
    "sn35.62:10": "\"Cakkhusamphasso nicco vā anicco vā\"ti?",
    "sn35.62:11": "\"Anicco, bhante\" … pe … .",
    "sn35.62:12": "\"Yampidaṁ cakkhusamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.62:13": "\"Aniccaṁ, bhante\" … pe … .",
    "sn35.62:14": "\"Sotaṁ … ghānaṁ … jivhā … kāyo … mano … dhammā … manoviññāṇaṁ … manosamphasso … yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā, tampi niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.62:15": "\"Aniccaṁ, bhante\".",
    "sn35.62:16": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.62:17": "\"Dukkhaṁ, bhante\".",
    "sn35.62:18": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.62:19": "\"No hetaṁ, bhante\".",
    "sn35.62:20": "\"Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako cakkhusmimpi nibbindati, rūpesupi nibbindati, cakkhuviññāṇepi nibbindati, cakkhusamphassepi nibbindati. Yampidaṁ cakkhusamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tasmimpi nibbindati … pe … jivhāyapi nibbindati, rasesupi nibbindati, jivhāviññāṇepi nibbindati, jivhāsamphassepi nibbindati, yampidaṁ jivhāsamphassapaccayā uppajjati … pe … manasmimpi nibbindati, dhammesupi nibbindati, manoviññāṇepi nibbindati, manosamphassepi nibbindati. Yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati; vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti.",
    "sn35.62:21": "Avijjā saṁyojanā dve,āsavena duve vuttā;Anusayā apare dve,pariññā dve pariyādinnaṁ;Vaggo tena pavuccatīti."
}