{
    "sn35.243:1": "Ekaṁ samayaṁ bhagavā sakkesu vihārati kapilavatthusmiṁ nigrodhārāme. Tena kho pana samayena kāpilavatthavānaṁ sakyānaṁ navaṁ santhāgāraṁ acirakāritaṁ hoti anajjhāvuṭṭhaṁ samaṇena vā brāhmaṇena vā kenaci vā manussabhūtena. Atha kho kāpilavatthavā sakyā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho kāpilavatthavā sakyā bhagavantaṁ etadavocuṁ:",
    "sn35.243:2": "Atha kho kāpilavatthavā sakyā bhagavato adhivāsanaṁ viditvā uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā yena navaṁ santhāgāraṁ tenupasaṅkamiṁsu; upasaṅkamitvā sabbasanthariṁ santhāgāraṁ santharitvā āsanāni paññāpetvā udakamaṇikaṁ patiṭṭhāpetvā telappadīpaṁ āropetvā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ etadavocuṁ: \"sabbasantharisanthataṁ, bhante, santhāgāraṁ, āsanāni paññattāni, udakamaṇiko patiṭṭhāpito, telappadīpo āropito. Yassadāni, bhante, bhagavā kālaṁ maññatī\"ti.",
    "sn35.243:3": "Atha kho bhagavā acirapakkantesu kāpilavatthavesu sakyesu āyasmantaṁ mahāmoggallānaṁ āmantesi: \"vigatathinamiddho kho, moggallāna, bhikkhusaṅgho. Paṭibhātu taṁ, moggallāna, bhikkhūnaṁ dhammī kathā. Piṭṭhi me āgilāyati; tamahaṁ āyamissāmī\"ti.",
    "sn35.243:4": "\"Kathaṁ, āvuso, avassuto hoti? Idhāvuso, bhikkhu cakkhunā rūpaṁ disvā piyarūpe rūpe adhimuccati, appiyarūpe rūpe byāpajjati, anupaṭṭhitakāyassatī vihārati parittacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti … pe … jivhāya rasaṁ sāyitvā … pe … manasā dhammaṁ viññāya piyarūpe dhamme adhimuccati, appiyarūpe dhamme byāpajjati, anupaṭṭhitakāyassatī ca vihārati parittacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti.",
    "sn35.243:5": "Seyyathāpi, āvuso, naḷāgāraṁ vā tiṇāgāraṁ vā sukkhaṁ kolāpaṁ terovassikaṁ. Puratthimāya cepi naṁ disāya puriso ādittāya tiṇukkāya upasaṅkameyya, labhetheva aggi otāraṁ, labhetha aggi ārammaṇaṁ; pacchimāya cepi naṁ disāya puriso ādittāya tiṇukkāya upasaṅkameyya … pe … uttarāya cepi naṁ disāya … pe … dakkhiṇāya cepi naṁ disāya … pe … heṭṭhimato cepi naṁ … pe … uparimato cepi naṁ … yato kutoci cepi naṁ puriso ādittāya tiṇukkāya upasaṅkameyya, labhetheva aggi otāraṁ labhetha aggi ārammaṇaṁ.",
    "sn35.243:6": "Kathañcāvuso, anavassuto hoti? Idhāvuso, bhikkhu cakkhunā rūpaṁ disvā piyarūpe rūpe nādhimuccati, appiyarūpe rūpe na byāpajjati, upaṭṭhitakāyassati ca vihārati appamāṇacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ pajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti … pe … jivhāya rasaṁ sāyitvā … pe … manasā dhammaṁ viññāya piyarūpe dhamme nādhimuccati, appiyarūpe dhamme na byāpajjati, upaṭṭhitakāyassati ca vihārati appamāṇacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ pajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti. Ayaṁ vuccatāvuso, bhikkhu anavassuto cakkhuviññeyyesu rūpesu … pe … anavassuto manoviññeyyesu dhammesu.",
    "sn35.243:7": "Seyyathāpi, āvuso, kūṭāgāraṁ vā sālā vā bahalamattikā addāvalepanā. Puratthimāya cepi naṁ disāya puriso ādittāya tiṇukkāya upasaṅkameyya, neva labhetha aggi otāraṁ, na labhetha aggi ārammaṇaṁ … pe … pacchimāya cepi naṁ … uttarāya cepi naṁ … dakkhiṇāya cepi naṁ … heṭṭhimato cepi naṁ … uparimato cepi naṁ … yato kutoci cepi naṁ puriso ādittāya tiṇukkāya upasaṅkameyya, neva labhetha aggi otāraṁ, na labhetha aggi ārammaṇaṁ. Evameva kho, āvuso, evaṁvihāriṁ bhikkhuṁ cakkhuto cepi naṁ māro upasaṅkamati, neva labhati māro otāraṁ, na labhati māro ārammaṇaṁ … pe … manato cepi naṁ māro upasaṅkamati, neva labhati māro otāraṁ, na labhati māro ārammaṇaṁ.",
    "sn35.243:8": "Atha kho bhagavā uṭṭhahitvā āyasmantaṁ mahāmoggallānaṁ āmantesi: \"sādhu sādhu, moggallāna. Sādhu kho tvaṁ, moggallāna, bhikkhūnaṁ avassutapariyāyañca anavassutapariyāyañca abhāsī\"ti.",
    "sn35.243:9": "Idamavoca āyasmā mahāmoggallāno. Samanuñño satthā ahosi. Attamanā te bhikkhū āyasmato mahāmoggallānassa bhāsitaṁ abhinandunti."
}