{
    "sn35.103:1": "\"Udako sudaṁ, bhikkhave, rāmaputto evaṁ vācaṁ bhāsati: ‘idaṁ jātu vedagū, idaṁ jātu sabbajī, idaṁ jātu apalikhataṁ gaṇḍamūlaṁ palikhaṇin’ti. Taṁ kho panetaṁ, bhikkhave, udako rāmaputto avedagūyeva samāno ‘vedagūsmī’ti bhāsati, asabbajīyeva samāno ‘sabbajīsmī’ti bhāsati, apalikhataṁyeva gaṇḍamūlaṁ palikhataṁ me ‘gaṇḍamūlan’ti bhāsati. Idha kho taṁ, bhikkhave, bhikkhu sammā vadamāno vadeyya: ‘idaṁ jātu vedagū, idaṁ jātu sabbajī, idaṁ jātu apalikhataṁ gaṇḍamūlaṁ palikhaṇin’ti.",
    "sn35.103:2": "Kathañca, bhikkhave, vedagū hoti? Yato kho, bhikkhave, bhikkhu channaṁ phassāyatanānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ pajānāti; evaṁ kho, bhikkhave, bhikkhu vedagū hoti.",
    "sn35.103:3": "Kathañca, bhikkhave, bhikkhu sabbajī hoti? Yato kho, bhikkhave, bhikkhu channaṁ phassāyatanānaṁ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṁ viditvā anupādāvimutto hoti; evaṁ kho, bhikkhave, bhikkhu sabbajī hoti.",
    "sn35.103:4": "Kathañca, bhikkhave, bhikkhuno apalikhataṁ gaṇḍamūlaṁ palikhataṁ hoti? Gaṇḍoti kho, bhikkhave, imassetaṁ cātumahābhūtikassa kāyassa adhivacanaṁ mātāpettikasambhavassa odanakummāsūpacayassa aniccucchādanaparimaddanabhedanaviddhaṁsanadhammassa. Gaṇḍamūlanti kho, bhikkhave, taṇhāyetaṁ adhivacanaṁ. Yato kho, bhikkhave, bhikkhuno taṇhā pahīnā hoti ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anup pāda dhammā; evaṁ kho, bhikkhave, bhikkhuno apalikhataṁ gaṇḍamūlaṁ palikhataṁ hoti.",
    "sn35.103:5": "Udako sudaṁ, bhikkhave, rāmaputto evaṁ vācaṁ bhāsati: ‘idaṁ jātu vedagū, idaṁ jātu sabbajī, idaṁ jātu apalikhataṁ gaṇḍamūlaṁ palikhaṇin’ti. Taṁ kho panetaṁ, bhikkhave, udako rāmaputto avedagūyeva samāno ‘vedagūsmī’ti bhāsati, asabbajīyeva samāno ‘sabbajīsmī’ti bhāsati; apalikhataṁyeva gaṇḍamūlaṁ ‘palikhataṁ me gaṇḍamūlan’ti bhāsati. Idha kho taṁ, bhikkhave, bhikkhu sammā vadamāno vadeyya: ‘idaṁ jātu vedagū, idaṁ jātu sabbajī, idaṁ jātu apalikhataṁ gaṇḍamūlaṁ palikhaṇin’\"ti.",
    "sn35.103:6": "Dve saṅgayhā parihānaṁ,Pamādavihārī ca saṁvaro;Samādhi paṭisallānaṁ,Dve natumhākena uddakoti.",
    "sn35.103:7": "Avijjā migajālañca,Gilānaṁ channaṁ catutthakaṁ;Saḷavaggena paññāsaṁ,Dutiyo paṇṇāsako ayanti."
}