{
    "sn35.101:1": "\"Yaṁ, bhikkhave, na tumhākaṁ, taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissati. Kiñca, bhikkhave, na tumhākaṁ? Cakkhu, bhikkhave, na tumhākaṁ. Taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissati. Rūpā na tumhākaṁ. Te pajahatha. Te vo pahīnā hitāya sukhāya bhavissanti. Cakkhuviññāṇaṁ na tumhākaṁ. Taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissati. Cakkhusamphasso na tumhākaṁ. Taṁ pajahatha. So vo pahīno hitāya sukhāya bhavissati. Yampidaṁ cakkhusamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi na tumhākaṁ. Taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissati. … pe …",
    "sn35.101:2": "Jivhā na tumhākaṁ. Taṁ pajahatha. Sā vo pahīnā hitāya sukhāya bhavissati. Rasā na tumhākaṁ. Te pajahatha. Te vo pahīnā hitāya sukhāya bhavissanti. Jivhāviññāṇaṁ na tumhākaṁ. Taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissati. Jivhāsamphasso na tumhākaṁ. Taṁ pajahatha. So vo pahīno hitāya sukhāya bhavissati. Yampidaṁ jivhāsamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi na tumhākaṁ. Taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissati … pe … .",
    "sn35.101:3": "Mano na tumhākaṁ. Taṁ pajahatha. So vo pahīno hitāya sukhāya bhavissati. Dhammā na tumhākaṁ. Te pajahatha. Te vo pahīnā hitāya sukhāya bhavissanti. Manoviññāṇaṁ na tumhākaṁ. Taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissati. Manosamphasso na tumhākaṁ. Taṁ pajahatha. So vo pahīno hitāya sukhāya bhavissati. Yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi na tumhākaṁ. Taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissati.",
    "sn35.101:4": "Seyyathāpi, bhikkhave, yaṁ imasmiṁ jetavane tiṇakaṭṭhasākhāpalāsaṁ taṁ jano hareyya vā ḍaheyya vā yathāpaccayaṁ vā kareyya, api nu tumhākaṁ evamassa: ‘amhe jano harati vā ḍahati vā yathāpaccayaṁ vā karotī’\"ti?",
    "sn35.101:5": "\"No hetaṁ, bhante\".",
    "sn35.101:6": "\"Taṁ kissa hetu\"?",
    "sn35.101:7": "\"Na hi no etaṁ, bhante, attā vā attaniyaṁ vā\"ti.",
    "sn35.101:8": "\"Evameva kho, bhikkhave, cakkhu na tumhākaṁ. Taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissati. Rūpā na tumhākaṁ … cakkhuviññāṇaṁ … cakkhusamphasso … pe … yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi na tumhākaṁ. Taṁ pajahatha. Taṁ vo pahīnaṁ hitāya sukhāya bhavissatī\"ti."
}