{
    "sn35.241:1": "Ekaṁ samayaṁ bhagavā kosambiyaṁ vihārati gaṅgāya nadiyā tīre. Addasā kho bhagavā mahantaṁ dārukkhandhaṁ gaṅgāya nadiyā sotena vuyhamānaṁ. Disvāna bhikkhū āmantesi: \"passatha no tumhe, bhikkhave, amuṁ mahantaṁ dārukkhandhaṁ gaṅgāya nadiyā sotena vuyhamānan\"ti?",
    "sn35.241:2": "Evameva kho, bhikkhave, sace tumhepi na orimaṁ tīraṁ upagacchatha, na pārimaṁ tīraṁ upagacchatha; na majjhe saṁsīdissatha, na thale ussīdissatha, na manussaggāho gahessati, na amanussaggāho gahessati, na āvaṭṭaggāho gahessati, na antopūtī bhavissatha; evaṁ tumhe, bhikkhave, nibbānaninnā bhavissatha nibbānapoṇā nibbānapabbhārā. Taṁ kissa hetu? Nibbānaninnā, bhikkhave, sammādiṭṭhi nibbānapoṇā nibbānapabbhārā\"ti.",
    "sn35.241:3": "\"‘Orimaṁ tīran’ti kho, bhikkhu, channetaṁ ajjhattikānaṁ āyatanānaṁ adhivacanaṁ. ‘Pārimaṁ tīran’ti kho, bhikkhu, channetaṁ bāhirānaṁ āyatanānaṁ adhivacanaṁ. ‘Majjhe saṁsādo’ti kho, bhikkhu, nandīrāgassetaṁ adhivacanaṁ. ‘Thale ussādo’ti kho, bhikkhu, asmimānassetaṁ adhivacanaṁ.",
    "sn35.241:4": "Katamo ca, bhikkhu, manussaggāho? Idha, bhikkhu, gihīhi saṁsaṭṭho vihārati, sahanandī sahasokī, sukhitesu sukhito, dukkhitesu dukkhito, uppannesu kiccakaraṇīyesu attanā tesu yogaṁ āpajjati. Ayaṁ vuccati, bhikkhu, manussaggāho.",
    "sn35.241:5": "Katamo ca, bhikkhu, amanussaggāho? Idha, bhikkhu, ekacco aññataraṁ devanikāyaṁ paṇidhāya brahmacariyaṁ carati: ‘imināhaṁ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Ayaṁ vuccati, bhikkhu, amanussaggāho.",
    "sn35.241:6": "Katamo ca, bhikkhu, antopūtibhāvo? Idha, bhikkhu, ekacco dussīlo hoti pāpadhammo asucisaṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto. Ayaṁ vuccati, bhikkhu, ‘antopūtibhāvo’\"ti.",
    "sn35.241:7": "Tena kho pana samayena nando gopālako bhagavato avidūre ṭhito hoti. Atha kho nando gopālako bhagavantaṁ etadavoca: \"ahaṁ kho, bhante, na orimaṁ tīraṁ upagacchāmi, na pārimaṁ tīraṁ upagacchāmi, na majjhe saṁsīdissāmi, na thale ussīdissāmi, na maṁ manussaggāho gahessati, na amanussaggāho gahessati, na āvaṭṭaggāho gahessati, na antopūti bhavissāmi. Labheyyāhaṁ, bhante, bhagavato santike pabbajjaṁ, labheyyaṁ upasampadan\"ti."
}