{
    "sn35.75:1": "Atha kho aññataro bhikkhu … pe … bhagavantaṁ etadavoca: \"amukasmiṁ, bhante, vihāre aññataro bhikkhu navo appaññāto ābādhiko dukkhito bāḷhagilāno. Sādhu, bhante, bhagavā yena so bhikkhu tenupasaṅkamatu anukampāṁ upādāyā\"ti.",
    "sn35.75:2": "Atha kho bhagavā navavādañca sutvā gilānavādañca, \"appaññāto bhikkhū\"ti iti viditvā yena so bhikkhu tenupasaṅkami. Addasā kho so bhikkhu bhagavantaṁ dūratova āgacchantaṁ. Disvāna mañcake samadhosi. Atha kho bhagavā taṁ bhikkhuṁ etadavoca: \"Alaṁ, bhikkhu, mā tvaṁ mañcake samadhosi. Santimāni āsanāni paññattāni, tatthāhaṁ nisīdissāmī\"ti. Nisīdi bhagavā paññatte āsane. Nisajja kho bhagavā taṁ bhikkhuṁ etadavoca: \"Kacci te, bhikkhu, khamanīyaṁ, kacci yāpanīyaṁ, kacci dukkhā vedanā paṭikkamanti no abhikkamanti, paṭikkamosānaṁ paññāyati no abhikkamo\"ti?",
    "sn35.75:3": "\"Na me, bhante, khamanīyaṁ, na yāpanīyaṁ … pe … na kho maṁ, bhante, attā sīlato upavadatī\"ti.",
    "sn35.75:4": "\"No ce kira te, bhikkhu, attā sīlato upavadati, atha kiñca te kukkuccaṁ ko ca vippaṭisāro\"ti?",
    "sn35.75:5": "\"Na khvāhaṁ, bhante, sīlavisuddhatthaṁ bhagavatā dhammaṁ desitaṁ ājānāmī\"ti.",
    "sn35.75:6": "\"No ce kira tvaṁ, bhikkhu, sīlavisuddhatthaṁ mayā dhammaṁ desitaṁ ājānāsi, atha kimatthaṁ carahi tvaṁ, bhikkhu, mayā dhammaṁ desitaṁ ājānāsī\"ti?",
    "sn35.75:7": "\"Anupādāparinibbānatthaṁ khvāhaṁ, bhante, bhagavatā dhammaṁ desitaṁ ājānāmī\"ti.",
    "sn35.75:8": "\"Sādhu sādhu, bhikkhu. Sādhu kho tvaṁ, bhikkhu, anupādāparinibbānatthaṁ mayā dhammaṁ desitaṁ ājānāsi. Anupādāparinibbānattho hi, bhikkhu, mayā dhammo desito.",
    "sn35.75:9": "Taṁ kiṁ maññasi, bhikkhu, cakkhu niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.75:10": "\"Aniccaṁ, bhante\".",
    "sn35.75:11": "\" … pe … Sotaṁ … ghānaṁ … jivhā … kāyo … mano … manoviññāṇaṁ … manosamphasso … yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.75:12": "\"Aniccaṁ, bhante\".",
    "sn35.75:13": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.75:14": "\"Dukkhaṁ, bhante\".",
    "sn35.75:15": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.75:16": "\"No hetaṁ, bhante\".",
    "sn35.75:17": "\"Evaṁ passaṁ, bhikkhu, sutavā ariyasāvako cakkhusmimpi nibbindati … pe … manasmimpi … manoviññāṇepi … manosamphassepi nibbindati. Yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati; vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānātī\"ti.",
    "sn35.75:18": "Idamavoca bhagavā. Attamano so bhikkhu bhagavato bhāsitaṁ abhinandi. Imasmiñca pana veyyākaraṇasmiṁ bhaññamāne tassa bhikkhussa anupādāya āsavehi cittaṁ vimuccīti."
}