{
    "sn35.121:1": "Ekaṁ samayaṁ bhagavā sāvatthiyaṁ vihārati jetavane anāthapiṇḍikassa ārāme. Atha kho bhagavato rahogatassa paṭisallīnassa evaṁ cetaso parivitakko udapādi: \"paripakkā kho rāhulassa vimuttiparipācaniyā dhammā; yannūnāhaṁ rāhulaṁ uttariṁ āsavānaṁ khaye vineyyan\"ti. Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya sāvatthiyaṁ piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkanto āyasmantaṁ rāhulaṁ āmantesi: \"gaṇhāhi, rāhula, nisīdanaṁ. Yena andhavanaṁ tenupasaṅkamissāma divāvihārāyā\"ti. \"Evaṁ, bhante\"ti kho āyasmā rāhulo bhagavato paṭissutvā nisīdanaṁ ādāya bhagavantaṁ piṭṭhito piṭṭhito anubandhi.",
    "sn35.121:2": "Tena kho pana samayena anekāni devatāsahassāni bhagavantaṁ anubandhāni honti: \"ajja bhagavā āyasmantaṁ rāhulaṁ uttariṁ āsavānaṁ khaye vinessatī\"ti. Atha kho bhagavā andhavanaṁ ajjhogāhetvā aññatarasmiṁ rukkhamūle paññatte āsane nisīdi. Āyasmāpi kho rāhulo bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho āyasmantaṁ rāhulaṁ bhagavā etadavoca:",
    "sn35.121:3": "\"Taṁ kiṁ maññasi, rāhula, cakkhu niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.121:4": "\"Aniccaṁ, bhante\".",
    "sn35.121:5": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.121:6": "\"Dukkhaṁ, bhante\".",
    "sn35.121:7": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.121:8": "\"No hetaṁ, bhante\".",
    "sn35.121:9": "\"Rūpā niccā vā aniccā vā\"ti?",
    "sn35.121:10": "\"Aniccā, bhante\" … pe … .",
    "sn35.121:11": "\"Cakkhuviññāṇaṁ niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.121:12": "\"Aniccaṁ, bhante\" … pe … .",
    "sn35.121:13": "\"Cakkhusamphasso nicco vā anicco vā\"ti?",
    "sn35.121:14": "\"Anicco, bhante\" … pe … .",
    "sn35.121:15": "\"Yampidaṁ cakkhusamphassapaccayā uppajjati vedanāgataṁ, saññāgataṁ, saṅkhāragataṁ, viññāṇagataṁ, tampi niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.121:16": "\"Aniccaṁ, bhante\".",
    "sn35.121:17": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.121:18": "\"Dukkhaṁ, bhante\".",
    "sn35.121:19": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.121:20": "\"No hetaṁ, bhante\" … pe … .",
    "sn35.121:21": "\"Jivhā niccā vā aniccā vā\"ti?",
    "sn35.121:22": "\"Aniccā, bhante\" … pe … .",
    "sn35.121:23": "\"Jivhāviññāṇaṁ niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.121:24": "\"Aniccaṁ, bhante\" … pe … .",
    "sn35.121:25": "\"Jivhāsamphasso nicco vā anicco vā\"ti?",
    "sn35.121:26": "\"Anicco, bhante\" … pe … .",
    "sn35.121:27": "\"Yampidaṁ jivhāsamphassapaccayā uppajjati vedanāgataṁ, saññāgataṁ, saṅkhāragataṁ, viññāṇagataṁ, tampi niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.121:28": "\"Aniccaṁ, bhante\".",
    "sn35.121:29": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.121:30": "\"Dukkhaṁ, bhante\".",
    "sn35.121:31": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.121:32": "\"No hetaṁ, bhante\" … pe … .",
    "sn35.121:33": "\"Mano nicco vā anicco vā\"ti?",
    "sn35.121:34": "\"Anicco, bhante\".",
    "sn35.121:35": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.121:36": "\"Dukkhaṁ, bhante\".",
    "sn35.121:37": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.121:38": "\"No hetaṁ, bhante\".",
    "sn35.121:39": "\"Dhammā niccā vā aniccā vā\"ti?",
    "sn35.121:40": "\"Aniccā, bhante\" … pe … .",
    "sn35.121:41": "\"Manoviññāṇaṁ niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.121:42": "\"Aniccaṁ, bhante\" … pe … .",
    "sn35.121:43": "\"Manosamphasso nicco vā anicco vā\"ti?",
    "sn35.121:44": "\"Anicco, bhante\" … pe … .",
    "sn35.121:45": "\"Yampidaṁ manosamphassapaccayā uppajjati vedanāgataṁ, saññāgataṁ, saṅkhāragataṁ, viññāṇagataṁ, tampi niccaṁ vā aniccaṁ vā\"ti?",
    "sn35.121:46": "\"Aniccaṁ, bhante\".",
    "sn35.121:47": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn35.121:48": "\"Dukkhaṁ, bhante\".",
    "sn35.121:49": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn35.121:50": "\"No hetaṁ, bhante\".",
    "sn35.121:51": "\"Evaṁ passaṁ, rāhula, sutavā ariyasāvako cakkhusmimpi nibbindati, rūpesupi nibbindati, cakkhuviññāṇepi nibbindati, cakkhusamphassepi nibbindati, yampidaṁ cakkhusamphassapaccayā uppajjati vedanāgataṁ saññāgataṁ saṅkhāragataṁ viññāṇagataṁ tasmimpi nibbindati … pe … jivhāyapi nibbindati, rasesupi nibbindati, jivhāviññāṇepi nibbindati, jivhāsamphassepi nibbindati, yampidaṁ jivhāsamphassapaccayā uppajjati vedanāgataṁ saññāgataṁ saṅkhāragataṁ viññāṇagataṁ tasmimpi nibbindati … pe … .",
    "sn35.121:52": "Manasmimpi nibbindati, dhammesupi nibbindati, manoviññāṇepi nibbindati, manosamphassepi nibbindati, yampidaṁ manosamphassapaccayā uppajjati vedanāgataṁ saññāgataṁ saṅkhāragataṁ viññāṇagataṁ tasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati; vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānātī\"ti.",
    "sn35.121:53": "Idamavoca bhagavā. Attamano āyasmā rāhulo bhagavato bhāsitaṁ abhinandi. Imasmiñca pana veyyākaraṇasmiṁ bhaññamāne āyasmato rāhulassa anupādāya āsavehi cittaṁ vimucci. Anekānañca devatāsahassānaṁ virajaṁ vītamalaṁ dhammacakkhuṁ udapādi: \"yaṁ kiñci samudayadhammaṁ sabbaṁ taṁ nirodhadhamman\"ti."
}