{
    "sn35.244:1": "\"Yato kho, bhikkhave, bhikkhu sabbesaṁyeva dukkhadhammānaṁ samudayañca atthaṅgamañca yathābhūtaṁ pajānāti. Tathā kho panassa kāmā diṭṭhā honti, yathāssa kāme passato, yo kāmesu kāmacchando kāmasneho kāmamucchā kāmapariḷāho, so nānuseti. Tathā kho panassa cāro ca vihāro ca anubuddho hoti, yathā carantaṁ vihārantaṁ abhijjhādomanassā pāpakā akusalā dhammā nānusenti.",
    "sn35.244:2": "Kathañca, bhikkhave, sabbesaṁyeva dukkhadhammānaṁ samudayañca atthaṅgamañca yathābhūtaṁ pajānāti? ‘Iti rūpaṁ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā … iti saññā … iti saṅkhārā … iti viññāṇaṁ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti – evaṁ kho, bhikkhave, bhikkhu sabbesaṁyeva dukkhadhammānaṁ samudayañca atthaṅgamañca yathābhūtaṁ pajānāti.",
    "sn35.244:3": "Kathañca, bhikkhave, bhikkhuno kāmā diṭṭhā honti? Yathāssa kāme passato, yo kāmesu kāmacchando kāmasneho kāmamucchā kāmapariḷāho, so nānuseti. Seyyathāpi, bhikkhave, aṅgārakāsu sādhikaporisā puṇṇā aṅgārānaṁ vītaccikānaṁ vītadhūmānaṁ. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukhakāmo dukkhapaṭikūlo. Tamenaṁ dve balavanto purisā nānābāhāsu gahetvā, taṁ aṅgārakāsuṁ upakaḍḍheyyuṁ. So iticīticeva kāyaṁ sannāmeyya. Taṁ kissa hetu? Ñātañhi, bhikkhave, tassa purisassa imañcāhaṁ aṅgārakāsuṁ papatissāmi, tatonidānaṁ maraṇaṁ vā nigacchissāmi maraṇamattaṁ vā dukkhanti. Evameva kho, bhikkhave, bhikkhuno aṅgārakāsūpamā kāmā diṭṭhā honti, yathāssa kāme passato, yo kāmesu kāmacchando kāmasneho kāmamucchā kāmapariḷāho, so nānuseti.",
    "sn35.244:4": "Kathañca, bhikkhave, bhikkhuno cāro ca vihāro ca anubuddho hoti, yathā carantaṁ vihārantaṁ abhijjhādomanassā pāpakā akusalā dhammā nānussavanti? Seyyathāpi, bhikkhave, puriso bahukaṇṭakaṁ dāyaṁ paviseyya. Tassa puratopi kaṇṭako, pacchatopi kaṇṭako, uttaratopi kaṇṭako, dakkhiṇatopi kaṇṭako, heṭṭhatopi kaṇṭako, uparitopi kaṇṭako. So satova abhikkameyya, satova paṭikkameyya: ‘mā maṁ kaṇṭako’ti. Evameva kho, bhikkhave, yaṁ loke piyarūpaṁ sātarūpaṁ, ayaṁ vuccati ariyassa vinaye kaṇṭako\"ti. Iti viditvā saṁvaro ca asaṁvaro ca veditabbo.",
    "sn35.244:5": "Kathañca, bhikkhave, asaṁvaro hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṁ disvā piyarūpe rūpe adhimuccati, appiyarūpe rūpe byāpajjati, anupaṭṭhitakāyassati ca vihārati parittacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ nappajānāti, yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti … pe … jivhāya rasaṁ sāyitvā … pe … manasā dhammaṁ viññāya piyarūpe dhamme adhimuccati, appiyarūpe dhamme byāpajjati, anupaṭṭhitakāyassati ca vihārati parittacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti. Evaṁ kho, bhikkhave, asaṁvaro hoti.",
    "sn35.244:6": "Kathañca, bhikkhave, saṁvaro hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṁ disvā piyarūpe rūpe nādhimuccati, appiyarūpe rūpe na byāpajjati, upaṭṭhitakāyassati ca vihārati appamāṇacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ pajānāti, yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti … pe … jivhāya rasaṁ sāyitvā … pe … manasā dhammaṁ viññāya piyarūpe dhamme nādhimuccati, appiyarūpe dhamme na byāpajjati, upaṭṭhitakāyassati ca vihārati appamāṇacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ pajānāti, yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti. Evaṁ kho, bhikkhave, saṁvaro hoti.",
    "sn35.244:7": "Tassa ce, bhikkhave, bhikkhuno evaṁ carato evaṁ vihārato kadāci karahaci satisammosā uppajjanti, pāpakā akusalā sarasaṅkappā saṁyojaniyā, dandho, bhikkhave, satuppādo. Atha kho naṁ khippameva pajahati vinodeti byantīkaroti anabhāvaṁ gameti.",
    "sn35.244:8": "Seyyathāpi, bhikkhave, puriso divasaṁsantatte ayokaṭāhe dve vā tīṇi vā udakaphusitāni nipāteyya. Dandho, bhikkhave, udakaphusitānaṁ nipāto, atha kho naṁ khippameva parikkhayaṁ pariyādānaṁ gaccheyya. Evameva kho, bhikkhave, tassa ce bhikkhuno evaṁ carato, evaṁ vihārato kadāci karahaci satisammosā uppajjanti pāpakā akusalā sarasaṅkappā saṁyojaniyā, dandho, bhikkhave, satuppādo. Atha kho naṁ khippameva pajahati vinodeti byantīkaroti anabhāvaṁ gameti.",
    "sn35.244:9": "Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā. Atha mahājanakāyo āgaccheyya kuddālapiṭakaṁ ādāya: ‘mayaṁ imaṁ gaṅgaṁ nadiṁ pacchāninnaṁ karissāma pacchāpoṇaṁ pacchāpabbhāran’ti. Taṁ kiṁ maññatha, bhikkhave, api nu kho so mahājanakāyo gaṅgaṁ nadiṁ pacchāninnaṁ kareyya pacchāpoṇaṁ pacchāpabbhāran\"ti?"
}