{
    "sn35.70:1": "Atha kho āyasmā upavāṇo yena bhagavā tenupasaṅkami … pe … ekamantaṁ nisinno kho āyasmā upavāṇo bhagavantaṁ etadavoca: \"‘sandiṭṭhiko dhammo, sandiṭṭhiko dhammo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, sandiṭṭhiko dhammo hoti, akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhī\"ti?",
    "sn35.70:2": "\"Idha pana, upavāṇa, bhikkhu cakkhunā rūpaṁ disvā rūpappaṭisaṁvedī ca hoti rūparāgappaṭisaṁvedī ca. Santañca ajjhattaṁ rūpesu rāgaṁ ‘atthi me ajjhattaṁ rūpesu rāgo’ti pajānāti. Yaṁ taṁ, upavāṇa, bhikkhu cakkhunā rūpaṁ disvā rūpappaṭisaṁvedī ca hoti rūparāgappaṭisaṁvedī ca. Santañca ajjhattaṁ rūpesu rāgaṁ ‘atthi me ajjhattaṁ rūpesu rāgo’ti pajānāti. Evampi kho, upavāṇa, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhi … pe … .",
    "sn35.70:3": "Puna caparaṁ, upavāṇa, bhikkhu jivhāya rasaṁ sāyitvā rasappaṭisaṁvedī ca hoti rasarāgappaṭisaṁvedī ca. Santañca ajjhattaṁ rasesu rāgaṁ ‘atthi me ajjhattaṁ rasesu rāgo’ti pajānāti. Yaṁ taṁ, upavāṇa, bhikkhu jivhāya rasaṁ sāyitvā rasappaṭisaṁvedī ca hoti rasarāgappaṭisaṁvedī ca. Santañca ajjhattaṁ rasesu rāgaṁ ‘atthi me ajjhattaṁ rasesu rāgo’ti pajānāti. Evampi kho, upavāṇa, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhi … pe … .",
    "sn35.70:4": "Puna caparaṁ, upavāṇa, bhikkhu manasā dhammaṁ viññāya dhammappaṭisaṁvedī ca hoti dhammarāgappaṭisaṁvedī ca. Santañca ajjhattaṁ dhammesu rāgaṁ ‘atthi me ajjhattaṁ dhammesu rāgo’ti pajānāti. Yaṁ taṁ, upavāṇa, bhikkhu manasā dhammaṁ viññāya dhammappaṭisaṁvedī ca hoti dhammarāgappaṭisaṁvedī ca. Santañca ajjhattaṁ dhammesu rāgaṁ ‘atthi me ajjhattaṁ dhammesu rāgo’ti pajānāti. Evampi kho, upavāṇa, sandiṭṭhiko dhammo hoti … pe … paccattaṁ veditabbo viññūhi … pe … .",
    "sn35.70:5": "Idha pana, upavāṇa, bhikkhu cakkhunā rūpaṁ disvā rūpappaṭisaṁvedī ca hoti, no ca rūparāgappaṭisaṁvedī. Asantañca ajjhattaṁ rūpesu rāgaṁ ‘Natthi me ajjhattaṁ rūpesu rāgo’ti pajānāti. Yaṁ taṁ, upavāṇa, bhikkhu cakkhunā rūpaṁ disvā rūpappaṭisaṁvedīhi kho hoti, no ca rūparāgappaṭisaṁvedī. Asantañca ajjhattaṁ rūpesu rāgaṁ ‘Natthi me ajjhattaṁ rūpesu rāgo’ti pajānāti. Evampi kho, upavāṇa, sandiṭṭhiko dhammo hoti, akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhi … pe … .",
    "sn35.70:6": "Puna caparaṁ, upavāṇa, bhikkhu jivhāya rasaṁ sāyitvā rasappaṭisaṁvedīhi kho hoti, no ca rasarāgappaṭisaṁvedī. Asantañca ajjhattaṁ rasesu rāgaṁ ‘Natthi me ajjhattaṁ rasesu rāgo’ti pajānāti … pe … .",
    "sn35.70:7": "Puna caparaṁ, upavāṇa, bhikkhu manasā dhammaṁ viññāya dhammappaṭisaṁvedīhi kho hoti, no ca dhammarāgappaṭisaṁvedī. Asantañca ajjhattaṁ dhammesu rāgaṁ ‘Natthi me ajjhattaṁ dhammesu rāgo’ti pajānāti. Yaṁ taṁ, upavāṇa, bhikkhu manasā dhammaṁ viññāya dhammappaṭisaṁvedīhi kho hoti, no ca dhammarāgappaṭisaṁvedī. Asantañca ajjhattaṁ dhammesu rāgaṁ ‘Natthi me ajjhattaṁ dhammesu rāgo’ti pajānāti. Evampi kho, upavāṇa, sandiṭṭhiko dhammo hoti, akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhī\"ti."
}