{
    "sn35.127:1": "Ekaṁ samayaṁ āyasmā piṇḍolabhāradvājo kosambiyaṁ vihārati ghositārāme. Atha kho rājā udeno yenāyasmā piṇḍolabhāradvājo tenupasaṅkami; upasaṅkamitvā āyasmatā piṇḍolabhāradvājena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho rājā udeno āyasmantaṁ piṇḍolabhāradvājaṁ etadavoca:",
    "sn35.127:2": "\"Lolaṁ kho, bho bhāradvāja, cittaṁ. Appekadā mātumattīsupi lobhadhammā uppajjanti, bhaginimattīsupi lobhadhammā uppajjanti, dhītumattīsupi lobhadhammā uppajjanti. Atthi nu kho, bho bhāradvāja, añño ca hetu, añño ca paccayo yenime daharā bhikkhū susū kāḷakesā … pe … addhānañca āpādentī\"ti?",
    "sn35.127:3": "\"Vuttaṁ kho etaṁ, mahārāja, tena bhagavatā jānatā passatā arahatā sammāsambuddhena: ‘etha tumhe, bhikkhave, imameva kāyaṁ uddhaṁ pādatalā adho kesamatthakā tacapariyantaṁ pūraṁ nānappakārassa asucino paccavekkhatha – atthi imasmiṁ kāye kesā lomā nakhā dantā taco maṁsaṁ nhāru aṭṭhi aṭṭhimiñjaṁ vakkaṁ hadayaṁ yakanaṁ kilomakaṁ pihakaṁ papphāsaṁ antaṁ antaguṇaṁ udariyaṁ karīsaṁ pittaṁ semhaṁ pubbo lohitaṁ sedo medo assu vasā kheḷo siṅghāṇikā lasikā muttan’ti. Ayampi kho, mahārāja, hetu, ayaṁ paccayo yenime daharā bhikkhū susū kāḷakesā … pe … addhānañca āpādentī\"ti.",
    "sn35.127:4": "\"Vuttaṁ kho etaṁ, mahārāja, tena bhagavatā jānatā passatā arahatā sammāsambuddhena: ‘etha tumhe, bhikkhave, indriyesu guttadvārā vihāratha. Cakkhunā rūpaṁ disvā mā nimittaggāhino ahuvattha, mānubyañjanaggāhino. Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ vihārantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjatha. Rakkhatha cakkhundriyaṁ; cakkhundriye saṁvaraṁ āpajjatha. Sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … jivhāya rasaṁ sāyitvā … kāyena phoṭṭhabbaṁ phusitvā … manasā dhammaṁ viññāya mā nimittaggāhino ahuvattha, mānubyañjanaggāhino. Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ vihārantaṁ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjatha. Rakkhatha manindriyaṁ; manindriye saṁvaraṁ āpajjathā’ti. Ayampi kho, mahārāja, hetu ayaṁ paccayo yenime daharā bhikkhū susū kāḷakesā bhadrena yobbanena samannāgatā paṭhamena vayasā anikīḷitāvino kāmesu yāvajīvaṁ paripuṇṇaṁ parisuddhaṁ brahmacariyaṁ caranti, addhānañca āpādentī\"ti.",
    "sn35.127:5": "\"Acchariyaṁ, bho bhāradvāja; abbhutaṁ, bho bhāradvāja. Yāva subhāsitañcidaṁ, bho bhāradvāja, tena bhagavatā jānatā passatā arahatā sammāsambuddhena. Esova kho, bho bhāradvāja, hetu, esa paccayo yenime daharā bhikkhū susū kāḷakesā bhadrena yobbanena samannāgatā paṭhamena vayasā anikīḷitāvino kāmesu yāvajīvaṁ paripuṇṇaṁ parisuddhaṁ brahmacariyaṁ caranti, addhānañca āpādentīti. Ahampi kho, bho bhāradvāja, yasmiṁ samaye arakkhiteneva kāyena, arakkhitāya vācāya, arakkhitena cittena, anupaṭṭhitāya satiyā, asaṁvutehi indriyehi antepuraṁ pavisāmi, ativiya maṁ tasmiṁ samaye lobhadhammā parisahanti. Yasmiñca khvāhaṁ, bho bhāradvāja, samaye rakkhiteneva kāyena, rakkhitāya vācāya, rakkhitena cittena, upaṭṭhitāya satiyā, saṁvutehi indriyehi antepuraṁ pavisāmi, na maṁ tathā tasmiṁ samaye lobhadhammā parisahanti."
}