{
    "sn35.113:1": "Ekaṁ samayaṁ bhagavā nātike vihārati giñjakāvasathe. Atha kho bhagavā rahogato paṭisallīno imaṁ dhammapariyāyaṁ abhāsi: \"cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṁ. Tiṇṇaṁ saṅgati phasso. Phassapaccayā vedanā; vedanāpaccayā taṇhā; taṇhāpaccayā upādānaṁ; upādānapaccayā bhavo; bhavapaccayā jāti; jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti. Jivhañca paṭicca rase ca uppajjati … pe … manañca paṭicca dhamme ca uppajjati manoviññāṇaṁ. Tiṇṇaṁ saṅgati phasso. Phassapaccayā vedanā; vedanāpaccayā taṇhā; taṇhāpaccayā upādānaṁ; upādānapaccayā bhavo; bhavapaccayā jāti; jātipaccayā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
    "sn35.113:2": "Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṁ. Tiṇṇaṁ saṅgati phasso. Phassapaccayā vedanā; vedanāpaccayā taṇhā. Tassāyeva taṇhāya asesavirāganirodhā upādānanirodho; upādānanirodhā bhavanirodho; bhavanirodhā jātinirodho; jātinirodhā jarāmaraṇaṁ sokaparidevadukkhadomanassupāyāsā nirujjhanti. Evametassa kevalassa dukkhakkhandhassa nirodho hoti … pe … jivhañca paṭicca rase ca uppajjati … pe … manañca paṭicca dhamme ca uppajjati manoviññāṇaṁ. Tiṇṇaṁ saṅgati phasso. Phassapaccayā vedanā; vedanāpaccayā taṇhā. Tassāyeva taṇhāya asesavirāganirodhā upādānanirodho; upādānanirodhā … pe … evametassa kevalassa dukkhakkhandhassa nirodho hotī\"ti.",
    "sn35.113:3": "Tena kho pana samayena aññataro bhikkhu bhagavato upassuti ṭhito hoti. Addasā kho bhagavā taṁ bhikkhuṁ upassuti ṭhitaṁ. Disvāna taṁ bhikkhuṁ etadavoca: \"assosi no tvaṁ, bhikkhu, imaṁ dhammapariyāyan\"ti? \"Evaṁ, bhante\". \"Uggaṇhāhi tvaṁ, bhikkhu, imaṁ dhammapariyāyaṁ. Pariyāpuṇāhi tvaṁ, bhikkhu, imaṁ dhammapariyāyaṁ. Dhārehi tvaṁ, bhikkhu, imaṁ dhammapariyāyaṁ. Atthasañhitoyaṁ, bhikkhu, dhammapariyāyo ādibrahmacariyako\"ti.",
    "sn35.113:4": "Yogakkhemi upādāya,Dukkhaṁ loko ca seyyo ca;Saṁyojanaṁ upādānaṁ,Dve parijānaṁ upassutīti."
}