{
    "sn35.246:1": "\"Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā cakkhuviññeyyesu rūpesu uppajjeyya chando vā rāgo vā doso vā moho vā paṭighaṁ vāpi cetaso, tato cittaṁ nivāreyya. Sabhayo ceso maggo sappaṭibhayo ca sakaṇṭako ca sagahano ca ummaggo ca kummaggo ca duhitiko ca. Asappurisasevito ceso maggo, na ceso maggo sappurisehi sevito. Na tvaṁ etaṁ arahasīti. Tato cittaṁ nivāraye cakkhuviññeyyehi rūpehi … pe … yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā jivhāviññeyyesu rasesu … pe … manoviññeyyesu dhammesu uppajjeyya chando vā rāgo vā doso vā moho vā paṭighaṁ vāpi cetaso tato cittaṁ nivāreyya. Sabhayo ceso maggo sappaṭibhayo ca sakaṇṭako ca sagahano ca ummaggo ca kummaggo ca duhitiko ca. Asappurisasevito ceso maggo, na ceso maggo sappurisehi sevito. Na tvaṁ etaṁ arahasīti. Tato cittaṁ nivāraye manoviññeyyehi dhammehi.",
    "sn35.246:2": "Seyyathāpi, bhikkhave, kiṭṭhaṁ sampannaṁ. Kiṭṭhārakkho ca pamatto, goṇo ca kiṭṭhādo aduṁ kiṭṭhaṁ otaritvā yāvadatthaṁ madaṁ āpajjeyya pamādaṁ āpajjeyya; evameva kho, bhikkhave, assutavā puthujjano chasu phassāyatanesu asaṁvutakārī pañcasu kāmaguṇesu yāvadatthaṁ madaṁ āpajjati pamādaṁ āpajjati.",
    "sn35.246:3": "Seyyathāpi, bhikkhave, kiṭṭhaṁ sampannaṁ kiṭṭhārakkho ca appamatto goṇo ca kiṭṭhādo aduṁ kiṭṭhaṁ otareyya. Tamenaṁ kiṭṭhārakkho nāsāyaṁ suggahitaṁ gaṇheyya. Nāsāyaṁ suggahitaṁ gahetvā uparighaṭāyaṁ suniggahitaṁ niggaṇheyya. Uparighaṭāyaṁ suniggahitaṁ niggahetvā daṇḍena sutāḷitaṁ tāḷeyya. Daṇḍena sutāḷitaṁ tāḷetvā osajjeyya. Dutiyampi kho, bhikkhave … pe … tatiyampi kho, bhikkhave, goṇo kiṭṭhādo aduṁ kiṭṭhaṁ otareyya. Tamenaṁ kiṭṭhārakkho nāsāyaṁ suggahitaṁ gaṇheyya. Nāsāyaṁ suggahitaṁ gahetvā uparighaṭāyaṁ suniggahitaṁ niggaṇheyya. Uparighaṭāyaṁ suniggahitaṁ niggahetvā daṇḍena sutāḷitaṁ tāḷeyya. Daṇḍena sutāḷitaṁ tāḷetvā osajjeyya. Evañhi so, bhikkhave, goṇo kiṭṭhādo gāmagato vā araññagato vā, ṭhānabahulo vā assa nisajjabahulo vā na taṁ kiṭṭhaṁ puna otareyya – tameva purimaṁ daṇḍasamphassaṁ samanussaranto.",
    "sn35.246:4": "Seyyathāpi, bhikkhave, rañño vā rājamahāmattassa vā vīṇāya saddo assutapubbo assa. So vīṇāsaddaṁ suṇeyya. So evaṁ vadeyya: ‘ambho, kassa nu kho eso saddo evaṁrajanīyo evaṅkamanīyo evaṁmadanīyo evaṁmucchanīyo evambandhanīyo’ti? Tamenaṁ evaṁ vadeyyuṁ: ‘esā, kho, bhante, vīṇā nāma, yassā eso saddo evaṁrajanīyo evaṅkamanīyo evaṁmadanīyo evaṁmucchanīyo evambandhanīyo’ti. So evaṁ vadeyya: ‘gacchatha me, bho, taṁ vīṇaṁ āharathā’ti."
}