{
    "sn35.130:1": "Ekaṁ samayaṁ āyasmā mahākaccāno avantīsu vihārati kuraraghare papāte pabbate. Atha kho hāliddikāni gahapati yenāyasmā mahākaccāno tenupasaṅkami … pe … ekamantaṁ nisinno kho hāliddikāni gahapati āyasmantaṁ mahākaccānaṁ etadavoca:\"Vuttamidaṁ, bhante, bhagavatā: ‘dhātunānattaṁ paṭicca uppajjati phassanānattaṁ; phassanānattaṁ paṭicca uppajjati vedanānānattan’ti. Kathaṁ nu kho, bhante, dhātunānattaṁ paṭicca uppajjati phassanānattaṁ; phassanānattaṁ paṭicca uppajjati vedanānānattan\"ti?\"Idha, gahapati, bhikkhu cakkhunā rūpaṁ disvā ‘manāpaṁ itthetan’ti pajānāti cakkhuviññāṇaṁ sukhavedaniyañca. Phassaṁ paṭicca uppajjati sukhā vedanā. Cakkhunā kho paneva rūpaṁ disvā ‘amanāpaṁ itthetan’ti pajānāti cakkhuviññāṇaṁ dukkhavedaniyañca. Phassaṁ paṭicca uppajjati dukkhā vedanā. Cakkhunā kho paneva rūpaṁ disvā ‘upekkhāṭṭhāniyaṁ itthetan’ti pajānāti cakkhuviññāṇaṁ adukkhamasukhavedaniyañca. Phassaṁ paṭicca uppajjati adukkhamasukhā vedanā.2Puna caparaṁ, gahapati, bhikkhu sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … pe … jivhāya rasaṁ sāyitvā … pe … kāyena phoṭṭhabbaṁ phusitvā … pe … manasā dhammaṁ viññāya ‘manāpaṁ itthetan’ti pajānāti manoviññāṇaṁ sukhavedaniyañca. Phassaṁ paṭicca uppajjati sukhā vedanā. Manasā kho paneva dhammaṁ viññāya ‘amanāpaṁ itthetan’ti pajānāti manoviññāṇaṁ dukkhavedaniyañca. Phassaṁ paṭicca uppajjati dukkhā vedanā. Manasā kho paneva dhammaṁ viññāya ‘upekkhāṭṭhāniyaṁ itthetan’ti pajānāti manoviññāṇaṁ adukkhamasukhavedaniyañca. Phassaṁ paṭicca uppajjati adukkhamasukhā vedanā.Evaṁ kho, gahapati, dhātunānattaṁ paṭicca uppajjati phassanānattaṁ; phassanānattaṁ paṭicca uppajjati vedanānānattan\"ti.Sattamaṁ.",
    "sn35.130:2": "Puna caparaṁ, gahapati, bhikkhu sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … pe … jivhāya rasaṁ sāyitvā … pe … kāyena phoṭṭhabbaṁ phusitvā … pe … manasā dhammaṁ viññāya ‘manāpaṁ itthetan’ti pajānāti manoviññāṇaṁ sukhavedaniyañca. Phassaṁ paṭicca uppajjati sukhā vedanā. Manasā kho paneva dhammaṁ viññāya ‘amanāpaṁ itthetan’ti pajānāti manoviññāṇaṁ dukkhavedaniyañca. Phassaṁ paṭicca uppajjati dukkhā vedanā. Manasā kho paneva dhammaṁ viññāya ‘upekkhāṭṭhāniyaṁ itthetan’ti pajānāti manoviññāṇaṁ adukkhamasukhavedaniyañca. Phassaṁ paṭicca uppajjati adukkhamasukhā vedanā.Evaṁ kho, gahapati, dhātunānattaṁ paṭicca uppajjati phassanānattaṁ; phassanānattaṁ paṭicca uppajjati vedanānānattan\"ti.Sattamaṁ."
}