{
    "sn35.117:1": "\"Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi: ‘yeme pañca kāmaguṇā cetaso samphuṭṭhapubbā atītā niruddhā vipariṇatā, tatra me cittaṁ bahulaṁ gacchamānaṁ gaccheyya paccuppannesu vā appaṁ vā anāgatesu’. Tassa mayhaṁ, bhikkhave, etadahosi: ‘yeme pañca kāmaguṇā cetaso samphuṭṭhapubbā atītā niruddhā vipariṇatā, tatra me attarūpena appamādo sati cetaso ārakkho karaṇīyo’.",
    "sn35.117:2": "Atha kho tesaṁ bhikkhūnaṁ acirapakkantassa bhagavato etadahosi: \"Idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘tasmātiha, bhikkhave, se āyatane veditabbe yattha cakkhu ca nirujjhati, rūpasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha jivhā ca nirujjhati, rasasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha mano ca nirujjhati, dhammasaññā ca nirujjhati, se āyatane veditabbe’ti. Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā\"ti?",
    "sn35.117:3": "Atha kho tesaṁ bhikkhūnaṁ etadahosi: \"Ayaṁ kho āyasmā ānando satthu ceva saṁvaṇṇito, sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā ānando imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā ānando tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ Ānandaṁ etamatthaṁ paṭipuccheyyāmā\"ti.",
    "sn35.117:4": "Atha kho te bhikkhū yenāyasmā ānando tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā ānandena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū āyasmantaṁ Ānandaṁ etadavocuṁ:",
    "sn35.117:5": "\"Idaṁ kho no, āvuso Ānanda, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘tasmātiha, bhikkhave, se āyatane veditabbe yattha cakkhu ca nirujjhati, rūpasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha jivhā ca nirujjhati, rasasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha mano ca nirujjhati, dhammasaññā ca nirujjhati, se āyatane veditabbe’ti. Tesaṁ no, āvuso, amhākaṁ acirapakkantassa bhagavato etadahosi: ‘idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: \"tasmātiha, bhikkhave, se āyatane veditabbe yattha cakkhu ca nirujjhati, rūpasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha jivhā ca nirujjhati, rasasaññā ca nirujjhati se āyatane veditabbe … pe … yattha mano ca nirujjhati, dhammasaññā ca nirujjhati, se āyatane veditabbe\"ti. Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā’ti? Tesaṁ no, āvuso, amhākaṁ etadahosi: ‘Ayaṁ kho āyasmā ānando satthu ceva saṁvaṇṇito, sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā ānando imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā ānando tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ Ānandaṁ etamatthaṁ paṭipuccheyyāmā’ti. Vibhajatāyasmā ānando\"ti.",
    "sn35.117:6": "\"Seyyathāpi, āvuso, puriso sāratthiko sāragavesī sārapariyesanaṁ caramāno mahato rukkhassa … pe … vibhajatāyasmā ānando agaruṁ karitvā\"ti.",
    "sn35.117:7": "\"Tenahāvuso, suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti. \"Evamāvuso\"ti kho te bhikkhū āyasmato ānandassa paccassosuṁ. Āyasmā ānando etadavoca:",
    "sn35.117:8": "\"Yaṁ kho vo, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘tasmātiha, bhikkhave, se āyatane veditabbe yattha cakkhu ca nirujjhati, rūpasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha mano ca nirujjhati, dhammasaññā ca nirujjhati, se āyatane veditabbe’ti. Imassa khvāhaṁ, āvuso, bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ ājānāmi. Saḷāyatananirodhaṁ no etaṁ, āvuso, bhagavatā sandhāya bhāsitaṁ: ‘tasmātiha, bhikkhave, se āyatane veditabbe, yattha cakkhu ca nirujjhati, rūpasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha mano ca nirujjhati, dhammasaññā ca nirujjhati, se āyatane veditabbe’ti.",
    "sn35.117:9": "\"Evamāvuso\"ti kho te bhikkhū āyasmato ānandassa paṭissutvā uṭṭhāyāsanā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te bhikkhū bhagavantaṁ etadavocuṁ:",
    "sn35.117:10": "\"Yaṁ kho no, bhante, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: ‘tasmātiha, bhikkhave, se āyatane veditabbe yattha cakkhu ca nirujjhati, rūpasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha jivhā ca nirujjhati, rasasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha mano ca nirujjhati, dhammasaññā ca nirujjhati, se āyatane veditabbe’ti, tesaṁ no, bhante, amhākaṁ acirapakkantassa bhagavato etadahosi: ‘idaṁ kho no, āvuso, bhagavā saṅkhittena uddesaṁ uddisitvā vitthārena atthaṁ avibhajitvā uṭṭhāyāsanā vihāraṁ paviṭṭho: \"tasmātiha, bhikkhave, se āyatane veditabbe yattha cakkhu ca nirujjhati, rūpasaññā ca nirujjhati, se āyatane veditabbe … pe … yattha mano ca nirujjhati, dhammasaññā ca nirujjhati, se āyatane veditabbe\"ti. Ko nu kho imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajeyyā’ti? Tesaṁ no, bhante, amhākaṁ etadahosi: ‘Ayaṁ kho āyasmā ānando satthu ceva saṁvaṇṇito, sambhāvito ca viññūnaṁ sabrahmacārīnaṁ. Pahoti cāyasmā ānando imassa bhagavatā saṅkhittena uddesassa uddiṭṭhassa vitthārena atthaṁ avibhattassa vitthārena atthaṁ vibhajituṁ. Yannūna mayaṁ yenāyasmā ānando tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṁ Ānandaṁ etamatthaṁ paṭipuccheyyāmā’ti. Atha kho mayaṁ, bhante, yenāyasmā ānando tenupasaṅkamimha; upasaṅkamitvā āyasmantaṁ Ānandaṁ etamatthaṁ paṭipucchimha. Tesaṁ no, bhante, āyasmatā ānandena imehi ākārehi, imehi padehi, imehi byañjanehi attho vibhatto\"ti.",
    "sn35.117:11": "\"Paṇḍito, bhikkhave, ānando; mahāpañño, bhikkhave, ānando. Mañcepi tumhe, bhikkhave, etamatthaṁ paṭipuccheyyātha, ahampi taṁ evamevaṁ byākareyyaṁ yathā taṁ ānandena byākataṁ. Eso cevetassa attho. Evañca naṁ dhāreyyāthā\"ti."
}