{
    "sn35.247:1": "\"Seyyathāpi, bhikkhave, puriso arugatto pakkagatto saravanaṁ paviseyya. Tassa kusakaṇṭakā ceva pāde vijjheyyuṁ, sarapattāni ca gattāni vilekheyyuṁ. Evañhi so, bhikkhave, puriso bhiyyoso mattāya tatonidānaṁ dukkhaṁ domanassaṁ paṭisaṁvediyetha. Evameva kho, bhikkhave, idhekacco bhikkhu gāmagato vā araññagato vā labhati vattāraṁ: ‘ayañca so āyasmā evaṅkārī evaṁsamācāro asucigāmakaṇṭako’ti. Taṁ kaṇṭakoti iti viditvā saṁvaro ca asaṁvaro ca veditabbo.",
    "sn35.247:2": "Kathañca, bhikkhave, asaṁvaro hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṁ disvā piyarūpe rūpe adhimuccati, appiyarūpe rūpe byāpajjati, anupaṭṭhitakāyassati ca vihārati parittacetaso. Tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ nappajānāti, yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti. Sotena saddaṁ sutvā … ghānena gandhaṁ ghāyitvā … jivhāya rasaṁ sāyitvā … kāyena phoṭṭhabbaṁ phusitvā … manasā dhammaṁ viññāya piyarūpe dhamme adhimuccati, appiyarūpe dhamme byāpajjati, anupaṭṭhitakāyassati ca vihārati parittacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ nappajānāti, yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti.",
    "sn35.247:3": "Seyyathāpi, bhikkhave, puriso chappāṇake gahetvā nānāvisaye nānāgocare daḷhāya rajjuyā bandheyya. Ahiṁ gahetvā daḷhāya rajjuyā bandheyya. Susumāraṁ gahetvā daḷhāya rajjuyā bandheyya. Pakkhiṁ gahetvā daḷhāya rajjuyā bandheyya. Kukkuraṁ gahetvā daḷhāya rajjuyā bandheyya. Siṅgālaṁ gahetvā daḷhāya rajjuyā bandheyya. Makkaṭaṁ gahetvā daḷhāya rajjuyā bandheyya. Daḷhāya rajjuyā bandhitvā majjhe gaṇṭhiṁ karitvā ossajjeyya.",
    "sn35.247:4": "Kathañca, bhikkhave, saṁvaro hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṁ disvā piyarūpe rūpe nādhimuccati, appiyarūpe rūpe na byāpajjati, upaṭṭhitakāyassati ca vihārati appamāṇacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ pajānāti, yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti … pe … jivhāya rasaṁ sāyitvā … pe … manasā dhammaṁ viññāya piyarūpe dhamme nādhimuccati, appiyarūpe dhamme na byāpajjati, upaṭṭhitakāyassati ca vihārati appamāṇacetaso, tañca cetovimuttiṁ paññāvimuttiṁ yathābhūtaṁ pajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti.",
    "sn35.247:5": "Seyyathāpi, bhikkhave, puriso chappāṇake gahetvā nānāvisaye nānāgocare daḷhāya rajjuyā bandheyya. Ahiṁ gahetvā daḷhāya rajjuyā bandheyya. Susumāraṁ gahetvā daḷhāya rajjuyā bandheyya. Pakkhiṁ gahetvā … pe … kukkuraṁ gahetvā … siṅgālaṁ gahetvā … makkaṭaṁ gahetvā daḷhāya rajjuyā bandheyya.",
    "sn35.247:6": "‘Daḷhe khīle vā thambhe vā’ti kho, bhikkhave, kāyagatāya satiyā etaṁ adhivacanaṁ. Tasmātiha vo, bhikkhave, evaṁ sikkhitabbaṁ: ‘kāyagatā no sati bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi kho, bhikkhave, sikkhitabban\"ti."
}