{
    "sn35.245:1": "Atha kho aññataro bhikkhu yenaññataro bhikkhu tenupasaṅkami; upasaṅkamitvā taṁ bhikkhuṁ etadavoca: \"kittāvatā nu kho, āvuso, bhikkhuno dassanaṁ suvisuddhaṁ hotī\"ti?",
    "sn35.245:2": "Atha kho so bhikkhu asantuṭṭho tassa bhikkhussa pañhaveyyākaraṇena, yenaññataro bhikkhu tenupasaṅkami; upasaṅkamitvā taṁ bhikkhuṁ etadavoca: \"kittāvatā nu kho, āvuso, bhikkhuno dassanaṁ suvisuddhaṁ hotī\"ti?",
    "sn35.245:3": "Atha kho so bhikkhu asantuṭṭho tassa bhikkhussa pañhaveyyākaraṇena, yenaññataro bhikkhu tenupasaṅkami; upasaṅkamitvā taṁ bhikkhuṁ etadavoca: \"kittāvatā nu kho, āvuso, bhikkhuno dassanaṁ suvisuddhaṁ hotī\"ti?",
    "sn35.245:4": "Atha kho so bhikkhu asantuṭṭho tassa bhikkhussa pañhaveyyākaraṇena, yenaññataro bhikkhu tenupasaṅkami; upasaṅkamitvā taṁ bhikkhuṁ etadavoca: \"kittāvatā nu kho, āvuso, bhikkhuno dassanaṁ suvisuddhaṁ hotī\"ti?",
    "sn35.245:5": "Atha kho so bhikkhu asantuṭṭho tassa bhikkhussa pañhaveyyākaraṇena, yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ etadavoca: \"Idhāhaṁ, bhante, yenaññataro bhikkhu tenupasaṅkamiṁ; upasaṅkamitvā taṁ bhikkhuṁ etadavocaṁ: ‘kittāvatā nu kho, āvuso, bhikkhuno dassanaṁ suvisuddhaṁ hotī’ti? Evaṁ vutte, bhante, so bhikkhu maṁ etadavoca: ‘yato kho, āvuso, bhikkhu channaṁ phassāyatanānaṁ samudayañca atthaṅgamañca yathābhūtaṁ pajānāti, ettāvatā kho, āvuso, bhikkhuno dassanaṁ suvisuddhaṁ hotī’ti. Atha khvāhaṁ, bhante, asantuṭṭho tassa bhikkhussa pañhaveyyākaraṇena, yenaññataro bhikkhu tenupasaṅkamiṁ; upasaṅkamitvā taṁ bhikkhuṁ etadavocaṁ: ‘kittāvatā nu kho, āvuso, bhikkhuno dassanaṁ suvisuddhaṁ hotī’ti? Evaṁ vutte, bhante, so bhikkhu maṁ etadavoca: ‘yato kho, āvuso, bhikkhu pañcannaṁ upādānakkhandhānaṁ … pe … catunnaṁ mahābhūtānaṁ samudayañca atthaṅgamañca yathābhūtaṁ pajānāti … pe … yaṁ kiñci samudayadhammaṁ sabbaṁ taṁ nirodhadhammanti yathābhūtaṁ pajānāti, ettāvatā kho, āvuso, bhikkhuno dassanaṁ suvisuddhaṁ hotī’ti. Atha khvāhaṁ, bhante, asantuṭṭho tassa bhikkhussa pañhaveyyākaraṇena yena bhagavā tenupasaṅkamiṁ. Kittāvatā nu kho, bhante, bhikkhuno dassanaṁ suvisuddhaṁ hotī\"ti?",
    "sn35.245:6": "\"Seyyathāpi, bhikkhu, purisassa kiṁsuko adiṭṭhapubbo assa. So yenaññataro puriso kiṁsukassa dassāvī tenupasaṅkameyya. Upasaṅkamitvā taṁ purisaṁ evaṁ vadeyya: ‘kīdiso, bho purisa, kiṁsuko’ti? So evaṁ vadeyya: ‘kāḷako kho, ambho purisa, kiṁsuko – seyyathāpi jhāmakhāṇū’ti. Tena kho pana, bhikkhu, samayena tādisovassa kiṁsuko yathāpi tassa purisassa dassanaṁ.",
    "sn35.245:7": "Atha kho so, bhikkhu, puriso asantuṭṭho tassa purisassa pañhaveyyākaraṇena, yenaññataro puriso kiṁsukassa dassāvī tenupasaṅkameyya; upasaṅkamitvā taṁ purisaṁ evaṁ vadeyya: ‘kīdiso, bho purisa, kiṁsuko’ti? So evaṁ vadeyya: ‘lohitako kho, ambho purisa, kiṁsuko – seyyathāpi maṁsapesī’ti. Tena kho pana, bhikkhu, samayena tādisovassa kiṁsuko yathāpi tassa purisassa dassanaṁ.",
    "sn35.245:8": "Seyyathāpi, bhikkhu, rañño paccantimaṁ nagaraṁ daḷhuddhāpaṁ daḷhapākāratoraṇaṁ chadvāraṁ. Tatrassa dovāriko paṇḍito byatto medhāvī, aññātānaṁ nivāretā, ñātānaṁ pavesetā. Puratthimāya disāya āgantvā sīghaṁ dūtayugaṁ taṁ dovārikaṁ evaṁ vadeyya: ‘kahaṁ, bho purisa, imassa nagarassa nagarassāmī’ti? So evaṁ vadeyya: ‘eso, bhante, majjhe siṅghāṭake nisinno’ti. Atha kho taṁ sīghaṁ dūtayugaṁ nagarassāmikassa yathābhūtaṁ vacanaṁ niyyātetvā yathāgatamaggaṁ paṭipajjeyya. Pacchimāya disāya āgantvā sīghaṁ dūtayugaṁ … pe … uttarāya disāya … dakkhiṇāya disāya āgantvā sīghaṁ dūtayugaṁ taṁ dovārikaṁ evaṁ vadeyya: ‘kahaṁ, bho purisa, imassa nagarassāmī’ti? So evaṁ vadeyya: ‘eso, bhante, majjhe siṅghāṭake nisinno’ti. Atha kho taṁ sīghaṁ dūtayugaṁ nagarassāmikassa yathābhūtaṁ vacanaṁ niyyātetvā yathāgatamaggaṁ paṭipajjeyya.",
    "sn35.245:9": "Upamā kho myāyaṁ, bhikkhu, katā atthassa viññāpanāya. Ayañcettha attho: ‘nagaran’ti kho, bhikkhu, imassetaṁ cātumahābhūtikassa kāyassa adhivacanaṁ mātāpettikasambhavassa odanakummāsūpacayassa aniccucchādanaparimaddanabhedanaviddhaṁsanadhammassa. ‘Cha dvārā’ti kho, bhikkhu, channetaṁ ajjhattikānaṁ āyatanānaṁ adhivacanaṁ. ‘Dovāriko’ti kho, bhikkhu, satiyā etaṁ adhivacanaṁ. ‘Sīghaṁ dūtayugan’ti kho, bhikkhu, samathavipassanānetaṁ adhivacanaṁ. ‘Nagarassāmī’ti kho, bhikkhu, viññāṇassetaṁ adhivacanaṁ. ‘Majjhe siṅghāṭako’ti kho, bhikkhu, catunnetaṁ mahābhūtānaṁ adhivacanaṁ – pathavīdhātuyā, āpodhātuyā, tejodhātuyā, vāyodhātuyā. ‘Yathābhūtaṁ vacanan’ti kho, bhikkhu, nibbānassetaṁ adhivacanaṁ. ‘Yathāgatamaggo’ti kho, bhikkhu, ariyassetaṁ aṭṭhaṅgikassa maggassa adhivacanaṁ, seyyathidaṁ – sammādiṭṭhiyā … pe … sammāsamādhissā\"ti."
}