{
    "sn35.132:1": "Ekaṁ samayaṁ āyasmā mahākaccāno avantīsu vihārati makkarakate araññakuṭikāyaṁ. Atha kho lohiccassa brāhmaṇassa sambahulā antevāsikā kaṭṭhahārakā māṇavakā yenāyasmato mahākaccānassa araññakuṭikā tenupasaṅkamiṁsu; upasaṅkamitvā parito parito kuṭikāya anucaṅkamanti anuvicaranti uccāsaddā mahāsaddā kānici kānici seleyyakāni karonti: \"ime pana muṇḍakā samaṇakā ibbhā kaṇhā bandhupādāpaccā, imesaṁ bharatakānaṁ sakkatā garukatā mānitā pūjitā apacitā\"ti.",
    "sn35.132:2": "\"Sīluttamā pubbatarā ahesuṁ,Te brāhmaṇā ye purāṇaṁ saranti;Guttāni dvārāni surakkhitāni,Ahesuṁ tesaṁ abhibhuyya kodhaṁ.",
    "sn35.132:3": "Dhamme ca jhāne ca ratā ahesuṁ,Te brāhmaṇā ye purāṇaṁ saranti.",
    "sn35.132:4": "Ime ca vokkamma japāmaseti,Gottena mattā visamaṁ caranti;Kodhābhibhūtā puthuattadaṇḍā,Virajjamānā sataṇhātaṇhesu.",
    "sn35.132:5": "Aguttadvārassa bhavanti moghā,Supineva laddhaṁ purisassa vittaṁ;Anāsakā thaṇḍilasāyikā ca,Pāto sinānañca tayo ca vedā.",
    "sn35.132:6": "Kharājinaṁ jaṭāpaṅko,mantā sīlabbataṁ tapo;Kuhanā vaṅkadaṇḍā ca,udakācamanāni ca;Vaṇṇā ete brāhmaṇānaṁ,katā kiñcikkhabhāvanā.",
    "sn35.132:7": "Cittañca susamāhitaṁ,vippasannamanāvilaṁ;Akhilaṁ sabbabhūtesu,so maggo brahmapattiyā\"ti.",
    "sn35.132:8": "Atha kho te māṇavakā kupitā anattamanā yena lohicco brāhmaṇo tenupasaṅkamiṁsu; upasaṅkamitvā lohiccaṁ brāhmaṇaṁ etadavocuṁ: \"yagghe bhavaṁ jāneyya, samaṇo mahākaccāno brāhmaṇānaṁ mante ekaṁsena apavadati, paṭikkosatī\"ti?",
    "sn35.132:9": "Atha kho lohicco brāhmaṇo tehi māṇavakehi saddhiṁ yenāyasmā mahākaccāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahākaccānena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho lohicco brāhmaṇo āyasmantaṁ mahākaccānaṁ etadavoca: \"āgamaṁsu nu khvidha, bho kaccāna, amhākaṁ sambahulā antevāsikā kaṭṭhahārakā māṇavakā\"ti?",
    "sn35.132:10": "‘Sīluttamā pubbatarā ahesuṁ,Te brāhmaṇā ye purāṇaṁ saranti;… pe …Akhilaṁ sabbabhūtesu,So maggo brahmapattiyā’ti.",
    "sn35.132:11": "Evaṁ kho me, brāhmaṇa, tehi māṇavakehi saddhiṁ ahosi kathāsallāpo\"ti.",
    "sn35.132:12": "\"‘Aguttadvāro’ti bhavaṁ kaccāno āha. Kittāvatā nu kho, bho kaccāna, aguttadvāro hotī\"ti?",
    "sn35.132:13": "‘Guttadvāro’ti bhavaṁ kaccāno āha. Kittāvatā nu kho, bho kaccāna, guttadvāro hotī\"ti?",
    "sn35.132:14": "\"Acchariyaṁ, bho kaccāna, abbhutaṁ, bho kaccāna. Yāvañcidaṁ bhotā kaccānena guttadvārova samāno guttadvāroti akkhāto. Abhikkantaṁ, bho kaccāna; abhikkantaṁ, bho kaccāna. Seyyathāpi, bho kaccāna, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā kaccānena anekapariyāyena dhammo pakāsito. Esāhaṁ, bho kaccāna, taṁ bhagavantaṁ saraṇaṁ gacchāmi, dhammañca, bhikkhusaṅghañca. Upāsakaṁ maṁ bhavaṁ kaccāno dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gataṁ."
}