{
    "sn35.232:1": "Ekaṁ samayaṁ āyasmā ca sāriputto āyasmā ca mahākoṭṭhiko bārāṇasiyaṁ vihāranti isipatane migadāye. Atha kho āyasmā mahākoṭṭhiko sāyanhasamayaṁ paṭisallānā vuṭṭhito yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā mahākoṭṭhiko āyasmantaṁ sāriputtaṁ etadavoca:",
    "sn35.232:2": "\"Kiṁ nu kho, āvuso sāriputta, cakkhu rūpānaṁ saṁyojanaṁ, rūpā cakkhussa saṁyojanaṁ … pe … jivhā rasānaṁ saṁyojanaṁ, rasā jivhāya saṁyojanaṁ … pe … mano dhammānaṁ saṁyojanaṁ, dhammā manassa saṁyojanan\"ti?",
    "sn35.232:3": "\"Na kho, āvuso koṭṭhika, cakkhu rūpānaṁ saṁyojanaṁ, na rūpā cakkhussa saṁyojanaṁ. Yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo taṁ tattha saṁyojanaṁ … pe … na jivhā rasānaṁ saṁyojanaṁ, na rasā jivhāya saṁyojanaṁ. Yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo taṁ tattha saṁyojanaṁ … pe … na mano dhammānaṁ saṁyojanaṁ, na dhammā manassa saṁyojanaṁ. Yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo taṁ tattha saṁyojanaṁ.",
    "sn35.232:4": "Seyyathāpi, āvuso, kāḷo ca balībaddo odāto ca balībaddo ekena dāmena vā yottena vā saṁyuttā assu. Yo nu kho evaṁ vadeyya: ‘kāḷo balībaddo odātassa balībaddassa saṁyojanaṁ, odāto balībaddo kāḷassa balībaddassa saṁyojanan’ti, sammā nu kho so vadamāno vadeyyā\"ti? \"No hetaṁ, āvuso\".",
    "sn35.232:5": "Evameva kho, āvuso, na cakkhu rūpānaṁ saṁyojanaṁ, na rūpā cakkhussa saṁyojanaṁ. Yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo taṁ tattha saṁyojanaṁ … pe … na jivhā rasānaṁ saṁyojanaṁ … pe … na mano dhammānaṁ saṁyojanaṁ, na dhammā manassa saṁyojanaṁ. Yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo, taṁ tattha saṁyojanaṁ.",
    "sn35.232:6": "Cakkhu vā, āvuso, rūpānaṁ saṁyojanaṁ abhavissa, rūpā vā cakkhussa saṁyojanaṁ, nayidaṁ brahmacariyavāso paññāyetha sammā dukkhakkhayāya. Yasmā ca kho, āvuso, na cakkhu rūpānaṁ saṁyojanaṁ, na rūpā cakkhussa saṁyojanaṁ; yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo, taṁ tattha saṁyojanaṁ, tasmā brahmacariyavāso paññāyati sammā dukkhakkhayāya … pe … .",
    "sn35.232:7": "Jivhā, āvuso, rasānaṁ saṁyojanaṁ abhavissa, rasā vā jivhāya saṁyojanaṁ, nayidaṁ brahmacariyavāso paññāyetha sammā dukkhakkhayāya. Yasmā ca kho, āvuso, na jivhā rasānaṁ saṁyojanaṁ, na rasā jivhāya saṁyojanaṁ; yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo, taṁ tattha saṁyojanaṁ, tasmā brahmacariyavāso paññāyati sammā dukkhakkhayāya … pe … .",
    "sn35.232:8": "Mano vā, āvuso, dhammānaṁ saṁyojanaṁ abhavissa, dhammā vā manassa saṁyojanaṁ, nayidaṁ brahmacariyavāso paññāyetha sammā dukkhakkhayāya. Yasmā ca kho, āvuso, na mano dhammānaṁ saṁyojanaṁ, na dhammā manassa saṁyojanaṁ; yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo, taṁ tattha saṁyojanaṁ, tasmā brahmacariyavāso paññāyati sammā dukkhakkhayāya.",
    "sn35.232:9": "Imināpetaṁ, āvuso, pariyāyena veditabbaṁ yathā na cakkhu rūpānaṁ saṁyojanaṁ, na rūpā cakkhussa saṁyojanaṁ. Yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo, taṁ tattha saṁyojanaṁ … pe … na jivhā rasānaṁ saṁyojanaṁ … pe … na mano dhammānaṁ saṁyojanaṁ, na dhammā manassa saṁyojanaṁ. Yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo, taṁ tattha saṁyojanaṁ.",
    "sn35.232:10": "Saṁvijjati kho, āvuso, bhagavato cakkhu. Passati bhagavā cakkhunā rūpaṁ. Chandarāgo bhagavato natthi. Suvimuttacitto bhagavā. Saṁvijjati kho, āvuso, bhagavato sotaṁ. Suṇāti bhagavā sotena saddaṁ. Chandarāgo bhagavato natthi. Suvimuttacitto bhagavā. Saṁvijjati kho, āvuso, bhagavato ghānaṁ. Ghāyati bhagavā ghānena gandhaṁ. Chandarāgo bhagavato natthi. Suvimuttacitto bhagavā. Saṁvijjati kho, āvuso, bhagavato jivhā. Sāyati bhagavā jivhāya rasaṁ. Chandarāgo bhagavato natthi. Suvimuttacitto bhagavā. Saṁvijjati kho, āvuso, bhagavato kāyo. Phusati bhagavā kāyena phoṭṭhabbaṁ. Chandarāgo bhagavato natthi. Suvimuttacitto bhagavā. Saṁvijjati kho, āvuso, bhagavato mano. Vijānāti bhagavā manasā dhammaṁ. Chandarāgo bhagavato natthi. Suvimuttacitto bhagavā.",
    "sn35.232:11": "Iminā kho etaṁ, āvuso, pariyāyena veditabbaṁ yathā na cakkhu rūpānaṁ saṁyojanaṁ, na rūpā cakkhussa saṁyojanaṁ; yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo, taṁ tattha saṁyojanaṁ. Na sotaṁ … na ghānaṁ … na jivhā rasānaṁ saṁyojanaṁ, na rasā jivhāya saṁyojanaṁ; yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo taṁ tattha saṁyojanaṁ. Na kāyo … na mano dhammānaṁ saṁyojanaṁ, na dhammā manassa saṁyojanaṁ; yañca tattha tadubhayaṁ paṭicca uppajjati chandarāgo, taṁ tattha saṁyojanan\"ti."
}