{
    "sn35.87:1": "Ekaṁ samayaṁ bhagavā rājagahe vihārati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā ca sāriputto āyasmā ca mahācundo āyasmā ca channo gijjhakūṭe pabbate vihāranti. Tena kho pana samayena yena āyasmā channo ābādhiko hoti dukkhito bāḷhagilāno. Atha kho āyasmā sāriputto sāyanhasamayaṁ paṭisallānā vuṭṭhito yenāyasmā mahācundo tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahācundaṁ etadavoca: \"āyāmāvuso cunda, yenāyasmā channo tenupasaṅkamissāma gilānapucchakā\"ti.",
    "sn35.87:2": "Atha kho āyasmā ca sāriputto āyasmā ca mahācundo yenāyasmā channo tenupasaṅkamiṁsu; upasaṅkamitvā paññatte āsane nisīdiṁsu. Nisajja kho āyasmā sāriputto āyasmantaṁ channaṁ etadavoca: \"Kacci te, āvuso channa, khamanīyaṁ, kacci yāpanīyaṁ, kacci dukkhā vedanā paṭikkamanti no abhikkamanti, paṭikkamosānaṁ paññāyati no abhikkamo\"ti?",
    "sn35.87:3": "\"Na me, āvuso sāriputta, khamanīyaṁ na yāpanīyaṁ, bāḷhā me dukkhā vedanā abhikkamanti no paṭikkamanti, abhikkamosānaṁ paññāyati no paṭikkamo. Seyyathāpi, āvuso, balavā puriso tiṇhena sikharena muddhani abhimattheyya; evameva kho, āvuso, adhimattā vātā muddhani ūhananti. Na me, āvuso, khamanīyaṁ, na yāpanīyaṁ … pe … no paṭikkamo. Seyyathāpi, āvuso, balavā puriso daḷhena varattakkhaṇḍena sīse sīsaveṭhaṁ dadeyya; evameva kho, āvuso, adhimattā sīse sīsavedanā. Na me, āvuso, khamanīyaṁ, na yāpanīyaṁ … pe … no paṭikkamo. Seyyathāpi, āvuso, dakkho goghātako vā goghātakantevāsī vā tiṇhena govikantanena kucchiṁ parikanteyya; evameva kho adhimattā vātā kucchiṁ parikantanti. Na me, āvuso, khamanīyaṁ, na yāpanīyaṁ … pe … no paṭikkamo. Seyyathāpi, āvuso, dve balavanto purisā dubbalataraṁ purisaṁ nānābāhāsu gahetvā aṅgārakāsuyā santāpeyyuṁ samparitāpeyyuṁ; evameva kho, āvuso, adhimatto kāyasmiṁ ḍāho. Na me, āvuso, khamanīyaṁ, na yāpanīyaṁ, bāḷhā me dukkhā vedanā abhikkamanti no paṭikkamanti, abhikkamosānaṁ paññāyati no paṭikkamo. Satthaṁ, āvuso sāriputta, āharissāmi, nāvakaṅkhāmi jīvitan\"ti.",
    "sn35.87:4": "\"Mā āyasmā channo satthaṁ āharesi. Yāpetāyasmā channo, yāpentaṁ mayaṁ āyasmantaṁ channaṁ icchāma. Sace āyasmato channassa natthi sappāyāni bhojanāni, ahaṁ āyasmato channassa sappāyāni bhojanāni pariyesissāmi. Sace āyasmato channassa natthi sappāyāni bhesajjāni, ahaṁ āyasmato channassa sappāyāni bhesajjāni pariyesissāmi. Sace āyasmato channassa natthi patirūpā upaṭṭhākā, ahaṁ āyasmantaṁ channaṁ upaṭṭhahissāmi. Mā āyasmā channo satthaṁ āharesi. Yāpetāyasmā channo, yāpentaṁ mayaṁ āyasmantaṁ channaṁ icchāmā\"ti.",
    "sn35.87:5": "\"Na me, āvuso sāriputta, natthi sappāyāni bhojanāni; atthi me sappāyāni bhojanāni. Napi me natthi sappāyāni bhesajjāni; atthi me sappāyāni bhesajjāni. Napi me natthi patirūpā upaṭṭhākā; atthi me patirūpā upaṭṭhākā. Api ca me, āvuso, satthā pariciṇṇo dīgharattaṁ manāpeneva, no amanāpena. Etañhi, āvuso, sāvakassa patirūpaṁ yaṁ satthāraṁ paricareyya manāpeneva, no amanāpena. ‘Anupavajjaṁ channo bhikkhu satthaṁ āharissatī’ti – evametaṁ, āvuso sāriputta, dhārehī\"ti.",
    "sn35.87:6": "\"Puccheyyāma mayaṁ āyasmantaṁ channaṁ kañcideva desaṁ, sace āyasmā channo okāsaṁ karoti pañhassa veyyākaraṇāyā\"ti.",
    "sn35.87:7": "\"Cakkhuṁ, āvuso channa, cakkhuviññāṇaṁ cakkhuviññāṇaviññātabbe dhamme ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassasi … pe … jivhaṁ, āvuso channa, jivhāviññāṇaṁ jivhāviññāṇaviññātabbe dhamme ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassasi … pe … manaṁ, āvuso channa, manoviññāṇaṁ manoviññāṇaviññātabbe dhamme ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassasī\"ti?",
    "sn35.87:8": "\"Cakkhuṁ, āvuso sāriputta, cakkhuviññāṇaṁ cakkhuviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmi … pe … jivhaṁ, āvuso sāriputta, jivhāviññāṇaṁ jivhāviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmi … pe … manaṁ, āvuso sāriputta, manoviññāṇaṁ manoviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmī\"ti.",
    "sn35.87:9": "\"Cakkhusmiṁ, āvuso channa, cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesu kiṁ disvā kiṁ abhiññāya cakkhuṁ cakkhuviññāṇaṁ cakkhuviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassasi … jivhāya, āvuso channa, jivhāviññāṇe jivhāviññāṇaviññātabbesu dhammesu kiṁ disvā kiṁ abhiññāya jivhaṁ jivhāviññāṇaṁ jivhāviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassasi … manasmiṁ, āvuso channa, manoviññāṇe manoviññāṇaviññātabbesu dhammesu kiṁ disvā kiṁ abhiññāya manaṁ manoviññāṇaṁ manoviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassasī\"ti?",
    "sn35.87:10": "\"Cakkhusmiṁ, āvuso sāriputta, cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesu nirodhaṁ disvā nirodhaṁ abhiññāya cakkhuṁ cakkhuviññāṇaṁ cakkhuviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmi … pe … jivhāya, āvuso sāriputta, jivhāviññāṇe jivhāviññāṇaviññātabbesu dhammesu nirodhaṁ disvā nirodhaṁ abhiññāya jivhaṁ jivhāviññāṇaṁ jivhāviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmi … pe … manasmiṁ, āvuso sāriputta, manoviññāṇe manoviññāṇaviññātabbesu dhammesu nirodhaṁ disvā nirodhaṁ abhiññāya manaṁ manoviññāṇaṁ manoviññāṇaviññātabbe dhamme ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassāmī\"ti.",
    "sn35.87:11": "Evaṁ vutte, āyasmā mahācundo āyasmantaṁ channaṁ etadavoca: \"tasmātiha, āvuso channa, idampi tassa bhagavato sāsanaṁ niccakappaṁ sādhukaṁ manasi kātabbaṁ: ‘nissitassa calitaṁ, anissitassa calitaṁ natthi. Calite asati passaddhi hoti. Passaddhiyā sati nati na hoti. Natiyā asati āgatigati na hoti. Āgatigatiyā asati cutūpapāto na hoti. Cutūpapāte asati nevidha na huraṁ na ubhayamantarena. Esevanto dukkhassā’\"ti.",
    "sn35.87:12": "Atha kho āyasmā ca sāriputto āyasmā ca mahācundo āyasmantaṁ channaṁ iminā ovādena ovaditvā uṭṭhāyāsanā pakkamiṁsu. Atha kho āyasmā channo acirapakkantesu tesu āyasmantesu satthaṁ āharesi.",
    "sn35.87:13": "Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā sāriputto bhagavantaṁ etadavoca: \"āyasmatā, bhante, channena satthaṁ āharitaṁ. Tassa kā gati ko abhisamparāyo\"ti?"
}