{
    "sn35.133:1": "Ekaṁ samayaṁ āyasmā udāyī kāmaṇḍāyaṁ vihārati todeyyassa brāhmaṇassa ambavane. Atha kho verahaccānigottāya brāhmaṇiyā antevāsī māṇavako yenāyasmā udāyī tenupasaṅkami; upasaṅkamitvā āyasmatā udāyinā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho taṁ māṇavakaṁ āyasmā udāyī dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṁsesi. Atha kho so māṇavako āyasmatā udāyinā dhammiyā kathāya sandassito samādapito samuttejito sampahaṁsito uṭṭhāyāsanā yena verahaccānigottā brāhmaṇī tenupasaṅkami; upasaṅkamitvā verahaccānigottaṁ brāhmaṇiṁ etadavoca: \"yagghe, bhoti, jāneyyāsi. Samaṇo udāyī dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ, sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāsetī\"ti.",
    "sn35.133:2": "\"Tena hi tvaṁ, māṇavaka, mama vacanena samaṇaṁ udāyiṁ nimantehi svātanāya bhattenā\"ti.",
    "sn35.133:3": "Dutiyampi kho so māṇavako yenāyasmā udāyī tenupasaṅkami; upasaṅkamitvā āyasmatā udāyinā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho taṁ māṇavakaṁ āyasmā udāyī dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṁsesi. Dutiyampi kho so māṇavako āyasmatā udāyinā dhammiyā kathāya sandassito samādapito samuttejito sampahaṁsito uṭṭhāyāsanā yena verahaccānigottā brāhmaṇī tenupasaṅkami; upasaṅkamitvā verahaccānigottaṁ brāhmaṇiṁ etadavoca: \"yagghe, bhoti, jāneyyāsi. Samaṇo udāyī dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ, sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāsetī\"ti.",
    "sn35.133:4": "\"Evamevaṁ pana tvaṁ, māṇavaka, samaṇassa udāyissa vaṇṇaṁ bhāsasi. Samaṇo panudāyī ‘bhaṇa, samaṇa, dhamman’ti vutto samāno ‘bhavissati, bhagini, samayo’ti vatvā uṭṭhāyāsanā pakkanto\"ti.",
    "sn35.133:5": "Atha kho āyasmā udāyī tassā rattiyā accayena pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya yena verahaccānigottāya brāhmaṇiyā nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho verahaccānigottā brāhmaṇī āyasmantaṁ udāyiṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho verahaccānigottā brāhmaṇī āyasmantaṁ udāyiṁ bhuttāviṁ onītapattapāṇiṁ pādukā orohitvā nīce āsane nisīditvā sīsaṁ vivaritvā āyasmantaṁ udāyiṁ etadavoca: \"kismiṁ nu kho, bhante, sati arahanto sukhadukkhaṁ paññapenti, kismiṁ asati arahanto sukhadukkhaṁ na paññapentī\"ti?",
    "sn35.133:6": "\"Cakkhusmiṁ kho, bhagini, sati arahanto sukhadukkhaṁ paññapenti, cakkhusmiṁ asati arahanto sukhadukkhaṁ na paññapenti … pe … jivhāya sati arahanto sukhadukkhaṁ paññapenti, jivhāya asati arahanto sukhadukkhaṁ na paññapenti … pe … . Manasmiṁ sati arahanto sukhadukkhaṁ paññapenti, manasmiṁ asati arahanto sukhadukkhaṁ na paññapentī\"ti.",
    "sn35.133:7": "Evaṁ vutte, verahaccānigottā brāhmaṇī āyasmantaṁ udāyiṁ etadavoca: \"Abhikkantaṁ, bhante, abhikkantaṁ, bhante. Seyyathāpi, bhante, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ ayyena udāyinā anekapariyāyena dhammo pakāsito. Esāhaṁ, ayya udāyi, taṁ bhagavantaṁ saraṇaṁ gacchāmi, dhammañca, bhikkhusaṅghañca. Upāsikaṁ maṁ ayyo udāyī dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti.",
    "sn35.133:8": "Vesālī vajji nāḷandā,Bhāradvāja soṇo ca ghosito;Hāliddiko nakulapitā,Lohicco verahaccānīti."
}