{
    "sn35.235:1": "\"Ādittapariyāyaṁ vo, bhikkhave, dhammapariyāyaṁ desessāmi. Taṁ suṇātha.",
    "sn35.235:2": "Varaṁ, bhikkhave, tiṇhena ayosaṅkunā ādittena sampajjalitena sajotibhūtena sotindriyaṁ sampalimaṭṭhaṁ, na tveva sotaviññeyyesu saddesu anubyañjanaso nimittaggāho. Nimittassādagathitaṁ vā, bhikkhave, viññāṇaṁ tiṭṭhamānaṁ tiṭṭheyya, anubyañjanassādagathitaṁ vā tasmiñce samaye kālaṁ kareyya, ṭhānametaṁ vijjati, yaṁ dvinnaṁ gatīnaṁ aññataraṁ gatiṁ gaccheyya – nirayaṁ vā tiracchānayoniṁ vā. Imaṁ khvāhaṁ, bhikkhave, ādīnavaṁ disvā evaṁ vadāmi.",
    "sn35.235:3": "Varaṁ, bhikkhave, tiṇhena nakhacchedanena ādittena sampajjalitena sajotibhūtena ghānindriyaṁ sampalimaṭṭhaṁ, na tveva ghānaviññeyyesu gandhesu anubyañjanaso nimittaggāho. Nimittassādagathitaṁ vā, bhikkhave, viññāṇaṁ tiṭṭhamānaṁ tiṭṭheyya, anubyañjanassādagathitaṁ vā tasmiñce samaye kālaṁ kareyya. Ṭhānametaṁ vijjati, yaṁ dvinnaṁ gatīnaṁ aññataraṁ gatiṁ gaccheyya – nirayaṁ vā tiracchānayoniṁ vā. Imaṁ khvāhaṁ, bhikkhave, ādīnavaṁ disvā evaṁ vadāmi.",
    "sn35.235:4": "Varaṁ, bhikkhave, tiṇhena khurena ādittena sampajjalitena sajotibhūtena jivhindriyaṁ sampalimaṭṭhaṁ, na tveva jivhāviññeyyesu rasesu anubyañjanaso nimittaggāho. Nimittassādagathitaṁ vā, bhikkhave, viññāṇaṁ tiṭṭhamānaṁ tiṭṭheyya, anubyañjanassādagathitaṁ vā tasmiñce samaye kālaṁ kareyya. Ṭhānametaṁ vijjati, yaṁ dvinnaṁ gatīnaṁ aññataraṁ gatiṁ gaccheyya – nirayaṁ vā tiracchānayoniṁ vā. Imaṁ khvāhaṁ, bhikkhave, ādīnavaṁ disvā evaṁ vadāmi.",
    "sn35.235:5": "Varaṁ, bhikkhave, tiṇhāya sattiyā ādittāya sampajjalitāya sajotibhūtāya kāyindriyaṁ sampalimaṭṭhaṁ, na tveva kāyaviññeyyesu phoṭṭhabbesu anubyañjanaso nimittaggāho. Nimittassādagathitaṁ vā, bhikkhave, viññāṇaṁ tiṭṭhamānaṁ tiṭṭheyya, anubyañjanassādagathitaṁ vā tasmiñce samaye kālaṁ kareyya. Ṭhānametaṁ vijjati, yaṁ dvinnaṁ gatīnaṁ aññataraṁ gatiṁ gaccheyya – nirayaṁ vā tiracchānayoniṁ vā. Imaṁ khvāhaṁ, bhikkhave, ādīnavaṁ disvā evaṁ vadāmi.",
    "sn35.235:6": "Varaṁ, bhikkhave, sottaṁ. Sottaṁ kho panāhaṁ, bhikkhave, vañjhaṁ jīvitānaṁ vadāmi, aphalaṁ jīvitānaṁ vadāmi, momūhaṁ jīvitānaṁ vadāmi, na tveva tathārūpe vitakke vitakkeyya yathārūpānaṁ vitakkānaṁ vasaṁ gato saṅghaṁ bhindeyya. Imaṁ khvāhaṁ, bhikkhave, vañjhaṁ jīvitānaṁ ādīnavaṁ disvā evaṁ vadāmi.",
    "sn35.235:7": "Tattha, bhikkhave, sutavā ariyasāvako iti paṭisañcikkhati: ‘tiṭṭhatu tāva tattāya ayosalākāya ādittāya sampajjalitāya sajotibhūtāya cakkhundriyaṁ sampalimaṭṭhaṁ. Handāhaṁ idameva manasi karomi – iti cakkhu aniccaṁ, rūpā aniccā, cakkhuviññāṇaṁ aniccaṁ, cakkhusamphasso anicco, yampidaṁ cakkhusamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi aniccaṁ’.",
    "sn35.235:8": "Tiṭṭhatu tāva tiṇhena ayosaṅkunā ādittena sampajjalitena sajotibhūtena sotindriyaṁ sampalimaṭṭhaṁ. Handāhaṁ idameva manasi karomi – iti sotaṁ aniccaṁ, saddā aniccā, sotaviññāṇaṁ aniccaṁ, sotasamphasso anicco, yampidaṁ sotasamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi aniccaṁ.",
    "sn35.235:9": "Tiṭṭhatu tāva tiṇhena nakhacchedanena ādittena sampajjalitena sajotibhūtena ghānindriyaṁ sampalimaṭṭhaṁ. Handāhaṁ idameva manasi karomi – iti ghānaṁ aniccaṁ, gandhā aniccā, ghānaviññāṇaṁ aniccaṁ, ghānasamphasso anicco, yampidaṁ ghānasamphassapaccayā uppajjati vedayitaṁ … pe … tampi aniccaṁ.",
    "sn35.235:10": "Tiṭṭhatu tāva tiṇhena khurena ādittena sampajjalitena sajotibhūtena jivhindriyaṁ sampalimaṭṭhaṁ. Handāhaṁ idameva manasi karomi – iti jivhā aniccā, rasā aniccā, jivhāviññāṇaṁ aniccaṁ, jivhāsamphasso anicco, yampidaṁ jivhāsamphassapaccayā uppajjati … pe … tampi aniccaṁ.",
    "sn35.235:11": "Tiṭṭhatu tāva tiṇhāya sattiyā ādittāya sampajjalitāya sajotibhūtāya kāyindriyaṁ sampalimaṭṭhaṁ. Handāhaṁ idameva manasi karomi – iti kāyo anicco, phoṭṭhabbā aniccā, kāyaviññāṇaṁ aniccaṁ, kāyasamphasso anicco, yampidaṁ kāyasamphassapaccayā uppajjati vedayitaṁ … pe … tampi aniccaṁ.",
    "sn35.235:12": "Tiṭṭhatu tāva sottaṁ. Handāhaṁ idameva manasi karomi – iti mano anicco, dhammā aniccā, manoviññāṇaṁ aniccaṁ, manosamphasso anicco, yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tampi aniccaṁ\".",
    "sn35.235:13": "Evaṁ passaṁ, bhikkhave, sutavā ariyasāvako cakkhusmimpi nibbindati, rūpesupi nibbindati, cakkhuviññāṇepi nibbindati, cakkhusamphassepi nibbindati … pe … yampidaṁ manosamphassapaccayā uppajjati vedayitaṁ sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā tasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati; vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti."
}