{
    "sn36.21:1": "Ekaṁ samayaṁ bhagavā rājagahe vihārati veḷuvane kalandakanivāpe. Atha kho moḷiyasīvako paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho moḷiyasīvako paribbājako bhagavantaṁ etadavoca:",
    "sn36.21:2": "\"Pittasamuṭṭhānānipi kho, sīvaka, idhekaccāni vedayitāni uppajjanti. Sāmampi kho etaṁ, sīvaka, veditabbaṁ yathā pittasamuṭṭhānānipi idhekaccāni vedayitāni uppajjanti. Lokassapi kho etaṁ, sīvaka, saccasammataṁ yathā pittasamuṭṭhānānipi idhekaccāni vedayitāni uppajjanti. Tatra, sīvaka, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā sabbaṁ taṁ pubbekatahetū’ti. Yañca sāmaṁ ñātaṁ tañca atidhāvanti, yañca loke saccasammataṁ tañca atidhāvanti. Tasmā tesaṁ samaṇabrāhmaṇānaṁ micchāti vadāmi.",
    "sn36.21:3": "Semhasamuṭṭhānānipi kho, sīvaka … pe … vātasamuṭṭhānānipi kho, sīvaka … pe … sannipātikānipi kho, sīvaka … pe … utupariṇāmajānipi kho, sīvaka … pe … visamaparihārajānipi kho, sīvaka … pe … opakkamikānipi kho, sīvaka … pe … kammavipākajānipi kho, sīvaka, idhekaccāni vedayitāni uppajjanti. Sāmampi kho etaṁ, sīvaka, veditabbaṁ. Yathā kammavipākajānipi idhekaccāni vedayitāni uppajjanti; lokassapi kho etaṁ, sīvaka, saccasammataṁ. Yathā kammavipākajānipi idhekaccāni vedayitāni uppajjanti; tatra, sīvaka, ye te samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘Yaṁ kiñcāyaṁ purisapuggalo paṭisaṁvedeti sukhaṁ vā dukkhaṁ vā adukkhamasukhaṁ vā sabbaṁ taṁ pubbekatahetū’ti. Yañca sāmaṁ ñātaṁ tañca atidhāvanti yañca loke saccasammataṁ tañca atidhāvanti. Tasmā ‘tesaṁ samaṇabrāhmaṇānaṁ micchā’ti vadāmī\"ti.",
    "sn36.21:4": "Evaṁ vutte, moḷiyasīvako paribbājako bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti.",
    "sn36.21:5": "\"Pittaṁ semhañca vāto ca,Sannipātā utūni ca;Visamaṁ opakkamikaṁ,Kammavipākena aṭṭhamī\"ti."
}