{
    "sn36.7:1": "Ekaṁ samayaṁ bhagavā vesāliyaṁ vihārati mahāvane kūṭāgārasālāyaṁ. Atha kho bhagavā sāyanhasamayaṁ paṭisallānā vuṭṭhito yena gilānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi:",
    "sn36.7:2": "\"Sato, bhikkhave, bhikkhu sampajāno kālaṁ āgameyya. Ayaṁ vo amhākaṁ anusāsanī.",
    "sn36.7:3": "Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; vedanāsu vedanānupassī vihārati … pe … citte cittānupassī vihārati … pe … dhammesu dhammānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Evaṁ kho, bhikkhave, bhikkhu sato hoti.",
    "sn36.7:4": "Kathañca, bhikkhave, bhikkhu sampajāno hoti? Idha, bhikkhave, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. Evaṁ kho, bhikkhave, bhikkhu sampajānakārī hoti.",
    "sn36.7:5": "Tassa ce, bhikkhave, bhikkhuno evaṁ satassa sampajānassa appamattassa ātāpino pahitattassa vihārato uppajjati sukhā vedanā, so evaṁ pajānāti: ‘uppannā kho myāyaṁ sukhā vedanā. Sā ca kho paṭicca, no appaṭicca. Kiṁ paṭicca? Imameva kāyaṁ paṭicca. Ayaṁ kho pana kāyo anicco saṅkhato paṭiccasamuppanno. Aniccaṁ kho pana saṅkhataṁ paṭiccasamuppannaṁ kāyaṁ paṭicca uppannā sukhā vedanā kuto niccā bhavissatī’ti. So kāye ca sukhāya ca vedanāya aniccānupassī vihārati, vayānupassī vihārati, virāgānupassī vihārati, nirodhānupassī vihārati, paṭinissaggānupassī vihārati. Tassa kāye ca sukhāya ca vedanāya aniccānupassino vihārato, vayānupassino vihārato, virāgānupassino vihārato, nirodhānupassino vihārato, paṭinissaggānupassino vihārato, yo kāye ca sukhāya ca vedanāya rāgānusayo, so pahīyati.",
    "sn36.7:6": "Tassa ce, bhikkhave, bhikkhuno evaṁ satassa sampajānassa appamattassa ātāpino pahitattassa vihārato uppajjati dukkhā vedanā. So evaṁ pajānāti: ‘uppannā kho myāyaṁ dukkhā vedanā. Sā ca kho paṭicca, no appaṭicca. Kiṁ paṭicca? Imameva kāyaṁ paṭicca. Ayaṁ kho pana kāyo anicco saṅkhato paṭiccasamuppanno. Aniccaṁ kho pana saṅkhataṁ paṭiccasamuppannaṁ kāyaṁ paṭicca uppannā dukkhā vedanā kuto niccā bhavissatī’ti. So kāye ca dukkhāya ca vedanāya aniccānupassī vihārati, vayānupassī vihārati, virāgānupassī vihārati, nirodhānupassī vihārati, paṭinissaggānupassī vihārati. Tassa kāye ca dukkhāya ca vedanāya aniccānupassino vihārato … pe … paṭinissaggānupassino vihārato, yo kāye ca dukkhāya ca vedanāya paṭighānusayo, so pahīyati.",
    "sn36.7:7": "Tassa ce, bhikkhave, bhikkhuno evaṁ satassa sampajānassa appamattassa ātāpino pahitattassa vihārato uppajjati adukkhamasukhā vedanā, so evaṁ pajānāti: ‘uppannā kho myāyaṁ adukkhamasukhā vedanā. Sā ca kho paṭicca, no appaṭicca. Kiṁ paṭicca? Imameva kāyaṁ paṭicca. Ayaṁ kho pana kāyo anicco saṅkhato paṭiccasamuppanno. Aniccaṁ kho pana saṅkhataṁ paṭiccasamuppannaṁ kāyaṁ paṭicca uppannā adukkhamasukhā vedanā kuto niccā bhavissatī’ti. So kāye ca adukkhamasukhāya ca vedanāya aniccānupassī vihārati, vayānupassī vihārati, virāgānupassī vihārati, nirodhānupassī vihārati, paṭinissaggānupassī vihārati. Tassa kāye ca adukkhamasukhāya ca vedanāya aniccānupassino vihārato … pe … paṭinissaggānupassino vihārato, yo kāye ca adukkhamasukhāya ca vedanāya avijjānusayo, so pahīyati.",
    "sn36.7:8": "So sukhañce vedanāṁ vedayati, sā aniccāti pajānāti, anajjhositāti pajānāti, anabhinanditāti pajānāti; dukkhañce vedanāṁ vedayati … pe … adukkhamasukhañce vedanāṁ vedayati, sā aniccāti pajānāti, anajjhositāti pajānāti, anabhinanditāti pajānāti.",
    "sn36.7:9": "Seyyathāpi, bhikkhave, telañca paṭicca vaṭṭiñca paṭicca telappadīpo jhāyeyya, tasseva telassa ca vaṭṭiyā ca pariyādānā anāhāro nibbāyeyya; evameva kho, bhikkhave, bhikkhu kāyapariyantikaṁ vedanāṁ vedayamāno ‘kāyapariyantikaṁ vedanāṁ vedayāmī’ti pajānāti. Jīvitapariyantikaṁ vedanāṁ vedayamāno ‘jīvitapariyantikaṁ vedanāṁ vedayāmī’ti pajānāti. ‘Kāyassa bhedā uddhaṁ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti pajānātī\"ti."
}