{
    "sn36.8:1": "Ekaṁ samayaṁ bhagavā vesāliyaṁ vihārati mahāvane kūṭāgārasālāyaṁ. Atha kho bhagavā sāyanhasamayaṁ paṭisallānā vuṭṭhito yena gilānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi:",
    "sn36.8:2": "\"Sato, bhikkhave, bhikkhu sampajāno kālaṁ āgameyya. Ayaṁ vo amhākaṁ anusāsanī.",
    "sn36.8:3": "Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; vedanāsu vedanānupassī vihārati … citte cittānupassī vihārati … dhammesu dhammānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Evaṁ kho, bhikkhave, bhikkhu sato hoti.",
    "sn36.8:4": "Kathañca, bhikkhave, bhikkhu sampajāno hoti? Idha, bhikkhave, bhikkhu abhikkante paṭikkante sampajānakārī hoti … pe … bhāsite tuṇhībhāve sampajānakārī hoti. Evaṁ kho, bhikkhave, bhikkhu sampajāno hoti. Sato, bhikkhave, bhikkhu sampajāno kālaṁ āgameyya. Ayaṁ vo amhākaṁ anusāsanī.",
    "sn36.8:5": "Tassa ce, bhikkhave, bhikkhuno evaṁ satassa sampajānassa appamattassa ātāpino pahitattassa vihārato uppajjati sukhā vedanā. So evaṁ pajānāti: ‘uppannā kho myāyaṁ sukhā vedanā; sā ca kho paṭicca, no appaṭicca. Kiṁ paṭicca? Imameva phassaṁ paṭicca. Ayaṁ kho pana phasso anicco saṅkhato paṭiccasamuppanno. Aniccaṁ kho pana saṅkhataṁ paṭiccasamuppannaṁ phassaṁ paṭicca uppannā sukhā vedanā kuto niccā bhavissatī’ti. So phasse ca sukhāya ca vedanāya aniccānupassī vihārati, vayānupassī vihārati, virāgānupassī vihārati, nirodhānupassī vihārati, paṭinissaggānupassī vihārati. Tassa phasse ca sukhāya ca vedanāya aniccānupassino vihārato, vayānupassino vihārato, virāgānupassino vihārato, nirodhānupassino vihārato, paṭinissaggānupassino vihārato yo phasse ca sukhāya ca vedanāya rāgānusayo, so pahīyati.",
    "sn36.8:6": "Tassa ce, bhikkhave, bhikkhuno evaṁ satassa … pe … vihārato uppajjati dukkhā vedanā … pe … uppajjati adukkhamasukhā vedanā. So evaṁ pajānāti: ‘uppannā kho myāyaṁ adukkhamasukhā vedanā; sā ca kho paṭicca, no appaṭicca. Kiṁ paṭicca? Imameva phassaṁ paṭicca. (Yathā purimasutte, tathā vitthāretabbo.) Kāyassa bhedā uddhaṁ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti pajānāti.",
    "sn36.8:7": "Seyyathāpi, bhikkhave, telañca paṭicca vaṭṭiñca paṭicca telappadīpo jhāyeyya, tasseva telassa ca vaṭṭiyā ca pariyādānā anāhāro nibbāyeyya; evameva kho, bhikkhave, bhikkhu kāyapariyantikaṁ vedanāṁ vedayamāno ‘kāyapariyantikaṁ vedanāṁ vedayāmī’ti pajānāti. Jīvitapariyantikaṁ vedanāṁ vedayamāno ‘jīvitapariyantikaṁ vedanāṁ vedayāmī’ti pajānāti. ‘Kāyassa bhedā uddhaṁ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti pajānātī\"ti."
}