{
    "sn4.24:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā uruvelāyaṁ vihārati najjā nerañjarāya tīre ajapālanigrodhe. Tena kho pana samayena māro pāpimā sattavassāni bhagavantaṁ anubandho hoti otārāpekkho otāraṁ alabhamāno. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ gāthāya ajjhabhāsi:",
    "sn4.24:2": "\"Sokāvatiṇṇo nu vanamhi jhāyasi,Vittaṁ nu jīno uda patthayāno;Āguṁ nu gāmasmimakāsi kiñci,Kasmā janena na karosi sakkhiṁ;Sakkhī na sampajjati kenaci te\"ti.",
    "sn4.24:3": "\"Sokassa mūlaṁ palikhāya sabbaṁ,Anāgu jhāyāmi asocamāno;Chetvāna sabbaṁ bhavalobhajappaṁ,Anāsavo jhāyāmi pamattabandhū\"ti.",
    "sn4.24:4": "\"Yaṁ vadanti mama yidanti,ye vadanti mamanti ca;Ettha ce te mano atthi,na me samaṇa mokkhasī\"ti.",
    "sn4.24:5": "\"Yaṁ vadanti na taṁ mayhaṁ,ye vadanti na te ahaṁ;Evaṁ pāpima jānāhi,na me maggampi dakkhasī\"ti.",
    "sn4.24:6": "\"Sace maggaṁ anubuddhaṁ,khemaṁ amatagāminaṁ;Apehi gaccha tvameveko,kimaññamanusāsasī\"ti.",
    "sn4.24:7": "\"Amaccudheyyaṁ pucchanti,ye janā pāragāmino;Tesāhaṁ puṭṭho akkhāmi,yaṁ saccaṁ taṁ nirūpadhin\"ti.",
    "sn4.24:8": "\"Seyyathāpi, bhante, gāmassa vā nigamassa vā avidūre pokkharaṇī. Tatrassa kakkaṭako. Atha kho, bhante, sambahulā kumārakā vā kumārikāyo vā tamhā gāmā vā nigamā vā nikkhamitvā yena sā pokkharaṇī tenupasaṅkameyyuṁ; upasaṅkamitvā taṁ kakkaṭakaṁ udakā uddharitvā thale patiṭṭhapeyyuṁ. Yaṁ yadeva hi so, bhante, kakkaṭako aḷaṁ abhininnāmeyya taṁ tadeva te kumārakā vā kumārikāyo vā kaṭṭhena vā kathalāya vā sañchindeyyuṁ sambhañjeyyuṁ sampalibhañjeyyuṁ. Evañhi so, bhante, kakkaṭako sabbehi aḷehi sañchinnehi sambhaggehi sampalibhaggehi abhabbo taṁ pokkharaṇiṁ otarituṁ. Evameva kho, bhante, yāni kānici visūkāyikāni visevitāni vipphanditāni, sabbāni tāni bhagavatā sañchinnāni sambhaggāni sampalibhaggāni. Abhabbo dānāhaṁ, bhante, puna bhagavantaṁ upasaṅkamituṁ yadidaṁ otārāpekkho\"ti.",
    "sn4.24:9": "\"Medavaṇṇañca pāsāṇaṁ,vāyaso anupariyagā;Apettha muduṁ vindema,api assādanā siyā.",
    "sn4.24:10": "Aladdhā tattha assādaṁ,vāyasetto apakkame;Kākova selamāsajja,nibbijjāpema gotamā\"ti."
}