{
    "sn4.25:1": "Atha kho māro pāpimā bhagavato santike imā nibbejanīyā gāthāyo abhāsitvā tamhā ṭhānā apakkamma bhagavato avidūre pathaviyaṁ pallaṅkena nisīdi tuṇhībhūto maṅkubhūto pattakkhandho adhomukho pajjhāyanto appaṭibhāno kaṭṭhena bhūmiṁ vilikhanto.",
    "sn4.25:2": "\"Kenāsi dummano tāta,purisaṁ kaṁ nu socasi;Mayaṁ taṁ rāgapāsena,āraññamiva kuñjaraṁ;Bandhitvā ānayissāma,vasago te bhavissatī\"ti.",
    "sn4.25:3": "\"Arahaṁ sugato loke,na rāgena suvānayo;Māradheyyaṁ atikkanto,tasmā socāmahaṁ bhusan\"ti.",
    "sn4.25:4": "Atha kho taṇhā ca arati ca ragā ca māradhītaro yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ etadavocuṁ: \"pāde te, samaṇa, paricāremā\"ti. Atha kho bhagavā na manasākāsi, yathā taṁ anuttare upadhisaṅkhaye vimutto.",
    "sn4.25:5": "Atha kho taṇhā ca arati ca ragā ca māradhītaro ekamantaṁ apakkamma evaṁ samacintesuṁ: \"uccāvacā kho purisānaṁ adhippāyā. Yannūna mayaṁ ekasataṁ ekasataṁ kumārivaṇṇasataṁ abhinimmineyyāmā\"ti. Atha kho taṇhā ca arati ca ragā ca māradhītaro ekasataṁ ekasataṁ kumārivaṇṇasataṁ abhinimminitvā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ etadavocuṁ: \"pāde te, samaṇa, paricāremā\"ti. Tampi bhagavā na manasākāsi, yathā taṁ anuttare upadhisaṅkhaye vimutto.",
    "sn4.25:6": "Atha kho taṇhā ca arati ca ragā ca māradhītaro ekamantaṁ apakkamma evaṁ samacintesuṁ: \"uccāvacā kho purisānaṁ adhippāyā. Yannūna mayaṁ ekasataṁ ekasataṁ avijātavaṇṇasataṁ abhinimmineyyāmā\"ti. Atha kho taṇhā ca arati ca ragā ca māradhītaro ekasataṁ ekasataṁ avijātavaṇṇasataṁ abhinimminitvā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ etadavocuṁ: \"pāde te, samaṇa, paricāremā\"ti. Tampi bhagavā na manasākāsi, yathā taṁ anuttare upadhisaṅkhaye vimutto.",
    "sn4.25:7": "Atha kho taṇhā ca … pe … yannūna mayaṁ ekasataṁ ekasataṁ sakiṁ vijātavaṇṇasataṁ abhinimmineyyāmāti. Atha kho taṇhā ca … pe … sakiṁ vijātavaṇṇasataṁ abhinimminitvā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ etadavocuṁ: \"pāde te, samaṇa, paricāremā\"ti. Tampi bhagavā na manasākāsi, yathā taṁ anuttare upadhisaṅkhaye vimutto.",
    "sn4.25:8": "Atha kho taṇhā ca … pe … yannūna mayaṁ ekasataṁ ekasataṁ duvijātavaṇṇasataṁ abhinimmineyyāmāti. Atha kho taṇhā ca … pe … duvijātavaṇṇasataṁ abhinimminitvā yena bhagavā … pe … yathā taṁ anuttare upadhisaṅkhaye vimutto. Atha kho taṇhā ca … pe … majjhimitthivaṇṇasataṁ abhinimmineyyāmā\"ti. Atha kho taṇhā ca … pe … majjhimitthivaṇṇasataṁ abhinimminitvā … pe … anuttare upadhisaṅkhaye vimutto.",
    "sn4.25:9": "Atha kho taṇhā ca … pe … mahitthivaṇṇasataṁ abhinimmineyyāmāti. Atha kho taṇhā ca … pe … mahitthivaṇṇasataṁ abhinimminitvā yena bhagavā … pe … anuttare upadhisaṅkhaye vimutto. Atha kho taṇhā ca arati ca ragā ca māradhītaro ekamantaṁ apakkamma etadavocuṁ: \"Saccaṁ kira no pitā avoca:",
    "sn4.25:10": "‘Arahaṁ sugato loke,na rāgena suvānayo;Māradheyyaṁ atikkanto,tasmā socāmahaṁ bhusan’ti.",
    "sn4.25:11": "Yañhi mayaṁ samaṇaṁ vā brāhmaṇaṁ vā avītarāgaṁ iminā upakkamena upakkameyyāma hadayaṁ vāssa phaleyya, uṇhaṁ lohitaṁ vā mukhato uggaccheyya, ummādaṁ vā pāpuṇeyya cittakkhepaṁ vā. Seyyathā vā pana naḷo harito luto ussussati visussati milāyati; evameva ussusseyya visusseyya milāyeyyā\"ti.",
    "sn4.25:12": "Atha kho taṇhā ca arati ca ragā ca māradhītaro yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā ekamantaṁ aṭṭhaṁsu. Ekamantaṁ ṭhitā kho taṇhā māradhītā bhagavantaṁ gāthāya ajjhabhāsi:",
    "sn4.25:13": "\"Sokāvatiṇṇo nu vanamhi jhāyasi,Vittaṁ nu jīno uda patthayāno;Āguṁ nu gāmasmimakāsi kiñci,Kasmā janena na karosi sakkhiṁ;Sakkhī na sampajjati kenaci te\"ti.",
    "sn4.25:14": "\"Atthassa pattiṁ hadayassa santiṁ,Jetvāna senaṁ piyasātarūpaṁ;Ekohaṁ jhāyaṁ sukhamanubodhiṁ,Tasmā janena na karomi sakkhiṁ;Sakkhī na sampajjati kenaci me\"ti.",
    "sn4.25:15": "Atha kho arati māradhītā bhagavantaṁ gāthāya ajjhabhāsi:",
    "sn4.25:16": "\"Kathaṁvihārībahulodha bhikkhu,Pañcoghatiṇṇo atarīdha chaṭṭhaṁ;Kathaṁ jhāyiṁ bahulaṁ kāmasaññā,Paribāhirā honti aladdha yo tan\"ti.",
    "sn4.25:17": "\"Passaddhakāyo suvimuttacitto,Asaṅkharāno satimā anoko;Aññāya dhammaṁ avitakkajhāyī,Na kuppati na sarati na thino.",
    "sn4.25:18": "Evaṁvihārībahulodha bhikkhu,Pañcoghatiṇṇo atarīdha chaṭṭhaṁ;Evaṁ jhāyiṁ bahulaṁ kāmasaññā,Paribāhirā honti aladdha yo tan\"ti.",
    "sn4.25:19": "Atha kho ragā māradhītā bhagavato santike gāthāya ajjhabhāsi:",
    "sn4.25:20": "\"Acchejja taṇhāṁ gaṇasaṅghacārī,Addhā carissanti bahū ca saddhā;Bahuṁ vatāyaṁ janataṁ anoko,Acchejja nessati maccurājassa pāran\"ti.",
    "sn4.25:21": "\"Nayanti ve mahāvīrā,saddhammena Tathāgata;Dhammena nayamānānaṁ,kā usūyā vijānatan\"ti.",
    "sn4.25:22": "Atha kho taṇhā ca arati ca ragā ca māradhītaro yena māro pāpimā tenupasaṅkamiṁsu. Addasā kho māro pāpimā taṇhāñca aratiñca rāgañca māradhītaro dūratova āgacchantiyo. Disvāna gāthāhi ajjhabhāsi:",
    "sn4.25:23": "\"Bālā kumudanāḷehi,pabbataṁ abhimatthatha;Giriṁ nakhena khanatha,ayo dantehi khādatha.",
    "sn4.25:24": "Selaṁva sirasūhacca,pātāle gādhamesatha;Khāṇuṁva urasāsajja,nibbijjāpetha gotamā\"ti.",
    "sn4.25:25": "\"Daddallamānā āgañchuṁ,taṇhā ca aratī ragā;Tā tattha panudī satthā,tūlaṁ bhaṭṭhaṁva māluto\"ti.",
    "sn4.25:26": "Sambahulā samiddhi ca,Godhikaṁ sattavassāni;Dhītaraṁ desitaṁ buddha,Seṭṭhena imaṁ mārapañcakanti."
}