{
    "sn4.23:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā rājagahe vihārati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā godhiko isigilipasse vihārati kāḷasilāyaṁ. Atha kho āyasmā godhiko appamatto ātāpī pahitatto vihāranto sāmayikaṁ cetovimuttiṁ phusi. Atha kho āyasmā godhiko tamhā sāmayikāya cetovimuttiyā parihāyi. Dutiyampi kho āyasmā godhiko appamatto ātāpī pahitatto vihāranto sāmayikaṁ cetovimuttiṁ phusi. Dutiyampi kho āyasmā godhiko tamhā sāmayikāya cetovimuttiyā parihāyi. Tatiyampi kho āyasmā godhiko appamatto ātāpī pahitatto vihāranto sāmayikaṁ cetovimuttiṁ phusi. Tatiyampi kho āyasmā godhiko tamhā … pe … parihāyi. Catutthampi kho āyasmā godhiko appamatto … pe … vimuttiṁ phusi. Catutthampi kho āyasmā godhiko tamhā … pe … parihāyi. Pañcamampi kho āyasmā godhiko … pe … cetovimuttiṁ phusi. Pañcamampi kho āyasmā … pe … vimuttiyā parihāyi. Chaṭṭhampi kho āyasmā godhiko appamatto ātāpī pahitatto vihāranto sāmayikaṁ cetovimuttiṁ phusi. Chaṭṭhampi kho āyasmā godhiko tamhā sāmayikāya cetovimuttiyā parihāyi. Sattamampi kho āyasmā godhiko appamatto ātāpī pahitatto vihāranto sāmayikaṁ cetovimuttiṁ phusi.",
    "sn4.23:2": "Atha kho āyasmato godhikassa etadahosi: \"yāva chaṭṭhaṁ khvāhaṁ sāmayikāya cetovimuttiyā parihīno. Yannūnāhaṁ satthaṁ āhareyyan\"ti.Atha kho māro pāpimā āyasmato godhikassa cetasā cetoparivitakkamaññāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ gāthāhi ajjhabhāsi:",
    "sn4.23:3": "\"Mahāvīra mahāpañña,iddhiyā yasasā jala;Sabbaverabhayātīta,pāde vandāmi cakkhumā.",
    "sn4.23:4": "Sāvako te mahāvīra,maraṇaṁ maraṇābhibhū;Ākaṅkhati cetayati,taṁ nisedha jutindhara.",
    "sn4.23:5": "Kathañhi bhagavā tuyhaṁ,Sāvako sāsane rato;Appattamānaso sekkho,Kālaṁ kayirā janesutā\"ti.",
    "sn4.23:6": "Tena kho pana samayena āyasmatā godhikena satthaṁ āharitaṁ hoti. Atha kho bhagavā \"māro ayaṁ pāpimā\" iti viditvā māraṁ pāpimantaṁ gāthāya ajjhabhāsi:",
    "sn4.23:7": "\"Evañhi dhīrā kubbanti,nāvakaṅkhanti jīvitaṁ;Samūlaṁ taṇhamabbuyha,godhiko parinibbuto\"ti.",
    "sn4.23:8": "Atha kho bhagavā bhikkhū āmantesi: \"āyāma, bhikkhave, yena isigilipassaṁ kāḷasilā tenupasaṅkamissāma yattha godhikena kulaputtena satthaṁ āharitan\"ti.\"Evaṁ, bhante\"ti kho te bhikkhū bhagavato paccassosuṁ.",
    "sn4.23:9": "Atha kho bhagavā sambahulehi bhikkhūhi saddhiṁ yena isigilipassaṁ kāḷasilā tenupasaṅkami. Addasā kho bhagavā āyasmantaṁ godhikaṁ dūratova mañcake vivattakkhandhaṁ semānaṁ.Tena kho pana samayena dhūmāyitattaṁ timirāyitattaṁ gacchateva purimaṁ disaṁ, gacchati pacchimaṁ disaṁ, gacchati uttaraṁ disaṁ, gacchati dakkhiṇaṁ disaṁ, gacchati uddhaṁ, gacchati adho, gacchati anudisaṁ.",
    "sn4.23:10": "Atha kho bhagavā bhikkhū āmantesi: \"passatha no tumhe, bhikkhave, etaṁ dhūmāyitattaṁ timirāyitattaṁ gacchateva purimaṁ disaṁ, gacchati pacchimaṁ disaṁ, gacchati uttaraṁ disaṁ, gacchati dakkhiṇaṁ disaṁ, gacchati uddhaṁ, gacchati adho, gacchati anudisan\"ti?\"Evaṁ, bhante\".\"Eso kho, bhikkhave, māro pāpimā godhikassa kulaputtassa viññāṇaṁ samanvesati: ‘kattha godhikassa kulaputtassa viññāṇaṁ patiṭṭhitan’ti? Appatiṭṭhitena ca, bhikkhave, viññāṇena godhiko kulaputto parinibbuto\"ti.Atha kho māro pāpimā beluvapaṇḍuvīṇaṁ ādāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ gāthāya ajjhabhāsi:",
    "sn4.23:11": "\"Uddhaṁ adho ca tiriyaṁ,disā anudisā svahaṁ;Anvesaṁ nādhigacchāmi,godhiko so kuhiṁ gato\"ti.",
    "sn4.23:12": "\"Yo dhīro dhitisampanno,jhāyī jhanarato sadā;Ahorattaṁ anuyuñjaṁ,jīvitaṁ anikāmayaṁ.",
    "sn4.23:13": "Jetvāna maccuno senaṁ,anāgantvā punabbhavaṁ;Samūlaṁ taṇhamabbuyha,godhiko parinibbuto\"ti.",
    "sn4.23:14": "Tassa sokaparetassa,vīṇā kacchā abhassatha;Tato so dummano yakkho,tatthevantaradhāyathāti."
}