{
    "sn40.10:1": "Atha kho āyasmā mahāmoggallāno – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evameva – jetavane antarahito devesu tāvatiṁsesu pāturahosi. Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṁ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahāmoggallānaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitaṁ kho sakkaṁ devānamindaṁ āyasmā mahāmoggallāno etadavoca:",
    "sn40.10:2": "\"Sādhu kho, devānaminda, buddhasaraṇagamanaṁ hoti. Buddhasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Sādhu kho, devānaminda, dhammasaraṇagamanaṁ hoti. Dhammasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Sādhu kho, devānaminda, saṅghasaraṇagamanaṁ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "sn40.10:3": "\"Sādhu kho, mārisa moggallāna, buddhasaraṇagamanaṁ hoti. Buddhasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Sādhu kho, mārisa moggallāna, dhammasaraṇagamanaṁ hoti. Dhammasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Sādhu kho, mārisa moggallāna, saṅgha … pe … sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "sn40.10:4": "Atha kho sakko devānamindo chahi devatāsatehi saddhiṁ … pe … atha kho sakko devānamindo sattahi devatāsatehi saddhiṁ … pe … atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṁ … pe … atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṁ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahāmoggallānaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitaṁ kho sakkaṁ devānamindaṁ āyasmā mahāmoggallāno etadavoca:",
    "sn40.10:5": "\"Sādhu kho, devānaminda, buddhasaraṇagamanaṁ hoti. Buddhasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Sādhu kho, devānaminda, dhammasaraṇagamanaṁ hoti. Dhammasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Sādhu kho, devānaminda, saṅghasaraṇagamanaṁ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "sn40.10:6": "\"Sādhu kho, mārisa moggallāna, buddhasaraṇagamanaṁ hoti. Buddhasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Sādhu kho, mārisa moggallāna, dhammasaraṇagamanaṁ hoti … pe … sādhu kho, mārisa moggallāna, saṅghasaraṇagamanaṁ hoti. Saṅghasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "sn40.10:7": "Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṁ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahāmoggallānaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitaṁ kho sakkaṁ devānamindaṁ āyasmā mahāmoggallāno etadavoca:",
    "sn40.10:8": "\"Sādhu kho, devānaminda, buddhe aveccappasādena samannāgamanaṁ hoti: ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:9": "Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṁ hoti: ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:10": "Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṁ hoti: ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṁ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṁ puññakkhettaṁ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:11": "Sādhu kho, devānaminda, ariyakantehi sīlehi samannāgamanaṁ hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṁvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "sn40.10:12": "\"Sādhu kho, mārisa moggallāna, buddhe aveccappasādena samannāgamanaṁ hoti: ‘itipi so … pe … satthā devamanussānaṁ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:13": "Sādhu kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṁ hoti: ‘svākkhāto bhagavatā dhammo … pe … paccattaṁ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:14": "Sādhu kho, mārisa moggallāna, saṅghe aveccappasādena samannāgamanaṁ hoti: ‘suppaṭipanno bhagavato sāvakasaṅgho … pe … anuttaraṁ puññakkhettaṁ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:15": "Sādhu kho, mārisa moggallāna, ariyakantehi sīlehi samannāgamanaṁ hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "sn40.10:16": "Atha kho sakko devānamindo chahi devatāsatehi saddhiṁ … pe … . Atha kho sakko devānamindo sattahi devatāsatehi saddhiṁ … pe … . Atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṁ … pe … . Atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṁ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahāmoggallānaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitaṁ kho sakkaṁ devānamindaṁ āyasmā mahāmoggallāno etadavoca:",
    "sn40.10:17": "\"Sādhu kho, devānaminda, buddhe aveccappasādena samannāgamanaṁ hoti: ‘itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:18": "Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṁ hoti: ‘svākkhāto bhagavatā dhammo … pe … paccattaṁ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:19": "Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṁ hoti: ‘suppaṭipanno bhagavato sāvakasaṅgho … pe … anuttaraṁ puññakkhettaṁ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:20": "Sādhu kho, devānaminda, ariyakantehi sīlehi samannāgamanaṁ hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "sn40.10:21": "\"Sādhu kho, mārisa moggallāna, buddhe aveccappasādena samannāgamanaṁ hoti: ‘itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:22": "Sādhu kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṁ hoti: ‘svākkhāto bhagavatā dhammo … pe … paccattaṁ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:23": "Sādhu kho, mārisa moggallāna, saṅghe aveccappasādena samannāgamanaṁ hoti: ‘suppaṭipanno bhagavato sāvakasaṅgho … pe … anuttaraṁ puññakkhettaṁ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti.",
    "sn40.10:24": "Sādhu kho, mārisa moggallāna, ariyakantehi sīlehi samannāgamanaṁ hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjantī\"ti.",
    "sn40.10:25": "Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṁ yenāyasmā mahāmoggallāno tenupasaṅkami … pe … ekamantaṁ ṭhitaṁ kho sakkaṁ devānamindaṁ āyasmā mahāmoggallāno etadavoca:",
    "sn40.10:26": "\"Sādhu kho, devānaminda, buddhasaraṇagamanaṁ hoti. Buddhasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi.",
    "sn40.10:27": "Sādhu kho, devānaminda, dhammasaraṇagamanaṁ hoti. Dhammasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi.",
    "sn40.10:28": "Sādhu kho, devānaminda, saṅghasaraṇagamanaṁ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī\"ti.",
    "sn40.10:29": "\"Sādhu kho, mārisa moggallāna, buddhasaraṇagamanaṁ hoti. Buddhasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:30": "Sādhu kho, mārisa moggallāna, dhammasaraṇagamanaṁ hoti … pe … .",
    "sn40.10:31": "Sādhu kho, mārisa moggallāna, saṅghasaraṇagamanaṁ hoti. Saṅghasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī\"ti.",
    "sn40.10:32": "Atha kho sakko devānamindo chahi devatāsatehi saddhiṁ … pe … atha kho sakko devānamindo sattahi devatāsatehi saddhiṁ … pe … atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṁ … pe … atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṁ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahāmoggallānaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitaṁ kho sakkaṁ devānamindaṁ āyasmā mahāmoggallāno etadavoca:",
    "sn40.10:33": "\"Sādhu kho, devānaminda, buddhasaraṇagamanaṁ hoti. Buddhasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:34": "Sādhu kho, devānaminda, dhammasaraṇagamanaṁ hoti … pe … .",
    "sn40.10:35": "Sādhu kho, devānaminda, saṅghasaraṇagamanaṁ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī\"ti.",
    "sn40.10:36": "\"Sādhu kho, mārisa moggallāna, buddhasaraṇagamanaṁ hoti … pe … sādhu kho, mārisa moggallāna, dhammasaraṇagamanaṁ hoti … pe … sādhu kho, mārisa moggallāna, saṅghasaraṇagamanaṁ hoti. Saṅghasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī\"ti.",
    "sn40.10:37": "Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṁ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahāmoggallānaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitaṁ kho sakkaṁ devānamindaṁ āyasmā mahāmoggallāno etadavoca:",
    "sn40.10:38": "\"Sādhu kho, devānaminda, buddhe aveccappasādena samannāgamanaṁ hoti: ‘itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:39": "Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṁ hoti: ‘svākkhāto bhagavatā dhammo … pe … paccattaṁ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti … pe … .",
    "sn40.10:40": "Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṁ hoti: ‘suppaṭipanno bhagavato sāvakasaṅgho … pe … lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti … pe … .",
    "sn40.10:41": "Sādhu kho, devānaminda, ariyakantehi sīlehi samannāgamanaṁ hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehī\"ti.",
    "sn40.10:42": "\"Sādhu kho, mārisa moggallāna, buddhe aveccappasādena samannāgamanaṁ hoti: ‘itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:43": "Sādhu kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṁ hoti: ‘svākkhāto bhagavatā dhammo … pe … paccattaṁ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:44": "Sādhu kho, mārisa moggallāna, saṅghe aveccappasādena samannāgamanaṁ hoti: ‘suppaṭipanno bhagavato sāvakasaṅgho … pe … lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti … pe … .",
    "sn40.10:45": "Sādhu kho, mārisa moggallāna, ariyakantehi sīlehi samannāgamanaṁ hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehī\"ti.",
    "sn40.10:46": "Atha kho sakko devānamindo chahi devatāsatehi saddhiṁ … pe … atha kho sakko devānamindo sattahi devatāsatehi saddhiṁ … pe … atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṁ … pe … atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṁ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṁ mahāmoggallānaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhitaṁ kho sakkaṁ devānamindaṁ āyasmā mahāmoggallāno etadavoca:",
    "sn40.10:47": "\"Sādhu kho, devānaminda, buddhe aveccappasādena samannāgamanaṁ hoti: ‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi.",
    "sn40.10:48": "Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṁ hoti: ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṁ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:49": "Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṁ hoti: ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṁ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṁ puññakkhettaṁ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:50": "Sādhu kho, devānaminda, ariyakantehi sīlehi samannāgamanaṁ hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṁvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī\"ti.",
    "sn40.10:51": "\"Sādhu kho, mārisa moggallāna, buddhe aveccappasādena samannāgamanaṁ hoti: ‘itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:52": "Sādhu kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṁ hoti: ‘svākkhāto bhagavatā dhammo … pe … paccattaṁ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:53": "Sādhu kho, mārisa moggallāna, saṅghe aveccappasādena samannāgamanaṁ hoti: ‘suppaṭipanno bhagavato sāvakasaṅgho … pe … anuttaraṁ puññakkhettaṁ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā … pe … dibbehi phoṭṭhabbehi.",
    "sn40.10:54": "Sādhu kho, mārisa moggallāna, ariyakantehi sīlehi samannāgamanaṁ hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī\"ti."
}