{
    "sn42.5:1": "Atha kho assāroho gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho assāroho gāmaṇi bhagavantaṁ etadavoca: \"sutaṁ metaṁ, bhante, pubbakānaṁ acariyapācariyānaṁ assārohānaṁ bhāsamānānaṁ: ‘yo so assāroho saṅgāme ussahati vāyamati, tamenaṁ ussahantaṁ vāyamantaṁ pare hananti pariyāpādenti, so kāyassa bhedā paraṁ maraṇā parajitānaṁ devānaṁ sahabyataṁ upapajjatī’ti. Idha bhagavā kimāhā\"ti? \"Alaṁ, gāmaṇi, tiṭṭhatetaṁ; mā maṁ etaṁ pucchī\"ti.",
    "sn42.5:2": "Dutiyampi kho … pe … tatiyampi kho assāroho gāmaṇi bhagavantaṁ etadavoca: \"sutaṁ metaṁ, bhante, pubbakānaṁ acariyapācariyānaṁ assārohānaṁ bhāsamānānaṁ: ‘yo so assāroho saṅgāme ussahati vāyamati, tamenaṁ ussahantaṁ vāyamantaṁ pare hananti pariyāpādenti, so kāyassa bhedā paraṁ maraṇā parajitānaṁ devānaṁ sahabyataṁ upapajjatī’ti. Idha bhagavā kimāhā\"ti?",
    "sn42.5:3": "\"Addhā kho tyāhaṁ, gāmaṇi, na labhāmi: ‘alaṁ, gāmaṇi, tiṭṭhatetaṁ; mā maṁ etaṁ pucchī’ti. Api ca kho tyāhaṁ byākarissāmi. Yo so, gāmaṇi, assāroho saṅgāme ussahati vāyamati tassa taṁ cittaṁ pubbe gahitaṁ dukkaṭaṁ duppaṇihitaṁ: ‘ime sattā haññantu vā bajjhantu vā ucchijjantu vā vinassantu vā mā ahesuṁ iti vā’ti. Tamenaṁ ussahantaṁ vāyamantaṁ pare hananti pariyāpādenti, so kāyassa bhedā paraṁ maraṇā parajito nāma nirayo tattha upapajjati. Sace kho panassa evaṁ diṭṭhi hoti: ‘yo so assāroho saṅgāme ussahati vāyamati, tamenaṁ ussahantaṁ vāyamantaṁ pare hananti pariyāpādenti, so kāyassa bhedā paraṁ maraṇā parajitānaṁ devānaṁ sahabyataṁ upapajjatī’ti, sāssa hoti micchādiṭṭhi. Micchādiṭṭhikassa kho panāhaṁ, gāmaṇi, purisapuggalassa dvinnaṁ gatīnaṁ aññataraṁ gatiṁ vadāmi – nirayaṁ vā tiracchānayoniṁ vā\"ti.",
    "sn42.5:4": "Evaṁ vutte, assāroho gāmaṇi parodi, assūni pavattesi. \"Etaṁ kho tyāhaṁ, gāmaṇi, nālatthaṁ: ‘alaṁ, gāmaṇi, tiṭṭhatetaṁ; mā maṁ etaṁ pucchī’\"ti. \"Nāhaṁ, bhante, etaṁ rodāmi yaṁ maṁ bhagavā evamāha. Api cāhaṁ, bhante, pubbakehi acariyapācariyehi assārohehi dīgharattaṁ nikato vañcito paluddho: ‘yo so assāroho saṅgāme ussahati vāyamati, tamenaṁ ussahantaṁ vāyamantaṁ pare hananti pariyāpādenti, so kāyassa bhedā paraṁ maraṇā parajitānaṁ devānaṁ sahabyataṁ upapajjatī’\"ti. \"Abhikkantaṁ, bhante … pe … ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}