{
    "sn42.13:1": "Ekaṁ samayaṁ bhagavā koliyesu vihārati uttaraṁ nāma koliyānaṁ nigamo. Atha kho pāṭaliyo gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho pāṭaliyo gāmaṇi bhagavantaṁ etadavoca: \"sutaṁ metaṁ, bhante: ‘samaṇo gotamo māyaṁ jānātī’ti.",
    "sn42.13:2": "Ye te, bhante, evamāhaṁsu: ‘samaṇo gotamo māyaṁ jānātī’ti, kacci te, bhante, bhagavato vuttavādino, na ca bhagavantaṁ abhūtena abbhācikkhanti, dhammassa cānudhammaṁ byākaronti, na ca koci sahadhammiko vādānuvādo gārayhaṁ ṭhānaṁ āgacchati? Anabbhācikkhitukāmā hi mayaṁ, bhante, bhagavantan\"ti.",
    "sn42.13:3": "Taṁ kiṁ maññasi, gāmaṇi, jānāsi tvaṁ koliyānaṁ lambacūḷake bhaṭe\"ti?",
    "sn42.13:4": "Pāṇātipātañcāhaṁ, gāmaṇi, pajānāmi, pāṇātipātassa ca vipākaṁ, yathāpaṭipanno ca pāṇātipātī kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati tañca pajānāmi.",
    "sn42.13:5": "Santi hi, gāmaṇi, eke samaṇabrāhmaṇā evaṁvādino evaṁdiṭṭhino: ‘yo koci pāṇamatipāteti, sabbo so diṭṭheva dhamme dukkhaṁ domanassaṁ paṭisaṁvedayati. Yo koci adinnaṁ ādiyati, sabbo so diṭṭheva dhamme dukkhaṁ domanassaṁ paṭisaṁvedayati. Yo koci kāmesu micchā carati, sabbo so diṭṭheva dhamme dukkhaṁ domanassaṁ paṭisaṁvedayati. Yo koci musā bhaṇati, sabbo so diṭṭheva dhamme dukkhaṁ domanassaṁ paṭisaṁvedayatī’ti.",
    "sn42.13:6": "Dissati kho pana, gāmaṇi, idhekacco mālī kuṇḍalī sunhāto suvilitto kappitakesamassu itthikāmehi rājā maññe paricārento. Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso kiṁ akāsi mālī kuṇḍalī sunhāto suvilitto kappitakesamassu itthikāmehi rājā maññe paricāretī’ti? Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso rañño paccatthikaṁ pasayha jīvitā voropesi. Tassa rājā attamano abhihāramadāsi. Tenāyaṁ puriso mālī kuṇḍalī sunhāto suvilitto kappitakesamassu, itthikāmehi rājā maññe paricāretī’ti.",
    "sn42.13:7": "Dissati kho, gāmaṇi, idhekacco daḷhāya rajjuyā pacchābāhaṁ gāḷhabandhanaṁ bandhitvā khuramuṇḍaṁ karitvā kharassarena paṇavena rathiyāya rathiyaṁ siṅghāṭakena siṅghāṭakaṁ parinetvā, dakkhiṇena dvārena nikkhāmetvā, dakkhiṇato nagarassa sīsaṁ chijjamāno. Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso kiṁ akāsi, daḷhāya rajjuyā pacchābāhaṁ gāḷhabandhanaṁ bandhitvā khuramuṇḍaṁ karitvā kharassarena paṇavena rathiyāya rathiyaṁ siṅghāṭakena siṅghāṭakaṁ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṁ chindatī’ti? Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso rājaverī itthiṁ vā purisaṁ vā jīvitā voropesi, tena naṁ rājāno gahetvā evarūpaṁ kammakāraṇaṁ kārentī’ti.",
    "sn42.13:8": "Taṁ kiṁ maññasi, gāmaṇi, api nu te evarūpaṁ diṭṭhaṁ vā sutaṁ vā\"ti?",
    "sn42.13:9": "\"Dissati kho pana, gāmaṇi, idhekacco mālī kuṇḍalī … pe … itthikāmehi rājā maññe paricārento. Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso kiṁ akāsi mālī kuṇḍalī … pe … itthikāmehi rājā maññe paricāretī’ti? Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso rañño paccatthikassa pasayha ratanaṁ ahāsi. Tassa rājā attamano abhihāramadāsi. Tenāyaṁ puriso mālī kuṇḍalī … pe … itthikāmehi rājā maññe paricāretī’ti.",
    "sn42.13:10": "Dissati kho, gāmaṇi, idhekacco daḷhāya rajjuyā … pe … dakkhiṇato nagarassa sīsaṁ chijjamāno tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso kiṁ akāsi daḷhāya rajjuyā … pe … dakkhiṇato nagarassa sīsaṁ chindatī’ti? Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso gāmā vā araññā vā adinnaṁ theyyasaṅkhātaṁ ādiyi. Tena naṁ rājāno gahetvā evarūpaṁ kammakāraṇaṁ kārentī’ti.",
    "sn42.13:11": "\"Dissati kho pana, gāmaṇi, idhekacco mālī kuṇḍalī … pe … itthikāmehi rājā maññe paricārento. Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso kiṁ akāsi mālī kuṇḍalī … pe … itthikāmehi rājā maññe paricāretī’ti? Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso rañño paccatthikassa dāresu cārittaṁ āpajji. Tassa rājā attamano abhihāramadāsi. Tenāyaṁ puriso mālī kuṇḍalī … pe … itthikāmehi rājā maññe paricāretī’ti.",
    "sn42.13:12": "Dissati kho, gāmaṇi, idhekacco daḷhāya rajjuyā … pe … dakkhiṇato nagarassa sīsaṁ chijjamāno. Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso kiṁ akāsi daḷhāya rajjuyā … pe … dakkhiṇato nagarassa sīsaṁ chindatī’ti? Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso kulitthīsu kulakumārīsu cārittaṁ āpajji, tena naṁ rājāno gahetvā evarūpaṁ kammakāraṇaṁ kārentī’ti.",
    "sn42.13:13": "\"Dissati kho pana, gāmaṇi, idhekacco mālī kuṇḍalī sunhāto suvilitto kappitakesamassu itthikāmehi rājā maññe paricārento. Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso kiṁ akāsi mālī kuṇḍalī sunhāto suvilitto kappitakesamassu itthikāmehi rājā maññe paricāretī’ti? Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso rājānaṁ musāvādena hāsesi. Tassa rājā attamano abhihāramadāsi. Tenāyaṁ puriso mālī kuṇḍalī sunhāto suvilitto kappitakesamassu itthikāmehi rājā maññe paricāretī’ti.",
    "sn42.13:14": "Dissati kho, gāmaṇi, idhekacco daḷhāya rajjuyā pacchābāhaṁ gāḷhabandhanaṁ bandhitvā khuramuṇḍaṁ karitvā kharassarena paṇavena rathiyāya rathiyaṁ siṅghāṭakena siṅghāṭakaṁ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṁ chijjamāno. Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso kiṁ akāsi daḷhāya rajjuyā pacchābāhaṁ gāḷhabandhanaṁ bandhitvā khuramuṇḍaṁ karitvā kharassarena paṇavena rathiyāya rathiyaṁ siṅghāṭakena siṅghāṭakaṁ parinetvā, dakkhiṇena dvārena nikkhāmetvā, dakkhiṇato nagarassa sīsaṁ chindatī’ti? Tamenaṁ evamāhaṁsu: ‘ambho, ayaṁ puriso gahapatissa vā gahapatiputtassa vā musāvādena atthaṁ bhañji, tena naṁ rājāno gahetvā evarūpaṁ kammakāraṇaṁ kārentī’ti.",
    "sn42.13:15": "\"Acchariyaṁ, bhante, abbhutaṁ, bhante. Atthi me, bhante, āvasathāgāraṁ. Tattha atthi mañcakāni, atthi āsanāni, atthi udakamaṇiko, atthi telappadīpo. Tattha yo samaṇo vā brāhmaṇo vā vāsaṁ upeti, tenāhaṁ yathāsatti yathābalaṁ saṁvibhajāmi. Bhūtapubbaṁ, bhante, cattāro satthāro nānādiṭṭhikā nānākhantikā nānārucikā, tasmiṁ āvasathāgāre vāsaṁ upagacchuṁ.",
    "sn42.13:16": "Eko satthā evaṁvādī evaṁdiṭṭhi: ‘Natthi dinnaṁ, natthi yiṭṭhaṁ, natthi hutaṁ, natthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko. Natthi ayaṁ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṁ parañca lokaṁ sayaṁ abhiññā sacchikatvā pavedentī’ti.",
    "sn42.13:17": "Eko satthā evaṁvādī evaṁdiṭṭhi: ‘atthi dinnaṁ, atthi yiṭṭhaṁ, atthi hutaṁ, atthi sukatadukkaṭānaṁ kammānaṁ phalaṁ vipāko, atthi ayaṁ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā, ye imañca lokaṁ parañca lokaṁ sayaṁ abhiññā sacchikatvā pavedentī’ti.",
    "sn42.13:18": "Eko satthā evaṁvādī evaṁdiṭṭhi: ‘karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇamatipātayato, adinnaṁ ādiyato, sandhiṁ chindato, nillopaṁ harato, ekāgārikaṁ karoto, paripanthe tiṭṭhato, paradāraṁ gacchato, musā bhaṇato, karoto na karīyati pāpaṁ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekaṁ maṁsakhalaṁ ekaṁ maṁsapuñjaṁ kareyya, natthi tatonidānaṁ pāpaṁ, natthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṁ gaccheyya hananto ghātento chindanto chedāpento pacanto pācāpento, natthi tatonidānaṁ pāpaṁ, natthi pāpassa āgamo. Uttarāñcepi gaṅgāya tīraṁ gaccheyya dadanto dāpento yajanto yajāpento, natthi tatonidānaṁ puññaṁ, natthi puññassa āgamo. Dānena damena saṁyamena saccavajjena natthi puññaṁ, natthi puññassa āgamo’ti.",
    "sn42.13:19": "Eko satthā evaṁvādī evaṁdiṭṭhi: ‘karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇamatipātayato, adinnaṁ ādiyato, sandhiṁ chindato, nillopaṁ harato, ekāgārikaṁ karoto, paripanthe tiṭṭhato, paradāraṁ gacchato, musā bhaṇato, karoto karīyati pāpaṁ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekaṁ maṁsakhalaṁ ekaṁ maṁsapuñjaṁ kareyya, atthi tatonidānaṁ pāpaṁ, atthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṁ gaccheyya hananto ghātento chindanto chedāpento pacanto pācāpento, atthi tatonidānaṁ pāpaṁ, atthi pāpassa āgamo. Uttarāñcepi gaṅgāya tīraṁ gaccheyya dadanto dāpento, yajanto yajāpento, atthi tatonidānaṁ puññaṁ, atthi puññassa āgamo. Dānena damena saṁyamena saccavajjena atthi puññaṁ, atthi puññassa āgamo’ti.",
    "sn42.13:20": "Tassa mayhaṁ, bhante, ahudeva kaṅkhā, ahu vicikicchā: ‘kosu nāma imesaṁ bhavataṁ samaṇabrāhmaṇānaṁ saccaṁ āha, ko musā’\"ti?",
    "sn42.13:21": "\"Alañhi te, gāmaṇi, kaṅkhītuṁ, alaṁ vicikicchituṁ. Kaṅkhanīye ca pana te ṭhāne vicikicchā uppannā\"ti.",
    "sn42.13:22": "\"Atthi, gāmaṇi, dhammasamādhi. Tatra ce tvaṁ cittasamādhiṁ paṭilabheyyāsi. Evaṁ tvaṁ imaṁ kaṅkhādhammaṁ pajaheyyāsi. Katamo ca, gāmaṇi, dhammasamādhi?",
    "sn42.13:23": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ, iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati.",
    "sn42.13:24": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ, iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati.",
    "sn42.13:25": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ, iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati.",
    "sn42.13:26": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ, iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati.",
    "sn42.13:27": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato karuṇāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati … pe … muditāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati … pe … .",
    "sn42.13:28": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ, iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati.",
    "sn42.13:29": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ, iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati.",
    "sn42.13:30": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ, iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati.",
    "sn42.13:31": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ, iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati.",
    "sn42.13:32": "Evaṁ vutte, pāṭaliyo gāmaṇi bhagavantaṁ etadavoca: \"Abhikkantaṁ, bhante, abhikkantaṁ, bhante … pe … ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti.",
    "sn42.13:33": "Caṇḍo puṭo yodhājīvo,Hatthasso asibandhako;Desanā saṅkhakulaṁ maṇicūḷaṁ,Bhadrarāsiyapāṭalīti."
}