{
    "sn42.8:1": "Ekaṁ samayaṁ bhagavā nāḷandāyaṁ vihārati pāvārikambavane. Atha kho asibandhakaputto gāmaṇi nigaṇṭhasāvako yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho asibandhakaputtaṁ gāmaṇiṁ bhagavā etadavoca:",
    "sn42.8:2": "Taṁ kiṁ maññasi, gāmaṇi, yo so puriso pāṇātipātī rattiyā vā divasassa vā samayāsamayaṁ upādāya, katamo bahutaro samayo, yaṁ vā so pāṇamatipāteti, yaṁ vā so pāṇaṁ nātipātetī\"ti?",
    "sn42.8:3": "Taṁ kiṁ maññasi, gāmaṇi, yo so puriso adinnādāyī rattiyā vā divasassa vā samayāsamayaṁ upādāya, katamo bahutaro samayo, yaṁ vā so adinnaṁ ādiyati, yaṁ vā so adinnaṁ nādiyatī\"ti.",
    "sn42.8:4": "Taṁ kiṁ maññasi, gāmaṇi, yo so puriso kāmesumicchācārī rattiyā vā divasassa vā samayāsamayaṁ upādāya, katamo bahutaro samayo, yaṁ vā so kāmesu micchā carati, yaṁ vā so kāmesu micchā na caratī\"ti?",
    "sn42.8:5": "Taṁ kiṁ maññasi, gāmaṇi, yo so puriso musāvādī rattiyā vā divasassa vā samayāsamayaṁ upādāya, katamo bahutaro samayo, yaṁ vā so musā bhaṇati, yaṁ vā so musā na bhaṇatī\"ti?",
    "sn42.8:6": "Idha, gāmaṇi, ekacco satthā evaṁvādī hoti evaṁdiṭṭhi: ‘yo koci pāṇamatipāteti, sabbo so āpāyiko nerayiko, yo koci adinnaṁ ādiyati, sabbo so āpāyiko nerayiko, yo koci kāmesu micchā carati, sabbo so āpāyiko nerayiko, yo koci musā bhaṇati, sabbo so āpāyiko nerayiko’ti. Tasmiṁ kho pana, gāmaṇi, satthari sāvako abhippasanno hoti. Tassa evaṁ hoti: ‘mayhaṁ kho satthā evaṁvādī evaṁdiṭṭhi – yo koci pāṇamatipāteti, sabbo so āpāyiko nerayikoti. Atthi kho pana mayā pāṇo atipātito, ahampamhi āpāyiko nerayikoti diṭṭhiṁ paṭilabhati. Taṁ, gāmaṇi, vācaṁ appahāya taṁ cittaṁ appahāya taṁ diṭṭhiṁ appaṭinissajjitvā yathābhataṁ nikkhitto evaṁ niraye.",
    "sn42.8:7": "Idha pana, gāmaṇi, tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. So anekapariyāyena pāṇātipātaṁ garahati vigarahati, ‘pāṇātipātā viramathā’ti cāha. Adinnādānaṁ garahati vigarahati, ‘adinnādānā viramathā’ti cāha. Kāmesumicchācāraṁ garahati, vigarahati ‘kāmesumicchācārā viramathā’ti cāha. Musāvādaṁ garahati vigarahati ‘musāvādā viramathā’ti cāha.",
    "sn42.8:8": "‘Bhagavā kho anekapariyāyena adinnādānaṁ garahati vigarahati, adinnādānā viramathāti cāha. Atthi kho pana mayā adinnaṁ ādinnaṁ yāvatakaṁ vā tāvatakaṁ vā. Yaṁ kho pana mayā adinnaṁ ādinnaṁ yāvatakaṁ vā tāvatakaṁ vā taṁ na suṭṭhu, taṁ na sādhu. Ahañceva kho pana tappaccayā vippaṭisārī assaṁ, na metaṁ pāpaṁ kammaṁ akataṁ bhavissatī’ti. So iti paṭisaṅkhāya tañceva adinnādānaṁ pajahati. Āyatiñca adinnādānā paṭivirato hoti. Evametassa pāpassa kammassa pahānaṁ hoti. Evametassa pāpassa kammassa samatikkamo hoti.",
    "sn42.8:9": "‘Bhagavā kho pana anekapariyāyena kāmesumicchācāraṁ garahati vigarahati, kāmesumicchācārā viramathāti cāha. Atthi kho pana mayā kāmesu micchā ciṇṇaṁ yāvatakaṁ vā tāvatakaṁ vā. Yaṁ kho pana mayā kāmesu micchā ciṇṇaṁ yāvatakaṁ vā tāvatakaṁ vā taṁ na suṭṭhu, taṁ na sādhu. Ahañceva kho pana tappaccayā vippaṭisārī assaṁ, na metaṁ pāpaṁ kammaṁ akataṁ bhavissatī’ti. So iti paṭisaṅkhāya tañceva kāmesumicchācāraṁ pajahati, āyatiñca kāmesumicchācārā paṭivirato hoti. Evametassa pāpassa kammassa pahānaṁ hoti. Evametassa pāpassa kammassa samatikkamo hoti.",
    "sn42.8:10": "‘Bhagavā kho pana anekapariyāyena musāvādaṁ garahati vigarahati, musāvādā viramathāti cāha. Atthi kho pana mayā musā bhaṇitaṁ yāvatakaṁ vā tāvatakaṁ vā. Yaṁ kho pana mayā musā bhaṇitaṁ yāvatakaṁ vā tāvatakaṁ vā taṁ na suṭṭhu, taṁ na sādhu. Ahañceva kho pana tappaccayā vippaṭisārī assaṁ, na metaṁ pāpaṁ kammaṁ akataṁ bhavissatī’ti. So iti paṭisaṅkhāya tañceva musāvādaṁ pajahati, āyatiñca musāvādā paṭivirato hoti. Evametassa pāpassa kammassa pahānaṁ hoti. Evametassa pāpassa kammassa samatikkamo hoti.",
    "sn42.8:11": "So pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti. Adinnādānaṁ pahāya adinnādānā paṭivirato hoti. Kāmesumicchācāraṁ pahāya kāmesumicchācārā paṭivirato hoti. Musāvādaṁ pahāya musāvādā paṭivirato hoti. Pisuṇaṁ vācaṁ pahāya pisuṇāya vācāya paṭivirato hoti. Pharusaṁ vācaṁ pahāya pharusāya vācāya paṭivirato hoti. Samphappalāpaṁ pahāya samphappalāpā paṭivirato hoti. Abhijjhaṁ pahāya anabhijjhālu hoti. Byā pāda ppadosaṁ pahāya abyāpannacitto hoti. Micchādiṭṭhiṁ pahāya sammādiṭṭhiko hoti.",
    "sn42.8:12": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati. Seyyathāpi, gāmaṇi, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya; evameva kho, gāmaṇi, evaṁ bhāvitāya mettāya cetovimuttiyā evaṁ bahulīkatāya yaṁ pamāṇakataṁ kammaṁ, na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati.",
    "sn42.8:13": "Sa kho so, gāmaṇi, ariyasāvako evaṁ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato karuṇāsahagatena cetasā … pe … muditāsahagatena cetasā … pe … . Upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā vihārati, tathā dutiyaṁ, tathā tatiyaṁ, tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihārati. Seyyathāpi, gāmaṇi, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya; evameva kho, gāmaṇi, evaṁ bhāvitāya upekkhāya cetovimuttiyā evaṁ bahulīkatāya yaṁ pamāṇakataṁ kammaṁ na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhatī\"ti.",
    "sn42.8:14": "Evaṁ vutte, asibandhakaputto gāmaṇi bhagavantaṁ etadavoca: \"Abhikkantaṁ, bhante, abhikkantaṁ, bhante … pe … upāsakaṁ maṁ bhagavā dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}