{
    "sn42.6:1": "Ekaṁ samayaṁ bhagavā nāḷandāyaṁ vihārati pāvārikambavane. Atha kho asibandhakaputto gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho asibandhakaputto gāmaṇi bhagavantaṁ etadavoca:",
    "sn42.6:2": "\"brāhmaṇā, bhante, pacchā bhūmakā kāmaṇḍalukā sevālamālikā udakorohakā aggiparicārakā. Te mataṁ kālaṅkataṁ uyyāpenti nāma saññāpenti nāma saggaṁ nāma okkāmenti. Bhagavā pana, bhante, arahaṁ sammāsambuddho pahoti tathā kātuṁ yathā sabbo loko kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjeyyā\"ti?",
    "sn42.6:3": "\"Tena hi, gāmaṇi, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṁ byākareyyāsīti.",
    "sn42.6:4": "Taṁ kiṁ maññasi, gāmaṇi, idhassa puriso pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco samphappalāpī abhijjhālu byāpannacitto micchādiṭṭhiko. Tamenaṁ mahājanakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya: ‘Ayaṁ puriso kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjatū’ti. Taṁ kiṁ maññasi, gāmaṇi, api nu so puriso mahato janakāyassa āyācanahetu vā thomanahetu vā pañjalikā anuparisakkanahetu vā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjeyyā\"ti?",
    "sn42.6:5": "\"Seyyathāpi, gāmaṇi, puriso mahatiṁ puthusīlaṁ gambhīre udakarahade pakkhipeyya. Tamenaṁ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya: ‘ummujja, bho puthusile, uplava, bho puthusile, thalamuplava, bho puthusile’ti. Taṁ kiṁ maññasi, gāmaṇi, api nu sā puthusilā mahato janakāyassa āyācanahetu vā thomanahetu vā pañjalikā anuparisakkanahetu vā ummujjeyya vā uplaveyya vā thalaṁ vā uplaveyyā\"ti?",
    "sn42.6:6": "Taṁ kiṁ maññasi, gāmaṇi, idhassa puriso pāṇātipātā paṭivirato adinnādānā paṭivirato kāmesumicchācārā paṭivirato musāvādā paṭivirato pisuṇāya vācāya paṭivirato pharusāya vācāya paṭivirato samphappalāpā paṭivirato anabhijjhālu abyāpannacitto sammādiṭṭhiko. Tamenaṁ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya: ‘Ayaṁ puriso kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjatū’ti. Taṁ kiṁ maññasi, gāmaṇi, api nu so puriso mahato janakāyassa āyācanahetu vā thomanahetu vā pañjalikā anuparisakkanahetu vā kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjeyyā\"ti?",
    "sn42.6:7": "\"Seyyathāpi, gāmaṇi, puriso sappikumbhaṁ vā telakumbhaṁ vā gambhīre udakarahade ogāhetvā bhindeyya. Tatra yāssa sakkharā vā kaṭhalā vā sā adhogāmī assa; yañca khvassa tatra sappi vā telaṁ vā taṁ uddhaṁ gāmi assa. Tamenaṁ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya: ‘osīda, bho sappitela, saṁsīda, bho sappitela, adho gaccha, bho sappitelā’ti. Taṁ kiṁ maññasi, gāmaṇi, api nu taṁ sappitelaṁ mahato janakāyassa āyācanahetu vā thomanahetu vā pañjalikā anuparisakkanahetu vā osīdeyya vā saṁsīdeyya vā adho vā gaccheyyā\"ti?",
    "sn42.6:8": "\"Evameva kho, gāmaṇi, yo so puriso pāṇātipātā paṭivirato, adinnādānā paṭivirato, kāmesumicchācārā paṭivirato, musāvādā paṭivirato, pisuṇāya vācāya paṭivirato, pharusāya vācāya paṭivirato, samphappalāpā paṭivirato, anabhijjhālu, abyāpannacitto, sammādiṭṭhiko, kiñcāpi taṁ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya: ‘Ayaṁ puriso kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjatū’ti, atha kho so puriso kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjeyyā\"ti."
}