{
    "sn43.12:pe …1": "\"Asaṅkhatañca vo, bhikkhave, desessāmi asaṅkhatagāmiñca maggaṁ. Taṁ suṇātha.",
    "sn43.12:2": "Asaṅkhatañca vo, bhikkhave, desessāmi asaṅkhatagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, asaṅkhataṁ? Yo, bhikkhave, rāgakkhayo dosakkhayo mohakkhayo – idaṁ vuccati, bhikkhave, asaṅkhataṁ. Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Vipassanā. Ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo. Iti kho, bhikkhave, desitaṁ vo mayā asaṅkhataṁ … pe … ayaṁ vo amhākaṁ anusāsanīti. (1.)",
    "sn43.12:3": "Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Savitakko savicāro samādhi. Ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo … pe …",
    "sn43.12:4": "Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Suññato samādhi. Ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo … pe …",
    "sn43.12:5": "Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Idha, bhikkhave, bhikkhu kāye kāyānupassī vihārati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṁ. Ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo … pe …",
    "sn43.12:6": "Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Idha, bhikkhave, bhikkhu anuppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ anuppādāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati. Ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo … pe …",
    "sn43.12:7": "Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Idha, bhikkhave, bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṁ iddhi pāda ṁ bhāveti. Ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo … pe …",
    "sn43.12:8": "Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Idha, bhikkhave, bhikkhu saddhindriyaṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ. Ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo … pe …",
    "sn43.12:9": "Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Idha, bhikkhave, bhikkhu saddhābalaṁ bhāveti vivekanissitaṁ … pe … ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo … pe …",
    "sn43.12:10": "Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Idha, bhikkhave, bhikkhu satisambojjhaṅgaṁ bhāveti vivekanissitaṁ … pe … ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo … pe …",
    "sn43.12:11": "Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Idha, bhikkhave, bhikkhu sammādiṭṭhiṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ. Ayaṁ vuccati, bhikkhave, asaṅkhatagāmimaggo … pe …"
}