{
    "sn43.14-43:1": "\"Anāsavañca vo, bhikkhave, desessāmi anāsavagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, anāsavaṁ … pe … .(3)",
    "sn43.14-43:2": "Saccañca vo, bhikkhave, desessāmi saccagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, saccaṁ … pe … .(4)",
    "sn43.14-43:3": "Pārañca vo, bhikkhave, desessāmi pāragāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, pāraṁ … pe … .(5)",
    "sn43.14-43:4": "Nipuṇañca vo, bhikkhave, desessāmi nipuṇagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, nipuṇaṁ … pe … .(6)",
    "sn43.14-43:5": "Sududdasañca vo, bhikkhave, desessāmi sududdasagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, sududdasaṁ … pe … .(7)",
    "sn43.14-43:6": "Ajajjarañca vo, bhikkhave, desessāmi ajajjaragāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, ajajjaraṁ … pe … .(8)",
    "sn43.14-43:7": "Dhuvañca vo, bhikkhave, desessāmi dhuvagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, dhuvaṁ … pe … .(9)",
    "sn43.14-43:8": "Apalokitañca vo, bhikkhave, desessāmi apalokitagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, apalokitaṁ … pe … .(10)",
    "sn43.14-43:9": "Anidassanañca vo, bhikkhave, desessāmi anidassanagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, anidassanaṁ … pe … .(11)",
    "sn43.14-43:10": "Nippapañcañca vo, bhikkhave, desessāmi nippapañcagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, nippapañcaṁ … pe … ?(12)",
    "sn43.14-43:11": "Santañca vo, bhikkhave, desessāmi santagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, santaṁ … pe … .(13)",
    "sn43.14-43:12": "Amatañca vo, bhikkhave, desessāmi amatagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, amataṁ … pe … .(14)",
    "sn43.14-43:13": "Paṇītañca vo, bhikkhave, desessāmi paṇītagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, paṇītaṁ … pe … .(15)",
    "sn43.14-43:14": "Sivañca vo, bhikkhave, desessāmi sivagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, sivaṁ … pe … .(16)",
    "sn43.14-43:15": "Khemañca vo, bhikkhave, desessāmi khemagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, khemaṁ … pe … .(17)",
    "sn43.14-43:16": "Taṇhākkhayañca vo, bhikkhave, desessāmi taṇhākkhayagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, taṇhākkhayaṁ … pe … ?(18)",
    "sn43.14-43:17": "Acchariyañca vo, bhikkhave, desessāmi acchariyagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, acchariyaṁ … pe … .(19)",
    "sn43.14-43:18": "Abbhutañca vo, bhikkhave, desessāmi abbhutagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, abbhutaṁ … pe … .(20)",
    "sn43.14-43:19": "Anītikañca vo, bhikkhave, desessāmi anītikagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, anītikaṁ … pe … .(21)",
    "sn43.14-43:20": "Anītikadhammañca vo, bhikkhave, desessāmi anītikadhammagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, anītikadhammaṁ … pe … .(22)",
    "sn43.14-43:21": "Nibbānañca vo, bhikkhave, desessāmi nibbānagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, nibbānaṁ … pe … .(23)",
    "sn43.14-43:22": "Abyābajjhañca vo, bhikkhave, desessāmi abyābajjhagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, abyābajjhaṁ … pe … .(24)",
    "sn43.14-43:23": "Virāgañca vo, bhikkhave, desessāmi virāgagāmiñca maggaṁ. Taṁ suṇātha. Katamo ca, bhikkhave, virāgo … pe … ?(25)",
    "sn43.14-43:24": "Suddhiñca vo, bhikkhave, desessāmi suddhigāmiñca maggaṁ. Taṁ suṇātha. Katamā ca, bhikkhave, suddhi … pe … .(26)",
    "sn43.14-43:25": "Muttiñca vo, bhikkhave, desessāmi muttigāmiñca maggaṁ. Taṁ suṇātha. Katamā ca, bhikkhave, mutti … pe … .(27)",
    "sn43.14-43:26": "Anālayañca vo, bhikkhave, desessāmi anālayagāmiñca maggaṁ. Taṁ suṇātha. Katamo ca, bhikkhave, anālayo … pe … .(28)",
    "sn43.14-43:27": "Dīpañca vo, bhikkhave, desessāmi dīpagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, dīpaṁ … pe … .(29)",
    "sn43.14-43:28": "Leṇañca vo, bhikkhave, desessāmi leṇagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, leṇaṁ … pe … .(30)",
    "sn43.14-43:29": "Tāṇañca vo, bhikkhave, desessāmi tāṇagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, tāṇaṁ … pe … .(31)",
    "sn43.14-43:30": "Saraṇañca vo, bhikkhave, desessāmi saraṇagāmiñca maggaṁ. Taṁ suṇātha. Katamañca, bhikkhave, saraṇaṁ … pe … .(32)"
}