{
    "sn44.7:1": "Atha kho vacchagotto paribbājako yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahāmoggallānena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho vacchagotto paribbājako āyasmantaṁ mahāmoggallānaṁ etadavoca:",
    "sn44.7:2": "\"Kiṁ nu kho, bho moggallāna, sassato loko\"ti?",
    "sn44.7:3": "\"Ko nu kho, bho moggallāna, hetu ko paccayo, yena aññatitthiyānaṁ paribbājakānaṁ evaṁ puṭṭhānaṁ evaṁ veyyākaraṇaṁ hoti – sassato lokoti vā, asassato lokoti vā, antavā lokoti vā, anantavā lokoti vā, taṁ jīvaṁ taṁ sarīranti vā, aññaṁ jīvaṁ aññaṁ sarīranti vā, hoti tathāgato paraṁ maraṇāti vā, na hoti tathāgato paraṁ maraṇāti vā, hoti ca na ca hoti tathāgato paraṁ maraṇāti vā, neva hoti na na hoti tathāgato paraṁ maraṇāti vā? Ko pana, bho moggallāna, hetu ko paccayo, yena samaṇassa gotamassa evaṁ puṭṭhassa na evaṁ veyyākaraṇaṁ hoti – sassato lokotipi, asassato lokotipi, antavā lokotipi, anantavā lokotipi, taṁ jīvaṁ taṁ sarīrantipi, aññaṁ jīvaṁ aññaṁ sarīrantipi, hoti tathāgato paraṁ maraṇātipi, na hoti tathāgato paraṁ maraṇātipi, hoti ca na ca hoti tathāgato paraṁ maraṇātipi, neva hoti na na hoti tathāgato paraṁ maraṇātipī\"ti?",
    "sn44.7:4": "\"Aññatitthiyā kho, vaccha, paribbājakā cakkhuṁ ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassanti … pe … jivhaṁ ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassanti … pe … manaṁ ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassanti. Tasmā aññatitthiyānaṁ paribbājakānaṁ evaṁ puṭṭhānaṁ evaṁ veyyākaraṇaṁ hoti – sassato lokoti vā … pe … neva hoti na na hoti tathāgato paraṁ maraṇāti vā. Tathāgato ca kho, vaccha, arahaṁ sammāsambuddho cakkhuṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassati … pe … jivhaṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassati … pe … manaṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassati. Tasmā tathāgatassa evaṁ puṭṭhassa na evaṁ veyyākaraṇaṁ hoti – sassato lokotipi … pe … neva hoti na na hoti tathāgato paraṁ maraṇātipī\"ti.",
    "sn44.7:5": "Atha kho vacchagotto paribbājako uṭṭhāyāsanā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho vacchagotto paribbājako bhagavantaṁ etadavoca:",
    "sn44.7:6": "\"Ko nu kho, bho gotama, hetu ko paccayo, yena aññatitthiyānaṁ paribbājakānaṁ evaṁ puṭṭhānaṁ evaṁ veyyākaraṇaṁ hoti: ‘sassato loko’ti vā … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’ti vā? Ko pana, bho gotama, hetu ko paccayo, yena bhoto gotamassa evaṁ puṭṭhassa na evaṁ veyyākaraṇaṁ hoti: ‘sassato loko’tipi … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipī\"ti?",
    "sn44.7:7": "\"Aññatitthiyā kho, vaccha, paribbājakā cakkhuṁ ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassanti … pe … jivhaṁ ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassanti … pe … manaṁ ‘etaṁ mama, esohamasmi, eso me attā’ti samanupassanti. Tasmā aññatitthiyānaṁ paribbājakānaṁ evaṁ puṭṭhānaṁ evaṁ veyyākaraṇaṁ hoti: ‘sassato loko’ti vā … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’ti vā. Tathāgato ca kho, vaccha, arahaṁ sammāsambuddho cakkhuṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassati … pe … jivhaṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassati … pe … manaṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti samanupassati. Tasmā tathāgatassa evaṁ puṭṭhassa na evaṁ veyyākaraṇaṁ hoti: ‘sassato loko’tipi, ‘asassato loko’tipi, ‘antavā loko’tipi, ‘anantavā loko’tipi, ‘taṁ jīvaṁ taṁ sarīran’tipi, ‘aññaṁ jīvaṁ aññaṁ sarīran’tipi, ‘hoti tathāgato paraṁ maraṇā’tipi, ‘Na hoti tathāgato paraṁ maraṇā’tipi, ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’tipi, ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipī\"ti.",
    "sn44.7:8": "\"Acchariyaṁ, bho gotama, abbhutaṁ, bho gotama. Yatra hi nāma satthu ca sāvakassa ca atthena attho byañjanena byañjanaṁ saṁsandissati samessati na virodhayissati, yadidaṁ aggapadasmiṁ. Idānāhaṁ, bho gotama, samaṇaṁ mahāmoggallānaṁ upasaṅkamitvā etamatthaṁ apucchiṁ. Samaṇopi me moggallāno etehi padehi etehi byañjanehi tamatthaṁ byākāsi, seyyathāpi bhavaṁ gotamo. Acchariyaṁ, bho gotama, abbhutaṁ, bho gotama. Yatra hi nāma satthu ca sāvakassa ca atthena attho byañjanena byañjanaṁ saṁsandissati samessati na virodhayissati, yadidaṁ aggapadasmin\"ti."
}