{
    "sn44.9:1": "Atha kho vacchagotto paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho vacchagotto paribbājako bhagavantaṁ etadavoca:",
    "sn44.9:2": "\"Purimāni, bho gotama, divasāni purimatarāni sambahulānaṁ nānātitthiyānaṁ samaṇabrāhmaṇānaṁ paribbājakānaṁ kutūhalasālāyaṁ sannisinnānaṁ sannipatitānaṁ ayamantarākathā udapādi: ‘Ayaṁ kho pūraṇo kassapo saṅghī ceva gaṇī ca gaṇācariyo ca ñāto yasassī titthakaro sādhusammato bahujanassa. Sopi sāvakaṁ abbhatītaṁ kālaṅkataṁ upapattīsu byākaroti: \"asu amutra upapanno, asu amutra upapanno\"ti. Yopissa sāvako uttamapuriso paramapuriso paramapattipatto tampi sāvakaṁ abbhatītaṁ kālaṅkataṁ upapattīsu byākaroti: \"asu amutra upapanno, asu amutra upapanno\"ti.",
    "sn44.9:3": "Ayampi kho makkhali gosālo … pe … ayampi kho nigaṇṭho nāṭaputto … pe … ayampi kho sañcayo belaṭṭhaputto … pe … ayampi kho pakudho kaccāno … pe … ayampi kho ajito kesakambalo saṅghī ceva gaṇī ca gaṇācariyo ca ñāto yasassī titthakaro sādhusammato bahujanassa. Sopi sāvakaṁ abbhatītaṁ kālaṅkataṁ upapattīsu byākaroti: \"asu amutra upapanno, asu amutra upapanno\"ti. Yopissa sāvako uttamapuriso paramapuriso paramapattipatto tampi sāvakaṁ abbhatītaṁ kālaṅkataṁ upapattīsu byākaroti: \"asu amutra upapanno, asu amutra upapanno\"’ti.",
    "sn44.9:4": "Ayampi kho samaṇo gotamo saṅghī ceva gaṇī ca gaṇācariyo ca ñāto yasassī titthakaro sādhusammato bahujanassa. Sopi sāvakaṁ abbhatītaṁ kālaṅkataṁ upapattīsu byākaroti: ‘asu amutra upapanno, asu amutra upapanno’ti. Yopissa sāvako uttamapuriso paramapuriso paramapattipatto tañca sāvakaṁ abbhatītaṁ kālaṅkataṁ upapattīsu na byākaroti: ‘asu amutra upapanno, asu amutra upapanno’ti. Api ca kho naṁ evaṁ byākaroti: ‘acchecchi taṇhāṁ, vivattayi saṁyojanaṁ, sammā mānābhisamayā antamakāsi dukkhassā’ti.",
    "sn44.9:5": "\"Alañhi te, vaccha, kaṅkhītuṁ, alaṁ vicikicchituṁ. Kaṅkhanīye ca pana te ṭhāne vicikicchā uppannā. Saupādānassa khvāhaṁ, vaccha, upapattiṁ paññāpemi no anupādānassa. Seyyathāpi, vaccha, aggi saupādāno jalati, no anupādāno; evameva khvāhaṁ, vaccha, saupādānassa upapattiṁ paññāpemi, no anupādānassā\"ti.",
    "sn44.9:6": "\"Yasmiṁ, bho gotama, samaye acci vātena khittā dūrampi gacchati, imassa pana bhavaṁ gotamo kiṁ upādānasmiṁ paññāpetī\"ti?"
}