{
    "sn44.1:1": "Ekaṁ samayaṁ bhagavā sāvatthiyaṁ vihārati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena khemā bhikkhunī kosalesu cārikaṁ caramānā antarā ca sāvatthiṁ antarā ca sāketaṁ toraṇavatthusmiṁ vāsaṁ upagatā hoti. Atha kho rājā pasenadi kosalo sāketā sāvatthiṁ gacchanto, antarā ca sāketaṁ antarā ca sāvatthiṁ toraṇavatthusmiṁ ekarattivāsaṁ upagacchi. Atha kho rājā pasenadi kosalo aññataraṁ purisaṁ āmantesi: \"ehi tvaṁ, ambho purisa, toraṇavatthusmiṁ tathārūpaṁ samaṇaṁ vā brāhmaṇaṁ vā jāna yamahaṁ ajja payirupāseyyan\"ti.",
    "sn44.1:2": "\"Evaṁ, devā\"ti kho so puriso rañño pasenadissa kosalassa paṭissutvā kevalakappaṁ toraṇavatthuṁ āhiṇḍanto nāddasa tathārūpaṁ samaṇaṁ vā brāhmaṇaṁ vā yaṁ rājā pasenadi kosalo payirupāseyya. Addasā kho so puriso khemaṁ bhikkhuniṁ toraṇavatthusmiṁ vāsaṁ upagataṁ. Disvāna yena rājā pasenadi kosalo tenupasaṅkami; upasaṅkamitvā rājānaṁ pasenadiṁ kosalaṁ etadavoca:",
    "sn44.1:3": "\"Natthi kho, deva, toraṇavatthusmiṁ tathārūpo samaṇo vā brāhmaṇo vā yaṁ devo payirupāseyya. Atthi ca kho, deva, khemā nāma bhikkhunī, tassa bhagavato sāvikā arahato sammāsambuddhassa. Tassā kho pana ayyāya evaṁ kalyāṇo kittisaddo abbhuggato: ‘paṇḍitā, viyattā medhāvinī bahussutā cittakathā kalyāṇapaṭibhānā’ti. Taṁ devo payirupāsatū\"ti.",
    "sn44.1:4": "Atha kho rājā pasenadi kosalo yena khemā bhikkhunī tenupasaṅkami; upasaṅkamitvā khemaṁ bhikkhuniṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho rājā pasenadi kosalo khemaṁ bhikkhuniṁ etadavoca:",
    "sn44.1:5": "\"‘Kiṁ nu kho, ayye, hoti tathāgato paraṁ maraṇā’ti, iti puṭṭhā samānā: ‘abyākataṁ kho etaṁ, mahārāja, bhagavatā – hoti tathāgato paraṁ maraṇā’ti vadesi. ‘Kiṁ panayye, na hoti tathāgato paraṁ maraṇā’ti iti puṭṭhā samānā: ‘etampi kho, mahārāja, abyākataṁ bhagavatā – na hoti tathāgato paraṁ maraṇā’ti vadesi. ‘Kiṁ nu kho, ayye, hoti ca na ca hoti tathāgato paraṁ maraṇā’ti iti puṭṭhā samānā: ‘abyākataṁ kho etaṁ, mahārāja, bhagavatā – hoti ca na ca hoti tathāgato paraṁ maraṇā’ti vadesi. ‘Kiṁ panayye, neva hoti na na hoti tathāgato paraṁ maraṇā’ti iti puṭṭhā samānā: ‘etampi kho, mahārāja, abyākataṁ bhagavatā – neva hoti na na hoti tathāgato paraṁ maraṇā’ti vadesi. Ko nu kho, ayye, hetu, ko paccayo yenetaṁ abyākataṁ bhagavatā\"ti?",
    "sn44.1:6": "\"Tena hi, mahārāja, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṁ byākareyyāsi. Taṁ kiṁ maññasi, mahārāja, atthi te koci gaṇako vā muddiko vā saṅkhāyako vā yo pahoti gaṅgāya vālukaṁ gaṇetuṁ – ettakā vālukā iti vā, ettakāni vālukasatāni iti vā, ettakāni vālukasahassāni iti vā, ettakāni vālukasatasahassāni iti vā\"ti?",
    "sn44.1:7": "Yāya vedanāya tathāgataṁ paññāpayamāno paññāpeyya, sā vedanā tathāgatassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anup pāda dhammā. Vedanāsaṅkhāyavimutto, mahārāja, tathāgato gambhīro appameyyo duppariyogāho – seyyathāpi mahāsamuddo. ‘Hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘Na hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipi na upeti.",
    "sn44.1:8": "Yāya saññāya tathāgataṁ … pe … yehi saṅkhārehi tathāgataṁ paññāpayamāno paññāpeyya, te saṅkhārā tathāgatassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anup pāda dhammā. Sankhārasaṅkhāyavimutto kho, mahārāja, tathāgato gambhīro appameyyo duppariyogāho – seyyathāpi mahāsamuddo. ‘Hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘Na hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipi na upeti.",
    "sn44.1:9": "Yena viññāṇena tathāgataṁ paññāpayamāno paññāpeyya taṁ viññāṇaṁ tathāgatassa pahīnaṁ ucchinnamūlaṁ tālāvatthukataṁ anabhāvaṅkataṁ āyatiṁ anup pāda dhammaṁ. Viññāṇasaṅkhāyavimutto kho, mahārāja, tathāgato gambhīro appameyyo duppariyogāho – seyyathāpi mahāsamuddo. ‘Hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘Na hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipi na upetī\"ti.",
    "sn44.1:10": "Atha kho rājā pasenadi kosalo aparena samayena yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho rājā pasenadi kosalo bhagavantaṁ etadavoca:",
    "sn44.1:11": "\"Tena hi, mahārāja, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṁ byākareyyāsi. Taṁ kiṁ maññasi, mahārāja, atthi te koci gaṇako vā muddiko vā saṅkhāyako vā yo pahoti gaṅgāya vālukaṁ gaṇetuṁ – ettakā vālukā iti vā … pe … ettakāni vālukasatasahassāni iti vā\"ti? \"No hetaṁ, bhante\". \"Atthi pana te koci gaṇako vā muddiko vā saṅkhāyako vā yo pahoti mahāsamudde udakaṁ gaṇetuṁ – ettakāni udakāḷhakāni iti vā … pe … ettakāni udakāḷhakasatasahassāni iti vā\"ti? \"No hetaṁ, bhante\". \"Taṁ kissa hetu\"? \"Mahā, bhante, samuddo gambhīro appameyyo duppariyogāho. Evameva kho, mahārāja, yena rūpena tathāgataṁ paññāpayamāno paññāpeyya, taṁ rūpaṁ tathāgatassa pahīnaṁ ucchinnamūlaṁ tālāvatthukataṁ anabhāvaṅkataṁ āyatiṁ anup pāda dhammaṁ. Rūpasaṅkhāyavimutto kho, mahārāja, tathāgato gambhīro appameyyo duppariyogāho – seyyathāpi mahāsamuddo. ‘Hoti tathāgato paraṁ maraṇā’tipi na upeti … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipi na upeti. Yāya vedanāya … pe … yāya saññāya … pe … yehi saṅkhārehi … pe … .",
    "sn44.1:12": "Yena viññāṇena tathāgataṁ paññāpayamāno paññāpeyya, taṁ viññāṇaṁ tathāgatassa pahīnaṁ ucchinnamūlaṁ tālāvatthukataṁ anabhāvaṅkataṁ āyatiṁ anup pāda dhammaṁ. Viññāṇasaṅkhāyavimutto kho, mahārāja, tathāgato gambhīro appameyyo duppariyogāho – seyyathāpi mahāsamuddo. ‘Hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘Na hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’tipi na upeti, ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipi na upetī\"ti.",
    "sn44.1:13": "\"Acchariyaṁ, bhante, abbhutaṁ, bhante. Yatra hi nāma satthu ceva sāvikāya ca atthena attho byañjanena byañjanaṁ saṁsandissati, samessati, na virodhayissati yadidaṁ aggapadasmiṁ. Ekamidāhaṁ, bhante, samayaṁ khemaṁ bhikkhuniṁ upasaṅkamitvā etamatthaṁ apucchiṁ. Sāpi me ayyā etehi padehi etehi byañjanehi etamatthaṁ byākāsi, seyyathāpi bhagavā. Acchariyaṁ, bhante, abbhutaṁ, bhante. Yatra hi nāma satthu ceva sāvikāya ca atthena attho byañjanena byañjanaṁ saṁsandissati, samessati, na virodhayissati yadidaṁ aggapadasmiṁ. Handa dāni mayaṁ, bhante, gacchāma. Bahukiccā mayaṁ bahukaraṇīyā\"ti."
}