{
    "sn44.2:1": "Ekaṁ samayaṁ bhagavā vesāliyaṁ vihārati mahāvane kūṭāgārasālāyaṁ. Tena kho pana samayena āyasmā anurādho bhagavato avidūre araññakuṭikāyaṁ vihārati. Atha kho sambahulā aññatitthiyā paribbājakā yenāyasmā anurādho tenupasaṅkamiṁsu; upasaṅkamitvā āyasmatā anurādhena saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te aññatitthiyā paribbājakā āyasmantaṁ anurādhaṁ etadavocuṁ: \"yo so, āvuso anurādha, tathāgato uttamapuriso paramapuriso paramapattipatto, taṁ tathāgato imesu catūsu ṭhānesu paññāpayamāno paññāpeti: ‘hoti tathāgato paraṁ maraṇā’ti vā, ‘Na hoti tathāgato paraṁ maraṇā’ti vā, ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’ti vā, ‘neva hoti na na hoti tathāgato paraṁ maraṇā’ti vā\"ti? \"Yo so, āvuso, tathāgato uttamapuriso paramapuriso paramapattipatto, taṁ tathāgato aññatra imehi catūhi ṭhānehi paññāpayamāno paññāpeti: ‘hoti tathāgato paraṁ maraṇā’ti vā, ‘Na hoti tathāgato paraṁ maraṇā’ti vā, ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’ti vā, neva hoti na na hoti tathāgato paraṁ maraṇāti vā\"ti. Evaṁ vutte, te aññatitthiyā paribbājakā āyasmantaṁ anurādhaṁ etadavocuṁ: \"so cāyaṁ bhikkhu navo bhavissati acirapabbajito, thero vā pana bālo abyatto\"ti. Atha kho te aññatitthiyā paribbājakā āyasmantaṁ anurādhaṁ navavādena ca bālavādena ca apasādetvā uṭṭhāyāsanā pakkamiṁsu.",
    "sn44.2:2": "Atha kho āyasmato anurādhassa acirapakkantesu aññatitthiyesu paribbājakesu etadahosi: \"Sace kho maṁ te aññatitthiyā paribbājakā uttariṁ puccheyyuṁ, kathaṁ byākaramāno nu khvāhaṁ tesaṁ aññatitthiyānaṁ paribbājakānaṁ vuttavādī ceva bhagavato assaṁ, na ca bhagavantaṁ abhūtena abbhācikkheyyaṁ, dhammassa cānudhammaṁ byākareyyaṁ, na ca koci sahadhammiko vādānuvādo gārayhaṁ ṭhānaṁ āgaccheyyā\"ti? Atha kho āyasmā anurādho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā anurādho bhagavantaṁ etadavoca: \"Idhāhaṁ, bhante, bhagavato avidūre araññakuṭikāyaṁ viharāmi. Atha kho, bhante, sambahulā aññatitthiyā paribbājakā yenāhaṁ tenupasaṅkamiṁsu; upasaṅkamitvā mayā saddhiṁ sammodiṁsu. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho, bhante, te aññatitthiyā paribbājakā maṁ etadavocuṁ: ‘yo so, āvuso anurādha, tathāgato uttamapuriso paramapuriso paramapattipatto, taṁ tathāgato imesu catūsu ṭhānesu paññāpayamāno paññāpeti: \"hoti tathāgato paraṁ maraṇā\"ti vā … pe … \"neva hoti na na hoti tathāgato paraṁ maraṇā\"ti vā’ti? Evaṁ vuttāhaṁ, bhante, te aññatitthiye paribbājake etadavocaṁ: ‘yo so, āvuso, tathāgato uttamapuriso paramapuriso paramapattipatto, taṁ tathāgato aññatra imehi catūhi ṭhānehi paññāpayamāno paññāpeti: \"hoti tathāgato paraṁ maraṇā\"ti vā … pe … \"neva hoti na na hoti tathāgato paraṁ maraṇā\"ti vā’ti. Evaṁ vutte, bhante, te aññatitthiyā paribbājakā maṁ etadavocuṁ: ‘so cāyaṁ bhikkhu navo bhavissati acirapabbajito thero vā pana bālo abyatto’ti. Atha kho maṁ, bhante, te aññatitthiyā paribbājakā navavādena ca bālavādena ca apasādetvā uṭṭhāyāsanā pakkamiṁsu. Tassa mayhaṁ, bhante, acirapakkantesu tesu aññatitthiyesu paribbājakesu etadahosi: ‘sace kho maṁ te aññatitthiyā paribbājakā uttariṁ puccheyyuṁ, kathaṁ byākaramāno nu khvāhaṁ tesaṁ aññatitthiyānaṁ paribbājakānaṁ vuttavādī ceva bhagavato assaṁ, na ca bhagavantaṁ abhūtena abbhācikkheyyaṁ, dhammassa cānudhammaṁ byākareyyaṁ, na ca koci sahadhammiko vādānuvādo gārayhaṁ ṭhānaṁ āgaccheyyā’\"ti?",
    "sn44.2:3": "\"Taṁ kiṁ maññasi, anurādha, rūpaṁ niccaṁ vā aniccaṁ vā\"ti?",
    "sn44.2:4": "\"Aniccaṁ, bhante\".",
    "sn44.2:5": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn44.2:6": "\"Dukkhaṁ, bhante\".",
    "sn44.2:7": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn44.2:8": "\"No hetaṁ, bhante\".",
    "sn44.2:9": "\"Vedanā niccā vā aniccā vā\"ti? … pe … Saññā … pe … saṅkhārā … pe … \"viññāṇaṁ niccaṁ vā aniccaṁ vā\"ti?",
    "sn44.2:10": "\"Aniccaṁ, bhante\".",
    "sn44.2:11": "\"Yaṁ panāniccaṁ dukkhaṁ vā taṁ sukhaṁ vā\"ti?",
    "sn44.2:12": "\"Dukkhaṁ, bhante\".",
    "sn44.2:13": "\"Yaṁ panāniccaṁ dukkhaṁ vipariṇāmadhammaṁ, kallaṁ nu taṁ samanupassituṁ: ‘etaṁ mama, esohamasmi, eso me attā’\"ti?",
    "sn44.2:14": "\"No hetaṁ, bhante\".",
    "sn44.2:15": "\"Tasmātiha, anurādha, yaṁ kiñci rūpaṁ atītānāgatapaccuppannaṁ ajjhattaṁ vā bahiddhā vā oḷārikaṁ vā sukhumaṁ vā hīnaṁ vā paṇītaṁ vā yaṁ dūre santike vā, sabbaṁ rūpaṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti evametaṁ yathābhūtaṁ sammappaññāya daṭṭhabbaṁ. Yā kāci vedanā atītānāgatapaccuppannā … pe … yā kāci saññā … pe … ye keci saṅkhārā … pe … yaṁ kiñci viññāṇaṁ atītānāgatapaccuppannaṁ ajjhattaṁ vā bahiddhā vā oḷārikaṁ vā sukhumaṁ vā hīnaṁ vā paṇītaṁ vā yaṁ dūre santike vā, sabbaṁ viññāṇaṁ ‘netaṁ mama, nesohamasmi, na meso attā’ti evametaṁ yathābhūtaṁ sammappaññāya daṭṭhabbaṁ. Evaṁ passaṁ, anurādha, sutavā ariyasāvako rūpasmimpi nibbindati, vedanāyapi nibbindati, saññāyapi nibbindati, saṅkhāresupi nibbindati, viññāṇasmimpi nibbindati. Nibbindaṁ virajjati; virāgā vimuccati; vimuttasmiṁ vimuttamiti ñāṇaṁ hoti. ‘Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti.",
    "sn44.2:16": "Taṁ kiṁ maññasi, anurādha, rūpaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"vedanāṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Saññaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Saṅkhāre tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Viññāṇaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Taṁ kiṁ maññasi, anurādha, rūpasmiṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Aññatra rūpā tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Vedanāya … pe … aññatra vedanāya … pe … saññāya … pe … aññatra saññāya … pe … saṅkhāresu … pe … aññatra saṅkhārehi … pe … viññāṇasmiṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Aññatra viññāṇā tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\".",
    "sn44.2:17": "\"Taṁ kiṁ maññasi, anurādha, rūpaṁ, vedanāṁ, saññaṁ, saṅkhāre, viññāṇaṁ tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Taṁ kiṁ maññasi, anurādha, ayaṁ so arūpī avedano asaññī asaṅkhāro aviññāṇo tathāgatoti samanupassasī\"ti? \"No hetaṁ, bhante\". \"Ettha ca te, anurādha, diṭṭheva dhamme saccato thetato tathāgate anupalabbhiyamāne kallaṁ nu te taṁ veyyākaraṇaṁ – yo so, āvuso, tathāgato uttamapuriso paramapuriso paramapattipatto, taṁ tathāgato aññatra imehi catūhi ṭhānehi paññāpayamāno paññāpeti: ‘hoti tathāgato paraṁ maraṇā’ti vā … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’ti vā\"ti? \"No hetaṁ, bhante\". \"Sādhu sādhu, anurādha. Pubbe cāhaṁ, anurādha, etarahi ca dukkhañceva paññāpemi dukkhassa ca nirodhan\"ti."
}