{
    "sn44.6:1": "Ekaṁ samayaṁ āyasmā ca sāriputto, āyasmā ca mahākoṭṭhiko bārāṇasiyaṁ vihāranti isipatane migadāye. Atha kho āyasmā sāriputto sāyanhasamayaṁ paṭisallānā vuṭṭhito yenāyasmā mahākoṭṭhiko tenupasaṅkami; upasaṅkamitvā āyasmatā mahākoṭṭhikena saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā sāriputto āyasmantaṁ mahākoṭṭhikaṁ etadavoca:",
    "sn44.6:2": "\"Rūpārāmassa kho, āvuso, rūparatassa rūpasammuditassa rūpanirodhaṁ ajānato apassato yathābhūtaṁ, ‘hoti tathāgato paraṁ maraṇā’tipissa hoti; ‘Na hoti tathāgato paraṁ maraṇā’tipissa hoti; ‘hoti ca na ca hoti tathāgato paraṁ maraṇā’tipissa hoti; ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipissa hoti. Vedanārāmassa kho, āvuso, vedanāratassa vedanāsammuditassa, vedanānirodhaṁ ajānato apassato yathābhūtaṁ, ‘hoti tathāgato paraṁ maraṇā’tipissa hoti … pe … saññārāmassa kho, āvuso … pe … saṅkhārārāmassa kho āvuso … pe … viññāṇārāmassa kho, āvuso, viññāṇaratassa viññāṇasammuditassa viññāṇanirodhaṁ ajānato apassato yathābhūtaṁ, ‘hoti tathāgato paraṁ maraṇā’tipissa hoti … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipissa hoti.",
    "sn44.6:3": "Na rūpārāmassa kho, āvuso, na rūparatassa na rūpasammuditassa, rūpanirodhaṁ jānato passato yathābhūtaṁ, ‘hoti tathāgato paraṁ maraṇā’tipissa na hoti … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipissa na hoti. Na vedanārāmassa kho, āvuso … pe … na saññārāmassa kho, āvuso … pe … na saṅkhārārāmassa kho, āvuso … pe … na viññāṇārāmassa kho, āvuso, na viññāṇaratassa na viññāṇasammuditassa, viññāṇanirodhaṁ jānato passato yathābhūtaṁ, ‘hoti tathāgato paraṁ maraṇā’tipissa na hoti … pe … ‘neva hoti na na hoti tathāgato paraṁ maraṇā’tipissa na hoti.",
    "sn44.6:4": "\"Siyā panāvuso, aññopi pariyāyo, yenetaṁ abyākataṁ bhagavatā\"ti?",
    "sn44.6:5": "\"Siyā panāvuso, aññopi pariyāyo, yenetaṁ abyākataṁ bhagavatā\"ti?",
    "sn44.6:6": "\"Siyā panāvuso, aññopi pariyāyo, yenetaṁ abyākataṁ bhagavatā\"ti?",
    "sn44.6:7": "\"Siyā panāvuso, aññopi pariyāyo, yenetaṁ abyākataṁ bhagavatā\"ti?"
}