{
    "sn45.149:1": "Sāvatthinidānaṁ. \"Seyyathāpi, bhikkhave, ye keci balakaraṇīyā kammantā karīyanti, sabbe te pathaviṁ nissāya pathaviyaṁ patiṭṭhāya evamete balakaraṇīyā kammantā karīyanti; evameva kho, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti.",
    "sn45.149:2": "(Paragaṅgāpeyyālīvaṇṇiyato paripuṇṇasuttanti vitthāramaggī.)",
    "sn45.149:3": "Seyyathāpi, bhikkhave, ye keci balakaraṇīyā kammantā karīyanti, sabbe te pathaviṁ nissāya pathaviyaṁ patiṭṭhāya evamete balakaraṇīyā kammantā karīyanti; evameva kho, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti. Kathañca, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti? Idha, bhikkhave, bhikkhu sammādiṭṭhiṁ bhāveti rāgavinayapariyosānaṁ dosavinayapariyosānaṁ mohavinayapariyosānaṁ … pe … sammāsamādhiṁ bhāveti rāgavinayapariyosānaṁ dosavinayapariyosānaṁ mohavinayapariyosānaṁ. Evaṁ kho, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkarotīti.",
    "sn45.149:4": "Seyyathāpi, bhikkhave, ye keci balakaraṇīyā kammantā karīyanti, sabbe te pathaviṁ nissāya pathaviyaṁ patiṭṭhāya evamete balakaraṇīyā kammantā karīyanti; evameva kho, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti. Kathañca, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti? Idha, bhikkhave, bhikkhu sammādiṭṭhiṁ bhāveti amatogadhaṁ amataparāyanaṁ amatapariyosānaṁ … pe … sammāsamādhiṁ bhāveti amatogadhaṁ amataparāyanaṁ amatapariyosānaṁ. Evaṁ kho, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkarotīti.",
    "sn45.149:5": "Seyyathāpi, bhikkhave, ye keci balakaraṇīyā kammantā karīyanti, sabbe te pathaviṁ nissāya pathaviyaṁ patiṭṭhāya evamete balakaraṇīyā kammantā karīyanti; evameva kho, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti. Kathañca, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti? Idha, bhikkhave, bhikkhu sammādiṭṭhiṁ bhāveti nibbānaninnaṁ nibbānapoṇaṁ nibbānapabbhāraṁ … pe … sammāsamādhiṁ bhāveti nibbānaninnaṁ nibbānapoṇaṁ nibbānapabbhāraṁ. Evaṁ kho, bhikkhave, bhikkhu sīlaṁ nissāya sīle patiṭṭhāya ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkarotī\"ti."
}