{
    "sn45.4:1": "Sāvatthinidānaṁ. Atha kho āyasmā ānando pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya sāvatthiṁ piṇḍāya pāvisi. Addasā kho āyasmā ānando jāṇussoṇiṁ brāhmaṇaṁ sabbasetena vaḷavābhirathena sāvatthiyā niyyāyantaṁ. Setā sudaṁ assā yuttā honti setālaṅkārā, seto ratho, setaparivāro, setā rasmiyo, setā patodalaṭṭhi, setaṁ chattaṁ, setaṁ uṇhīsaṁ, setāni vatthāni, setā upāhanā, setāya sudaṁ vālabījaniyā bījīyati. Tamenaṁ jano disvā evamāha: \"brahmaṁ vata, bho, yānaṁ. Brahmayānarūpaṁ vata, bho\"ti.",
    "sn45.4:2": "Atha kho āyasmā ānando sāvatthiyaṁ piṇḍāya caritvā pacchābhattaṁ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:",
    "sn45.4:3": "\"Idhāhaṁ, bhante, pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya sāvatthiṁ piṇḍāya pāvisiṁ. Addasaṁ khvāhaṁ, bhante, jāṇussoṇiṁ brāhmaṇaṁ sabbasetena vaḷavābhirathena sāvatthiyā niyyāyantaṁ. Setā sudaṁ assā yuttā honti setālaṅkārā, seto ratho, setaparivāro, setā rasmiyo, setā patodalaṭṭhi, setaṁ chattaṁ, setaṁ uṇhīsaṁ, setāni vatthāni, setā upāhanā, setāya sudaṁ vālabījaniyā bījīyati. Tamenaṁ jano disvā evamāha: ‘brahmaṁ vata, bho, yānaṁ. Brahmayānarūpaṁ vata, bho’ti. Sakkā nu kho, bhante, imasmiṁ dhammavinaye brahmayānaṁ paññāpetun\"ti?",
    "sn45.4:4": "\"Sakkā, ānandā\"ti bhagavā avoca: \"imasseva kho etaṁ, Ānanda, ariyassa aṭṭhaṅgikassa maggassa adhivacanaṁ: ‘brahmayānaṁ’ itipi, ‘dhammayānaṁ’ itipi, ‘anuttaro saṅgāmavijayo’ itipīti.",
    "sn45.4:5": "Sammādiṭṭhi, Ānanda, bhāvitā bahulīkatā rāgavinayapariyosānā hoti, dosavinayapariyosānā hoti, mohavinayapariyosānā hoti. Sammāsaṅkappo, Ānanda, bhāvito bahulīkato rāgavinayapariyosāno hoti, dosavinayapariyosāno hoti, mohavinayapariyosāno hoti. Sammāvācā, Ānanda, bhāvitā bahulīkatā rāgavinayapariyosānā hoti, dosa … pe … mohavinayapariyosānā hoti. Sammākammanto, Ānanda, bhāvito bahulīkato rāgavinayapariyosāno hoti, dosa … pe … mohavinayapariyosāno hoti. Sammāājīvo, Ānanda, bhāvito bahulīkato rāgavinayapariyosāno hoti, dosa … pe … mohavinayapariyosāno hoti. Sammāvāyāmo, Ānanda, bhāvito bahulīkato rāgavinayapariyosāno hoti, dosa … pe … mohavinayapariyosāno hoti. Sammāsati, Ānanda, bhāvitā bahulīkatā rāgavinayapariyosānā hoti, dosa … pe … mohavinayapariyosānā hoti. Sammāsamādhi, Ānanda, bhāvito bahulīkato rāgavinayapariyosāno hoti, dosa … pe … mohavinayapariyosāno hoti.",
    "sn45.4:6": "Iminā kho etaṁ, Ānanda, pariyāyena veditabbaṁ yathā imassevetaṁ ariyassa aṭṭhaṅgikassa maggassa adhivacanaṁ: ‘brahmayānaṁ’ itipi, ‘dhammayānaṁ’ itipi, ‘anuttaro saṅgāmavijayo’ itipī\"ti. Idamavoca bhagavā.",
    "sn45.4:7": "Idaṁ vatvāna sugato athāparaṁ etadavoca satthā:",
    "sn45.4:8": "\"Yassa saddhā ca paññā ca,Dhammā yuttā sadā dhuraṁ;Hirī īsā mano yottaṁ,Sati ārakkhasārathi.",
    "sn45.4:9": "Ratho sīlaparikkhāro,jhanakkho cakkavīriyo;Upekkhā dhurasamādhi,anicchā parivāraṇaṁ.",
    "sn45.4:10": "Abyāpādo avihiṁsā,viveko yassa āvudhaṁ;Titikkhā cammasannāho,yogakkhemāya vattati.",
    "sn45.4:11": "Etadattani sambhūtaṁ,brahmayānaṁ anuttaraṁ;Niyyanti dhīrā lokamhā,aññadatthu jayaṁ jayan\"ti."
}