{
    "sn45.8:1": "Sāvatthinidānaṁ. \"Ariyaṁ vo, bhikkhave, aṭṭhaṅgikaṁ maggaṁ desessāmi vibhajissāmi. Taṁ suṇātha, sādhukaṁ manasi karotha, bhāsissāmī\"ti.",
    "sn45.8:2": "\"Katamo ca, bhikkhave, ariyo aṭṭhaṅgiko maggo? Seyyathidaṁ – sammādiṭṭhi … pe … sammāsamādhi.",
    "sn45.8:3": "Katamā ca, bhikkhave, sammādiṭṭhi? Yaṁ kho, bhikkhave, dukkhe ñāṇaṁ, dukkhasamudaye ñāṇaṁ, dukkhanirodhe ñāṇaṁ, dukkhanirodhagāminiyā paṭipadāya ñāṇaṁ – ayaṁ vuccati, bhikkhave, sammādiṭṭhi.",
    "sn45.8:4": "Katamo ca, bhikkhave, sammāsaṅkappo? Yo kho, bhikkhave, nekkhammasaṅkappo, abyā pāda saṅkappo, avihiṁsāsaṅkappo – ayaṁ vuccati, bhikkhave, sammāsaṅkappo.",
    "sn45.8:5": "Katamā ca, bhikkhave, sammāvācā? Yā kho, bhikkhave, musāvādā veramaṇī, pisuṇāya vācāya veramaṇī, pharusāya vācāya veramaṇī, samphappalāpā veramaṇī – ayaṁ vuccati, bhikkhave, sammāvācā.",
    "sn45.8:6": "Katamo ca, bhikkhave, sammākammanto? Yā kho, bhikkhave, pāṇātipātā veramaṇī, adinnādānā veramaṇī, abrahmacariyā veramaṇī – ayaṁ vuccati, bhikkhave, sammākammanto.",
    "sn45.8:7": "Katamo ca, bhikkhave, sammāājīvo? Idha, bhikkhave, ariyasāvako micchāājīvaṁ pahāya sammāājīvena jīvitaṁ kappeti – ayaṁ vuccati, bhikkhave, sammāājīvo.",
    "sn45.8:8": "Katamo ca, bhikkhave, sammāvāyāmo? Idha, bhikkhave, bhikkhu anuppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ anuppādāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati, uppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya chandaṁ janeti … pe … anuppannānaṁ kusalānaṁ dhammānaṁ uppādāya chandaṁ janeti … pe … uppannānaṁ kusalānaṁ dhammānaṁ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati – ayaṁ vuccati, bhikkhave, sammāvāyāmo.",
    "sn45.8:9": "Katamā ca, bhikkhave, sammāsati? Idha, bhikkhave, bhikkhu kāye kāyānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; vedanāsu vedanānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; citte cittānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; dhammesu dhammānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ – ayaṁ vuccati, bhikkhave, sammāsati.",
    "sn45.8:10": "Katamo ca, bhikkhave, sammāsamādhi? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja vihārati. Vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja vihārati. Pītiyā ca virāgā upekkhako ca vihārati sato ca sampajāno, sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti tatiyaṁ jhānaṁ upasampajja vihārati. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja vihārati – ayaṁ vuccati, bhikkhave, sammāsamādhī\"ti."
}