{
    "sn45.139:1": "Sāvatthinidānaṁ. \"Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññīnāsaññino vā, tathāgato tesaṁ aggamakkhāyati arahaṁ sammāsambuddho; evameva kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā; appamādo tesaṁ dhammānaṁ aggamakkhāyati. Appamattassetaṁ, bhikkhave, bhikkhuno pāṭikaṅkhaṁ – ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāvessati ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkarissati.",
    "sn45.139:2": "Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññīnāsaññino vā, tathāgato tesaṁ aggamakkhāyati arahaṁ sammāsambuddho; evameva kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā; appamādo tesaṁ dhammānaṁ aggamakkhāyati. Appamattassetaṁ, bhikkhave, bhikkhuno pāṭikaṅkhaṁ – ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāvessati, ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkarissati. Kathañca, bhikkhave, bhikkhu appamatto ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti?",
    "sn45.139:3": "Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññīnāsaññino vā, tathāgato tesaṁ aggamakkhāyati arahaṁ sammāsambuddho; evameva kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā; appamādo tesaṁ dhammānaṁ aggamakkhāyati. Appamattassetaṁ, bhikkhave, bhikkhuno pāṭikaṅkhaṁ – ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāvessati ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkarissati. Kathañca, bhikkhave, bhikkhu appamatto ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti?",
    "sn45.139:4": "Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññīnāsaññino vā, tathāgato tesaṁ aggamakkhāyati arahaṁ sammāsambuddho; evameva kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā; appamādo tesaṁ dhammānaṁ aggamakkhāyati. Appamattassetaṁ, bhikkhave, bhikkhuno pāṭikaṅkhaṁ – ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāvessati ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkarissati. Kathañca, bhikkhave, bhikkhu appamatto ariyaṁ aṭṭhaṅgikaṁ maggaṁ bhāveti ariyaṁ aṭṭhaṅgikaṁ maggaṁ bahulīkaroti?"
}