{
    "sn45.161:1": "Sāvatthinidānaṁ.",
    "sn45.161:2": "Tisso imā kho, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā. Imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ abhiññāya ariyo aṭṭhaṅgiko maggo bhāvetabbo. Katamo ariyo aṭṭhaṅgiko maggo? Idha, bhikkhave, bhikkhu sammādiṭṭhiṁ bhāveti … pe … sammāsamādhiṁ bhāveti rāgavinayapariyosānaṁ dosavinayapariyosānaṁ mohavinayapariyosānaṁ. Imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ abhiññāya ayaṁ ariyo aṭṭhaṅgiko maggo bhāvetabboti.",
    "sn45.161:3": "Tisso imā kho, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā. Imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ abhiññāya ariyo aṭṭhaṅgiko maggo bhāvetabbo. Katamo ariyo aṭṭhaṅgiko maggo? Idha, bhikkhave, bhikkhu sammādiṭṭhiṁ bhāveti … pe … sammāsamādhiṁ bhāveti amatogadhaṁ amataparāyanaṁ amatapariyosānaṁ. Imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ abhiññāya ayaṁ ariyo aṭṭhaṅgiko maggo bhāvetabboti.",
    "sn45.161:4": "Tisso imā kho, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā. Imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ abhiññāya ariyo aṭṭhaṅgiko maggo bhāvetabbo. Katamo ariyo aṭṭhaṅgiko maggo? Idha, bhikkhave, bhikkhu sammādiṭṭhiṁ bhāveti … pe … sammāsamādhiṁ bhāveti nibbānaninnaṁ nibbānapoṇaṁ nibbānapabbhāraṁ. Imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ abhiññāya ayaṁ ariyo aṭṭhaṅgiko maggo bhāvetabboti.",
    "sn45.161:5": "Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā. Imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ pariññāya … pe … ayaṁ ariyo aṭṭhaṅgiko maggo bhāvetabboti. (Yadapi abhiññā, tadapi pariññāya vitthāretabbaṁ.)",
    "sn45.161:6": "Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā. Imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ parikkhayāya … pe … ayaṁ ariyo aṭṭhaṅgiko maggo bhāvetabboti. (Yadapi abhiññā, tadapi parikkhayāya vitthāretabbaṁ.)",
    "sn45.161:7": "Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā. Imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ pahānāya ariyo aṭṭhaṅgiko maggo bhāvetabbo. Katamo ariyo aṭṭhaṅgiko maggo? Idha, bhikkhave, bhikkhu sammādiṭṭhiṁ bhāveti … pe … sammāsamādhiṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ … imāsaṁ kho, bhikkhave, tissannaṁ esanānaṁ pahānāya ayaṁ ariyo aṭṭhaṅgiko maggo bhāvetabbo\"ti. (Yadapi abhiññā, tadapi pahānāya vitthāretabbaṁ.)"
}