{
    "sn46.30:1": "Ekaṁ samayaṁ bhagavā sumbhesu vihārati setakaṁ nāma sumbhānaṁ nigamo. Atha kho āyasmā udāyī yena bhagavā tenupasaṅkami … pe … ekamantaṁ nisinno kho āyasmā udāyī bhagavantaṁ etadavoca:",
    "sn46.30:2": "\"Acchariyaṁ, bhante, abbhutaṁ, bhante. Yāva bahukatañca me, bhante, bhagavati pemañca gāravo ca hirī ca ottappañca. Ahañhi, bhante, pubbe agārikabhūto samāno abahukato ahosiṁ dhammena abahukato saṅghena. So khvāhaṁ bhagavati pemañca gāravañca hiriñca ottappañca sampassamāno agārasmā anagāriyaṁ pabbajito. Tassa me bhagavā dhammaṁ desesi: ‘iti rūpaṁ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā … pe … iti saññā … iti saṅkhārā … iti viññāṇaṁ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti.",
    "sn46.30:3": "So khvāhaṁ, bhante, suññāgāragato imesaṁ pañcupādānakkhandhānaṁ ukkujjāvakujjaṁ samparivattento ‘idaṁ dukkhan’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ abbhaññāsiṁ, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ abbhaññāsiṁ. Dhammo ca me, bhante, abhisamito, maggo ca me paṭiladdho; yo me bhāvito bahulīkato tathā tathā vihārantaṁ tathattāya upanessati yathāhaṁ: ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānissāmi.",
    "sn46.30:4": "Satisambojjhaṅgo me, bhante, paṭiladdho, yo me bhāvito bahulīkato tathā tathā vihārantaṁ tathattāya upanessati yathāhaṁ: ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānissāmi … pe … upekkhāsambojjhaṅgo me, bhante, paṭiladdho, yo me bhāvito bahulīkato tathā tathā vihārantaṁ tathattāya upanessati yathāhaṁ: ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānissāmi.",
    "sn46.30:5": "\"Sādhu sādhu, udāyi. Eso hi te, udāyi, maggo paṭiladdho, yo te bhāvito bahulīkato tathā tathā vihārantaṁ tathattāya upanessati yathā tvaṁ: ‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānissasī\"ti.",
    "sn46.30:6": "Bodhāya desanā ṭhānā,ayoniso cāparihānī;Khayo nirodho nibbedho,ekadhammo udāyināti."
}