{
    "sn46.3:1": "\"Ye te, bhikkhave, bhikkhū sīlasampannā samādhisampannā ñāṇasampannā vimuttisampannā vimuttiñāṇadassanasampannā, dassanampāhaṁ, bhikkhave, tesaṁ bhikkhūnaṁ bahukāraṁ vadāmi; savanampāhaṁ, bhikkhave, tesaṁ bhikkhūnaṁ bahukāraṁ vadāmi; upasaṅkamanampāhaṁ, bhikkhave, tesaṁ bhikkhūnaṁ bahukāraṁ vadāmi; payirupāsanampāhaṁ, bhikkhave, tesaṁ bhikkhūnaṁ bahukāraṁ vadāmi; anussatimpāhaṁ, bhikkhave, tesaṁ bhikkhūnaṁ bahukāraṁ vadāmi; anupabbajjampāhaṁ, bhikkhave, tesaṁ bhikkhūnaṁ bahukāraṁ vadāmi. Taṁ kissa hetu? Tathārūpānaṁ, bhikkhave, bhikkhūnaṁ dhammaṁ sutvā dvayena vūpakāsena vūpakaṭṭho vihārati – kāyavūpakāsena ca cittavūpakāsena ca. So tathā vūpakaṭṭho vihāranto taṁ dhammaṁ anussarati anuvitakketi.",
    "sn46.3:2": "Yasmiṁ samaye, bhikkhave, bhikkhu tathā vūpakaṭṭho vihāranto taṁ dhammaṁ anussarati anuvitakketi, satisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti; satisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti; satisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati. So tathā sato vihāranto taṁ dhammaṁ paññāya pavicinati pavicarati parivīmaṁsamāpajjati.",
    "sn46.3:3": "Yasmiṁ samaye, bhikkhave, bhikkhu tathā sato vihāranto taṁ dhammaṁ paññāya pavicinati pavicarati parivīmaṁsamāpajjati, dhammavicayasambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti; dhammavicayasambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti; dhammavicayasambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati. Tassa taṁ dhammaṁ paññāya pavicinato pavicarato parivīmaṁsamāpajjato āraddhaṁ hoti vīriyaṁ asallīnaṁ.",
    "sn46.3:4": "Yasmiṁ samaye, bhikkhave, bhikkhuno taṁ dhammaṁ paññāya pavicinato pavicarato parivīmaṁsamāpajjato āraddhaṁ hoti vīriyaṁ asallīnaṁ, vīriyasambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti; vīriyasambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti; vīriyasambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati. Āraddhavīriyassa uppajjati pīti nirāmisā.",
    "sn46.3:5": "Yasmiṁ samaye, bhikkhave, bhikkhuno āraddhavīriyassa uppajjati pīti nirāmisā, pītisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti; pītisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti; pītisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati. Pītimanassa kāyopi passambhati, cittampi passambhati.",
    "sn46.3:6": "Yasmiṁ samaye, bhikkhave, bhikkhuno pītimanassa kāyopi passambhati cittampi passambhati, passaddhisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti; passaddhisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti; passaddhisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati. Passaddhakāyassa sukhino cittaṁ samādhiyati.",
    "sn46.3:7": "Yasmiṁ samaye, bhikkhave, bhikkhuno passaddhakāyassa sukhino cittaṁ samādhiyati, samādhisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti; samādhisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti; samādhisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati. So tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti.",
    "sn46.3:8": "Yasmiṁ samaye, bhikkhave, bhikkhu tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti, upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti; upekkhāsambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti; upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.",
    "sn46.3:9": "Evaṁ bhāvitesu kho, bhikkhave, sattasu sambojjhaṅgesu evaṁ bahulīkatesu satta phalā sattānisaṁsā pāṭikaṅkhā. Katame satta phalā sattānisaṁsā?"
}