{
    "sn46.55:1": "Sāvatthinidānaṁ. Atha kho saṅgāravo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho saṅgāravo brāhmaṇo bhagavantaṁ etadavoca:",
    "sn46.55:2": "\"Ko nu kho, bho gotama, hetu, ko paccayo yenekadā dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā? Ko pana, bho gotama, hetu, ko paccayo yenekadā dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā\"ti?",
    "sn46.55:3": "\"Yasmiṁ kho, brāhmaṇa, samaye kāmarāgapariyuṭṭhitena cetasā vihārati kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, paratthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, ubhayatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati; dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:4": "Seyyathāpi, brāhmaṇa, udapatto saṁsaṭṭho lākhāya vā haliddiyā vā nīliyā vā mañjiṭṭhāya vā. Tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ na jāneyya na passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye kāmarāgapariyuṭṭhitena cetasā vihārati kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati … pe … paratthampi … pe … ubhayatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati; dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:5": "Puna caparaṁ, brāhmaṇa, yasmiṁ samaye byā pāda pariyuṭṭhitena cetasā vihārati byā pāda paretena, uppannassa ca byā pāda ssa nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, paratthampi … pe … ubhayatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati; dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:6": "Seyyathāpi, brāhmaṇa, udapatto agginā santatto pakkuthito usmudakajāto. Tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ na jāneyya na passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye byā pāda pariyuṭṭhitena cetasā vihārati byā pāda paretena, uppannassa ca byā pāda ssa nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, paratthampi tasmiṁ samaye … pe … ubhayatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati; dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:7": "Puna caparaṁ, brāhmaṇa, yasmiṁ samaye thinamiddhapariyuṭṭhitena cetasā vihārati thinamiddhaparetena, uppannassa ca thinamiddhassa nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, paratthampi … pe … ubhayatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati; dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:8": "Seyyathāpi, brāhmaṇa, udapatto sevālapaṇakapariyonaddho. Tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ na jāneyya na passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye thinamiddhapariyuṭṭhitena cetasā vihārati thinamiddhaparetena, uppannassa ca thinamiddhassa nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, paratthampi … pe … ubhayatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati; dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:9": "Puna caparaṁ, brāhmaṇa, yasmiṁ samaye uddhaccakukkuccapariyuṭṭhitena cetasā vihārati uddhaccakukkuccaparetena, uppannassa ca uddhaccakukkuccassa nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, paratthampi … pe … ubhayatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati; dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:10": "Seyyathāpi, brāhmaṇa, udapatto vāterito calito bhanto ūmijāto. Tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ na jāneyya na passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye uddhaccakukkuccapariyuṭṭhitena cetasā vihārati uddhaccakukkuccaparetena, uppannassa ca uddhaccakukkuccassa nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, paratthampi … pe … ubhayatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati; dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:11": "Puna caparaṁ, brāhmaṇa, yasmiṁ samaye vicikicchāpariyuṭṭhitena cetasā vihārati vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, paratthampi … pe … ubhayatthampi … dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:12": "Seyyathāpi, brāhmaṇa, udapatto āvilo luḷito kalalībhūto andhakāre nikkhitto. Tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ na jāneyya na passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye vicikicchāpariyuṭṭhitena cetasā vihārati vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṁ yathābhūtaṁ nappajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, paratthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati, ubhayatthampi tasmiṁ samaye yathābhūtaṁ na jānāti na passati; dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. Ayaṁ kho, brāhmaṇa, hetu ayaṁ paccayo yenekadā dīgharattaṁ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā.",
    "sn46.55:13": "Yasmiñca kho, brāhmaṇa, samaye na kāmarāgapariyuṭṭhitena cetasā vihārati na kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṁ yathābhūtaṁ pajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, paratthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, ubhayatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati; dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā.",
    "sn46.55:14": "Seyyathāpi, brāhmaṇa, udapatto asaṁsaṭṭho lākhāya vā haliddiyā vā nīliyā vā mañjiṭṭhāya vā. Tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ jāneyya passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye na kāmarāgapariyuṭṭhitena cetasā vihārati na kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṁ yathābhūtaṁ pajānāti … pe … .",
    "sn46.55:15": "Puna caparaṁ, brāhmaṇa, yasmiṁ samaye na byā pāda pariyuṭṭhitena cetasā vihārati na byā pāda paretena, uppannassa ca byā pāda ssa nissaraṇaṁ yathābhūtaṁ pajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, paratthampi … pe … ubhayatthampi … pe … dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā.",
    "sn46.55:16": "Seyyathāpi, brāhmaṇa, udapatto na agginā santatto na pakkuthito na usmudakajāto, tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ jāneyya passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye na byā pāda pariyuṭṭhitena cetasā vihārati na byā pāda paretena, uppannassa ca byā pāda ssa nissaraṇaṁ yathābhūtaṁ pajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, paratthampi … pe … ubhayatthampi … pe … dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā.",
    "sn46.55:17": "Puna caparaṁ, brāhmaṇa, yasmiṁ samaye na thinamiddhapariyuṭṭhitena cetasā vihārati na thinamiddhaparetena, uppannassa ca thinamiddhassa nissaraṇaṁ yathābhūtaṁ pajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, paratthampi … pe … ubhayatthampi … pe … dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā.",
    "sn46.55:18": "Seyyathāpi, brāhmaṇa, udapatto na sevālapaṇakapariyonaddho. Tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ jāneyya passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye na thinamiddhapariyuṭṭhitena cetasā vihārati na thinamiddhaparetena, uppannassa ca thinamiddhassa nissaraṇaṁ yathābhūtaṁ pajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, paratthampi … pe … ubhayatthampi … pe … dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā.",
    "sn46.55:19": "Puna caparaṁ, brāhmaṇa, yasmiṁ samaye na uddhaccakukkuccapariyuṭṭhitena cetasā vihārati na uddhaccakukkuccaparetena, uppannassa ca uddhaccakukkuccassa nissaraṇaṁ yathābhūtaṁ pajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, paratthampi … pe … ubhayatthampi … pe … dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā.",
    "sn46.55:20": "Seyyathāpi, brāhmaṇa, udapatto na vāterito na calito na bhanto na ūmijāto. Tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ jāneyya passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye na uddhaccakukkuccapariyuṭṭhitena cetasā vihārati na uddhaccakukkuccaparetena, uppannassa ca uddhaccakukkuccassa nissaraṇaṁ yathābhūtaṁ pajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, paratthampi … pe … ubhayatthampi … pe … dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā.",
    "sn46.55:21": "Puna caparaṁ, brāhmaṇa, yasmiṁ samaye na vicikicchāpariyuṭṭhitena cetasā vihārati na vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṁ yathābhūtaṁ pajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, paratthampi tasmiṁ samaye yathābhūtaṁ jānāti passati; ubhayatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati; dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā.",
    "sn46.55:22": "Seyyathāpi, brāhmaṇa, udapatto accho vippasanno anāvilo āloke nikkhitto. Tattha cakkhumā puriso sakaṁ mukhanimittaṁ paccavekkhamāno yathābhūtaṁ jāneyya passeyya. Evameva kho, brāhmaṇa, yasmiṁ samaye na vicikicchāpariyuṭṭhitena cetasā vihārati na vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṁ yathābhūtaṁ pajānāti, attatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, paratthampi tasmiṁ samaye yathābhūtaṁ jānāti passati, ubhayatthampi tasmiṁ samaye yathābhūtaṁ jānāti passati; dīgharattaṁ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā.",
    "sn46.55:23": "Sattime, brāhmaṇa, bojjhaṅgā anāvaraṇā anīvaraṇā cetaso anupakkilesā bhāvitā bahulīkatā vijjāvimuttiphalasacchikiriyāya saṁvattanti. Katame satta? Satisambojjhaṅgo kho, brāhmaṇa, anāvaraṇo anīvaraṇo cetaso anupakkileso bhāvito bahulīkato vijjāvimuttiphalasacchikiriyāya saṁvattati … pe … upekkhāsambojjhaṅgo kho, brāhmaṇa, anāvaraṇo anīvaraṇo cetaso anupakkileso bhāvito bahulīkato vijjāvimuttiphalasacchikiriyāya saṁvattati. Ime kho, brāhmaṇa, satta bojjhaṅgā anāvaraṇā anīvaraṇā cetaso anupakkilesā bhāvitā bahulīkatā vijjāvimuttiphalasacchikiriyāya saṁvattantī\"ti.",
    "sn46.55:24": "Evaṁ vutte, saṅgāravo brāhmaṇo bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama … pe … upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}