{
    "sn46.6:1": "Ekaṁ samayaṁ bhagavā sākete vihārati añjanavane migadāye. Atha kho kuṇḍaliyo paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho kuṇḍaliyo paribbājako bhagavantaṁ etadavoca:",
    "sn46.6:2": "\"Katame pana, bho gotama, dhammā bhāvitā bahulīkatā vijjāvimuttiṁ paripūrentī\"ti?",
    "sn46.6:3": "Kathaṁ bhāvito ca, kuṇḍaliya, indriyasaṁvaro kathaṁ bahulīkato tīṇi sucaritāni paripūretīti? Idha, kuṇḍaliya, bhikkhu cakkhunā rūpaṁ disvā manāpaṁ nābhijjhati nābhihaṁsati, na rāgaṁ janeti. Tassa ṭhito ca kāyo hoti, ṭhitaṁ cittaṁ ajjhattaṁ susaṇṭhitaṁ suvimuttaṁ. Cakkhunā kho paneva rūpaṁ disvā amanāpaṁ na maṅku hoti appatiṭṭhitacitto adīnamānaso abyāpannacetaso. Tassa ṭhito ca kāyo hoti ṭhitaṁ cittaṁ ajjhattaṁ susaṇṭhitaṁ suvimuttaṁ.",
    "sn46.6:4": "Puna caparaṁ, kuṇḍaliya, bhikkhu sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … pe … jivhāya rasaṁ sāyitvā … pe … kāyena phoṭṭhabbaṁ phusitvā … pe … manasā dhammaṁ viññāya manāpaṁ nābhijjhati nābhihaṁsati, na rāgaṁ janeti. Tassa ṭhito ca kāyo hoti, ṭhitaṁ cittaṁ ajjhattaṁ susaṇṭhitaṁ suvimuttaṁ. Manasā kho paneva dhammaṁ viññāya amanāpaṁ na maṅku hoti appatiṭṭhitacitto adīnamānaso abyāpannacetaso. Tassa ṭhito ca kāyo hoti, ṭhitaṁ cittaṁ ajjhattaṁ susaṇṭhitaṁ suvimuttaṁ.",
    "sn46.6:5": "Yato kho, kuṇḍaliya, bhikkhuno cakkhunā rūpaṁ disvā manāpāmanāpesu rūpesu ṭhito ca kāyo hoti, ṭhitaṁ cittaṁ ajjhattaṁ susaṇṭhitaṁ suvimuttaṁ. Sotena saddaṁ sutvā … pe … ghānena gandhaṁ ghāyitvā … pe … jivhāya rasaṁ sāyitvā … pe … kāyena phoṭṭhabbaṁ phusitvā … pe … manasā dhammaṁ viññāya manāpāmanāpesu dhammesu ṭhito ca kāyo hoti, ṭhitaṁ cittaṁ ajjhattaṁ susaṇṭhitaṁ suvimuttaṁ. Evaṁ bhāvito kho, kuṇḍaliya, indriyasaṁvaro evaṁ bahulīkato tīṇi sucaritāni paripūreti.",
    "sn46.6:6": "Kathaṁ bhāvitāni ca, kuṇḍaliya, tīṇi sucaritāni kathaṁ bahulīkatāni cattāro satipaṭṭhāne paripūrenti? Idha, kuṇḍaliya, bhikkhu kāyaduccaritaṁ pahāya kāyasucaritaṁ bhāveti, vacīduccaritaṁ pahāya vacīsucaritaṁ bhāveti, manoduccaritaṁ pahāya manosucaritaṁ bhāveti. Evaṁ bhāvitāni kho, kuṇḍaliya, tīṇi sucaritāni evaṁ bahulīkatāni cattāro satipaṭṭhāne paripūrenti.",
    "sn46.6:7": "Kathaṁ bhāvitā ca, kuṇḍaliya, cattāro satipaṭṭhānā kathaṁ bahulīkatā satta bojjhaṅge paripūrenti? Idha, kuṇḍaliya, bhikkhu kāye kāyānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; vedanāsu … pe … citte … pe … dhammesu dhammānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Evaṁ bhāvitā kho, kuṇḍaliya, cattāro satipaṭṭhānā evaṁ bahulīkatā satta bojjhaṅge paripūrenti.",
    "sn46.6:8": "Kathaṁ bhāvitā ca, kuṇḍaliya, satta bojjhaṅgā kathaṁ bahulīkatā vijjāvimuttiṁ paripūrenti? Idha, kuṇḍaliya, bhikkhu satisambojjhaṅgaṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ … pe … upekkhāsambojjhaṅgaṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ. Evaṁ bhāvitā kho, kuṇḍaliya, satta bojjhaṅgā evaṁ bahulīkatā vijjāvimuttiṁ paripūrentī\"ti.",
    "sn46.6:9": "Evaṁ vutte, kuṇḍaliyo paribbājako bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evameva bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan\"ti."
}