{
    "sn46.53:1": "Atha kho sambahulā bhikkhū pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya sāvatthiṁ piṇḍāya pavisiṁsu. (Pariyāyasuttasadisaṁ.)",
    "sn46.53:2": "\"Evaṁvādino, bhikkhave, aññatitthiyā paribbājakā evamassu vacanīyā: ‘yasmiṁ, āvuso, samaye līnaṁ cittaṁ hoti, katamesaṁ tasmiṁ samaye bojjhaṅgānaṁ akālo bhāvanāya, katamesaṁ tasmiṁ samaye bojjhaṅgānaṁ kālo bhāvanāya? Yasmiṁ panāvuso, samaye uddhataṁ cittaṁ hoti, katamesaṁ tasmiṁ samaye bojjhaṅgānaṁ akālo bhāvanāya, katamesaṁ tasmiṁ samaye bojjhaṅgānaṁ kālo bhāvanāyā’ti? Evaṁ puṭṭhā, bhikkhave, aññatitthiyā paribbājakā na ceva sampāyissanti, uttariñca vighātaṁ āpajjissanti. Taṁ kissa hetu? Yathā taṁ, bhikkhave, avisayasmiṁ.",
    "sn46.53:3": "Nāhaṁ taṁ, bhikkhave, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya yo imesaṁ pañhānaṁ veyyākaraṇena cittaṁ ārādheyya, aññatra tathāgatena vā tathāgatāsāvakena vā ito vā pana sutvā.",
    "sn46.53:4": "Yasmiṁ, bhikkhave, samaye līnaṁ cittaṁ hoti, akālo tasmiṁ samaye passaddhisambojjhaṅgassa bhāvanāya, akālo samādhisambojjhaṅgassa bhāvanāya, akālo upekkhāsambojjhaṅgassa bhāvanāya. Taṁ kissa hetu? Līnaṁ, bhikkhave, cittaṁ taṁ etehi dhammehi dussamuṭṭhāpayaṁ hoti.",
    "sn46.53:5": "Seyyathāpi, bhikkhave, puriso parittaṁ aggiṁ ujjāletukāmo assa. So tattha allāni ceva tiṇāni pakkhipeyya, allāni ca gomayāni pakkhipeyya, allāni ca kaṭṭhāni pakkhipeyya, udakavātañca dadeyya, paṁsukena ca okireyya; bhabbo nu kho so puriso parittaṁ aggiṁ ujjāletun\"ti?",
    "sn46.53:6": "\"Evameva kho, bhikkhave, yasmiṁ samaye līnaṁ cittaṁ hoti, akālo tasmiṁ samaye passaddhisambojjhaṅgassa bhāvanāya, akālo samādhisambojjhaṅgassa bhāvanāya, akālo upekkhāsambojjhaṅgassa bhāvanāya. Taṁ kissa hetu? Līnaṁ, bhikkhave, cittaṁ taṁ etehi dhammehi dussamuṭṭhāpayaṁ hoti.",
    "sn46.53:7": "Yasmiñca kho, bhikkhave, samaye līnaṁ cittaṁ hoti, kālo tasmiṁ samaye dhammavicayasambojjhaṅgassa bhāvanāya, kālo vīriyasambojjhaṅgassa bhāvanāya, kālo pītisambojjhaṅgassa bhāvanāya. Taṁ kissa hetu? Līnaṁ, bhikkhave, cittaṁ taṁ etehi dhammehi susamuṭṭhāpayaṁ hoti.",
    "sn46.53:8": "Seyyathāpi, bhikkhave, puriso parittaṁ aggiṁ ujjāletukāmo assa. So tattha sukkhāni ceva tiṇāni pakkhipeyya, sukkhāni gomayāni pakkhipeyya, sukkhāni kaṭṭhāni pakkhipeyya, mukhavātañca dadeyya, na ca paṁsukena okireyya; bhabbo nu kho so puriso parittaṁ aggiṁ ujjāletun\"ti?",
    "sn46.53:9": "\"Evameva kho, bhikkhave, yasmiṁ samaye līnaṁ cittaṁ hoti, kālo tasmiṁ samaye dhammavicayasambojjhaṅgassa bhāvanāya, kālo vīriyasambojjhaṅgassa bhāvanāya, kālo pītisambojjhaṅgassa bhāvanāya. Taṁ kissa hetu? Līnaṁ, bhikkhave, cittaṁ taṁ etehi dhammehi susamuṭṭhāpayaṁ hoti.",
    "sn46.53:10": "Yasmiṁ, bhikkhave, samaye uddhataṁ cittaṁ hoti, akālo tasmiṁ samaye dhammavicayasambojjhaṅgassa bhāvanāya, akālo vīriyasambojjhaṅgassa bhāvanāya, akālo pītisambojjhaṅgassa bhāvanāya. Taṁ kissa hetu? Uddhataṁ, bhikkhave, cittaṁ taṁ etehi dhammehi duvūpasamayaṁ hoti.",
    "sn46.53:11": "Seyyathāpi, bhikkhave, puriso mahantaṁ aggikkhandhaṁ nibbāpetukāmo assa. So tattha sukkhāni ceva tiṇāni pakkhipeyya, sukkhāni ca gomayāni pakkhipeyya, sukkhāni ca kaṭṭhāni pakkhipeyya, mukhavātañca dadeyya, na ca paṁsukena okireyya; bhabbo nu kho so puriso mahantaṁ aggikkhandhaṁ nibbāpetun\"ti?",
    "sn46.53:12": "\"Evameva kho, bhikkhave, yasmiṁ samaye uddhataṁ cittaṁ hoti, akālo tasmiṁ samaye dhammavicayasambojjhaṅgassa bhāvanāya, akālo vīriyasambojjhaṅgassa bhāvanāya, akālo pītisambojjhaṅgassa bhāvanāya. Taṁ kissa hetu? Uddhataṁ, bhikkhave, cittaṁ taṁ etehi dhammehi duvūpasamayaṁ hoti.",
    "sn46.53:13": "Yasmiñca kho, bhikkhave, samaye uddhataṁ cittaṁ hoti, kālo tasmiṁ samaye passaddhisambojjhaṅgassa bhāvanāya, kālo samādhisambojjhaṅgassa bhāvanāya, kālo upekkhāsambojjhaṅgassa bhāvanāya. Taṁ kissa hetu? Uddhataṁ, bhikkhave, cittaṁ taṁ etehi dhammehi suvūpasamayaṁ hoti.",
    "sn46.53:14": "Seyyathāpi, bhikkhave, puriso mahantaṁ aggikkhandhaṁ nibbāpetukāmo assa. So tattha allāni ceva tiṇāni pakkhipeyya, allāni ca gomayāni pakkhipeyya, allāni ca kaṭṭhāni pakkhipeyya, udakavātañca dadeyya, paṁsukena ca okireyya; bhabbo nu kho so puriso mahantaṁ aggikkhandhaṁ nibbāpetun\"ti?",
    "sn46.53:15": "\"Evameva kho, bhikkhave, yasmiṁ samaye uddhataṁ cittaṁ hoti, kālo tasmiṁ samaye passaddhisambojjhaṅgassa bhāvanāya, kālo samādhisambojjhaṅgassa bhāvanāya, kālo upekkhāsambojjhaṅgassa bhāvanāya. Taṁ kissa hetu? Uddhataṁ, bhikkhave, cittaṁ taṁ etehi dhammehi suvūpasamayaṁ hoti."
}