{
    "sn47.18:1": "Ekaṁ samayaṁ bhagavā uruvelāyaṁ vihārati najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Atha kho bhagavato rahogatassa paṭisallīnassa evaṁ cetaso parivitakko udapādi: \"ekāyanvāyaṁ maggo sattānaṁ visuddhiyā sokaparidevānaṁ samatikkamāya dukkhadomanassānaṁ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṁ – cattāro satipaṭṭhānā.",
    "sn47.18:2": "Katame cattāro? Kāye vā bhikkhu kāyānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; vedanāsu vā bhikkhu … pe … citte vā bhikkhu … pe … dhammesu vā bhikkhu dhammānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Ekāyanvāyaṁ maggo sattānaṁ visuddhiyā sokaparidevānaṁ samatikkamāya dukkhadomanassānaṁ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṁ – cattāro satipaṭṭhānā\"ti.",
    "sn47.18:3": "Atha kho brahmā sahampati bhagavato cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evameva kho brahmaloke antarahito bhagavato purato pāturahosi. Atha kho brahmā sahampati ekaṁsaṁ uttarāsaṅgaṁ karitvā yena bhagavā tenañjaliṁ paṇāmetvā bhagavantaṁ etadavoca: \"evametaṁ, bhagavā, evametaṁ, sugata. Ekāyanvāyaṁ, bhante, maggo sattānaṁ visuddhiyā sokaparidevānaṁ samatikkamāya dukkhadomanassānaṁ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṁ – cattāro satipaṭṭhānā.",
    "sn47.18:4": "Katame cattāro? Kāye vā, bhante, bhikkhu kāyānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; vedanāsu vā, bhante, bhikkhu … pe … citte vā, bhante, bhikkhu … pe … dhammesu vā, bhante, bhikkhu dhammānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Ekāyanvāyaṁ, bhante, maggo sattānaṁ visuddhiyā sokaparidevānaṁ samatikkamāya dukkhadomanassānaṁ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṁ – cattāro satipaṭṭhānā\"ti.",
    "sn47.18:5": "Idamavoca brahmā sahampati. Idaṁ vatvā athāparaṁ etadavoca:",
    "sn47.18:6": "\"Ekāyanaṁ jātikhayantadassī,Maggaṁ pajānāti hitānukampī;Etena maggena tariṁsu pubbe,Tarissanti ye ca taranti oghan\"ti."
}