{
    "sn47.12:1": "Ekaṁ samayaṁ bhagavā nālandāyaṁ vihārati pāvārikambavane. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā sāriputto bhagavantaṁ etadavoca:",
    "sn47.12:2": "Kiṁ nu te, sāriputta, ye te ahesuṁ atītamaddhānaṁ arahanto sammāsambuddhā, sabbe te bhagavanto cetasā ceto paricca viditā: ‘evaṁsīlā te bhagavanto ahesuṁ’ iti vā, ‘evaṁdhammā te bhagavanto ahesuṁ’ iti vā, ‘evaṁpaññā te bhagavanto ahesuṁ’ iti vā, ‘evaṁvihārino te bhagavanto ahesuṁ’ iti vā, ‘evaṁvimuttā te bhagavanto ahesuṁ’ iti vā\"ti?",
    "sn47.12:3": "\"Kiṁ pana te, sāriputta, ye te bhavissanti anāgatamaddhānaṁ arahanto sammāsambuddhā, sabbe te bhagavanto cetasā ceto paricca viditā: ‘evaṁsīlā te bhagavanto bhavissanti’ iti vā, ‘evaṁdhammā te bhagavanto bhavissanti’ iti vā, ‘evaṁpaññā te bhagavanto bhavissanti’ iti vā, ‘evaṁvihārino te bhagavanto bhavissanti’ iti vā, ‘evaṁvimuttā te bhagavanto bhavissanti’ iti vā\"ti?",
    "sn47.12:4": "\"Kiṁ pana tyāhaṁ, sāriputta, etarahi, arahaṁ sammāsambuddho cetasā ceto paricca vidito: ‘evaṁsīlo bhagavā’ iti vā, ‘evaṁdhammo bhagavā’ iti vā, ‘evaṁpañño bhagavā’ iti vā, ‘evaṁvihārī bhagavā’ iti vā, ‘evaṁvimutto bhagavā’ iti vā\"ti?",
    "sn47.12:5": "\"Ettha ca te, sāriputta, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṁ natthi. Atha kiñcarahi tyāyaṁ, sāriputta, uḷārā āsabhī vācā bhāsitā, ekaṁso gahito, sīhanādo nadito: ‘evaṁpasanno ahaṁ, bhante, bhagavati. Na cāhu, na ca bhavissati, na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā’ bhiyyobhiññataro, yadidaṁ – sambodhiyan\"ti?",
    "sn47.12:6": "\"Na kho me, bhante, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṁ atthi, api ca me dhammanvayo vidito. Seyyathāpi, bhante, rañño paccantimaṁ nagaraṁ daḷhuddhāpaṁ daḷhapākāratoraṇaṁ ekadvāraṁ. Tatrassa dovāriko paṇḍito byatto medhāvī aññātānaṁ nivāretā ñātānaṁ pavesetā. So tassa nagarassa samantā anupariyāyapathaṁ anukkamamāno na passeyya pākārasandhiṁ vā pākāravivaraṁ vā, antamaso biḷāranikkhamanamattampi. Tassa evamassa: ‘ye kho keci oḷārikā pāṇā imaṁ nagaraṁ pavisanti vā nikkhamanti vā, sabbe te imināva dvārena pavisanti vā nikkhamanti vā’ti.",
    "sn47.12:7": "\"Sādhu sādhu, sāriputta. Tasmātiha tvaṁ, sāriputta, imaṁ dhammapariyāyaṁ abhikkhaṇaṁ bhāseyyāsi bhikkhūnaṁ bhikkhunīnaṁ upāsakānaṁ upāsikānaṁ. Yesampi hi, sāriputta, moghapurisānaṁ bhavissati tathāgate kaṅkhā vā vimati vā, tesampimaṁ dhammapariyāyaṁ sutvā yā tathāgate kaṅkhā vā vimati vā sā pahīyissatī\"ti."
}