{
    "sn47.9:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā vesāliyaṁ vihārati veḷuvagāmake. Tatra kho bhagavā bhikkhū āmantesi:",
    "sn47.9:2": "Atha kho bhagavato vassūpagatassa kharo ābādho uppajji, bāḷhā vedanā vattanti māraṇantikā. Tatra sudaṁ bhagavā sato sampajāno adhivāsesi avihaññamāno. Atha kho bhagavato etadahosi: \"na kho me taṁ patirūpaṁ, yohaṁ anāmantetvā upaṭṭhāke anapaloketvā bhikkhusaṅghaṁ parinibbāyeyyaṁ. Yannūnāhaṁ imaṁ ābādhaṁ vīriyena paṭipaṇāmetvā jīvitasaṅkhāraṁ adhiṭṭhāya vihareyyan\"ti. Atha kho bhagavā taṁ ābādhaṁ vīriyena paṭipaṇāmetvā jīvitasaṅkhāraṁ adhiṭṭhāya vihāsi. Atha kho bhagavato so ābādho paṭippassambhi.",
    "sn47.9:3": "Atha kho bhagavā gilānā vuṭṭhito aciravuṭṭhito gelaññā vihārā nikkhamitvā vihārapacchāyāyaṁ paññatte āsane nisīdi. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca: \"diṭṭho me, bhante, bhagavato phāsu; diṭṭhaṁ, bhante, bhagavato khamanīyaṁ; diṭṭhaṁ, bhante, bhagavato yāpanīyaṁ. Api ca me, bhante, madhurakajāto viya kāyo, disāpi me na pakkhāyanti, dhammāpi maṁ nappaṭibhanti bhagavato gelaññena. Api ca me, bhante, ahosi kācideva assāsamattā: ‘Na tāva bhagavā parinibbāyissati, na yāva bhagavā bhikkhusaṅghaṁ ārabbha kiñcideva udāharatī’\"ti.",
    "sn47.9:4": "\"Kiṁ pana dāni, Ānanda, bhikkhusaṅgho mayi paccāsīsati? Desito, Ānanda, mayā dhammo anantaraṁ abāhiraṁ karitvā. NatthĀnanda, tathāgatassa dhammesu acariyamuṭṭhi. Yassa nūna, Ānanda, evamassa: ‘Ahaṁ bhikkhusaṅghaṁ pariharissāmī’ti vā, ‘mamuddesiko bhikkhusaṅgho’ti vā, so nūna, Ānanda, bhikkhusaṅghaṁ ārabbha kiñcideva udāhareyya. Tathāgatassa kho, Ānanda, na evaṁ hoti: ‘Ahaṁ bhikkhusaṅghaṁ pariharissāmī’ti vā, ‘mamuddesiko bhikkhusaṅgho’ti vā. Sa kiṁ, Ānanda, tathāgato bhikkhusaṅghaṁ ārabbha kiñcideva udāharissati. Etarahi kho panāhaṁ, Ānanda, jiṇṇo vuddho mahallako addhagato vayoanuppatto. Āsītiko me vayo vattati. Seyyathāpi, Ānanda, jajjarasakaṭaṁ veḷamissakena yāpeti; evameva kho, Ānanda, veḷamissakena maññe tathāgatassa kāyo yāpeti.",
    "sn47.9:5": "Yasmiṁ, Ānanda, samaye tathāgato sabbanimittānaṁ amanasikārā ekaccānaṁ vedanānaṁ nirodhā animittaṁ cetosamādhiṁ upasampajja vihārati, phāsutaro, Ānanda, tasmiṁ samaye tathāgatassa kāyo hoti. TasmātihĀnanda, attadīpā vihāratha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā.",
    "sn47.9:6": "KathañcĀnanda, bhikkhu attadīpo vihārati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo? IdhĀnanda, bhikkhu kāye kāyānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; vedanāsu … pe … citte … pe … dhammesu dhammānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ."
}