{
    "sn47.13:1": "Ekaṁ samayaṁ bhagavā sāvatthiyaṁ vihārati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā sāriputto magadhesu vihārati nālakagāmake ābādhiko dukkhito bāḷhagilāno. Cundo ca samaṇuddeso āyasmato sāriputtassa upaṭṭhāko hoti.",
    "sn47.13:2": "Atha kho āyasmā sāriputto teneva ābādhena parinibbāyi.",
    "sn47.13:3": "\"Atthi kho idaṁ, āvuso cunda, kathāpābhataṁ bhagavantaṁ dassanāya. Āyāmāvuso cunda, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavato etamatthaṁ ārocessāmā\"ti.",
    "sn47.13:4": "Atha kho āyasmā ca ānando cundo ca samaṇuddeso yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca: \"Ayaṁ, bhante, cundo samaṇuddeso evamāha: ‘āyasmā, bhante, sāriputto parinibbuto; idamassa pattacīvaran’ti. Api ca me, bhante, madhurakajāto viya kāyo, disāpi me na pakkhāyanti, dhammāpi maṁ nappaṭibhanti ‘āyasmā sāriputto parinibbuto’ti sutvā\".",
    "sn47.13:5": "\"Kiṁ nu kho te, Ānanda, sāriputto sīlakkhandhaṁ vā ādāya parinibbuto, samādhikkhandhaṁ vā ādāya parinibbuto, paññākkhandhaṁ vā ādāya parinibbuto, vimuttikkhandhaṁ vā ādāya parinibbuto, vimuttiñāṇadassanakkhandhaṁ vā ādāya parinibbuto\"ti?",
    "sn47.13:6": "\"Nanu taṁ, Ānanda, mayā paṭikacceva akkhātaṁ: ‘sabbehi piyehi manāpehi nānābhāvo vinābhāvo aññathābhāvo. Taṁ kutettha, Ānanda, labbhā. Yaṁ taṁ jātaṁ bhūtaṁ saṅkhataṁ palokadhammaṁ, taṁ vata mā palujjīti – netaṁ ṭhānaṁ vijjati. Seyyathāpi, Ānanda, mahato rukkhassa tiṭṭhato sāravato yo mahantataro khandho so palujjeyya; evameva kho Ānanda, mahato bhikkhusaṅghassa tiṭṭhato sāravato sāriputto parinibbuto. Taṁ kutettha, Ānanda, labbhā. Yaṁ taṁ jātaṁ bhūtaṁ saṅkhataṁ palokadhammaṁ, taṁ vata mā palujjī’ti – netaṁ ṭhānaṁ vijjati. TasmātihĀnanda, attadīpā vihāratha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā.",
    "sn47.13:7": "KathañcĀnanda, bhikkhu attadīpo vihārati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo? IdhĀnanda, bhikkhu kāye kāyānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; vedanāsu … pe … citte … pe … dhammesu dhammānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Evaṁ kho, Ānanda, bhikkhu attadīpo vihārati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo. Ye hi keci, Ānanda, etarahi vā mamaccaye vā attadīpā viharissanti attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā; tamatagge mete, Ānanda, bhikkhū bhavissanti ye keci sikkhākāmā\"ti."
}