{
    "sn48.50:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā aṅgesu vihārati āpaṇaṁ nāma aṅgānaṁ nigamo. Tatra kho bhagavā āyasmantaṁ sāriputtaṁ āmantesi:",
    "sn48.50:2": "\"Yo so, bhante, ariyasāvako tathāgate ekantagato abhippasanno, na so tathāgate vā tathāgatāsāsane vā kaṅkheyya vā vicikiccheyya vā. Saddhassa hi, bhante, ariyasāvakassa etaṁ pāṭikaṅkhaṁ yaṁ āraddhavīriyo viharissati – akusalānaṁ dhammānaṁ pahānāya, kusalānaṁ dhammānaṁ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Yaṁ hissa, bhante, vīriyaṁ tadassa vīriyindriyaṁ.",
    "sn48.50:3": "Saddhassa hi, bhante, ariyasāvakassa āraddhavīriyassa etaṁ pāṭikaṅkhaṁ yaṁ satimā bhavissati, paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. Yā hissa, bhante, sati tadassa satindriyaṁ.",
    "sn48.50:4": "Saddhassa hi, bhante, ariyasāvakassa āraddhavīriyassa upaṭṭhitassatino etaṁ pāṭikaṅkhaṁ yaṁ vossaggārammaṇaṁ karitvā labhissati samādhiṁ, labhissati cittassa ekaggataṁ. Yo hissa, bhante, samādhi tadassa samādhindriyaṁ.",
    "sn48.50:5": "Saddhassa hi, bhante, ariyasāvakassa āraddhavīriyassa upaṭṭhitassatino samāhitacittassa etaṁ pāṭikaṅkhaṁ yaṁ evaṁ pajānissati – anamataggo kho saṁsāro. Pubbakoṭi na paññāyati avijjānīvaraṇānaṁ sattānaṁ taṇhāsaṁyojanānaṁ sandhāvataṁ saṁsarataṁ. Avijjāya tveva tamokāyassa asesavirāganirodho santametaṁ padaṁ paṇītametaṁ padaṁ, yadidaṁ – sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṁ. Yā hissa, bhante, paññā tadassa paññindriyaṁ.",
    "sn48.50:6": "Saddho so, bhante, ariyasāvako evaṁ padahitvā padahitvā evaṁ saritvā saritvā evaṁ samādahitvā samādahitvā evaṁ pajānitvā pajānitvā evaṁ abhisaddahati: ‘ime kho te dhammā ye me pubbe sutavā ahesuṁ. Tenāhaṁ etarahi kāyena ca phusitvā viharāmi, paññāya ca ativijjha passāmī’ti. Yā hissa, bhante, saddhā tadassa saddhindriyan\"ti.",
    "sn48.50:7": "\"Sādhu sādhu, sāriputta. Yo so, sāriputta, ariyasāvako tathāgate ekantagato abhippasanno, na so tathāgate vā tathāgatāsāsane vā kaṅkheyya vā vicikiccheyya vā. Saddhassa hi, sāriputta, ariyasāvakassa etaṁ pāṭikaṅkhaṁ yaṁ āraddhavīriyo viharissati – akusalānaṁ dhammānaṁ pahānāya, kusalānaṁ dhammānaṁ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Yaṁ hissa, sāriputta, vīriyaṁ tadassa vīriyindriyaṁ.",
    "sn48.50:8": "Saddhassa hi, sāriputta, ariyasāvakassa āraddhavīriyassa etaṁ pāṭikaṅkhaṁ yaṁ satimā bhavissati, paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. Yā hissa, sāriputta, sati tadassa satindriyaṁ.",
    "sn48.50:9": "Saddhassa hi, sāriputta, ariyasāvakassa āraddhavīriyassa upaṭṭhitassatino etaṁ pāṭikaṅkhaṁ yaṁ vossaggārammaṇaṁ karitvā labhissati samādhiṁ, labhissati cittassa ekaggataṁ. Yo hissa, sāriputta, samādhi tadassa samādhindriyaṁ.",
    "sn48.50:10": "Saddhassa hi, sāriputta, ariyasāvakassa āraddhavīriyassa upaṭṭhitassatino samāhitacittassa etaṁ pāṭikaṅkhaṁ yaṁ evaṁ pajānissati – anamataggo kho saṁsāro. Pubbakoṭi na paññāyati avijjānīvaraṇānaṁ sattānaṁ taṇhāsaṁyojanānaṁ sandhāvataṁ saṁsarataṁ. Avijjāya tveva tamokāyassa asesavirāganirodho santametaṁ padaṁ paṇītametaṁ padaṁ, yadidaṁ – sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṁ. Yā hissa, sāriputta, paññā tadassa paññindriyaṁ.",
    "sn48.50:11": "Saddho so, sāriputta, ariyasāvako evaṁ padahitvā padahitvā evaṁ saritvā saritvā evaṁ samādahitvā samādahitvā evaṁ pajānitvā pajānitvā evaṁ abhisaddahati: ‘ime kho te dhammā ye me pubbe sutavā ahesuṁ. Tenāhaṁ etarahi kāyena ca phusitvā viharāmi, paññāya ca ativijjha passāmī’ti. Yā hissa, sāriputta, saddhā tadassa saddhindriyan\"ti.",
    "sn48.50:12": "Jarā uṇṇābho brāhmaṇo,sāketo pubbakoṭṭhako;Pubbārāme ca cattāri,piṇḍolo āpaṇena cāti."
}