{
    "sn48.53:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā kosambiyaṁ vihārati ghositārāme. Tatra kho bhagavā bhikkhū āmantesi:",
    "sn48.53:2": "\"Bhagavaṁmūlakā no, bhante, dhammā … pe …",
    "sn48.53:3": "Katamo ca, bhikkhave, pariyāyo yaṁ pariyāyaṁ āgamma sekho bhikkhu sekhabhūmiyaṁ ṭhito ‘sekhosmī’ti pajānāti?",
    "sn48.53:4": "Puna caparaṁ, bhikkhave, sekho bhikkhu iti paṭisañcikkhati: ‘atthi nu kho ito bahiddhā añño samaṇo vā brāhmaṇo vā yo evaṁ bhūtaṁ tacchaṁ tathaṁ dhammaṁ deseti yathā bhagavā’ti? So evaṁ pajānāti: ‘Natthi kho ito bahiddhā añño samaṇo vā brāhmaṇo vā yo evaṁ bhūtaṁ tacchaṁ tathaṁ dhammaṁ deseti yathā bhagavā’ti. Ayampi kho, bhikkhave, pariyāyo yaṁ pariyāyaṁ āgamma sekho bhikkhu sekhabhūmiyaṁ ṭhito ‘sekhosmī’ti pajānāti.",
    "sn48.53:5": "Puna caparaṁ, bhikkhave, sekho bhikkhu pañcindriyāni pajānāti – saddhindriyaṁ, vīriyindriyaṁ, satindriyaṁ, samādhindriyaṁ, paññindriyaṁ. Yaṅgatikāni yaṁparamāni yaṁphalāni yaṁpariyosānāni. Na heva kho kāyena phusitvā vihārati; paññāya ca ativijjha passati. Ayampi kho, bhikkhave, pariyāyo yaṁ pariyāyaṁ āgamma sekho bhikkhu sekhabhūmiyaṁ ṭhito ‘sekhosmī’ti pajānāti.",
    "sn48.53:6": "Katamo ca, bhikkhave, pariyāyo yaṁ pariyāyaṁ āgamma asekho bhikkhu asekhabhūmiyaṁ ṭhito ‘asekhosmī’ti pajānāti? Idha, bhikkhave, asekho bhikkhu pañcindriyāni pajānāti – saddhindriyaṁ, vīriyindriyaṁ, satindriyaṁ, samādhindriyaṁ, paññindriyaṁ. Yaṅgatikāni yaṁparamāni yaṁphalāni yaṁpariyosānāni. Kāyena ca phusitvā vihārati; paññāya ca ativijjha passati. Ayampi kho, bhikkhave, pariyāyo yaṁ pariyāyaṁ āgamma asekho bhikkhu asekhabhūmiyaṁ ṭhito ‘asekhosmī’ti pajānāti.",
    "sn48.53:7": "Puna caparaṁ, bhikkhave, asekho bhikkhu cha indriyāni pajānāti. ‘Cakkhundriyaṁ, sotindriyaṁ, ghānindriyaṁ, jivhindriyaṁ, kāyindriyaṁ, manindriyaṁ – imāni kho cha indriyāni sabbena sabbaṁ sabbathā sabbaṁ aparisesaṁ nirujjhissanti, aññāni ca cha indriyāni na kuhiñci kismiñci uppajjissantī’ti pajānāti. Ayampi kho, bhikkhave, pariyāyo yaṁ pariyāyaṁ āgamma asekho bhikkhu asekhabhūmiyaṁ ṭhito ‘asekhosmī’ti pajānātī\"ti."
}