{
    "sn48.39:1": "\"Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṁ, dukkhindriyaṁ, somanassindriyaṁ, domanassindriyaṁ, upekkhindriyaṁ.",
    "sn48.39:2": "Dukkhavedaniyaṁ, bhikkhave, phassaṁ paṭicca uppajjati dukkhindriyaṁ. So dukkhitova samāno ‘dukkhitosmī’ti pajānāti. Tasseva dukkhavedaniyassa phassassa nirodhā ‘Yaṁ tajjaṁ vedayitaṁ dukkhavedaniyaṁ phassaṁ paṭicca uppannaṁ dukkhindriyaṁ taṁ nirujjhati, taṁ vūpasammatī’ti pajānāti.",
    "sn48.39:3": "Somanassavedaniyaṁ, bhikkhave, phassaṁ paṭicca uppajjati somanassindriyaṁ. So sumanova samāno ‘sumanosmī’ti pajānāti. Tasseva somanassavedaniyassa phassassa nirodhā ‘Yaṁ tajjaṁ vedayitaṁ somanassavedaniyaṁ phassaṁ paṭicca uppannaṁ somanassindriyaṁ taṁ nirujjhati, taṁ vūpasammatī’ti pajānāti.",
    "sn48.39:4": "Domanassavedaniyaṁ, bhikkhave, phassaṁ paṭicca uppajjati domanassindriyaṁ. So dummanova samāno ‘dummanosmī’ti pajānāti. Tasseva domanassavedaniyassa phassassa nirodhā ‘Yaṁ tajjaṁ vedayitaṁ domanassavedaniyaṁ phassaṁ paṭicca uppannaṁ domanassindriyaṁ taṁ nirujjhati, taṁ vūpasammatī’ti pajānāti.",
    "sn48.39:5": "Upekkhāvedaniyaṁ, bhikkhave, phassaṁ paṭicca uppajjati upekkhindriyaṁ. So upekkhakova samāno ‘upekkhakosmī’ti pajānāti. Tasseva upekkhāvedaniyassa phassassa nirodhā ‘Yaṁ tajjaṁ vedayitaṁ upekkhāvedaniyaṁ phassaṁ paṭicca uppannaṁ upekkhindriyaṁ taṁ nirujjhati, taṁ vūpasammatī’ti pajānāti.",
    "sn48.39:6": "Seyyathāpi, bhikkhave, dvinnaṁ kaṭṭhānaṁ saṅghaṭṭanasamodhānā usmā jāyati, tejo abhinibbattati; tesaṁyeva kaṭṭhānaṁ nānābhāvāvinikkhepā yā tajjā usmā sā nirujjhati sā vūpasammati; evameva kho, bhikkhave, sukhavedaniyaṁ phassaṁ paṭicca uppajjati sukhindriyaṁ. So sukhitova samāno ‘sukhitosmī’ti pajānāti. Tasseva sukhavedaniyassa phassassa nirodhā ‘Yaṁ tajjaṁ vedayitaṁ sukhavedaniyaṁ phassaṁ paṭicca uppajjati sukhindriyaṁ taṁ nirujjhati, taṁ vūpasammatī’ti pajānāti.",
    "sn48.39:7": "Dukkhavedaniyaṁ, bhikkhave, phassaṁ paṭicca … pe … somanassavedaniyaṁ, bhikkhave, phassaṁ paṭicca … pe … domanassavedaniyaṁ, bhikkhave, phassaṁ paṭicca … pe … upekkhāvedaniyaṁ, bhikkhave, phassaṁ paṭicca uppajjati upekkhindriyaṁ. So upekkhakova samāno ‘upekkhakosmī’ti pajānāti. Tasseva upekkhāvedaniyassa phassassa nirodhā ‘Yaṁ tajjaṁ vedayitaṁ upekkhāvedaniyaṁ phassaṁ paṭicca uppajjati upekkhindriyaṁ taṁ nirujjhati, taṁ vūpasammatī’ti pajānāti\"."
}