{
    "sn48.40:1": "\"Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Dukkhindriyaṁ, domanassindriyaṁ, sukhindriyaṁ, somanassindriyaṁ, upekkhindriyaṁ.",
    "sn48.40:2": "Idha pana, bhikkhave, bhikkhuno appamattassa ātāpino pahitattassa vihārato uppajjati domanassindriyaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ domanassindriyaṁ, tañca kho sanimittaṁ sanidānaṁ sasaṅkhāraṁ sappaccayaṁ. Tañca animittaṁ anidānaṁ asaṅkhāraṁ appaccayaṁ domanassindriyaṁ uppajjissatī’ti – netaṁ ṭhānaṁ vijjati. So domanassindriyañca pajānāti, domanassindriyasamudayañca pajānāti, domanassindriyanirodhañca pajānāti, yattha cuppannaṁ domanassindriyaṁ aparisesaṁ nirujjhati tañca pajānāti.",
    "sn48.40:3": "Idha pana, bhikkhave, bhikkhuno appamattassa ātāpino pahitattassa vihārato uppajjati sukhindriyaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ sukhindriyaṁ, tañca kho sanimittaṁ sanidānaṁ sasaṅkhāraṁ sappaccayaṁ. Tañca animittaṁ anidānaṁ asaṅkhāraṁ appaccayaṁ sukhindriyaṁ uppajjissatī’ti – netaṁ ṭhānaṁ vijjati. So sukhindriyañca pajānāti, sukhindriyasamudayañca pajānāti, sukhindriyanirodhañca pajānāti, yattha cuppannaṁ sukhindriyaṁ aparisesaṁ nirujjhati tañca pajānāti.",
    "sn48.40:4": "Idha pana, bhikkhave, bhikkhuno appamattassa ātāpino pahitattassa vihārato uppajjati somanassindriyaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ somanassindriyaṁ, tañca kho sanimittaṁ sanidānaṁ sasaṅkhāraṁ sappaccayaṁ. Tañca animittaṁ anidānaṁ asaṅkhāraṁ appaccayaṁ somanassindriyaṁ uppajjissatī’ti – netaṁ ṭhānaṁ vijjati. So somanassindriyañca pajānāti, somanassindriyasamudayañca pajānāti, somanassindriyanirodhañca pajānāti, yattha cuppannaṁ somanassindriyaṁ aparisesaṁ nirujjhati tañca pajānāti.",
    "sn48.40:5": "Idha pana, bhikkhave, bhikkhuno appamattassa ātāpino pahitattassa vihārato uppajjati upekkhindriyaṁ. So evaṁ pajānāti: ‘uppannaṁ kho me idaṁ upekkhindriyaṁ, tañca kho sanimittaṁ sanidānaṁ sasaṅkhāraṁ sappaccayaṁ. Tañca animittaṁ anidānaṁ asaṅkhāraṁ appaccayaṁ upekkhindriyaṁ uppajjissatī’ti – netaṁ ṭhānaṁ vijjati. So upekkhindriyañca pajānāti, upekkhindriyasamudayañca pajānāti, upekkhindriyanirodhañca pajānāti, yattha cuppannaṁ upekkhindriyaṁ aparisesaṁ nirujjhati tañca pajānāti.",
    "sn48.40:6": "Suddhikañca soto arahā,duve samaṇabrāhmaṇā;Vibhaṅgena tayo vuttā,kaṭṭho uppaṭipāṭikanti."
}