{
    "sn48.10:1": "\"Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṁ … pe … paññindriyaṁ.",
    "sn48.10:2": "Katamañca, bhikkhave, vīriyindriyaṁ? Idha, bhikkhave, ariyasāvako āraddhavīriyo vihārati akusalānaṁ dhammānaṁ pahānāya, kusalānaṁ dhammānaṁ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. So anuppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ anuppādāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati; uppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati; anuppannānaṁ kusalānaṁ dhammānaṁ uppādāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati; uppannānaṁ kusalānaṁ dhammānaṁ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati – idaṁ vuccati, bhikkhave, vīriyindriyaṁ.",
    "sn48.10:3": "Katamañca, bhikkhave, satindriyaṁ? Idha, bhikkhave, ariyasāvako satimā hoti paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. So kāye kāyānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ; vedanāsu … pe … citte … pe … dhammesu dhammānupassī vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ – idaṁ vuccati, bhikkhave, satindriyaṁ.",
    "sn48.10:4": "Katamañca, bhikkhave, samādhindriyaṁ? Idha, bhikkhave, ariyasāvako vossaggārammaṇaṁ karitvā labhati samādhiṁ, labhati cittassa ekaggataṁ. So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja vihārati. Vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja vihārati. Pītiyā ca virāgā upekkhako ca vihārati sato ca sampajāno sukhañca kāyena paṭisaṁvedeti yaṁ taṁ ariyā ācikkhanti ‘upekkhako satimā sukhavihārī’ti tatiyaṁ jhānaṁ upasampajja vihārati. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja vihārati – idaṁ vuccati, bhikkhave, samādhindriyaṁ.",
    "sn48.10:5": "Katamañca, bhikkhave, paññindriyaṁ? Idha, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya, sammā dukkhakkhayagāminiyā. So ‘idaṁ dukkhan’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhasamudayo’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodho’ti yathābhūtaṁ pajānāti, ‘Ayaṁ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṁ pajānāti – idaṁ vuccati, bhikkhave, paññindriyaṁ.",
    "sn48.10:6": "Suddhikañceva dve sotā,arahantā apare duve;Samaṇabrāhmaṇā daṭṭhabbaṁ,vibhaṅgā apare duveti."
}