{
    "sn51.13:1": "\"Chandañce, bhikkhave, bhikkhu nissāya labhati samādhiṁ, labhati cittassa ekaggataṁ – ayaṁ vuccati chandasamādhi. So anuppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ anuppādāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati. Uppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ pahānāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati. Anuppannānaṁ kusalānaṁ dhammānaṁ uppādāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati. Uppannānaṁ kusalānaṁ dhammānaṁ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti ayañca chando, ayañca chandasamādhi, ime ca padhānasaṅkhārā – ayaṁ vuccati, bhikkhave, chandasamādhippadhānasaṅkhāras;amannāgato iddhipādo.",
    "sn51.13:2": "Vīriyañce, bhikkhave, bhikkhu nissāya labhati samādhiṁ, labhati cittassa ekaggataṁ – ayaṁ vuccati ‘vīriyasamādhi’. So anuppannānaṁ … pe … uppannānaṁ kusalānaṁ dhammānaṁ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti idañca vīriyaṁ, ayañca vīriyasamādhi, ime ca padhānasaṅkhārā – ayaṁ vuccati, bhikkhave, vīriyasamādhippadhānasaṅkhāras;amannāgato iddhipādo.",
    "sn51.13:3": "Cittañce, bhikkhave, bhikkhu nissāya labhati samādhiṁ, labhati cittassa ekaggataṁ – ayaṁ vuccati ‘cittasamādhi’. So anuppannānaṁ pāpakānaṁ … pe … uppannānaṁ kusalānaṁ dhammānaṁ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti idañca cittaṁ, ayañca cittasamādhi, ime ca padhānasaṅkhārā – ayaṁ vuccati, bhikkhave, cittasamādhippadhānasaṅkhāras;amannāgato iddhipādo.",
    "sn51.13:4": "Vīmaṁsañce, bhikkhave, bhikkhu nissāya labhati samādhiṁ, labhati cittassa ekaggataṁ – ayaṁ vuccati ‘vīmaṁsāsamādhi’. So anuppannānaṁ pāpakānaṁ akusalānaṁ dhammānaṁ anuppādāya chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati … pe … uppannānaṁ kusalānaṁ dhammānaṁ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṁ janeti vāyamati vīriyaṁ ārabhati cittaṁ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti ayañca vīmaṁsā, ayañca vīmaṁsāsamādhi, ime ca padhānasaṅkhārā – ayaṁ vuccati, bhikkhave, vīmaṁsāsamādhippadhānasaṅkhārasamannāgato iddhipādo\"ti."
}