{
    "sn51.11:1": "Sāvatthinidānaṁ. \"Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi: ‘ko nu kho hetu, ko paccayo iddhi pāda bhāvanāyā’ti? Tassa mayhaṁ, bhikkhave, etadahosi: ‘idha bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṁ iddhi pāda ṁ bhāveti – iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṁ saṅkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati. Pacchāpuresaññī ca vihārati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṁ, yathā uddhaṁ tathā adho; yathā divā tathā rattiṁ, yathā rattiṁ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṁ cittaṁ bhāveti’.",
    "sn51.11:2": "Vīriyasamādhippadhānasaṅkhārasamannāgataṁ iddhi pāda ṁ bhāveti – iti me vīriyaṁ na ca atilīnaṁ bhavissati, na ca atippaggahitaṁ bhavissati, na ca ajjhattaṁ saṅkhittaṁ bhavissati, na ca bahiddhā vikkhittaṁ bhavissati. Pacchāpuresaññī ca vihārati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṁ, yathā uddhaṁ tathā adho; yathā divā tathā rattiṁ, yathā rattiṁ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṁ cittaṁ bhāveti.",
    "sn51.11:3": "Cittasamādhippadhānasaṅkhārasamannāgataṁ iddhi pāda ṁ bhāveti – iti me cittaṁ na ca atilīnaṁ bhavissati, na ca atippaggahitaṁ bhavissati, na ca ajjhattaṁ saṅkhittaṁ bhavissati, na ca bahiddhā vikkhittaṁ bhavissati. Pacchāpuresaññī ca vihārati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṁ, yathā uddhaṁ tathā adho; yathā divā tathā rattiṁ, yathā rattiṁ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṁ cittaṁ bhāveti.",
    "sn51.11:4": "Vīmaṁsāsamādhippadhānasaṅkhārasamannāgataṁ iddhi pāda ṁ bhāveti – iti me vīmaṁsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṁ saṅkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati. Pacchāpuresaññī ca vihārati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṁ, yathā uddhaṁ tathā adho; yathā divā tathā rattiṁ, yathā rattiṁ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṁ cittaṁ bhāveti.",
    "sn51.11:5": "Evaṁ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṁ bahulīkatesu, anekavihitaṁ iddhividhaṁ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṁ, tirobhāvaṁ; tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchati, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karoti, seyyathāpi udake; udakepi abhijjamāne gacchati, seyyathāpi pathaviyaṁ; ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parimasati parimajjati; yāva brahmalokāpi kāyena vasaṁ vatteti.",
    "sn51.11:6": "Evaṁ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṁ bahulīkatesu dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti – dibbe ca mānuse ca, dūre santike cāti.",
    "sn51.11:7": "Evaṁ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṁ bahulīkatesu, parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāti. Sarāgaṁ vā cittaṁ ‘sarāgaṁ cittan’ti pajānāti; vītarāgaṁ vā cittaṁ ‘vītarāgaṁ cittan’ti pajānāti; sadosaṁ vā cittaṁ ‘sadosaṁ cittan’ti pajānāti; vītadosaṁ vā cittaṁ ‘vītadosaṁ cittan’ti pajānāti; samohaṁ vā cittaṁ ‘samohaṁ cittan’ti pajānāti; vītamohaṁ vā cittaṁ ‘vītamohaṁ cittan’ti pajānāti; saṅkhittaṁ vā cittaṁ ‘saṅkhittaṁ cittan’ti pajānāti; vikkhittaṁ vā cittaṁ ‘vikkhittaṁ cittan’ti pajānāti; mahaggataṁ vā cittaṁ ‘mahaggataṁ cittan’ti pajānāti; amahaggataṁ vā cittaṁ ‘amahaggataṁ cittan’ti pajānāti; sauttaraṁ vā cittaṁ ‘sauttaraṁ cittan’ti pajānāti; anuttaraṁ vā cittaṁ ‘anuttaraṁ cittan’ti pajānāti; samāhitaṁ vā cittaṁ ‘samāhitaṁ cittan’ti pajānāti; asamāhitaṁ vā cittaṁ ‘asamāhitaṁ cittan’ti pajānāti; vimuttaṁ vā cittaṁ ‘vimuttaṁ cittan’ti pajānāti; avimuttaṁ vā cittaṁ ‘avimuttaṁ cittan’ti pajānāti.",
    "sn51.11:8": "Evaṁ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṁ bahulīkatesu, anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ – ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe: ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati.",
    "sn51.11:9": "Evaṁ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṁ bahulīkatesu, dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti: ‘ime vata, bhonto, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā; te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana, bhonto, sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā; te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte, suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti.",
    "sn51.11:10": "Evaṁ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṁ bahulīkatesu, āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāratī\"ti."
}