{
    "sn54.10:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā kimilāyaṁ vihārati veḷuvane. Tatra kho bhagavā āyasmantaṁ kimilaṁ āmantesi: \"Kathaṁ bhāvito nu kho, kimila, ānāpānassatisamādhi kathaṁ bahulīkato mahapphalo hoti mahānisaṁso\"ti?",
    "sn54.10:2": "Evaṁ vutte, āyasmā kimilo tuṇhī ahosi. Dutiyampi kho bhagavā … pe … tatiyampi kho bhagavā āyasmantaṁ kimilaṁ āmantesi: \"Kathaṁ bhāvito nu kho, kimila, ānāpānassatisamādhi kathaṁ bahulīkato mahapphalo hoti mahānisaṁso\"ti? Tatiyampi kho āyasmā kimilo tuṇhī ahosi.",
    "sn54.10:3": "Evaṁ vutte, āyasmā ānando bhagavantaṁ etadavoca: \"etassa, bhagavā, kālo; etassa, sugata, kālo. Yaṁ bhagavā ānāpānassatisamādhiṁ bhāseyya, bhagavato sutvā bhikkhū dhāressantī\"ti.",
    "sn54.10:4": "\"TenahĀnanda, suṇāhi, sādhukaṁ manasi karohi; bhāsissāmī\"ti.",
    "sn54.10:5": "Yasmiṁ samaye, Ānanda, bhikkhu dīghaṁ vā assasanto ‘dīghaṁ assasāmī’ti pajānāti, dīghaṁ vā passasanto ‘dīghaṁ passasāmī’ti pajānāti; rassaṁ vā assasanto ‘rassaṁ assasāmī’ti pajānāti, rassaṁ vā passasanto ‘rassaṁ passasāmī’ti pajānāti; ‘sabbakāyappaṭisaṁvedī assasissāmī’ti sikkhati, ‘sabbakāyappaṭisaṁvedī passasissāmī’ti sikkhati; ‘passambhayaṁ kāyasaṅkhāraṁ assasissāmī’ti sikkhati, ‘passambhayaṁ kāyasaṅkhāraṁ passasissāmī’ti sikkhati – kāye kāyānupassī, Ānanda, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Taṁ kissa hetu? Kāyaññatarāhaṁ, Ānanda, etaṁ vadāmi yadidaṁ – assāsapassāsaṁ. TasmātihĀnanda, kāye kāyānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.",
    "sn54.10:6": "Yasmiṁ samaye, Ānanda, bhikkhu ‘pītippaṭisaṁvedī assasissāmī’ti sikkhati, ‘pītippaṭisaṁvedī passasissāmī’ti sikkhati; ‘sukhappaṭisaṁvedī assasissāmī’ti sikkhati, ‘sukhappaṭisaṁvedī passasissāmī’ti sikkhati; ‘cittasaṅkhārappaṭisaṁvedī assasissāmī’ti sikkhati, ‘cittasaṅkhārappaṭisaṁvedī passasissāmī’ti sikkhati; ‘passambhayaṁ cittasaṅkhāraṁ passasissāmī’ti sikkhati – vedanāsu vedanānupassī, Ānanda, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Taṁ kissa hetu? Vedanāññatarāhaṁ, Ānanda, etaṁ vadāmi, yadidaṁ – assāsapassāsānaṁ sādhukaṁ manasikāraṁ. TasmātihĀnanda, vedanāsu vedanānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.(2)",
    "sn54.10:7": "Yasmiṁ samaye, Ānanda, bhikkhu ‘cittappaṭisaṁvedī assasissāmī’ti sikkhati, ‘cittappaṭisaṁvedī passasissāmī’ti sikkhati; abhippamodayaṁ cittaṁ … pe … samādahaṁ cittaṁ … ‘vimocayaṁ cittaṁ assasissāmī’ti sikkhati, ‘vimocayaṁ cittaṁ passasissāmī’ti sikkhati – citte cittānupassī, Ānanda, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Taṁ kissa hetu? Nāhaṁ, Ānanda, muṭṭhassatissa asampajānassa ānāpānassatisamādhibhāvanaṁ vadāmi. TasmātihĀnanda, citte cittānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.(3)",
    "sn54.10:8": "Yasmiṁ samaye, Ānanda, bhikkhu ‘aniccānupassī assasissāmī’ti sikkhati … pe … virāgānupassī … nirodhānupassī … ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati – dhammesu dhammānupassī, Ānanda, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. So yaṁ taṁ hoti abhijjhādomanassānaṁ pahānaṁ taṁ paññāya disvā sādhukaṁ ajjhupekkhitā hoti. TasmātihĀnanda, dhammesu dhammānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.(4)",
    "sn54.10:9": "Seyyathāpi, Ānanda, catumahāpathe mahāpaṁsupuñjo. Puratthimāya cepi disāyaṁ āgaccheyya sakaṭaṁ vā ratho vā, upahanateva taṁ paṁsupuñjaṁ; pacchimāya cepi disāya āgaccheyya … uttarāya cepi disāya … dakkhiṇāya cepi disāya āgaccheyya sakaṭaṁ vā ratho vā, upahanateva taṁ paṁsupuñjaṁ. Evameva kho, Ānanda, bhikkhu kāye kāyānupassī vihārantopi upahanateva pāpake akusale dhamme; vedanāsu … pe … citte … pe … dhammesu dhammānupassī vihārantopi upahanateva pāpake akusale dhamme\"ti.",
    "sn54.10:10": "Ekadhammo ca bojjhaṅgo,suddhikañca duve phalā;Ariṭṭho kappino dīpo,vesālī kimilena cāti."
}