{
    "sn54.12:1": "Ekaṁ samayaṁ āyasmā lomasakaṁbhiyo sakkesu vihārati kapilavatthusmiṁ nigrodhārāme. Atha kho mahānāmo sakko yenāyasmā lomasakaṁbhiyo tenupasaṅkami; upasaṅkamitvā āyasmantaṁ lomasakaṁbhiyaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho mahānāmo sakko āyasmantaṁ lomasakaṁbhiyaṁ etadavoca:",
    "sn54.12:2": "\"Na kho, āvuso mahānāma, sveva sekho vihāro, so tathāgatavihāro. Añño kho, āvuso mahānāma, sekho vihāro, añño tathāgatavihāro.",
    "sn54.12:3": "Yepi te, āvuso mahānāma, bhikkhū sekhā appattamānasā anuttaraṁ yogakkhemaṁ patthayamānā vihāranti, te ime pañca nīvaraṇe pahāya vihāranti.",
    "sn54.12:4": "Ye ca kho te, āvuso mahānāma, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṁyojanā sammadaññāvimuttā, tesaṁ pañca nīvaraṇā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anup pāda dhammā. Katame pañca? Kāmacchandanīvaraṇaṁ pahīnaṁ ucchinnamūlaṁ tālāvatthukataṁ anabhāvaṅkataṁ āyatiṁ anup pāda dhammaṁ; byā pāda nīvaraṇaṁ pahīnaṁ … pe … thinamiddhanīvaraṇaṁ … uddhaccakukkuccanīvaraṇaṁ … vicikicchānīvaraṇaṁ pahīnaṁ ucchinnamūlaṁ tālāvatthukataṁ anabhāvaṅkataṁ āyatiṁ anup pāda dhammaṁ.",
    "sn54.12:5": "Ye te, āvuso mahānāma, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṁyojanā sammadaññāvimuttā, tesaṁ ime pañca nīvaraṇā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṁ anup pāda dhammā. Tadamināpetaṁ, āvuso mahānāma, pariyāyena veditabbaṁ yathā – aññova sekho vihāro, añño tathāgatavihāro.",
    "sn54.12:6": "Ekamidaṁ, āvuso mahānāma, samayaṁ bhagavā icchānaṅgale vihārati icchānaṅgalavanasaṇḍe. Tatra kho, āvuso mahānāma, bhagavā bhikkhū āmantesi: ‘icchāmahaṁ, bhikkhave, temāsaṁ paṭisallīyituṁ. Nāmhi kenaci upasaṅkamitabbo, aññatra ekena piṇḍapātanīhārakenā’ti. ‘Evaṁ, bhante’ti kho, āvuso mahānāma, te bhikkhū bhagavato paṭissutvā nāssudha koci bhagavantaṁ upasaṅkamati, aññatra ekena piṇḍapātanīhārakena.",
    "sn54.12:7": "Atha kho, āvuso, bhagavā tassa temāsassa accayena paṭisallānā vuṭṭhito bhikkhū āmantesi: ‘sace kho, bhikkhave, aññatitthiyā paribbājakā evaṁ puccheyyuṁ: \"katamenāvuso, vihārena samaṇo gotamo vassāvāsaṁ bahulaṁ vihāsī\"ti, evaṁ puṭṭhā tumhe, bhikkhave, tesaṁ aññatitthiyānaṁ paribbājakānaṁ evaṁ byākareyyātha: \"ānāpānassatisamādhinā kho, āvuso, bhagavā vassāvāsaṁ bahulaṁ vihāsī\"’ti. Idhāhaṁ, bhikkhave, sato assasāmi, sato passasāmi. Dīghaṁ assasanto dīghaṁ assasāmīti pajānāmi, dīghaṁ passasanto dīghaṁ passasāmīti pajānāmi … pe … paṭinissaggānupassī assasissāmīti pajānāmi, paṭinissaggānupassī passasissāmīti pajānāmi.",
    "sn54.12:8": "Yañhi taṁ, bhikkhave, sammā vadamāno vadeyya – ariyavihāro itipi, brahmavihāro itipi, tathāgatavihāro itipi. Ānāpānassatisamādhiṁ sammā vadamāno vadeyya – ariyavihāro itipi, brahmavihāro itipi, tathāgatavihāro itipi.",
    "sn54.12:9": "Ye te, bhikkhave, bhikkhū sekhā appattamānasā anuttaraṁ yogakkhemaṁ patthayamānā vihāranti, tesaṁ ānāpānassatisamādhi bhāvito bahulīkato āsavānaṁ khayāya saṁvattati.",
    "sn54.12:10": "Ye ca kho te, bhikkhave, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṁyojanā sammadaññāvimuttā, tesaṁ ānāpānassatisamādhi bhāvito bahulīkato diṭṭheva dhamme sukhavihārāya ceva saṁvattati satisampajaññāya ca.",
    "sn54.12:11": "Yañhi taṁ, bhikkhave, sammā vadamāno vadeyya – ariyavihāro itipi, brahmavihāro itipi, tathāgatavihāro itipi. Ānāpānassatisamādhiṁ sammā vadamāno vadeyya – ariyavihāro itipi, brahmavihāro itipi, tathāgatavihāro itipīti."
}