{
    "sn54.16:1": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinne kho te bhikkhū bhagavā etadavoca: \"atthi nu kho, bhikkhave, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī\"ti? \"Bhagavaṁmūlakā no, bhante, dhammā … pe … bhagavato sutvā bhikkhū dhāressantī\"ti. \"Atthi, bhikkhave, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrenti.",
    "sn54.16:2": "Katamo ca, bhikkhave, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrenti? Ānāpānassatisamādhi, bhikkhave, ekadhammo bhāvito bahulīkato cattāro satipaṭṭhāne paripūreti, cattāro satipaṭṭhānā bhāvitā bahulīkatā satta bojjhaṅge paripūrenti, satta bojjhaṅgā bhāvitā bahulīkatā vijjāvimuttiṁ paripūrentīti.",
    "sn54.16:3": "Kathaṁ bhāvito ca, bhikkhave, ānāpānassatisamādhi kathaṁ bahulīkato cattāro satipaṭṭhāne paripūreti? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā. So satova assasati, satova passasati … pe … ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati.",
    "sn54.16:4": "Yasmiṁ samaye, bhikkhave, bhikkhu dīghaṁ vā assasanto ‘dīghaṁ assasāmī’ti pajānāti, dīghaṁ vā passasanto ‘dīghaṁ passasāmī’ti pajānāti, rassaṁ vā assasanto ‘rassaṁ assasāmī’ti pajānāti … pe … sabbakāyappaṭisaṁvedī … pe … ‘passambhayaṁ kāyasaṅkhāraṁ assasissāmī’ti sikkhati, ‘passambhayaṁ kāyasaṅkhāraṁ passasissāmī’ti sikkhati – kāye kāyānupassī, bhikkhave, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Taṁ kissa hetu? Kāyaññatarāhaṁ, bhikkhave, etaṁ vadāmi, yadidaṁ – assāsapassāsaṁ. Tasmātiha, bhikkhave, kāye kāyānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.",
    "sn54.16:5": "Yasmiṁ samaye, bhikkhave, bhikkhu pītippaṭisaṁvedī … pe … sukhappaṭisaṁvedī … cittasaṅkhārappaṭisaṁvedī … ‘passambhayaṁ cittasaṅkhāraṁ assasissāmī’ti sikkhati, ‘passambhayaṁ cittasaṅkhāraṁ passasissāmī’ti sikkhati – vedanāsu vedanānupassī, bhikkhave, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Taṁ kissa hetu? Vedanāññatarāhaṁ, bhikkhave, etaṁ vadāmi, yadidaṁ – assāsapassāsānaṁ sādhukaṁ manasikāraṁ. Tasmātiha, bhikkhave, vedanāsu vedanānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.(2)",
    "sn54.16:6": "Yasmiṁ samaye, bhikkhave, bhikkhu cittappaṭisaṁvedī … pe … abhippamodayaṁ cittaṁ … pe … ‘samādahaṁ cittaṁ assasissāmī’ti sikkhati, ‘samādahaṁ cittaṁ passasissāmī’ti sikkhati; ‘vimocayaṁ cittaṁ assasissāmī’ti sikkhati, ‘vimocayaṁ cittaṁ passasissāmī’ti sikkhati – citte cittānupassī, bhikkhave, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Taṁ kissa hetu? Nāhaṁ, bhikkhave, muṭṭhassatissa asampajānassa ānāpānassatisamādhibhāvanaṁ vadāmi. Tasmātiha, bhikkhave, citte cittānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.(3)",
    "sn54.16:7": "Yasmiṁ samaye, bhikkhave, bhikkhu aniccānupassī … pe … virāgānupassī … pe … nirodhānupassī … pe … ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati – dhammesu dhammānupassī, bhikkhave, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. So yaṁ taṁ hoti abhijjhādomanassānaṁ pahānaṁ taṁ paññāya disvā sādhukaṁ ajjhupekkhitā hoti. Tasmātiha, bhikkhave, dhammesu dhammānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.(4)",
    "sn54.16:8": "Evaṁ bhāvito kho, bhikkhave, ānāpānassatisamādhi evaṁ bahulīkato cattāro satipaṭṭhāne paripūreti.",
    "sn54.16:9": "Kathaṁ bhāvitā ca, bhikkhave, cattāro satipaṭṭhānā kathaṁ bahulīkatā satta bojjhaṅge paripūrenti? Yasmiṁ samaye, bhikkhave, bhikkhu kāye kāyānupassī vihārati – upaṭṭhitāssa tasmiṁ samaye bhikkhuno sati hoti asammuṭṭhā. Yasmiṁ samaye, bhikkhave, bhikkhuno upaṭṭhitā sati asammuṭṭhā – satisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, satisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, satisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.",
    "sn54.16:10": "So tathāsato vihāranto taṁ dhammaṁ paññāya pavicinati pavicarati parivīmaṁsamāpajjati. Yasmiṁ samaye, bhikkhave, bhikkhu tathāsato vihāranto taṁ dhammaṁ paññāya pavicinati pavicarati parivīmaṁsamāpajjati – dhammavicayasambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, dhammavicayasambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, dhammavicayasambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(2)",
    "sn54.16:11": "Tassa taṁ dhammaṁ paññāya pavicinato pavicarato parivīmaṁsamāpajjato āraddhaṁ hoti vīriyaṁ asallīnaṁ. Yasmiṁ samaye, bhikkhave, bhikkhuno taṁ dhammaṁ paññāya pavicinato pavicarato parivīmaṁsamāpajjato āraddhaṁ hoti vīriyaṁ asallīnaṁ – vīriyasambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, vīriyasambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, vīriyasambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(3)",
    "sn54.16:12": "Āraddhavīriyassa uppajjati pīti nirāmisā. Yasmiṁ samaye, bhikkhave, bhikkhuno āraddhavīriyassa uppajjati pīti nirāmisā – pītisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, pītisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, pītisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(4)",
    "sn54.16:13": "Pītimanassa kāyopi passambhati, cittampi passambhati. Yasmiṁ samaye, bhikkhave, bhikkhuno pītimanassa kāyopi passambhati, cittampi passambhati – passaddhisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, passaddhisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, passaddhisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(5)",
    "sn54.16:14": "Passaddhakāyassa sukhino cittaṁ samādhiyati. Yasmiṁ samaye, bhikkhave, bhikkhuno passaddhakāyassa sukhino cittaṁ samādhiyati – samādhisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, samādhisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, samādhisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(6)",
    "sn54.16:15": "So tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti. Yasmiṁ samaye, bhikkhave, bhikkhu tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti – upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, upekkhāsambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(7)",
    "sn54.16:16": "Yasmiṁ samaye, bhikkhave, bhikkhu vedanāsu … pe … citte … pe … dhammesu dhammānupassī vihārati – upaṭṭhitāssa tasmiṁ samaye bhikkhuno sati hoti asammuṭṭhā. Yasmiṁ samaye, bhikkhave, bhikkhuno upaṭṭhitā sati hoti asammuṭṭhā – satisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, satisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti – satisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati … pe … .",
    "sn54.16:17": "So tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti. Yasmiṁ samaye, bhikkhave, bhikkhu tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti – upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, upekkhāsambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati. Evaṁ bhāvitā kho, bhikkhave, cattāro satipaṭṭhānā evaṁ bahulīkatā satta bojjhaṅge paripūrenti.",
    "sn54.16:18": "Kathaṁ bhāvitā ca, bhikkhave, satta bojjhaṅgā kathaṁ bahulīkatā vijjāvimuttiṁ paripūrenti? Idha, bhikkhave, bhikkhu satisambojjhaṅgaṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ; dhammavicayasambojjhaṅgaṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ … pe … upekkhāsambojjhaṅgaṁ bhāveti vivekanissitaṁ virāganissitaṁ nirodhanissitaṁ vossaggapariṇāmiṁ. Evaṁ bhāvitā kho, bhikkhave, satta bojjhaṅgā evaṁ bahulīkatā vijjāvimuttiṁ paripūrentī\"ti."
}