{
    "sn54.9:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā vesāliyaṁ vihārati mahāvane kūṭāgārasālāyaṁ. Tena kho pana samayena bhagavā bhikkhūnaṁ anekapariyāyena asubhakathaṁ katheti, asubhāya vaṇṇaṁ bhāsati, asubhabhāvanāya vaṇṇaṁ bhāsati.",
    "sn54.9:2": "Atha kho bhagavā bhikkhū āmantesi: \"Icchāmahaṁ, bhikkhave, aḍḍhamāsaṁ paṭisallīyituṁ. Nāmhi kenaci upasaṅkamitabbo, aññatra ekena piṇḍapātanīhārakenā\"ti.",
    "sn54.9:3": "Atha kho te bhikkhū: \"Bhagavā anekapariyāyena asubhakathaṁ katheti, asubhāya vaṇṇaṁ bhāsati, asubhabhāvanāya vaṇṇaṁ bhāsatī\"ti anekākāravokāraṁ asubhabhāvanānuyogamanuyuttā vihāranti. Te iminā kāyena aṭṭīyamānā harāyamānā jigucchamānā satthahārakaṁ pariyesanti. Dasapi bhikkhū ekāhena satthaṁ āharanti, vīsampi … pe … tiṁsampi bhikkhū ekāhena satthaṁ āharanti.",
    "sn54.9:4": "Atha kho bhagavā tassa aḍḍhamāsassa accayena paṭisallānā vuṭṭhito āyasmantaṁ Ānandaṁ āmantesi: \"Kiṁ nu kho, Ānanda, tanubhūto viya bhikkhusaṅgho\"ti?",
    "sn54.9:5": "\"TenahĀnanda, yāvatikā bhikkhū vesāliṁ upanissāya vihāranti te sabbe upaṭṭhānasālāyaṁ sannipātehī\"ti.",
    "sn54.9:6": "Atha kho bhagavā yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi:",
    "sn54.9:7": "Seyyathāpi, bhikkhave, gimhānaṁ pacchime māse ūhataṁ rajojallaṁ, tamenaṁ mahāakālamegho ṭhānaso antaradhāpeti vūpasameti; evameva kho, bhikkhave, ānāpānassatisamādhi bhāvito bahulīkato santo ceva paṇīto ca asecanako ca sukho ca vihāro uppannuppanne ca pāpake akusale dhamme ṭhānaso antaradhāpeti vūpasameti. Kathaṁ bhāvito ca, bhikkhave, ānāpānassatisamādhi kathaṁ bahulīkato santo ceva paṇīto ca asecanako ca sukho ca vihāro uppannuppanne ca pāpake akusale dhamme ṭhānaso antaradhāpeti vūpasameti?",
    "sn54.9:8": "Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā. So satova assasati, satova passasati … pe … ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati."
}