{
    "sn54.13:1": "Sāvatthinidānaṁ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:",
    "sn54.13:2": "\"Atthi kho, Ānanda, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī\"ti.",
    "sn54.13:3": "\"Katamo pana, bhante, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī\"ti?",
    "sn54.13:4": "Kathaṁ bhāvito, Ānanda, ānāpānassatisamādhi kathaṁ bahulīkato cattāro satipaṭṭhāne paripūreti? IdhĀnanda, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā. So satova assasati, satova passasati. Dīghaṁ vā assasanto ‘dīghaṁ assasāmī’ti pajānāti, dīghaṁ vā passasanto ‘dīghaṁ passasāmī’ti pajānāti … pe … ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati.",
    "sn54.13:5": "Yasmiṁ samaye, Ānanda, bhikkhu dīghaṁ vā assasanto ‘dīghaṁ assasāmī’ti pajānāti, dīghaṁ vā passasanto ‘dīghaṁ passasāmī’ti pajānāti; rassaṁ vā … pe … ‘passambhayaṁ kāyasaṅkhāraṁ assasissāmī’ti sikkhati, ‘passambhayaṁ kāyasaṅkhāraṁ passasissāmī’ti sikkhati – kāye kāyānupassī, Ānanda, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Taṁ kissa hetu? Kāyaññatarāhaṁ, Ānanda, etaṁ vadāmi, yadidaṁ – assāsapassāsaṁ. TasmātihĀnanda, kāye kāyānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.",
    "sn54.13:6": "Yasmiṁ samaye, Ānanda, bhikkhu ‘pītippaṭisaṁvedī assasissāmī’ti sikkhati, sukhappaṭisaṁvedī … pe … cittasaṅkhārappaṭisaṁvedī … ‘passambhayaṁ cittasaṅkhāraṁ assasissāmī’ti sikkhati, ‘passambhayaṁ cittasaṅkhāraṁ passasissāmī’ti sikkhati – vedanāsu vedanānupassī, Ānanda, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Taṁ kissa hetu? Vedanāññatarāhaṁ, Ānanda, etaṁ vadāmi, yadidaṁ – assāsapassāsānaṁ sādhukaṁ manasikāraṁ. TasmātihĀnanda, vedanāsu vedanānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.(2)",
    "sn54.13:7": "Yasmiṁ samaye, Ānanda, bhikkhu ‘cittappaṭisaṁvedī assasissāmī’ti sikkhati, ‘cittappaṭisaṁvedī passasissāmī’ti sikkhati; abhippamodayaṁ cittaṁ … pe … samādahaṁ cittaṁ … ‘vimocayaṁ cittaṁ assasissāmī’ti sikkhati, ‘vimocayaṁ cittaṁ passasissāmī’ti sikkhati – citte cittānupassī, Ānanda, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. Taṁ kissa hetu? Nāhaṁ, Ānanda, muṭṭhassatissa asampajānassa ānāpānassatisamādhibhāvanaṁ vadāmi. TasmātihĀnanda, citte cittānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.(3)",
    "sn54.13:8": "Yasmiṁ samaye, Ānanda, bhikkhu aniccānupassī … pe … virāgānupassī … nirodhānupassī … ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati – dhammesu dhammānupassī, Ānanda, bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ. So yaṁ taṁ hoti abhijjhādomanassānaṁ pahānaṁ taṁ paññāya disvā sādhukaṁ ajjhupekkhitā hoti. TasmātihĀnanda, dhammesu dhammānupassī bhikkhu tasmiṁ samaye vihārati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṁ.(4)",
    "sn54.13:9": "Evaṁ bhāvito kho, Ānanda, ānāpānassatisamādhi evaṁ bahulīkato cattāro satipaṭṭhāne paripūreti.",
    "sn54.13:10": "Kathaṁ bhāvitā cĀnanda, cattāro satipaṭṭhānā kathaṁ bahulīkatā satta bojjhaṅge paripūrenti?",
    "sn54.13:11": "So tathā sato vihāranto taṁ dhammaṁ paññāya pavicinati pavicarati parivīmaṁsamāpajjati. Yasmiṁ samaye, Ānanda, bhikkhu tathā sato vihāranto taṁ dhammaṁ paññāya pavicinati pavicarati parivīmaṁsamāpajjati – dhammavicayasambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, dhammavicayasambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, dhammavicayasambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(2)",
    "sn54.13:12": "Tassa taṁ dhammaṁ paññāya pavicinato pavicarato parivīmaṁsamāpajjato āraddhaṁ hoti vīriyaṁ asallīnaṁ. Yasmiṁ samaye, Ānanda, bhikkhuno taṁ dhammaṁ paññāya pavicinato pavicarato parivīmaṁsamāpajjato āraddhaṁ hoti vīriyaṁ asallīnaṁ – vīriyasambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, vīriyasambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, vīriyasambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(3)",
    "sn54.13:13": "Āraddhavīriyassa uppajjati pīti nirāmisā. Yasmiṁ samaye, Ānanda, bhikkhuno āraddhavīriyassa uppajjati pīti nirāmisā – pītisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, pītisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, pītisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(4)",
    "sn54.13:14": "Pītimanassa kāyopi passambhati, cittampi passambhati. Yasmiṁ samaye, Ānanda, bhikkhuno pītimanassa kāyopi passambhati, cittampi passambhati – passaddhisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, passaddhisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, passaddhisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(5)",
    "sn54.13:15": "Passaddhakāyassa sukhino cittaṁ samādhiyati. Yasmiṁ samaye, Ānanda, bhikkhuno passaddhakāyassa sukhino cittaṁ samādhiyati – samādhisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, samādhisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, samādhisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(6)",
    "sn54.13:16": "So tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti. Yasmiṁ samaye, Ānanda, bhikkhu tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti – upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, upekkhāsambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.(7)",
    "sn54.13:17": "Yasmiṁ samaye, Ānanda, bhikkhu vedanāsu … pe … citte … pe … dhammesu dhammānupassī vihārati – upaṭṭhitāssa tasmiṁ samaye bhikkhuno sati hoti asammuṭṭhā. Yasmiṁ samaye, Ānanda, bhikkhuno upaṭṭhitā sati hoti asammuṭṭhā – satisambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, satisambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, satisambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.",
    "sn54.13:18": "So tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti. Yasmiṁ samaye, Ānanda, bhikkhu tathāsamāhitaṁ cittaṁ sādhukaṁ ajjhupekkhitā hoti – upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno āraddho hoti, upekkhāsambojjhaṅgaṁ tasmiṁ samaye bhikkhu bhāveti, upekkhāsambojjhaṅgo tasmiṁ samaye bhikkhuno bhāvanāpāripūriṁ gacchati.",
    "sn54.13:19": "Kathaṁ bhāvitā, Ānanda, satta bojjhaṅgā kathaṁ bahulīkatā vijjāvimuttiṁ paripūrenti?"
}