{
    "sn55.28:1": "Sāvatthinidānaṁ. Ekamantaṁ nisinnaṁ kho anāthapiṇḍikaṁ gahapatiṁ bhagavā etadavoca: \"yato kho, gahapati, ariyasāvakassa pañca bhayāni verāni vūpasantāni ca honti, catūhi ca sotāpattiyaṅgehi samannāgato hoti, ariyo cassa ñāyo paññāya sudiṭṭho hoti suppaṭividdho, so ākaṅkhamāno attanāva attānaṁ byākareyya: ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto; sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’.",
    "sn55.28:2": "Katamāni pañca bhayāni verāni vūpasantāni honti? Yaṁ, gahapati, pāṇātipātī pāṇātipātappaccayā diṭṭhadhammikampi bhayaṁ veraṁ pāsavāti, samparāyikampi bhayaṁ veraṁ pāsavāti, cetasikampi dukkhaṁ domanassaṁ paṭisaṁvediyati. Pāṇātipātā paṭiviratassa evaṁ taṁ bhayaṁ veraṁ vūpasantaṁ hoti. Yaṁ, gahapati, adinnādāyī … pe … yaṁ, gahapati, kāmesumicchācārī … pe … yaṁ, gahapati, musāvādī … pe … yaṁ, gahapati, surāmerayamajjappamādaṭṭhāyī surāmerayamajjappamādaṭṭhānappaccayā diṭṭhadhammikampi bhayaṁ veraṁ pāsavāti, samparāyikampi bhayaṁ veraṁ pāsavāti, cetasikampi dukkhaṁ domanassaṁ paṭisaṁvediyati. Surāmerayamajjappamādaṭṭhānā paṭiviratassa evaṁ taṁ bhayaṁ veraṁ vūpasantaṁ hoti. Imāni pañca bhayāni verāni vūpasantāni honti.",
    "sn55.28:3": "Katamehi catūhi sotāpattiyaṅgehi samannāgato hoti? Idha, gahapati, ariyasāvako buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … ariyakantehi sīlehi samannāgato hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Imehi catūhi sotāpattiyaṅgehi samannāgato hoti.",
    "sn55.28:4": "Katamo cassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho? Idha, gahapati, ariyasāvako paṭiccasamup pāda ññeva sādhukaṁ yoniso manasi karoti – iti imasmiṁ sati idaṁ hoti, imassuppādā idaṁ uppajjati; iti imasmiṁ asati idaṁ na hoti, imassa nirodhā idaṁ nirujjhati; yadidaṁ avijjāpaccayā saṅkhārā, saṅkhārapaccayā viññāṇaṁ … pe … evametassa kevalassa dukkhakkhandhassa samudayo hoti. Avijjāya tveva asesavirāganirodhā saṅkhāranirodho … pe … evametassa kevalassa dukkhakkhandhassa nirodho hoti. Ayamassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho.",
    "sn55.28:5": "Yato kho, gahapati, ariyasāvakassa imāni pañca bhayāni verāni vūpasantāni honti, imehi catūhi sotāpattiyaṅgehi samannāgato hoti, ayañcassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho. So ākaṅkhamāno attanāva attānaṁ byākareyya: ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto; sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’\"ti."
}