{
    "sn55.24:1": "Kapilavatthunidānaṁ. Tena kho pana samayena saraṇāni sakko kālaṅkato hoti. So bhagavatā byākato: \"sotāpanno avinipātadhammo niyato sambodhiparāyaṇo\"ti. Tatra sudaṁ sambahulā sakkā saṅgamma samāgamma ujjhāyanti khīyanti vipācenti: \"acchariyaṁ vata bho, abbhutaṁ vata bho. Ettha dāni ko na sotāpanno bhavissati. Yatra hi nāma saraṇāni sakko kālaṅkato; so bhagavatā byākato: ‘sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’ti. Saraṇāni sakko sikkhādubbalyamāpādi, majjapānaṁ apāyī\"ti.",
    "sn55.24:2": "Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho mahānāmo sakko bhagavantaṁ etadavoca:",
    "sn55.24:3": "\"Yo so, mahānāma, dīgharattaṁ upāsako buddhaṁ saraṇaṁ gato dhammaṁ saraṇaṁ gato saṅghaṁ saraṇaṁ gato, so kathaṁ vinipātaṁ gaccheyya. Yañhi taṁ, mahānāma, sammā vadamāno vadeyya: ‘dīgharattaṁ upāsako buddhaṁ saraṇaṁ gato dhammaṁ saraṇaṁ gato saṅghaṁ saraṇaṁ gato’ti, saraṇāni sakkaṁ sammā vadamāno vadeyya. Saraṇāni, mahānāma, sakko dīgharattaṁ upāsako buddhaṁ saraṇaṁ gato dhammaṁ saraṇaṁ gato saṅghaṁ saraṇaṁ gato. So kathaṁ vinipātaṁ gaccheyya.",
    "sn55.24:4": "Idha, mahānāma, ekacco puggalo buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … hāsapañño javanapañño vimuttiyā ca samannāgato. So āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihārati. Ayampi kho, mahānāma, puggalo parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā.",
    "sn55.24:5": "Idha pana, mahānāma, ekacco puggalo buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … hāsapañño javanapañño na ca vimuttiyā samannāgato. So pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Ayampi kho, mahānāma, puggalo parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā.",
    "sn55.24:6": "Idha pana, mahānāma, ekacco puggalo buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … na hāsapañño na javanapañño na ca vimuttiyā samannāgato. So tiṇṇaṁ saṁyojanānaṁ parikkhayā rāgadosamohānaṁ tanuttā sakadāgāmī hoti, sakideva imaṁ lokaṁ āgantvā dukkhassantaṁ karoti. Ayampi kho, mahānāma, puggalo parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā.",
    "sn55.24:7": "Idha pana, mahānāma, ekacco puggalo buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti; dhamme … pe … saṅghe … pe … na hāsapañño na javanapañño na ca vimuttiyā samannāgato. So tiṇṇaṁ saṁyojanānaṁ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇoti. Ayampi kho, mahānāma, puggalo parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā.",
    "sn55.24:8": "Idha pana, mahānāma, ekacco puggalo na heva kho buddhe aveccappasādena samannāgato hoti … na dhamme … pe … na saṅghe … pe … na hāsapañño na javanapañño na ca vimuttiyā samannāgato. Api cassa ime dhammā honti – saddhindriyaṁ, vīriyindriyaṁ, satindriyaṁ, samādhindriyaṁ, paññindriyaṁ. Tathāgatappaveditā cassa dhammā paññāya mattaso nijjhanaṁ khamanti. Ayampi kho, mahānāma, puggalo agantā nirayaṁ agantā tiracchānayoniṁ agantā pettivisayaṁ agantā apāyaṁ duggatiṁ vinipātaṁ.",
    "sn55.24:9": "Idha pana, mahānāma, ekacco puggalo na heva kho buddhe aveccappasādena samannāgato hoti … na dhamme … pe … na saṅghe … pe … na hāsapañño na javanapañño na ca vimuttiyā samannāgato, api cassa ime dhammā honti saddhindriyaṁ … pe … paññindriyaṁ. Tathāgate cassa saddhāmattaṁ hoti pemamattaṁ. Ayampi kho, mahānāma, puggalo agantā nirayaṁ agantā tiracchānayoniṁ agantā pettivisayaṁ agantā apāyaṁ duggatiṁ vinipātaṁ."
}