{
    "sn55.8:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā ñātike vihārati giñjakāvasathe. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:",
    "sn55.8:2": "\"Sāḷho nāma, bhante, bhikkhu kālaṅkato; tassa kā gati ko abhisamparāyo? Nandā nāma, bhante, bhikkhunī kālaṅkatā; tassā kā gati ko abhisamparāyo? Sudatto nāma, bhante, upāsako kālaṅkato; tassa kā gati ko abhisamparāyo? Sujātā nāma, bhante, upāsikā kālaṅkatā; tassā kā gati, ko abhisamparāyo\"ti?",
    "sn55.8:3": "\"Sāḷho, Ānanda, bhikkhu kālaṅkato āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāsi. Nandā, Ānanda, bhikkhunī kālaṅkatā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātikā tattha parinibbāyinī anāvattidhammā tasmā lokā. Sudatto, Ānanda, upāsako kālaṅkato tiṇṇaṁ saṁyojanānaṁ parikkhayā rāgadosamohānaṁ tanuttā sakadāgāmī; sakideva imaṁ lokaṁ āgantvā dukkhassantaṁ karissati. Sujātā, Ānanda, upāsikā kālaṅkatā tiṇṇaṁ saṁyojanānaṁ parikkhayā sotāpannā avinipātadhammā niyatā sambodhiparāyaṇā.",
    "sn55.8:4": "Anacchariyaṁ kho panetaṁ, Ānanda, yaṁ manussabhūto kālaṁ kareyya; tasmiṁ tasmiñce maṁ kālaṅkate upasaṅkamitvā etamatthaṁ paṭipucchissatha. Vihesā pesā, Ānanda, assa tathāgatassa. TasmātihĀnanda, dhammādāsaṁ nāma dhammapariyāyaṁ desessāmi; yena samannāgato ariyasāvako ākaṅkhamāno attanāva attānaṁ byākareyya: ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’.",
    "sn55.8:5": "Katamo ca so, Ānanda, dhammādāso dhammapariyāyo; yena samannāgato ariyasāvako ākaṅkhamāno attanāva attānaṁ byākareyya: ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’?",
    "sn55.8:6": "Idha, Ānanda, ariyasāvako buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … ariyakantehi sīlehi samannāgato hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Ayaṁ kho so, Ānanda, dhammādāso dhammapariyāyo; yena samannāgato ariyasāvako ākaṅkhamāno attanāva attānaṁ byākareyya: ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’\"ti."
}