{
    "sn55.10:1": "Ekamantaṁ nisinno kho āyasmā ānando bhagavantaṁ etadavoca:",
    "sn55.10:2": "\"Kakkaṭo, Ānanda, upāsako kālaṅkato pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko tattha parinibbāyī anāvattidhammo tasmā lokā. Kaḷibho, Ānanda … pe … nikato, Ānanda … kaṭissaho, Ānanda … tuṭṭho, Ānanda … santuṭṭho, Ānanda … bhaddo, Ānanda … pe … subhaddo, Ānanda, upāsako kālaṅkato pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko tattha parinibbāyī anāvattidhammo tasmā lokā. (Sabbe ekagatikā kātabbā.)",
    "sn55.10:3": "Paropaññāsa, Ānanda, ñātike upāsakā kālaṅkatā pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātikā tattha parinibbāyino anāvattidhammā tasmā lokā. Sādhikanavuti, Ānanda, ñātike upāsakā kālaṅkatā tiṇṇaṁ saṁyojanānaṁ parikkhayā rāgadosamohānaṁ tanuttā sakadāgāmino; sakideva imaṁ lokaṁ āgantvā dukkhassantaṁ karissanti. Chātirekāni kho, Ānanda, pañcasatāni ñātike upāsakā kālaṅkatā tiṇṇaṁ saṁyojanānaṁ parikkhayā sotāpannā avinipātadhammā niyatā sambodhiparāyaṇā.",
    "sn55.10:4": "Anacchariyaṁ kho panetaṁ, Ānanda, yaṁ manussabhūto kālaṁ kareyya; tasmiṁ tasmiñce maṁ kālaṅkate upasaṅkamitvā etamatthaṁ paṭipucchissatha. Vihesā pesā, Ānanda, assa tathāgatassa. TasmātihĀnanda, dhammādāsaṁ nāma dhammapariyāyaṁ desessāmi; yena samannāgato ariyasāvako ākaṅkhamāno attanāva attānaṁ byākareyya: ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’.",
    "sn55.10:5": "Katamo ca so, Ānanda, dhammādāso dhammapariyāyo; yena samannāgato ariyasāvako ākaṅkhamāno attanāva attānaṁ byākareyya: ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’.",
    "sn55.10:6": "IdhĀnanda, ariyasāvako buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … ariyakantehi sīlehi samannāgato hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Ayaṁ kho so, Ānanda, dhammādāso dhammapariyāyo; yena samannāgato ariyasāvako ākaṅkhamāno attanāva attānaṁ byākareyya: ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’\"ti.",
    "sn55.10:7": "Rājā ogadhadīghāvu,sāriputtāpare duve;Thapatī veḷudvāreyyā,giñjakāvasathe tayoti."
}