{
    "sn55.25:1": "Kapilavatthunidānaṁ. Tena kho pana samayena saraṇāni sakko kālaṅkato hoti. So bhagavatā byākato: \"sotāpanno avinipātadhammo niyato sambodhiparāyaṇo\"ti. Tatra sudaṁ sambahulā sakkā saṅgamma samāgamma ujjhāyanti khīyanti vipācenti: \"acchariyaṁ vata bho, abbhutaṁ vata bho. Ettha dāni ko na sotāpanno bhavissati. Yatra hi nāma saraṇāni sakko kālaṅkato. So bhagavatā byākato: ‘sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’ti. Saraṇāni sakko sikkhāya aparipūrakārī ahosī\"ti. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho mahānāmo sakko bhagavantaṁ etadavoca:",
    "sn55.25:2": "\"Idha, bhante, saraṇāni sakko kālaṅkato. So bhagavatā byākato: ‘sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’ti. Tatra sudaṁ, bhante, sambahulā sakkā saṅgamma samāgamma ujjhāyanti khīyanti vipācenti: ‘acchariyaṁ vata bho, abbhutaṁ vata bho. Ettha dāni ko na sotāpanno bhavissati. Yatra hi nāma saraṇāni sakko kālaṅkato. So bhagavatā byākato – sotāpanno avinipātadhammo niyato sambodhiparāyaṇoti. Saraṇāni sakko sikkhāya aparipūrakārī ahosī’\"ti.",
    "sn55.25:3": "\"Yo so, mahānāma, dīgharattaṁ upāsako buddhaṁ saraṇaṁ gato dhammaṁ saraṇaṁ gato saṅghaṁ saraṇaṁ gato, so kathaṁ vinipātaṁ gaccheyya. Yañhi taṁ, mahānāma, sammā vadamāno vadeyya: ‘dīgharattaṁ upāsako buddhaṁ saraṇaṁ gato dhammaṁ saraṇaṁ gato saṅghaṁ saraṇaṁ gato’, saraṇāniṁ sakkaṁ sammā vadamāno vadeyya. Saraṇāni, mahānāma, sakko dīgharattaṁ upāsako buddhaṁ saraṇaṁ gato dhammaṁ saraṇaṁ gato saṅghaṁ saraṇaṁ gato, so kathaṁ vinipātaṁ gaccheyya.",
    "sn55.25:4": "Idha, mahānāma, ekacco puggalo buddhe ekantagato hoti abhippasanno – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … hāsapañño javanapañño vimuttiyā ca samannāgato. So āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihārati. Ayampi kho, mahānāma, puggalo parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā.",
    "sn55.25:5": "Idha pana, mahānāma, ekacco puggalo buddhe ekantagato hoti abhippasanno – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … hāsapañño javanapañño na ca vimuttiyā samannāgato. So pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā antarāparinibbāyī hoti, upahaccaparinibbāyī hoti, asaṅkhāraparinibbāyī hoti, sasaṅkhāraparinibbāyī hoti, uddhaṁsoto hoti akaniṭṭhagāmī. Ayampi kho, mahānāma, puggalo parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā.",
    "sn55.25:6": "Idha pana, mahānāma, ekacco puggalo buddhe ekantagato hoti abhippasanno – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … na hāsapañño na javanapañño na ca vimuttiyā samannāgato. So tiṇṇaṁ saṁyojanānaṁ parikkhayā rāgadosamohānaṁ tanuttā sakadāgāmī hoti, sakideva imaṁ lokaṁ āgantvā dukkhassantaṁ karoti. Ayampi kho, mahānāma, puggalo parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā.",
    "sn55.25:7": "Idha pana, mahānāma, ekacco puggalo buddhe ekantagato hoti abhippasanno – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … na hāsapañño na javanapañño na ca vimuttiyā samannāgato. So tiṇṇaṁ saṁyojanānaṁ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. Ayampi kho, mahānāma, puggalo parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā.",
    "sn55.25:8": "Idha pana, mahānāma, ekacco puggalo na heva kho buddhe ekantagato hoti abhippasanno … pe … na dhamme … pe … na saṅghe … pe … na hāsapañño na javanapañño na ca vimuttiyā samannāgato; api cassa ime dhammā honti – saddhindriyaṁ … pe … paññindriyaṁ. Tathāgatappaveditā cassa dhammā paññāya mattaso nijjhanaṁ khamanti. Ayampi kho, mahānāma, puggalo agantā nirayaṁ agantā tiracchānayoniṁ agantā pettivisayaṁ agantā apāyaṁ duggatiṁ vinipātaṁ.",
    "sn55.25:9": "Idha pana, mahānāma, ekacco puggalo na heva kho buddhe ekantagato hoti abhippasanno … na dhamme … pe … na saṅghe … pe … na hāsapañño na javanapañño na ca vimuttiyā samannāgato; api cassa ime dhammā honti – saddhindriyaṁ … pe … paññindriyaṁ. Tathāgate cassa saddhāmattaṁ hoti pemamattaṁ. Ayampi kho, mahānāma, puggalo agantā nirayaṁ agantā tiracchānayoniṁ agantā pettivisayaṁ agantā apāyaṁ duggatiṁ vinipātaṁ.",
    "sn55.25:10": "Seyyathāpi, mahānāma, dukkhettaṁ dubbhūmaṁ avihatakhāṇukaṁ, bījāni cassu khaṇḍāni pūtīni vātātapahatāni asārādāni asukhasayitāni, devo ca na sammā dhāraṁ anuppaveccheyya. Api nu tāni bījāni vuddhiṁ virūḷhiṁ vepullaṁ āpajjeyyun\"ti?",
    "sn55.25:11": "Seyyathāpi, mahānāma, sukhettaṁ subhūmaṁ suvihatakhāṇukaṁ, bījāni cassu akhaṇḍāni apūtīni avātātapahatāni sārādāni sukhasayitāni; devo ca sammā dhāraṁ anuppaveccheyya. Api nu tāni bījāni vuddhiṁ virūḷhiṁ vepullaṁ āpajjeyyun\"ti?"
}