{
    "sn55.23:1": "Kapilavatthunidānaṁ. Atha kho mahānāmo sakko yena godhā sakko tenupasaṅkami; upasaṅkamitvā godhaṁ sakkaṁ etadavoca: \"katihi tvaṁ, godhe, dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāsi avinipātadhammaṁ niyataṁ sambodhiparāyaṇan\"ti?",
    "sn55.23:2": "\"Tīhi khvāhaṁ, mahānāma, dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāmi avinipātadhammaṁ niyataṁ sambodhiparāyaṇaṁ. Katamehi tīhi? Idha, mahānāma, ariyasāvako buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe aveccappasādena samannāgato hoti – suppaṭipanno bhagavato sāvakasaṅgho … pe … anuttaraṁ puññakkhettaṁ lokassāti. Imehi khvāhaṁ, mahānāma, tīhi dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāmi avinipātadhammaṁ niyataṁ sambodhiparāyaṇaṁ.",
    "sn55.23:3": "Tvaṁ pana, mahānāma, katihi dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāsi avinipātadhammaṁ niyataṁ sambodhiparāyaṇan\"ti?",
    "sn55.23:4": "\"Āgamehi tvaṁ, mahānāma, āgamehi tvaṁ, mahānāma. Bhagavāva etaṁ jāneyya etehi dhammehi samannāgataṁ vā asamannāgataṁ vā\"ti.",
    "sn55.23:5": "\"Idhāhaṁ, bhante, yena godhā sakko tenupasaṅkamiṁ; upasaṅkamitvā godhaṁ sakkaṁ etadavocaṁ: ‘katihi tvaṁ, godhe, dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāsi avinipātadhammaṁ niyataṁ sambodhiparāyaṇaṁ’? Evaṁ vutte, bhante, godhā sakko maṁ etadavoca –",
    "sn55.23:6": "Tīhi khvāhaṁ, mahānāma, dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāmi avinipātadhammaṁ niyataṁ sambodhiparāyaṇaṁ. Katamehi tīhi? Idha, mahānāma, ariyasāvako buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe aveccappasādena samannāgato hoti – suppaṭipanno bhagavato sāvakasaṅgho … pe … anuttaraṁ puññakkhettaṁ lokassāti. Imehi khvāhaṁ, mahānāma, tīhi dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāmi avinipātadhammaṁ niyataṁ sambodhiparāyaṇaṁ. Tvaṁ pana, mahānāma, katamehi dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāsi avinipātadhammaṁ niyataṁ sambodhiparāyaṇan’ti?",
    "sn55.23:7": "Evaṁ vuttāhaṁ, bhante, godhaṁ sakkaṁ etadavocaṁ: ‘catūhi khvāhaṁ, godhe, dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāmi avinipātadhammaṁ niyataṁ sambodhiparāyaṇaṁ. Katamehi catūhi? Idha, godhe, ariyasāvako buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … ariyakantehi sīlehi samannāgato hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. Imehi khvāhaṁ, godhe, catūhi dhammehi samannāgataṁ sotāpannapuggalaṁ ājānāmi avinipātadhammaṁ niyataṁ sambodhiparāyaṇan’ti.",
    "sn55.23:8": "Evaṁ vutte, bhante, godhā sakko maṁ etadavoca: ‘āgamehi tvaṁ, mahānāma, āgamehi tvaṁ, mahānāma. Bhagavāva etaṁ jāneyya etehi dhammehi samannāgataṁ vā asamannāgataṁ vā’ti."
}