{
    "sn55.40:1": "Ekaṁ samayaṁ bhagavā sakkesu vihārati kapilavatthusmiṁ nigrodhārāme. Atha kho nandiyo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho nandiyo sakko bhagavantaṁ etadavoca:",
    "sn55.40:2": "\"‘Yassa kho, nandiya, cattāri sotāpattiyaṅgāni sabbena sabbaṁ sabbathā sabbaṁ natthi tamahaṁ bāhiro puthujjanapakkhe ṭhito’ti vadāmi. Api ca, nandiya, yathā ariyasāvako pamādavihārī ceva hoti, appamādavihārī ca taṁ suṇāhi, sādhukaṁ manasi karohi; bhāsissāmī\"ti.",
    "sn55.40:3": "\"Kathañca, nandiya, ariyasāvako pamādavihārī hoti? Idha, nandiya, ariyasāvako buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. So tena buddhe aveccappasādena santuṭṭho na uttari vāyamati divā pavivekāya, rattiṁ paṭisallānāya. Tassa evaṁ pamattassa vihārato pāmojjaṁ na hoti. Pāmojje asati, pīti na hoti. Pītiyā asati, passaddhi na hoti. Passaddhiyā asati, dukkhaṁ vihārati. Dukkhino cittaṁ na samādhiyati. Asamāhite citte dhammā na pātubhavanti. Dhammānaṁ apātubhāvā pamādavihārītveva saṅkhyaṁ gacchati.",
    "sn55.40:4": "Puna caparaṁ, nandiya, ariyasāvako dhamme … pe … saṅghe … pe … ariyakantehi sīlehi samannāgato hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. So tehi ariyakantehi sīlehi santuṭṭho na uttari vāyamati divā pavivekāya rattiṁ paṭisallānāya. Tassa evaṁ pamattassa vihārato pāmojjaṁ na hoti. Pāmojje asati, pīti na hoti. Pītiyā asati, passaddhi na hoti. Passaddhiyā asati, dukkhaṁ vihārati. Dukkhino cittaṁ na samādhiyati. Asamāhite citte dhammā na pātubhavanti. Dhammānaṁ apātubhāvā pamādavihārītveva saṅkhyaṁ gacchati.",
    "sn55.40:5": "Kathañca, nandiya, ariyasāvako appamādavihārī hoti? Idha, nandiya, ariyasāvako buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. So tena buddhe aveccappasādena asantuṭṭho uttari vāyamati divā pavivekāya rattiṁ paṭisallānāya. Tassa evaṁ appamattassa vihārato pāmojjaṁ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṁ vediyati. Sukhino cittaṁ samādhiyati. Samāhite citte dhammā pātubhavanti. Dhammānaṁ pātubhāvā appamādavihārītveva saṅkhyaṁ gacchati.",
    "sn55.40:6": "Puna caparaṁ, nandiya, ariyasāvako dhamme … pe … saṅghe … pe … ariyakantehi sīlehi samannāgato hoti akhaṇḍehi … pe … samādhisaṁvattanikehi. So tehi ariyakantehi sīlehi asantuṭṭho uttari vāyamati divā pavivekāya rattiṁ paṭisallānāya. Tassa evaṁ appamattassa vihārato pāmojjaṁ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṁ vediyati. Sukhino cittaṁ samādhiyati. Samāhite citte dhammā pātubhavanti. Dhammānaṁ pātubhāvā appamādavihārītveva saṅkhyaṁ gacchati.Evaṁ kho, nandiya, ariyasāvako appamādavihārī hotī\"ti.",
    "sn55.40:7": "Abhisandā tayo vuttā,duve devapadāni ca;Sabhāgataṁ mahānāmo,vassaṁ kāḷī ca nandiyāti."
}