{
    "sn55.54:1": "Ekaṁ samayaṁ bhagavā sakkesu vihārati kapilavatthusmiṁ nigrodhārāme. Tena kho pana samayena sambahulā bhikkhū bhagavato cīvarakammaṁ karonti: \"niṭṭhitacīvaro bhagavā temāsaccayena cārikaṁ pakkamissatī\"ti.",
    "sn55.54:2": "\"Sappaññena, mahānāma, upāsakena sappañño upāsako ābādhiko dukkhito bāḷhagilāno catūhi assāsanīyehi dhammehi assāsetabbo: ‘assāsatāyasmā – atthāyasmato buddhe aveccappasādo itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Assāsatāyasmā – atthāyasmato dhamme … pe … saṅghe … pe … ariyakantāni sīlāni akhaṇḍāni … pe … samādhisaṁvattanikānī’ti.",
    "sn55.54:3": "Sappaññena, mahānāma, upāsakena sappañño upāsako ābādhiko dukkhito bāḷhagilāno imehi catūhi assāsanīyehi dhammehi assāsetvā evamassa vacanīyo: ‘atthāyasmato mātāpitūsu apekkhā’ti? So ce evaṁ vadeyya: ‘atthi me mātāpitūsu apekkhā’ti, so evamassa vacanīyo: ‘āyasmā kho māriso maraṇadhammo. Sacepāyasmā mātāpitūsu apekkhaṁ karissati, marissateva; no cepāyasmā mātāpitūsu apekkhaṁ karissati, marissateva. Sādhāyasmā, yā te mātāpitūsu apekkhā taṁ pajahā’ti.",
    "sn55.54:4": "So ce evaṁ vadeyya: ‘yā me mātāpitūsu apekkhā sā pahīnā’ti, so evamassa vacanīyo: ‘atthi panāyasmato puttadāresu apekkhā’ti? So ce evaṁ vadeyya: ‘atthi me puttadāresu apekkhā’ti, so evamassa vacanīyo: ‘āyasmā kho māriso maraṇadhammo. Sacepāyasmā puttadāresu apekkhaṁ karissati, marissateva; no cepāyasmā puttadāresu apekkhaṁ karissati, marissateva. Sādhāyasmā, yā te puttadāresu apekkhā taṁ pajahā’ti.",
    "sn55.54:5": "So ce evaṁ vadeyya: ‘yā me puttadāresu apekkhā sā pahīnā’ti, so evamassa vacanīyo: ‘atthi panāyasmato mānusakesu pañcasu kāmaguṇesu apekkhā’ti? So ce evaṁ vadeyya: ‘atthi me mānusakesu pañcasu kāmaguṇesu apekkhā’ti, so evamassa vacanīyo: ‘mānusakehi kho, āvuso, kāmehi dibbā kāmā abhikkantatarā ca paṇītatarā ca. Sādhāyasmā, mānusakehi kāmehi cittaṁ vuṭṭhāpetvā cātumahārājikesu devesu cittaṁ adhimocehī’ti.",
    "sn55.54:6": "So ce evaṁ vadeyya: ‘mānusakehi me kāmehi cittaṁ vuṭṭhitaṁ, cātumahārājikesu devesu cittaṁ adhimocitan’ti, so evamassa vacanīyo: ‘cātumahārājikehi kho, āvuso, devehi tāvatiṁsā devā abhikkantatarā ca paṇītatarā ca. Sādhāyasmā, cātumahārājikehi devehi cittaṁ vuṭṭhāpetvā tāvatiṁsesu devesu cittaṁ adhimocehī’ti.",
    "sn55.54:7": "So ce evaṁ vadeyya: ‘cātumahārājikehi me devehi cittaṁ vuṭṭhitaṁ, tāvatiṁsesu devesu cittaṁ adhimocitan’ti, so evamassa vacanīyo: ‘tāvatiṁsehi kho, āvuso, devehi yāmā devā … pe … tusitā devā … pe … nimmānaratī devā … pe … paranimmitavāsavāttī devā … pe … paranimmitavāsavāttīhi kho, āvuso, devehi brahmaloko abhikkantataro ca paṇītataro ca. Sādhāyasmā, paranimmitavāsavāttīhi devehi cittaṁ vuṭṭhāpetvā brahmaloke cittaṁ adhimocehī’ti.",
    "sn55.54:8": "So ce evaṁ vadeyya: ‘brahmalokā me cittaṁ vuṭṭhitaṁ, sakkāyanirodhe cittaṁ upasaṁharāmī’ti; evaṁ vimuttacittassa kho, mahānāma, upāsakassa āsavā vimuttacittena bhikkhunā na kiñci nānākaraṇaṁ vadāmi, yadidaṁ – vimuttiyā vimuttan\"ti."
}