{
    "sn55.6:1": "Sāvatthinidānaṁ. Tena kho pana samayena sambahulā bhikkhū bhagavato cīvarakammaṁ karonti: \"niṭṭhitacīvaro bhagavā temāsaccayena cārikaṁ pakkamissatī\"ti.",
    "sn55.6:2": "Atha kho isidattapurāṇā thapatayo magge purisaṁ ṭhapesuṁ: \"yadā tvaṁ, ambho purisa, passeyyāsi bhagavantaṁ āgacchantaṁ arahantaṁ sammāsambuddhaṁ, atha amhākaṁ āroceyyāsī\"ti. Dvīhatīhaṁ ṭhito kho so puriso addasa bhagavantaṁ dūratova āgacchantaṁ. Disvāna yena isidattapurāṇā thapatayo tenupasaṅkami; upasaṅkamitvā isidattapurāṇe thapatayo etadavoca: \"Ayaṁ so, bhante, bhagavā āgacchati arahaṁ sammāsambuddho. Yassadāni kālaṁ maññathā\"ti.",
    "sn55.6:3": "Atha kho isidattapurāṇā thapatayo yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavantaṁ abhivādetvā bhagavantaṁ piṭṭhito piṭṭhito anubandhiṁsu. Atha kho bhagavā maggā okkamma yena aññataraṁ rukkhamūlaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Isidattapurāṇā thapatayo bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinnā kho te isidattapurāṇā thapatayo bhagavantaṁ etadavocuṁ:",
    "sn55.6:4": "\"Yadā mayaṁ, bhante, bhagavantaṁ suṇāma: ‘sāvatthiyā kosalesu cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye anattamanatā hoti domanassaṁ: ‘dūre no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘sāvatthiyā kosalesu cārikaṁ pakkanto’ti, hoti no tasmiṁ samaye anattamanatā hoti domanassaṁ: ‘dūre no bhagavā’ti.",
    "sn55.6:5": "Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘kosalehi mallesu cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye anattamanatā hoti domanassaṁ: ‘dūre no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘kosalehi mallesu cārikaṁ pakkanto’ti, hoti no tasmiṁ samaye anattamanatā hoti domanassaṁ: ‘dūre no bhagavā’ti.",
    "sn55.6:6": "Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘mallehi vajjīsu cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye anattamanatā hoti domanassaṁ: ‘dūre no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘mallehi vajjīsu cārikaṁ pakkanto’ti, hoti no tasmiṁ samaye anattamanatā hoti domanassaṁ: ‘dūre no bhagavā’ti.",
    "sn55.6:7": "Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘vajjīhi kāsīsu cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye anattamanatā hoti domanassaṁ: ‘dūre no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘vajjīhi kāsīsu cārikaṁ pakkanto’ti, hoti no tasmiṁ samaye anattamanatā hoti domanassaṁ: ‘dūre no bhagavā’ti.",
    "sn55.6:8": "Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘kāsīhi māgadhe cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye anattamanatā hoti domanassaṁ: ‘dūre no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘kāsīhi māgadhe cārikaṁ pakkanto’ti, hoti anappakā no tasmiṁ samaye anattamanatā hoti anappakaṁ domanassaṁ: ‘dūre no bhagavā’ti.",
    "sn55.6:9": "Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘māgadhehi kāsīsu cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye attamanatā hoti somanassaṁ: ‘āsanne no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘māgadhehi kāsīsu cārikaṁ pakkanto’ti, hoti no tasmiṁ samaye attamanatā hoti somanassaṁ: ‘āsanne no bhagavā’ti.",
    "sn55.6:10": "Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘kāsīhi vajjīsu cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye attamanatā hoti somanassaṁ: ‘āsanne no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘kāsīhi vajjīsu cārikaṁ pakkanto’ti, hoti no tasmiṁ samaye attamanatā hoti somanassaṁ: ‘āsanne no bhagavā’ti.",
    "sn55.6:11": "Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘vajjīhi mallesu cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye attamanatā hoti somanassaṁ: ‘āsanne no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘vajjīhi mallesu cārikaṁ pakkanto’ti, hoti no tasmiṁ samaye attamanatā hoti somanassaṁ: ‘āsanne no bhagavā’ti.",
    "sn55.6:12": "Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘mallehi kosale cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye attamanatā hoti somanassaṁ: ‘āsanne no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘mallehi kosale cārikaṁ pakkanto’ti, hoti no tasmiṁ samaye attamanatā hoti somanassaṁ: ‘āsanne no bhagavā’ti.",
    "sn55.6:13": "Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘kosalehi sāvatthiṁ cārikaṁ pakkamissatī’ti, hoti no tasmiṁ samaye attamanatā hoti somanassaṁ: ‘āsanne no bhagavā bhavissatī’ti. Yadā pana mayaṁ, bhante, bhagavantaṁ suṇāma: ‘sāvatthiyaṁ vihārati jetavane anāthapiṇḍikassa ārāme’ti, hoti anappakā no tasmiṁ samaye attamanatā hoti anappakaṁ somanassaṁ: ‘āsanne no bhagavā’\"ti.",
    "sn55.6:14": "\"Tasmātiha, thapatayo, sambādho gharāvāso rajāpatho, abbhokāso pabbajjā. Alañca pana vo, thapatayo, appamādāyā\"ti.",
    "sn55.6:15": "\"Idha mayaṁ, bhante, yadā rājā pasenadi kosalo uyyānabhūmiṁ niyyātukāmo hoti, ye te rañño pasenadissa kosalassa nāgā opavayhā te kappetvā, yā tā rañño pasenadissa kosalassa pajāpatiyo piyā manāpā tā ekaṁ purato ekaṁ pacchato nisīdāpema. Tāsaṁ kho pana, bhante, bhaginīnaṁ evarūpo gandho hoti, seyyathāpi nāma gandhakaraṇḍakassa tāvadeva vivariyamānassa, yathā taṁ rājakaññānaṁ gandhena vibhūsitānaṁ. Tāsaṁ kho pana, bhante, bhaginīnaṁ evarūpo kāyasamphasso hoti, seyyathāpi nāma tūlapicuno vā kappāsapicuno vā, yathā taṁ rājakaññānaṁ sukhedhitānaṁ. Tasmiṁ kho pana, bhante, samaye nāgopi rakkhitabbo hoti, tāpi bhaginiyo rakkhitabbā honti, attāpi rakkhitabbo hoti. Na kho pana mayaṁ, bhante, abhijānāma tāsu bhaginīsu pāpakaṁ cittaṁ uppādetā. Ayaṁ kho no, bhante, etamhā sambādhā añño sambādho sambādhataro ceva sambādhasaṅkhātataro cā\"ti.",
    "sn55.6:16": "\"Tasmātiha, thapatayo, sambādho gharāvāso rajāpatho, abbhokāso pabbajjā. Alañca pana vo, thapatayo, appamādāya. Catūhi kho, thapatayo, dhammehi samannāgato ariyasāvako sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo.",
    "sn55.6:17": "Katamehi catūhi? Idha, thapatayo, ariyasāvako buddhe aveccappasādena samannāgato hoti – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … vigatamalamaccherena cetasā ajjhāgāraṁ vasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṁvibhāgarato. Imehi kho, thapatayo, catūhi dhammehi samannāgato ariyasāvako sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo.",
    "sn55.6:18": "Tumhe kho, thapatayo, buddhe aveccappasādena samannāgatā – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Dhamme … pe … saṅghe … pe … yaṁ kho pana kiñci kule deyyadhammaṁ sabbaṁ taṁ appaṭivibhattaṁ sīlavantehi kalyāṇadhammehi. Taṁ kiṁ maññatha, thapatayo, katividhā te kosalesu manussā ye tumhākaṁ samasamā, yadidaṁ – dānasaṁvibhāge\"ti?"
}