{
    "sn55.26:1": "Sāvatthinidānaṁ. Tena kho pana samayena anāthapiṇḍiko gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho anāthapiṇḍiko gahapati aññataraṁ purisaṁ āmantesi:",
    "sn55.26:2": "\"Evaṁ, bhante\"ti kho so puriso anāthapiṇḍikassa gahapatissa paṭissutvā yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmantaṁ sāriputtaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho so puriso āyasmantaṁ sāriputtaṁ etadavoca:",
    "sn55.26:3": "\"Anāthapiṇḍiko, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So āyasmato sāriputtassa pāde sirasā vandati. Evañca vadati: ‘sādhu kira, bhante, āyasmā sāriputto yena anāthapiṇḍikassa gahapatissa nivesanaṁ tenupasaṅkamatu anukampāṁ upādāyā’\"ti. Adhivāsesi kho āyasmā sāriputto tuṇhībhāvena.",
    "sn55.26:4": "Atha kho āyasmā sāriputto pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya āyasmatā ānandena pacchāsamaṇena yena anāthapiṇḍikassa gahapatissa nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho āyasmā sāriputto anāthapiṇḍikaṁ gahapatiṁ etadavoca: \"Kacci te, gahapati, khamanīyaṁ kacci yāpanīyaṁ? Kacci dukkhā vedanā paṭikkamanti, no abhikkamanti; paṭikkamosānaṁ paññāyati, no abhikkamo\"ti?",
    "sn55.26:5": "\"Yathārūpena kho, gahapati, buddhe appasādena samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati tathārūpo te buddhe appasādo natthi. Atthi ca kho te, gahapati, buddhe aveccappasādo – itipi so bhagavā … pe … satthā devamanussānaṁ buddho bhagavāti. Tañca pana te buddhe aveccappasādaṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:6": "Yathārūpena kho, gahapati, dhamme appasādena samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpo te dhamme appasādo natthi. Atthi ca kho te, gahapati, dhamme aveccappasādo – svākkhāto bhagavatā dhammo … pe … paccattaṁ veditabbo viññūhīti. Tañca pana te dhamme aveccappasādaṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:7": "Yathārūpena kho, gahapati, saṅghe appasādena samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpo te saṅghe appasādo natthi. Atthi ca kho te, gahapati, saṅghe aveccappasādo – suppaṭipanno bhagavato sāvakasaṅgho … pe … anuttaraṁ puññakkhettaṁ lokassāti. Tañca pana te saṅghe aveccappasādaṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:8": "Yathārūpena kho, gahapati, dussīlyena samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpaṁ te dussīlyaṁ natthi. Atthi ca kho te, gahapati, ariyakantāni sīlāni … pe … samādhisaṁvattanikāni. Tāni ca pana te ariyakantāni sīlāni attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:9": "Yathārūpāya kho, gahapati, micchādiṭṭhiyā samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpā te micchādiṭṭhi natthi. Atthi ca kho te, gahapati, sammādiṭṭhi. Tañca pana te sammādiṭṭhiṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:10": "Yathārūpena kho, gahapati, micchāsaṅkappena samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpo te micchāsaṅkappo natthi. Atthi ca kho te, gahapati, sammāsaṅkappo. Tañca pana te sammāsaṅkappaṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:11": "Yathārūpāya kho, gahapati, micchāvācāya samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpā te micchāvācā natthi. Atthi ca kho te, gahapati, sammāvācā. Tañca pana te sammāvācaṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:12": "Yathārūpena kho, gahapati, micchākammantena samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpo te micchākammanto natthi. Atthi ca kho te, gahapati, sammākammanto. Tañca pana te sammākammantaṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:13": "Yathārūpena kho, gahapati, micchāājīvena samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpo te micchāājīvo natthi. Atthi ca kho te, gahapati, sammāājīvo. Tañca pana te sammāājīvaṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:14": "Yathārūpena kho, gahapati, micchāvāyāmena samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpo te micchāvāyāmo natthi. Atthi ca kho te, gahapati, sammāvāyāmo. Tañca pana te sammāvāyāmaṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:15": "Yathārūpāya kho, gahapati, micchāsatiyā samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpā te micchāsati natthi. Atthi ca kho te, gahapati, sammāsati. Tañca pana te sammāsatiṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:16": "Yathārūpena kho, gahapati, micchāsamādhinā samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpo te micchāsamādhi natthi. Atthi ca kho te, gahapati, sammāsamādhi. Tañca pana te sammāsamādhiṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:17": "Yathārūpena kho, gahapati, micchāñāṇena samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpaṁ te micchāñāṇaṁ natthi. Atthi ca kho te, gahapati, sammāñāṇaṁ. Tañca pana te sammāñāṇaṁ attani samanupassato ṭhānaso vedanā paṭippassambheyya.",
    "sn55.26:18": "Yathārūpāya kho, gahapati, micchāvimuttiyā samannāgato assutavā puthujjano kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapajjati, tathārūpā te micchāvimutti natthi. Atthi ca kho te, gahapati, sammāvimutti. Tañca pana te sammāvimuttiṁ attani samanupassato ṭhānaso vedanā paṭippassambheyyā\"ti.",
    "sn55.26:19": "Atha kho anāthapiṇḍikassa gahapatissa ṭhānaso vedanā paṭippassambhiṁsu. Atha kho anāthapiṇḍiko gahapati āyasmantañca sāriputtaṁ āyasmantañca Ānandaṁ sakeneva thālipākena parivisi. Atha kho anāthapiṇḍiko gahapati āyasmantaṁ sāriputtaṁ bhuttāviṁ onītapattapāṇiṁ aññataraṁ nīcāsanaṁ gahetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho anāthapiṇḍikaṁ gahapatiṁ āyasmā sāriputto imāhi gāthāhi anumodi:",
    "sn55.26:20": "\"Yassa saddhā tathāgate,acalā suppatiṭṭhitā;Sīlañca yassa kalyāṇaṁ,ariyakantaṁ pasaṁsitaṁ.",
    "sn55.26:21": "Saṅghe pasādo yassatthi,ujubhūtañca dassanaṁ;Adaliddoti taṁ āhu,amoghaṁ tassa jīvitaṁ.",
    "sn55.26:22": "Tasmā saddhāñca sīlañca,pasādaṁ dhammadassanaṁ;Anuyuñjetha medhāvī,saraṁ buddhānasāsanan\"ti.",
    "sn55.26:23": "Atha kho āyasmā sāriputto anāthapiṇḍikaṁ gahapatiṁ imāhi gāthāhi anumoditvā uṭṭhāyāsanā pakkāmi.",
    "sn55.26:24": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinnaṁ kho āyasmantaṁ Ānandaṁ bhagavā etadavoca: \"handa kuto nu tvaṁ, Ānanda, āgacchasi divādivassā\"ti?"
}