{
    "sn6.10:1": "Sāvatthinidānaṁ. Atha kho kokāliko bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho kokāliko bhikkhu bhagavantaṁ etadavoca: \"pāpicchā, bhante, sāriputtamoggallānā pāpikānaṁ icchānaṁ vasaṁ gatā\"ti.",
    "sn6.10:2": "Atha kho kokāliko bhikkhu uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā pakkāmi. Acirapakkantassa ca kokālikassa bhikkhuno sāsapamattīhi pīḷakāhi sabbo kāyo phuṭo ahosi. Sāsapamattiyo hutvā muggamattiyo ahesuṁ, muggamattiyo hutvā kalāyamattiyo ahesuṁ, kalāyamattiyo hutvā kolaṭṭhimattiyo ahesuṁ, kolaṭṭhimattiyo hutvā kolamattiyo ahesuṁ, kolamattiyo hutvā āmalakamattiyo ahesuṁ, āmalakamattiyo hutvā beluvasalāṭukamattiyo ahesuṁ, beluvasalāṭukamattiyo hutvā billamattiyo ahesuṁ, billamattiyo hutvā pabhijjiṁsu. Pubbañca lohitañca pagghariṁsu. Atha kho kokāliko bhikkhu teneva ābādhena kālamakāsi. Kālaṅkato ca kokāliko bhikkhu padumaṁ nirayaṁ upapajji sāriputtamoggallānesu cittaṁ āghātetvā.",
    "sn6.10:3": "Atha kho brahmā sahampati abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṁ jetavanaṁ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho brahmā sahampati bhagavantaṁ etadavoca: \"kokāliko, bhante, bhikkhu kālaṅkato. Kālaṅkato ca, bhante, kokāliko bhikkhu padumaṁ nirayaṁ upapanno sāriputtamoggallānesu cittaṁ āghātetvā\"ti. Idamavoca brahmā sahampati. Idaṁ vatvā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā tatthevantaradhāyīti.",
    "sn6.10:4": "Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi: \"imaṁ, bhikkhave, rattiṁ brahmā sahampati abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṁ jetavanaṁ obhāsetvā yenāhaṁ tenupasaṅkami; upasaṅkamitvā maṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho, bhikkhave, brahmā sahampati maṁ etadavoca: ‘kokāliko, bhante, bhikkhu kālaṅkato. Kālaṅkato ca, bhante, kokāliko bhikkhu padumaṁ nirayaṁ upapanno sāriputtamoggallānesu cittaṁ āghātetvā’ti. Idamavoca, bhikkhave, brahmā sahampati, idaṁ vatvā maṁ abhivādetvā padakkhiṇaṁ katvā tatthevantaradhāyī\"ti.",
    "sn6.10:5": "Evaṁ vutte, aññataro bhikkhu bhagavantaṁ etadavoca: \"kīvadīghaṁ nu kho, bhante, padume niraye āyuppamāṇan\"ti?",
    "sn6.10:6": "\"Seyyathāpi, bhikkhu vīsatikhāriko kosalako tilavāho. Tato puriso vassasatassa vassasatassa accayena ekamekaṁ tilaṁ uddhareyya; khippataraṁ kho so, bhikkhu, vīsatikhāriko kosalako tilavāho iminā upakkamena parikkhayaṁ pariyādānaṁ gaccheyya, na tveva eko abbudo nirayo. Seyyathāpi, bhikkhu, vīsati abbudā nirayā, evameko nirabbudanirayo. Seyyathāpi, bhikkhu, vīsati nirabbudā nirayā, evameko ababo nirayo. Seyyathāpi, bhikkhu, vīsati ababā nirayā, evameko aṭaṭo nirayo. Seyyathāpi, bhikkhu, vīsati aṭaṭā nirayā, evameko ahaho nirayo. Seyyathāpi, bhikkhu, vīsati ahahā nirayā, evameko kumudo nirayo. Seyyathāpi, bhikkhu, vīsati kumudā nirayā, evameko sogandhiko nirayo. Seyyathāpi, bhikkhu, vīsati sogandhikā nirayā, evameko uppalanirayo. Seyyathāpi, bhikkhu, vīsati uppalā nirayā, evameko puṇḍariko nirayo. Seyyathāpi, bhikkhu, vīsati puṇḍarikā nirayā, evameko padumo nirayo. Padume pana, bhikkhu, niraye kokāliko bhikkhu upapanno sāriputtamoggallānesu cittaṁ āghātetvā\"ti.",
    "sn6.10:7": "\"Purisassa hi jātassa,kuṭhārī jāyate mukhe;Yāya chindati attānaṁ,bālo dubbhāsitaṁ bhaṇaṁ.",
    "sn6.10:8": "Yo nindiyaṁ pasaṁsati,Taṁ vā nindati yo pasaṁsiyo;Vicināti mukhena so kaliṁ,Kalinā tena sukhaṁ na vindati.",
    "sn6.10:9": "Appamattako ayaṁ kali,Yo akkhesu dhanaparājayo;Sabbassāpi sahāpi attanā,Ayameva mahantaro kali;Yo sugatesu manaṁ padosaye.",
    "sn6.10:10": "Sataṁ sahassānaṁ nirabbudānaṁ,Chattiṁsati pañca ca abbudāni;Yamariyagarahī nirayaṁ upeti,Vācaṁ manañca paṇidhāya pāpakan\"ti.",
    "sn6.10:11": "Āyācanaṁ gāravo brahmadevo,Bako ca brahmā aparā ca diṭṭhi;Pamādakokālikatissako ca,Turū ca brahmā aparo ca kokālikoti."
}