{
    "sn6.15:1": "Ekaṁ samayaṁ bhagavā kusinārāyaṁ vihārati upavattane mallānaṁ sālavane antarena yamakasālānaṁ parinibbānasamaye. Atha kho bhagavā bhikkhū āmantesi: \"handa dāni, bhikkhave, āmantayāmi vo: ‘vayadhammā saṅkhārā, appamādena sampādethā’\"ti. Ayaṁ tathāgatassa pacchimā vācā.",
    "sn6.15:2": "Atha kho bhagavā paṭhamaṁ jhānaṁ samāpajji. Paṭhamā jhānā vuṭṭhahitvā dutiyaṁ jhānaṁ samāpajji. Dutiyā jhānā vuṭṭhahitvā tatiyaṁ jhānaṁ samāpajji. Tatiyā jhānā vuṭṭhahitvā catutthaṁ jhānaṁ samāpajji. Catutthā jhānā vuṭṭhahitvā ākāsānañcāyatanaṁ samāpajji. Ākāsānañcāyatanā vuṭṭhahitvā viññāṇañcāyatanaṁ samāpajji. Viññāṇañcāyatanā vuṭṭhahitvā ākiñcaññāyatanaṁ samāpajji. Ākiñcaññāyatanā vuṭṭhahitvā nevasaññānāsaññāyatanaṁ samāpajji. Nevasaññānāsaññāyatanā vuṭṭhahitvā saññāvedayitanirodhaṁ samāpajji.",
    "sn6.15:3": "Saññāvedayitanirodhā vuṭṭhahitvā nevasaññānāsaññāyatanaṁ samāpajji. Nevasaññānāsaññāyatanā vuṭṭhahitvā ākiñcaññāyatanaṁ samāpajji. Ākiñcaññāyatanā vuṭṭhahitvā viññāṇañcāyatanaṁ samāpajji. Viññāṇañcāyatanā vuṭṭhahitvā ākāsānañcāyatanaṁ samāpajji. Ākāsānañcāyatanā vuṭṭhahitvā catutthaṁ jhānaṁ samāpajji. Catutthā jhānā vuṭṭhahitvā tatiyaṁ jhānaṁ samāpajji. Tatiyā jhānā vuṭṭhahitvā dutiyaṁ jhānaṁ samāpajji. Dutiyā jhānā vuṭṭhahitvā paṭhamaṁ jhānaṁ samāpajji.",
    "sn6.15:4": "\"Sabbeva nikkhipissanti,bhūtā loke samussayaṁ;Yattha etādiso satthā,loke appaṭipuggalo;Tathāgato balappatto,sambuddho parinibbuto\"ti.",
    "sn6.15:5": "Parinibbute bhagavati saha parinibbānā sakko devānamindo imaṁ gāthaṁ abhāsi:",
    "sn6.15:6": "\"Aniccā vata saṅkhārā,up pāda vayadhammino;Uppajjitvā nirujjhanti,tesaṁ vūpasamo sukho\"ti.",
    "sn6.15:7": "Parinibbute bhagavati saha parinibbānā āyasmā ānando imaṁ gāthaṁ abhāsi:",
    "sn6.15:8": "\"Tadāsi yaṁ bhiṁsanakaṁ,tadāsi lomahaṁsanaṁ;Sabbākāravarūpete,sambuddhe parinibbute\"ti.",
    "sn6.15:9": "Parinibbute bhagavati saha parinibbānā āyasmā anuruddho imā gāthāyo abhāsi:",
    "sn6.15:10": "\"Nāhu assāsapassāso,ṭhitacittassa tādino;Anejo santimārabbha,cakkhumā parinibbuto.",
    "sn6.15:11": "Asallīnena cittena,vedanāṁ ajjhavāsayi;Pajjotasseva nibbānaṁ,vimokkho cetaso ahū\"ti.",
    "sn6.15:12": "Brahmāsanaṁ devadatto,Andhakavindo aruṇavatī;Parinibbānena ca desitaṁ,Idaṁ brahmapañcakanti."
}