{
    "sn6.2:1": "Evaṁ me sutaṁ—​ekaṁ samayaṁ bhagavā uruvelāyaṁ vihārati najjā nerañjarāya tīre ajapālanigrodhamūle paṭhamābhisambuddho. Atha kho bhagavato rahogatassa paṭisallīnassa evaṁ cetaso parivitakko udapādi: \"dukkhaṁ kho agāravo vihārati appatisso, kaṁ nu khvāhaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyan\"ti?",
    "sn6.2:2": "Atha kho bhagavato etadahosi: \"aparipuṇṇassa kho sīlakkhandhassa pāripūriyā aññaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyaṁ. Na kho panāhaṁ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya attanā sīlasampannataraṁ aññaṁ samaṇaṁ vā brāhmaṇaṁ vā, yamahaṁ sakkatvā garuṁ katvā upanissāya vihareyyaṁ.",
    "sn6.2:3": "Aparipuṇṇassa kho samādhikkhandhassa pāripūriyā aññaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyaṁ. Na kho panāhaṁ passāmi sadevake loke … pe … attanā samādhisampannataraṁ aññaṁ samaṇaṁ vā brāhmaṇaṁ vā, yamahaṁ sakkatvā garuṁ katvā upanissāya vihareyyaṁ.",
    "sn6.2:4": "Aparipuṇṇassa paññākkhandhassa pāripūriyā aññaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyaṁ. Na kho panāhaṁ passāmi sadevake … pe … attanā paññāsampannataraṁ aññaṁ samaṇaṁ vā brāhmaṇaṁ vā, yamahaṁ sakkatvā garuṁ katvā upanissāya vihareyyaṁ.",
    "sn6.2:5": "Aparipuṇṇassa kho vimuttikkhandhassa pāripūriyā aññaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyaṁ. Na kho panāhaṁ passāmi sadevake … pe … attanā vimuttisampannataraṁ aññaṁ samaṇaṁ vā brāhmaṇaṁ vā, yamahaṁ sakkatvā garuṁ katvā upanissāya vihareyyaṁ.",
    "sn6.2:6": "Aparipuṇṇassa kho vimuttiñāṇadassanakkhandhassa pāripūriyā aññaṁ samaṇaṁ vā brāhmaṇaṁ vā sakkatvā garuṁ katvā upanissāya vihareyyaṁ. Na kho panāhaṁ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya attanā vimuttiñāṇadassanasampannataraṁ aññaṁ samaṇaṁ vā brāhmaṇaṁ vā, yamahaṁ sakkatvā garuṁ katvā upanissāya vihareyyaṁ.",
    "sn6.2:7": "Atha kho brahmā sahampati bhagavato cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya pasāritaṁ vā bāhaṁ samiñjeyya; evameva – brahmaloke antarahito bhagavato purato pāturahosi. Atha kho brahmā sahampati ekaṁsaṁ uttarāsaṅgaṁ karitvā yena bhagavā tenañjaliṁ paṇāmetvā bhagavantaṁ etadavoca: \"evametaṁ, bhagavā, evametaṁ, sugata. Yepi te, bhante, ahesuṁ atītamaddhānaṁ arahanto sammāsambuddhā, tepi bhagavanto dhammaññeva sakkatvā garuṁ katvā upanissāya vihariṁsu; yepi te, bhante, bhavissanti anāgatamaddhānaṁ arahanto sammāsambuddhā tepi bhagavanto dhammaññeva sakkatvā garuṁ katvā upanissāya viharissanti. Bhagavāpi, bhante, etarahi arahaṁ sammāsambuddho dhammaññeva sakkatvā garuṁ katvā upanissāya vihāratū\"ti.",
    "sn6.2:8": "\"Ye ca atītā sambuddhā,ye ca buddhā anāgatā;Yo cetarahi sambuddho,bahūnaṁ sokanāsano.",
    "sn6.2:9": "Sabbe saddhammagaruno,vihaṁsu vihāranti ca;Tathāpi viharissanti,esā buddhāna dhammatā.",
    "sn6.2:10": "Tasmā hi attakāmena,mahattamabhikaṅkhatā;Saddhammo garukātabbo,saraṁ buddhāna sāsanan\"ti."
}