{
    "sn6.5:1": "Sāvatthinidānaṁ. Tena kho pana samayena aññatarassa brahmuno evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ hoti: \"natthi so samaṇo vā brāhmaṇo vā yo idha āgaccheyyā\"ti. Atha kho bhagavā tassa brahmuno cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso … pe … tasmiṁ brahmaloke pāturahosi. Atha kho bhagavā tassa brahmuno upari vehāsaṁ pallaṅkena nisīdi tejodhātuṁ samāpajjitvā.",
    "sn6.5:2": "Atha kho āyasmato mahāmoggallānassa etadahosi: \"kahaṁ nu kho bhagavā etarahi vihāratī\"ti? Addasā kho āyasmā mahāmoggallāno bhagavantaṁ dibbena cakkhunā visuddhena atikkantamānusakena tassa brahmuno upari vehāsaṁ pallaṅkena nisinnaṁ tejodhātuṁ samāpannaṁ. Disvāna – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evameva – jetavane antarahito tasmiṁ brahmaloke pāturahosi. Atha kho āyasmā mahāmoggallāno puratthimaṁ disaṁ nissāya tassa brahmuno upari vehāsaṁ pallaṅkena nisīdi tejodhātuṁ samāpajjitvā nīcataraṁ bhagavato.",
    "sn6.5:3": "Atha kho āyasmato mahākassapassa etadahosi: \"kahaṁ nu kho bhagavā etarahi vihāratī\"ti? Addasā kho āyasmā mahākassapo bhagavantaṁ dibbena cakkhunā … pe … disvāna – seyyathāpi nāma balavā puriso … pe … evameva – jetavane antarahito tasmiṁ brahmaloke pāturahosi. Atha kho āyasmā mahākassapo dakkhiṇaṁ disaṁ nissāya tassa brahmuno upari vehāsaṁ pallaṅkena nisīdi tejodhātuṁ samāpajjitvā nīcataraṁ bhagavato.",
    "sn6.5:4": "Atha kho āyasmato mahākappinassa etadahosi: \"kahaṁ nu kho bhagavā etarahi vihāratī\"ti? Addasā kho āyasmā mahākappino bhagavantaṁ dibbena cakkhunā … pe … tejodhātuṁ samāpannaṁ. Disvāna – seyyathāpi nāma balavā puriso … pe … evameva – jetavane antarahito tasmiṁ brahmaloke pāturahosi. Atha kho āyasmā mahākappino pacchimaṁ disaṁ nissāya tassa brahmuno upari vehāsaṁ pallaṅkena nisīdi tejodhātuṁ samāpajjitvā nīcataraṁ bhagavato.",
    "sn6.5:5": "Atha kho āyasmato anuruddhassa etadahosi: \"kahaṁ nu kho bhagavā etarahi vihāratī\"ti? Addasā kho āyasmā anuruddho … pe … tejodhātuṁ samāpannaṁ. Disvāna – seyyathāpi nāma balavā puriso … pe … tasmiṁ brahmaloke pāturahosi. Atha kho āyasmā anuruddho uttaraṁ disaṁ nissāya tassa brahmuno upari vehāsaṁ pallaṅkena nisīdi tejodhātuṁ samāpajjitvā nīcataraṁ bhagavato.",
    "sn6.5:6": "Atha kho āyasmā mahāmoggallāno taṁ brahmānaṁ gāthāya ajjhabhāsi:",
    "sn6.5:7": "\"Ajjāpi te āvuso sā diṭṭhi,Yā te diṭṭhi pure ahu;Passasi vītivattantaṁ,Brahmaloke pabhassaran\"ti.",
    "sn6.5:8": "\"Na me mārisa sā diṭṭhi,yā me diṭṭhi pure ahu;Passāmi vītivattantaṁ,brahmaloke pabhassaraṁ;Svāhaṁ ajja kathaṁ vajjaṁ,ahaṁ niccomhi sassato\"ti.",
    "sn6.5:9": "Atha kho bhagavā taṁ brahmānaṁ saṁvejetvā – seyyathāpi nāma balavā puriso samiñjitaṁ vā bāhaṁ pasāreyya, pasāritaṁ vā bāhaṁ samiñjeyya; evameva – tasmiṁ brahmaloke antarahito jetavane pāturahosi.",
    "sn6.5:10": "\"Tevijjā iddhipattā ca,cetopariyāyakovidā;Khīṇāsavā arahanto,bahū buddhassa sāvakā\"ti.",
    "sn6.5:11": "Atha kho so brahmapārisajjo āyasmato mahāmoggallānassa bhāsitaṁ abhinanditvā anumoditvā yena so brahmā tenupasaṅkami; upasaṅkamitvā taṁ brahmānaṁ etadavoca: \"Āyasmā, mārisa, mahāmoggallāno evamāha:",
    "sn6.5:12": "‘Tevijjā iddhipattā ca,cetopariyāyakovidā;Khīṇāsavā arahanto,bahū buddhassa sāvakā’\"ti.",
    "sn6.5:13": "Idamavoca so brahmapārisajjo. Attamano ca so brahmā tassa brahmapārisajjassa bhāsitaṁ abhinandīti."
}