{
    "sn7.2:1": "Ekaṁ samayaṁ bhagavā rājagahe vihārati veḷuvane kalandakanivāpe. Assosi kho akkosakabhāradvājo brāhmaṇo: \"bhāradvājagotto kira brāhmaṇo samaṇassa gotamassa santike agārasmā anagāriyaṁ pabbajito\"ti kupito anattamano yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ asabbhāhi pharusāhi vācāhi akkosati paribhāsati.",
    "sn7.2:2": "Evaṁ vutte, bhagavā akkosakabhāradvājaṁ brāhmaṇaṁ etadavoca: \"taṁ kiṁ maññasi, brāhmaṇa, api nu kho te āgacchanti mittāmaccā ñātisālohitā atithiyo\"ti?\"Appekadā me, bho gotama, āgacchanti mittāmaccā ñātisālohitā atithiyo\"ti.\"Taṁ kiṁ maññasi, brāhmaṇa, api nu tesaṁ anuppadesi khādanīyaṁ vā bhojanīyaṁ vā sāyanīyaṁ vā\"ti?\"Appekadā nesāhaṁ, bho gotama, anuppademi khādanīyaṁ vā bhojanīyaṁ vā sāyanīyaṁ vā\"ti.\"Sace kho pana te, brāhmaṇa, nappaṭiggaṇhanti, kassa taṁ hotī\"ti?\"Sace te, bho gotama, nappaṭiggaṇhanti, amhākameva taṁ hotī\"ti.\"Evameva kho, brāhmaṇa, yaṁ tvaṁ amhe anakkosante akkosasi, arosente rosesi, abhaṇḍante bhaṇḍasi, taṁ te mayaṁ nappaṭiggaṇhāma. Tavevetaṁ, brāhmaṇa, hoti; tavevetaṁ, brāhmaṇa, hoti.",
    "sn7.2:3": "Yo kho, brāhmaṇa, akkosantaṁ paccakkosati, rosentaṁ paṭiroseti, bhaṇḍantaṁ paṭibhaṇḍati, ayaṁ vuccati, brāhmaṇa, sambhuñjati vītiharatīti. Te mayaṁ tayā neva sambhuñjāma na vītiharāma. Tavevetaṁ, brāhmaṇa, hoti; tavevetaṁ, brāhmaṇa, hotī\"ti.\"Bhavantaṁ kho gotamaṁ sarājikā parisā evaṁ jānāti: ‘arahaṁ samaṇo gotamo’ti. Atha ca pana bhavaṁ gotamo kujjhatī\"ti.",
    "sn7.2:4": "\"Akkodhassa kuto kodho,dantassa samajīvino;Sammadaññā vimuttassa,upasantassa tādino.",
    "sn7.2:5": "Tasseva tena pāpiyo,yo kuddhaṁ paṭikujjhati;Kuddhaṁ appaṭikujjhanto,saṅgāmaṁ jeti dujjayaṁ.",
    "sn7.2:6": "Ubhinnamatthaṁ carati,attano ca parassa ca;Paraṁ saṅkupitaṁ ñatvā,yo sato upasammati.",
    "sn7.2:7": "Ubhinnaṁ tikicchantānaṁ,attano ca parassa ca;Janā maññanti bāloti,ye dhammassa akovidā\"ti.",
    "sn7.2:8": "Evaṁ vutte, akkosakabhāradvājo brāhmaṇo bhagavantaṁ etadavoca: \"Abhikkantaṁ, bho gotama … pe … esāhaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. Labheyyāhaṁ, bhante, bhoto gotamassa santike pabbajjaṁ, labheyyaṁ upasampadan\"ti.",
    "sn7.2:9": "Alattha kho akkosakabhāradvājo brāhmaṇo bhagavato santike pabbajjaṁ, alattha upasampadaṁ. Acirūpasampanno kho panāyasmā akkosakabhāradvājo eko vūpakaṭṭho appamatto ātāpī pahitatto vihāranto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṁ pabbajanti tadanuttaraṁ – brahmacariyapariyosānaṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja vihāsi. \"Khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ nāparaṁ itthattāyā\"ti abbhaññāsi. Aññataro ca panāyasmā bhāradvājo arahataṁ ahosīti."
}