{
    "sn8.7:1": "Ekaṁ samayaṁ bhagavā sāvatthiyaṁ vihārati pubbārāme migāramātupāsāde mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi sabbeheva arahantehi. Tena kho pana samayena bhagavā tadahuposathe pannarase pavāraṇāya bhikkhusaṅghaparivuto abbhokāse nisinno hoti. Atha kho bhagavā tuṇhībhūtaṁ bhikkhusaṅghaṁ anuviloketvā bhikkhū āmantesi: \"handa dāni, bhikkhave, pavāremi vo. Na ca me kiñci garahatha kāyikaṁ vā vācasikaṁ vā\"ti.",
    "sn8.7:2": "Evaṁ vutte, āyasmā sāriputto uṭṭhāyāsanā ekaṁsaṁ uttarāsaṅgaṁ karitvā yena bhagavā tenañjaliṁ paṇāmetvā bhagavantaṁ etadavoca: \"na kho mayaṁ, bhante, bhagavato kiñci garahāma kāyikaṁ vā vācasikaṁ vā. Bhagavā hi, bhante, anuppannassa maggassa uppādetā, asañjātassa maggassa sañjanetā, anakkhātassa maggassa akkhātā, maggaññū maggavidū maggakovido. Maggānugā ca, bhante, etarahi sāvakā vihāranti pacchā samannāgatā; ahañca kho, bhante, bhagavantaṁ pavāremi. Na ca me bhagavā kiñci garahati kāyikaṁ vā vācasikaṁ vā\"ti.",
    "sn8.7:3": "\"Na khvāhaṁ te, sāriputta, kiñci garahāmi kāyikaṁ vā vācasikaṁ vā. Paṇḍito tvaṁ, sāriputta, mahāpañño tvaṁ, sāriputta, puthupañño tvaṁ, sāriputta, hāsapañño tvaṁ, sāriputta, javanapañño tvaṁ, sāriputta, tikkhapañño tvaṁ, sāriputta, nibbedhikapañño tvaṁ, sāriputta. Seyyathāpi, sāriputta, rañño cakkavattissa jeṭṭhaputto pitarā pavattitaṁ cakkaṁ sammadeva anuppavatteti; evameva kho tvaṁ, sāriputta, mayā anuttaraṁ dhammacakkaṁ pavattitaṁ sammadeva anuppavattesī\"ti.",
    "sn8.7:4": "\"No ce kira me, bhante, bhagavā kiñci garahati kāyikaṁ vā vācasikaṁ vā. Imesaṁ pana, bhante, bhagavā pañcannaṁ bhikkhusatānaṁ na kiñci garahati kāyikaṁ vā vācasikaṁ vā\"ti.",
    "sn8.7:5": "Atha kho āyasmā vaṅgīso uṭṭhāyāsanā ekaṁsaṁ uttarāsaṅgaṁ karitvā yena bhagavā tenañjaliṁ paṇāmetvā bhagavantaṁ etadavoca: \"paṭibhāti maṁ, bhagavā, paṭibhāti maṁ, sugatā\"ti.",
    "sn8.7:6": "\"Ajja pannarase visuddhiyā,Bhikkhū pañcasatā samāgatā;Saṁyojanabandhanacchidā,Anīghā khīṇapunabbhavā isī.",
    "sn8.7:7": "Cakkavattī yathā rājā,amaccaparivārito;Samantā anupariyeti,sāgarantaṁ mahiṁ imaṁ.",
    "sn8.7:8": "Evaṁ vijitasaṅgāmaṁ,satthavāhaṁ anuttaraṁ;Sāvakā payirupāsanti,tevijjā maccuhāyino.",
    "sn8.7:9": "Sabbe bhagavato puttā,palāpettha na vijjati;Taṇhāsallassa hantāraṁ,vande ādiccabandhunan\"ti."
}