{
    "ud2.8:1": "Thus I heard:At one time the Gracious One was dwelling near Kuṇḍiya, at Kuṇḍadhāna Wood. Then at that time the Koliyan lady Suppavāsā was with child for seven years, and for seven days it was lost in the womband couldn’t be delivered. While she was affected by painful, sharp, harsh, and bitter feelings, she consented to three thoughts: \"For sure the Gracious One is a Perfect Sambuddha, who teaches the Dhamma for the giving up of suffering such as this; for sure the Gracious One's Community of disciples are good in their practice, who practice for the giving up of suffering such as this; it is sure that Emancipation is truly happy, where suffering such as this is not found.\"",
    "ud2.8:2": "Then the Koliyan lady Suppavāsā addressed her husband,saying: \"Come, Master, you must go to the Gracious One, and after going, in my name you should worship the Gracious One's feet with your head, and askif he isfree from affliction, free from sickness, in good health, strong, and living comfortably,and say: ‘The Koliyan lady Suppavāsā, reverend Sir, worships the Gracious One's feet with her head, and asksif you arefree from affliction, free from sickness, in good health, strong, and living comfortably?’ And please say this: ‘The Koliyan lady Suppavāsā, reverend Sir, has been with child for seven years, and for seven days it has been lost in the womb. While she is affected by painful, sharp, harsh, and bitter feelings, she consents to three thoughts: \"For sure the Gracious One is a Perfect Sambuddha, who teaches the Dhamma for the giving up of suffering such as this; for sure the Gracious One's Community of disciples are good in their practice, who practice for the giving up of suffering such as this; it is sure that Emancipation is truly happy, where suffering such as this is not found.\"",
    "ud2.8:3": "\"That isthe best thing\" said the Koliyan gentleman, and after replying to Suppavāsā the Koliyan lady, he went to the Gracious One, and after going and worshipping the Gracious One, he sat down on one side. While sat on one side that Koliyan gentleman said this to the Gracious One:",
    "ud2.8:4": "\"Happy may the Koliyan lady Suppavāsā be, and healthy, and may she give birth to a healthy son.\" And with this word of the Gracious One, the Koliyan lady Suppavāsā became happy and healthy, and gave birth to a healthy son.",
    "ud2.8:5": "\"Yes, reverend Sir\" said the Koliyan gentleman, and after greatly rejoicing and gladly receiving this word of the Gracious One, rising from his seat, worshipping and circumambulating the Gracious One, he returned to his own home.",
    "ud2.8:6": "Then the Koliyan lady Suppavāsā addressed her husband,saying: \"Come, Master, you must go to the Gracious One, and after going, in my name you should worship the Gracious One's feet with your head,and say: ‘The Koliyan lady Suppavāsā, reverend Sir, worships the Gracious One's feet with her head.’ And please say this: ‘The Koliyan lady Suppavāsā, reverend Sir, was with child for seven years, and for seven days it was lost in the womb, but now she is happy and healthy, and has born a healthy son. For seven days she invites the Community of monks, with the Buddha at its head, for a meal. May the Gracious One consent, reverend Sir, to seven meals from the Koliyan lady Suppavāsā together with the Community of monks.’ \"",
    "ud2.8:7": "\"That isthe best thing\", said the Koliyan gentleman, and after replying to Suppavāsā the Koliyan lady, he went to the Gracious One, and after going and worshipping the Gracious One, he sat down on one side. While sat on one side the Koliyan gentleman said this to the Gracious One:",
    "ud2.8:8": "\"The Koliyan lady Suppavāsā, reverend Sir, worships the Gracious One's feet with her head. And she says this: ‘The Koliyan lady Suppavāsā, reverend Sir, was with child for seven years, and for seven days it was lost in the womb, but now she is happy and healthy, and has born a healthy son. For seven days she invites the Community of monks, with the Buddha at its head, for a meal. May the Gracious One consent, reverend Sir, to seven meals from the Koliyan lady Suppavāsā together with the Community of monks.’ \"",
    "ud2.8:9": "Then at that time a certain lay follower had invited the Community of monks with the Buddha at its head to a meal on the morrow. Now that lay follower was venerable Mahāmoggallāna's supporter. Then the Gracious One addressed venerable Mahāmoggallāna,saying: \"Come, Moggallāna, you must go to that lay follower, and after going, please say this to that lay follower: ‘Friend, the Koliyan lady Suppavāsā was with child for seven years, and for seven days it was lost in the womb, but now she is happy and healthy, and has born a healthy son. For seven days she has invited the Community of monks, with the Buddha at its head, for a meal, please let the Koliyan lady Suppavāsā make her seven meals.’ Afterwards he can makehis— he is your supporter.\"",
    "ud2.8:10": "\"Yes, reverend Sir,\" said venerable Mahāmoggallāna, and after replying to the Gracious One, he went to that lay follower, and after going, he said this to that lay follower:",
    "ud2.8:11": "\"If, reverend Sir, master Mahāmoggallāna is my surety for three things — for wealth, for life, and for faith — the Koliyan lady Suppavāsā may make her seven meals, and afterwards I will makemine.\"",
    "ud2.8:12": "\"If, reverend Sir, master Mahāmoggallāna is my surety for two things — for wealth and for life — the Koliyan lady Suppavāsā may make her seven meals, and afterwards I will makemine.\"",
    "ud2.8:13": "Then venerable Mahāmoggallāna, after conciliating that lay follower, went to the Gracious One, and after going, he said this to the Gracious One: \"That lay follower has been conciliated by me, reverend Sir, let the Koliyan lady Suppavāsā make her seven meals, and afterwards he can makehis.\"",
    "ud2.8:14": "Then the Koliyan lady Suppavāsā for seven days with her own hand served and satisfied the Community of monks with the Buddha at its head with excellent comestibles and edibles. Then she made the little boy worship the Buddha, and the whole Community of monks.",
    "ud2.8:15": "Then venerable Sāriputta said this to that little boy: \"Can you bear up, little boy? Can you carry on? Do you have any pain?\"",
    "ud2.8:16": "Thenit occuredto the Koliyan lady Suppavāsā: \"My son is consulting with the general of the Dhamma,\" and she became elated, gladdened, joyful and happy.",
    "ud2.8:24": "\"Gracious One, I long for another seven such sons.\"",
    "ud2.8:17": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud2.8:18": "\"The disagreeable in an agreeable form, the unlovely in a lovely form,The painful in the form of pleasure, overcome the heedless one.\""
}