{
    "ud3.3:1": "Thus I heard:At one time the Gracious One was dwelling near Sāvatthī, in Jeta's Wood, at Anāthapiṇḍika's monastery. Then at that time five hundred monks with Yasoja at their head had arrived in Sāvatthī, to see the Gracious One. Then those visiting monks while exchanging greetings with the resident monks, having the dwelling places assigned, putting the bowls and robes in order, made a loud noise, a great noise.",
    "ud3.3:2": "Then the Gracious One addressed venerable Ānanda,saying: \"Who are thesemakinga loud noise, a great noise? One would think it is fishermen with their haul of fish!\"",
    "ud3.3:3": "\"Yes, reverend Sir,\" said venerable Ānanda, and after replying to the Gracious One, he went to those monks, and after going, he said this to those monks: \"The Teacher calls the venerable ones.\"",
    "ud3.3:4": "\"Why, monks, are youmakinga loud noise, a great noise, so one would think it is fishermen with their haul of fish?\"",
    "ud3.3:5": "\"Yes, reverend Sir,\" said those monks, and after replying to the Gracious One, rising from their seats, worshipping and circumambulating the Gracious One, putting their dwelling places in order, picking up their robes and bowls, they went on walking tour towards Vajji. While walking gradually through Vajji on walking tour they went to the river Vaggumudā, and after going and making leaf-huts on the bank of the river Vaggumudā, they entered upon the Rains Retreat.",
    "ud3.3:6": "Then venerable Yasoja, having entered upon the Rains Retreat, addressed those monkssaying: \"We were dismissed, friends, by the Gracious One, who desires our welfare, who seeks our benefit, who is compassionate, out of compassionfor us. Well now, venerable friends, we must live in such a way that the Gracious One will be pleased with our living.\"",
    "ud3.3:7": "Then the Gracious One, having dwelt at Sāvatthī for as long as he wished, went on walking tour towards Vesālī, and while walking gradually on walking tour he arrived at Vesālī. There the Gracious One dwelt near Vesālī, in the Great Wood, at the Gabled Hall.",
    "ud3.3:8": "Then the Gracious One, having applied his mind, and with his mind fully encompassed the minds of the monks on the bank of the Vaggumudā, addressed venerable Ānanda,saying:",
    "ud3.3:9": "\"Yes, reverend Sir,\" said venerable Ānanda, and after replying to the Gracious One, he went to a certain monk, and after going, he said this to that monk: \"Come, venerable friend, you should go to the monks on the bank of the Vaggumudā, and after going, please say this to the monks on the bank of the Vaggumudā: ‘The Teacher, venerable friends, calls you, the Teacher desires to see the venerable ones.’ \"",
    "ud3.3:10": "\"Yes, friend,\" said that monk, and after replying to venerable Ānanda, just as a strong man might stretch out a bent arm, or bend in an outstretched arm, in the same way did he disappear from the Gabled Hall in Great Wood, and reappear in front of those monks on the bank of the river Vaggumudā. Then that monk said this to the monks on the bank of the Vaggumudā: \"The Teacher, venerable friends, calls you, the Teacher desires to see the venerable ones.\"",
    "ud3.3:11": "\"Yes, friend,\" said those monks, and after replying to that monk, setting their dwelling places in order, and picking up their bowls and robes, just as a strong man might stretch out a bent arm, or bend in an outstretched arm, in the same way did they disappear from the bank of the river Vaggumudā, and reappear in front of the Gracious One in the Gabled Hall in Great Wood.",
    "ud3.3:12": "Then venerable Ānanda, when the night had passed, when the first watch of the night had gone, after rising from his seat, arranging his robe on one shoulder, and raising his hands in respectful salutation, said this to the Gracious One:",
    "ud3.3:13": "For a second time venerable Ānanda, when the night had passed, when the middle watch of the night had gone, after rising from his seat, arranging his robe on one shoulder, and raising his hands in respectful salutation, said this to the Gracious One:",
    "ud3.3:14": "For a third time venerable Ānanda, when the night had passed, when the last watch of the night had gone, when dawn had risen, when the night had a joyful appearance, after rising from his seat, arranging his robe on one shoulder, and raising his hands in respectful salutation, said this to the Gracious One:",
    "ud3.3:15": "Then the Gracious One, after rising from that concentration, addressed venerable Ānanda,saying:",
    "ud3.3:16": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud3.3:17": "\"He who is victorious over the thorn of sense desire,Scolding, slaying, andotherbonds,He who stands unmoved like a mountain,That monk does not shake in regard to pleasure and pain.\""
}