{
    "ud3.8:1": "Thus I heard:At one time the Gracious One was dwelling near Sāvatthī, in Jeta's Wood, at Anāthapiṇḍika's monastery. Then at that time, amongst many monks, after returning from the alms-round after the meal, assembling together, and sitting in the Kareri Round Hall, this conversation arose:",
    "ud3.8:2": "\"An alms-gathering monk, venerable friends, while walking for alms gets the opportunity from time to time to see appealing forms with the eye; gets the opportunity from time to time to hear appealing sounds with the ear; gets the opportunity from time to time to smell appealing smells with the nose; gets the opportunity from time to time to taste appealing flavours with the tongue; gets the opportunity from time to time to touch appealing tangibles with the body. An alms-gathering monk, venerable friends, walking for alms is venerated, respected, revered, honoured, and esteemed.",
    "ud3.8:3": "Then the Gracious One, having risen from seclusion in the evening time, went to the Kareri Round Hall, and after going, he sat down on the prepared seat. Having sat down the Gracious One addressed the monks,saying: \"What is the talk about, monks, amongst those who have assembled at present, and what is the conversation that you left unfinished?\"",
    "ud3.8:4": "\"Here, reverend Sir, after returning from the alms-round after the meal, assembling together, and sitting in the Kareri Round Hall, this conversation arose:",
    "ud3.8:5": "\"‘An alms-gathering monk, venerable friends, while walking for alms gets the opportunity from time to time to see appealing forms with the eye; gets the opportunity from time to time to hear appealing sounds with the ear; gets the opportunity from time to time to smell appealing smells with the nose; gets the opportunity from time to time to taste appealing flavours with the tongue; gets the opportunity from time to time to touch appealing tangibles with the body. An alms-gathering monk, venerable friends, walking for alms is venerated, respected, revered, honoured, and esteemed.",
    "ud3.8:6": "\"This is certainly not suitable, monks, for you sons of good family who through faith have gone forth from the home to homelessness, that you should talk such talk. When you have assembled together, monks, there are two things that you ought to do: talk about the Dhamma, or maintain noble silence.\"",
    "ud3.8:7": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud3.8:8": "\"The devas envy the alms-gathering monk,Self-supporting, not nourishing another, Such a one —But not if [he is] dependent on becoming famous.\""
}