{
    "ud3.10:1": "Thus I heard:At one time the Gracious One was dwelling near Uruvelā, on the bank of the river Nerañjarā, at the root of the Awakening tree, in the firstperiodafter attaining Awakening.",
    "ud3.10:2": "Then with the passing of those seven days the Gracious One, after rising from that concentration, looked around the world with his Buddha-eye. The Gracious One looking around the world with his Buddha-eye saw beings being tormented with many torments, and being burned with many fevers, born from passion, and born from hatred, and born from delusion.",
    "ud3.10:3": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud3.10:4": "\"This world, overcome by contact, is tormented,It speaks of a disease as the self,For with whatever it conceivesHereafter it becomes otherwise.",
    "ud3.10:5": "\"Continually becoming other,the world is shackled by continuity,overcome by continuity,it greatly rejoices in continuity,What it rejoices in, that is fearful,What it fears, that is suffering.\"This spiritual life is lived for the complete giving up of continuity.",
    "ud3.10:6": "\"For whatever the ascetics or brāhmaṇas say about freedom from continuity being throughfurthercontinuity, all of them are not free from continuity, I say.\"Or whatever the ascetics or brāhmaṇas say about the escape from continuity being through discontinuity, all of them have not escaped from continuity, I say.",
    "ud3.10:7": "\"Conditioned by cleaving this suffering originates, through the destruction of all attachment there is no origination of suffering.\" See this world overcome by many kinds of ignorance, beings, who delight in beings, are not free from continuity. \"Whatever continuitiesin existencethere are, everywhere, in every respect, all those continuities are impermanent, suffering, changeable things.",
    "ud3.10:8": "\"Seeing it like this, as it really is,with right wisdom,Craving for continuity is given up,and he does not rejoice in discontinuity.\"From the complete destruction of cravingthere is a fading awayof ignorancewithout remainder, cessation, and Emancipation.",
    "ud3.10:9": "\"For that monk who is emancipated,Without attachment, there is no continuity in existence.\"He has vanquished Māra, is victorious in battle,He is such a one who has overcome all continuationsin existence.\""
}