{
    "ud4.5:1": "Thus I heard:At one time the Gracious One was dwelling near Kosambī, in Ghosita's Monastery. Then at that time the Gracious One was living beset by monks, and nuns, and male lay followers, and female lay followers, and kings, and king's ministers, and sectarians, and sectarians’ disciples, he lived beset, unhappy, and uncomfortable.",
    "ud4.5:2": "Then the Gracious One, having dressed in the morning time, after picking up his bowl and robe, entered Kosambī for alms. After walking for alms in Kosambī, when he had returned from the alms-round after the meal, after putting the dwelling place in order by himself, picking up his robe and bowl, without having addressed his attendants, without having taken leave of the Community of monks, solitary, without a companion, went away on a walk towards Pārileyyaka. While walking gradually on walking tour he arrived at Pārileyyaka. There the Gracious One dwelt near Pārileyyaka, in the Protected Jungle, at the root of the auspicious Sāl-tree.",
    "ud4.5:3": "Now also a certain Nāga elephant was living beset by male elephants, by female elephants, by young elephants, by baby elephants. He ate grass that had the tips broken off, while they ate what he had broken down from the branches. He drank water that had been disturbed, and when he arose from the bathing place female elephants went along jostling his body, he lived beset, unhappy, and uncomfortable.",
    "ud4.5:4": "Then that Nāga elephant, having gone away from the herd, went to Pārileyyaka, the Protected Jungle, the root of the auspicious Sāl-tree, and to the Gracious One. There, in that place where the Gracious One dwelt, that Nāga elephant, cleared that place of grass, and with his trunk provided the Gracious One with drinking water and washing water.",
    "ud4.5:5": "Then when the Gracious One had gone into hiding, into seclusion, this reflection arose in his mind:",
    "ud4.5:6": "Also to that Nāga elephant this reflection arose in his mind:",
    "ud4.5:7": "Then the Gracious One, having understood his own complete seclusion, and knowing with his mind the reflection that had arisen in that Nāga elephant's mind, on that occasion uttered this exalted utterance:",
    "ud4.5:8": "\"This pole-toothedelephantNāga's mind agrees with theBuddhaNāga's mind:thata Nāgadelights in being solitary in the wood.\""
}