{
    "ud4.4:1": "Thus I heard:At one time the Gracious One was dwelling near Rājagaha, in Bamboo Wood, at the Squirrels’ Feeding Place. Then at that time venerable Sāriputta and venerable Mahāmoggallāna were living at the Pigeon Vale. Then at that time venerable Sāriputta, on a moonlight night, with his hair freshly shaved off, was sitting in the open air, having attained a certain concentration.",
    "ud4.4:2": "Then at that time two yakkha friends were going from the Northern region to the Southern region, with some business or other. Those yakkhas saw venerable Sāriputta, onthatmoonlight night, with his hair freshly shaved off, sat in the open air.",
    "ud4.4:3": "For a second time that yakkha said this to theotheryakkha: \"It occurs to me, friend, to give a blow on this ascetic's head.\"",
    "ud4.4:4": "Then the yakkha taking no notice of thatotheryakkha, gave a blow on the elder venerable Sāriputta's head: it was such a great blow that with that blow a seven, or seven and a half cubit Nāgaelephantmight have been felled, or a great mountain top might have been burst open.",
    "ud4.4:5": "Venerable Mahāmoggallāna saw with his divine-eye, which is purified, and surpasses that ofnormalmen, that yakkha giving a blow on venerable Sāriputta's head. And after seeingit, he went to venerable Sāriputta, and after going, he said this to venerable Sāriputta: \"Can you bear up, venerable friend? Can you carry on? Do you have any pain?\"",
    "ud4.4:6": "\"Wonderful, friend Sāriputta, marvellous, friend Sāriputta, such is the venerable Sāriputta's great power and great majesty. Here, friend Sāriputta, a certain yakkha gave a blow on your head: it was such a great blow, that with that blow a seven, or seven and a half cubit Nāgaelephantmight have been felled, or a great mountain top might have been burst open. But then venerable Sāriputta said this: ‘I can bear up, friend Moggallāna; I can carry on, friend Moggallāna, but I have a little pain on my head.’ \"",
    "ud4.4:7": "\"Wonderful, friend Moggallāna, marvellous, friend Moggallāna, such is the venerable Mahāmoggallāna's great power and great majesty, in as much as he can even see a yakkha, whereas we at present do not even see a mud-demon!\"",
    "ud4.4:8": "The Gracious One heard with his divine ear-element, which is purified, and surpasses that ofnormalmen, the fitting talk and conversation of these two Great Nāgas.",
    "ud4.4:9": "Then the Gracious One, having understood the significance of it on that occasion uttered this exalted utterance:",
    "ud4.4:10": "\"For he whose mind is like a rock, steady, and not wavering,Unexcited by what is exciting, not agitated by what is agitating,For he whose mind is developed thusfrom where will pain come upon him?\""
}