{
    "ud5.6:1": "Thus I heard:At one time the Gracious One was dwelling near Sāvatthī, in Jeta's Wood, at Anāthapiṇḍika's monastery. Then at that time venerable Mahākaccāyana was dwelling amongst the Avanti people, near Kuraraghara, on Pavatta mountain. Then at that time the lay follower Soṇa Kuṭikaṇṇa was venerable Mahākaccāyana's supporter.",
    "ud5.6:2": "Then when the lay follower Soṇa Kuṭikaṇṇa had gone into hiding, into seclusion, this reflection arose in his mind: \"According to the way Master Mahākaccāyana teaches the Dhamma, it is not easy, while dwelling in the home, to live the spiritual life, absolutely fulfilled, absolutely pure, like a polished shell. Well now, after shaving off head-hair and beard, and donning ochre clothes, I could go forth from the home to homelessness.\"",
    "ud5.6:3": "Then the lay follower Soṇa Kuṭikaṇṇa went to venerable Mahākaccāyana, and after going and worshipping venerable Mahākaccāyana, he sat down on one side. While sat on one side the lay follower Soṇa Kuṭikaṇṇa said this to venerable Mahākaccāyana:",
    "ud5.6:4": "\"Here, reverend Sir, having gone into hiding, into seclusion, this reflection arose in my mind: ‘According to the way Master Mahākaccāyana teaches the Dhamma, it is not easy, while dwelling in the home, to live the spiritual life absolutely fulfilled, absolutely pure, like a polished shell. Well now, after shaving off head-hair and beard, and donning ochre clothes, I could go forth from the home to homelessness.’ Reverend Sir, may Master Mahākaccāyana give me the going forth.\"",
    "ud5.6:5": "When that was said, venerable Mahākaccāyana said this to the lay follower Soṇa Kuṭikaṇṇa: \"A solitary meal, a solitary bed, and celibacy, Soṇa, for as long as life lasts, is difficult, come on, Soṇa, right now while still living as a householder, you should devote yourself to the Buddhas’ teaching, and at suitable timesi.e. On Observance dayshave onlya solitary meal, a solitary bed, and celibacy.\"",
    "ud5.6:6": "For a second time when the lay follower Soṇa Kuṭikaṇṇa had gone into hiding, into seclusion, this reflection arose in his mind: \"According to the way Master Mahākaccāyana teaches the Dhamma, it is not easy, while dwelling in the home, to live the spiritual life, absolutely fulfilled, absolutely pure, like a polished shell. Well now, after shaving off head-hair and beard, and donning ochre clothes, I could go forth from the home to homelessness.\"",
    "ud5.6:7": "For a third time when the lay follower Soṇa Kuṭikaṇṇa had gone into hiding, into seclusion, this reflection arose in his mind: \"In the way Master Mahākaccāyana teaches the Dhamma, it is not easy, while dwelling in the home, to live the spiritual life, absolutely fulfilled, absolutely pure, like a polished shell. Well now, after shaving off head-hair and beard, and donning ochre clothes, I could go forth from the home to homelessness.\" For a third time the lay follower Soṇa Kuṭikaṇṇa went to venerable Mahākaccāyana, and after going and worshipping venerable Mahākaccāyana, he sat down on one side. While sat on one side the lay follower Soṇa Kuṭikaṇṇa said this to venerable Mahākaccāyana:",
    "ud5.6:8": "\"Here, reverend Sir, having gone into hiding, into seclusion, this reflection arose in my mind: ‘According to the way Master Mahākaccāyana teaches the Dhamma, it is not easy, while dwelling in the home, to live the spiritual life absolutely fulfilled, absolutely pure, like a polished shell. Well now, after shaving off head-hair and beard, and donning ochre clothes, I could go forth from the home to homelessness.’ Reverend Sir, may Master Mahākaccāyana give me the going forth.\"",
    "ud5.6:9": "Then venerable Mahākaccāyana gave the lay follower Soṇa Kuṭikaṇṇa the going forth.",
    "ud5.6:10": "Then when venerable Soṇa, after residing for the Rains Retreat, had gone into hiding, into seclusion, this reflection arose in his mind: \"I have not seen the Gracious One face to face, but I have heard that the Gracious One is such and such a one. If my preceptor would allow it I could go to see the Gracious One, the Worthy One, the Perfect Sambuddha.\"",
    "ud5.6:11": "Then the venerable Soṇa, having risen from seclusion in the evening time, went to venerable Mahākaccāyana, and after going and worshipping venerable Mahākaccāyana, he sat down on one side. While sat on one side venerable Soṇa said this to venerable Mahākaccāyana:",
    "ud5.6:12": "\"Here, reverend Sir, having gone into hiding, into seclusion, this reflection arose in my mind: ‘I have not seen the Gracious One face to face, but I have heard that the Gracious One is such and such a one.’ If my preceptor would allow it I could go to see the Gracious One, the Worthy One, the Perfect Sambuddha.\"",
    "ud5.6:13": "\"Good, good, Soṇa, you must go, Soṇa, to see the Gracious One, the Worthy One, the Perfect Sambuddha. You will see, Soṇa, that Gracious One who is confident, inspiring confidence, withsensefaculties at peace, mind at peace, having attained supreme self-control and calm, controlled, guarded, with restrained faculties, atruenāga. Having seenhim, in my name you should worship the Gracious One's feet with your head, askif he isfree from affliction, free from sickness, in good health, strong, and living comfortably,saying:",
    "ud5.6:14": "\"Yes, reverend Sir\", said venerable Soṇa, and after greatly rejoicing and gladly receiving this word of venerable Mahākaccāyana, having worshipped and circumambulated venerable Mahākaccāyana, after putting his dwelling place in order, and picking up his robe and bowl, he went on walking tour towards Sāvatthī. Walking gradually on walking tour he went to Sāvatthī, Jeta's Wood, Anāthapiṇḍika's monastery, and the Gracious One, and after going and worshipping the Gracious One, he sat down on one side. While sat on one side venerable Soṇa said this to the Gracious One:",
    "ud5.6:15": "\"Can you bear up, monk? Can you carry on? Did you come along the road without fatigue, and without going short of alms?\"",
    "ud5.6:16": "Then the Gracious One addressed Venerable Ānanda,saying: \"Please prepare a dwelling place, Ānanda, for this visiting monk.\"",
    "ud5.6:17": "Then the Gracious One having spent most of the night sitting in the open air, after washing his feet, entered the living quarters. Also venerable Soṇa having spent most of the night sitting in the open air, after washing his feet, entered the living quarters.",
    "ud5.6:18": "\"Yes, reverend Sir,\" said venerable Soṇa, and after replying to the Gracious One, he melodiously recited all sixteendiscoursesof the Chapter of the Eights.",
    "ud5.6:19": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud5.6:20": "\"Having seen the danger in the world,having come to know the state free from cleaving,The Noble One does not delight in bad deeds,the pure one does not delight in bad deeds.\""
}