{
    "ud5.3:1": "Thus I heard:At one time the Gracious One was dwelling near Rājagaha, in Bamboo Wood, at the Squirrels’ Feeding Place.",
    "ud5.3:2": "The leper Suppabuddha saw while still far away that great crowd of people assembled together. Having seenthat, this occurred to him:",
    "ud5.3:3": "Then the leper Suppabuddha went to that great crowd of people. The leper Suppabuddha saw the Gracious One sat teaching Dhamma surrounded by a great assembly. Having seenthat, this occurred to him:",
    "ud5.3:4": "Then the Gracious One, applied his mind and encompassed fully the whole of that assembly with his mind,thinking: \"Who here is able to understand the Dhamma?\"",
    "ud5.3:5": "Then the leper Suppabuddha having seen the Dhamma, attained the Dhamma, understood the Dhamma, penetrated the Dhamma, crossed over uncertainty, being without doubts, attained full confidence, having become independent of others in the Teacher's teaching, after rising from his seat went to the Gracious One, and after going and worshipping the Gracious One, he sat down at one side. While he was sitting on one side the leper Suppabuddha said this to the Gracious One:",
    "ud5.3:6": "\"Excellent, reverend Sir! Excellent reverend Sir! Just as, reverend Sir, one might set upright what has been overturned, or open up what has been closed, or show a path to one who is lost, or bear an oil lamp in the darkness so that those with vision can see forms, just so has the Dhamma been explained by the Gracious One in countless ways. I go, reverend Sir, to the Gracious One for refuge, and to the Dhamma, and to the Community of monks. Please bear it in mind, reverend Gotama, that I am a lay follower who has gone for refuge from today forward for as long as I have the breath of life.\"",
    "ud5.3:7": "Then the Gracious One instructed, roused, enthused, and cheered the leper Suppabuddha with a Dhamma talk, and after greatly rejoicing and gladly receiving this word of the Gracious One, after rising from his seat, worshipping and circumambulating the Gracious One, he went away.",
    "ud5.3:8": "Then many monks went to the Gracious One, and after going and worshipping the Gracious One, they sat down on one side. While sat on one side those monks said this to the Gracious One:",
    "ud5.3:9": "\"A wise man, monks, was Suppabuddha, who practiced Dhamma in accordance with the Dhamma, and did not trouble me on account of the Dhamma. The leper Suppabuddha, monks, through the destruction of three fetters, is a stream-enterer, not subject to the fall, and is assured of arriving at Full Awakening.\"",
    "ud5.3:10": "When that was said, a certain monk said this to the Gracious One: \"What was the reason, reverend Sir, what was the cause, through which the leper Suppabuddha became a poor man, a wretched man, a miserable man?\"",
    "ud5.3:11": "\"Formerly, monks, the leper Suppabuddha was a son of a wealthy merchant in this very Rājagaha. While going to his pleasure park he saw the Pacceka Buddha Tagarasikkhī entering the city for alms, and having seenhim, this occurred to him: \"Who is this leper roaming around with his leper's robe?\" And having spat, and circumambulated himdisrespectfullyon the left side, he went away.",
    "ud5.3:12": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud5.3:13": "\"As a man with vision, while he is endeavouring,would avoiddangerous paths,Soa wise man in the world of the living, should avoid bad deeds.\""
}