{
    "ud6.6:1": "Thus I heard:At one time the Gracious One was dwelling near Sāvatthī, in Jeta's Wood, at Anāthapiṇḍika's monastery. Then at that time many and various sectarians, ascetics, brāhmaṇas, and wanderers were living at Sāvatthī, having various views, various likings, various tendencies, subject to dependence on various views,such as:",
    "ud6.6:2": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"The self and the world are eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.6:3": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"The self and the world are not eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.6:4": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"The self and the world are eternal and not eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.6:5": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"The self and the world are neither eternal nor not eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.6:6": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"The self and the world are made by oneself — this alone is the truth,allelse is foolish.\"",
    "ud6.6:7": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"The self and the world are made by another — this alone is the truth,allelse is foolish.\"",
    "ud6.6:8": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"The self and the world are made by oneself and by another — this alone is the truth,allelse is foolish.\"",
    "ud6.6:9": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"The self and the world are neither made by oneself nor by another, but have arisen fortuitously — this alone is the truth,allelse is foolish.\"",
    "ud6.6:10": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"Pleasure and pain, the self and the world are eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.6:11": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"Pleasure and pain, the self and the world are not eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.6:12": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"Pleasure and pain, the self and the world are eternal and not eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.6:13": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"Pleasure and pain, the self and the world are neither eternal nor not eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.6:14": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"Pleasure and pain, the self and the world are made by oneself — this alone is the truth,allelse is foolish.\"",
    "ud6.6:15": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"Pleasure and pain, the self and the world are made by another — this alone is the truth,allelse is foolish.\"",
    "ud6.6:16": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"Pleasure and pain, the self and the world are made by oneself and by another — this alone is the truth,allelse is foolish.\"",
    "ud6.6:17": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"Pleasure and pain, the self and the world are neither made by oneself nor by another, but have arisen fortuitously — this alone is the truth,allelse is foolish.\"",
    "ud6.6:18": "They lived contending, quarelling, disputing, attacking each other with sharp tongues,saying: \"Such is Dhamma, such is not Dhamma; such is not Dhamma, such is Dhamma.\"",
    "ud6.6:19": "Then many monks, having dressed in the morning time, after picking up their bowls and robes, entered Sāvatthī for alms. And after walking for alms in Sāvatthī, while returning from the alms-round after the meal, they went to the Gracious One, and after going and worshipping the Gracious One, they sat down on one side.",
    "ud6.6:20": "\"Here, reverend Sir, many and various sectarians, ascetics, brāhmaṇas, and wanderers are living at Sāvatthī, having various views, various likings, various tendencies, subject to dependence on various views,such as:",
    "ud6.6:21": "There are some ascetics and brāhmaṇas who are of this argument, this view: ‘The self and the world are eternal — this alone is the truth,allelse is foolish.’",
    "ud6.6:22": "\"Wanderers from other sects, monks, are blind, without vision, they do not know what is good, they do not know what is not good, they do not know what is Dhamma, they do not know what is not Dhamma. They, not knowing what is good, not knowing what is not good, not knowing what is Dhamma, not knowing what is not Dhamma, live contending, quarelling, disputing, attacking each other with sharp tongues,saying: ‘Such is Dhamma, such is not Dhamma; such is not Dhamma, such is Dhamma.’",
    "ud6.6:23": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud6.6:24": "\"This generation is intent on the I-maker, connected to the other-maker,Some did not know that, and did not see: ‘this is a dart’.",
    "ud6.6:25": "\"But seeing that dart is the cause,There is no more ‘I am the maker’ for him,There is no more ‘Another is the maker’ for him.",
    "ud6.6:26": "\"This generation is possessed by conceit, tied by conceit, bound by conceit,Talking impetuously in regard to their views,Saṁsāra has not been transcended.\""
}