{
    "ud6.10:1": "Thus I heard:At one time the Gracious One was dwelling near Sāvatthī, in Jeta's Wood, at Anāthapiṇḍika's monastery. Then at that time venerable Ānanda went to the Gracious One, and after going and worshipping the Gracious One, he sat down on one side. While sat on one side venerable Ānanda said this to the Gracious One:",
    "ud6.10:2": "\"For as long as the Realised Ones, reverend Sir, do not arise in the world, the Worthy Ones, the Perfect Sambuddhas, for that long the wanderers from other sects are venerated, respected, revered, honoured, esteemed, and in receipt of robes, almsfood, dwellings, and medicinal requisites to help when sick. But when the Realised Ones, reverend Sir, do arise in the world, the Worthy Ones, the Perfect Sambuddhas, then the wanderers from other sects are not venerated, not respected, not revered, not honoured, not esteemed, and are not in receipt of robes, almsfood, dwellings, and medicinal requisites to help when sick. Now, reverend Sir, the Gracious One is venerated, respected, revered, honoured, esteemed, and in receipt of robes, almsfood, dwellings, and medicinal requisites to help when sick, andso isthe Community of monks.\"",
    "ud6.10:3": "\"Just so, Ānanda, for as long as the Realised Ones, Ānanda, do not arise in the world, the Worthy Ones, the Perfect Sambuddhas, for that long the wanderers from other sects are venerated, respected, revered, honoured, esteemed, and in receipt of robes, almsfood, dwellings, and medicinal requisites to help when sick. But when the Realised Ones, Ānanda, do arise in the world, the Worthy Ones, the Perfect Sambuddhas, then the wanderers from other sects are not venerated, not respected, not revered, not honoured, not esteemed, and are not in receipt of robes, almsfood, dwellings, and medicinal requisites to help when sick. Now the Realised One is venerated, respected, revered, honoured, esteemed, and in receipt of robes, almsfood, dwellings, and medicinal requisites to help when sick, andso isthe Community of monks.\"",
    "ud6.10:4": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud6.10:5": "\"The glow worm shines forth for as long as the light-makerthe sundoes not rise,But when the brilliant onethe sunhas risen,Theglow worm'slight is destroyed, and does not shine forth.",
    "ud6.10:6": "In the same way the reasoners shine forth foras long as the Perfect Sambuddhas do not arise in the world.The reasoners are not purified, nor are their disciples, of wrong view,they are not released from suffering.\""
}