{
    "ud6.4:1": "Thus I heard:At one time the Gracious One was dwelling near Sāvatthī, in Jeta's Wood, at Anāthapiṇḍika's monastery. Then at that time many and various sectarians, ascetics, brāhmaṇas, and wanderers were living at Sāvatthī, having various views, various likings, various tendencies, subject to dependence on various views,such as:",
    "ud6.4:2": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"The world is eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.4:3": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"The world is not eternal — this alone is the truth,allelse is foolish.\"",
    "ud6.4:4": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"The world is finite — this alone is the truth,allelse is foolish.\"",
    "ud6.4:5": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"The world is infinite — this alone is the truth,allelse is foolish.\"",
    "ud6.4:6": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"That which is soul, that isalsothe body — this alone is the truth,allelse is foolish.\"",
    "ud6.4:7": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"The soul is one thing, the body is another thing, — this alone is the truth,allelse is foolish.\"",
    "ud6.4:8": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"The individual exists after death — this alone is the truth,allelse is foolish.\"",
    "ud6.4:9": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"The individual does not exist after death — this alone is the truth,allelse is foolish.\"",
    "ud6.4:10": "There were some ascetics and brāhmaṇas who were of this argument, this view: \"The individual exists and does not exist after death — this alone is the truth,allelse is foolish.\"",
    "ud6.4:11": "But there were some ascetics and brāhmaṇas who were of this argument, this view: \"The individual neither exists nor does not exist after death — this alone is the truth,allelse is foolish.\"",
    "ud6.4:12": "They lived contending, quarelling, disputing, attacking each other with sharp tongues,saying: \"Such is Dhamma, such is not Dhamma; such is not Dhamma, such is Dhamma.\"",
    "ud6.4:13": "Then many monks, having dressed in the morning time, after picking up their bowl and robe, entered Sāvatthī for alms. After walking for alms in Sāvatthī, while returning from the alms-round after the meal, they went to the Gracious One, and after going and worshipping the Gracious One, they sat down on one side. While sat on one side those monks said this to the Gracious One:",
    "ud6.4:14": "\"Here, reverend Sir, many and various sectarians, ascetics, brāhmaṇas, and wanderers are living at Sāvatthī, having various views, various likings, various tendencies, subject to dependence on various views,such as:",
    "ud6.4:15": "There are some ascetics and brāhmaṇas who are of this argument, this view: ‘The world is eternal — this alone is the truth,allelse is foolish.’",
    "ud6.4:16": "\"Wanderers from other sects, monks, are blind, without vision, they do not know what is good, they do not know what is not good, they do not know what is Dhamma, they do not know what is not Dhamma. They, not knowing what is good, not knowing what is not good, not knowing what is Dhamma, not knowing what is not Dhamma, live contending, quarelling, disputing, attacking each other with sharp tongues,saying: ‘Such is Dhamma, such is not Dhamma; such is not Dhamma, such is Dhamma.’",
    "ud6.4:17": "\"Formerly, monks, in this Sāvatthī there was a certain King. Then that King, monks, addressed a certain man,saying: ‘Please go, dear Sir, and as many of those congenitally blind as there are in Sāvatthī assemble them in one place.’",
    "ud6.4:18": "\"To some of those congenitally blind he showed the elephant's head,saying: ‘Such is an elephant, blind men!’",
    "ud6.4:19": "\"Then, monks, that man, having shown the elephant to those congenitally blind, went to the King, and after going he said this to the King: ‘Those congenitally blind have seen the elephant, your Majesty, now is the time for whatever you are thinking, your Majesty.’",
    "ud6.4:20": "\"Then that King, monks, went to the congenitally blind, and after going he said this to those congenitally blind: ‘Did you see the elephant, blind men?’",
    "ud6.4:21": "\"Those congenitally blind who had seen the elephant's head, monks, said this: ‘Such is an elephant, your Majesty, he is like a pot.’",
    "ud6.4:22": "\"Those congenitally blind who had seen the elephant's ear, monks, said this: ‘Such is an elephant, your Majesty, he is like a winnowing fan. ’",
    "ud6.4:23": "\"Those congenitally blind who had seen the elephant's tusk, monks, said this: ‘Such is an elephant, your Majesty, he is like a ploughshare.\"",
    "ud6.4:24": "\"Those congenitally blind who had seen the elephant's trunk, monks, said this: ‘Such is an elephant, your Majesty, he is like a plough-pole.\"",
    "ud6.4:25": "\"Those congenitally blind who had seen the elephant's body, monks, said this: ‘Such is an elephant, your Majesty, he is like a store-house’",
    "ud6.4:26": "\"Those congenitally blind who had seen the elephant's leg, monks, said this: ‘Such is an elephant, your Majesty, he is like a pillar.’",
    "ud6.4:27": "\"Those congenitally blind who had seen the elephant's thighs, monks, said this: ‘Such is an elephant, your Majesty, he is like a mortar.’",
    "ud6.4:28": "\"Those congenitally blind who had seen the top of the elephant's tail, monks, said this: ‘Such is an elephant, your Majesty, he is like a pestle.’",
    "ud6.4:29": "\"Those congenitally blind who had seen the tip of the elephant's tail, monks, said this: ‘Such is an elephant, your Majesty, he is like a broom.’",
    "ud6.4:30": "\"And they,saying: ‘Such is an elephant, such is not an elephant; such is not an elephant, such is an elephant,’ hit each other with their fists, and with that, monks, the King was pleased.",
    "ud6.4:31": "\"Just so, monks, wanderers from other sects are blind, without vision, they do not know what is good, they do not know what is not good, they do not know what is Dhamma, they do not know what is not Dhamma. They, not knowing what is good, not knowing what is not good, not knowing what is Dhamma, not knowing what is not Dhamma, live contending, quarelling, disputing, attacking each other with sharp tongues,saying: ‘Such is Dhamma, such is not Dhamma; such is not Dhamma, such is Dhamma.’ \"",
    "ud6.4:32": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud6.4:33": "\"Some ascetics and brāhmaṇas, it seems, are attached to theseviews,Having grasped ahold of it, they dispute,likepeople who seeonlyone side.\""
}