{
    "ud6.2:1": "Thus I heard:At one time the Gracious One was dwelling near Sāvatthī, at the Eastern Monastery in Migāra's mother's mansion. Then at that time the Gracious One having risen from seclusion in the evening time, was sitting outside the doorway.",
    "ud6.2:2": "Then at that time seven knotted-haired ascetics, seven of those knot-freei.e. Jainas, seven naked ascetics, seven one-cloakers, and seven wanderers, with their nails, armpit-hair, and body hair grown long, having taken up their various requisites, were passing by not far away from the Gracious One.",
    "ud6.2:3": "The Kosalan King Pasenadi saw those seven knotted-haired ascetics, seven of those knot-free, seven naked ascetics, seven one-cloakers, and seven wanderers, with their nails, armpit-hair, and body hair grown long, who, having taken up their various requisites, were passing by not far away from the Gracious One. Having seenthem, after rising from his seat, arranging his outer robe on one shoulder, placing his right knee-cap on the ground, towards the place where those seven knotted-haired ascetics, seven of those knot-free, seven naked ascetics, seven one-cloakers, and seven wanderers were, raising his hands in respectful salutation, he three times announced his name,saying: \"Reverend Sirs, I am the Kosalan King Pasenadi.\"",
    "ud6.2:4": "Then the Kosalan King Pasenadi, not long after those seven knotted-haired ascetics, seven of those knot-free, seven naked ascetics, seven one-cloakers, and seven wanderers had gone, went to the Gracious One, and after going and worshipping the Gracious One, he sat down on one side, While sat on one side the Kosalan King Pasenadi said this to the Gracious One: \"Among those in the world, reverend Sir, who are Worthy Ones, or have entered the path to Worthiness, these are some of them.\"",
    "ud6.2:5": "\"But this is hard to know, Great King, by you, a householder, partaking of sense pleasures, by one dwelling in a sleeping place crowded with sons, by one enjoying sandalwood from Kāsi, by one wearing garlands, scents, and creams, by one delighting in gold and silver: ‘These are Worthy Ones, or these have entered the path to Worthiness,’",
    "ud6.2:6": "\"Through living together, Great King, one can understanda person'svirtue, and that after a long time, and not after a short time, by one applying the mind, not by one not applying the mind, by one with wisdom, not by one with poor wisdom.",
    "ud6.2:7": "\"It is wonderful, reverend Sir, it is marvellous, reverend Sir, how well spoken that was, reverend Sir, by the Gracious One: ‘But this is hard to know, Great King, by you, a householder, partaking of sense pleasures, by one dwelling in a sleeping place crowded with sons, by one enjoying sandalwood from Kāsi, by one wearing garlands, scents, and creams, by one delighting in gold and silver: \"These are Worthy, or these have entered the path to Worthiness,\"",
    "ud6.2:11": "\"Through living together, Great King, one can understanda person'svirtue, and that after a long time, and not after a short time, by one applying the mind, not by one not applying the mind, by one with wisdom, not by one with poor wisdom.",
    "ud6.2:12": "\"Through having dealings together, Great King, one can understanda person'spurity, and that after a long time, and not after a short time, by one applying the mind, not by one not applying the mind, by one with wisdom, not by one with poor wisdom.",
    "ud6.2:13": "\"Through misfortunes, Great King, one can understanda person'sstamina, and that after a long time, and not after a short time, by one applying the mind, not by one not applying the mind, by one with wisdom, not by one with poor wisdom.",
    "ud6.2:14": "\"Through discussion, Great King, one can understanda person'swisdom, and that after a long time, and not after a short time, by one applying the mind, not by one not applying the mind, by one with wisdom, not by one with poor wisdom.’",
    "ud6.2:8": "\"These, reverend Sir, are my men, imposters and spies, who are returning after spying on the country, for first they have gone downto the country, and afterwards I will go down. Now these, reverend Sir, having removed dust and dirt, being bathed, well annointed, with trimmed hair and beards, dressed in clean clothes, and provided with and possessing the five strands of sensual pleasures, will amuse themselves.\"",
    "ud6.2:9": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud6.2:10": "\"One should not endeavour in all circumstances, one should not be another's man,One should not live depending on another, one should not live trading in Dhamma.\""
}