{
    "ud8.8:1": "Thus I heard:At one time the Gracious One was dwelling near Sāvatthī, at the Eastern Monastery in Migāra's mother's mansion. Then at that time Migāra's mother Visākhā's grand-daughter, who was beloved and dear, had died.",
    "ud8.8:2": "\"Now where have you come from, Visākhā, with wet clothes and hair,and why are youcoming here in the middle of the day?\"",
    "ud8.8:3": "\"But how many people, Visākhā, die every day in Sāvatthī?\"",
    "ud8.8:4": "\"Now what do you think, Visākhā, would you ever be without wet clothes and hair?\"",
    "ud8.8:5": "\"For those who have a hundred loves, Visākhā, they have a hundred sufferings, for those who have ninety loves, they have ninety sufferings, for those who have eighty loves, they have eighty sufferings, for those who have seventy loves, they have seventy sufferings, for those who have sixty loves, they have sixty sufferings, for those who have fifty loves, they have fifty sufferings, for those who have forty loves, they have forty sufferings, for those who have thirty loves, they have thirty sufferings, for those who have twenty loves, they have twenty sufferings, for those who have ten loves, they have ten sufferings, for those who have nine loves, they have nine sufferings, for those who have eight loves, they have eight sufferings, for those who have seven loves, they have seven sufferings, for those who have six loves, they have six sufferings, for those who have five loves, they have five sufferings, for those who have four loves, they have four sufferings, for those who have three loves, they have three sufferings, for those who have two loves, they have two sufferings, for those who have one love, they have one suffering, for those who love nothing, they have no sorrow. They are griefless, dust-free, and without despair, I say.\"",
    "ud8.8:6": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud8.8:7": "\"Whatever griefs or lamentations there are,And the many kinds of suffering in the world,Theseallarise because of love,Without loves, these do not originate.",
    "ud8.8:8": "\"Therefore they are happy and free from grief,Who are without love for anything in the world,Therefore those wanting what is griefless, dust-free,Should not have love for anything in the world.\""
}