{
    "ud8.5:1": "Thus I heard:At one time the Gracious One was walking on walking tour amongst the Mallas with a great Community of monks, and arrived at Pāva. There the Gracious One dwelt near Pāva, in Cunda the smith's mango wood.",
    "ud8.5:2": "Cunda the smith heard: \"The Gracious One, it seems, is walking on walking tour amongst the Mallas with a great Community of monks, and has arrived at Pāva, and is dwelling near Pāva, in my mango wood.\"",
    "ud8.5:3": "Then Cunda the smith, having understood the Gracious One's consent, after rising from his seat, worshipping and circumambulating the Gracious One, went away.",
    "ud8.5:4": "Then the Gracious One, having dressed in the morning time, after picking up his bowl and robe, together with the Community of monks, went to Cunda the smith's residence, and after going, he sat down on the prepared seat. Having sat down the Gracious One addressed Cunda the smith,saying: \"Serve me with the tender pork you have prepared, Cunda, but serve the Community of monks with the other comestibles and edibles which have been prepared.",
    "ud8.5:5": "Then the Gracious One addressed Cunda the smith,saying: \"Throw that left over tender pork into a pit, Cunda,forI do not see, Cunda, in the world with its devas, Māra, and Brahmā, in this generation with its ascetics and brāhmaṇas, princes and men, one who, having eaten it, could completely digest it, except for a Realised One.\"",
    "ud8.5:6": "Then for the Gracious One, after eating Cunda the smith's food, a painful affliction arose, dysentery, and strong feelings occurred, such as end in death. There the Gracious One, mindfully, with full awareness, borethose painswithout being troubled.",
    "ud8.5:7": "Then the Gracious One addressed venerable Ānanda,saying: \"Come, Ānanda, let us go to Kusināra.\"",
    "ud8.5:8-9": "Having eaten Cunda the smith's food, so I have heard,The Firm One experienced a very strong affliction, such as ends in death.For the Teacher, who had eaten tender pork,A very strong sickness arose.Whilestillpurging the Gracious One said:\"Iwillgo to the city of Kusināra.\"",
    "ud8.5:10": "Then the Gracious One, having gone down from the road, went to the root of a certain tree, and after going, he addressed venerable Ānanda,saying: \"Come now, Ānanda, prepare the outer robe folded in four for me, I am weary, Ānanda, and will sit down.\"",
    "ud8.5:11": "After that was said, venerable Ānanda said this to the Gracious One: \"Just now, reverend Sir, five hundred wagons have passed by, and the little water that flows, having been churned by the wheels, is stirred up and disturbed. The Kukutthā river is not far away, with transparent water, agreeable water, cool water, pure water, with beautiful banks, a delightfulplace, there the Gracious One can drink drinking water, and can cool his limbs.\"",
    "ud8.5:12": "For a second time the Gracious One addressed venerable Ānanda,saying: \"Come now, Ānanda, bring drinking water, I am thirsty, Ānanda, and will drink.\"",
    "ud8.5:13": "Then it occurred to venerable Ānanda: \"Surely it is wonderful, surely it is marvellous, the Realised One's great power and great majesty, in that that little river that is flowing, which has been churned by wheels, and is stirred up and disturbed, as I was going, flowed transparent, clear, and undisturbed.\"",
    "ud8.5:14": "Then the Gracious One with a great Community of monks went to the river Kukutthā, and after going, and entering into the river Kukutthā, bathing, and drinking, and coming back out, went to the mango wood, and after going, he addressed venerable Cundaka,saying: \"Come now, Cundaka, prepare the outer robe folded in four for me, I am weary, Cundaka, and will lie down.\"",
    "ud8.5:15": "\"Yes, reverend Sir\", said venerable Cundaka, and after replying to the Gracious One, he prepared the outer robe folded in four. Then the Gracious One lay down on his right side in the lion's posture, after placing one foot on the top of the other, mindfully, with full awareness, having applied his mind to the thought of rising. And venerable Cundaka sat down right there in front of the Gracious One.",
    "ud8.5:16": "The Awakened One, having gone to the little river Kukutthā,Which had water that was transparent, pleasant, and clear,The Teacher, very weary, enteredthe river,the Realised One, who is unmatched here in the world.",
    "ud8.5:17": "After washing and drinking, the Teacher came out,And in the middle of the group of monks, at the front,The Teacher, the Gracious One, having taught the Dhamma here,The Great Sage went to the mango wood.",
    "ud8.5:18": "He addressed the monk called Cundaka,saying:\"Spread out the lyingrobefolded in four for me,\"Cunda, urged by the One with Developed Mind,Very quickly spreadthe robefolded in four.The Teacher, very weary, lay down,With Cunda sat right there at the front.",
    "ud8.5:19": "Then the Gracious One addressed venerable Ānanda,saying: \"It may be, Ānanda, that someone might cause remorse for the smith Cunda,saying: ‘There is no gain for you, friend Cunda, it is a poor gain for you, friend Cunda, in that the Realised One, after eating his last almsfood from you, attained Complete Emancipation.’ \"Ifthere is remorse for Cunda the smith, Ānanda, drive it out in this way,saying:",
    "ud8.5:20": "‘There is a gain for you, friend Cunda, it is a good gain for you, friend Cunda, in that the Realised One, after eating his last almsfood from you, attained Complete Emancipation. I heard this face to face with the Gracious One, friend Cunda, I learned it face to face:",
    "ud8.5:21": "\"Friend Cunda the smith has accumulated agooddeed that is conducive to long life, friend Cunda the smith has accumulated agooddeed that is conducive to beauty, friend Cunda the smith has accumulated agooddeed that is conducive to happiness, friend Cunda the smith has accumulated agooddeed that is conducive to fame, friend Cunda the smith has accumulated agooddeed that is conducive to heaven, friend Cunda the smith has accumulated agooddeed that is conducive to sovereignty.\"",
    "ud8.5:22": "Then the Gracious One, having understood the significance of it, on that occasion uttered this exalted utterance:",
    "ud8.5:23": "\"For the one who gives merit is increased,From restraint hatred is not accumulated.\"The skilful one gives up what is bad,Through the destruction of passion, hatred, and delusion,he is emancipated.\""
}