{
    "sn1.32:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, when the night had advanced, a number of devatas belonging to the Satullapa host, of stunning beauty, illuminating the entire Jeta’s Grove, approached the Blessed One. Having approached, they paid homage to the Blessed One and stood to one side.",
    "sn1.32:2": "v.85\"Through stinginess and negligenceA gift is not given.One who knows, desiring merit,Should surely give a gift.\"",
    "sn1.32:3": "Then another devata recited these verses in the presence of the Blessed One:",
    "sn1.32:4": "v.86\"That which the miser fears when he does not giveIs the very danger that comes to the nongiver.The hunger and thirst that the miser fearsAfflict that fool in this world and the next.",
    "sn1.32:5": "\"Therefore, having removed stinginess,The conqueror of the stain should give a gift.[n.63] The stain(mala)is stinginess itself; see the stock description of the generous lay follower as one who \"dwells at home with a mind rid of the stain of stinginess\"(vigatamalamaccherena cetasa agaraṁ ajjhavasati).Deeds of merit are the support for living beingsWhen they arisein the other world.\"",
    "sn1.32:6": "Then another devata recited these verses in the presence of the Blessed One:",
    "sn1.32:7": "v.88\"They do not die among the deadWho, like fellow travellers on the road,Provide though they have but a little:This is an ancient principle.[n.64]Spk:Those do not die among the dead:They do not die among those who are \"dead\" by the death consisting in miserliness. The goods of the miser are just like those of the dead, for neither distribute their belongings.",
    "sn1.32:8": "v.9\"Some provide from the little they have,Others who are affluent don’t like to give.An offering given from what little one hasIs worth a thousand times its value.\"sn.i.19",
    "sn1.32:9": "Then another devata recited these verses in the presence of the Blessed One:",
    "sn1.32:10": "v.90\"The bad do not emulate the good,Who give what is hard to giveAnd do deeds hard to do:The Dhamma of the good is hard to follow.",
    "sn1.32:11": "v.91\"Therefore their destination after deathDiffers for the good and the bad:The bad go to hell,The good are bound for heaven.\"",
    "sn1.32:12": "Then another devata said to the Blessed One: \"Which one, Blessed One, has spoken well?\"",
    "sn1.32:13": "\"You have all spoken well in a way. But listen to me too:",
    "sn1.32:14": "v.92\"If one practises the DhammaThough getting on by gleaning,If while one supports one's wifeOne gives from the little one has,Then a hundred thousand offeringsOf those who sacrifice a thousandAre not worth even a fractionOf the giftof one like him.\"[n.65]Spk:If one practises the Dhamma:if one practises the Dhamma by way of the ten courses of wholesome kamma.Though getting on by gleaning(samuñjakaṁ care): one gets on \"by gleaning\" by cleaning up the threshing floor, etc., beating the straw, etc.Of those who sacrifice a thousand:Of those who sacrifice (offer alms) to a thousand bhikkhus or who offer alms purchased with a thousand pieces of money. This done a hundred thousand times is equivalent to alms given to tenkoṭisof bhikkhus or worth tenkoṭisof money (akoṭi= 10,000,000). Are not worth even a fraction: the word \"fraction\"(kala)can mean a sixteenth part, or a hundredth part, or a thousandth part; here a hundredth part 1s intended. If one divides into a hundred parts (the value of) a gift given by him, the gift of 10,000 koṭis given by the others is not worth one portion of that.ThoughSpkspeaks of alms offerings to bhikkhus, v.16just below implies that the animal sacrifices of the brahmins are what is being rejected.",
    "sn1.32:15": "Then another devata addressed the Blessed One in verse:",
    "sn1.32:16": "v.93\"Why does their sacrifice, vast and grand,Not share the value of the righteous one's gift?Why are a hundred thousand offeringsOf those who sacrifice a thousandNot worth even a fractionOf the giftof one like him?\"",
    "sn1.32:17": "v.94\"Since they give while settled in unrighteousness,Having slain and killed, causing sorrow,Their offering—tearful, fraught with violence—Shares not the value of the righteous one's gift.That is why a hundred thousand offeringsOf those who sacrifice a thousandAre not worth even a fractionOf the giftof one like him.\"sn.i.20"
}