{
    "sn1.74:1": "v.229\"What is the best of things that rise up?What excels among things that fall down?What is the best of things that go forth?Who is the most excellent of speakers?\"",
    "sn1.74:2": "v.30\"A seed is the best of things that rise up;Rain excels among things that fall down;Cattle are the best of things that go forth;A son is the most excellent of speakers.\"[n.131]Spk: The former deva had asked the Buddha these questions, but the second deva interrupted, saying, \"Why ask the Buddha? I’ll answer you,\" and then offered his own ideas. But the first deva rebuked him for intruding and again addressed the questions to the Buddha.Spk: Seed of the seven kinds of grain isthe best of things that rise upbecause, when seed rises, food becomes plentiful and the country is secure. Rain from a rain cloudexcels among things that fall downfor this ensures a plentiful crop.Cattle are the best of things that go forth,that walk about on foot, because they produce the five kinds of dairy products (milk, curd, butter, ghee, and cream-of-ghee) by which people sustain their health.A son is the most excellent of speakersbecause he does not say anything harmful to his parents in the royal court, etc.It should be noted thatpavajamananaṁin pāda c is the present participle ofpavajatiorpabbajati,which, in a religious context, signifies the act of leaving the household life to become a monk(pabbajja). Hence the Buddha’s reply in the next verse.",
    "sn1.74:3": "v.21\"Knowledge is the best of things that rise up;Ignorance excels among things that fall down;The Saṅgha is the best of things that go forth;The most excellent of speakers is the Buddha.\"[n.12]Spk: Knowledge(vijjā)is the knowledge of the four paths; ignorance(avijjā)is the great ignorance at the root of the round. The Saṅgha is the best of things that go forth because it is a rich field of merit. The Buddha is the best of speakers because his teaching of the Dhamma helps release many hundred thousands of beings from bondage."
}