{
    "sn1.70:1": "v.22\"In what has the world arisen?In what does it form intimacy?By clinging to what is the worldHarassed in regard to what?\"",
    "sn1.70:2": "v.\"In six has the world arisen;In six it forms intimacy;By clinging to six the worldIs harassed in regard to six.\"[n.16] See above n.57. Following a suggestion of VĀT, I takeupādāyain pāda c to be an absolutive with the literal meaning \"clinging,\" completed by the finite verbvihaññatiin pāda d;lokoin v.1cthus becomes a mere metrical filler.Spk, however, has adopted an alternative solution, supplying a suppressed finite verb and interpretingupādāyain the extended sense of \"depending on\" thus:upādāyain the extended sense of \"depending on\" thus:tani yeva ca upādāya āgamma paṭicca pavattati;\"It occurs dependent on, contingent on, in dependence on them.\" Pj II 10,7–8, commenting onSn 168, takes a similar approach, though with a different finite verb. The Hemavata Sutta itself, however, suggests thatupādāyashould be taken in the literal sense of \"clinging to.\" For after the Buddha has replied at Sn 169 with an answer identical to that in the present sutta, at Sn 170 the yakkha asks:Katamaṁ taṁ upādānaṁ yattha loko vihaññati?,\"What is that clinging wherein the world is harassed?\"—a question which surely refers back to that sameupādāya.Spk: The \"six\" in the question should be understood by way of the six internal sense bases, but it may also be interpreted by way of the six internal and external bases. For the world has arisen in the six internal bases, forms intimacy with the six external bases, and by clinging to (or depending on) the six internal bases, it is harassed in the six external bases.The verse offers a solution to the problem posed below atSN.6, on how the world exists and arises in this very body endowed with perception and mind. On the origination of the world in the six internal bases, seeSN1.44(=SN35.107). Norman discusses the verses from a philological angle at GD, pp. 181–8, n. to 168."
}