{
    "sn1.23:1": "v.55\"A tangle inside, a tangle outside,This generation is entangled in a tangle.I ask you this, O Gotama,Who can disentangle this tangle?\"[n.43] This verse and the next form the opening theme of Vism and are commented on at Vism –4 (Ppn :–8); the explanation is incorporated intoSpk. VĀT suggests that the wordsantojaṭa bahijaṭashould be taken asbahubbihicompounds in apposition topaja(\"having a tangle inside, having a tangle outside\"), but I translate in accordance with Spk, which treats them astappurisa..Spk: Tangle(jaṭa)is a term for the network of craving, in the sense that it \"laces together,\" for it arises repeatedly up and down among the sense objects such as forms. There is a tangle inside, a tangle outside, because craving arises with respect to one's own possessions and those of others; with respect to one's own body and the bodies of others; and with respect to the internal and external sense bases.",
    "sn1.23:2": "v.56\"A man established on virtue, wise,Developing the mind and wisdom,A bhikkhu ardent and discreet:He can disentangle this tangle.[n.44] The Buddha’s reply is a succinct statement of the threefold training, withsamādhireferred to by the wordcitta.Spksays wisdom is mentioned three times in the verse: first as innate intelligence (\"wise\"); second, as insight-wisdom(vipassanā-paññā), the wisdom to be developed; and third, as \"discretion,\" the pragmatic wisdom that takes the lead in all tasks(sabbakiccaparinayika parihariyapañña).\n\t\n.Spk: \"Just as a man standing on the ground and taking up a well-sharpened knife might disentangle a great tangleof bamboos, so this bhikkhu … standing on the ground of virtue and taking up, with the hand of practical intelligence exerted by the power of energy, the knife of insight-wisdom well sharpened on the stone of concentration, might disentangle, cut away, and demolish the entire tangle of craving that had overgrown his own mental continuum\" (adapted from Ppn 1:7).",
    "sn1.23:3": "v.57\"Those for whom lust and hatredAlong with ignorance have been expunged,The arahants with taints destroyed:For them the tangle is disentangled.[n.45] While the previous verse shows the trainee(sekha), who is capable of disentangling the tangle, this verse shows the arahant, the one beyond training(asekha), who has finished disentangling the tangle.",
    "sn1.23:4": "v.58\"Where name-and-form ceases,Stops without remainder,And also impingement and perception of form:It is here this tangle is cut.\"[n.6]Spksays this verse is stated to show the opportunity (or region) for the disentangling of the tangle(jaṭaya vijaṭanokasa). Here name(nama)represents the four mental aggregates. Spk treats impingement(paṭigha)as metrical shorthand for perception of impingement(paṭighasañña). According to Spk-pṭ, in pāda c we should read a compressed dvanda compound, paṭigharūpasañña (\"perceptions of impingement and of form\"), the first part of which has been truncated, split off, and nasalized to fit the metre. Impingement being the impact of the five sense objects on the five sense bases, \"perceptionof impingement\"(paṭighasañña)is defined as the fivefold sense perception (see Vibh 261, 31–3 and Vism 329, 22–2; Ppn 10:16). Perception of form(rūpasañña)has a wider raṅge, comprising as well the perceptions of form visualized in the prising as well the perceptions of form visualized in the jhānas (Spk-pṭ: perception of the form of the earth-kasiṇa, etc.). Spk explains that the former implies sense-sphere existence, the latter form-sphere existence, and the two jointly imply formless-sphere existence, thus completing the three realms of existence.It is here that this tangle is cut.Spk: The tangle is cut, in the sense that the round with its three planes is terminated; it is cut and ceases in dependence on Nibbāna.sn.i.1"
}