{
    "sn1.49:1": "v.60\"Those who are stingy here in the world,Niggardly folk, revilers,People who create obstaclesFor others engaged in giving alms:",
    "sn1.49:2": "v.161What kind of result do they reap?What kind of future destiny?We’ve come to ask the Blessed One this:How are we to understand it?\"",
    "sn1.49:3": "v.162\"Those who are stingy here in the world,Niggardly folk, revilers,People who create obstaclesFor others engaged in giving alms:They might be reborn in hell,In the animal realm or Yama's world.[n.106] \"Yama's world\"(yamaloka)here evidently refers to thepettivisaya,the domain of ghosts. Yama is the Lord of Death; seeMN III 179–86,AN I 18–42.",
    "sn1.49:4": "v.163\"If they come back to the human stateThey are born in a poor familyWhere clothes, food, pleasures, and sportAre obtained only with difficulty.",
    "sn1.49:5": "v.164\"Whatever the fools may expect from others,Even that they do not obtain.This is the result in this very life;And in the future a bad destination.\"",
    "sn1.49:6": "v.15\"We understand thus what you have said;We ask, O Gotama, another question:Those here who, on gaining the human state,Are amiable and generous,",
    "sn1.49:7": "v.166Confident in the Buddha and the DhammaAnd deeply respectful towards the Saṅgha:What kind of result do they reap?What kind of future destiny?We’ve come to ask the Blessed One this:How are we to understand it?\"",
    "sn1.49:8": "v.167\"Those here who, on gaining the human state,Are amiable and generous,Confident in the Buddha and the DhammaAnd deeply respectful towards the Saṅgha,These brighten up the heavensWhere they’ve been reborn.[n.107] I read with Se and Ee1 etesagge pakasenti,as against Beete sagga pakasanti,\"these heavens shine,\" and Ee2ete sagge pakasanti,\"these shine in heaven.\" I takesaggeas accusative plural rather than locative singular, which is also plausible.sn.i.35",
    "sn1.49:9": "v.168\"If they come back to the human stateThey are reborn in a rich familyWhere clothes, food, pleasures, and sportAre obtained without difficulty.",
    "sn1.49:10": "v.169\"They rejoice like the devas who controlThe goods amassed by others.[n.8]Spk-pṭ: Because they are endowed with happiness they are like the devas who exercise control over the goods created by others. The comparison is with the devas of the paranimmitavāsavātti realm, the sixth sense-sphere heaven.This is the result in this very life;And in the future a good destination.\""
}