{
    "sn1.35:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, when the night had advanced, a number of \"faultfinding\" devatas, of stunning beauty, illuminating the entire Jeta's Grove, approached the Blessed One and stood in the air.Spk: There is no separate deva world named \"the faultfinders\"(ujjhanasaññino). This name was given to these devas by the redactors of the texts because they arrived in order to find fault with the Tathāgata for his \"misuse\" of the four requisites. They had thought: ʺThe ascetic Gotama praises contentment with simple requisites to the bhikkhus, but he himself lives luxuriously. Daily he teaches the Dhamma to the multitude. His speech goes in one direction, his deeds in another.\" The fact that they address the Buddha while they are still hovering in the air is already indicative of disrespect.sn.i.24",
    "sn1.35:2": "v.108\"If one shows oneself in one wayWhile actually being otherwise,What one enjoys is obtained by theftLike the gains of a cheating gambler.\"Spkdefines kitava as a fowler(sakuṇika)and explains: \"As a fowler conceals himself behind branches and foliage and kills the fowl that come near, thereby supporting his wife, so the swindler conceals himself behind a rag-robe and cheats the multitude with clever talk. All the use he makes of the four requisites (robes, food, lodging, and medicines) is use by theft. The deva utters this verse with reference to the Blessed One.\" The same explanation of kitava is given at Dhp-a III 375 (toDhp 5). However, at Ja VI 8,19 the word occurs in a context that clearly shows it means a gambler; it is glossed by akkhadhutta, a dice-gambler, and I translate accordingly here. See Palihawadana, \"From Gambler to Camouflage: The Strange Semantic Metamorphosis of Pali Kitava.\"",
    "sn1.35:3": "v.109\"One should speak as one would act;Don’t speak as one wouldn’t act.The wise clearly discern the personWho does not practise what he preaches.\"",
    "sn1.35:4": "v.110\"Not by mere speech nor solely by listeningCan one advance on this firm path of practiceBy which the wise ones, the meditators,Are released from the bondage of Māra.",
    "sn1.35:5": "v.111\"Truly, the wise do not pretend,For they have understood the way of the world.By final knowledge the wise are quenched:They have crossed over attachment to the world.\"",
    "sn1.35:6": "Then those devatas, having alighted on the earth, prostrated themselves with their heads at the Blessed One's feet and said to the Blessed One:\"A transgression overcame us, venerable sir, being so foolish, so stupid, so unskilful that we imagined we could assail the Blessed One. Let the Blessed One pardon us for our transgression seen as such for the sake of restraint in the future.\"",
    "sn1.35:7": "v.112\"If one does not grant pardonTo those who confess transgression,Angry at heart, intent on hate,One strongly harbours enmity.\"",
    "sn1.35:8": "v.113\"If there was no transgression,If here there was no going astray,And if enmities were appeased,Then one would be faultless here.\"in pāda d, I follow Se in reading tenadha, as against kenidha in Be and Ee1 and ko nidha in Ee2. NeitherSpknor Spk-pṭ offers any help with the meaning of the verse. I translate kusala here in accordance with Spk-pṭ's gloss, anavajja. At KS 1:35 this verse has been overlooked.",
    "sn1.35:9": "v.114\"For whom are there no transgressions?For whom is there no going astray?Who has not fallen into confusion?And who is the wise one, ever mindful?\"sn.i.25",
    "sn1.35:10": "v.115\"The Tathāgata, the Enlightened One,Full of compassion for all beings:For him there are no transgressions,For him there is no going astray;He has not fallen into confusion,And he is the wise one, ever mindful.",
    "sn1.35:11": "v.6\"If one does not grant pardonTo those who confess transgression,Angry at heart, intent on hate,One strongly harbours enmity.In that enmity I do not delight,Thus I pardon your transgression.\""
}