{
    "sn1.11:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn1.11:2": "\"Once in the past, bhikkhus, a certain devata of the Tāvatiṁsa host was revelling in Nandana Grove, supplied and endowed with the five cords of celestial sensual pleasure, accompanied by a retinue of celestial nymphs. On that occasion he spoke this verse:",
    "sn1.11:3": "v.20\"‘They do not know blissWho have not seen Nandana,The abode of the glorious male devasBelonging to the host of Thirty.’[n.19] Tāvatiṁsa, \"the realm of the thirty-three,\" is the third sense-sphere heaven. It is so named because thirty-three youths, headed by the youth Magha, had been reborn here as a result of their meritorious deeds. Magha himself became Sakka, ruler of the devas. Nandana is the Garden of Delight in Tāvatiṁsa, so called because it gives delight and joy to anyone who enters it. According toSpk, this deva had just taken rebirth into this heaven and, while wandering through the Nandana Grove, he spoke the verse as a spontaneous paean of joy over his celestial glory. Spk glosses naradevanaṁ with devapurisanaṁ, \"devamales\"; it is clearly not a dvanda compound. Tidasa, \"the Thirty\" (lit. \"triple ten\"), is a poetic epithet for Tāvatiṁsa.sn.i.6",
    "sn1.11:4": "\"When this was said, bhikkhus, a certain devata replied to that devata in verse:",
    "sn1.11:5": "v.21\"‘Don’t you know, you fool,That maxim of the arahants?Impermanent are all formations;Their nature is to arise and vanish.Having arisen, they cease:Their appeasement is blissful.’\"[n.20]Spkascribes this rejoinder to a female deva who was a noble disciple(ariyasavika). Thinking, \"This foolish deva imagines his glory to be permanent and unchanging, unaware that it is subject to cutting off, perishing, and dissolution,\" she spoke her stanza in order to dispel his delusion. The \"maxim of the arahants\" is pronounced by the Buddha atSN1.20also atDN16; the deva-king Sakka repeats it on the occasion of the Buddha’s parinibbāna. The first line usually reads anicca vata saṅkhāra rather than, as here, anicca sabbasaṅkhāra. An identical exchange of verses occurs below atSN9.6, with the goddess Jalinī and the Venerable Anuruddha as speakers. The feminine vocative bale in pāda b implies that the latter dialogue was the original provenance of the verse, or in any case that the first devata is female. Spk: Formations here are all formations of the three planes of existence(sabbe tebhūmakasaṅkhāra), which are impermanent in the sense that they become nonexistent after having come to be(hutva abhavaṭṭhena anicca). Their appeasement is blissful(tesaṁ vūpasamo sukho): Nibbāna itself, called the appeasement of those formations, is blissful."
}