{
    "sn1.2:1": "At Sāvatthī. Then, when the night had advanced, a certain devata of stunning beauty, illuminating the entire Jeta's Grove, approached the Blessed One. Having approached, he paid homage to the Blessed One, stood to one side, and said to him:",
    "sn1.2:2": "\"Do you know, dear sir, emancipation, release, seclusion for beings?\"[n.6]Sattanaṁ nimokkhaṁ pamokkhaṁ vivekaṁ.Spk: \"Emancipation(nimokkha)is the path, for beings are emancipated from the bondage of defilements by the path; release(pamokkha)is the fruit, for at the moment of the fruit beings have been released from the bondage of defilements; seclusion(viveka)is Nibbāna, for when they attain Nibbāna beings are separated from all suffering. Or, alternatively, all three are designations for Nibbāna: for having attained Nibbāna, beings are emancipated, released, separated from all suffering.\" The actual wording of the verse seems to confirm the second alternative.",
    "sn1.2:3": "\"I know, friend, emancipation, release, seclusion for beings.\"",
    "sn1.2:4": "\"But in what way, dear sir, do you know emancipation, release, seclusion for beings?\"",
    "sn1.2:5": "v.2\"By the utter destruction of delight in existence,[n.7]Spkglosses:Nandibhavaparikkhaya ti nandimūlakassa kammabhavassa parikkhayena; nandiya ca bhavassa ca ti pi vaṭṭati;\"By delight-existence-destruction:by the utter destruction of kamma-process existence rooted in delight; it is also proper to understand it as meaning ‘(the destruction) of delight and of existence.’\" It would be more plausible, however, to construe this three-termtappurisaas an inverted compound placed in irregular order probably owing to the exigencies of verse. This interpretation is confirmed by Pj II 469,14 and Dhp-a IV 192,7–8 in their gloss on the relatedbahubbihicompoundnandibhavaparikkhiṇaṁastisu bhavesu parikkhiṇataṇhaṁ;\"one who has destroyed craving for the three realms of existence.\" See too belowv. 300candn. 16.By the extinction of perception and consciousness,By the cessation and appeasement of feelings:It is thus, friend, that I know for beings—Emancipation, release, seclusion.\"[n.8] In this verse only the first two pādas conform to a recognizable metre(Vatta), which indicates that the verse is corrupt. Ee2 amends the third pāda and adds a line found only in a Lanna ms to arrive at a novel reading:vedananaṁ nirodha ca/ upasanto carissati ti.It then treats the last three pādas of the other editions as prose. This, however, alters the meaning of the verse in such a way that it no longer directly answers the question.Spk: By the first method of explanation,delight in existence(nandibhava,or, following the gloss: \"existence rooted in delight\"), being the threefold activity of kammic formation(tividhakammabhisaṅkhāra— see12:1),implies the aggregate of volitional formations(saṅkhārakkhandha); perception and consciousness implies the two aggregates associated therewith; and by mentioning this, the feeling associated with those three aggregates is included. Thus, by \t\tway of the nonoccurrence of the four kammically active mental aggregates(anupadiṇṇaka-arūpakkhandha), \"Nibbāna with residue\"(sa-upadisesa-nibbana)is indicated. By the phrase by the cessation and appeasement of feelings(vedananaṁ nirodha upasama), the kammically acquired(upadiṇṇaka)feeling is referred to, and by mentioning this the other three associated aggregates are implied; the aggregate of form is included as their physical basis and object. Thus, by way of the nonoccurrence of the five kammically acquired aggregates, \"Nibbāna without residue\"(anupadisesa-nibbana)is indicated. By the second method (taking \"delight\" and \"existence\" as parallel terms),delightimplies the aggregate of volitional formations;existence,the aggregate of form; and the other three aggregates are shown under their own names. Nibbāna is indicated as the nonoccurrence of these five aggregates. Thus the Blessed One concludes the teaching with Nibbāna itself."
}