{
    "sn1.3:1": "At Sāvatthī. Standing to one side, that devata recited this verse in the presence of the Blessed One:",
    "sn1.3:2": "v.3\"Life is swept along, short is the life span;No shelters exist for one who has reached old age.Seeing clearly this danger in death,One should do deeds of merit that bring happiness.\"[n.9]Spk: \"Life is swept along\"(upaniati jīvitaṁ)means: \"(Life) is destroyed, it ceases; or it moves towards, i.e., gradually approaches, death\"(upaniyati ti parikkhiyati nirujjhati; upagacchati va; anupubbena maraṇaṁ upeti ti attho). \"Short is the life span\"(appam ayu): \"The life span is limited in two ways: first, because it is said, ‘One who lives long lives for a hundred years or a little longer’ (seeSN4.9); and second, because in the ultimate sense the life-moment of beings is extremely limited, enduring for a mere act of consciousness.\" Spk continues as at Vism 38 (Ppn 8:39).",
    "sn1.3:3": "v.4\"Life is swept along, short is the life span;No shelters exist for one who has reached old age.Seeing clearly this danger in death,A seeker of peace should drop the world's bait.\"[n.10]Spk: This deva had been reborn into one of the brahma worlds with a long life span. When he saw beings passing away and taking rebirth in realms with a short life span, he was moved to pity and urged them to do \"deeds of merit\"(puññani)—to develop the form-sphere and formless-sphere jhānas—so that they would be reborn into the form and formless realms with a long life span. The Buddha’s verse is a rejoinder intended to show that the deva's advice is still tied to the round of existence and does not lead to emancipation. The peace(santi)which the Buddha commends is Nibbāna.Spkexplains two denotations oflokamisa,literally \"carnal things\": (i) figuratively(pariyayena), it denotes the entire round of existence with its three planes, the objective sphere of attachment, \"the bait of the world\"; (ii) literally(nippariyayena), it signifies the four requisites (clothing, food, dwelling, and medicines), the material basis for survival. For the figurative use ofamisa,see v.71d, v.480, andSN5.20; in the last text, however, the six sense objects are compared to baited hooks rather than to the bait itself.sn.i."
}