{
    "sn1.34:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, when the night had advanced, a number of devatas belonging to the Satullapa host, of stunning beauty, illuminating the entire Jeta's Grove, approached the Blessed One. Having approached, they paid homage to the Blessed One and stood to one side.Then one devata, standing to one side, recited this verse in the presence of the Blessed One:",
    "sn1.34:2": "v.10\"There are among humansNo permanent sensual pleasures;Here there are just desirable things.When a person is bound to these,Heedless in their midst,From Death's realm he does not reachThe state of no-more-coming-back.\"[n.70] in pāda d, we should adopt the reading of the agent nounagantain Be, Se, and Ee, as againstagantvain Ee1, which leaves the sentence with an unresolved absolutive clause. We findagantaused in the sense ofagami,andanagantaused synonymously withanagami(in relation toitthattaṁ,\"this state of being\") atAN I 63,30–64,18.Spk: They do not come from Death's realm, that is, from the round of existence with its three planes, to Nibbāna, which is the state of no-more-coming-back(apunagamana), so called because beings do not return from Nibbāna. One who is heedless and bound to sensual pleasures cannot attain that.",
    "sn1.34:3": "Another devata:\"Misery is born of desire; suffering is born of desire. By the removal of desire, misery is removed; by the removal of misery, suffering is removed.\"[n.71] The identity of the speaker of this passage is difficult to determine from the text. I follow Ee2 in taking it to be another devata. Though most editions break the lines up as if they were verse, there is no recognizable metre and it seems likely they are intended as prose. Ee2 does not number it as a verse.Spksays that misery(agha)in the first line is the suffering of the five aggregates, and suffering(dukkha)in the second line is synonymous with it. The fourth line is paraphrased: \"By the removal of the five aggregates the suffering of the round is removed.\"",
    "sn1.34:4": "v.103\"They are not sense pleasures, the world's pretty things:Man's sensuality is the intention of lust.The pretty things remain as they are in the worldBut the wise remove the desire for them.[n.72] in pāda b the unusual compoundsaṅkapparagais glossed bySpkassaṅkappitaraga,\"intended lust.\" Mp III 07,5 glosses:saṅkappavasena uppannarago,\"lust arisen by way of intention (or thought).\" Spk-pṭ adds:subhadivasena saṅkappitavatthumhi rago,\"lust in regard to an object thought about as beautiful, etc.\" The key to the expression, however, is probablyDhp 339d(=Th 760d), where we findsaṅkappa raganissita,\"intentions based on lust.\" Spk sums up the purport of the verse thus: \"Here the identification of sensuality with the sensual object is rejected; it is the sensual defilement that is called sensuality.\"Dhiraallows of two derivations, one meaning \"wise,\" the other \"firm, steadfast\"; see PED and MW, s.v.dhira.I have usually translated it as \"wise,\" following the commentarial glosspaṇḍita,but elsewhere (e.g., at vv.11e,13e,93a, 95a) I have taken advantage of the word's ambivalence to render it \"steadfast.\" The word has elevated overtones and seems to be used solely in verse.sn.i.23",
    "sn1.34:5": "v.104\"One should discard anger, cast off conceit,Transcend all the fetters.No sufferings torment one who has nothing,Who does not adhere to name-and-form.[n.73]Akiñcanain pāda c is a common epithet of the arahant.Spkexplains it as devoid of the \"something\" (or impediments) of lust, hatred, and delusion (seeSN41.7;IV 297,18–19=MN I 298,14–1).",
    "sn1.34:6": "v.105\"He abandoned reckoning, did not assume conceit;He cut off craving here for name-and-form.Though devas and humans search for himHere and beyond, in the heavens and all abodes,They do not find the one whose knots are cut,The one untroubled, free of longing.\"",
    "sn1.34:7": "v.106\"If devas and humans have not seenThe one thus liberated here or beyond,\"said the Venerable Mogharaja,\"Are they to be praised who venerate him,The best of men, faring for the good of humans?\"[n.4]Spk: Mogharaja was an elder skilled in the sequential structure of discourses(anusandhikusala). (Spk-pṭ: He was one of the sixteen pupils of the brahmin Bavarī; seeSn 1116–19.) Having observed that the meaning of the last verse had not gone in sequence, he spoke thus to connect it in sequence (perhaps by drawing out its implications?). Spk points out that although all arahants can be described as \"the best of men, faring for the good of humans\"(naruttamaṁ atthacaraṁ naranaṁ), the elder used this expression with specific reference to the Buddha(dasabalaṁ sandhay’ eva). Spk paraphrases his statement as an interrogative(te kiṁ pasaṁsiya udahu apasaṁsiya), which I follow, but it might also be read as a simple declaration which is first confirmed and then improved upon by the Buddha.",
    "sn1.34:8": "v.107\"Those bhikkhus too become worthy of praise,Mogharaja,\" said the Blessed One,\"Who venerate him, the one thus liberated.But having known Dhamma and abandoned doubt,Those bhikkhus become even surmounters of ties.\"[n.75]Spkexplainsbhikkhūin pāda a (and presumably in pāda d too) as a vocative addressed to Mogharaja; but as the latter is also addressed by name it seems preferable to take the word in both instances as a nominative plural. In both Be and Se the word is clearly plural. The Buddha thus confirms that those who venerate him are praiseworthy, but steers the inquirer beyond mere devotion by adding that those who understand the truth and abandon doubt (by attaining the path of stream-entry) are even more praiseworthy; for they will eventually become \"surmounters of ties\"(saṅgatiga), i.e., arahants."
}