{
    "sn1.28:1": "v.7Ee2precedes this verse with another (v.70) found only in two Lanna mss from northern Thailand. As that verse is not included in any other edition or known ms of SN, and hardly relates to the subject matter of the dialogue between the Buddha and the devata, it clearly does not belong here; thus I have not translated it. My decision is further supported by the absence of any gloss on the verse in Spk and Spk-pṭ, which indicates it was not found in the texts available to the commentators. At Ee2, p. xvii, the editor argues that this verse must be \"restored\" to provide a question put by the deity, but he assumes that the sutta originally read the first word of v. 72d astewhich was then changed tokoorkeby the textual tradition in order to supply a question. But sincekeas a question makes perfectly good sense, both syntactically and semantically, there is no reason to suppose the original reading wasteand thus no need to interpolate a new verse to supply the question.\"Those of great wealth and property,Even khattiyas who rule the country,Look at each other with greedy eyes,Insatiable in sensual pleasures.",
    "sn1.28:2": "v.7Among these who have become so avid,Flowing along in the stream of existence,Who here have abandoned craving?Who in the world are no longer avid?\"Spk: \"Among those who have become so avid(ussukkajatesu): Among those who are engaged in various tasks, avid to produce unarisen forms, etc., and to enjoy those that have arisen.\" in pāda c of the second verse I read ke ’dha taṇhāṁ with Be and Se, as againstgedhataṇhaṁ(\"greed and craving\") in Ee1 & , andkodhataṇhaṁ(\"anger and craving\") in SS. In pāda d, Ee reads telokasmiṁasagainst kelokasmiṁin the other eds.Ussuka(Sktutsuka) means anxiously desirous, zealous, or busily engaged in some pursuit. The corresponding noun isussukka,which is sometimes found where the adjective would have been more appropriate.Ussukais used in both a laudatory and reprobative sense. AtSN41.3 verse , it occurs in the commendatory sense, which I render \"zealous.\" See tooMN48and Vin I 49,19–50,8. The negative sense—of being greedy, ambitious, or \"avid\" (my preferred rendering)—is found here and atDhp 199. The expressionappossukka,lit. \"having little zeal,\" is used to describe one who refrains from busy activity. In SN we find this expression—which I generally render, loosely, \"(living) at ease\"—atSN9.10(I 0,),SN1.4(II 77,1),SN35.40(IV 178,1, here \"keeping still\"), andSN51.10(V 6,18). The abstract nounappossukkata,atSN6.1(I 137,1, 6), characterizes the Buddha’s original inclination, just after his enlightenment, towards a life of quietude rather than towards the \"busy work\" of preaching the Dhamma. See too below n.366and n.551.",
    "sn1.28:3": "v.7\"Having left their homes and gone forth,Having left their dear sons and cattle,Having left behind lust and hatred,Having expunged ignorance—The arahants with taints destroyedAre those in the world no longer avid.\"sn.i.16"
}