{
    "sn1.39:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Vesālī in the Great Wood in the Hall with the Peaked Roof. Then, when the night had advanced, Kokanada, Pajjunna's daughter, of stunning beauty, illuminating the entire Great Wood, approached the Blessed One.[n.90] Pajjunna (SktParjanya) is the deva-king of rain clouds; originally a Vedic deity,Spkassigns him to the heaven of the Four Great Kings. He is mentioned atDN III 205,6.Nothing else is known about his two daughters, named after the red lotus (see v.40a).Having approached, she paid homage to the Blessed One, stood to one side, and recited these verses in the presence of the Blessed One:[n.9] These four verses, in the old āryā metre, have been reconstructed by Alsdorf,Die āryā-Strophen des Pali-Kanons,p. 32.",
    "sn1.39:2": "v.19\"I worship the Buddha, the best of beings,Dwelling in the woods at Vesālī.sn.i.30Kokanada am I,Kokanada, Pajjunna's daughter.[n.9] NeitherSpknor Spk-pṭ offers help with the singular sattassa in pāda a, but I take this simply as a metrical adaptation of sattanaṁ. The line then expresses the same idea asSN45.139(V 41,3–4,).",
    "sn1.39:3": "v.10\"Earlier I had only heard that the DhammaHas been realized by the One with Vision;But now I know it as a witnessWhile the Sage, the Fortunate One, teaches.",
    "sn1.39:4": "v.131\"Those ignorant people who go aboutCriticizing the noble DhammaPass on to the terrible Roruva hellAnd experience suffering for a long time.[n.93]Spk: There are two Roruva hells: the Smokey Roruva(dhūmaroruva)and the Flaming Roruva(jalaroruva). The Smokey Roruva is a separate hell, but the Flaming Roruva is a name for the great hell Avīci, called Roruva because when beings are roasted there they cry out again and again(punappunaṁ ravaṁ ravanti). AtSN3.20the Flaming Roruva is spoken of as the Great Roruva(maharoruva).",
    "sn1.39:5": "v.132\"But those who have peace and acquiescenceIn regard to the noble Dhamma,On discarding the human body,Will fill the host of devas.\"[n.94]Spk-pṭ glosseskhantiyain pāda b asñāṇakhantiya,which implies that here the word does not bear its usual meaning of patience, but the special sense of \"acquiescence\" (in the Teaching). See the expressiondhammanijjhanakkhantiatMN II 173,21–22."
}