{
    "sn1.15:1": "v.28\"When the noon hour sets inAnd the birds have settled down,The mighty forest itself murmurs:How fearful that appears to me!\"[n.24] In pāda b, Be and Se readsannisivesu,a word not encountered elsewhere, while Ee & 2, following SS, readsannisinnesu,which may be a \"correction\" of the original reading; the text available to the subcommentator evidently readsannisivesu.Spkglosses:yatha phasukaṭṭhanaṁ upagantva sannisinnesu vissamanesu.(Spk-pṭ:parissamavinodanatthaṁ sabbaso sannisidantesu;d-karassahi v-karaṁ katva niddeso.) The gist of this explanation is that at noon all the birds (and other animals), exhausted by the heat, are quietly resting in order to dispel their fatigue.In pāda c the resolution ofsaṇatevais problematic. Spk glosses:saṇati viya mahaviravaṁ viya muccati,\"it seems to make a sound, it seems as if it releases a great roar.\" This implies that Spk divides the sandhi intosaṇate iva.Ee2 apparently accepts this with its readingsaṇate va.Following a suggestion of VĀT, I resolve itsaṇati eva,taking the sense to be that the forest itself is emitting the sound. The verbsaṇatimeans merely to make a sound, and is elsewhere used to describe a noisy creek (Sn720–72), so here the sound might be more appropriately described as a murmur than as a roar. In pāda d the verb ispaṭibhati,glossed by Spk asupaṭṭhati.Spk: In the dry season, at high noon, when the animals and birds are all sitting quietly, a great sound arises from the depths of the forest as the wind blows through the trees, bamboo clusters, and hollows. At that moment an obtuse deva, unable to find a companion with whom to sit and converse amiably, uttered the first stanza. But when a bhikkhu has returned from his alms round and is sitting alone in a secluded forest abode attending to his meditation subject, abundant happiness arises (as is expressed in the rejoinder).",
    "sn1.15:2": "v.\"When the noon hour sets inAnd the birds have settled down,The mighty forest itself murmurs:How delightful that appears to me!\""
}