{
    "sn1.33:1": "At Sāvatthī. Then, when the night had advanced, a number of devatas belonging to the Satullapa host, of stunning beauty, illuminating the entire Jeta's Grove, approached the Blessed One. Having approached, they paid homage to the Blessed One and stood to one side.",
    "sn1.33:2": "v.95\"Good is giving, dear sir!Through stinginess and negligenceA gift is not given.One who knows, desiring merit,Should surely give a gift.\"",
    "sn1.33:3": "Then another devata uttered this inspired utterance in the presence of the Blessed One:",
    "sn1.33:4": "v.96\"Good is giving, dear sir!And further:Even when there's little, giving is good.",
    "sn1.33:5": "\"Some provide from what little they have,Others who are affluent don’t like to give.An offering given from what little one hasIs worth a thousand times its value.\"",
    "sn1.33:6": "Then another devata uttered this inspired utterance in the presence of the Blessed One:",
    "sn1.33:7": "\"Good is giving, dear sir!Even when there's little, giving is good.And further:When done with faith too, giving is good.",
    "sn1.33:8": "Then another devata uttered this inspired utterance in the presence of the Blessed One:",
    "sn1.33:9": "\"Good is giving, dear sir!Even when there's little, giving is good.sn.i.21When done with faith too, giving is good.And further:The gift of a righteous gain is also good.",
    "sn1.33:10": "v.98\"When he gives a gift of a righteous gainObtained by exertion and energy,Having passed over Yama's Vetaraṇi River,That mortal arrives at celestial states.\"[n.67]Spkexplainsdhammaladdhassaas either wealth righteously gained, or a person who has gained righteousness, i.e., a noble disciple. The former alternative makes better sense; seeAN II 68,13–20. Yama is the god of the nether world; Vetaraṇī is the Buddhist equivalent of the river Styx (seeSn 674and Pj II 482,4–6). Spk says that Vetaraṇī is mentioned only as \"the heading of the teaching,\" i.e., as an example; he has actually passed over all thirty-one great hells.",
    "sn1.33:11": "Then another devata uttered this inspired utterance in the presence of the Blessed One:",
    "sn1.33:12": "\"Good is giving, dear sir!Even when there's little, giving is good.When done with faith too, giving is good;The gift of a righteous gain is also good.And further:Giving discriminately too is good.[n.68]ViceyyadanaṁThe expression is an absolutive syntactical compound; see Norman, \"Syntactical Compounds in Middle Indo-Aryan,\" inCollected Papers,4:218–19.Spk: A gift given after making discrimination. There are two kinds of discrimination: (i) regarding the offering, i.e., one puts aside inferior items and gives only superior items; and (ii) regarding the recipient, i.e., one leaves aside those defective in morality or the followers of the ninety-five heretical creeds (pasaṇḍa,the non-Buddhist sects; seen. 355) and gives to those endowed with such qualities as virtue, etc., who have gone forth in the Buddha’s dispensation.",
    "sn1.33:13": "v.99\"Giving discriminately is praised by the Fortunate One—To those worthy of offeringsHere in the world of the living.What is given to them bears great fruitLike seeds sown in a fertile field.\"",
    "sn1.33:14": "Then another devata uttered this inspired utterance in the presence of the Blessed One:",
    "sn1.33:15": "\"Good is giving, dear sir!Even when there's little, giving is good.When done with faith too, giving is good;The gift of a righteous gain is also good.Giving with discretion too is good.And further:Restraint towards living beings is also good.",
    "sn1.33:16": "v.100\"One who fares harming no living beingsDoes no evil from fear of others’ censure.In that they praise the timid, not the brave,For out of fear the good do no evil.\"",
    "sn1.33:17": "Then another devata said to the Blessed One:sn.i.22\"Which one, Blessed One, has spoken well?\"",
    "sn1.33:18": "\"You have all spoken well in a way. But listen to me too:",
    "sn1.33:19": "v.101\"Surely giving is praised in many ways,But the path of Dhamma surpasses giving.For in the past and even long ago,The good and wise ones attained Nibbāna.\"[n.69] in pāda a, I readaddha hiwith Ee2 and SS (also at Ja III 472,29), as againstsaddhā hiin Be and Ee1 andsaddhabhiin Se.Spkglossesdhammapadaṁvain pāda b thus:nibbanasaṅkhataṁ dhammapadam eva,\"just the state of Dhamma known as Nibbāna.\" Usuallydhammapadais a stanza or saying of Dhamma (as at vv.785–86,826), which is also plausible in this context, but I prefer to take it as a metrical contraction of dhammapaṭipadā, the practice-path of Dhamma, a sense attested to atSn 88, which explicitly equatesdhammapadawithmagga.The point the Buddha is then making is that the practice of Dhamma (by the Noble Eightfold Path aimed at Nibbāna) is better than the practice of giving aimed at a heavenly rebirth. The fuller gloss on the verse at Ja III 474 supports the above interpretation: ʺAlthough giving is definitely(ekaṁen’ eva,apparently the gloss onaddha hi)praised in(ekamsenʹeva,apparently the gloss onaddhahi)praised in many ways, a dhammapada—a portion of Dhamma(dhammakoṭthasa)consisting in serenity and insight and in Nibbāna—is even better than giving. Why so? Because in the past(pubb’ eva)—that is, in this aeon, Kassapa Buddha and soon—and even earlier(pubbatar’eva), that is, Vessabhū Buddha and so on (in earlier aeons), the good, the superior persons(sappurisa), endowed with wisdom, developed serenity and insight and attained Nibbāna.\""
}