{
    "sn1.37:1": "Thus have I heard. On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Great Wood together with a great Saṅgha of bhikkhus, with five hundred bhikkhus all of whom were arahants.[n.82] This sutta reproduces the opening of the mahāsamaya Sutta (DN No. 20). The background story, related in detail inSpk(as well as in Sv II 672–77 onDN No. 20), begins when the Buddha intervened to prevent a war between the Sakyans and Koliyans, his paternal and maternal kinsmen, over the waters of the river Rohiṇī. After he mediated a peaceful resolution of their conflict, 250 youths from each community went forth under him as monks. After a period of exertion, they all attained arahantship on the same day, the full-moon day of the month of Jeṭṭhamūla (May-June). When the sutta opens, on the same night, they have all assembled in the Master's presence in order to announce their attainments. The wordsamayain the title means, not \"occasion,\" but meeting or \"concourse\"; Spk glossesmahāsamayain v. 2 asmahāsamūha,\"great assembly.\"And the devatas from ten world systems had for the most part assembled in order to see the Blessed One and the Bhikkhu Saṅgha. Then the thought occurred to four devatas of the host from the Pure Abodes:[n.83] The Pure Abodes(suddhāvasā)are five planes in the form realm into which only nonreturners can be reborn: Aviha, Atappa, Sudassa, Sudassī, and Akaniṭṭha. Here they attain final deliverance without ever returning from that realm. All the inhabitants are thus either nonreturners or arahants.\"This Blessed One is dwelling among the Sakyans at Kapilavatthu in the Great Wood together with a great Saṅgha of bhikkhus, with five hundred bhikkhus all of whom are arahants. And the devatas from ten world systems have for the most part assembled in order to see the Blessed One and the \nBhikkhu Saṅgha. Let us also approach the Blessed One and, in his presence, each speak our own verse.\"",
    "sn1.37:2": "Then, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, those devatas disappeared from among the devas of the Pure Abodes and reappeared before the Blessed One. Then those devatas paid homage to the Blessed One and stood to one side. Standing to one side, one devata recited this verse in the presence of the Blessed One:",
    "sn1.37:3": "v.121\"A great concourse takes place in the woods,The deva hosts have assembled.We have come to this Dhamma concourseTo see the invincible Saṅgha.\"",
    "sn1.37:4": "Then another devata recited this verse in the presence of the Blessed One:",
    "sn1.37:5": "v.122\"The bhikkhus there are concentrated;They have straightened their own minds.Like a charioteer who holds the reins,The wise ones guard their faculties.\"sn.i.27",
    "sn1.37:6": "Then another devata recited this verse in the presence of the Blessed One:",
    "sn1.37:7": "v.123\"Having cut through barrenness, cut the cross-bar,Having uprooted Indra's pillar, unstirred,They wander about pure and stainless,Young nāgas well tamed by the One with Vision.\"[n.84] in pāda a, I readkhilaṁwith Se and Ee1 & 2, as againstkhīlaṁin Be. Asindakhīlaṁappears in pāda b, khīlaṁ would be redundant in pāda a. The two words are unrelated:khīlais a wasteland, both literally and figuratively; khila, a stake or pillar, of which a particular kind, the indakhīla, is planted in front of a city gate or at the entrance to a house as an auspicious symbol.Spkdefines all three terms—khila, paligha, and indakhīla—in the same way, as lust, hatred, and delusion. AtSN45.166these three are called khila, but atMN I 139,19–22palighais identified with ignorance(avijjā). A set of five cetokhila is mentioned atMN I 101,9–2.These bhikkhus are unstirred(anejā)by the stirring (or commotion,ejā) of craving (seeSN35.90). Nāga is a word used to designate various types of powerful beings, particularly a class of semi-divine dragons, but it also can denote cobras and bull elephants and is used as a metaphor for the arahant; seeMN I 145,5–. In relation to the arahant the dominant sense is that of the bull elephant(seeDhp chap. 23), but because the latter expression would, in English, seem demeaning rather than complimentary I have leftnāgauntranslated.Spkexplains the word by way of \"edifying etymology\" thus:chandadihi na gacchanti ti nāga; tena tena maggena pahine kilese na agacchanti ti nāga; nanappakaraṁ aguṁ na karonti ti nāga;\"nāgas, because they do not go along by way of desire and so forth; nāgas, because they do not return to the defilements abandoned by the successive paths; nāgas, because they do not commit the various kinds of crime.\" Spk calls this a brief account and refers the reader to Nidd I 201–2 for a full explanation. See tooSn 522, which offers a similar etymology.The \"One with Vision\"(cakkhumā)is the Buddha, so called because he possesses the \"five eyes\" (see n.30).",
    "sn1.37:8": "Then another devata recited this verse in the presence of the Blessed One:",
    "sn1.37:9": "v.124\"Those who have gone to the Buddha for refugeWill not go to the plane of misery.On discarding the human body,They will fill the hosts of devas.\"[n.85]Spk: This verse refers to those who have gone for refuge by the definitive going for refuge(nibbematikasaraṇagamana). Spk-pṭ: By this the supramundane going for refuge is meant (i.e., by the minimal attainment of stream-entry). But those who go for refuge to the Buddha by the mundane going for refuge (i.e., without a noble attainment) will not go to the plane of misery; and if there are other suitable conditions, on leaving the human body they will fill up the hosts of devas."
}