{
    "sn1.25:1": "v.6\"If a bhikkhu is an arahant,Consummate, with taints destroyed,One who bears his final body,Would he still say, ‘I speak’?And would he say, ‘They speak to me’?\"[n.48]Spk: This deva, who dwelt in a forest grove, heard the forest bhikkhus using such expressions as \"I eat, I sit, my bowl, my robe,\" etc. Thinking, \"I had imagined these bhikkhus to be arahants, but can arahants speak in ways that imply belief in a self?\" he approached the Buddha and posed his question.",
    "sn1.25:2": "v.6\"If a bhikkhu is an arahant,Consummate, with taints destroyed,One who bears his final body,He might still say, ‘I speak,’And he might say, ‘They speak to me.’Skilful, knowing the world's parlance,He uses such terms as mere expressions.\"[n.49]Voharamattena so vohareyya.Spk: \"Although arahants have abandoned talk that implies belief in a self, they do not violate conventional discourse by saying, ‘The aggregates eat, the aggregates sit, the aggregates’ bowl, the aggregates’ robe’; for no one would understand them.\" See in this connectionDN I 0,7–9:\"Thus, Citta, there are these worldly expressions, worldly terms, worldly conventions, worldly concepts, which the Tathāgata uses without grasping them.\"",
    "sn1.25:3": "v.6\"When a bhikkhu is an arahant,Consummate, with taints destroyed,ṁā\nOne who bears his final body,Is it because he has come upon conceitThat he would say, ‘I speak,’That he would say, ‘They speak to me’?\"[n.50]Spk: At this point the deva thought that while arahants may not speak thus because they hold a view (of self), they might do so because they still have conceit (i.e.,asmimana,the conceit \"I am\"). Hence he asked the second question, and the Buddha’s reply indicates arahants have abandoned the ninefold conceit.",
    "sn1.25:4": "v.6\"No knots exist for one with conceit abandoned;For him all knots of conceit are consumed.Though the wise one has transcended the conceived,sn.i.15He still might say, ‘I speak,’He might say too, ‘They speak to me.’Skilful, knowing the world's parlance,He uses such terms as mere expressions.\"[n.51]Spkresolvesmanaganthassain pāda b asmano ca gantha assa,\"for him conceit and knots,\" in order to conform to the doctrinal tetrad ofgantha,which does not includemana;seeSN5.17. It seems, however, that heremanaganthashould be understood in a looser sense, asmanassa gantha.AtIt ,16, in a sutta solely aboutmana,we findmanaganthaused as abahubbihicompound qualifyingpaja(\"a generation knotted by conceit\") and arahants described asmanaganthabhibhuno(\"those who have overcome the knots of conceit\"), which supports my rendering here. The readings of pāda c vary: Be hasmaññataṁ,Semaññana(which is the gloss in Spk (Be)), Ee1 yamataṁ, Ee2ya mataṁ(= yam mataṁ?). Spk explains that he has transcended the threefold conceiving due to craving, views, and conceit."
}