{
    "sn1.20:1": "Thus have I heard. On one occasion the Blessed One was dwelling at R̄jagahain the Hot Springs Park. Then the Venerable Samiddhi, having risen at the first flush of dawn, went to the hot springs to bathe. Having bathed in the hot springs and come back out, he stood in one robe drying his limbs.",
    "sn1.20:2": "v.4\"Without having enjoyed you seek alms, bhikkhu,You don’t seek alms after you’ve enjoyed.First enjoy, bhikkhu, then seek alms:Don’t let the time pass you by!\"sn.i.9",
    "sn1.20:3": "v.4\"I do not know what the time might be;The time is hidden and cannot be seen.Hence, without enjoying, I seek alms:Don’t let the time pass me by!\"[n.2] The verses revolve around a pun on the double meaning ofbhuñjati,to eat food and to enjoy sense pleasures. The devata is ostensibly telling Samiddhi to eat before going on alms round (i.e., to get his fill of sensual pleasures before taking to the monk's life), but Samiddhi insists he will not abandon the monk's life for the sake of sensual enjoyment.Spk: The devata had spoken of time with reference to the time of youth, when one is able to enjoy sensual pleasures. In pādas ab of his reply Samiddhi speaks with reference to the time of death(maraṇakala), which is hidden(channa)in that one never knows when it will arrive. In pāda d he refers to the time for practising the duty of an ascetic(samaṇadhammakaraṇakala), as it is difficult for an old person to learn the Dhamma, practise austerities, dwell in the forest, and develop the meditative attainments. Thevoin pāda a is a mere indeclinable(nipatamatta).",
    "sn1.20:4": "Then that devat̄a lighted on the earth and said to the Venerable Samiddhi:\"You have gone forth while young, bhikkhu, a lad with black hair, endowed with the blessing of youth, in the prime of life, without having dallied with sensual pleasures. Enjoy human sensual pleasures, bhikkhu; do not abandon what is directly visible in order to pursue what takes time.\"",
    "sn1.20:5": "\"I have not abandoned what is directly visible, friend, in order to pursue what takes time. I have abandoned what takes time in order to pursue what is directly visible. For the Blessed One, friend, has stated that sensual pleasures are time-consuming, full of suffering, full of despair, and the danger in them is still greater, while this Dhamma is directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.\"[n.33] AtSN4.21Māra offers the same advice to a group of young bhikkhus, who reply in words identical with those of Samiddhi. The Buddha’s exposition of the dangers in sensual pleasures may be found atMN I 8–87,364–67,06–8, and elsewhere. Samiddhi's answer reiterates the standard verse of homage to the Dhamma, omitting only the first term (\"well expounded\"), which is not relevant here.Spkinterprets the \"immediate\" or \"timeless\"(akalika)character of the Dhamma by way of the Abhidhamma doctrine that the fruit(phala)arises in immediate succession to its respective path(magga), but this idea certainly seems too narrow for the present context, where the contrast is simply between the immediately beneficial Dhamma and \"time-consuming\" sensual pleasures. For more on akalika, see Vol II,n. 103. A few words are called for in explanation of my translation ofopanayikaas \"applicable,\" which departs from the prevalent practice of rendering it \"leading onward.\" CPD points out that \"the context in which (the word) occurs shows clearly that it cannot have the active sense of ‘leading to’ … but must rather be interpreted in a passive sense (gerundive) in accordance with the commentaries.\" To be sure, Vism 217,10–12 (Ppn 7:84) does allow for an active sense with its alternative derivation:nibbānaṁ upanetiti ariyamaggo upaneyyo … opanayiko,\"it leads on to Nibbāna, thus the noble path is onward-leading … so it is leading onwards\"; this derivation, however, is almost surely proposed with \"edifying\" intent. Earlier in the same passage the word is glossed by the gerundiveupanetabba,\"to be brought near, to be applied,\" so I follow the derivation at Vism 217,3–9 (Ppn 7:83), which is probably correct etymologically:bhavanavasena attano citte upanayanaṁ arahati ti opanayiko … asaṅkhato pana attano cittena upanayanaṁ arahati ti opanayiko; sacchikiriyavasena alliyanaṁ arahati ti attho;\"The Dhamma (as noble path) is applicable because it deserves application within one's own mind by way of meditative development … .But the unconditioned Dhamma (i.e., Nibbāna) is applicable because it deserves application with one's own mind; that is, it deserves being resorted to by way of realization.\"While the word opanayika does not occur in any other context that allows us to draw inferences about its meaning, the cognate expressio att’ūpanayiko(atSN.7(V 33,21, 26) and Vin III 91,33–34) clearly means \"applicable to oneself.\" On the other hand, to indicate that the Dhamma conduces to Nibbāna the texts use another expression,niyyanika upasamasaṁvattanika(see, e.g.,SN.2(V 380,11) and upasamasaṁattanika (see, e.g.,SN.2(V 380,11)andMN I 67,13), which would not fit the contexts where the above formula appears.)",
    "sn1.20:6": "\"But how is it, bhikkhu, that the Blessed One has stated that sensual pleasures are time-consuming, full of suffering, full of despair, and the danger in them is still greater? How is it that this Dhamma is directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise?\"",
    "sn1.20:7": "\"I am newly ordained, friend, not long gone forth, just recently come to this Dhamma and Discipline. I cannot explain it in detail. But that Blessed One, the Arahant, the Perfectly Enlightened One, is dwelling at Rājagaha in the Hot Springs Park. Approach that Blessed One and ask him about this matter. As he explains it to you, so you should remember it.\"",
    "sn1.20:8–17": "\"It isn’t easy for us to approach that Blessed One, bhikkhu, as he is surrounded by other devatas of great influence.[n.34]Spk: \"Each of the deva-kings has a retinue of a hundred or a thousandkoṭisof devas. Placing themselves in grand positions, they see the Tathāgata. How can powerless female devas like us get a chance to see him?\" Akoṭi= 10,000,000.If you would approach him and ask him about this matter, we will come along too in order to hear the Dhamma.\"",
    "sn1.20:18": "When this was said, that devat̄said to the Venerable Samiddhi: \"Ask, bhikkhu! Ask, bhikkhu! For I have arrived.\"",
    "sn1.20:19": "Then the Blessed One addressed that devata in verse:",
    "sn1.20:20": "v.46\"Beings who perceive what can be expressedBecome established in what can be expressed.Not fully understanding what can be expressed,They come under the yoke of Death.[n.35]Spk: What can be expressed(akkheyya)are the five aggregates, the objective sphere of linguistic reference (not the terms of expression themselves). Beings who perceive what can be expressed(akkheyyasaññino satta): When ordinary beings perceive the five aggregates, their perceptions are affected by the ideas of permanence, pleasure, and self, elsewhere called \"distortions\"(vipallasa,AN II 52,4–8). These distorted perceptions then provoke the defilements, on account of which beings become established in what can be expressed(akkheyyasmiṁ patiṭṭhita). Beings \"become established in\" the five aggregates in eight ways: by way of lust, hatred, delusion, views, the underlying tendencies, conceit, doubt, and restlessness (seen. 2).It-a II 31–32, commenting on the same couplet atIt 53, says that \"beings who perceive what can be expressed\" are those who perceive the five aggregates by way of a percept occurring in the mode of \"I,\" \"mine,\" \"deva,\" \"human,\" \"woman,\" or \"man,\" etc. That is, they perceive the five aggregates as a being or person, etc.Spksuggests that this verse is stated in order to show how sensual pleasures are \"time-consuming.\" [Spk-pṭ:Kamahere denotes all phenomena of the three planes, called sensual pleasures because they are pleasurable(kamaniya).] This suggestion seems confirmed by the last line: those who do not understand the five aggregates correctly \"come under the yoke of Death\"; they undergo repeated birth and death and hence remain caught in saṁsara, the net of time.",
    "sn1.20:21": "v.47\"But having fully understood what can be expressed,One does not conceive ‘one who expresses.’For that does not exist for himBy which one could describe him.[n.36]Spk: One \"fully understands what can be expressed\" by way of the three kinds of full understanding: (i) by full understanding of the known(ñātapariññā)one understands the five aggregates in terms of their individual characteristics, etc.; (ii) by full understanding by scrutinization(tiraṇapariññā)one scrutinizes them in forty-two modes as impermanent, suffering, etc.; (iii) by full understanding as abandonment(pahānapariññā)one abandons desire and lust for the aggregates by means of the supreme path. For a fuller discussion, see Vism 606–7 (Ppn 20:3–4) and Vism 611–13 (Ppn 20:18–19), based on Paṭis II 238–42, where, however, only forty modes are enumerated under (ii). The forty-two modes are at Vism 655,15–30 (Ppn :59), in connection with \"discerning formations as void.\"One does not conceive \"one who expresses\"(akkhataraṁ na maññati).Spk: The arahant does not conceive the speaker as an individual(puggala);that is, he no longer takes the five aggregates to be \"mine,\" \"I,\" and \"my self.\"That does not exist for him(taṁ hi tassa na hoti ti): In this couplet I follow SS in omitting, as an interpolation, the words na tassa atthi, included in all the printed eds. The Skt version too, cited at Ybhūś 2:2 (Enomoto, CSCS, p. 23), does not include such a phrase, but reads: tad vai na vidyate tasya, vadeyur yena tam pare, \"That does not exist for him by which others might speak of him.\"Spkexplains that there exist no grounds for speaking of the arahant as lustful, or as hating, or as deluded. It would be more fitting, perhaps, to see this second couplet as referring to the arahant after his parinibbāna, when by casting off the five aggregates (\"what can be expressed\") he goes beyond the raṅge of verbal expression (seeSnp 1076). It should be noted that thematically these two verses closely correspond to the Mūlapariyaya Sutta (MN No. 1). Spk states that this verse discusses the \"directly visible\" ninefold supramundane Dhamma, i.e., the four paths, their fruits, and Nibbāna.\"If you understand, spirit, speak up.\"",
    "sn1.20:22": "\"I do not understand in detail, venerable sir, the meaning of what was stated in brief by the Blessed One. Please, venerable sir, let the Blessed One explain it to me in such a way that I might understand in detail the meaning of what he stated in brief.\"sn.i.12",
    "sn1.20:23": "v.48\"One who conceives ‘I am equal, better, or worse,’Might on that account engage in disputes.But one not shaken in the three discriminationsDoes not think, ‘I am equal or better.’[n.37] The \"three discriminations\"(tayo vidha)are the three modes of conceit: the conceit \"I am better\"(seyyo ’ham asmimana), the conceit \"I am equal\"(sadiso ’ham asmimana), and the conceit \"I am worse\"(hino ’ham asmimana). SeeSN22.49(III 48–49),SN45.162,46:41. At Vibh 389–90 it is shown that these three become ninefold in so far as each triad may be entertained by one who is truly better, truly equal, or truly worse. One \"not shaken in the three discriminations\" is the arahant, who alone has completely eradicated the fetter of conceit.Spkpoints out that the first couplet shows how sensual pleasures are time-consuming, while the second couplet discusses the supramundane Dhamma.\"If you understand, spirit, speak up.\"",
    "sn1.20:24": "\"In this case too, venerable sir, I do not understand in detail … let the Blessed One explain it to me in such a way that I might understand in detail the meaning of what he stated in brief.\"",
    "sn1.20:25": "v.49\"He abandoned reckoning, did not assume conceit;[n.38] The most common reading of this pāda ispahasi saṅkhaṁ na vimanam ajjhaga,found in Be, Se, and Ee1 ofv. 49, in Be and Ee1 of the parallel v.105, and in the lemma inSpk(Be, Se) to v. 49. From his comments it is clear the commentator had a text withvimana,which he explains as equivalent tovividhamana:\"He does not assume the threefold conceit with its nine divisions\"(navabhedaṁ tividhamanaṁ na upagato). Spk's alternative explanation, which takesvimanaṁto be the mother's womb, the destination of the rebirth process, seems too fanciful to be taken seriously.Vimanadassioccurs atSn 887bin the sense of \"contemptuous,\" but this meaning ofvimanamay be too narrow for the present context. The verse may have originally readna ca manamand this reading may have already been corrupted before the age of the commentaries, c/v confusion being not uncommon in Sinhala-script texts. The corruption would then have been preserved and perpetuated by the commentators. Despite the dominance ofna vimanam,the readingna ca manamis found in v.105of Se, in the lemma to v. 49 in four Sinhala mss of Spk (referred to in the notes to Spk (Se)), and in Thai eds. of SN and Spk. The Skt counterpart (quoted at Ybhūś 2:4; Enomoto, CSCS, p. 23) hasprahaya manaṁ ca na saṅgam eti,which corresponds more closely to the alternative reading of the Pali. The original finite verb may have been the rare reduplicative perfectaja(as in SS) oraga(as in Ee2 and Thai eds.). See von Hinüber, \"On the Perfect in Pali,\"Selected Papers,pp. 174–76.Spkunderstandspahasi saṅkhaṁto mean that the arahant can no longer be described by such concepts as lustful, hating, or deluded, but the point is more likely to be that he has stopped formingpapañcasaññasaṅkha,\"ideas and notions arisen from mental proliferation\" (seeMN I 112,2–3). The Skt readingsaṅgammay actually make better sense in this context. It seems that this phrase refers back tov. 47andna vimanam ajjhagaback to v. = 48. It is possible, too, that the lines describe the arahant after his parinibbāna, when he can no longer be reckoned by way of the five aggregates (seeSN44.1). Pādas cf seem to be describing the arahant after his parinibbāna, though elsewhere he is also said to be unfindable here and now (e.g., atSN22.86; III 118,35–36).He cut off craving here for name-and-form.Though devas and humans search for himHere and beyond, in the heavens and all abodes,They do not find the one whose knots are cut,The one untroubled, free of longing.",
    "sn1.20:26": "\"If you understand, spirit, speak up.\"",
    "sn1.20:27": "\"I understand in detail, venerable sir, the meaning of what was stated in brief by the Blessed One thus:",
    "sn1.20:28": "v.50\"One should do no evil in all the world,Not by speech, mind, or body.Having abandoned sense pleasures,Mindful and clearly comprehending,One should not pursue a courseThat is painful and harmful.\"[n.39]Spkexplains the avoidance of evil in body, speech, and mind by way of the ten courses of wholesome kamma (seeMN I 47,12–17,7–8, etc.). The phrase havingabandoned sense pleasuresrejects the extreme of indulgence in sensual pleasures;one should not pursue a course that is painful and harmfulrejects the extreme of self-mortification. Thus, Spk says, the verse points to the middle way that avoids the two extremes. The whole verse can also be construed positively in terms of the Noble Eightfold Path: doing no evil by body and speech implies right speech, right action, and right livelihood; \"mindful\" implies right effort, right mindfulness, and right concentration; \"clearly comprehending\" implies right view and right intention. Spk says that at the end of the Buddha’s discourse the devata was established in the fruit of stream-entry and spoke this verse, \"a great Dhamma teaching,\" in order to show the eightfold path by which she had attained the fruit.sn.i.13"
}