{
    "sn1.46:1": "v.49\"Resounding with a host of nymphs,Haunted by a host of demons!This grove is to be called ‘Deluding’:How does one escape from it?\"[n.00]Spkrelates the background story: In his previous life this deva had been an overzealous bhikkhu who had neglected sleep and food in order to attend to his meditation subject. Because of his excessive zeal, he died of a wind ailment and was immediately reborn in the Tāvatiṁsa heaven amidst a retinue of celestial nymphs(acchara). The change occurred so quickly that he did not even know he had expired and thought he was still a bhikkhu. The nymphs tried to seduce him,but he rejected their amorous advances and tried to resume his meditation practice. Finally, when the nymphs brought him a mirror, he realized he had been reborn as a deva, but he thought: \"I did not practise the work of an ascetic in order to take rebirth here, but to attain the supreme goal of arahantship.\" Then, with his virtue still intact, surrounded by the retinue of nymphs, he went to the Buddha and spoke the first verse. The verse revolves around a word play between Nandana, the garden of delight, and Mohana, the garden of delusion. The garden was \"resounding with a host of nymphs\" because the nymphs were singing and playing musical instruments. Spk paraphrases the question by way of its intent: \"Teach me insight meditation, which is the basis for arahantship.\"",
    "sn1.46:2": "v.150\"‘The straight way’ that path is called,And ‘fearless’ is its destination.The chariot is called ‘unrattling,’Fitted with wheels of wholesome states.",
    "sn1.46:3": "v.151\"The sense of shame is its leaning board,Mindfulness its upholstery;I call the Dhamma the charioteer,With right view running out in front.[n.101]Spk: The eightfold path is called the straight way(ujuko maggo)because it is devoid of crookedness of bodily conduct, etc. The destination, Nibbāna, is said to be fearless(abhaya)because there is nothing to fear in that and because there is no fear for one who has attained it. Unlike an actual chariot, which rattles or whines when its axle is not lubricated or when it is mounted by too many people, the eightfold path does not rattle or whine(na kūjati na viravati)even when mounted simultaneously by 84,000 beings. The chariot itself is also the eightfold path, and its wheels of wholesome states(dhammacakka)are bodily and mental energy. The \"Dhamma\" that is called the charioteer is the supramundane path, with the right view of insight(vipassanā-sammadiṭṭhi)running out in front(purejava). For just as the king's servants first clear the path before the king comes out, so the right view of insight clears the way by contemplating the aggregates, etc., as impermanent, etc., and then the right view of the path(magga-sammadiṭṭhi)arises fully understanding the round of existence. In v.150cI read akūjano with Be and Ee2, as against akujano in Se and Ee1. Geiger derives akujano from kujati, \"to be crooked\" (GermTr, p. 51, n. ), but see Ja VI 252,20, where the ʺchariot of the body\" is described as vacasaññamakūjano, \"not rattling by restraint of speech,\" which supports the reading and rendering adopted here. The extended simile should be compared with that of the brahmayana, the divine vehicle, atSN45.4; see too the extended chariot simile at Ja VI 252–5.",
    "sn1.46:4": "v.152\"One who has such a vehicle—Whether a woman or a man—Has, by means of this vehicle,Drawn close to Nibbāna.\"[n.102]Spk: Having completed the discourse (the verse), the Buddha taught the Four Noble Truths, and at the end of that discourse the deva was established in the fruit of stream-entry; the other beings present attained the fruits that accorded with their own supporting conditions."
}