{
    "sn10.3:1": "On one occasion the Blessed One was dwelling at Gaya at the Ṭankita Bed, the haunt of the yakkha Sūciloma.[n.563] This sutta is also atSn II, 5 (pp. 47–49)and commented on at Pj II 30–5. The name of this yakkha means \"Needlehair\"; he was called thus because his body was covered with needle-like hairs. According toSpk, he had been a bhikkhu under the Buddha Kassapa but was unable to attain any distinction. During the time of the Buddha Gotama he was reborn as a yakkha in the rubbish dump at the entrance to Gaya village. The Buddha saw that he had the potential for attaining the path of stream-entry and went to his haunt in order to teach him. His haunt, the Ṭankita Bed, was made of a stone slab mounted on four other stones.Now on that occasion the yakkha Khara and the yakkha Sūciloma were passing by not far from the Blessed One. Then the yakkha Khara said to the yakkha Sūciloma: \"That is an ascetic.\"",
    "sn10.3:2": "Then the yakkha Sūciloma approached the Blessed One and bent over the Blessed One. The Blessed One drew back. Then the yakkha Sūciloma said to the Blessed One: \"Are you afraid of me, ascetic?\"",
    "sn10.3:3": "v.808\"What is the source of lust and hatred?Whence spring discontent, delight, and terror?Having arisen from what do the mind's thoughts(Toss one around)as boys toss up a crow?\"[n.566] In all eds. of SN, and most eds. of the \t\nSuttanipāta, as well as their respective commentaries, vv.808d, 809dread:Kumaraka dhaṅkam iv’ ossajanti.A v.l.vaṅkam(in place ofdhaṅkam) is found in several mss ofSn (vv. 270–71)and has been incorporated into Sn (Ee1).Dhaṅkam(< Sktdvāṅkṣam) was certainly the reading known to the commentators, for bothSpkandPj II0,22 foll. gloss the word withkākāṁ,crow, which they would not have done ifvaṅkamwas the reading. Spk glossesossajantiwithkhipanti,and explains the simile: \"Little boys bind a crow by its feet with a long cord, tie one end of the cord around their fingers, and release the crow. After the crow has gone some distance, it falls down again at their feet.\"Spk paraphrases the question thus: \"Whence do evil thoughts rise up and toss the mind?\"(papavitakka kuto samuṭṭhaya cittaṁ ossajanti). This seems to separatemanoandvitakkaand to treatmanoas accusative. I prefer to retainmanovitakkaas a compound (as is clearly the case at v.4b) and to see the object of ossajantias merely implicit, namely, oneself, the very source from which the thoughts arise, as v.810aasserts with the expressionattasambhūta..Norman, who also accepts dhaṅkam, discusses the problem at GD, p. 200, n. to 270–71. For an alternative rendering based on the reading vaṅkam, see ñāṇananda, SN-Anth 2:1, 89–90. The Skt version cited at Ybhūś 11.1 readskumaraka dhatrim ivaśrayante,\"as little boys depend on a wet-nurse\" (Enomoto, CSCS, p. 59).",
    "sn10.3:4": "v.809\"Lust and hatred have their source here;From this spring discontent, delight, and terror;Having arisen from this, the mind's thoughts(Toss one around) as boys toss up a crow.[n.567]Itonidana.Spk: \"This individual existence(attabhava)is their source; they have sprung up from this individual existence. As boys at play toss up a crow, so do evil thoughts rise up from this individual existence and toss the mind (Spk-pṭ: by not giving an opening for wholesome states of mind to occur).\" Spk-pṭ: In the application of the simile, the evil thoughts are like the boys at play; this world of our individual existence is like the world in which the boys have arisen; the mind is like the crow; and the fetter(saṁyojana)which follows one to a distance is like the long thread tied around the crow's feet.",
    "sn10.3:5": "v.810\"Sprung from affection, arisen from oneself,Like the trunk-born shoots of the banyan tree;Manifold, clinging to sensual pleasures,Like a maluva creeper stretched across the woods.[n.68] Like the trunk-born shoots of the banyan tree(nigrodhasseva khandhaja). The banyan tree, and other related species of fig trees, \"develop from their branches aerial roots that may reach the ground and thicken into ‘pillar-roots’ or subsidiary trunks. The continually expanding system of new trunks, all connected through the branches, may support a crown up to 2,000 feet in circumference\" (Emeneau, \"The Strangling Figs in Sanskrit Literature,\" p. 346). Emeneau quotes Milton'sParadise Lost,IX, 1100–11, \"the locus classicus on these trees in English literature\": The Figtree … spreds her Armessn.i.208",
    "sn10.3:6": "v.811\"Those who understand their source,They dispel it—listen, O yakkha!—They cross this flood so hard to cross,Uncrossed before, for no renewed existence.\"[n.59]Spkparaphrases: \"Those who understand their source of this individual existence dispel it, that is, with the truth of the path, they dispel the truth of the origin (= craving), which is the source of the truth of suffering that consists in this individual existence. By driving away the truth of the origin, they cross this hard-to-cross flood of defilements, uncrossed before in this beginningless saṁsara even in a dream, for no renewed existence, for the sake of the truth of cessation(= Nibbāna), which is called ‘no renewed existence’(apunabbhavaya). Thus with this verse the Master reveals the Four Noble Truths, bringing the discourse to its climax in arahantship. At its conclusion, Sūciloma was established in the fruit of stream-entry. And since stream-enterers do not live on in monstrous bodies, simultaneously with his attainment his needle-hairs all fell out and he obtained the appearance of an earth-deity(bhummadevataparihara).\""
}