{
    "sn10.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha on Mount Inda's Peak, the haunt of the yakkha Indaka.[n.558]Spk: This was the yakkha who dwelt on Inda's Peak. Sometimes a peak is named after a yakkha, sometimes a yakkha after a peak.Then the yakkha Indaka approached the Blessed One and addressed him in verse:",
    "sn10.1:2": "v.80\"As the Buddhas say that form is not the soul,How then does one obtain this body?From where do one's bones and liver come?How is one begotten in the womb?\"[n.559]Spkglossessajjatiin pāda d withlaggati tiṭṭhati,\"sticks, persists,\" apparently takingsajjatias equivalent to Sktsajyate(see MW, s.v.sañj()). But the word may be a passive representing Sktsṛjyatifor which MW (s.v. sṛj) lists as meanings \"to create, procreate, beget, produce.\" I translate on the assumption that this is the original derivation. See too PED, s.v.sajati(1).Spk says that this yakkha was a personalist(puggalavadi)who held the view that a being is produced in the womb at a single stroke(ekappaharen’ eva satto matukucchismiṁ nibbattati). The Buddha’s answer is intended to refute the yakkha's belief by showing that a being develops gradually(anupubbena pana vaḍḍhati).",
    "sn10.1:3": "v.80\"First there is the kalala;From the kalala comes the abbuda;From the abbuda the pesi is produced;From the pesi the ghana arises;From the ghana emerge the limbs,The head-hair, body-hair, and nails.",
    "sn10.1:4": "v.80And whatever food the mother eats—The meals and drink that she consumes—By this the being there is maintained,The person inside the mother's womb.\"[n.560] The Pali terms refer to the different stages in the formation of the embryo.Spk: Thekalalais the size of a drop of oil placed on the tip of a thread made from three strands of wool. After a week from the kalala comes theabbuda,which is the colour of meat-washing water. After another week, from the abbuda thepesiis produced, which is similar to molten tin (Spk-pṭ: in shape, but in colour it ispink). After still another week, from thepesitheghanaarises, which has the shape of a chicken egg. In the fifth week, from theghanaemerge the limbs: five pimples appear, the rudiments of the arms, legs, and head. But the head-hairs, body-hairs, and nails are not produced until the forty-second week."
}