{
    "sn10.7:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.sn.i.20Now on that occasion the Blessed One was instructing, exhorting, inspiring, and gladdening the bhikkhus with a Dhamma talk concerning Nibbāna. And those bhikkhus were listening to the Dhamma with eager ears, attending to it as a matter of vital concern, applying their whole mind to it. Then the female yakkha Punabbasu's Mother hushed her little children thus:[n.580]Spk:She was carrying her daughter on her hip and leading her son by the hand. When she heard the Dhamma she stood transfixed, but her children clamoured for food.",
    "sn10.7:2": "v.88\"Be quiet, Uttarika,Be quiet, Punabbasu!I wish to listen to the DhammaOf the Teacher, the Supreme Buddha.",
    "sn10.7:3": "v.829\"When the Blessed One speaks of Nibbāna,Release from all the knots,There has arisen within meDeep affection for this Dhamma.",
    "sn10.7:4": "v.830\"In the world one's own son is dear,In the world one's own husband is dear;But for me the quest for this DhammaHas become even dearer than them.",
    "sn10.7:5": "v.831\"For neither one's own son nor husband,Though dear, can release one from sufferingAs listening to true Dhamma frees oneFrom the suffering of living beings.[n.81]Spkexplains thatpāṇinaṁin pāda d may be understood as either a genitive plural or an accusative singular representing the plural(= paṇine):Pāṇinan ti yathā pāṇīnaṁ dukkhā moceti. Ke moceti ti? Pāṇine ti āharitvā vattabbaṁ.",
    "sn10.7:6": "v.832\"In this world steeped in suffering,Fettered by aging and death,I wish to listen to the DhammaThat he—the Buddha—fully awakened to,For freedom from aging and death.So be quiet, Punabbasu!\"[n.582] I follow VĀT's perspicacious suggestion that pāda d should be read:yaṁ dhammaṁ abhisambudhā,taking the verb as a root aorist (see Geiger,Pali Grammar,§159, 11.1). Be and Ee2 readabhisambudhaṁ,Se and Ee1abhisambuddhaṁ,accusative past participles which seem syntactically out of place. The accusativeyaṁ dhammaṁrequires an active transitive verb, yet the only solutionSpkcan propose is to turn the passive accusative participle into a nominative with active force, a role it is ill-designed to play. Since verb forms fromabhisambudhalways refer to the Buddha, I have made explicit the verb's subject, not mentioned as such in the text.",
    "sn10.7:7": "v.833\"Mother dear, I am not talking;This Uttarā is silent, too.Pay attention only to the Dhamma,For listening to true Dhamma is pleasant.Because we have not known true DhammaWe’ve been living miserably, mother.",
    "sn10.7:8": "v.34\"He is the maker of lightFor bewildered devas and humans;Enlightened, bearing his final body,The One with Vision teaches the Dhamma.\"",
    "sn10.7:9": "v.835\"It is good that my son has become so wise,He whom I bore and nursed at my breast.My son loves the pure DhammaOf the Supremely Enlightened One.",
    "sn10.7:10": "v.836\"Punabbasu, be happy!Today I have emerged at last.Hear me too, O Uttarā:The noble truths are seen!\"[n.583]Spk: Having listened to the Buddha’s discourse, the yakkha and her son were established in the fruit of stream-entry. Though the daughter had good supporting conditions, she was too young to understand the discourse."
}