{
    "sn10.12:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Aḷavi, the haunt of the yakkha Āḷavaka.[n.593] This sutta, also found atSn I, 0(pp. 3–33), is included in the Sri LankanMaha Pirit Pota.Spkrelates the long background story, of which I sketch only the highlights:One day King Āḷavaka of Āḷavī, while on a hunt, was captured by the ferocious yakkha Āḷavaka, who threatened to eat him. The king could obtain release only by promising the demon that he would provide him daily with a human victim. First the king sent the criminals from the prison, but when there were no more prisoners he required every family to provide a child. All the families with children eventually fled to other lands and it became incumbent on the king to offer his own son, the Āḷavaka prince. The Buddha, aware of the impending sacrifice, went to the yakkha's haunt on the day before the offering was to take place in order to convert the demon from his evil ways. At that time the yakkha was attending a meeting in the Himalayas, but the Buddha entered his cave, sat down on the yakkha's throne, and preached the Dhamma to his harem ladies. When the yakkha heard about this, he hastened back to Āḷavı in a fury and demanded that the Blessed One leave.Then the yakkha Āḷavaka approached the Blessed One and said to him: \"Get out, ascetic!\"",
    "sn10.12:2": "v.846\"What here is a man's best treasure?What practised well brings happiness?What is really the sweetest of tastes?How lives the one who they say lives best?\"",
    "sn10.12:3": "v.847\"Faith is here a man's best treasure;Dhamma practised well brings happiness;Truth is really the sweetest of tastes;One living by wisdom they say lives best.\"[n.597]Spk:Faithis a man's best treasure because it brings mundane and supramundane happiness as its result; it alleviates the suffering of birth and aging; it allays poverty with respect to excellent qualities; and it is the means of obtaining the gems of the enlightenment factors, etc. Dhamma here is the ten wholesome qualities, or giving, virtue, and meditation. This brings human happiness, celestial happiness, and in the end the happiness of Nibbāna. By truth here truthful speech is intended, with Nibbāna as the ultimate truth(paramatthasacca)and truth as abstinence (from falsehood;viratisacca) comprised within that. Of the various kinds of tastes, truth is really the sweetest of tastes, truth alone is the sweetest(sadutaraṁ). Or it is the best(sadhutaraṁ), the supreme, the highest. For such tastes as that of roots, etc., nourish only the body and bring a defiled happiness, but the taste of truth nourishes the mind with serenity and insight and brings an undefiled happiness.One living by wisdom(paññajiviṁ jīvitaṁ): A householder lives by wisdom when he works at an honourable occupation, goes for refuge, gives alms, observes the precepts, and fulfils the Uposatha duties, etc. One gone forth as a monk lives by wisdom when he undertakes pure virtue and the superior practices beginning with purification of mind.",
    "sn10.12:4": "v.88\"How does one cross over the flood?How does one cross the rugged sea?How does one overcome suffering?How is one purified?\"",
    "sn10.12:5": "v.849\"By faith one crosses over the flood,By diligence, the rugged sea.By energy one overcomes suffering,By wisdom one is purified.\"[n.98]Spkdistributes the four \"floods\"(ogha)over the four lines of the reply and sees each line as implying a particular path and fruit; on the four floods, see n.1. Since the faith faculty is the basis for the four factors of stream-entry (seeSN.1), the first line shows the stream-enterer, who has crossed the flood of views; the second line shows the once-returner, who by means of diligence has crossed the flood of existence except for one more existence in the sense-sphere world; the third line shows the nonreturner, who has overcome the flood of sensuality, a mass of suffering; and the fourth line shows the path of arahantship, which includes the fully purified wisdom by means of which one crosses over the flood of ignorance.This completes the eight questions that the yakkha had learnt from his parents. When the Buddha finished speaking, bringing his verse to a climax in arahantship, the yakkha was established in the fruit of stream-entry.",
    "sn10.12:6": "v.850\"How does one gain wisdom?[n.599]Spk: When the Buddha said, \"By wisdom one is purified,\" the yakkha picked up on the word \"wisdom\" and, through his own ingenuity, asked a question of mixed mundane and supramundane significance.How does one find wealth?How does one achieve acclaim?How bind friends to oneself?When passing from this world to the next,How does one not sorrow?\"",
    "sn10.12:7": "v.851\"Placing faith in the Dhamma of the arahantsFor the attainment of Nibbāna,From desire to learn one gains wisdomIf one is diligent and astute.[n.600] in pāda c, I readsussūsāwith Se and Ee1 & 2. Be readssussūsaṁas does the lemma ofSpk(Be), while the corresponding lemma in Spk (Se) hassussūsā. From the paraphrase (see below)sussūsācan be understood as a truncated instrumental(= sussūsāya). In Be,sussūsaṁseems to function as an accusative in apposition topaññaṁ,perhaps as the first member of a split compound, i.e., \"the wisdom (consisting in) the desire to learn.\"Spk: The Blessed One shows here four causes for the gaining of wisdom. First one places faith in the Dhamma by which the arahants—Buddhas, paccekabuddhas, and disciples—attained Nibbāna. By so doing one gains the mundane and supramundane wisdom for the attainment of Nibbāna. But that does not come to pass merely by faith. When faith is born one approaches a teacher, lends an ear, and hears the Dhamma; thus one gains a desire to learn(sussūsaṁ). When one lends an ear and listens from a desire to learn, one gains wisdom. But one must also be diligent(appamatto), in the sense of being constantly mindful, and astute(vicakkhaṇa), able to distinguish what is well spoken and badly spoken. Through faith one enters upon the practice that leads to gaining wisdom. Through a desire to learn(sussūsāya)one carefully listens to the means for acquiring wisdom; through diligence(appamādena)one does not forget what one has learnt; through astuteness(vicakkhaṇatāya)one expands upon what one has learnt. Or else: through a desire to learn one lends an ear and listens to the Dhamma by which one gains wisdom; through diligence one bears in mind the Dhamma heard; by astuteness one examines the meaning and then gradually one realizes the ultimate truth.",
    "sn10.12:8": "v.52\"Doing what is proper, dutiful,One with initiative finds wealth.sn.i.215By truthfulness one wins acclaim;Giving, one binds friends.That is how one does not sorrowWhen passing from this world to the next.[n.601]Spk: Dutiful(dhuravā)means not neglecting one's responsibilities and implies mental energy; one with initiative(uṭṭhātā)implies physical energy. I here follow Be; in Se the last two lines come at the end of v.50; in Ee1, at the end of both v. 52 and v. 53; in Sn, they are attached to neither verse.",
    "sn10.12:9": "v.853\"The faithful seeker of the household lifeIn whom dwell these four qualities—Truth, Dhamma, steadfastness, generosity—Does not sorrow when he passes on.",
    "sn10.12:10": "v.854\"Come now, ask others as well,The many ascetics and brahmins,Whether there is found here anything betterThan truth, self-control, generosity, and patience.\"[n.602] The problem is to correlate the two tetrads mentioned in vv.853–54. The difficulty arises not only on account of the replacement ofdhitibykhantyāin the second verse but also because of the variant readings of the second term. Perhaps the best reading is that in Se, which accords with Sn (Ee) vv.187–88: in v. 853,saccaṁ dhammo dhiti cāgo;in v. 854,saccā damā cāga khantyā.Spk(Be) and Spk (Se) differ over the second term: the former hasdammoanddammā,the latterdhammoanddhammā.The explanations in Spk-pṭ establish beyond doubt thatdhammoand dama were the respective readings known to Dhammapala.The four qualities mentioned at vv. 853–54 refer back to vv. 851–52. Truth corresponds to truthfulness in v. 852c (saccain all three instances), while generosity(caga)clearly corresponds to giving(dadaṁ)in v. 852d. Spk (Se) explains that Dhamma is spoken of (in v.851c) under the name of wisdom gained through a desire to learn, on which Spk-pṭ comments: \"Wisdom is called Dhamma because of bearing up and examining(dhāraṇato upadhāraṇato)entities in accordance with actuality.\" (As the verbdhāreti(>dhāraṇa) is the stock etymological explanation ofdhammain the commentaries, we can infer that the author of Spk-pṭ had a text that readdhammo.) Steadfastness(dhiti)is spoken of under the names dutifulness and initiative (in v. 852ab).In its paraphrase of v. 854, Spk states: \"Come now, ask the many ascetics and brahmins whether there is any greater means for winning acclaim than truthfulness; any greater means for gaining mundane and supramundane wisdom than self-control (I suggest readingdamā,following Spk-pṭ, which explains that wisdom is so designated because it controls[dameti]the defilements as well as body and speech, etc.); any greater means of binding friends than generosity; and any greater means for finding mundane and supramundane wealth than patience, which is identical with activated energy, (called patience) in the sense that it endures heavy burdens, and which is referred to by the names dutifulness and initiative.\"Thus the correlations can be shown schematically as follows:Thus the correlations can be shown schematically as follows:1. 852: truthfulness = 853 & 854: truth.2. 851: wisdom = 853: Dhamma = 854: self-control.3. 852: giving = 853 & 854: generosity.4. 852: dutifulness, initiative = 853: steadfastness = 854: patience.",
    "sn10.12:11": "v.855\"Why now should I ask this questionOf the many ascetics and brahmins?Today I have understoodThe good pertaining to the future life.[n.603] AlthoughSpkexplains attho in pāda d as the visible benefit(diṭṭhadhammika)and samparayiko as the benefit in a future life, there seems to be no compelling reason not to take the two words at their face value as adjective and noun bearing a single significance, namely, the good pertaining to the future life.",
    "sn10.12:12": "v.856\"Indeed, for my sake the Buddha cameTo reside at Aḷavi.Today I have understoodWhere a gift bears great fruit.",
    "sn10.12:13": "v.857\"I myself will travel aboutFrom village to village, town to town,Paying homage to the Enlightened OneAnd to the excellence of the Dhamma.\"[n.604]Spkcontinues with the background story: Just as the yakkha finished speaking this verse, the sun rose and the king's men arrived bringing the prince as a sacrificial offering. They handed the infant to the yakkha, who presented him to the Buddha. The Master recited some verses of blessing over the boy and returned him to the king's men. When the prince reached maturity, he was known as Hatthaka Āḷavaka, because he had been passed around from one person's hands(hattha)to another's. He attained the stage of nonreturner and was one of the Buddha’s foremost lay disciples, the chief of those who win followings through the four bases of beneficence (saṅgahavatthu;seeAN I 26,7–9). The Buddha holds him up as a model for male lay followers atSN17.23and praises his virtues atAN IV 217–20."
}