{
    "sn10.9:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Now on that occasion the bhikkhuni Sukka, surrounded by a large assembly, was teaching the Dhamma. Then a yakkha who had full confidence in the bhikkhuni Sukka, going from street to street and from square to square in Rājagaha, on that occasion recited these verses:",
    "sn10.9:2": "v.84\"What has happened to these people in Rājagaha?They sleep as if they’ve been drinking mead.Why don’t they attend on SukkaAs she teaches the deathless state?[n.590] This verse and the next are found, with several variations, atThī 54–55.Spkglosseskiṁ me kata,in pāda a, withkiṁ ime katā, kiṁ karonti,but I think it more likely that we have here a splitbahubbihicompoundkiṁkatā,and I translate accordingly.Be reads pāda b:madhupitā va seyare(Se and Ee:seyyare;Ee1 andThī 54:acchare). Spk: They sleep as if they have been drinking sweet mead (Be:gandhamadhupana;Se:gaṇḍamadhupāna); for it is said that one who drinks this is unable to lift up his head but just lies there unconscious. Spk-pṭ:Gandhamadhuis a particular type of honey that is extremely sweet and intoxicating.Spk I 338,13–14 (toSN11.1) mentions a drink calledgandhapāna(in Be;gaṇḍapānain Se and Ee), an intoxicating beverage(surā)used by the older generation of devas in the Tāvatiṁsa heaven but rejected by Sakka after he assumed rulership over that world. At Dhp-a I 7,9 the drink is calleddibbapāna.MW lists gandhapana, defined as a fragrant beverage. \"Madhudenotes anything sweet used as food and especially drink, ‘mead,’ a sense often found in the Rigveda\" (Macdonell and Keith,Vedic Index,s.v.madhu).",
    "sn10.9:3": "v.84\"But the wise, as it were, drink it up—That(Dhamma)irresistible,Ambrosial, nutritious—As travellers do a cloud.\"[n.591]Spkexplainsappaṭivānīyaṁ(\"irresistible\"), in pāda a, thus: \"Whereas ordinary food, even though very delicious, fails to give pleasure when one eats it again and again and becomes something to be rejected and removed, this Dhamma is different. The wise can listen to this Dhamma for a hundred or a thousand years without becoming satiated.\" Spk glossesasecanakam ojavaṁ,in pāda b, asanāsittakaṁ ojavantaṁ,\"unadulterated, nourishing,\" and explains that unlike material food, which becomes tasty by the addition of condiments, this Dhamma is sweet and nutritious by its own nature.While Spk thus takesasecanakato be derived from ī to sprinkle, Brough maintains that the word is derived from a different root sek, meaning \"to satiate.\" He renders it \"never causing surfeit\" (Gandhari Dharmapada,p. 19, n. to 72). See too CPD, s.v. asecanaka, which quotes the traditional Skt explanation from theAmarakośa: tṛpter nāsty anto yasya darśanāt;\"that the sight of which gives endless satisfaction.\" In Pali the word is used more in connection with the senses of smell and taste (e.g., atAN III 27,22 and 28,1). My rendering \"ambrosial\" is intended to suggest the same idea as the Skt definition, but more concisely so that it can also be incorporated into the description of mindfulness of breathing atSN54.9(V 21,22 and 22,1,11).Pada d reads:valāhakam iva panthagū(in Be and Ee1; Se andThī 55end withaddhagū). Spk: \"Like travellers(pathika)oppressed by the heat (who drink) the water released from within a cloud.\""
}