{
    "sn10.5:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion a certain female lay follower had a son named Sanu who had been possessed by a yakkha.[n.572] The background story, related inSpk, is also found at Dhp-a IV 8–25, which includes the verses as well; see BL 3:207–. In brief: Sanu was a devout novice who, on reaching maturity, had become dissatisfied with the monk's life and had returned to his mother's house intending to disrobe. His mother, after pleading with him to reconsider his decision, went to prepare a meal for him, and just then a female yakkha—his mother from the previous life, who was also anxious to prevent him from disrobing—took possession of him and threw him down to the ground, where he lay quivering with rolling eyes and foaming mouth. When his present mother returned to the room, she found him in this condition.Then that female lay follower, lamenting, on that occasion recited these verses:",
    "sn10.5:2": "v.816\"With those who lead the holy life,[n.573] I follow the reading inBe.Ee1 & Ee insert another verse here(v. 815 in Ee), but since this verse seems to be the product of a scribal error I do not translate it. The Be reading is supported by the Dhp-a version. Se reads as in Be, but withyava in place ofya cain the second pāda of both the exclamation and the reply. In order to translate in accordance with natural English syntax, I have had to invert lines of the Pali in a way which crosses over the division of verses in the Pali text.The Uposatha complete in eight factors(aṭṭhasusamagataṁ uposathaṁ): On the Uposatha, see n.513. Besides the two major Uposathas falling on the full-moon and new-moon days (respectively the fifteenth, and either the fourteenth or fifteenth, of the fortnight), minor Uposathas fall on the half-moon days, the eighths of the fortnight. Lay people observe the Uposatha by taking upon themselves the Eight Precepts(aṭṭhaṅga-sīla), a stricter discipline than the Five Precepts of daily observance. These entail abstaining from: (1) taking life, () stealing, (3) all sexual activity, (4) false speech, (5) taking intoxicants, (6) eating past noon, (7) dancing, singing, listening to music, seeing improper shows, and using personal ornaments and cosmetics, and (8) using high and luxurious beds and seats. For more on the Uposatha duties for the laity, seeAN IV 48–6.And during special periods(patihariyapakkhañ ca).Spkexplains this as if it meant the days proximate to the Uposatha: \"This is said with reference to those who undertake the Uposatha observances on the seventh and ninth of the fortnight too (in addition to the eighth), and who also undertake the practices on the days preceding and following the Uposatha on the fourteenth or fifteenth (the full-moon and new-moon observance days). Further, following the Pavaraṇa day (see n.513) they observe the Uposatha duties continuously for a fortnight (Spk-pṭ: that is, during the waning fortnight).\" Different explanations of the expressionpatihariyapakkhaare given at Mp II 34 and Pj II 378.Who observe the Uposatha daysComplete in eight factorsOn the fourteenth or fifteenth,",
    "sn10.5:3": "v.817And on the eighths of the fortnight,And during special periods,The yakkhas do not sport around:So I have heard from the arahants.But now today I see for myselfThe yakkhas sporting with Sanu.\"",
    "sn10.5:4": "v.818\"With those who lead the holy life,Who observe the Uposatha daysComplete in eight factorsOn the fourteenth or fifteenth,v.819And on the eighths of the fortnight,And during special periods,",
    "sn10.5:5": "The yakkhas do not sport around:What you heard from the arahants is good.v.820\"When Sanu has awakened tell himThis injunction of the yakkhas:Do not do an evil deedEither openly or in secret.",
    "sn10.5:6": "v.821If you should do an evil deed,Or if you are doing one now,You won’t be free from sufferingThough you fly up and flee.\"[n.574]Spkglossesuppaccā piasuppatitvā pi,and paraphrases: \"Even if you fly up like a bird and flee, there will still be no freedom for you.\" The same verse is atThī 247c–248b, Pv 23,Ud 51,17–18, Peṭ 44,20–21, and Nett 131,19–20. These versions (except Pv) read the absolutive asupecca,with a strange glosssañciccain their commentaries; Pv follows SN, but its commentary recognizesupeccaas a v.l. A parallel is at Uv 9:4, with the absolutiveutplutya.See von Hinüber, \"On the Tradition of Pali Texts in India, Ceylon, and Burma,\" pp. 51–53.",
    "sn10.5:7": "v.822\"They weep, mother, for the deadOr for one living who isn’t seen.When you see, mother, that I’m alive,Why, O mother, do you weep for me?\"",
    "sn10.5:8": "v.23\"They weep, O son, for the deadOr for one living who isn’t seen;But when one returns to the home lifeAfter renouncing sensual pleasures,They weep for this one too, my son,For though alive he's really dead.[n.576] SeeSN20.10(II 271,13–14): \"For this is death in the Noble One's Discipline: that one gives up the training and returns to the lower life.\"",
    "sn10.5:9": "v.824\"Drawn out, my dear, from hot embers,You wish to plunge into hot embers;Drawn out, my dear, from an inferno,You wish to plunge into an inferno.[n.577]Spk: She says this to show the danger in household life; for household life is called \"hot embers\"(kukkuḷā)in the sense of being hot. Kukkuḷā is also atSN22.136.",
    "sn10.5:10": "v.825\"Run forward, good luck be with you!To whom could we voice our grief?Being an item rescued from the fire,You wish to be burnt again.\"[n.578]Spkparaphraseskassa ujjhapāyamase,in pāda b, thus: \"When you were intent on disrobing and had been possessed by the yakkha, to whom could we have voiced our grief (complained), to whom could we have appealed and reported this(kassa mayaṁ ujjhāpayāma nijjhapayāma ārocayāma)?\" On pāda cd: \"When you went forth into the Buddha’s Teaching, drawn out from the household, you were like an item rescued from a blazing house. But now you wish to be burnt again in the household life, which is like a great conflagration.\" According to Spk, the yakkha's intervention proved effective. After listening to his mother, Sanu gave up his idea of disrobing, received the higher ordination, mastered the Buddha’s teachings, and quickly attained arahantship. He became a great preacher who lived to the age of 120."
}