{
    "sn10.8:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Cool Grove. Now on that occasion the householder Anāthapiṇḍika had arrived in Rājagaha on some business.[n.584] The story of Anāthapiṇḍika's first meeting with the Buddha is told in greater detail at Vin II 54–59; see too Ñāṇamoli,Life of the Buddha,pp. 87–9. His given name was Sudatta, \"Anāthapiṇḍika\" being a nickname meaning \"(giver) of alms to the helpless\"; he was so called because of his generosity.He heard: \"A Buddha, it is said, has arisen in the world!\" He wanted to go and see the Blessed One immediately,sn.i.2but it occurred to him: \"It is not the right time to go and see the Blessed One today. I will go and see the Blessed One early tomorrow morning.\" He lay down with his mindfulness directed to the Buddha, and during the night he got up three times thinking it was morning. Then the householder Anāthapiṇḍika approached the gate of the charnel ground. Nonhuman beings opened the gate. Then, as the householder Anāthapiṇḍika was leaving the city, the light disappeared and darkness appeared. Fear, trepidation, and terror arose in him and he wanted to turn back. But the yakkha Sivaka, invisible, made the proclamation:[n.585]Spk:After the first watch of the night had passed he woke up thinking of the Buddha, full of confidence and joy so intense that light became manifest and drove away the darkness. Hence he thought it was already dawn and set out for the monastery, realizing his error only when he went outside. The same thing happened at the end of the middle watch.From Spk’s account, it seems that the Cool Grove was located near the cremation ground(sīvathikā)and thus Anāthapiṇḍika had to pass through the cemetery to reach the monastery. It was for this reason that he became frightened. The fluctuation in the intensity of the light, Spk says, reflects his inward battle between faith and fear.",
    "sn10.8:2": "v.837\"A hundredthousandelephants,A hundredthousandhorses,A hundredthousandmule-drawn chariots,A hundred thousand maidensAdorned with jewellery and earrings,Are not worth a sixteenth partOf a single step forward.[n.586]Spk: The wordsahassa(thousand), found only in conjunction withkañña,should be conjoined with each of the preceding three terms as well. All this is \"not worth a sixteenth part of a single step forward\" because, when he arrives at the monastery, he will be established in the fruit of stream-entry.",
    "sn10.8:3": "\"Go forward, householder!Go forward, householder!Going forward is better for you,not turning back again.\"",
    "sn10.8:4–9": "Then the darkness disappeared and light appeared to the householder Anāthapiṇḍika, and the fear, trepidation, and terror that had arisen in him subsided.A second time …verse 838 is included in this repetition… A third time the light disappeared and darkness appeared before the householder Anāthapiṇḍika. Fear, trepidation, and terror arose in him and he wanted to turn back. But a third time the yakkha Sivaka, invisible, made the proclamation:",
    "sn10.8:839": "v.\"Go forward, householder!Go forward, householder!Going forward is better for you,not turning back again.\"",
    "sn10.8:10": "Then the darknesssn.i.212disappeared and light appeared to the householder Anāthapiṇḍika, and the fear, trepidation, and terror that had arisen in him subsided.Then the householder Anāthapiṇḍika approached the Blessed One in the Cool Grove.",
    "sn10.8:11": "Now on that occasion the Blessed One, having risen at the first flush of dawn, was walking back and forth in the open. The Blessed One saw the householder Anāthapiṇḍika coming in the distance. He descended from the walkway, sat down in the seat that was prepared, and said to the householder Anāthapiṇḍika: \"Come, Sudatta.\"[n.587]Spk: While he was approaching, Anāthapiṇḍika wondered how he could determine for himself whether or not the Teacher was a genuine Buddha. He then resolved that if the Teacher was a Buddha he would address him by his given name, Sudatta, known only to himself.",
    "sn10.8:12": "v.840\"Always indeed he sleeps well,The brahmin who is fully quenched,Who does not cling to sensual pleasures,Cool at heart, without acquisitions.",
    "sn10.8:13": "v.841\"Having cut off all attachments,Having removed care from the heart,The peaceful one sleeps well,Having attained peace of mind.\"[n.589] I preferSeand Ee2cetasoto Be and Ee1cetasā.The parallel atAN I 8,3–6also hascetaso.In the Vinaya version the Buddha next delivers a graduated sermon to Anāthapiṇḍika at the conclusion of which he attains stream-entry."
}