{
    "sn10.4:1": "On one occasion the Blessed One was dwelling among the Magadhans at the Maṇimalaka Shrine, the haunt of the yakkha Maṇibhadda. Then the yakkha Maṇibhadda approached the Blessed One and in the Blessed One's presence recited this verse:",
    "sn10.4:2": "v.81\"It is always good for the mindful one,The mindful one thrives in happiness.It is better each day for the mindful one,And he is freed from enmity.\"[n.570]Spkglossessukham edhatiin pāda a assukhaṁ paṭilabhati,\"obtains happiness.\" CPD points out (s.v.edhati) that this interpretation is probably a misunderstanding stemming from the supposition thatsukhamis a direct object of the verb rather than an adverbial accusative. The original meaning appears in the commentarial gloss on the expressionsukhedhitoassukhasaṁvaddhito.See too EV I, n. to 475.Spk glosses suve seyyo in pāda c as suve suve seyyo, niccam eva seyyo; \"It is better morrow upon morrow, it is always better.\"",
    "sn10.4:3": "v.81\"It is always good for the mindful one,The mindful one thrives in happiness.It is better each day for the mindful one,But he is not freed from enmity.",
    "sn10.4:4": "v.81\"One whose mind all day and nightTakes delight in harmlessness,Who has lovingkindness for all beings—For him there is enmity with none.\"[n.571]Spk:Ahiṁsaya,\"in harmlessness,\" means \"in compassion and in the preliminary stage of compassion\" (Spk-pṭ: that is, the access to the first jhāna produced by the meditation on compassion).Mettaṁ so,\"who has lovingkindness,\" means \"he (so) develops lovingkindness(mettaṁ)and the preliminary stage of lovingkindness.\" [Spk-pṭ: He(so)is the person developing meditation on compassion.]Evidently Spk and Spk-pṭ takesoin pāda c to be the demonstrative counterpart ofyassain pāda a, with an implicit transitive verbbhāvetiunderstood. While the exact meaning ofmettaṁ so(ormettaṁso) is problematic, I prefer to take pāda c as an additional relative clause, the relatives being resolved only in pāda d by the clearly demonstrativetassa.Spk offers an alternative interpretation ofmettaṁsoas a compound ofmettāandaṁsa,glossed askoṭṭhāsa,\"portion\":mettā aṁso etassā ti mettaṁso;\"one for whom lovingkindness is a portion (of his character) ismettaṁso.\" Mp IV 71,9 glossesmettaṁso: mettāyamanacittakoṭṭhāso hutvā;\"having become one for whom a loving mind is a portion\"; see too It-a I 95,13–15. Brough remarks thatmitrisa(in G-Dhp 198) \"appears to have been interpreted by the Prakrit translator as equivalent to (Skt)maitri asya\"(Gāndhāri Dharmapada,p. 22, n. 198).Spk-pṭ: Because of his own hating mind someone might nurture enmity even towards an arahant who lacks meditation on lovingkindness and compassion. But no one could nurture enmity towards one who is endowed with liberation of mind through lovingkindness and compassion. So powerful is the meditation on the divine abodes(evaṁ mahiddhikā brahmavihāra-bhavanā)."
}