{
    "sn11.22:1": "At Sāvatthī in Jeta's Grove. There the Blessed One said this: \"Bhikkhus, once in the past a certain ugly deformed yakkha sat down on the seat of Sakka, lord of the devas.[n.658]Spk: He was a dwarf the colour of a burnt stump and with a pot belly. He sat down on Sakka's Yellowstone Throne (paṇḍukambalasīla;see Dhp-a I273,9–2; BL :320). It is said that he was actually a brahma from the form realm. Having heard about Sakka's patience, he came in order to test him; for it is impossible for any malevolent spirit(avaruddhaka-yakkha)to infiltrate a place so well guarded.Thereupon the Tāvatiṁsa devas found fault with this, grumbled, and complained about it, saying: ‘It is wonderful indeed, sir! It is amazing indeed, sir! This ugly deformed yakkha has sat down on the seat of Sakka, lord of the devas!’ But to whatever extent the Tāvatiṁsa devas found fault with this, grumbled, and complained about it, to the same extent that yakkha became more and more handsome, more and more comely, more and more graceful.",
    "sn11.22:2": "\"Then, bhikkhus, the Tāvatiṁsa devas approached Sakka and said to him: ‘Here, dear sir, an ugly deformed yakkha has sat down on your seat … . But to whatever extent the devas found fault with this …sn.i.38that yakkha became more and more handsome, more and more comely, more and more graceful.’ - ‘That must be the anger-eating yakkha.’",
    "sn11.22:3": "\"Then, bhikkhus, Sakka, lord of the devas, approached that anger-eating yakkha.[n.659]Spk: Sakka had heard from the devas: \"It is impossible to make that yakkha budge by harsh means, but if one assumes a humble manner and remains firm in patience, one can get him to leave.\" Thus he adopted this tactic.Having approached, he arranged his upper robe over one shoulder, knelt down with his right knee on the ground, and, raising his joined hands in reverential salutation towards that yakkha, he announced his name three times: ‘I, dear sir, am Sakka, lord of the devas! I, dear sir, am Sakka, lord of the devas!’ To whatever extent Sakka announced his name, to the same extent that yakkha became uglier and uglier and more and more deformed until he disappeared right there.",
    "sn11.22:4": "v.91\"‘I am not one afflicted in mind,Nor easily drawn by anger's whirl.I never become angry for long,Nor does anger persist in me.[n.660]Spkstates thatsu,in pāda a, is a mere indeclinable(nipatamattaṁ), and thus we should resolve the compound: su upahatacitto ’mhi. Spk-pṭ: Sakka speaks of his own nature thus, ʺBecause of the presence in me of patience, love, and sympathy, I am not afflicted in mind against others.\"Pāda b is read in Be and Se asnavattena suvanayo(Ee1:navaṭṭena suvanayo;Ee2:n’ avaṭṭe na suvanayo). Spk: He states: \"I am not easily drawn by anger's whirl; I am not easily brought under the control of anger.\" Pādas cd allude to the seventh of Sakka's vows (seeSN11.11). Spk explains thatvoin pāda c is an indeclinable.Suvanayois also at v.507b, where lust(rāga)rather than anger is the lure.",
    "sn11.22:5": "v.942\"‘When I’m angry I don’t speak harshlyAnd I don’t praise my virtues.I keep myself well restrainedOut of regard for my own good.’\"[n.661] I read pādas ab withBe and Ee1 & 2:Kuddhahaṁ na pharusaṁ brūmi/Na ca dhammani kittaye.Se omits thenain pāda a, apparently out of concern for the metre, but the metre can be preserved withnaif we assume resolution of the fourth syllable. Neither Spk nor Spk-pṭ offers any help with the meaning. VĀT proposes, \"And I do not speak on Dhamma matters,\" but at Ja V 172,23 and 221,27 we findsatañ ca dhammani sukittitani,\"the well-proclaimed qualities of the good,\" which suggests that here too the rare neuter pluraldhammanirefers to personal virtues, not to spiritual teachings."
}