{
    "sn11.12:1": "At Sāvatthī in Jeta's Grove. There the Blessed One said to the bhikkhus:",
    "sn11.12:2": "\"Bhikkhus, in the past, when Sakka, lord of the devas, was a human being, he gave gifts in city after city; therefore he is called Purindada, the Urban Giver.[n.637] I read withSe and Ee1 & pure pure dānaṁ adasi tasmā Purindado ti vuccati.Be haspureonly once. MW (s.v.pur > puraṁ) givespuraṁdaandpuraṁdaraas names of Indra; both mean \"destroyer of strongholds.\" This explanation, and the following three, depend on puns almost impossible to reproduce in English.",
    "sn11.12:3": "\"Bhikkhus, in the past, when Sakka, lord of the devas, was a human being, he gave gifts considerately; therefore he is called Sakka.[n.68](Sakkaccaṁ danaṁ adasi tasma Sakko ti vuccati.)",
    "sn11.12:4": "\"Bhikkhus, in the past, when Sakka, lord of the devas, was a human being, he gave a rest house; therefore he is called Vāsavā.[n.639] The story of the rest house(avasatha)is at Dhp-a I 269–70; BL 1:317–18.",
    "sn11.12:5": "\"Bhikkhus, Sakka, lord of the devas, thinks of a thousand matters in a moment; therefore he is called Sahassakkha, Thousand-eyed.[n.640]Sahassam pi atthanaṁ muhuttena cinteti tasma Sahassakkho ti vuccati.Spk: Standing upon a single word propounded in regard to a thousand people or a thousand statements, he decides, \"This one has need of this, that one has need of that.\" Spk-pṭ: He has a thousand wisdom-eyes.",
    "sn11.12:6": "\"Bhikkhus, Sakka's wife is the asura maiden named Suja; therefore he is called Sujampati, Suja's husband.[n.41] The story of how Sakka won the hand of Suja, Vepacitti's daughter, is told at Dhp-a I 278–79 (see BL 1:323), and Ja I 20.",
    "sn11.12:7": "\"Bhikkhus, Sakka, lord of the devas, exercises supreme sovereignty and rulership over the Tāvatiṁsa devas; therefore he is called lord of the devas.",
    "sn11.12:8": "\"Bhikkhus, in the past, when Sakka, lord of the devas, was a human being, he adopted and undertook seven vows by the undertaking of which he achieved the status of Sakka … .\"",
    "sn11.12:9": "v.06\"When a person supports his parents,And respects the family elders;When his speech is gentle and courteous,And he refrains from divisive words;",
    "sn11.12:10": "v.907When he strives to remove meanness,Is truthful, and vanquishes anger,The Tāvatiṁsa devas call himTruly a superior person.\"sn.i.230"
}