{
    "sn11.19:1": "At Sāvatthī. There the Blessed One said this: \"Bhikkhus, once in the past Sakka, lord of the devas, addressed his charioteer Mātali thus: ‘Harness the chariot with its team of a thousand thoroughbreds, friend Mātali. Let us go to the park grounds to see the beautiful scenery.’ — ‘Yes, your lordship,’ Mātali the charioteer replied. Then he harnessed the chariot with its team of a thousand thoroughbreds and announced to Sakka, lord of the devas: ‘The chariot has been harnessed, dear sir. You may come at your own convenience.’Yassa dani kalaṁ maññasi.See Manné, \"On a Departure Formula and its Translation.\" The expression also occurs atSN35.88(IV 62,3),SN35.243(IV 83,5, 30),SN44.(IV 379,29),SN54.9(V 32,6–7), andSN55.6(V 348,27); I have varied the rendering slightly to fit the context.",
    "sn11.19:2": "v.96\"‘Both devas and human beingsHumbly worship you, Vāsavā.So who, O Sakka, is that spiritTo whom you bow in worship?’",
    "sn11.19:3": "v.927\"‘The Perfectly Enlightened One hereIn this world with its devas,The Teacher of perfect name:He is the one whom I worship, Mātali.[n.65] The verse has five pādas. Pādas ab read: ye rāgadosavinayā avijjā̄samatikkamā, which Spk paraphrases: “by the transcendence of ignorance, the root of the round, which conceals the four truths”(catusaccapaṭicchādikāya vaṭṭamūlakaavijjā̄ya samatikkamena).The same lines appeared at v.764ab, where, as referring to an arahant, they were appropriately translated as ablative in force. However, despite Spk’s paraphrase, this would not be suitable in relation to trainees(sekha),who have not yet fully removed the lust for existence or transcended all ignorance. I have therefore translated them as truncated datives.Dismantling(apacaya)means the undoing of the process that sustains the round of existence. At22:79(III 89,22-24) it is said that the noble disciple in training is dismantling the five aggregates, while the arahant (III 90,11) abides having dismantled them(apacinitvā ṭhito).See tooMN III 288,0.",
    "sn11.19:4": "v.928\"‘Those for whom lust and hatredAnd ignorance have been expunged,The arahants with taints destroyed:These are the ones whom I worship, Mātali.",
    "sn11.19:5": "v.929\"‘The trainees who delight in dismantling,Who diligently pursue the trainingFor the removal of lust and hatred,For transcending ignorance:These are the ones whom I worship, Mātali.’[n.64] The verse has five padas. pādas ab read: ye ragadosavinaya avijjāsamatikkama, whichSpkparaphrases: \"by the transcendence of ignorance, the root of the round, which conceals the four truths\"(catusaccapaṭicchadikaya vaṭṭamūlakaavijjāya samatikkamena).The same lines appeared at v.764ab, where, as referring to an arahant, they were appropriately translated as ablative in force. However, despite Spk's paraphrase, this would not be suitable in relation to trainees(sekha), who have not yet fully removed the lust for existence or transcended all ignorance. I have therefore translated them as truncated datives. Dismantling(apacaya)means the undoing of the process that sustains the round of existence. AtSN22.79(III 89,22–24) it is said that the noble disciple in training is dismantling the five aggregates, while the arahant (III 90,11) abides having dismantled them(apacinitva ṭhito). See tooMN III 288,30.",
    "sn11.19:6": "v.930\"‘Those whom you worship, my lord Sakka,Are indeed the best in the world.I too will worship them—Those whom you worship, Vāsavā.’",
    "sn11.19:7": "v.931\"Having given this explanation,Having worshipped the Blessed One,The deva-king Maghava, Suja's husband,The chief, climbed into his chariot.\""
}