{
    "sn11.10:1": "At Sāvatthī. \"Bhikkhus, once in the past a number of seers who were virtuous and of good character had settled down in leaf huts along the shore of the ocean. Now on that occasion the devas and the asuras were arrayed for a battle. Then it occurred to those seers who were virtuous and of good character: ‘The devas are righteous, the asuras unrighteous. There may be danger to us from the asuras. Let us approach Sambara, lord of the asuras, and ask him for a guarantee of safety.’[n.63]Spk: For the most part, it is said, the battles between the devas and the asuras take place behind the great ocean. Often the asuras are defeated, and when they are fleeing from the devas, as they pass the hermitages of seers, they destroy their halls and walkways, etc.; for they believe that the seers are partial to Sakka and give him the counsel that leads to their defeat. Since the seers can repair the damaged facilities only with difficulty, when they heard that a battle was about to take place they realized they needed a guarantee of safety.The identity of Sambara is problematic. Spk identifies him with Vepacitti (see n.633), but C.Rh.D points out (at KS :305, n. 4) thatSN.23suggests the two are distinct, Sambara having been Vepacitti's predecessor as lord of the asuras. MW states that Śambara is a demon often mentioned in the Ṛgveda; he was slain by Indra. For further discussion, see below n.665.",
    "sn11.10:2": "v.900\"‘The seers who have come to SambaraAsk him for a guarantee of safety.For you can give them what you wish,Whether it be danger or safety.’[n.63] Pada c should be divided as in Be & Ee:Kamankaro hi te datuṁ.Spkglosseskamankarowithicchitakaroand paraphrases: \"If you want to give safety, you are able to give safety; if you want to give danger, you are able to give danger.\"",
    "sn11.10:3": "v.901\"‘I’ll grant no safety to the seers,For they are hated devotees of Sakka;Though you appeal to me for safety,I’ll give you only danger.’",
    "sn11.10:4": "v.902\"‘Though we have asked for safety,You give us only danger.We receive this at your hands:May ceaseless danger come to you!",
    "sn11.10:5": "v.903\"‘Whatever sort of seed is sown,That is the sort of fruit one reaps:The doer of good reaps good;The doer of evil reaps evil.By you, dear, has the seed been sown;Thus you will experience the fruit.’",
    "sn11.10:6": "\"Then, bhikkhus, having put a curse on Sambara, lord of the asuras, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, those seers who were virtuous and of good character disappeared from the presence of Sambara and reappeared in their leaf huts on the shore of the ocean.sn.i.228But after being cursed by those seers who were virtuous and of good character, Sambara, lord of the asuras, was gripped by alarm three times in the course of the night.\"[n.33]Spk: As soon as he fell asleep, he woke up howling as though he had been struck from all sides by a hundred spears. The other asuras came to inquire about his health and were still consoling him when dawn arrived. From then on his mind became sick and trembled(cittaṁ vepati); hence his other name, \"Vepacitti,\" arose.Vepatiis not in PED, but see MW, s.v.vip > vepate.Spk-pṭ glossesvepatiwithkampati pavedhati."
}