{
    "sn11.18:1": "At Sāvatthī. There the Blessed One said this: \"Bhikkhus, once in the past Sakka, lord of the devas, addressed his charioteer Mātali thus: ‘Harness the chariot with its team of a thousand thoroughbreds, friend Mātali. Let us go to the park grounds to see the beautiful scenery.’ - ‘Yes, your lordship,’ Mātali the charioteer replied. Then he harnessed the chariot with its team of a thousand thoroughbreds and announced to Sakka, lord of the devas: ‘The chariot has been harnessed, dear sir. You may come at your own convenience.’[n.650]Yassa dani kalaṁ maññasi.See Manné, \"On a Departure Formula and its Translation.\" The expression also occurs atSN35.88(IV 62,3),SN35.243(IV 83,5, 30),SN44.(IV 379,29),SN54.9(V 32,6–7), andSN55.6(V 348,27); I have varied the rendering slightly to fit the context.",
    "sn11.18:2": "v.90\"‘These all humbly worship you—Those versed in the Triple Veda,All the khattiyas reigning on earth,The Four Great Kings and the glorious Thirty—So who, O Sakka, is that spiritTo whom you bow in worship?’[n.651] Those versed in the Triple Veda are the brahmins; the Four Great Kings are the four divine rulers of the lowest sense-sphere heaven; the glorious Thirty are the presiding devas of the Tāvatiṁsa heaven. The word rendered \"spirit\" isyakkha,used in a broad sense without specific reference to the demonic spirits.",
    "sn11.18:3": "v.921\"‘These all humbly worship me—Those versed in the Triple Veda,All the khattiyas reigning on earth,The Four Great Kings and the glorious Thirty—",
    "sn11.18:4": "v.922But I worship those endowed with virtue,Those long trained in concentration,Those who have properly gone forthWith the holy life their destination.[n.652] Brahmacariyaparayaṇe.Spkdoes not explain the exact sense, but I interpret it as a compressed way of saying \"those living the holy life that has Nibbāna as its destination.\" SeeSN8.2(V 218,21):brahmacariyaṁ vussati nibbanaparayaṇaṁ.",
    "sn11.18:5": "v.923\"‘I worship as well, O Mātali,Those householders making merit,The lay followers possessed of virtueWho righteously maintain a wife.’",
    "sn11.18:6": "v.924\"‘Those whom you worship, my lord Sakka,Are indeed the best in the world.I too will worship them—Those whom you worship, Vāsavā.’",
    "sn11.18:7": "v.925\"Having given this explanation,Having worshipped the different quarters,The deva-king Maghava, Suja's husband,The chief, climbed into his chariot.\"sn.i.235"
}