{
    "sn11.20:1": "At Sāvatthī. There the Blessed One said this: \"Bhikkhus, once in the past Sakka, lord of the devas, addressed his charioteer Mātali thus: ‘Harness the chariot with its team of a thousand thoroughbreds, friend Mātali. Let us go to the park grounds to see the beautiful scenery.’ - ‘Yes, your lordship,’ Mātali the charioteer replied. Then he harnessed the chariot with its team of a thousand thoroughbreds and announced to Sakka, lord of the devas: ‘The chariot has been harnessed, dear sir. You may come at your own convenience.’[n.655a]Yassa dani kalaṁ maññasi.See Manné, \"On a Departure Formula and its Translation.\" The expression also occurs atSN35.88(IV 62,3),SN35.243(IV 83,5, 30),SN44.(IV 379,29),SN54.9(V 32,6–7), andSN55.6(V 348,27); I have varied the rendering slightly to fit the context.sn.i.236",
    "sn11.20:2": "v.93\"‘It is these that should worship you—The humans stuck in a putrid body,Those submerged inside a corpse,Afflicted with hunger and thirst.[n.655] Stuck in a putrid body(pūtidehasaya).Spk: This is said because they stay within the putrid body of the mother (during the fetal stage) or because they are stuck within their own body.Those submerged inside a corpse. I read this line as in Be (in both text and the lemma of Spk) asnimugga kuṇapamhete,with the indirect object a locative singular. Se readskuṇapasmete,using an alternative form of the locative singular. Ee1 & , however, and Spk (Se) in the lemma read the line with the locative pluralkuṇapesv ete.Spk explains: \"These are submerged for ten months in a corpse, namely, in the mother's womb.\" Despite this comment, it seems more likely that the reference is to the individual's own living body.",
    "sn11.20:3": "v.9Why then do you envy them,These who dwell homeless, Vāsavā?Tell us about the seers’ conduct;Let us hear what you have to say.’",
    "sn11.20:4": "v.93\"‘This is why I envy them,[n.656] Vv.93–35correspond in part toThī 282–83. I take vv. 935–36 to be two verses of six pādas each (as in Se and Ee2) rather than three verses of four pādas each (as in Be).Those who dwell homeless, Mātali:Whatever village they depart from,They leave it without concern.",
    "sn11.20:5": "v.93\"‘They do not keep their goods in storage,Neither in a pot nor in a box.Seeking what has been prepared by others,By this they live, firm in vows:",
    "sn11.20:6": "Those wise ones who give good counsel,Maintaining silence, of even faring.[n.57] I read pāda a differently from the four eds.,na te saṁ koṭṭhe osenti(the reading atThī 283; Ee2 correctly separatesteandsaṁbut hasopenti).Spkexplains:na te saṁ santakaṁ dhaññaṁ koṭṭhe pakkhipanti;\"they do not place their own goods, property, grain in storage.\"Saṁthus has the sense of \"own goods\"; see EV I, n. to 743 and EV II, n. to 283. The gloss on the verb,pakkhipanti,establishes that we should readosentirather thanopenti,the prevalent reading. Thī-a 208,21–22 glosses:na openti na paṭisāmetva ṭhapenti ādisassa pariggahassa āvato;\"they do not deposit, do not pack up and put away, owing to the absence of any such possession.\" The corresponding verb at Mvu III 453 isosāranti,which Jones suggests might be amended toosarenti.Jones is also aware of the Pali formosāpenti.See too nn.223and 542 above.In pāda c,Thī 283readspariniṭṭhitamas does the text and lemma of Thī-a. Norman prefers the latter by comparison with a similar verse in a Jain text (see EV II, n. to 283), but the explanations in both Thī-a and Spk supportparaniṭṭhitam,the reading in all eds. of SN. Spk: Seeking what has been prepared by others(paraniṭṭhitam esana): seeking out, searching out, by the practice of the alms round, food prepared by others, cooked in others’ homes(paresaṁ niṭṭhitaṁ paraghare pakkaṁ bhikkhācāravattena esamānā gavesamānā; I take the genitive paresaṁ here in an instrumental sense, which the context implies).Spkexplains pāda e: Who give good counsel(sumantamantino): They utter well-spoken words, saying \"We will recite the Dhamma, undertake an ascetic practice, enjoy the Deathless, do the work of an ascetic.\" Maintaining silence, of even faring(tuṇhībhūtā samañcarā): Even though they might speak the Dhamma with a voice as loud as thunder through the three watches of the night, they are still said to be \"maintaining silence, of even faring.\" Why so? Because they avoid all useless talk.v.937\"‘While devas fight with asurasAnd people fight with one another,",
    "sn11.20:7": "Among those who fight, they do not fight;Among the violent, they are quenched;Among those who grasp, they do not grasp:These are the ones whom I worship, Mātali.’",
    "sn11.20:8": "v.93\"‘Those whom you worship, my lord Sakka,Are indeed the best in the world.I too will worship them—Those whom you worship, Vāsavā.’",
    "sn11.20:9": "v.3\"Having given this explanation,Having worshipped the Bhikkhu Saṅgha,The deva-king Maghava, Suja's husband,The chief, climbed into his chariot.\""
}