{
    "sn11.5:1": "At Sāvatthī. \"Bhikkhus, once in the past the devas and the asuras were arrayed for battle. Then Vepacitti, lord of the asuras, said to Sakka, lord of the devas: ‘Lord of the devas, let there be victory by well-spoken counsel.’ (And Sakka replied:) ‘Vepacitti, let there be victory by well-spoken counsel.’ \"Then, bhikkhus, the devas and the asuras appointed a panel of judges, saying: ‘These will ascertain what has been well spoken and badly spoken by us.’",
    "sn11.5:2": "v.883\"‘Fools would vent their anger even moreIf no one would keep them in check.Hence with drastic punishmentThe wise man should restrain the fool.’",
    "sn11.5:3": "\"When, bhikkhus, Vepacitti, lord of the asuras, spoke this verse, the asuras applauded but the devas were silent. Then Vepacitti said to Sakka: ‘Speak a verse, lord of the devas.’ When this was said, Sakka, lord of the devas, recited this verse:",
    "sn11.5:4": "v.88\"‘I myself think this aloneIs the way to check the fool:When one knows one's foe is angryOne mindfully maintains one's peace.’",
    "sn11.5:5": "\"When, bhikkhus, Sakka, lord of the devas, spoke this verse, the devas applauded but the asuras were silent. Then Sakka said to Vepacitti: ‘Speak a verse, Vepacitti.’ When this was said, Vepacitti, lord of the asuras, recited this verse:",
    "sn11.5:6": "v.885\"‘I see this fault, O Vāsavā,In practising patient endurance:When the fool thinks of you thus,\"He endures me out of fear,\"The dolt will chase you even moreAs a bull does one who flees.’",
    "sn11.5:7": "\"When, bhikkhus, Vepacitti, lord of the asuras, spoke this verse, the asuras applauded but the devas were silent. Then Vepacitti said to Sakka: ‘Speak a verse, lord of the devas.’ When this was said, Sakka, lord of the devas, recited these verses:",
    "sn11.5:8": "v.6\"‘Let it be whether or not he thinks,\"He endures me out of fear,\"Of goals that culminate in one's own goodNone is found better than patience.[n.621a] I translate pādas cd guided bySpk's paraphrase: \"Among the goals (or goods) which culminate in one's own good, there is found no other goal (or good) better than patience\"(tesu saka-atthaparamesu atthesu khantito uttaritaro añño attho na vijjati). Because of the discrepancy between the plural sadatthaparama attha in pāda c and the singular verbvijjatiin pāda d, it seems necessary to read the nominative clause in pāda c as doing service for a locative or genitive, as Spk suggests, with a singular subject implicit. The only alternative would be to amend pāda c to read singularsadatthaparamo attho,but no text has this reading. Cp. v.54dabove and v.95dbelow. Ñāṇamoli splits the two pādas syntactically and translates: \"One's own good is the best of all, and there is none surpasses patience\" (The Guide,p. 227), but this seems too free. Note that Sakka speaks from the perspective of mundane ethical values rather than from the transcendent perspective of the Dhamma. From that perspective sadattha is identified with arahantship, which cannot be gained simply by patience.",
    "sn11.5:9": "v.887\"‘When a person endowed with strengthPatiently endures a weakling,They call that the supreme patience;The weakling must be patient always.[n.622a] C.Rh.D takesniccaṁ khamati dubbaloto mean that a weak person must always be tolerated (see KS 1:285), butdubbalo,as nominative, is clearly the subject of khamati, not its object. My translation conforms to Ñāṇamoli's (inMinor Readings and Illustrator,p. 162), but was made independently. Ñāṇamoli's note speaks for my interpretation as well: \"The rendering here … seeks to bring out that patience is a necessity rather than a virtue in the weak, but appears as a virtue in the forbearance of the strong. The verse is a difficult one.\"",
    "sn11.5:10": "v.888\"‘They call that strength no strength at all—The strength that is the strength of folly—But no one can reproach a personWho is strong because guarded by Dhamma.[n.623a]Spk: Dhammaguttassa: to one who is protected by the Dhamma or to one who is protecting the Dhamma(dhammena rakkhitassa dhammaṁ va rakkhantassa).",
    "sn11.5:11": "v.889\"‘One who repays an angry man with angersn.i.224Thereby makes things worse for himself.Not repaying an angry man with anger,One wins a battle hard to win.",
    "sn11.5:12": "v.890\"‘He practises for the welfare of both,His own and the other's,When, knowing that his foe is angry,He mindfully maintains his peace.",
    "sn11.5:13": "891\"‘When he achieves the cure of both—His own and the other's—The people who consider him a foolAre unskilled in the Dhamma.’",
    "sn11.5:14": "\"When, bhikkhus, these verses were spoken by Sakka, lord of the devas, the devas applauded but the asuras were silent. Then the panel of judges appointed by the devas and the asuras said this: ‘The verses spoken by Vepacitti, lord of the asuras, are in the sphere of punishment and violence; hence (they entail) conflict, contention, and strife. But the verses spoken by Sakka, lord of the devas, are in the sphere of nonpunishment and nonviolence; hence (they entail) freedom from conflict, freedom from contention, and freedom from strife. Sakka, lord of the devas, has won the victory by well-spoken counsel.’"
}