{
    "sn11.4:1": "At Sāvatthī. The Blessed One said this:sn.i.22",
    "sn11.4:2": "v.87\"‘When face to face with VepacittiIs it, Maghava, from fear or weaknessThat you endure him so patiently,Listening to his harsh words?’",
    "sn11.4:3": "v.87\"‘It is neither through fear nor weaknessThat I am patient with Vepacitti.How can a wise person like meEngage in combat with a fool?’",
    "sn11.4:4": "v.87\"‘Fools would vent their anger even moreIf no one would keep them in check.Hence with drastic punishmentThe wise man should restrain the fool.’[n.615] in pāda a,Be, Se, and Ee2readpabhijjeyyuṁ,Ee1pakujjheyyuṁ.The latter is recognized bySpkas a v.l. The dialogue represents a contest between two opposing models of political leadership, with Mātali advocating the principle of despotic rule, Sakka the principle of benevolent rule. The despotic political philosophy seems more in keeping with the character of the asuras, and indeed in the following sutta Vepacitti himself proclaims the verses here ascribed to Mātali.",
    "sn11.4:5": "v.87\"‘I myself think this aloneIs the way to check the fool:When one knows one's foe is angryOne mindfully maintains one's peace.’",
    "sn11.4:6": "v.87\"‘I see this fault, O Vāsavā,In practising patient endurance:When the fool thinks of you thus,\"He endures me out of fear,\"The dolt will chase you even moreAs a bull does one who flees.’sn.i.222",
    "sn11.4:7": "v.8\"‘Let it be whether or not he thinks,\"He endures me out of fear,\"Of goals that culminate in one's own goodNone is found better than patience.[n.616] I translate pādas cd guided bySpk's paraphrase: \"Among the goals (or goods) which culminate in one's own good, there is found no other goal (or good) better than patience\"(tesu saka-atthaparamesu atthesu khantito uttaritaro añño attho na vijjati). Because of the discrepancy between the pluralsadatthaparama atthain pāda c and the singular verbvijjatiin pāda d, it seems necessary to read the nominative clause in pāda c as doing service for a locative or genitive, as Spk suggests, with a singular subject implicit. The only alternative would be to amend pāda c to read singularsadatthaparamo attho,but no text has this reading. Cp. v.854dabove and v.895dbelow. Ñāṇamoli splits the two pādas syntactically and translates: \"One's own good is the best of all, and there is none surpasses patience\" (The Guide,p. 22), but this seems too free.Note that Sakka speaks from the perspective of mundane ethical values rather than from the transcendent perspective of the Dhamma. From that perspectivesadatthais identified with arahantship, which cannot be gained simply by patience.",
    "sn11.4:8": "v.7\"‘When a person endowed with strengthPatiently endures a weakling,They call that the supreme patience;The weakling must be patient always.[n.617] C.Rh.D takesniccaṁ khamati dubbaloto mean that a weak person must always be tolerated (see KS 1:25), butdubbalo,as nominative, is clearly the subject ofkhamati,not its object. My translation conforms to Ñāṇamoli's (inMinor Readings and Illustrator,p. 162), but was made independently. Ñāṇamoli's note speaks for my interpretation as well: \"The rendering here … seeks to bring out that patience is a necessity rather than a virtue in the weak, but appears as a virtue in the forbearance of the strong. The verse is a difficult one.\"",
    "sn11.4:9": "v.87\"‘They call that strength no strength at all—The strength that is the strength of folly—But no one can reproach a personWho is strong because guarded by Dhamma.[n.618]Spk:Dhammaguttassa:to one who is protected by the Dhamma or to one who is protecting the Dhamma(dhammena rakkhitassa dhammaṁ va rakkhantassa).",
    "sn11.4:10": "v.880\"‘One who repays an angry man with angerThereby makes things worse for himself.Not repaying an angry man with anger,One wins a battle hard to win.",
    "sn11.4:11": "v.881\"‘He practises for the welfare of both,His own and the other's,When, knowing that his foe is angry,He mindfully maintains his peace.",
    "sn11.4:12": "v.882\"‘When he achieves the cure of both—His own and the other's—The people who consider him a foolAre unskilled in the Dhamma.’",
    "sn11.4:13": "\"So, bhikkhus, if Sakka, lord of the devas, subsisting on the fruit of his own merit, exercising supreme sovereignty and rulership over the Tāvatiṁsa devas, will be one who speaks in praise of patience and gentleness, then how much more would it be fitting here for you, who have gone forth in such a well-expounded Dhamma and Discipline, to be patient and gentle.\""
}