{
    "sn11.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn11.1:2": "\"Bhikkhus, once in the past the asuras marched against the devas.[n.605] The texts commonly depict the Tāvatiṁsa devas and the asuras as engaged in perpetual strife, the devas representing the forces of light, peace, and harmony, the asuras or \"jealous titans\" the forces of violence, conflict, and dissension; see tooSN35.48.Spkexplains that the devas are protected by five lines of defense: the nāgas, the supaṇṇas (n. 397), the kumbhaṇḍas (a kind of goblin), the yakkhas, and the Four Great Kings, the presiding deities of the lowest sense-sphere heaven. When the asuras penetrate these five lines, the Four Great Kings inform Sakka, who mounts his chariot and then either goes to the battlefront himself or commissions one of his sons to lead the devas into battle. On this occasion he wanted to send his son Suvīra.Then Sakka, lord of the devas, addressed Suvīra, a young deva, thus: ‘Dear Suvīra, these asuras are marching against the devas. Go, dear Suvīra, launch a counter-march against the asuras.’ - ‘Yes, your lordship,’ Suvīra replied, but he became negligent.[n.606] Spk: Accompanied by his retinue of nymphs, he entered upon the great golden highway sixtyyojanaswide and roamed around in the Nandana Grove playing (the game of) Constellation.A second time Sakka addressed Suvīra … … but a second time Suvīra became negligent. A third time Sakka addressed Suvīra … but a third time Suvīra became negligent.sn.i.17Then, bhikkhus, Sakka addressed Suvīra in verse:",
    "sn11.1:3": "v.858\"‘Where one need not toil and striveYet still may attain to bliss:Go there, Suvīra,And take me along with you.’",
    "sn11.1:4": "v.859\"‘That a lazy man who does not toilNor attend to his dutiesMight still have all desires fulfilled:Grant me that, Sakka, as a boon.’[n.607]Spk: in pāda a,alasassa(in Se and Ee1;alasvassain Be & Ee2) should be resolved:alaso assa;in pāda c,sabbakamasamiddhassashould be resolved:sabbakamehi samiddho assa.in pāda d, I readdisa tiwith Be, Se, and Ee2, as againstdisan tiin Ee1.Spk paraphrases pāda d thus: \"O Sakka, supreme deva, show me that blessed, supreme, state (or) region, point it out to me, describe it\"(sakka devaseṭṭha taṁ me varaṁ uttamaṁ ṭhanaṁ okasaṁ disa acikkha kathehi). VĀT proposes that because pāda d includes no other noun for an adjectivevaraṁto qualify, it would be better to takevaraṁitself as the noun meaning \"a boon\" and disa as meaning \"to grant, to bestow.\" This meaning is attested to in PED, s.v.disati,but without references. I have followed VĀT's suggestion, though I cannot cite any other instances where varaṁ is used in relation todisati.It is usually governed by the verbdadati,as at Vin I 278,23.",
    "sn11.1:5": "v.860\"‘Where a lazy man who does not toilMight achieve unending bliss:Go there, Suvīra,And take me along with you.’",
    "sn11.1:6": "v.81\"‘The bliss, supreme deva, we might findWithout doing work, O Sakka,The sorrowless state without despair:Grant me that, Sakka, as a boon.’",
    "sn11.1:7": "v.862\"‘If there exists any place anywhereWhere without work one won’t decline,That is indeed Nibbāna's path:Go there, Suvīra,And take me along with you.’[n.608] The verse is particularly obscure.Spkand Spk-pṭ offer little more than glosses, and a translator can do little better than take a shot in the dark. In pāda a, I regardkocias equivalent tokvaci(see n.15). I read the verb in pāda b with Ee1 & 2 asjiyati,as againstjivatiin Be and Se; the latter may have entered the text through a misunderstanding of the commentarial gloss.Spk: \"The place of living without doing work is the path of Nibbāna(kammaṁ akatva jīvitaṭṭhanaṁ nama nibbanassa maggo).\" Spk-pṭ: \"The ‘path of Nibbāna′ is the path which serves as the means for attainment of Nibbāna.\" This is perplexing: since \"work\"(kamma)in the sense of exertion is certainly needed to attain Nibbāna, the purport may be that with the attainment of Nibbāna no more work is needed to attain it. The verse may also be playing upon two meanings of kamma, suggesting that one who attains Nibbāna does not create further kamma, volitional action ripening in rebirth.",
    "sn11.1:8": "\"So, bhikkhus, if Sakka, lord of the devas, subsisting on the fruit of his own merit, exercising supreme sovereignty and rulership over the Tāvatiṁsa devas, will be one who speaks in praise of initiative and energy, then how much more would it be fitting here for you,[n.609] The verbsobhetha,in this stock expression, has proved troublesome to previous translators. C.Rh.D renders it \"do ye enhance his words\" (at KS 1:21); Horner, based on PED, as \"let your light shine forth\" (in BD 4:249, SN4.49, 5:227 = Vin I 17,23, I 349,7, II 162,15). Neither of these offerings captures the intended meaning. The verb—a middle voice, third person singular optative—always occurs in a context where the Buddha is speaking of a type of lay conduct that the bhikkhus, as renunciants, should be able to surpass. Hence the verb points to how one should act to make oneself shine, i.e., the mode of conduct that is fitting for one's station.who have gone forth in such a well-expounded Dhamma and Discipline, to toil, struggle, and strive for the attainment of the as-yet-unattained, for the achievement of the as-yet-unachieved, for the realization of the as-yet-unrealized.\""
}