{
    "sn11.3:1": "At Sāvatthī. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"[n.60] This sutta is a popular paritta or protective discourse, included in theMaha Pirit Pota.The Northern Buddhist tradition has preserved versions in Tibetan and Chinese, translated from the Skt, and Skt fragments also have been found. The various versions are discussed in detail by Skilling,Maha SūtrasII, pp. 44–67.",
    "sn11.3:2": "\"Bhikkhus, once in the past the devas and the asuras were arrayed for battle. Then Sakka, lord of the devas, addressed the Tāvatiṁsa devas thus:",
    "sn11.3:3": "‘Dear sirs, when the devas are engaged in battle,sn.i.219if fear or trepidation or terror should arise, on that occasion you should look up at the crest of my standard. For when you look up at the crest of my standard, whatever fear or trepidation or terror you may have will be abandoned.[n.611]Spkdoes not gloss the compounddhajagga,but it occurs atAN III 89,17foll. and is explained at Mp III 267,18 as \"the crests of standards raised up from the backs of elephants, horses, etc., or from chariots.\" Skilling discusses the Skt wordsdhvajaanddhvajagraat length and concludes that \"in its early form adhvajawas a pole surmounted by an emblem, carried as a military or royal symbol\" (Maha SūtrasII, p. 457). The emblem is thedhvajagra,the \"crest of the standard,\" though it seems that over time the two terms came to be used almost interchangeably. Since the standard often also bore a flag, the worddhvajaeventually was transferred to the flag; this understanding of the term seems to be implicit in Spk's remark (just below).Dhajaoccurs at v.226a.Spk: \"The crest of Sakka's standard is raised up from his chariot 250 yojanas high, and when it is struck by the wind it gives forth the sound of a five-piece orchestra. When the devas look up at it, they think, ‘Our king has come and stands by his troops like a deeply planted pillar. Of whom need we be afraid?’ Thus they have no fear.\"",
    "sn11.3:4": "\"‘If you cannot look up at the crest of my standard, then you should look up at the crest of the deva-king Pajapati's standard. For when you look up at the crest of his standard, whatever fear or trepidation or terror you may have will be abandoned.",
    "sn11.3:5": "\"‘If you cannot look up at the crest of the deva-king Pajapati's standard, then you should look up at the crest of the deva-king Varuṇa's standard … .",
    "sn11.3:6": "If you cannot look up at the crest of the deva-king Varuṇa's standard, then you should look up at the crest of the deva-king Īsāna's standard … . For when you look up at the crest of his standard, whatever fear or trepidation or terror you may have will be abandoned.’[n.12] Of these three deities,Spksays only that Pajapati is of the same appearance and life span as Sakka and gets the second seat, while Varuṇa and Īsāna respectively get the third and fourth seats. According to MW,Prajāpatiwas originally \"lord of creatures, creator, … a supreme god above the Vedic deities.\"Varuṇa\"is one of the oldest Vedic gods … often regarded as the supreme deity.\"Īsānais \"one of the older names of Śiva-Rudra.\"",
    "sn11.3:7": "\"Bhikkhus, for those who look up at the crest of the standard of Sakka, lord of the devas; or of Pajapati, the deva-king; or of Varuṇa, the deva-king; or of Īsāna, the deva-king, whatever fear or trepidation or terror they may have may or may not be abandoned.",
    "sn11.3:8": "For what reason? Because Sakka, lord of the devas, is not devoid of lust, not devoid of hatred, not devoid of delusion; he can be timid, petrified, frightened, quick to flee.",
    "sn11.3:9": "\"But, bhikkhus, I say this: If you have gone to a forest or to the foot of a tree or to an empty hut, and fear or trepidation or terror should arise in you, on that occasion you should recollect me thus: ‘The Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’ For when you recollect me, bhikkhus, whatever fear or trepidation or terror you may have will be abandoned.sn.i.220",
    "sn11.3:10": "\"If you cannot recollect me, then you should recollect the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’ For when you recollect the Dhamma, bhikkhus, whatever fear or trepidation or terror you may have will be abandoned.",
    "sn11.3:11": "\"If you cannot recollect the Dhamma, then you should recollect the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practising the good way, practising the straight way, practising the true way, practising the proper way; that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’ For when you recollect the Saṅgha, bhikkhus, whatever fear or trepidation or terror you may have will be abandoned.",
    "sn11.3:12": "\"For what reason? Because, bhikkhus, the Tathāgata, the Arahant, the Perfectly Enlightened One is devoid of lust, devoid of hatred, devoid of delusion; he is brave, courageous, bold, ready to stand his place.\"",
    "sn11.3:13": "v.868\"In a forest, at the foot of a tree,Or in an empty hut, O bhikkhus,You should recollect the Buddha:No fear will then arise in you.",
    "sn11.3:14": "v.869\"But if you cannot recall the Buddha,Best in the world, the bull of men,Then you should recall the Dhamma,Emancipating, well expounded.",
    "sn11.3:15": "v.870\"But if you cannot recall the Dhamma,Emancipating, well expounded,Then you should recall the Saṅgha,The unsurpassed field of merit.",
    "sn11.3:16": "v.871\"For those who thus recall the Buddha,The Dhamma, and the Saṅgha, bhikkhus,No fear or trepidation will arise,Nor any grisly terror.\""
}