{
    "sn11.14:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn11.14:2": "\"Bhikkhus, once in the past in this same Rājagaha there was a poor man, a pauper, an indigent. He undertook faith, virtue, learning, generosity, and wisdom in the Dhamma and Discipline proclaimed by the Tathāgata. Having done so, with the breakup of the body, after death,sn.i.3he was reborn in a good destination, in a heavenly world, in the company of the Tāvatiṁsa devas, where he outshone the other devas in regard to beauty and glory.[n.64]Spksays that this pauper was the leper Suppabuddha, whose story is told atUd 48–50 and, more elaborately with several variations, in Spk. According to the Spk version, in an earlier life he had been a king of Baraṇasī who had spitefully reviled an aged paccekabuddha. As a kammic result he was reborn in hell and then, through the residue of the evil kamma, as a poor leper in Rājagaha. One day, on his begging rounds, he heard the Buddha preach and attained stream-entry. Shortly afterwards he was killed by a wild cow and was reborn in the Tāvatiṁsa heaven.",
    "sn11.14:3": "\"Then, bhikkhus, Sakka, lord of the devas, addressed the Twsa devas, where he outshines the other devas in regard to beauty and glory.’",
    "sn11.14:4": "v.910\"‘When one has faith in the Tathāgata,Unshakable and well established,And good conduct built on virtue,Dear to the noble ones and praised;[n.6]Spkexplainsfaithas faith arrived at via the path(maggen′ agatasaddha). Good conduct built on virtue(sīlaṁ kalyāṇaṁ)is the noble disciple's \"virtue dear to the noble ones\"(ariyakantasīla), one of the four factors of stream-entry (SN55.1), which the stream-enterer does not abandon even in a future existence.",
    "sn11.14:5": "v.911\"‘When one has confidence in the SaṅghaAnd one's view is straightened out,They say that one isn’t poor;One's life is not lived in vain.",
    "sn11.14:6": "v.912\"‘Therefore the person of intelligence,Remembering the Buddha’s Teaching,Should be devoted to faith and virtue,To confidence and vision of the Dhamma.’\""
}