{
    "sn11.8:1": "At Sāvatthī in Jeta's Grove. Now on that occasion the Blessed One had gone for his day's abiding and was in seclusion. Then Sakka, lord of the devas, and Verocana, lord of the asuras, approached the Blessed One and stood one at each door post. Then Verocana, lord of the asuras, recited this verse in the presence of the Blessed One:[n.625] NeitherSpknor Spk-pṭ offers any help in identifying Verocana. AtDN II 259,mention is made of “a hundred sons of (the asura) Bali, all named Veroca”(satañ ca baliputtānaṁ sabbe Verocanāmakā),on which Sv II 689,26-27 comments: “They all bore the name of their uncle Rāhu.” This might suggest that Verocana and Rāhu are identical, but there is no additional evidence for this.",
    "sn11.8:2": "v.894\"A man should make an effortUntil his goal has been achieved.Goals shine when achieved:This is the word of Verocana.\"sn.i.6",
    "sn11.8:3": "v.895\"A man should make an effortUntil his goal has been achieved.Of goals that shine when achieved,None is found better than patience.\"[n.626] Both C.Rh.D and Geiger translate pādas cd as if they were two independent sentences: \"A purpose shines when perfected. /Nothing forbearance doth excel.\" I go along with the paraphrase ofSpk, which treats them as forming one sentence: \"Among the goals (goods) that shine when achieved, there is no goal better than patience.\" I read pāda c here (and in v.894just above) with Se and Ee2 as plural:nipphannasobhino attha,as against the singularnipphannasobhano atthoof Be and Ee1. Pāda d here is identical with v.854dand v.877d. See n.616.",
    "sn11.8:4": "v.896\"All beings are bent on a goalHere or there as fits the case,But for all creatures associationIs supreme among enjoyments.Goals shine when achieved:This is the word of Verocana.\"[n.627] in pāda a,sabbe satta atthajatamight also have been rendered, \"All beings are beset by needs.\"Spkexplains: \"Bent upon a goal means engaged in a task(atthajata ti kiccajata); for there is no being at all, including dogs and jackals, that is not engaged in a task. Even walking to and fro can be called a task.\"Pādas cd read:Saṁyogaparama tveva/Sambhoga sabbapaṇinaṁ.The exact meaning and relevance are obscure. Spk interprets the line with an example—bland food may be made savoury when combined with various condiments—which construessaṁyogaas meaning combination or preparation. This seems to me unlikely. At Ja IV 127,1–15 the couplet occurs in a context which implies that the meaning is association with other people; see tooAN IV 57–58, wheresaṁyogasignifies contact or association between man and woman (sexual, but not necessarily coitus). I understand the syntax as parallel to that ofDhp 203–, that is, \"enjoyments have association as supreme,\" rather than \"through association enjoyments become supreme,\" the sense proposed by Spk.",
    "sn11.8:5": "v.897\"All beings are bent upon a goalHere or there as fits the case,But for all creatures associationIs supreme among enjoyments.Of goals that shine when achieved,None is found better than patience.\""
}