{
    "sn12.32:1": "Then the bhikkhu Kaḷara the Khattiya approached the Venerable Sāriputta and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Venerable Sāriputta: \"Friend Sāriputta, the bhikkhu Moḷiyaphagguna has abandoned the training and returned to the lower life.\"[n.93] The bhikkhu Kaḷara the Khattiya is met only here. Moḷiyaphagguna appears inSN2.2; see n.2. \"Returned to the lower life\"(hīnāyāvatto)means that he reverted to the state of a layman.Spkand Spk-pṭ together help to illuminate this cryptic exchange thus: \"He did not find solace(assāsa)\" means that he had not attained the three (lower) paths; for if he had attained them he would not have reverted to the lower life since then he would not have been tempted by sensual pleasures (his reason for disrobing). Sāriputta says \"I have no perplexity\"(na kaṅkhāmī)about having attained solace since his support is the knowledge of a disciple's perfection(savakaparamiñāṇa). \"As to the future\"(āyatiṁ)refers to future rebirth; the question is an indirect way of asking if he has attained arahantship.",
    "sn12.32:2": "\"Well then, has the Venerable Sāriputta attained solace in this Dhamma and Discipline?\"",
    "sn12.32:3": "\"I have no perplexity, friend.\" \"But as to the future, friend?\"",
    "sn12.32:4": "\"I have no doubt, friend.\"",
    "sn12.32:5": "Then the bhikkhu Kaḷara the Khattiya rose from his seat and approached the Blessed One. Having approached, he paid homage to the Blessed One, sat down to one side,sn.ii.1and said to him: \"Venerable sir, the Venerable Sāriputta has declared final knowledge thus: ‘I understand: Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\"[n.94]Spkremarks that Sāriputta did not declare final knowledge in such words, but the elder Kaḷara Khattiya had ascribed this statement to him because he was happy and pleased. Final knowledge(aññā)is arahantship.",
    "sn12.32:6": "Then the Blessed One addressed a certain bhikkhu thus: \"Come, bhikkhu, tell Sāriputta in my name that the Teacher calls him.\"",
    "sn12.32:7": "\"If, Sāriputta, they were to ask you:[n.95]Spk: The Blessed One asked him this question to get him to declare final knowledge, thinking: \"He will not declare final knowledge of his own accord, but he will do so when answering my question.\"‘Friend Sāriputta, how have you known, how have you seen, that you have declared final knowledge thus: ‘I understand: Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being’—being asked thus, how would you answer?\"",
    "sn12.32:8": "\"If they were to ask me this, venerable sir,sn.ii.52I would answer thus: ‘With the destruction of the source from which birth originates, I have understood: \"Whenthe causeis destroyed,the effectis destroyed.\" Having understood this, I understand: Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’ Being asked thus, venerable sir, I would answer in such a way.\"[n.96]Spk: Here too (as inSN12.31) the elder was puzzled not by the question but by the Buddha’s intention; he was unsure how the Teacher wanted him to declare arahantship. But he started to speak in terms of conditionality, which was what the Teacher wanted. When he realized that he had grasped the Teacher's intention, the answer appeared to him with a hundred and a thousand methods.I have translated the first part of Sāriputta's reply in accordance with the gloss of Spk thus: \"With the destruction of the specific condition for birth, I have understood, ‘As the condition for birth is destroyed, the effect, namely birth, is destroyed.’\"",
    "sn12.32:9": "\"But, Sāriputta, if they were to ask you: ‘But, friend Sāriputta, what is the source of birth, what is its origin, from what is it born and produced?’—being asked thus, how would you answer?\"",
    "sn12.32:10": "\"But, Sāriputta, if they were to ask you: ‘But, friend Sāriputta, what is the source of existence … ?’—being asked thus, how would you answer?\"",
    "sn12.32:11": "\"But, Sāriputta, if they were to ask you: ‘But, friend Sāriputta, what is the source of clinging … ? What is the source of craving, what is its origin, from what is it born and produced?’—being asked thus, how would you answer?\"sn.ii.53",
    "sn12.32:12": "\"But, Sāriputta, if they were to ask you: ‘Friend Sāriputta, how have you known, how have you seen, that delight in feelings no longer remains present in you?’—being asked thus, how would you answer?\"[n.97]Spk: The Buddha asks this to get Sāriputta to roar a lion's roar in his own proper domain. For Sāriputta attained the knowledge of a disciple's perfection after he had discerned the three feelings while the Buddha taught the wanderer Dighanakha \"The Discourse on the Discernment of Feelings\" and this became his own domain(savisaya).Spk refers here to the Dighanakha Sutta (MN No. 74; see esp.MN I 500,9–501,6), and seems to be using \"Vedanapariggaha Sutta\" as an alternative title for that text. Ee (S II 53,8–9, ) should be amended to read vedanasu nandi.",
    "sn12.32:13": "\"Good, good, Sāriputta! This is another method of explaining in brief that same point: ‘Whatever is felt is included within suffering. ’[n.98]Yaṁ kiñci vedayitaṁ taṁ dukkhasmiṁ.SeeSN36.11(IV 216,20–217,3).",
    "sn12.32:14": "But, Sāriputta, if they were to ask you: ‘Friend Sāriputta, through what kind of deliverance have you declared final knowledge thus: \"I understand: Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being\"?’—being asked thus, how would you answer?\"",
    "sn12.32:15": "\"Good, good, Sāriputta! This is another method of explaining in brief that same point: ‘I have no perplexity in regard to the taints spoken of by the Ascetic; I do not doubt that they have been abandoned by me.’\"",
    "sn12.32:16": "Then, soon after the Blessed One had departed, the Venerable Sāriputta addressed the bhikkhus thus:",
    "sn12.32:17": "Then the bhikkhu Kaḷara the Khattiya rose from his seat and approached the Blessed One. Having approached, he paid homage to the Blessed One, sat down to one side, and said to him: \"Venerable sir, the Venerable Sāriputta has roared his lion's roar thus: ‘Friends, the first question that the Blessed One asked me had not been previously considered by me: thus I hesitated over it. But when the Blessed One approved of my answer, it occurred to me: \"If the Blessed One were to question me about this matter for up to seven days and nights,sn.ii.56for up to seven days and nights I would be able to answer him with various terms and with various methods.\"’\"",
    "sn12.32:18": "\"Bhikkhu, the Venerable Sāriputta has thoroughly penetrated that element of the Dhamma by the thorough penetration of which, if I were to question him about that matter with various terms and with various methods for up to seven days and nights, for up to seven days and nights he would be able to answer me with various terms and with various methods.\"[n.101]Spk: That element of the Dhamma(sā dhammadhātu): Here, \"element of the Dhamma\" is the knowledge of a disciple's perfection, which is capable of seeing the principle of conditionality without obscuration(paccayākārassa vivaṭabhāvadassanasamatthaṁ sāvakapāramīñāṇaṁ)."
}