{
    "sn12.61:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park … .",
    "sn12.61:2": "\"But, bhikkhus, as to that which is called ‘mind’ and ‘mentality’ and ‘consciousness’[n.154]Cittaṁ iti pi mano iti pi viññāṇaṁ iti pi.Cp.DN I 1,1:Yaṁ … idaṁ vuccati cittan ti va mano ti va viññāṇan ti va.Spksays these are all names for the mind base(manāyatana). Normally I render both citta and mano as \"mind,\" but since English has only two words of common usage to denote the faculty of cognition—\"mind\" and \"consciousness\"—here I am compelled to use \"mentality\" as a makeshift formano.While technically the three terms have the same denotation, in the Nikāyas they are generally used in distinct contexts. As a rough generalization, viññāṇa signifies the particularizing awareness through a sense faculty (as in the standard sixfold division ofviññāṇainto eye-consciousness, etc.) as well as the underlying stream of consciousness, which sustains personal continuity through a single life and threads together successive lives (emphasized at1:38–40).Manoserves as the third door of action (along with body and speech) and as the sixth internal sense base (along with the five physical sense bases); as the mind base it coordinates the data of the other five senses and also cognizes mental phenomena(dhammā), its own special class of objects.Cittasignifies mind as the centre of personal experience, as the subject of thought, volition, and emotion. It is citta that needs to be understood, trained, and liberated. For a more detailed discussion, see Hamilton,Identity and Experience,chap. 5.—the uninstructed worldling is unable to experience revulsion towards it, unable to become dispassionate towards it and be liberated from it. For what reason? Because for a long time this has been held to by him, appropriated, and grasped thus: ‘This is mine, this I am, this is my self.’[n.155] Spk: It is held to(ajjhosita)by being swallowed up by craving; appropriated(mamayita)by being appropriated by craving; and grasped(paramaṭṭha)by being grasped through views. \"This is mine\"(etaṁ mama): the grip of craving(taṇhāgāha); by this the 108 thoughts of craving are included (seeAN II 1,31–13,). \"This I am\"(eso ’ham asmi): the grip of conceit(mānagāha); by this the nine kinds of conceit are included (see I, n.37). \"This is my self\"(eso me attā): the grip of views(diṭṭhigāha); by this the sixty-two views are included (seeDN I 1–38).Therefore the uninstructed worldling is unable to experience revulsion towards it, unable to become dispassionate towards it and be liberated from it.",
    "sn12.61:3": "\"It would be better, bhikkhus, for the uninstructed worldling to take as self this body composed of the four great elements rather than the mind. For what reason? Because this body composed of the four great elements is seen standing for one year, for two years, for three, four, five, or ten years, for twenty, thirty, forty, or fifty years, for a hundred years,sn.ii.95or even longer.[n.156] Because this body … is seen standing for a hundred years, or even longer.Spk: (Query:) Why does the Blessed One say this? Isn’t it true that the physical form present in the first period of life does not last through to the middle period, and the form present in the middle period does not last through to the last period?… Isn’t it true that formations break up right on the spot, stage by stage, section by section, just as sesamum seeds pop when thrown on a hot pan? (Reply:) This is true, but the body is said to endure for a long time in continuous sequence(paveṇivasena), just as a lamp is said to burn all night as a connected continuity(paveṇisambandhavasena)even though the flame ceases right where it burns without passing over to the next section of the wick.",
    "sn12.61:4": "But that which is called ‘mind’ and ‘mentality’ and ‘consciousness’ arises as one thing and ceases as another by day and by night. Just as a monkey roaming through a forest grabs hold of one branch, lets that go and grabs another, then lets that go and grabs still another, so too that which is called ‘mind’ and ‘mentality’ and ‘consciousness’ arises as one thing and ceases as another by day and by night.[n.157]Spk: By day and by night(rattiyā ca divasassa ca): This is a genitive in the locative sense, i.e., during the night and during the day. Arises as one thing and ceases as another(aññadeva uppajjati, aññaṁ nirujjhati): The meaning is that (the mind) that arises and ceases during the day is other than (the mind) that arises and ceases during the night. The statement should not be taken to mean that one thing arises and something altogether different, which had not arisen, ceases. \"Day and night\" is said by way of continuity, taking a continuity of lesser duration than the previous one (i.e., the one stated for the body). But one citta is not able to endure for a whole day or a whole night. Even in the time of a fingersnap many hundred thousand ofkoṭisof cittas arise and cease (1koṭi= 10 million). The simile of the monkey should be understood thus: The \"grove of objects\" is like the forest grove. The mind arising in the grove of objects is like the monkey wandering in the forest grove. The mind's taking hold of an object is like the monkey grabbing hold of a branch. Just as the monkey, roaming through the forest, leaves behind one branch and grabs hold of another, so the mind, roaming through the grove of objects, arises sometimes grasping hold of a visible object, sometimes a sound, sometimes the past, sometimes the present or future, sometimes an internal object, sometimes an external object. When the monkey does not find a (new) branch it does not descend and sit on the ground, but sits holding to a single leafy branch. So too, when the mind is roaming through the grove of objects, it cannot be said that it arises without holding to an object; rather, it arises holding to an object of a single kind.It should be noted that neither the sutta nor the commentary interprets the monkey simile here as saying that the untrained mind is as restless as a monkey; the point, rather, is that the mind is always dependent on an object.",
    "sn12.61:5": "\"Seeing thus, bhikkhus, the instructed noble disciple experiences revulsion towards form, revulsion towards feeling, revulsion towards perception, revulsion towards volitional formations, revulsion towards consciousness. Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated. When it is liberated there comes the knowledge: ‘It's liberated.’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\""
}