{
    "sn12.67:1": "On one occasion the Venerable Sāriputta and the Venerable Mahakoṭṭhita were dwelling at Baraṇasī in the Deer Park at Isipatana.[n.93] Mahakoṭṭhita was the foremost disciple in the analytical knowledges(paṭisambhidā). He often appears in dialogue with Sāriputta. As C.Rh.D remarks (KS 2:79, n. ), since both elders were arahants it is likely these dialogues were intended as \"lessons\" for their students rather than as genuine inquiries.Then, in the evening, the Venerable Mahakoṭṭhita emerged from seclusion and approached the Venerable Sāriputta. He exchanged greetings with the Venerable Sāriputta and, when they had concluded their greetings and cordial talk, he sat down to one side and said to him:",
    "sn12.67:2–3": "\"How is it, friend Sāriputta: Is birth created by oneself … Is existence … clinging … craving … feeling … contact … the six sense bases … name-and-form created by oneself, or is it created by another, or is it created both by oneself and by another, or has it arisen fortuitously, being created neither by oneself nor by another?\"\"Name-and-form, friend Koṭṭhita, is not created by oneself, nor is it created by another, nor is it created both by oneself and by another, nor has it arisen fortuitously, being created neither by oneself nor by another; but rather, with consciousness as condition, name-and-formcomes to be.\"",
    "sn12.67:4": "\"How is it, friend Sāriputta: Is consciousness created by oneself, or is it created by another, or is it created both by oneself and by another, or has it arisen fortuitously, being created neither by oneself nor by another?\"",
    "sn12.67:5–6": "\"Now we understand the Venerable Sāriputta's statement thus: ‘Name-and-form, friend Koṭṭhita, is not created by oneself … but rather, with consciousness as condition, name-and-formcomes to be.’ Now we also understand the Venerable Sāriputta'sotherstatement thus: ‘Consciousness, friend Koṭṭhita, is not created by oneself … but rather, with name-and-form as condition, consciousnesscomes to be.’",
    "sn12.67:7": "But how, friend Sāriputta, should the meaning of this statement be seen?\"",
    "sn12.67:8": "\"It is wonderful, friend Sāriputta! It is amazing, friend Sāriputta! How well this has been stated by the Venerable Sāriputta. We rejoice in the Venerable Sāriputta's statement on these thirty-six grounds:[n.196] Cp.SN12.16.Spk: On thirty-six grounds: for thirty-six reasons, obtained by taking three cases in relation to each of the twelve terms. The first is the quality of being a speaker on the Dhamma, the second the practice, the third the fruit of the practice. By the first method the excellence of the teaching is discussed, by the second the plane of the trainee(sekha), by the third the plane of the arahant (asekha, one beyond training).",
    "sn12.67:9": "If, friend, a bhikkhu teaches the Dhamma for the purpose of revulsion towards aging-and-death, for its fading away and cessation, he can be called a bhikkhu who is a speaker on the Dhamma.sn.ii.115If a bhikkhu is practising for the purpose of revulsion towards aging-and-death, for its fading away and cessation, he can be called a bhikkhu who is practising in accordance with the Dhamma. If through revulsion towards aging-and-death, through its fading away and cessation, a bhikkhu is liberated by nonclinging, he can be called a bhikkhu who has attained Nibbāna in this very life."
}