{
    "sn12.4:1": "At Sāvatthī.[n.0] The next seven suttas describe, in identical terms, the enlightenment of the six past Buddhas and the present Buddha Gotama as the discovery of dependent origination and its cessation. The Pali text is filled out only for Vipassi and Gotama; the others are drastically abridged. I have translated in full only the last sutta, where Gotama speaks of his own attainment of enlightenment.",
    "sn12.4:2–25": "\"Bhikkhus, before his enlightenment, while he was still a bodhisatta,[n.11] From the explanation ofbodhisattainSpkit appears that the Pali commentarial tradition recognizes alternative etymologies of the word, as equivalent either to Sktbodhisattva(\"an enlightenment being\") or to*bodhisakta(\"one devoted to enlightenment\"); see PED, s.v.satta(1).Spk:Bodhiis knowledge; a being endowed withbodhiis abodhisatta,a knowing one, a wise one, a sagely one. For from the time he forms his aspiration at the feet of former Buddhas, that being is always wise, never a blind fool. Or else, just as a mature lotus that has risen up above the water and is due to blossom when touched by the sun's rays is called \"an awakening lotus,\" so a being who has obtained the prediction (to future Buddhahood) from the Buddhas and who will inevitably fulfil the perfections(parami)and attain enlightenment is called an awakening being(bujjhanasatta); he is a bodhisatta. One who lives yearning for enlightenment—the knowledge of the four paths—is devoted to, attached to, enlightenment(bodhiyaṁ satto asatto); he is a bodhisatta.not yet fully enlightened, it occurred to Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One:[n.12] The Buddha Vipassi was the sixth Buddha of antiquity, counting back from the Buddha Gotama. A detailed account of his career is found atDN II 11–51. He arose in the world ninety-one aeons ago. Sikhi and Vessabhū arose thirty-one aeons ago; Kakusandha, Koṇāgamana, Kassapa, and Gotama all arose in this present \"excellent aeon\"(bhaddakappa). SeeDN II 2,15–28.‘Alas, this world has fallen into trouble, in that it is born, ages, and dies, it passes away and is reborn, yet it does not understand the escape from this sufferingheaded byaging-and-death. When now will an escape be discerned from this sufferingheaded byaging-and-death?’… \"‘Cessation, cessation’—thus, bhikkhus, in regard to things unheard before there arose in the Bodhisatta Vipassī vision, knowledge, wisdom, true knowledge, and light.\""
}