{
    "sn12.70:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary.",
    "sn12.70:2": "Now on that occasion the wanderer Susīma was residing in Rājagaha along with a large company of wanderers.sn.ii.10Then his company said to the wanderer Susīma: \"Come, friend Susīma, lead the holy life under the ascetic Gotama. Master his Dhamma and teach it to us. We will master his Dhamma and preach it to the lay people. Thus we too will be honoured, respected, esteemed, venerated, and revered, and we too will obtain robes, almsfood, lodgings, and medicinal requisites.\"",
    "sn12.70:3": "Then the Venerable Ānanda took the wanderer Susīma and approached the Blessed One. He paid homage to the Blessed One, and then he sat down to one side and said to him: \"Venerable sir, this wanderer Susīma says that he wishes to lead the holy life in this Dhamma and Discipline.\"",
    "sn12.70:4": "Now on that occasion a number of bhikkhus had declared final knowledge in the presence of the Blessed One, saying: \"We understand: Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.\" The Venerable Susīma heard about this,sn.ii.121so he approached those bhikkhus, exchanged greetings with them, and then sat down to one side and said to them: \"Is it true that you venerable ones have declared final knowledge in the presence of the Blessed One, saying: ‘We understand: Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being’?\"[n.207]Spk: Those bhikkhus, having received a meditation subject from the Teacher, entered upon the three-month rains residence, and during the rains, striving and struggling, they attained arahantship. At the end of the rains they went to the Teacher and informed him of their attainment. When Susīma heard about this he thought: \"Final knowledge(aññā)must be the supreme standard in this Dispensation, the essential personal transmission of the teacher (paramappāmaṇaṁ sārabhūtā ācariyamuṭṭhi,lit. ‘teacher's fist’). Let me inquire and find out about it.\" Therefore he approached those bhikkhus.The stock description of the five abhiññās that follows is commented upon in detail in Vism, chaps. 12 and 13.",
    "sn12.70:5": "\"Then knowing and seeing thus, do you venerable ones wield the various kinds of spiritual power, such that: having been one, you become many; having been many, you become one; you appear and vanish; you go unhindered through a wall, through a rampart, through a mountain as though through space; you dive in and out of the earth as though it were water; you walk on water without sinking as though it were earth; seated cross-legged, you travel in space like a bird; with your hand you touch and stroke the moon and sun so powerful and mighty; you exercise mastery with the body as far as the brahma world?\"",
    "sn12.70:6": "\"Then knowing and seeing thus, do you venerable ones, with the divine ear element, which is purified and surpasses the human, hear both kinds of sounds, the divine and human, those that are far as well as near?\"",
    "sn12.70:7": "\"Then knowing and seeing thus, do you venerable ones understand the minds of other beings and persons, having encompassed them with your own minds? Do you understand a mind with lust as a mind with lust; a mind without lust as a mind without lust; a mind with hatred as a mind with hatred; a mind without hatred as a mind without hatred; a mind with delusionsn.ii.122as a mind with delusion; a mind without delusion as a mind without delusion; a contracted mind as contracted and a distracted mind as distracted; an exalted mind as exalted and an unexalted mind as unexalted; a surpassable mind as surpassable and an unsurpassable mind as unsurpassable; a concentrated mind as concentrated and an unconcentrated mind as unconcentrated; a liberated mind as liberated and an unliberated mind as unliberated?\"",
    "sn12.70:8": "\"Then knowing and seeing thus, do you venerable ones recollect your manifold past abodes, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion thus: ‘There I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn elsewhere, and there too I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn here’? Do you thus recollect your manifold past abodes with their modes and details?\"",
    "sn12.70:9": "\"Then knowing and seeing thus, do you venerable ones, with the divine eye, which is purified and surpasses the human, see beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and understand how beings fare on in accordance with their kamma thus: ‘These beings who engaged in misconduct of body,sn.ii.123speech, and mind, who reviled the noble ones, held wrong view, and undertook actions based on wrong view, with the breakup of the body, after death, have been reborn in a state of misery, in a bad destination, in the nether world, in hell; but these beings who engaged in good conduct of body, speech, and mind, who did not revile the noble ones, who held right view, and undertook action based on right view, with the breakup of the body, after death, have been reborn in a good destination, in a heavenly world’? Thus with the divine eye, which is purified and surpasses the human, do you see beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and understand how beings fare on in accordance with their kamma?\"",
    "sn12.70:10": "\"Then knowing and seeing thus, do you venerable ones dwell in those peaceful deliverances that transcend forms, the formless attainments, having touched them with the body?\"[n.208]Spk-pṭ: The formless jhānas and deliverance from perception(āruppajjhāna-saññāvimokkha).",
    "sn12.70:11": "\"Here now, venerable ones: this answer and the nonattainment of those states, how could this be, friends?\"[n.209] The text enclosed in brackets in Ee should be deleted and the question read as in Be and Se thus:Ettha dāni āyasmanto idañ ca veyyākaraṇaṁ imesañ ca dhammānaṁ asamāpatti, idaṁ no āvuso kathan ti.I take the no to be merely an interrogative particle(= nu).",
    "sn12.70:12": "\"I do not understand in detail, friends, the meaning of what has been stated in brief by the venerable ones. It would be good if the venerable ones would explain to me in such a way that I could understand in detail what has been stated in brief.\"sn.ii.4",
    "sn12.70:13": "Then the Venerable Susīma rose from his seat and approached the Blessed One. Having approached, he paid homage to the Blessed One, sat down to one side, and reported to the Blessed One the entire conversation he had had with those bhikkhus.The Blessed One said:",
    "sn12.70:14": "\"I do not understand in detail, venerable sir, the meaning of what was stated in brief by the Blessed One. It would be good if the Blessed One would explain to me in such a way that I could understand in detail what has been stated in brief.\"",
    "sn12.70:15": "\"What do you think, Susīma, is form permanent or impermanent?\" –\"Impermanent, venerable sir.\"[n.213]Spk: Having known him to be capable of penetration, the Buddha speaks thus giving a Dhamma teaching with three turns, at the conclusion of which the elder attained arahantship. Spk-pṭ: The \"three turns\"(teparivaṭṭaṁ)are by way of the turning over of the three characteristics in relation to the five aggregates.The catechism on the three characteristics recurs throughout the Khandha-saṁyutta, as atSN22.49,59,79,80,82etc.–\"Is what is impermanent suffering or happiness?\" –\"Suffering, venerable sir.\" –\"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" –\"No, venerable sir.\"",
    "sn12.70:16": "\"Therefore, Susīma, any kind of form whatsoever, whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near, all form should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’",
    "sn12.70:17": "\"Seeing thus, Susīma, the instructed noble disciple experiences revulsion towards form, revulsion towards feeling, revulsion towards perception, revulsion towards volitional formations, revulsion towards consciousness. Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated. When it is liberated there comes the knowledge: ‘It's liberated. ’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’",
    "sn12.70:18": "\"Do you see, Susīma: ‘With birth as condition, aging-and-deathcomes to be’?\"",
    "sn12.70:19": "\"Do you see, Susīma: ‘With the cessation of birth comes cessation of aging-and-death’?\"",
    "sn12.70:20": "\"Knowing and seeing thus, Susīma, do you wield the various kinds of spiritual power, such that: having been one, you become many … and exercise bodily mastery as far as the brahma world?\"[n.214]Spk: This query is started in order to make it evident that those bhikkhus were dry-insighters without jhāna (or: \"dry-insight ponderers\"). This is the purport here: \"You are not the only dry-insighter without jhāna; those bhikkhus were also such.\"",
    "sn12.70:21": "\"Then knowing and seeing thus, Susīma, do you, with the divine ear element, which is purified and surpasses the human, hear both kinds of sounds, the divine and human, those that are far as well as near?\"sn.ii.127",
    "sn12.70:22": "\"Then knowing and seeing thus, Susīma, do you understand the minds of other beings and persons, having encompassed them with your own mind?\"",
    "sn12.70:23": "\"Then knowing and seeing thus, Susīma, do you recollect your manifold past abodes with their modes and details?\"",
    "sn12.70:24": "\"Then knowing and seeing thus, Susīma, do you, with the divine eye, which is purified and surpasses the human, see beings passing away and being reborn and understand how beings fare on in accordance with their kamma?\"",
    "sn12.70:25": "\"Then knowing and seeing thus, Susīma, do you dwell in those peaceful deliverances that transcend forms, the formless attainments, having touched them with the body?\"",
    "sn12.70:26": "\"Here now, Susīma: this answer and the nonattainment of those states, how could this be, Susīma?\"",
    "sn12.70:27": "Then the Venerable Susīma prostrated himself with his head at the Blessed One's feet and said: \"Venerable sir, I have committed a transgression in that I was so foolish, so confused, so inept that I went forth as a thief of the Dhamma in such a well-expounded Dhamma and Discipline as this. Venerable sir, may the Blessed One pardon me for my transgression seen as a transgression for the sake of future restraint.\"",
    "sn12.70:28": "\"Surely, Susīma, you have committed a transgression in that you were so foolish, so confused, so inept that you went forth as a thief of the Dhamma in such a well-expounded Dhamma and Discipline as this.[n.215]Dhammatthenaka.The formula for confession and pardon is also atSN16.6(II 205,10–16).sn.ii.1Suppose, Susīma, they were to arrest a bandit, a criminal, and bring him before the king, saying: ‘Sire, this man is a bandit, a criminal. Impose on him whatever punishment you wish.’ The king would say to them: ‘Come, men, bind this man's arms tightly behind his back with a strong rope, shave his head, and lead him around from street to street and from square to square, beating a drum. Then take him out through the southern gate and to the south of the city cut off his head.’ What do you think, Susīma, would that man experience pain and displeasure on that account?\"",
    "sn12.70:29": "\"Although that man would experience pain and displeasure on that account, going forth as a thief of the Dhamma in such a well-expounded Dhamma and Discipline as this has results that are far more painful, far more bitter, and further, it leads to the nether world. But since you see your transgression as a transgression and make amends for it in accordance with the Dhamma, we pardon you for it. For it is growth in the Noble One's Discipline when one sees one's transgression as a transgression, makes amends for it in accordance with the Dhamma, and undertakes future restraint.\"sn.ii.1"
}