{
    "sn12.24:1": "Then, in the morning, the Venerable Sāriputta dressed and, taking bowl and robe, entered Rājagaha for alms. Then it occurred to him: \"It is still too early to walk for alms in Rājagaha. Let me go to the park of the wanderers of other sects.\"",
    "sn12.24:2": "Then the Venerable Sāriputtasn.ii.33went to the park of the wanderers of other sects. He exchanged greetings with those wanderers and, when they had concluded their greetings and cordial talk, he sat down to one side. The wanderers then said to him:",
    "sn12.24:3": "\"Friend Sāriputta, some ascetics and brahmins, proponents of kamma, maintain that suffering is created by oneself; some ascetics and brahmins, proponents of kamma, maintain that suffering is created by another; some ascetics and brahmins, proponents of kamma, maintain that suffering is created both by oneself and by another; some ascetics and brahmins, proponents of kamma, maintain that suffering has arisen fortuitously, being created neither by oneself nor by another.[n.71] On the identity of the four views see above n.7.Now, friend Sāriputta, what does the ascetic Gotama say about this? What does he teach? How should we answer if we are to state what has been said by the ascetic Gotama and not misrepresent him with what is contrary to fact? And how should we explain in accordance with the Dhamma so that no reasonable consequence of our assertion would give ground for criticism?\"[n.72] A stock passage in the Nikāyas, recurring in SN in slightly different forms determined by the context, atSN12.25,12:26,SN22.2,22:86,SN5.81,42:1,SN44.2, andSN45.5. The readings alternate, even within the same volume, betweenvādānuvādoandvādānupāto,and it is uncertain which of the two is more original. The passage has stumped previous translators, mainly because of the phrasekoci sahadhammiko vādānupāto,which at KS 2:28 is rendered \"one who is of his doctrine, a follower of his views.\" To avoid such errors two meanings ofsahadhammikamust be distinguished: (i) a noun meaning a follower of the same doctrine (unambiguously so atMN I 64,1); and (ii) an adjective meaning legitimate, reasonable (unambiguously so atSN41.8; IV 299,25 foll.). Here the second meaning is applicable.Spkexplains: \"Howshould we answerso that not the slightest consequence or implication(vadanupato vadappavatti)of the ascetic Gotama's assertion—(a consequence) which is reasonable because of the reason stated(vutta-karaṇena sakaraṇo hutva)—might give ground for criticism?\" This is meant: \"How can there be no ground for criticism in any way of the ascetic Gotama's assertion?\" I dissent from Spk on what is to be safeguarded against criticism: Spk takes it to be the Buddha’s assertion, while I understand it to be the inquirer's account of the Buddha’s assertion. In other words, the inquirer wants to be sure he is representing the Buddha’s position correctly, whether or not he agrees with it.AtAN III 4,10ff.,19sahadhammikā vādānuvādā gārayhā ṭhānā āgacchantioccurs in a context where it means simply \"reasonable rebukes, grounds for criticism, come up,\" and is contrasted withsahadhammikā pāsaṁsā ṭhānā āgacchanti,\"reasonable grounds for praise come up.\"",
    "sn12.24:4": "\"Friends, the Blessed One has said that suffering is dependently arisen. Dependent on what? Dependent on contact. If one were to speak thus one would be stating what has been said by the Blessed One and would not misrepresent him with what is contrary to fact; one would explain in accordance with the Dhamma, and no reasonable consequence of one's assertion would give ground for criticism.",
    "sn12.24:5": "\"Therein, friends, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering is created by oneself, that is conditioned by contact.[n.73] On the expressiontadapi phassapaccayā,\"that (too) is conditioned by contact,\"Spksays that this may be known from the fact that there is no experience of suffering without contact. It seems to me, however, that the point being made here is not that suffering does not arise without contact (though this is true), but that the adoption of a view does not occur without contact. The Brahmajala Sutta states the same point in relation to the sixty-two speculative views—that the proclamation of each of these views is conditioned by contact and the views cannot be experienced without contact. SeeDN I 41–43, translated in Bodhi,All-Embracing Net of Views,pp. 8–87, with the commentary at pp. 197–98.Also, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering is created by another, that too is conditioned by contact. Also, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering is created both by oneself and by another, that too is conditioned by contact.sn.ii.34Also, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering has arisen fortuitously, being created neither by oneself nor by another, that too is conditioned by contact.",
    "sn12.24:6": "\"Therein, friends, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering is created by oneself, it is impossible that they will experienceanythingwithout contact. Also, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering is created by another, it is impossible that they will experienceanythingwithout contact. Also, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering is created both by oneself and by another, it is impossible that they will experienceanythingwithout contact. Also, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering has arisen fortuitously, being created neither by oneself nor by another, it is impossible that they will experienceanythingwithout contact.\"",
    "sn12.24:7": "The Venerable Ānanda heard this conversation between the Venerable Sāriputta and the wanderers of other sects. Then, when he had walked for alms in Rājagaha and had returned from the alms round, after his meal he approached the Blessed One, paid homage to him, sat down to one side, and reported to the Blessed One the entire conversation between the Venerable Sāriputta and those wanderers of other sects.The Blessed One said:",
    "sn12.24:8": "\"Good, good, Ānanda! Anyone answering rightly would answer just as Sāriputta has done. I have said, Ānanda, that suffering is dependently arisen. Dependent on what? Dependent on contact. If one were to speak thus one would be stating what has been said by me and would not misrepresent me with what is contrary to fact; one would explain in accordance with the Dhamma, and no reasonable consequence of one's assertion would give ground for criticism.",
    "sn12.24:9": "\"Therein, Ānanda, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering is created by oneself …sn.ii.35… and those who maintain that suffering has arisen fortuitously, being created neither by oneself nor by another, that too is conditioned by contact.",
    "sn12.24:10": "\"Therein, Ānanda, in the case of those ascetics and brahmins, proponents of kamma, who maintain that suffering is created by oneself … and those who maintain that suffering has arisen fortuitously, being created neither by oneself nor by another, it is impossible that they will experienceanythingwithout contact.",
    "sn12.24:11–16": "\"On one occasion, Ānanda, I was dwelling right here in Rājagaha, in the Bamboo Grove, the Squirrel Sanctuary. Then, in the morning, I dressed and, taking bowl and robe, I entered Rājagaha for alms. Then it occurred to me: ‘It is still too early to walk for alms in Rājagaha. Let me go to the park of the wanderers of other sects.’ Then I went to the park of the wanderers of other sects. I exchanged greetings with those wanderers and, when we had concluded our greetings and cordial talk, I sat down to one side. The wanderers then said to me as I was sitting to one side: …the wanderers ask exactly the same question as they had asked Sāriputta and receive an identical replysn.ii.36… it is impossible that they will experienceanythingwithout contact.\"",
    "sn12.24:17": "\"It is wonderful, venerable sir! It is amazing, venerable sir! How the entire meaning can be stated by a single phrase! Can this same meaning be stated in detail in a way that is deep and deep in implications?\"[n.74]Gambhiro c’ eva assa gambhīrāvabhāso ca.The same two terms are used atSN12.60and atDN II 55,9–10to describepaṭiccasamuppāda.For the explanation of Sv, see Bodhi,The Great Discourse on Causation,pp. 64–67.Spkexplains \"that same meaning\"(es’ ev’ attho)to be the meaning of dependent origination implicit in the proposition, \"Suffering is dependent on contact.\"",
    "sn12.24:18": "\"Well then, Ānanda, clear up that same matter yourself.\" \"Venerable sir, if they were to ask me: ‘Friend Ānanda, what is the source of aging-and-death, what is its origin, from what is it born and produced?’—being asked thus, I would answer thus: ‘Friends, aging-and-death has birth as its source, birth as its origin; it is born and produced from birth.’ Being asked thus, I would answer in such a way.sn.ii.37",
    "sn12.24:19–21": "\"Venerable sir, if they were to ask me: ‘Friend Ānanda, what is the source of birth, what is its origin, from what is it born and produced?’—being asked thus, I would answer thus: ‘Friends, birth has existence as its source, existence as its origin; it is born and produced from existence … . Existence has clinging as its source … Clinging has craving as its source … Craving has feeling as its source … Feeling has contact as its source … Contact has the six sense bases as its source, the six sense bases as its origin; it is born and produced from the six sense bases. But with the remainderless fading away and cessation of the six bases for contact comes cessation of contact; with the cessation of contact, cessation of feeling; with the cessation of feeling, cessation of craving; with the cessation of craving, cessation of clinging; with the cessation of clinging, cessation of existence; with the cessation of existence, cessation of birth; with the cessation of birth, aging-and-death, sorrow, lamentation, pain, displeasure, and despair cease. Such is the cessation of this whole mass of suffering.’ Being asked thus, venerable sir, I would answer in such a way.\""
}