{
    "sn12.2:1": "At Sāvatthī. \"Bhikkhus, I will teach you dependent origination and I will analyse it for you. Listen to that and attend closely, I will speak.\"",
    "sn12.2:2": "\"And what, bhikkhus, is dependent origination? With ignorance as condition, volitional formationscome to be; with volitional formations, consciousness …as in preceding sutta… Such is the origin of this whole mass of suffering.",
    "sn12.2:3": "\"And what, bhikkhus, is aging-and-death? The aging of the various beings in the various orders of beings, their growing old, brokenness of teeth, greyness of hair, wrinkling of skin, decline of vitality, degeneration of the faculties: this is called aging.sn.ii.The passing away of the various beings from the various orders of beings, their perishing, breakup, disappearance, mortality, death, completion of time, the breakup of the aggregates, the laying down of the carcass: this is called death.[n.2] Se adds, at the end of the definition of death,jīvitindriyassa upacchedo,which (according to a note in Be) is also found in the Thai and Cambodian eds. The fact thatSpkdoes not gloss this expression may be taken as evidence that it was not in the text available to the commentator. The expression is found, however, in the definition of death at Vibh 99,2–24 and is commented upon at Vibh-a 101,8–12.Spk: By the terms from \"passing away\" through \"completion of time\" he expounds death in worldly conventional terminology(lokasammutiya); by the expressions \"breakup of the aggregates\" and \"the laying down of the carcass\" he expounds death in the ultimate sense(paramattha). For in the ultimate sense it is only the aggregates that break up; there is no \"being\" that dies. When the aggregates are breaking up one says, \"A being is dying,\" and when they have broken up it is said, \"The being has died.\"Thus this aging and this death are together called aging-and-death.",
    "sn12.2:4": "\"And what, bhikkhus, is birth? The birth of the various beings into the various orders of beings, their being born, descentinto the womb, production, the manifestation of the aggregates, the obtaining of the sense bases. This is called birth.[n.3]Spk: From \"birth\" through \"production\" the teaching is conventional(voharadesana); the last two terms are an ultimate teaching(paramatthadesana). For in the ultimate sense it is only aggregates that become manifest, not a being.",
    "sn12.2:5": "\"And what, bhikkhus, is existence? There are these three kinds of existence: sense-sphere existence, form-sphere existence, formless-sphere existence. This is called existence.[n.4] On the meaning of bhava, see the General Introduction, pp. 2–3.Spk: In the exposition of existence, sense-sphere existence is both kamma-existence(kammabhava)and rebirth-existence(upapattibhava). Of these, kamma-existence is just kamma that leads to sense-sphere existence; for the kamma, being the cause for rebirth-existence in that realm, is spoken of as \"existence\" by assigning the name of the result to the cause. Rebirth-existence is the set of five kammically acquired aggregates produced by that kamma; for this is called \"existence\" in the sense that \"it comes to be there.\" The same method of explanation applies to form-sphere and formless-sphere existence (except that in formless-sphere rebirth-existence only the four mental aggregates exist).It should be noted that in interpreting the expressionupādānapaccaya bhavo,the commentaries takebhavaas eitherkammabhavaorupapattibhava,since both volitional activity and rebirth are conditioned by clinging; but in the expressionbhavapaccaya jati,they confine bhava tokammabhava,sinceupapattibhavaincludesjatiand thus cannot be a condition for it. See Vism 72–73 (Ppn 17:28–60) and Vism 7 (Ppn 17:270).",
    "sn12.2:6": "\"And what, bhikkhus, is clinging? There are these four kinds of clinging: clinging to sensual pleasures, clinging to views, clinging to rules and vows, clinging to a doctrine of self. This is called clinging.[n.5]Spkdefines clinging as tight grasping(upādānan ti daḷhaggahaṇaṁ vuccati). Definitions of the four kinds of clinging are at Dhs §§1214–17. In brief, clinging to sensual pleasures(kamupādāna)is identical with sensual desire, sensual lust, sensual delight, sensual craving, etc. Clinging to views(diṭṭhupādāna)is the adoption of any wrong view except those included in the third and fourth types of clinging; Dhs §1215 mentions as an example the nihilist view (seeSN24.5). The expressionsīlabbatupādānais often translated \"clinging to rites and rituals,\" but neither the canon nor commentaries supports this. I rendersīlaas rules andvataas vows, though the intention is actual modes of behaviour prescribed by rules and vows. The laconic definition at Dhs §1222 reads: \"Clinging to rules and vows is the view of ascetics and brahmins outside of here (i.e., outside the Buddhist fold) that purification is achieved by rules, by vows, by rules and vows\" (condensed). The reference is evidently to the various types of austerities that the Buddha’s contemporaries adopted in the belief that they lead to heaven or to ultimate purification. An example is the \"dog rule, dog vow\"(kukkurasīla, kukkuravata)atMN I 387,18–20; see too the common phrase,imina ’haṁ sīlena va vatena va tapena va brahmacariyena va devo va bhavissami devaññataro va(e.g., atMN I 102,10–11). Clinging to a doctrine of self(attavadupādāna)is defined by way of the twenty types of identity view(sakkāyadiṭṭhi), on which seeSN22.7, etc.",
    "sn12.2:7": "\"And what, bhikkhus, is craving? There are these six classes of craving: craving for forms, craving for sounds, craving for odours, craving for tastes, craving for tactile objects, craving for mental phenomena. This is called craving.",
    "sn12.2:8": "\"And what, bhikkhus, is feeling? There are these six classes of feeling: feeling born of eye-contact, feeling born of ear-contact, feeling born of nose-contact, feeling born of tongue-contact, feeling born of body-contact, feeling born of mind-contact. This is called feeling.",
    "sn12.2:9": "\"And what, bhikkhus, is contact? There are these six classes of contact: eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, mind-contact. This is called contact.",
    "sn12.2:10": "\"And what, bhikkhus, are the six sense bases? The eye base, the ear base, the nose base, the tongue base, the body base, the mind base. These are called the six sense bases.",
    "sn12.2:11": "\"And what, bhikkhus, is name-and-form? Feeling, perception, volition, contact, attention: this is called name. The foursn.ii.4great elements and the form derived from the four great elements: this is called form. Thus this name and this form are together called name-and-form.[n.6] On the translation ofnāmarūpa,see the General Introduction, pp. 47–49. Vism 558,23–28 (Ppn 17:187) explains that nama denotes the three aggregates—of feeling, perception, and volitional formations—which are called thus because of their \"bending\"(namana)on to an object (in the act of cognizing it). Volition, contact, and attention belong to the aggregate of volitional formations and, according toSpk, have been selected to represent that aggregate here because they are operative even in the weakest classes of consciousness.",
    "sn12.2:12": "\"And what, bhikkhus, is consciousness? There are these six classes of consciousness: eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, mind-consciousness. This is called consciousness.",
    "sn12.2:13": "\"And what, bhikkhus, are the volitional formations? There are these three kinds of volitional formations: the bodily volitional formation, the verbal volitional formation, the mental volitional formation. These are called the volitional formations.[n.7] On the translation ofsaṅkhāra,see the General Introduction, pp. 44–47.Spk: Volitional formations have the characteristic of forming(abhisaṅkhāraṇa). The bodily volitional formation is a volitional formation that occurs through the body; the term is a designation for the twenty kinds of bodily volition(kayasañcetana)—eight sense-sphere wholesome and twelve unwholesome—that motivate activity in the body door (see CMA 1:4–7, ). The verbal volitional formation is a volitional formation that occurs through speech; the term is a designation for the twenty kinds of verbal volition(vacisañcetana)that motivate verbal utterances (i.e., the same twenty kinds as mentioned just above, but expressed through speech rather than bodily action). The mental volitional formation is a volitional formation that occurs through the mind; the term is a designation for the twenty-nine mundane wholesome and unwholesome mental volitions(manosañcetana)that occur privately in thought without motivating action in the doors of body and speech. (The additional nine volitions are the five of the form-sphere and four of the formless-sphere cittas, states of purely meditative experience; see CMA 1:18, 22.)This triad ofsaṅkhārashould not be confused with the triad discussed atSN41.6. I have added \"volitional\" to the present set to distinguish them from the other, though the Pali terms are identical. The latter triad is always introduced in relation to the cessation of perception and feeling and is never brought into connection with dependent origination.",
    "sn12.2:14": "\"And what, bhikkhus, is ignorance? Not knowing suffering, not knowing the origin of suffering, not knowing the cessation of suffering, not knowing the way leading to the cessation of suffering. This is called ignorance.[n.8] This definition shows that ignorance, as the most basic cause of saṁsaric existence, is lack of knowledge of the Four Noble Truths. Although in popular accounts ignorance is often identified with the idea of self, the definitions here show that the view of self is an aspect of clinging, which is itself conditioned by craving, while the latter is in turn conditioned by ignorance.",
    "sn12.2:15": "\"Thus, bhikkhus, with ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering. But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering.\"[n.9]Spk: By the term \"cessation\" in all these phrases Nibbāna is being expounded. For all those phenomena cease in dependence on Nibbāna, and therefore the latter is spoken of as their cessation. Thus in this sutta the Blessed One taught the round of existence(vaṭṭa)and the ending of the round(vivaṭṭa)by twelve phrases and brought the discourse to a climax in arahantship."
}