{
    "sn12.35:1": "At Sāvatthī. \"Bhikkhus, with ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering.\"",
    "sn12.35:2": "\"Venerable sir, what now is birth, and for whom is there this birth?\"",
    "sn12.35:3": "\"Venerable sir, what now is existence, and for whom is there this existence?\"",
    "sn12.35:4": "\"Venerable sir, what now are volitional formations, and for whom are there these volitional formations?\"",
    "sn12.35:5": "\"But with the remainderless fading away and cessation of ignorance, whatever kinds of contortions, manoeuvres, and vacillations there may be[n.108] I read with Be:yāni ’ssa tāni visūkāyikāni visevitāni vipphanditāni kānici kānici.Se is almost the same, but the orthography in Ee is very unsatisfactory.Spkexplains that the three nouns are all synonyms for wrong view. This is called a contortion(visūkāyika)because it is an obstruction to oneself, being like a spike(visūkam iva;Spk-pṭ: =kaṇṭaka,a thorn)in the sense that it punctures right view(sammādiṭṭhiya vinivijjhanaṭṭhena). It is a manoeuvre(visevita)because it fails to conform to right view but instead runs contrary to it; and a vacillation(vipphandita)because of grasping now annihilationism, now eternalism.Spk takesvisūkāyikato be related tosūci,needle, but it would be difficult to justify this derivation by the actual use of the term. The three synonyms also occur atSN4.24(I 123,30–31) andMN I 234,19–20; atMN I 446,12–13they describe the behaviour of an untrained horse.—‘What now is aging-and-death, and for whom is there this aging-and-death?’ or ‘Aging-and-death is one thing, the one for whom there is this aging-and-death is another,’ or ‘The soul and the body are the same,’ or ‘The soul is one thing, the body is another’—all these are abandoned, cut off at the root, made like a palm stump, obliterated so that they are no more subject to future arising.[n.109] Spk glossestālāvatthukatāniastālavatthu viya katāni,\"made like a palm-base,\" and explains: \"Made like a palm with cut-off head (i.e., a palm stump) in the sense of never growing again; and made like a place for the support of a palm after it has been extricated along with its root\"(puna aviruhaṇaṭṭhena matthakacchinnatālo viya samūlaṁ tālaṁ uddharitvā tassa patiṭṭhitaṭṭhānaṁ viya ca katāni).Spk-pṭ first accepts the original readingtālāvatthu. Spk-pṭ first accepts the original reading tālāvatthu (lit. \"palm-nonbase\") as it stands and explains: \"The palm itself is the ‘palm-non-base’ because it is not a base for leaves, flowers, fruit, and sprouts. But some readtālāvatthukatāni, which means: ‘made like a palm because of being without a base.’\"",
    "sn12.35:6–8": "\"With the remainderless fading away and cessation of ignorance, whatever kinds of contortions, manoeuvres, and vacillations there may be—‘What now is birth, and for whom is there this birth?’…sn.ii.63… ‘What now are volitional formations, and for whom are there these volitional formations?’ or ‘Volitional formations are one thing, the one for whom there are these volitional formations is another,’ or ‘The soul and the body are the same,’ or ‘The soul is one thing, the body is another’—all these are abandoned, cut off at the root, made like a palm stump, obliterated so that they are no more subject to future arising.\""
}