{
    "sn12.65:1": "At Sāvatthī. \"Bhikkhus, before my enlightenment, while I was still a bodhisatta, not yet fully enlightened, it occurred to me: ‘Alas, this world has fallen into trouble, in that it is born, ages, and dies, it passes away and is reborn, yet it does not understand the escape from this sufferingheaded byaging-and-death. When now will an escape be discerned from this sufferingheaded byaging-and-death?’[n.75] Opening as atSN2.0.",
    "sn12.65:2": "\"Then, bhikkhus, it occurred to me: ‘When what exists does birth come to be? … existence? … clinging? … craving? … feeling? … contact? … the six sense bases? … name-and-form? By what is name-and-form conditioned?’ Then, bhikkhus, through careful attention, there took place in me a breakthrough by wisdom: ‘When there is consciousness, name-and-form comes to be; name-and-form has consciousness as its condition.’",
    "sn12.65:3": "\"Then, bhikkhus, it occurred to me: ‘This consciousness turns back; it does not go further than name-and-form.[n.177] This consciousness turns back(paccudavāttati kho idaṁ viññāṇaṁ).Spk: What is the consciousness that turns back here? The rebirth-consciousness and the insight-consciousness. Rebirth-consciousness turns back from its condition, insight-consciousness from its object. Neither overcomes name-and-form, goes further than name-and-form.Spk-pṭ: From its condition: Rebirth-consciousness turns back from volitional formations—the special cause for consciousness—which has not been mentioned; it does not turn back from all conditions, as name-and-form is stated as the condition for consciousness. From its object: from ignorance and volitional formations as object, or from the past existence as object.It it possible the Bodhisatta had been seeking a self of the Upaniṣadic type, a self-subsistent subject consisting of pure consciousness that requires nothing but itself in order to exist. His discovery that consciousness is invariably dependent on name-and-form would have disclosed to him the futility of such a quest and thereby shown that even consciousness, the subtlest basis for the sense of self (seeSN12.61), is conditioned and thus marked by impermanence, suffering, and selflessness.It is to this extent that one may be born and age and die, pass away and be reborn, that is, when there is consciousness with name-and-form as its condition, and name-and-form with consciousness as its condition.[n.178]Spk: To this extent one may be born(ettavātā jāyetha vā), etc.: With consciousness as a condition for name-and-form, and with name-and-form as a condition for consciousness, to this extent one may be born and undergo rebirth. What is there beyond this that can be born or undergo rebirth? Isn’t it just this that is born and undergoes rebirth?Spk-pṭ: To this extent: that is, by the occurrence of consciousness and name-and-form mutually supporting one another. One may be born and undergo rebirth: Though the expression \"A being is born and undergoes rebirth\" is used, there is nothing that serves as the referent of the designation \"a being\" apart from consciousness and name-and-form. Hence the commentator says, \"What is there beyond this?\" Just this(etadeva): namely, the pair consciousness and name-and-form.It might be noted thatjāyetha, jīyetha,etc., are middle-voice optatives in the third person singular. At KS 2:7, C.Rh.D seems to have mistaken them for second person plural optatives in the active voice, while at LDB, pp. 211, 226, Walshe has used a roundabout rendering, presumably to avoid having to identify the forms. For a detailed discussion of the mutual conditionality of consciousness and name-and-form, see Bodhi,The Great Discourse on Causation,pp. 18–22.With name-and-form as condition, the six sense bases; with the six sense bases as condition, contact … .sn.ii.105Such is the origin of this whole mass of suffering.’",
    "sn12.65:4": "\"Then, bhikkhus, it occurred to me: ‘When what does not exist does aging-and-death not come to be? With the cessation of what does the cessation of aging-and-death come about?’ Then, bhikkhus, through careful attention, there took place in me a breakthrough by wisdom: ‘When there is no birth, aging-and-death does not come to be; with the cessation of birth comes cessation of aging-and-death.’",
    "sn12.65:5": "\"It occurred to me: ‘When what does not exist does consciousness not come to be? With the cessation of what does the cessation of consciousness come about?’ Then, bhikkhus, through careful attention, there took place in me a breakthrough by wisdom: ‘When there is no name-and-form, consciousness does not come to be; with the cessation of name-and-form comes cessation of consciousness.’",
    "sn12.65:6": "\"Then, bhikkhus, it occurred to me: ‘I have discovered this path to enlightenment, that is, with the cessation of name-and-form comes cessation of consciousness; with the cessation of consciousness comes cessation of name-and-form; with the cessation of name-and-form, cessation of the six sense bases; with the cessation of the six sense bases, cessation of contact … . Such is the cessation of this whole mass of suffering.’[n.179] The mutual cessation of consciousness and name-and-form is also found in the version atDN II 34,21–35,13.Spkdoes not comment on the expression \"I have discovered the path to enlightenment\"(adhigato kho myāyaṁ maggo bodhāya), but the corresponding passage of DN is commented upon at Sv II 41,5–8 thus: \"Path: the path of insight. To enlightenment: for the awakening to the Four Noble Truths, or for the awakening to Nibbāna. Further, enlightenment is so called because it becomes enlightened(bujjhat ti bodhi); this is a name for the noble path. What is meant is (that he has discovered the path) for the sake of that. For the noble path is rooted in the path of insight. Now, making that path explicit, he says, ‘With the cessation of name-and-form,’ and so forth.\"This explanation hinges upon the distinction (only implicit in the Nikāyas) between the mundane preliminary portion of the path(pubbabhāgapaṭipadā), which is the \"path of insight,\" and the noble supramundane path(lokuttaramagga), which directly realizes Nibbāna. Since the supramundane path is identical with enlightenment, the commentary holds that \"the path to enlightenment\" the Bodhisatta discovered must be the mundane path of insight. In the DN version, having discovered the path to enlightenment, the Bodhisatta Vipassi continues to contemplate the rise and fall of the five aggregates, as a result of which \"his mind was liberated from the taints by not clinging.\"",
    "sn12.65:7": "\"Suppose, bhikkhus, a man wandering through a forest would see an ancient path, an ancient road travelled upon by people in the past. He would follow it and would see an ancient city, an ancient capitalsn.ii.106that had been inhabited by people in the past, with parks, groves, ponds, and ramparts, a delightful place. Then the man would inform the king or a royal minister: ‘Sire, know that while wandering through the forest I saw an ancient path, an ancient road travelled upon by people in the past. I followed it and saw an ancient city, an ancient capital that had been inhabited by people in the past, with parks, groves, ponds, and ramparts, a delightful place. Renovate that city, sire!’ Then the king or the royal minister would renovate the city, and some time later that city would become successful and prosperous, well populated, filled with people, attained to growth and expansion.",
    "sn12.65:8": "\"So too, bhikkhus, I saw the ancient path, the ancient road travelled by the Perfectly Enlightened Ones of the past.[n.10]Spkelaborates minutely upon the parable of the ancient city and then draws extensive correspondences between the elements of the parable and their counterparts in the Dhamma.And what is that ancient path, that ancient road? It is just this Noble Eightfold Path; that is, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. I followed that path and by doing so I have directly known aging-and-death, its origin, its cessation, and the way leading to its cessation. I have directly known birth … existence … clinging … .craving … feeling … contact … the six sense bases …. name-and-form … consciousness … volitional formations, their origin, their cessation, and the way leading to their cessation.[n.11] At this pointsaṅkhārā,omitted earlier, are finally introduced, andavijjā, their condition, is implied by the mention of \"their origin.\"sn.ii.107Having directly known them, I have explained them to the bhikkhus, the bhikkhunīs, the male lay followers, and the female lay followers. This holy life, bhikkhus, has become successful and prosperous, extended, popular, widespread, well proclaimed among devas and humans.\"[n.12] This passage is also atSN51.10. I follow Spk in its explanation ofyāva devamanussehi suppakāsitaṁ.The point is that, despite the use of the instrumental form -ehi, the Dhamma is not proclaimed by devas and humans, but \"throughout the region (inhabited) by devas and humans in the ten-thousandfold galaxy, within this extent it is well proclaimed, well taught, by the Tathāgata\"(yāva dasasahassacakkavaḷe devamanussehi paricchedo atthi, etasmiṁ antare suppakāsitaṁ sudesitaṁ tathāgatena). It is possible -ehi here is a vestigial Eastern locative plural; see Geiger,Pali Grammar,§0.3."
}