{
    "sn12.68:1": "On one occasion the Venerable Musīla, the Venerable Saviṭṭha, the Venerable Nārada, and the Venerable Ānanda were living at Kosambı in Ghosita's Park.[n.97]Spkdoes not identify these elders. Saviṭṭha appears atAN I 8-9, Nārada atAN III 57-62.",
    "sn12.68:2-4": "\"Friend Musīla, apart from faith … apart from acceptance of a view after pondering it, does the Venerable Musīla have personal knowledge thus: ‘With existence as condition, birth’? … ‘With ignorance as condition, volitional formations’?\"\"Friend Saviṭṭha, apart from faith … apart from acceptance of a view after pondering it, I know this, I see this: ‘With ignorance as condition, volitional formations.’\"\"Friend Musīla, apart from faith … apart from acceptance of a view after pondering it, does the Venerable Musīla have personal knowledge: ‘With the cessation of birth comes cessation of aging-and-death’? …sn.ii.117… ‘With the cessation of ignorance comes cessation of volitional formations’?\"\"Friend Saviṭṭha, apart from faith …. apart from acceptance of a view after pondering it, I know this, I see this: ‘With the cessation of birth comes cessation of aging-and-death.’ … ‘With the cessation of ignorance comes cessation of volitional formations.’\"",
    "sn12.68:5": "\"Friend Musīla, apart from faith, apart from personal preference, apart from oral tradition, apart from reasoned reflection, apart from acceptance of a view after pondering it, does the Venerable Musīla have personal knowledge thus: ‘Nibbāna is the cessation of existence’?\"[n.199]Bhavanirodho nibbānaṁ.Spk: Nibbāna is the cessation of the five aggregates.",
    "sn12.68:6": "\"Then the Venerable Musīla is an arahant, one whose taints are destroyed.\"",
    "sn12.68:7–12": "Then the Venerable Nārada said to the Venerable Saviṭṭha: \"Friend Saviṭṭha, it would be good if I were asked that series of questions. Ask me that series of questions and I will answer you.\"[n.201]Spk: Why did he speak up? It is said that he reflected thus: \"This proposition—‘Nibbāna is the cessation of existence’—can be understood even by trainees. But this elder (Saviṭṭha) places that one (Musila) on the plane of the arahant. I will make him understand this matter correctly.\"",
    "sn12.68:13": "\"Then the Venerable Nārada is an arahant, one whose taints are destroyed.\"sn.ii.118",
    "sn12.68:14": "When this was said, the Venerable Ānanda asked the Venerable Saviṭṭha: \"When he speaks in such a way, friend Saviṭṭha, what would you say about the Venerable Nārada?\""
}