{
    "sn12.34:1": "At Sāvatthī. \"Bhikkhus, I will teach you seventy-seven cases of knowledge. Listen to that and attend closely, I will speak.\"sn.ii.60",
    "sn12.34:2": "\"Bhikkhus, what are the seventy-seven cases of knowledge? The knowledge: ‘Aging-and-death has birth as its condition.’ The knowledge: ‘When there is no birth, there is no aging-and-death.’ The knowledge: ‘In the past too aging-and-death had birth as its condition.’ The knowledge: ‘In the past too, had there been no birth, there would have been no aging-and-death.’ The knowledge: ‘In the future too aging-and-death will have birth as its condition.’ The knowledge: ‘In the future too, should there be no birth, there will be no aging-and-death.’ The knowledge: ‘That knowledge of the stability of the Dhamma is also subject to destruction, vanishing, fading away, and cessation.’[n.105]Spk: The knowledge of the stability of the Dhamma(dhammaṭṭhitiñāṇa)is the knowledge of the principle of conditionality. For the principle of conditionality is called \"the stability of the Dhamma\" because it is the cause for the continued occurrence of phenomena(pavattiṭṭhitikāraṇattā); the knowledge of it is \"the knowledge of the stability of the Dhamma.\" This is a designation for just this sixfold knowledge.I renderdhammaṭṭhitatā(atSN1.0; n.51) \"stableness of the Dhamma\" anddhammaṭṭhiti\"stability of the Dhamma.\" The latter also occurs atSN1.70(II 14,10). The two seem to be effectively synonymous.The knowledge that this knowledge too is subject to destruction is called bySpk\"counter-insight into insight\"(vipassanā-paṭivipassanā), i.e., insight into the dissolution of the very act of insight knowledge that had just cognized the dissolution of the primary object. See Vism 641–4 (Ppn 1:11–13), where, however, the expressionvipassanāpaṭivipassanādoes not occur.",
    "sn12.34:3": "\"The knowledge: ‘Birth has existence as its condition.’ … The knowledge: ‘Volitional formations have ignorance as their condition. ’ The knowledge: ‘When there is no ignorance, there are no volitional formations.’ The knowledge: ‘In the past too volitional formations had ignorance as their condition.’ The knowledge: ‘In the past too, had there been no ignorance, there would have been no volitional formations.’ The knowledge: ‘In the future too volitional formations will have ignorance as their condition.’ The knowledge: ‘In the future too, should there be no ignorance, there will be no volitional formations.’ The knowledge: ‘That knowledge of the stability of the Dhamma is also subject to destruction, vanishing, fading away, and cessation.’"
}