{
    "sn12.18:1": "At Sāvatthī. Then the wanderer Timbaruka approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to him:",
    "sn12.18:2": "\"How is it, Master Gotama: are pleasure and pain created by oneself?\"[n.45]Spk: In this sutta pleasure and pain as feeling(vedanasukhadukkha)are being discussed; it is also acceptable to say the subject is resultant pleasure and pain(vipakasukhadukkha).",
    "sn12.18:3": "\"Whether you are asked: ‘How is it, Master Gotama: are pleasure and pain created by oneself?’ or ‘Are they created by another? ’sn.ii.2or ‘Are they created by both?’ or ‘Are they created by neither?’ in each case you say: ‘Not so, Timbaruka.’ When you are asked: ‘How is it then, Master Gotama: is there no pleasure and pain?’ you say: ‘It is not that there is no pleasure and pain, Timbaruka; there is pleasure and pain.’ When asked: ‘Then is it that Master Gotama does not know and see pleasure and pain?’ you say: ‘It is not that I do not know and see pleasure and pain, Timbaruka. I know pleasure and pain, I see pleasure and pain.’ Venerable sir, let the Blessed One explain pleasure and pain to me. Let the Blessed One teach me about pleasure and pain.\"",
    "sn12.18:4": "\"Timbaruka,if one thinks,‘The feeling and the one who feels it are the same,’then one assertswith reference to one existing from the beginning: ‘Pleasure and pain are created by oneself.’ I do not speak thus.[n.6]Spk: If at the beginning (one thinks), \"The feeling and the one who feels it are the same,\" there then comes the belief, \"Pleasure and pain are created by oneself.\" For in this case feeling is created by feeling itself, and asserting thus one admits the existence of this feeling already in the past. One declares eternalism, grasps hold of eternalism.But, Timbaruka,if one thinks,‘The feeling is one, the one who feels it is another,’then one assertswith reference to one stricken by feeling: ‘Pleasure and pain are created by another.’ Neither do I speak thus.[n.7] Spk: If at the beginning (one thinks), \"The feeling is one, the one who feels it is another,\" there then comes the belief, \"Pleasure and pain are created by another,\" held by one stricken by the feeling associated with the annihilationist view that arises thus: \"The feeling of the agent(karakavedana)in the past has been annihilated, and someone else (‘another’) experiences (the result) of his deeds.\" Asserting thus, one declares and grasps the annihilationist view that the agent is annihilated and rebirth is taken by someone else.Without veering towards either of these extremes, the Tathāgata teaches the Dhamma by the middle: ‘With ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering. But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering.’\"",
    "sn12.18:5": "When this was said, the naked ascetic Timbaruka said to the Blessed One: \"Magnificent, Master Gotama! … I go for refuge to Master Gotama, and to the Dhamma, and to the Bhikkhu Saṅgha. From today let Master Gotama remember me as a lay follower who has gone for refuge for life.\""
}