{
    "sn12.10:1": "\"Bhikkhus, before my enlightenment, while I was still a bodhisatta, not yet fully enlightened, it occurred to me: ‘Alas, this world has fallen into trouble, in that it is born, ages, and dies, it passes away and is reborn, yet it does not understand the escape from this sufferingheaded byaging-and-death. When now will an escape be discerned from this sufferingheaded byaging-and-death?’",
    "sn12.10:2": "\"Then, bhikkhus, it occurred to me: ‘When what exists does aging-and-death come to be? By what is aging-and-death conditioned? ’ Then, bhikkhus, through careful attention, there took place in me a breakthrough by wisdom:[n.13]Yoniso manasikara ahu paññāya abhisamayo.The commentaries consistently glossyoniso manasikaraasupayamanasikara, pathamanasikara,\"attention that is the right means, attention on the (right) course.\"There took place (in me)a breakthrough by wisdom.Spk: There was a breakthrough, a concurrence, a conjunction of the reason for aging-and-death together with wisdom(paññāya saddhiṁ jaramaraṇākārāṇassa abhisamayo samavayo samayogo); the meaning is that it was seen by him, \"Aging-and-death has birth as its condition.\" Or alternatively, the sense can be construed thus: Through careful attention and wisdom there took place a breakthrough(yoniso manasikarena ca paññāya ca abhisamayo ahu). The meaning is that the penetration of aging-and-death occurred thus, \"When there is birth, aging-and-death comes to be.\"The first of these explanations is improbable, and even the second is unsatisfactory in construing careful attention and wisdom as joint causes. In general sutta usageyoniso manasikarais the forerunner ofpaññā,whilepaññāis the efficient cause ofabhisamaya.As a technical term,abhisamayaappears in the Nikāyas in two main contexts: (i) As signifying the initial breakthrough to the Dhamma,dhammabhisamaya,it is identical with the obtaining of the vision of the Dhamma(dhammacakkhupaṭilabha), and thus with the attainment of stream-entry; seeSN13.1(II 134,4–5). (ii) As signifying the complete breaking through of conceit(samma manabhisamaya)it is equivalent to the attainment of arahantship; seeSN36.5(IV 07,14–15) and I, v.75c. A third suttanta use is to denote the Buddha’s discovery of the Dhamma, as here and in the verb formabhisametiatSN1.0below. In the commentariesabhisamayais synonymous withpaṭivedha,penetration, both terms being used interchangeably to characterize the four functions of the supramundane path; see Vism 689–91 (Ppn :9–97).‘When there is birth, aging-and-death comes to be; aging-and-death has birth as its condition.’[n.14] The two statements about the origination of aging-and-death from birth correspond respectively to the two forms of the abstract principle of conditionality. The abstract formula occurs atSN1.1,,49,50,61, and6, with a variant atSN1.41. See below n.59. From this it would evidently be a mistake to insist that the formulation in terms of existence(sati … hoti)relates to synchronic conditionality while the formulation in terms of arising(uppada … uppajjati)relates to diachronic conditionality. Since both apply to every pair of factors, they seem to be alternative ways of expressing the conditioning relationship, either of which subsumes under itself all possible modes of conditionality in their wide variety.",
    "sn12.10:3": "\"Then, bhikkhus, it occurred to me: ‘When what exists does birth come to be? By what is birth conditioned?’ Then, bhikkhus, through careful attention, there took place in me a breakthrough by wisdom: ‘When there is existence, birth comes to be; birth has existence as its condition.’",
    "sn12.10:4": "\"Thus with ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering.",
    "sn12.10:6": "\"Then, bhikkhus, it occurred to me:sn.ii.11‘When what does not exist does birth not come to be? By the cessation of what does the cessation of birth come about?’ Then, bhikkhus, through careful attention, there took place in me a breakthrough by wisdom: ‘When there is no existence, birth does not come to be; with the cessation of existence comes cessation of birth.’ … ‘When there is no clinging, existence does not come to be; with the cessation of clinging comes cessation of existence.’ … ‘When there is no craving, clinging does not come to be; with the cessation of craving comes cessation of clinging.’ … ‘When there is no feeling, craving does not come to be; with the cessation of feeling comes cessation of craving.’ … ‘When there is no contact, feeling does not come to be; with the cessation of contact comes cessation of feeling.’ … ‘When there are no six sense bases, contact does not come to be; with the cessation of the six sense bases comes cessation of contact. ’ … ‘When there is no name-and-form, the six sense bases do not come to be; with the cessation of name-and-form comes cessation of the six sense bases.’ … ‘When there is no consciousness, name-and-form does not come to be; with the cessation of consciousness comes cessation of name-and-form.’ … ‘When there are no volitional formations, consciousness does not come to be; with the cessation of volitional formations comes cessation of consciousness.’ … ‘When there is no ignorance, volitional formations do not come to be; with the cessation of ignorance comes cessation of volitional formations.’",
    "sn12.10:7": "\"Thus with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering."
}