{
    "sn12.64:1": "At Sāvatthī. \"Bhikkhus, there are these four kinds of nutriment for the maintenance of beings that have already come to be and for the assistance of those about to come to be. What four? The nutriment edible food, gross or subtle; second, contact; third, mental volition; fourth, consciousness. These are the four kinds of nutriment for the maintenance of beings that have already come to be and for the assistance of those about to come to be.",
    "sn12.64:2": "\"If, bhikkhus, there is lust for the nutriment edible food, if there is delight, if there is craving, consciousness becomes established there and comes to growth.[n.170]Spkexplains lust(rāga), delight(nandi), and craving(taṇhā)as synonyms for greed(lobha). Consciousness becomes established there and comes to growth(patiṭṭhitaṁ tattha viññāṇaṁ virūḷhaṁ): having impelled a kamma, it \"becomes established and comes to growth\" through its ability to drag along a rebirth. On the establishing of consciousness, seeSN1.38and n.11, and on the descent of name-and-form,SN1.39and n.115.Wherever consciousness becomes established and comes to growth, there is a descent of name-and-form.[n.171] Spk: Wherever(yattha)is a locative referring to the round of existence with its three planes. Or else, in all instances, this locative is used with reference to the correlative term in the preceding phrase. (Spk-pṭ: This locative expressionyattha … tatthais used with reference to each preceding phrase, which is its sphere of application.)Where there is a descent of name-and-form, there is the growth of volitional formations.[n.17]Atthi tattha saṅkhārānaṁ vuddhi.Spk: This is said with reference to the volitional formations that are the cause of a future round of existence for one abiding in the present round of results.The variation here on the usual sequence is very interesting. When \"the growth of volitional formations\" is placed between name-and-form and future existence, this implies that the expression corresponds to three critical terms of the standard formula—craving, clinging, and(kamma-)existence—withāyatiṁ punabbhavābhinibbattisignifying the process of entering the new existence.Where there is the growth of volitional formations, there is the production of future renewed existence. Where there is the production of future renewed existence, there is future birth, aging, and death. Where there is future birth, aging, and death, I say that is accompanied by sorrow, anguish, and despair.",
    "sn12.64:3": "\"If, bhikkhus, there is lust for the nutriment contact, or for the nutriment mental volition, or for the nutriment consciousness, if there is delight, if there is craving, consciousness becomes established there and comes to growth. Wherever consciousness becomes established and comes to growth … I say that is accompanied by sorrow, anguish, and despair.",
    "sn12.64:4": "\"Suppose, bhikkhus, an artist or a painter, using dye or lac or turmeric or indigo or crimson,sn.ii.102would create the figure of a man or a woman complete in all its features on a well-polished plank or wall or canvas. So too, if there is lust for the nutriment edible food, or for the nutriment contact, or for the nutriment mental volition, or for the nutriment consciousness, if there is delight, if there is craving, consciousness becomes established there and comes to growth. Wherever consciousness becomes established and comes to growth … I say that is accompanied by sorrow, anguish, and despair.[n.173]Spk: The painter represents kamma with its adjuncts (Spkpṭ: craving and ignorance, and time and destination, etc.); the panel, wall, or canvas represents the round with its three realms. As the painter creates a figure on the panel, so kamma with its adjuncts creates a form in the realms of existence. As the figure created by an unskilled painter is ugly, deformed, and disagreeable, so the kamma performed with a mind dissociated from knowledge gives rise to an ugly, deformed, disagreeable figure. But as the figure created by a skilled painter is beautiful and well shaped, so the kamma performed with a mind associated with knowledge gives rise to a beautiful and comely figure.",
    "sn12.64:5–7": "\"If, bhikkhus, there is no lust for the nutriment edible food, orsn.ii.103for the nutriment contact, or for the nutriment mental volition, or for the nutriment consciousness, if there is no delight, if there is no craving, consciousness does not become established there and come to growth. Where consciousness does not become established and come to growth, there is no descent of name-and-form. Where there is no descent of name-and-form, there is no growth of volitional formations. Where there is no growth of volitional formations, there is no production of future renewed existence. Where there is no production of future renewed existence, there is no future birth, aging, and death. Where there is no future birth, aging, and death, I say that is without sorrow, anguish, and despair.",
    "sn12.64:8": "\"Suppose, bhikkhus, there was a house or a hall with a peaked roof, with windows on the northern, southern, and eastern sides. When the sun rises and a beam of light enters through a window, where would it become established?\"",
    "sn12.64:9": "… for the nutriment contact … for the nutriment mental volition … for the nutriment consciousness … consciousness does not become established there and come to growth. Where consciousness does not become established and come to growth …sn.ii.104… I say that is without sorrow, anguish, and despair.\"[n.174]Spk: The kamma of the arahant is similar to the sunbeam. However, the sunbeam does exist, but because there is no place for it to settle it is said to be unestablished(appatiṭṭhitā). But the arahant's kamma is said to be unestablished because it is nonexistent. Although he has a body, etc., no wholesome or unwholesome kamma is thereby created. His deeds are merely functional, not productive of results(kiriyamatte ṭhatvā avipākaṁ hoti). In this connection, seeSN12.25and n.81.It should be noted that Spk explains the statement that the arahant's consciousness is unestablished to mean that his kamma is unestablished. This seems too free an interpretation. Nevertheless, I think it would be wrong to interpret the sutta as saying that after his parinibbāna the arahant's consciousness persists in some mode that can only be described as unestablished. The present passage is clearly speaking of the arahant's consciousness while he is alive. Its purport is not that an \"unestablished consciousness\" remains after the arahant's parinibbāna, but that his consciousness, being devoid of lust, does not \"become established in\" the four nutriments in any way that might generate a future existence."
}