{
    "sn12.15:1": "At Sāvatthī.sn.ii.7Then the Venerable Kaccanagotta approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Venerable sir, it is said, ‘right view, right view.’ In what way, venerable sir, is there right view?\"",
    "sn12.15:2": "\"This world, Kaccāna, for the most part depends upon a duality[n.9]Dvayanissito khvayaṁ Kaccāna loko yebhuyyena atthitañ c’ eva natthitañ ca.Spk: \"For the most part\"(yebhuyyena)means: for the great multitude, with the exception of the noble individuals(ariyapuggala). The notion of existence(atthita)is eternalism(sassata); the notion of nonexistence(natthita)is annihilationism(uccheda). Spk-pṭ: The notion of existence is eternalism because it maintains that the entire world (of personal existence) exists forever. The notion of nonexistence is annihilationism because it maintains that the entire world does not exist (forever) but is cut off.In view of these explanations it would be misleading to translate the two terms,atthitaandnatthita,simply as \"existence\" and \"nonexistence\" and then to maintain (as is sometimes done) that the Buddha rejects all ontological notions as inherently invalid. The Buddha’s utterances atSN.94, for example, show that he did not hesitate to make pronouncements with a clear ontological import when they were called for. In the present passageatthitaandnatthitaare abstract nouns formed from the verbsatthiandnatthi. It is thus the metaphysical assumptions implicit in such abstractions that are at fault, not the ascriptions of existence and nonexistence themselves. I have tried to convey this sense of metaphysical abstraction, conveyed in Pali by the terminal-ta,by rendering the two terms \"the notion of existence\" and \"the notion of nonexistence,\" respectively. On the two extremes rejected by the Buddha, seeSN1.48, and for the Buddha’s teaching on the origin and passing away of the world,SN1.44.Unfortunately,atthitaandbhavaboth had to be rendered by \"existence,\" which obscures the fact that in Pali they are derived from different roots. Whileatthitais the notion of existence in the abstract,bhavais concrete individual existence in one or another of the three realms. For the sake of marking the difference,bhavamight have been rendered by \"being\" (as was done in MLDB), but this English word, I feel, is too broad (suggestive of \"Being,\" the absolute object of philosophical speculation) and does not sufficiently convey the sense of concreteness intrinsic tobhava.But for one who sees the origin of the world as it really is with correct wisdom, there is no notion of nonexistence in regard to the world. And for one who sees the cessation of the world as it really is with correct wisdom, there is no notion of existence in regard to the world.[n.30]Spk: The origin of the world: the production of the world of formations. There is no notion of nonexistence in regard to the world: there does not occur in him the annihilationist view that might arise in regard to phenomena produced and made manifest in the world of formations, holding \"They do not exist.\" Spk-pṭ: The annihilationist view might arise in regard to the world of formations thus: \"On account of the annihilation and perishing of beings right where they are, there is no persisting being or phenomenon.\" It also includes the wrong view, having those formations as its object, which holds: \"There are no beings who are reborn.\" That view does not occur in him; for one seeing with right understanding the production and origination of the world of formations in dependence on such diverse conditions as kamma, ignorance, craving, etc., that annihilationist view does not occur, since one sees the uninterrupted production of formations.Spk: The cessation of the world: the dissolution(bhanga)of formations. There is no notion of existence in regard to the world: There does not occur in him the eternalist view which might arise in regard to phenomena produced and made manifest in the world of formations, holding \"They exist.\" Spk-pṭ: The eternalist view might arise in regard to the world of formations, taking it to exist at all times, owing to the apprehension of identity in the uninterrupted continuum occurring in a cause-effect relationship. But that view does not occur in him; because he sees the cessation of the successively arisen phenomena and the arising of successively new phenomena, the eternalist view does not occur.Spk: Further, \"the origin of the world\" is direct-order conditionality(anuloma-paccayakara); \"the cessation of the world,\" reverse-order conditionality(paṭiloma-paccayakara). (Spk-pṭ: \"Direct-order conditionality\" is the conditioning efficiency of the conditions in relation to their own effects; \"reverse-order conditionality\" is the cessation of the effects through the cessation of their respective causes.) For in seeing the dependency of the world, when one sees the nontermination of the conditionally arisen phenomena owing to the nontermination of their conditions, the annihilationist view, which might otherwise arise, does not occur. And in seeing the cessation of conditions, when one sees the cessation of the conditionally arisen phenomena owing to the cessation of their conditions, the eternalist view, which might otherwise arise, does not occur.",
    "sn12.15:3": "\"‘All exists’: Kaccāna, this is one extreme. ‘All does not exist’: this is the second extreme. Without veering towards either of these extremes, the Tathāgata teaches the Dhamma by the middle: ‘With ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering. But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering.\"sn.ii.18"
}