{
    "sn12.39:1": "At Sāvatthī. \"Bhikkhus, what one intends, and what one plans, and whatever one has a tendency towards: this becomes a basis for the maintenance of consciousness. When there is a basis, there is a support for the establishing of consciousness. When consciousness is established and has come to growth, there is a descent of name-and-form.[n.5]Nāmarūpassa avakkanti.SeeSN2.2, where the production of future renewed existence is placed between consciousness and the six sense bases. Taken in conjunction, the two suttas imply that the \"descent of name-and-form\" and the \"production of future renewed existence\" are interchangeablethis in spite of the commentarial predilection for always seeing the latter as kammically active existence.Spkstates that there is a \"link\"(sandhi)between consciousness and name-and-form; thus on this interpretation consciousness denotes the kammically generative consciousness of the previous existence, name-and-form the beginning of the present existence. It seems to me, however, more likely that viññāṇa straddles both the past life and the present life, as the principle of personal continuity.With name-and-form as condition, the six sense basescome to be; with the six sense bases as condition, contact; with contact as condition, feeling … craving … clinging … existence … birth; with birth as condition, aging-and-death, sorrow, lamentation, pain, displeasure, and despair come to be. Such is the origin of this whole mass of suffering.",
    "sn12.39:2": "\"If, bhikkhus, one does not intend, and one does not plan, but one still has a tendency towards something, this becomes a basis for the maintenance of consciousness. When there is a basis, there is a support for the establishing of consciousness. When consciousness is established and has come to growth, there is a descent of name-and-form. With name-and-form as condition, the six sense basescome to be… . Such is the origin of this whole mass of suffering.",
    "sn12.39:3": "\"But, bhikkhus, when one does not intend, and one does not plan, and one does not have a tendency towards anything, no basis exists for the maintenance of consciousness. When there is no basis, there is no support for the establishing of consciousness. When consciousness is unestablished and does not come to growth, there is no descent of name-and-form. With the cessation of name-and-form comes cessation of the six sense bases … . Such is the cessation of this whole mass of suffering.\""
}