{
    "sn12.38:1": "At Sāvatthī. “Bhikkhus, what one intends, and what one plans, and whatever one has a tendency towards: this becomes a basis for the maintenance of consciousness. When there is a basis there is a support for the establishing of consciousness. When consciousness is established and has come to growth, there is the production of future renewed existence. When there is the production of future renewed existence, future birth, aging-and-death, sorrow, lamentation, pain, displeasure, and despair come to be. Such is the origin of this whole mass of suffering.[n.2]Spk: Here, the phrase one intends(ceteti)includes all wholesome and unwholesome volition of the three planes; one plans(pakappeti), the mental fabrications of craving and views(taṇhādiṭṭhikappā)in the eight cittas accompanied by greed(Spk-pṭ: the fabrications of views occur only in the four cittas associated with views); and whatever one has a tendency towards(anuseti)implies the underlying tendencies(anusaya)under the headings of conascence and decisive-support conditions for the twelve(unwholesome)volitions.(On the twelve unwholesome cittas, see CMA :4–7.)This becomes a basis(ārammaṇam etaṁ hoti): These various states such as volition become a condition; for here the wordārammaṇais intended as condition(paccaya;that is, hereārammaṇadoes not signify an object of consciousness, the usual meaning in the Abhidhamma). For the maintenance of consciousness(viññāṇassa ṭhitiyā): for the purpose of maintaining the kammic consciousness. When there is this condition, there is a support for the establishing of consciousness(patiṭṭhā viññāṇassa hoti), i.e., for the establishing of that kammic consciousness (Spk-pṭ: it has a capacity to yield fruit in one's mental continuum). When that(kammic)consciousness is established and has come to growth(tasmiṁ patiṭṭhite viññāṇe … virūḷhe): when, having impelled kamma, it has grown, produced roots, through its ability to precipitate rebirth, there is the production of future renewed existence, i.e., production consisting in renewed existence.Cp.2:64and22:53–54below.AN I 223-24explains the process of renewed existence in similar terms (see n.24). I see the verbs ceteti and pakappeti as allusions to saṅkhārā (which, as kammic activities, are expressive ofcetanā—seeAN III 45,7-8).Anuseticlearly refers to theanusayaor underlying tendencies, which includeavijjānusaya,the underlying tendency to ignorance (= ignorance in the usual formula of dependent origination) andrāgānusaya,the underlying tendency to lust (= craving in the usual formula). The way they maintain consciousness is thus no different from the way the volitional formations, fueled by ignorance and craving, serve as the condition for consciousness: together, they underlie the flow of consciousness, infuse it with kammic potentials for renewed existence, and project it into a new existence, thereby initiating the process that will culminate in birth. I am not in full agreement with Spk in taking theviññāṇathat is “maintained” and “established” as the kammic consciousness. I interpret it simply as the ongoing process of consciousness, including both the kammically active and resultant phases. At22:53–54the other four aggregates are spoken of as the ārammaṇa and patiṭṭhā of viññāṇa, but I am doubtful that this application will work here. To use the categories of the Abhidhamma, it seems that in this sutta the termsārammaṇaandpatiṭṭhādenote the decisive-support condition(upanissayapaccaya)for consciousness, while in the two suttas in the Khandhasaṁyutta they denote the conascence and support conditions(sahajātapaccaya, nissayapaccaya).I use “volition” as a rendering forcetanābut “intends” for the corresponding verbceteti;I use “intention” for the unrelated nounsaṅkappa.I justify this apparent inconsistency on the ground that in Pāli the verbsaṅkappeti(corresponding tosaṅkappa) occurs very rarely (if at all), while English lacks a simple verb corresponding to “volition.” “A support for the establishing of consciousness” renders patiṭṭhā viññāṇassa. I find that “established” works consistently better as a rendering for the participle patiṭṭhita, but “support” for the noun patiṭṭhā, so to bridge the participle and the noun in the present passage (and at 22:53, 54) I have coined this compound expression.",
    "sn12.38:2": "\"If, bhikkhus, one does not intend, and one does not plan, but one still has a tendency towards something, this becomes a basis for the maintenance of consciousness. When there is a basis, there is a support for the establishing of consciousness … . Such is the origin of this whole mass of suffering.[n.113]Spk: This refers to a moment when there is no occurrence of(wholesome and unwholesome)volition of the three planes, and no occurrence of the mental fabrications of craving and views. But one still has a tendency: by this the underlying tendencies are included because they have not been abandoned here in the resultants of the three planes, in the limited functional states (the five-door adverting and mind-door adverting cittas), and in form. As long as the underlying tendencies exist, they become a condition for the kammic consciousness, for there is no way to prevent its arising.Spk-pṭ: This second section is stated to show that wholesome and unwholesome kamma capable of producing rebirth is accumulated in the preliminary portion (of the path of practice), and that even without planning (through craving and views), the volitions of insight meditation in a meditator who has seen the dangers in existence are still conditioned by the underlying tendencies and are capable of generating rebirth. It is also stated to show that even when wholesome and unwholesome states are not occurring there is still an establishing of kammic consciousness with underlying defilements as condition; for so long as these have not been abandoned they lie latent in the existing resultants of the three planes, etc.",
    "sn12.38:3": "\"But, bhikkhus, when one does not intend, and one does not plan, and one does not have a tendency towards anything, no basis exists for the maintenance of consciousness.sn.ii.66When there is no basis, there is no support for the establishing of consciousness. When consciousness is unestablished and does not come to growth, there is no production of future renewed existence. When there is no production of future renewed existence, future birth, aging-and-death, sorrow, lamentation, pain, displeasure, and despair cease. Such is the cessation of this whole mass of suffering.\"[n.114]Spk: When one does not intend, etc.: By the first phrase(\"does not intend\")he shows that the wholesome and unwholesome volitions pertaining to the three planes have ceased; by the second (\"does not plan\"), that the craving and views in the eight cittas (accompanied by greed) have ceased; by the third (\"does not have a tendency\"), that the underlying tendencies lying latent in the aforesaid states have ceased. What is being discussed here? The function of the path of arahantship(arahattamaggassa kiccaṁ). It can also be interpreted as the arahant's doing of his task(khiṇāsavāssa kiccakaraṇaṁ)and the nine supramundane states(navalokuttaradhamma; i.e., the four paths, their fruits, and Nibbāna).Spk-pṭ: In this third section the function of the path of arahantship is discussed because that path completely stops the production of the underlying tendencies. The \"arahant's doing of his task\" can be said because of the exclusion of feeling, etc.(meaning unclear). The nine supramundane states can be said because the underlying tendencies are extirpated by the series of paths, and the fruits follow immediately upon the paths, and Nibbāna is the object of both.I understand the “unestablished consciousness”(appatiṭṭhita viññāṇa)here to mean a consciousness without the prospect of a future rebirth through the propulsive power of ignorance, craving, and the volitional formations. The arahant is said to expire with consciousness “unestablished,” as at4:2and22:87."
}