{
    "sn12.63:1": "At Sāvatthī.[n.60] A translation of the long commentary to this sutta is included in Nyanaponika,The Four Nutriments of Life.Spkexplains that the Buddha spoke this discourse because the Bhikkhu Saṅgha was receiving abundant almsfood and other requisites, and the Buddha wanted to place before the bhikkhus \"a mirror of the Dhamma for their self-control and restraint, so that, contemplating on it again and again, the bhikkhus of the future will make use of the four requisites only after due reflection.\" The opening paragraph is identical with that ofSN2..sn.ii.98\"Bhikkhus, there are these four kinds of nutriment for the maintenance of beings that have already come to be and for the assistance of those about to come to be. What four? The nutriment edible food, gross or subtle; second, contact; third, mental volition; fourth, consciousness. These are the four kinds of nutriment for the maintenance of beings that have already come to be and for the assistance of those about to come to be.",
    "sn12.63:2": "\"And how, bhikkhus, should the nutriment edible food be seen? Suppose a couple, husband and wife, had taken limited provisions and were travelling through a desert. They have with them their only son, dear and beloved. Then, in the middle of the desert, their limited provisions would be used up and exhausted, while the rest of the desert remains to be crossed. The husband and wife would think: ‘Our limited provisions have been used up and exhausted, while the rest of this desert remains to be crossed. Let us kill our only son, dear and beloved, and prepare dried and spiced meat. By eating our son's flesh we can cross the rest of this desert. Let not all three of us perish!’",
    "sn12.63:3": "\"What do you think, bhikkhus? Would they eat that food for amusement or for enjoymentsn.ii.99or for the sake of physical beauty and attractiveness?\"",
    "sn12.63:4": "\"And how, bhikkhus, should the nutriment contact be seen? Suppose there is a flayed cow. If she stands exposed to a wall, the creatures dwelling in the wall would nibble at her. If she stands exposed to a tree, the creatures dwelling in the tree would nibble at her. If she stands exposed to water, the creatures dwelling in the water would nibble at her. If she stands exposed to the open air, the creatures dwelling in the open air would nibble at her. Whatever that flayed cow stands exposed to, the creatures dwelling there would nibble at her.",
    "sn12.63:5": "\"And how, bhikkhus, should the nutriment mental volition be seen? Suppose there is a charcoal pit deeper than a man's height, filled with glowing coals without flame or smoke. A man would come along wanting to live, not wanting to die, desiring happiness and averse to suffering. Then two strong men would grab him by both arms and drag him towards the charcoal pit. The man's volition would be to get far away, his longing would be to get far away, his wish would be to get far awayfrom the charcoal pit.sn.ii.100For what reason? Because he knows: ‘I will fall into this charcoal pit and on that account I will meet death or deadly suffering.’",
    "sn12.63:6": "\"And how, bhikkhus, should the nutriment consciousness be seen? Suppose they were to arrest a bandit, a criminal, and bring him before the king, saying: ‘Sire, this man is a bandit, a criminal. Impose on him whatever punishment you wish.’ The king says to them: ‘Go, men, in the morning strike this man with a hundred spears.’ In the morning they strike him with a hundred spears. Then at noon the king asks: ‘Men, how's that man?’ –‘Still alive, sire.’ –‘Then go, and at noon strike him with a hundred spears.’ At noon they strike him with a hundred spears. Then in the evening the king asks: ‘Men, how's that man?’ –‘Still alive, sire.’ –‘Then go, and in the evening strike him with a hundred spears.’ In the evening they strike him with a hundred spears."
}