{
    "sn12.45:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Ñātika in the Brick Hall. Then, while the Blessed One was alone in seclusion, he uttered this Dhamma exposition:[n.25]Dhammapariyāya,a method of presenting the teaching. This sutta recurs atSN35.3, where it is called Upassuti, \"Listening In.\" On Ñātika, see V, n.330.",
    "sn12.45:2": "\"In dependence on the eye and forms, eye-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving; with craving as condition, clinging … . Such is the origin of this whole mass of suffering.",
    "sn12.45:3": "\"In dependence on the ear and sounds … In dependence on the mind and mental phenomena, mind-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving; with craving as condition, clinging … . Such is the origin of this whole mass of suffering.",
    "sn12.45:4": "\"In dependence on the eye and forms, eye-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving. But with the remainderless fading away and cessation of that same craving comes cessation of clinging; with the cessation of clinging, cessation of existence … . Such is the cessation of this whole mass of suffering.sn.ii.75",
    "sn12.45:5": "\"In dependence on the ear and sounds … In dependence on the mind and mental phenomena, mind-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving. But with the remainderless fading away and cessation of that same craving comes cessation of clinging; with the cessation of clinging, cessation of existence … . Such is the cessation of this whole mass of suffering.\"",
    "sn12.45:6": "Now on that occasion a certain bhikkhu was standing listening in on the Blessed One. The Blessed One saw him standing there listening in and said to him: \"Did you hear that Dhamma exposition, bhikkhu?\""
}