{
    "sn12.44:1": "At Sāvatthī. \"Bhikkhus, I will teach you the origin and the passing away of the world. Listen to that and attend closely, I will speak.\"[n.24]Spk: The world here is the world of formations(saṅkhāraloka). On the nature of the world in the Buddha’s teaching, see I, n.82.",
    "sn12.44:2": "\"And what, bhikkhus, is the origin of the world? In dependence on the eye and forms, eye-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving; with craving as condition, clinging; with clinging as condition, existence; with existence as condition, birth; with birth as condition, aging-and-death, sorrow, lamentation, pain, displeasure, and despair come to be. This, bhikkhus, is the origin of the world.",
    "sn12.44:3": "\"In dependence on the ear and sounds … In dependence on the nose and odours … In dependence on the tongue and tastes … In dependence on the body and tactile objects … In dependence on the mind and mental phenomena, mind-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving; with craving as condition, clinging … existence … birth; with birth as condition, aging-and-death, sorrow, lamentation, pain, displeasure, and despair come to be. This, bhikkhus, is the origin of the world.",
    "sn12.44:4": "\"And what, bhikkhus, is the passing away of the world? In dependence on the eye and forms, eye-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving. But with the remainderless fading away and cessation of that same craving comes cessation of clinging; with the cessation of clinging, cessation of existence; with the cessation of existence, cessation of birth; with the cessation of birth, aging-and-death, sorrow, lamentation, pain, displeasure, and despair cease. Such is the cessation of this whole mass of suffering. This, bhikkhus, is the passing away of the world.",
    "sn12.44:5": "\"In dependence on the ear and sounds …sn.ii.74… In dependence on the mind and mental phenomena, mind-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving. But with the remainderless fading away and cessation of that same craving comes cessation of clinging … cessation of existence … cessation of birth; with the cessation of birth, aging-and-death, sorrow, lamentation, pain, displeasure, and despair cease. Such is the cessation of this whole mass of suffering. This, bhikkhus, is the passing away of the world.\""
}