{
    "sn12.41:1": "At Sāvatthī. Then the householder Anāthapiṇḍika approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "sn12.41:2": "\"Householder, when five fearful animosities have subsided in a noble disciple, and he possesses the four factors of stream-entry, and he has clearly seen and thoroughly penetrated with wisdom the noble method, if he wishes he could by himself declare of himself: ‘I am one finished with hell, finished with the animal realm, finished with the domain of ghosts, finished with the plane of misery, the bad destinations, the nether world. I am a stream-enterer, no longer bound to the nether world, fixed in destiny, with enlightenment as my destination.’[n.118] The sutta is also atSN55.8and atAN V 18–84.Spkglossesbhayāni verānias volitions (bringing) fear and enmity(bhayaveracetanāyo). Spk-pṭ: The destruction of life and so forth are fearful and dreadful both for the perpetrator and for the victim; they are productive of fear and enmity, which are to be feared.The self-assured declaration of stream-entry is also atSN55.8–10. The stream-enterer is exempt from the prospect of rebirth in the lower realms; he is fixed in destiny(niyata), as he cannot take more than seven rebirths, all in the human or celestial realms; and he has enlightenment as his destination(sambodhiparāayaṇa), as he will necessarily attain the enlightenment of arahantship.",
    "sn12.41:3": "\"What are the five fearful animosities that have subsided? Householder, one who destroys life engenders, on account of such behaviour, fearful animosity pertaining to the present life and fearful animosity pertaining to the future life, and he experiences mental pain and displeasure.[n.119] The version atAN V 18includes another line here: \"But one who abstains from the destruction of life (etc.) does not engender fearful animosity pertaining to the present life and fearful animosity pertaining to the future life, and he does not experience mental pain and displeasure\"pāṇātipātā paṭivirato n’ eva diṭṭhadhammikaṁ bhayaṁ veraṁ pāsavāti, na samparāyikaṁ bhayaṁ veraṁ pāsavāti, na cetasikaṁ dukkhaṁ domanassaṁ paṭisaṁvedeti. It seems that the logic of the discourse requires this addition; its omission from the present text could be an early scribal error.Thus for one who abstains from destroying life, this fearful animosity has subsided.",
    "sn12.41:4": "\"One who takes what is not given …",
    "sn12.41:5": "… who engages in sexual misconduct",
    "sn12.41:6": "… who speaks falsely",
    "sn12.41:7": "… who indulges in wine, liquor, and intoxicants that are a basis for negligence engenders, on account of such behaviour, fearful animosity pertaining to the present life and fearful animosity pertaining to the future life, and he experiences mental pain and displeasure. Thus for one who abstains from wine, liquor, and intoxicants that are a basis for negligence, this fearful animosity has subsided.",
    "sn12.41:8": "\"What are the four factors of stream-entry that he possesses?[n.120]Spk: The factors of stream-entry(sotāpattiyaṅga)are of two kinds: (i) the factors for stream-entry, the preliminary practices that lead to the attainment of stream-entry, namely, associating with superior persons, hearing the true Dhamma, careful attention, and practice in accordance with the Dhamma (seeSN55.55); (ii) the factors of one who abides having attained stream-entry. The latter are intended here. Confirmed confidence is unshakable confidence (gained) through what has been achieved (Spk-pṭ: namely, the path)(aveccappasādenā ti adhigatena [maggena] acalappasādena).Aveccappasādais a syntactical compound, with avecca (Sktavetya) absolutive of*aveti,to undergo, to know, to experience. The formulas for recollection of the Buddha, the Dhamma, and the Saṅgha are analysed in detail at Vism 197–221 (Ppn 7:1–100).Here, householder, the noble disciple possesses confirmed confidence in the Buddha thus: ‘The Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’",
    "sn12.41:9": "\"He possesses confirmed confidence in the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’",
    "sn12.41:10": "\"He possesses confirmed confidence in the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practising the good way, practising the straight way, practising the true way, practising the proper way; that is, the four pairs of persons, the eight types of individuals—thissn.ii.70Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’",
    "sn12.41:11": "\"He possesses the virtues dear to the noble ones—unbroken, untorn, unblemished, unmottled, freeing, praised by the wise, ungrasped, leading to concentration.[n.121]Spk: The virtues dear to the noble ones(ariyakantāni sīlāni)are the five precepts, which the noble ones do not forsake even when they pass on to a new existence.The terms are explained at Vism 222(Ppn 7:104). These virtues are \"ungrasped\"(aparāmaṭṭha)in the sense that they are not adhered to with craving and wrong view.",
    "sn12.41:12": "\"And what is the noble method that he has clearly seen and thoroughly penetrated with wisdom?[n.2]Spk: The method(ñāya)is both dependent origination and the stable knowledge after one has known the dependently arisen. As he says: \"It is dependent origination that is called the method; the method is also the Noble Eightfold Path\"(untraced). Wisdom here is repeatedly arisen insight-wisdom(aparāparaṁ uppannā vipassanāpañña).Spk-pṭ: Dependent origination is called \"the method\" because, with the application of the right means, it is what is known(ñāyati)as it actually is in the dependently arisen. But knowledge(ñāṇa)is called \"the method\" because it is by this that the latter is known.Despite the commentators,ñāyahas no relation to ñāṇa but is derived fromni + i.Here, householder, the noble disciple attends closely and carefully to dependent origination itself thus: ‘When this exists, that comes to be; with the arising of this, that arises. When this does not exist, that does not come to be; with the cessation of this, that ceases. That is, with ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering. But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering.’",
    "sn12.41:13": "\"When, householder, these five fearful animosities have subsided in a noble disciple, and he possesses these four factors of stream-entry, and he has clearly seen and thoroughly penetrated with wisdom this noble method, if he wishes he could by himself declare of himself: ‘I am one finished with hell, finished with the animal realm, finished with the domain of ghosts, finished with the plane of misery, the bad destinations, the nether world. I am a stream-enterer, no longer bound to the nether world, fixed in destiny, with enlightenment as my destination.’\""
}