{
    "sn12.20:1": "At Sāvatthī. \"Bhikkhus, I will teach you dependent origination and dependently arisen phenomena. Listen and attend closely, I will speak.\"",
    "sn12.20:2": "\"And what, bhikkhus, is dependent origination? ‘With birth as condition, aging-and-deathcomes to be’: whether there is an arising of Tathāgatas or no arising of Tathāgatas, that element still persists, the stableness of the Dhamma, the fixed course of the Dhamma, specific conditionality.[n.51]Ṭhitā va sā dhātu dhammaṭṭhitatā dhammaniyāmatā idappaccayatā.Spk: That element(sā dhātu), the intrinsic nature of the conditions(paccayasabhāva), still persists; never is it the case that birth is not a condition for aging-and-death. By the next two terms too he indicates just the condition. For the dependently arisen phenomena stand because of the condition(paccayena hi paccayuppannā dhammā tiṭṭhanti); therefore the condition itself is called the stableness of the Dhamma(dhammaṭṭhitatā). The condition fixes (or determines) the dependent phenomena(paccayo dhamme niyameti); thus it is called the fixed course of the Dhamma(dhammaniyāmatā). Specific conditionality(idappaccayatā)is the set of specific conditions for aging-and-death, etc.Spk-pṭ: Whether it is unpenetrated before and after the arising of Tathāgatas, or penetrated when they have arisen, that element still persists; it is not created by the Tathāgatas, but aging-and-death always occurs through birth as its condition. A Tathāgata simply discovers and proclaims this, but he does not invent it.AtAN I 86,8–4exactly the same statement is made about the three characteristics: \"All formations are impermanent /suffering\" and \"All phenomena are nonself.\" The two expressions,dhammaṭṭhitatā dhammaniyāmatā,must thus have a meaning that is common to both dependent origination and the three characteristics, and it therefore seems unfitting to explain them here, asSpkdoes, in a way that is specifically tied to conditionality. Moreover, it is more likely that heredhammameans the principle or law-fulness that holds sway over phenomena, not the phenomena subject to that principle. See too below n.105, and11.A Tathāgata awakens to this and breaks through to it.[n.5]Abhisambujjhati abhisameti.The former verb, which is reserved for the Buddha’s enlightenment, is transitive. I thus render it \"awakens to (with the object),\" though otherwise I generally translate words derived from the verb bujjhati as expressing the sense of \"enlightenment.\"Abhisametiis the verb corresponding toabhisamaya,on which see n.13.Having done so, he explains it, teaches it, proclaims it, establishes it, discloses it, analyses it, elucidates it. And he says: ‘See! With birth as condition, bhikkhus, aging-and-death.’[n.53] Se contains a footnote which explains that the statement below, \"Thus, bhikkhus, the actuality in this …\" should be inserted at the end of each section on the conditioning relationships; and each following section should begin with the statement, \"whether there is an arising of Tathāgatas….\"",
    "sn12.20:3": "\"‘With existence as condition, birth’ … ‘With clinging as condition, existence’ … ‘With craving as condition, clinging’ … ‘With feeling as condition, craving’ … ‘With contact as condition, feeling’ … ‘With the six sense bases as condition, contact’ … ‘With name-and-form as condition, the six sense bases’ … ‘With consciousness as condition, name-and-form’ … ‘With volitional formations as condition, consciousness’ … ‘With ignorance as condition, volitional formations’: whether there is an arising of Tathāgatas or no arising of Tathāgatas, that element still persists, the stableness of the Dhamma, the fixed course of the Dhamma, specific conditionality. A Tathāgata awakens to this andsn.ii.26breaks through to it. Having done so, he explains it, teaches it, proclaims it, establishes it, discloses it, analyses it, elucidates it. And he says: ‘See! With ignorance as condition, bhikkhus, volitional formations.’",
    "sn12.20:4": "\"And what, bhikkhus, are the dependently arisen phenomena? Aging-and-death, bhikkhus, is impermanent, conditioned, dependently arisen, subject to destruction, vanishing, fading away, and cessation. Birth is impermanent … Existence is impermanent … Clinging is impermanent … Craving is impermanent … Feeling is impermanent … Contact is impermanent … The six sense bases are impermanent … Name-and-form is impermanent … Consciousness is impermanent … Volitional formations are impermanent … Ignorance is impermanent, conditioned, dependently arisen, subject to destruction, vanishing, fading away, and cessation. These, bhikkhus, are called the dependently arisen phenomena.",
    "sn12.20:5": "\"When, bhikkhus, a noble disciple has clearly seen with correct wisdom[n.]Sammappaññāya.Spk: With path wisdom together with insight(savipassanāya maggapaññāya).as it really is this dependent origination and these dependently arisen phenomena, it is impossible that he will run back into the past, thinking: ‘Did I exist in the past? Did I not exist in the past? What was I in the past? How was I in the past? Having been what, what did I become in the past?’ Or that he will run forward into the future, thinking: ‘Will I exist in the future? Will I not existsn.ii.27in the future? What will I be in the future? How will I be in the future? Having been what, what will I become in the future?’ Or that he will now be inwardly confused about the present thus: ‘Do I exist? Do I not exist? What am I? How am I? This being—where has it come from, and where will it go?’[n.6] The sixteen cases of doubt are also mentioned atMN I 8,4–1. For a discussion of their abandonment, see Vism 99 (Ppn 19:–6) and 603– (Ppn 19:21–27). Spk explains that the basic division expressed in the doubts—between existing and not existing in the past, etc.—reflects the antinomy of eternalism and annihilationism. The other doubts pertaining to past existence arise within an eternalist framework. Similar distinctions apply among the doubts pertaining to the future and the present."
}