{
    "sn12.27:1": "At Sāvatthī. \"Bhikkhus, with ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … Such is the origin of this whole mass of suffering.",
    "sn12.27:2": "\"And what, bhikkhus, is aging-and-death? The aging of the various beings …as in §… thus this aging and this death are together called aging-and-death. With the arising of birth there is the arising of aging-and-death; with the cessation of birth there is the cessation of aging-and-death. Just this Noble Eightfold Path is the way leading to the cessation of aging-and-death; that is, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.",
    "sn12.27:3": "\"And what, bhikkhus, is birth? … existence? … clinging? …sn.ii.4… craving? … feeling? … contact? … the six sense bases? … name-and-form? … consciousness? …",
    "sn12.27:4": "… volitional formations? There are these three kinds of volitional formations: the bodily volitional formation, the verbal volitional formation, the mental volitional formation. With the arising of ignorance there is the arising of volitional formations. With the cessation of ignorance there is the cessation of volitional formations. Just this Noble Eightfold Path is the way leading to the cessation of volitional formations; that is, right view … right concentration.",
    "sn12.27:5": "\"When, bhikkhus, a noble disciple thus understands the condition; thus understands the origin of the condition; thus understands the cessation of the condition; thus understands the way leading to the cessation of the condition,[n.84]Spk: He understands the condition by way of the truth of suffering, and the origin of the condition, etc., by way of the truth of the origin, etc.he is then called a noble disciple who is accomplished in view, accomplished in vision, who has arrived at this true Dhamma, who sees this true Dhamma, who possesses a trainee's knowledge, a trainee's true knowledge, who has entered the stream of the Dhamma, a noble one with penetrative wisdom, one who stands squarely before the door to the Deathless.\"[n.8] This whole passage is repeated atSN12.28,33,49, and0.Spk: He is endowed with the view of the path(maggadiṭṭhī), the vision of the path, etc.Sekhais used here as an adjective to qualifyñāṇaandvijjā.Thesekhaor trainee is one who has arrived at the supramundane path and is training in it but has not yet reached arahantship, i.e., a stream-enterer, once-returner, or nonreturner; on reaching arahantship he becomes anasekha,\"one beyond training.\"The rendering ofamatadvāraṁ ahacca tiṭṭhatiat KS 2:33 as \"who stands knocking at the door of the Deathless,\" if intended literally, shows a misunderstanding of the idiomāhacca tiṭṭhati.In both canon and commentaries the expression is often used to mean \"reaching right up to, standing up against,\" and does not imply knocking on a door, which in Pali is expressed by the verbākoṭeti(e.g., at Vin I 248,). The idiom is also atSN17.28,29(II 238,, 16–17). For other instances, see CPD, s.v.āhacca.The Deathless, of course, is Nibbāna.Spkidentifies the door to the Deathless as the noble path."
}