{
    "sn12.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn12.1:2": "\"And what, bhikkhus, is dependent origination? With ignorance as condition, volitional formationscome to be;[n.1]Spk: When it is said, \"With ignorance as condition, volitional formations,\" the meaning should be understood by this method: \"It is ignorance and it is a condition, hence ‘ignorance-as-condition’(avijjā ca sa paccayo ca ti avijjapaccayo). Through that ignorance-as-condition volitional formations come to be(tasma avijjapaccaya saṅkhāra sambhavanti).\"This explanation suggests that the verbsambhavanti,which in the text occurs only at the end of the whole formula, should be connected to each proposition, thus establishing that each conditioned state arises through its condition. The twelve terms of the formula are treated analytically in the next sutta.At the end of the paragraph, Ee readsayaṁ vuccati bhikkhave samuppado,but this must be an editorial error as both Be and Se havepaṭicca-samuppado.with volitional formations as condition, consciousness; with consciousness as condition, name-and-form; with name-and-form as condition, the six sense bases; with the six sense bases as condition, contact; with contact as condition, feeling; with feeling as condition, craving; with craving as condition, clinging; with clinging as condition, existence; with existence as condition, birth; with birth as condition, aging-and-death, sorrow, lamentation, pain, displeasure, and despair come to be. Such is the origin of this whole mass of suffering. This, bhikkhus, is called dependent origination.",
    "sn12.1:3": "\"But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations;sn.ii.2with the cessation of volitional formations, cessation of consciousness; with the cessation of consciousness, cessation of name-and-form; with the cessation of name-and-form, cessation of the six sense bases; with the cessation of the six sense bases, cessation of contact; with the cessation of contact, cessation of feeling; with the cessation of feeling, cessation of craving; with the cessation of craving, cessation of clinging; with the cessation of clinging, cessation of existence; with the cessation of existence, cessation of birth; with the cessation of birth, aging-and-death, sorrow, lamentation, pain, displeasure, and despair cease. Such is the cessation of this whole mass of suffering.\""
}