{
    "sn12.43:1": "At Sāvatthī.sn.ii.72\"Bhikkhus, I will teach you the origin and the passing away of suffering. Listen to that and attend closely, I will speak.\"[n.23]Spk: Suffering here is the suffering of the round(vaṭṭadukkha). There are two kinds of origin, momentary origin(khaṇikasamudaya)and origin through conditions(paccaya-samudaya). A bhikkhu who sees the one sees the other. Passing away is also twofold, final passing away (accantatthaṅgama;Spk-pṭ: nonoccurrence, cessation, Nibbāna) and dissolutional passing away (bhedatthaṅgama; Spk-pṭ: the momentary cessation of formations). One who sees the one sees the other.",
    "sn12.43:2": "\"And what, bhikkhus, is the origin of suffering? In dependence on the eye and forms, eye-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving. This is the origin of suffering.",
    "sn12.43:3": "\"In dependence on the ear and sounds … In dependence on the nose and odours … In dependence on the tongue and tastes … In dependence on the body and tactile objects … In dependence on the mind and mental phenomena, mind-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving. This is the origin of suffering.",
    "sn12.43:4": "\"And what, bhikkhus, is the passing away of suffering? In dependence on the eye and forms, eye-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving. But with the remainderless fading away and cessation of that same craving comes cessation of clinging; with the cessation of clinging, cessation of existence; with the cessation of existence, cessation of birth; with the cessation of birth, aging-and-death, sorrow, lamentation, pain, displeasure, and despair cease. Such is the cessation of this whole mass of suffering. This is the passing away of suffering.",
    "sn12.43:5": "\"In dependence on the ear and sounds … In dependence on the mind and mental phenomena, mind-consciousness arises. The meeting of the three is contact. With contact as condition, feelingcomes to be; with feeling as condition, craving. But with the remainderless fading away and cessation of that same craving comes cessation of clinging … cessation of existence … cessation of birth; with the cessation of birth, aging-and-death,sn.ii.73sorrow, lamentation, pain, displeasure, and despair cease. Such is the cessation of this whole mass of suffering. This is the passing away of suffering.\""
}