{
    "sn12.11:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park … .",
    "sn12.11:2": "\"Bhikkhus, these four kinds of nutriment have what as their source,sn.ii.1what as their origin, from what are they born and produced? These four kinds of nutriment have craving as their source, craving as their origin; they are born and produced from craving.[n.19] These four kinds of nutriment have craving as their source.Spk: Beginning with the moment of rebirth, these kinds of nutriment comprised in the individual existence (attabhava,the sentient organism) should be understood to originate by way of prior craving (purimataṇha;the craving of the previous life that generated rebirth). How? At the moment of rebirth, firstly, there exists nutritive essenceojaproduced within the arisen (bodily) form; this is the kammically acquired edible food originating from prior craving. Then the contact and volition associated with the rebirth-consciousness, and that consciousness itself, are respectively the kammically acquired nutriments of contact, mental volition, and consciousness originating from (prior) craving. Thus at rebirth the nutriments have their source in prior craving. And as at rebirth, so those produced subsequently at the moment of the first bhavaṅgacitta should be similarly understood.On the conditioning role of the nutriments, see CMA 8:3. The commentarial explanation of how craving is the cause of the four nutriments seems roundabout. A simpler explanation, more consonant with the spirit of the suttas, might be that it is craving which impels beings into the perpetual struggle to obtain physical and mental nutriment, both in the present life and in future lives.",
    "sn12.11:3": "\"Thus, bhikkhus, with ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering. But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering.\""
}