{
    "sn12.25:1": "Then, in the evening, the Venerable Bhūmija emerged from seclusion and approached the Venerable S̄riputta.[n.75] He gives his name to the Bhūmija Sutta (MN No. 26), where he answers some questions of Prince Jayasena and then engages in conversation with the Buddha. The first part of the present sutta repeats the first part of the preceding one except that it is phrased in terms of \"pleasure and pain.\"sn.ii.38He exchanged greetings with the Venerable Sāriputta and, when they had concluded their greetings and cordial talk, he sat down to one side and said to him:",
    "sn12.25:2": "\"Friend Sāriputta, some ascetics and brahmins, proponents of kamma, maintain that pleasure and pain are created by oneself; some ascetics and brahmins, proponents of kamma, maintain that pleasure and pain are created by another; some ascetics and brahmins, proponents of kamma, maintain that pleasure and pain are created both by oneself and by another; some ascetics and brahmins, proponents of kamma, maintain that pleasure and pain have arisen fortuitously, being created neither by oneself nor by another.[n.76] It is difficult to understand how these ascetics could be \"proponents of kamma\"(kammavada)when they hold that pleasure and pain arise fortuitously. NeitherSpknor Spkpṭ offers any clarification.Now, friend Sāriputta, what does the Blessed One say about this? What does he teach? How should we answer if we are to state what has been said by the Blessed One and not misrepresent him with what is contrary to fact? And how should we explain in accordance with the Dhamma so that no reasonable consequence of our assertion would give ground for criticism?\"",
    "sn12.25:3": "\"Friend, the Blessed One has said that pleasure and pain are dependently arisen. Dependent on what? Dependent on contact. If one were to speak thus one would be stating what has been said by the Blessed One and would not misrepresent him with what is contrary to fact; one would explain in accordance with the Dhamma, and no reasonable consequence of one's assertion would give ground for criticism.",
    "sn12.25:4": "\"Therein, friend, in the case of those ascetics and brahmins, proponents of kamma, who maintain that pleasure and pain are created by oneself, and those who maintain that pleasure and pain are created by another, and those who maintain that pleasure and pain are created both by oneself and by another, and those who maintain that pleasure and pain have arisen fortuitously, being created neither by oneself nor by another—in each case that is conditioned by contact.",
    "sn12.25:5": "\"Therein, friends, in the case of those ascetics and brahmins, proponents of kamma, who maintain that pleasure and pain are created by oneself, and those who maintain that pleasure and pain are created by another, and those who maintain that pleasure and pain are created both by oneself and by another, and thosesn.ii.39who maintain that pleasure and pain have arisen fortuitously, being created neither by oneself nor by another—in each case it is impossible that they will experienceanythingwithout contact.\"",
    "sn12.25:6": "The Venerable Ānanda heard this conversation between the Venerable Sāriputta and the Venerable Bhūmija. He then approached the Blessed One, paid homage to him, sat down to one side, and reported to the Blessed One the entire conversation between the Venerable Sāriputta and the Venerable Bhūmija.The Blessed One said:",
    "sn12.25:7": "\"Good, good, Ānanda! Anyone answering rightly would answer just as Sāriputta has done. I have said, Ānanda, that pleasure and pain are dependently arisen. Dependent on what? Dependent on contact. If one were to speak thus one would be stating what has been said by me and would not misrepresent me with what is contrary to fact; one would explain in accordance with the Dhamma, and no reasonable consequence of one's assertion would give ground for criticism.",
    "sn12.25:8": "\"Therein, Ānanda, in the case of those ascetics and brahmins, proponents of kamma, who maintain that pleasure and pain are created by oneself … and those who maintain that pleasure and pain have arisen fortuitously … in each case that is conditioned by contact.",
    "sn12.25:9": "\"Therein, Ānanda, in the case of those ascetics and brahmins, proponents of kamma, who maintain that pleasure and pain are created by oneself … and those who maintain that pleasure and pain have arisen fortuitously … in each case it is impossible that they will experienceanythingwithout contact.",
    "sn12.25:10": "\"Ānanda, when there is the body, because of bodily volition pleasure and pain arisesn.ii.40internally; when there is speech, because of verbal volition pleasure and pain arise internally; when there is the mind, because of mental volition pleasure and pain arise internally—and with ignorance as condition.[n.77] This passage is also atAN II 157–59.Spksays that the Buddha added this section to show that pleasure and pain do not arise with contact alone as condition, but with other conditions as well. In this case the bodily, verbal, and mental volitions(kāya-, vacī-, manosañcetanā)are the kammically effective volitions that function as conditions for the resultant pleasure and pain(vipākasukhadukkha). I follow Be and Se in readingavijjāpaccayaā caand in taking this clause to belong to the end of the present paragraph. This has the support of Spk, which explains that this is said to show that these volitions are conditioned by ignorance. Ee readsvaforcaand places the clause at the beginning of the next paragraph.",
    "sn12.25:11": "\"Either on one's own initiative, Ᾱnanda one generates that bodily volitional formation conditioned by which pleasure and pain arise internally; or prompted by others one generates that bodily volitional formation conditioned by which pleasure and pain arise internally. Either deliberately, Ānanda, one generates that bodily volitional formation conditioned by which pleasure and pain arise internally; or undeliberately one generates that bodily volitional formation conditioned by which pleasure and pain arise internally.[n.78]Spkidentifies the three volitional formations—kāyasaṅkhāra, vacīsaṅkhāra, manosaṅkhāra—with the three types of volition mentioned just [in the note] above. One generates them \"on one's own initiative\"(sāmaṅ)when one acts without inducement by others, with an unprompted mind(āsaṅkhārikacitta); one generates them \"prompted by others\" when one acts with a prompted mind(sasaṅkhārikacitta). One acts deliberately(sampajano)when one acts with knowledge of kamma and its fruit; undeliberately(asampajano), when one acts without such knowledge. This text may be the original basis for the Abhidhamma distinction betweensasaṅkhārikacittaandasaṅkhārikacitta,on which see CMA 1:4.",
    "sn12.25:12": "\"Either on one's own initiative, Ānanda, one generates that verbal volitional formation conditioned by which pleasure and pain arise internally; or prompted by others one generates that verbal volitional formation conditioned by which pleasure and pain arise internally. Either deliberately, Ānanda, one generates that verbal volitional formation conditioned by which pleasure and pain arise internally; or undeliberately one generates that verbal volitional formation conditioned by which pleasure and pain arise internally.",
    "sn12.25:13": "\"Either on one's own initiative, Ānanda, one generates that mental volitional formation[n.79] The term used here is manosaṅkhāra, but from the context this is clearly synonymous withcittasaṅkhāraatSN12.2. There is no textual justification for identifying the latter with thecittasaṅkhāraatSN41.6(IV 293,17) andMN I 301,28–29,defined as saññsaññāandvedanā.conditioned by which pleasure and pain arise internally; or prompted by others one generates that mental volitional formation conditioned by which pleasure and pain arise internally. Either deliberately, Ānanda, one generates that mental volitional formation conditioned by which pleasure and pain arise internally; or undeliberately one generates that mental volitional formation conditioned by which pleasure and pain arise internally.",
    "sn12.25:14": "\"Ignorance is comprised within these states.[n.80] I read withBeand Se,imesu Ānanda dhammesu avijjā anupatitā.Thechasuin Ee appears superfluous.Spk: Ignorance is included among these states under the heading of decisive support(upanissaya); for they are all comprehended under this phrase, \"With ignorance as condition, volitional formations.\" (On the interpretation ofpaṭicca-samuppādaby way of the twenty-four conditional relations of thePaṭṭhana,see Vism, chap. 17, concisely explained in Nyanatiloka Thera,Guide through the Abhidhamma Piṭaka,pp. 159–73.)But with the remainderless fading away and cessation of ignorance that body does not exist conditioned by which that pleasure and pain arise internally; that speech does not exist conditioned by which that pleasure and pain arise internally; that mind does not exist conditioned by whichsn.ii.41that pleasure and pain arise internally.[n.81] Spk: That body does not exist which, if it existed, would enable pleasure and pain to arise conditioned by bodily volition; the same method of explanation applies to speech and mind. (Query:) But an arahant acts, speaks, and thinks, so how is it that his body, etc., do not exist? (Reply:) In the sense that they do not generate kammic results. For the deeds done by an arahant are neither wholesome nor unwholesome kamma, but merely functional(kiriyamatta); thus for him it is said, \"that body, etc., do not exist.\"On the functional consciousness of the arahant, see CMA 1:15. An alternative explanation might be simply that with the elimination of ignorance there will be no further arising of the five aggregates, the basis of all experience, and thus no further experiencing of pleasure and pain.That field does not exist, that site does not exist, that base does not exist, that foundation does not exist conditioned by which that pleasure and pain arise internally.\"[n.82] Spk: There is no field(khetta)in the sense of a place of growth; no site(vatthu)in the sense of a support; no base(āyatana)in the sense of a condition; no foundation(adhikaraṇa)in the sense of a cause."
}