{
    "sn12.26:1": "At Sāvatthī. Then the Venerable Upavaṇa approached the Blessed One, paid homage to him, sat down to one side, and said to him:[n.83] Upavaṇa is the Buddha’s attendant atSN7.3. The present sutta is almost identical with the first part ofSN2.24except that it omits the qualifying expression kammavādā in the description of the ascetics and brahmins.",
    "sn12.26:2": "\"Venerable sir, some ascetics and brahmins maintain that suffering is created by oneself; some ascetics and brahmins maintain that suffering is created by another; some ascetics and brahmins maintain that suffering is created both by oneself and by another; some ascetics and brahmins maintain that suffering has arisen fortuitously, being created neither by oneself nor by another. Now, venerable sir, what does the Blessed One say about this? What does he teach? How should we answer if we are to state what has been said by the Blessed One and not misrepresent him with what is contrary to fact? And how should we explain in accordance with the Dhamma so that no reasonable consequence of our assertion would give ground for criticism?\"",
    "sn12.26:3": "\"Upavaṇa, I have said that suffering is dependently arisen. Dependent on what? Dependent on contact. If one were to speak thus one would be stating what has been said by me and would not misrepresent me with what is contrary to fact; one would explain in accordance with the Dhamma, and no reasonable consequence of one's assertion would give ground for criticism.",
    "sn12.26:4": "\"Therein, Upavaṇa, in the case of those ascetics and brahmins who maintain that suffering is created by oneself, and those who maintain that suffering is created by another, and those who maintain that suffering is created both by oneself and by another, and those who maintain that suffering has arisen fortuitously, being created neither by oneself nor by another—in each case that is conditioned by contact.sn.ii.2",
    "sn12.26:5": "\"Therein, Upavaṇa, in the case of those ascetics and brahmins who maintain that suffering is created by oneself, and those who maintain that suffering is created by another, and those who maintain that suffering is created both by oneself and by another, and those who maintain that suffering has arisen fortuitously, being created neither by oneself nor by another—in each case it is impossible that they will experienceanythingwithout contact.\""
}