{
    "sn12.60:1": "On one occasion the Blessed One was dwelling among the Kurus, where there was a town of the Kurus named Kammasadamma. Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said to him:[n.52] The opening of this sutta as far as \"the nether world,saṁsara\" is nearly identical with the opening of the Mahanidana Suttanta (DN No. 5), which differs only in including the aorist avaca. The present sutta is a composite, made up of the opening of the Mahanidana grafted on to the body ofSN2.55.Spkhere incorporates the long opening of the commentary to the Mahanidana, for which see Bodhi,The Great Discourse on Causation,pp. 58–73. Spk, however, does not attempt to explain how the same opening could have such a different sequel.",
    "sn12.60:2": "\"Not so, Ānanda! Not so, Ānanda! This dependent origination is deep and deep in implications. It is because of not understanding and not penetrating this Dhamma, Ānanda, that this generation has become like a tangled skein, like a knotted ball of thread, like matted reeds and rushes, and does not pass beyond the plane of misery, the bad destinations, the nether world, saṁsara.",
    "sn12.60:3": "\"Ānanda, when one dwells contemplating gratification in things that can be clung to, craving increases. With craving as condition,sn.ii.9clingingcomes to be… . Such is the origin of this whole mass of suffering.",
    "sn12.60:4": "\"Suppose, Ānanda, there was a great tree, and all its roots going downwards and across would send the sap upwards. Sustained by that sap, nourished by it, that great tree would stand for a very long time. So too, when one lives contemplating gratification in things that can be clung to, craving increases … . Such is the origin of this whole mass of suffering.",
    "sn12.60:5": "\"When, Ānanda, one dwells contemplating danger in things that can be clung to, craving ceases. With the cessation of craving comes cessation of clinging … . Such is the cessation of this whole mass of suffering.",
    "sn12.60:6": "\"Suppose, Ānanda, there was a great tree. Then a man would come along bringing a shovel and a basket. He would cut down the tree at its foot … he would winnow the ashes in a strong wind or let them be carried away by the swift current of a river. Thus that great tree would be cut off at the root, made like a palm stump, obliterated so that it is no more subject to future arising."
}