{
    "sn12.28:1": "At Sāvatthī. \"Herein, bhikkhus, a bhikkhu understands aging-and-death, its origin, its cessation, and the way leading to its cessation. He understands birth … existence … clingingsn.ii.44… craving … feeling … contact … the six sense bases … name-and-form … consciousness … volitional formations, their origin, their cessation, and the way leading to their cessation.",
    "sn12.28:2": "\"And what, bhikkhus, is aging-and-death? The aging of the various beings …as in §… thus this aging and this death are together called aging-and-death. With the arising of birth there is the arising of aging-and-death; with the cessation of birth there is the cessation of aging-and-death. Just this Noble Eightfold Path is the way leading to the cessation of aging-and-death; that is, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.",
    "sn12.28:3": "\"And what, bhikkhus, is birth? … existence? … clinging? …sn.ii.4… craving? … feeling? … contact? … the six sense bases? … name-and-form? … consciousness? …",
    "sn12.28:4": "… volitional formations? There are these three kinds of volitional formations: the bodily volitional formation, the verbal volitional formation, the mental volitional formation. With the arising of ignorance there is the arising of volitional formations. With the cessation of ignorance there is the cessation of volitional formations. Just this Noble Eightfold Path is the way leading to the cessation of volitional formations; that is, right view … right concentration.",
    "sn12.28:5": "\"When, bhikkhus, a bhikkhu thus understands aging-and-death, its origin, its cessation, and the way leading to its cessation; when he thus understands birth … existence … clinging … craving … feeling … contact … the six sense bases … name-and-form …sn.ii.4consciousness … volitional formations, their origin, their cessation, and the way leading to their cessation, he is then called a bhikkhu who is accomplished in view, accomplished in vision, who has arrived at this true Dhamma, who sees this true Dhamma, who possesses a trainee's knowledge, a trainee's true knowledge, who has entered the stream of the Dhamma, a noble one with penetrative wisdom, one who stands squarely before the door to the Deathless.\""
}