{
    "sn12.52:1": "At Sāvatthī. \"Bhikkhus, when one dwells contemplating gratification in things that can be clung to,[n.44]Upādāniyesu dhammesu.Spk: In the phenomena of the three planes, which are the conditions for the four kinds of clinging. Onupādāniya dhammā,seeSN22.2,35:0,23where clinging(upādāna)is explained simply as desire and lust(chandarāga)for the things that can be clung to.craving increases. With craving as condition, clingingcomes to be; with clinging as condition, existence; with existence as condition, birth; with birth as condition, aging-and-death, sorrow, lamentation, pain, displeasure, and despair come to be. Such is the origin of this whole mass of suffering.",
    "sn12.52:2": "\"Suppose, bhikkhus,sn.ii.85a great bonfire was burning, consuming ten, twenty, thirty, or forty loads of wood, and a man would cast dry grass, dry cowdung, and dry wood into it from time to time. Thus, sustained by that material, fuelled by it, that great bonfire would burn for a very long time. So too, when one lives contemplating gratification in things that can be clung to, craving increases … . Such is the origin of this whole mass of suffering.",
    "sn12.52:3": "\"Bhikkhus, when one dwells contemplating danger in things that can be clung to, craving ceases. With the cessation of craving comes cessation of clinging; with the cessation of clinging, cessation of existence … cessation of birth … aging-and-death, sorrow, lamentation, pain, displeasure, and despair cease. Such is the cessation of this whole mass of suffering.[n.145]Spk: The great bonfire represents the three realms of existence; the man tending the fire, the blind worldling attached to the round. His casting of fuel into the fire is like the worldling who contemplates gratification, creating wholesome and unwholesome kamma through the six sense doors on account of craving. The increase of the bonfire is like the blind worldling's repeated production of the suffering of the round by the accumulation of kamma.",
    "sn12.52:4": "\"Suppose, bhikkhus, a great bonfire was burning, consuming ten, twenty, thirty, or forty loads of wood, and a man would not cast dry grass, dry cowdung, or dry wood into it from time to time. Thus, when the former supply of fuel is exhausted, that great bonfire, not being fed with any more fuel, lacking sustenance, would be extinguished. So too, when one lives contemplating danger in things that can be clung to, craving ceases … . Such is the cessation of this whole mass of suffering.\"[n.16]Spk: A benefactor might come along and teach the man how to extinguish the fire, and the man would follow his advice. The benefactor represents the Buddha; his advice, the explanation of a meditation subject and an exhortation to gain release from suffering. The time the man follows the instructions is like the time the meditator is sitting in an empty hut applying insight to the phenomena of the three planes. The time when the man has bathed and adorned himself and is sitting tranquil and happy represents the time when the meditator, having cleansed himself of defilements by the noble path, sits absorbed in the attainment of fruition having Nibbāna as object. The time when the great bonfire is extinguished represents the time when the arahant's aggregates break up and he passes away into the Nibbāna element without residue.sn.ii.86"
}