{
    "sn12.62:3": "\"Therein, bhikkhus, the instructed noble disciple attends closely and carefully to dependent origination itself thus: ‘When this exists, that comes to be; with the arising of this, that arises. When this does not exist, that does not come to be; with the cessation of this, that ceases.’ Bhikkhus, in dependence on a contact to be experienced as pleasant, a pleasant feeling arises. With the cessation of that contact to be experienced as pleasant, the corresponding feeling—the pleasant feeling that arose in dependence on that contact to be experienced as pleasant—ceases and subsides. In dependence on a contact to be experienced as painful, a painful feeling arises. With the cessation of that contact to be experienced as painful, the corresponding feeling—the painful feelingsn.ii.97that arose in dependence on that contact to be experienced as painful—ceases and subsides. In dependence on a contact to be experienced as neither-painful-nor-pleasant, a neither-painful-nor-pleasant feeling arises. With the cessation of that contact to be experienced as neither-painful-nor-pleasant, the corresponding feeling—the neither-painful-nor-pleasant feeling that arose in dependence on that contact to be experienced as neither-painful-nor-pleasant—ceases and subsides.",
    "sn12.62:4": "\"Bhikkhus, just as heat is generated and fire is produced from the conjunction and friction of two fire-sticks, but with the separation and laying aside of the sticks[n.159] I read with Se and Eenānābhāvā vinikkhepā,as against Benānākatavinibbhogā.The simile recurs atSN36.10(IV 215,22–25) andSN8.39(V 212,21–2); in both places Be has the same reading as Se and Ee here.Spk: The sense base is like the lower firestick, the object is like the upper firestick, contact is like the friction of the two, and feeling is like the heat element.the resultant heat ceases and subsides; so too, in dependence on a contact to be experienced as pleasant … acontact to be experienced as painful … a contact to be experienced as neither-painful-nor-pleasant, a neither-painful-nor-pleasant feeling arises … . With the cessation of that contact to be experienced as neither-painful-nor-pleasant, the corresponding feeling … ceases and subsides.",
    "sn12.62:5": "\"Seeing thus, bhikkhus, the instructed noble disciple experiences revulsion towards contact, revulsion towards feeling, revulsion towards perception, revulsion towards volitional formations, revulsion towards consciousness. Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated. When it is liberated there comes the knowledge: ‘It's liberated.’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\""
}