{
    "sn12.51:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn12.51:2": "\"Bhikkhus, when a bhikkhu is making a thorough investigation, in what way should he thoroughly investigate for the utterly complete destruction of suffering?\"[n.134]Kittāvatā … bhikkhu parivīmaṁsamāno parivīmaṁseyya sabbaso sammā dukkhakkhayāya.Spkglossesparivimaṁsamanowithparivīmaṁsamāno.",
    "sn12.51:3": "\"Here, bhikkhus, when he makes a thorough investigation, a bhikkhu thoroughly investigates thus: ‘The many diverse kinds of suffering that arise in the worldheaded byaging-and-death: what is the source of this suffering, what is its origin, from what is it born and produced? When what exists does aging-and-death come to be? When what does not exist does aging-and-death not come to be?’",
    "sn12.51:4": "\"As he thoroughly investigates he understands thus: ‘The many diverse kinds of suffering that arise in the worldheaded byaging-and-death: this suffering has birth as its source, birth as its origin; it is born and produced from birth. When there is birth, aging-and-death comes to be; when there is no birth, aging-and-death does not come to be.’",
    "sn12.51:5": "\"He understands aging-and-death, its origin, its cessation, and the way leading on that is in conformity with its cessation.[n.13] Jarāmaraṇanirodhasāruppagāmini paṭipadā.Spk: The way leading on that is in conformity with the cessation of aging-and-death means the way leading on by its conformation with the cessation of aging-and-death, being similar (to cessation) by reason of its undefiled nature, its purity.In the repetition series just below, Ee omitsjāti panāyaṁ kinnidānā,,no doubt an editorial oversight.He practises that way and conducts himself accordingly. This is called a bhikkhu who is practising for the utterly complete destruction of suffering, for the cessation of aging-and-death.",
    "sn12.51:6": "\"Then, investigating further, he thoroughly investigates thus: ‘What is the source of this birth, what is its origin, from what is it born and produced? … What is the source of this existence? … this clinging? … this craving? … this feeling? … this contact? … these six sense bases? … this name-and-form? … this consciousness? … What is the source of these volitional formations, what is their origin, from what are they born and produced? When what exists do volitional formations come to be? When what does not exist do volitional formations not come to be?’",
    "sn12.51:7": "\"As he thoroughly investigates he understands thus: ‘Volitional formations have ignorance as their source, ignorance as their origin; they are born and produced from ignorance.sn.ii.82When there is ignorance, volitional formations come to be; when there is no ignorance, volitional formations do not come to be.’",
    "sn12.51:8": "\"He understands volitional formations, their origin, their cessation, and the way leading on that is in conformity with their cessation. He practises that way and conducts himself accordingly. This is called a bhikkhu who is practising for the utterly complete destruction of suffering, for the cessation of volitional formations.",
    "sn12.51:9": "\"Bhikkhus, if a person immersed in ignorance generates a meritorious volitional formation, consciousness fares on to the meritorious; if he generates a demeritorious volitional formation, consciousness fares on to the demeritorious; if he generates an imperturbable volitional formation, consciousness fares on to the imperturbable.[n.136]Spk: A meritorious volitional formation(puññaṁ saṅkhāraṁ)is the thirteen kinds of volition (i.e., the volitions of the eight wholesome sense-sphere cittas and the five wholesome cittas of the form sphere; see n.7). Consciousness fares on to the meritorious(puññūpagaṁ hoti viññāṇaṁ): the kammic consciousness becomes associated with a meritorious kamma, the resultant consciousness with the fruits of merit. A demeritorious volitional formation(apuññaṁ saṅkhāraṁ)is the twelve kinds of volition (i.e., in the twelve unwholesome cittas; see n.7). An imperturbable volitional formation(aneñjaṁ saṅkhāraṁ): the four kinds of volition (i.e., in the four wholesome cittas of the formless sphere). And here by mentioning the three kinds of kammic formations, the twelve-factored principle of conditionality is implied. To this extent the round of existence is shown.An analysis of these three types of volitional formations is at Vibh 135. AtMN II 262–63the Buddha explains in detail howviññāṇabecomesāneñjūpaga.But when a bhikkhu has abandoned ignorance and aroused true knowledge, then, with the fading away of ignorance and the arising of true knowledge, he does not generate a meritorious volitional formation, or a demeritorious volitional formation, or an imperturbable volitional formation. Since he does not generate or fashion volitional formations, he does not cling to anything in the world. Not clinging, he is not agitated.[n.137]Paritassaticlearly represents Sktparitṛṣyati,\"to crave, to thirst for,\" and is connected etymologically withtaṇhā.However, in Pali (and perhaps in MIA dialects generally) the verbal stem has become conflated withtasati= to fear, to tremble, and thus its noun derivatives such asparitassanāandparitasitaacquire the sense of nouns derived fromtasati. This convergence of meanings, already evident in the Nikāyas, is made explicit in the commentaries. I have tried to capture both nuances by rendering the verb \"to be agitated\" and the noun \"agitation.\"Here Spk glossesna paritassati:\"He is not agitated with the agitation of craving(taṇhaparitassanā)or the agitation of fear(bhayaparitassanā); the meaning is, he does not crave and does not fear.\" Neither Spk nor Spk-pṭ comment onparinibbāyati, but what is meant is obviously the attainment ofkilesaparinibbāna, the full quenching of defilements, on which see the General Introduction, pp. 4–50. On the arahant's reviewing knowledge, see I, n.376.Not being agitated, he personally attains Nibbāna. He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’",
    "sn12.51:10": "\"If he feels a pleasant feeling,[n.138]Spk: After the arahant's reviewing knowledge has been shown, this passage is stated to show his constant dwelling(sātatavihāra). The passage recurs, but with a different simile, atSN22.88,36:7,8, andSN54.8.he understands: ‘It is impermanent’; he understands: ‘It is not held to’; he understands: ‘It is not delighted in.’ If he feels a painful feeling, he understands: ‘It is impermanent’; he understands: ‘It is not held to’; he understands: ‘It is not delighted in.’ If he feels a neither-painful-nor-pleasant feeling, he understands: ‘It is impermanent’; he understands: ‘It is not held to’; he understands: ‘It is not delighted in.’",
    "sn12.51:11": "\"When he feels a feeling terminating with the body, he understands: ‘I feel a feeling terminating with the body.’ When he feels a feeling terminating with life, he understands: ‘I feel a feeling terminating with life.’[n.139]Spk: A feeling terminating with the body(kāyapariyantikaṁ vedanāṁ)is one delimited by the body(kāyaparicchinnaṁ); a feeling terminating with life(jīvitapariyantikaṁ vedanāṁ)is one delimited by life. As long as the body with its five sense doors continues, the feelings occurring at the five sense doors continue; as long as life continues, the feelings occurring at the mind door continue.He understands: ‘With the breakup of the body, following the exhaustion of life, all that is felt, not being delighted in, will become cool right here; mere bodily remains will be left.’[n.140] Spk: Will become cool right here(idh’ eva … sītibhavissanti): Right here, without having gone elsewhere by way of rebirth, they will become cool, subject to no further occurrence, devoid of the palpitation and disturbance of their occurrence.",
    "sn12.51:12": "\"Suppose, bhikkhus, a man would remove a hot clay pot from a potter's kiln and set it on smooth ground: its heat would be dissipated right there and potsherds would be left. So too, when he feels a feeling terminating with the body … terminating with life … . He understands: ‘With the breakup of the body, following the exhaustion of life, all that is felt, not being delighted in, will become cool right here; mere bodily remains will be left.’[n.141] The unusual use of the plural sārīrāni here mirrors the unusual use of the pluralkapillānito mean potsherds.Spkglosses sārīrāni as dhātusārīrāni, bodily elements, which Spk-pṭ identifies as the bones(aṭṭhikakankala).Kapillausually means a pot or a bowl, but Spk says the plural here denotes potsherds bound together along with the rim.Spk elaborates the simile: The blazing potter's oven represents the three realms of existence, the potter the meditator, and his rod the knowledge of the path of arahantship. The smooth piece of ground represents Nibbāna. The time when the potter removes the hot clay pot from the oven and places it on the ground is like the time when the meditator, having attained the supreme fruit of arahantship, removes his individual form from the four realms of misery and places it on the surface of Nibbāna by way of fruition attainment. Just as the hot clay pot (does not break up at once), so the arahant does not attain parinibbāna on the same day he reaches arahantship. He lives on for fifty or sixty years, striving to sustain the Buddha’s dispensation. When he reaches his last thought-moment, with the breakup of the aggregates he attains parinibbāna by the Nibbāna element without residue. Then, as with the potsherds of the pot, only inanimate bodily remains are left behind.",
    "sn12.51:13": "\"What do you think, bhikkhus, can a bhikkhu whose taints are destroyed generate a meritorious volitional formation, or a demeritorious volitional formation, or an imperturbable volitional formation?\" \"No, venerable sir.\"",
    "sn12.51:14": "\"When there are utterly no volitional formations, with the cessation of volitional formations, would consciousness be discerned?\"[n.2]Spk: \"Would a rebirth-consciousness(paṭisandhiviññāṇa)be discerned?\"\"No, venerable sir.\"",
    "sn12.51:15": "\"When there is utterly no consciousness, with the cessation of consciousness, would name-and-form be discerned?\" \"No, venerable sir.\"",
    "sn12.51:16–23": "\"When there is utterly no name-and-form … no six sense bases …sn.ii.84… no contact … no feeling … no craving … no clinging … no existence … no birth, with the cessation of birth, would aging-and-death be discerned?\" \"No, venerable sir.\"",
    "sn12.51:24": "\"Good, good, bhikkhus! It is exactly so and not otherwise! Place faith in me about this, bhikkhus, resolve on this. Be free from perplexity and doubt about this. Just this is the end of suffering.\"[n.143]Spk: \"Just this is the end of the suffering of the round, its termination, that is, Nibbāna.\""
}