{
    "sn12.19:1": "At Sāvatthī. \"Bhikkhus, for the fool, hindered by ignorance and fettered by craving,sn.ii.24this body has thereby originated. So there is this body and external name-and-form: thus this dyad. Dependent on the dyad there is contact. There are just six sense bases, contacted through which—or through a certain one among them—the fool experiences pleasure and pain.[n.48]Spk: This body has thereby originated(evam ayaṁ kāyo samudāgato): This body has been produced thus because he has been hindered by ignorance and fettered by craving. So there is this body: one's own conscious body. And external name-and-form(bahiddhā ca nāmarūpaṁ): the conscious body of others externally. The meaning should be explained in terms of the five aggregates and six sense bases of oneself and others. This interpretation ofbahiddhā nāmarūpaseems dubious. We may have here, rather, a rare example of the termnāmarūpabeing employed to represent the entire field of experience available to consciousness, \"external name\" being the concepts used to designate the objects cognized. See the common expressionimasmiṁ saviññāṇake kāye bahiddhā ca sabbanimittesu,\"in regard to this conscious body and all external signs,\" atSN8.2,22;SN22.7,72etc., and explained below in n.340. Spk interprets this dyad(etaṁ dvayaṁ)as the internal and external sense bases, which it calls \"the great dyad\"(mahadvaya). However, while the sense bases are usually shown to be the condition for contact (e.g., atSN2.43,44) and are also called a dyad (e.g., atSN35.92,93), it seems that here the text intends the term dyad to denote one's own conscious body and \"external name-and-form.\" The six sense bases are introduced only in the next sentence, after contact has already been said to arise from a duality. AtDN II 62,2–37too the Buddha demonstrates that name-and-form can be a direct condition for contact without mention of the six sense bases.",
    "sn12.19:2": "\"Bhikkhus, for the wise man, hindered by ignorance and fettered by craving, this body has thereby originated. So there is this body and external name-and-form: thus this dyad. Dependent on the dyad there is contact. There are just six sense bases, contacted through which—or through a certain one among them—the wise man experiences pleasure and pain.",
    "sn12.19:3": "What, bhikkhus, is the distinction here, what is the disparity, what is the difference between the wise man and the fool?\"",
    "sn12.19:4": "\"Then listen and attend closely, bhikkhus, I will speak.\"",
    "sn12.19:5": "\"Bhikkhus, for the fool, hindered by ignorance and fettered by craving, this body has originated. For the fool that ignorance has not been abandoned and that craving has not been utterly destroyed. For what reason? Because the fool has not lived the holy life for the complete destruction of suffering. Therefore, with the breakup of the body, the fool fares on toanotherbody. Faring on toanotherbody, he is not freed from birth, aging, and death; not freed from sorrow, lamentation, pain, displeasure, and despair; not freed from suffering, I say.",
    "sn12.19:6": "\"Bhikkhus, for the wise man, hindered by ignorance and fettered by craving, this body has originated. For the wise man that ignorance has been abandoned and that craving has been utterly destroyed. For what reason? Because the wise man has lived the holy lifesn.ii.25for the complete destruction of suffering. Therefore, with the breakup of the body, the wise man does not fare on toanotherbody. Not faring on toanotherbody, he is freed from birth, aging, and death; freed from sorrow, lamentation, pain, displeasure, and despair; freed from suffering, I say."
}