{
    "sn12.66:1": "Thus have I heard. On one occasion the Blessed One was dwelling among the Kurus, where there was a town of the Kurus named Kammasadamma. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"[n.83]Spk: Why did he address the bhikkhus? Because a subtle Dhamma discourse, one stamped with the three characteristics, had presented itself to him. In this country (the Kuru country), it is said, the people had good roots (Spk-pṭ: supporting conditions for achievement of the noble Dhamma) and were wise (Spk-pṭ: with the wisdom of a three-rooted rebirth-consciousness and pragmatic wisdom). They were capable of penetrating a deep Dhamma talk stamped with the three characteristics. Therefore the Buddha taught here the two Satipaṭṭhāna Suttas (DN No. 22,MN No. 0), the Mahanidana Sutta (DN No. 5), the Aneñjasappaya Sutta (MN No. 06), the Cūḷanidana Sutta (SN2.60), and other deep suttas.",
    "sn12.66:2": "Then the Venerable Ānanda said: \"Now is the time for this, Blessed One! Now is the time for this, Fortunate One! Let the Blessed One explain inward exploration. Having heard it from the Blessed One, the bhikkhus will remember it.\"",
    "sn12.66:3": "\"Here, bhikkhus, when engaged in inward exploration, a bhikkhu explores thus: ‘The many diverse kinds of suffering that arise in the worldheaded byaging-and-death: what is the source of this suffering, what is its origin,sn.ii.108from what is it born and produced? When what exists does aging-and-death come to be? When what does not exist does aging-and-death not come to be?’[n.186] As atSN12.51, but with a different sequel. I read withBeidaṁ kho dukkhaṁ kiṁnidanaṁ.Ee here is unsatisfactory.",
    "sn12.66:4": "\"Then, engaging further in inward exploration, he explores thus: ‘What is the source of this acquisition, what is its origin, from what is it born and produced? When what exists does acquisition come to be? When what is absent does acquisition not come to be?’",
    "sn12.66:5": "\"Then, engaging further in inward exploration, he explores thus: ‘When this craving arises, where does it arise? When it settles down, upon what does it settle?’",
    "sn12.66:6": "\"Bhikkhus, whatever ascetics and brahmins in the past regarded that in the world with a pleasant and agreeable nature as permanent, as happiness, as self, as healthy, as secure: they nurtured craving. In nurturing craving they nurtured acquisition. In nurturing acquisition they nurtured suffering. In nurturing suffering they were not freed from birth, aging, and death; they were not freed from sorrow, lamentation, pain, displeasure, and despair; they were not freed from suffering, I say.",
    "sn12.66:7": "\"Whatever ascetics and brahmins in the future will regard that in the world with a pleasant and agreeable nature as permanent, as happiness, as self, as healthy, as secure: they will nurture craving. In nurturing craving they will nurture acquisition. In nurturing acquisition they will nurture suffering. In nurturing suffering they will not be freed from birth, aging, and death; they will not be freed from sorrow, lamentation, pain, displeasure, and despair; they will not be freed from suffering, I say.",
    "sn12.66:8": "\"Whatever ascetics and brahmins at present regard that in the world with a pleasant and agreeable nature as permanent, as happiness, as self, as healthy, as secure: they are nurturing craving. In nurturing craving they are nurturing acquisition. In nurturing acquisition they are nurturing suffering. In nurturing suffering they are not freed from birth, aging, and death; they are not freed from sorrow, lamentation, pain, displeasure, and despair; they are not freed from suffering, I say.sn.ii.110",
    "sn12.66:9": "\"Suppose, bhikkhus, there was a bronze cup of a beverage having a fine colour, aroma, and taste, but it was mixed with poison. Then a man would come along, oppressed and afflicted by the heat, tired, parched, and thirsty. They would tell him: ‘Good man, this beverage in the bronze cup has a fine colour, aroma, and taste, but it is mixed with poison. Drink it if you wish. If you drink it, it will gratify you with its colour, aroma, and taste, but by drinking it you will meet death or deadly suffering.’ Suddenly, without reflecting, he would drink the beverage—he would not reject it—and thereby he would meet death or deadly suffering.[n.10] The same simile, but with slight differences in wording, is atMN I 316,10–23.",
    "sn12.66:10": "\"Bhikkhus, whatever ascetics and brahmins in the past regarded that in the world with a pleasant and agreeable nature as impermanent, as suffering, as nonself, as a disease, as fearful: they abandoned craving. In abandoning craving they abandoned acquisition. In abandoning acquisition they abandoned suffering. In abandoning suffering they were freed from birth, aging, and death; they were freed from sorrow, lamentation, pain, displeasure, and despair; they were freed from suffering, I say.",
    "sn12.66:11": "\"Whatever ascetics and brahmins in the futuresn.ii.1will regard that in the world with a pleasant and agreeable nature as impermanent, as suffering, as nonself, as a disease, as fearful: they will abandon craving. In abandoning craving … they will be freed from suffering, I say.",
    "sn12.66:12": "\"Whatever ascetics and brahmins at present regard that in the world with a pleasant and agreeable nature as impermanent, as suffering, as nonself, as a disease, as fearful: they are abandoning craving. In abandoning craving … they are freed from suffering, I say.",
    "sn12.66:13": "\"Suppose, bhikkhus, there was a bronze cup of a beverage having a fine colour, aroma, and taste, but it was mixed with poison. Then a man would come along, oppressed and afflicted by the heat, tired, parched, and thirsty. They would tell him: ‘Good man, this beverage in the bronze cup has a fine colour, aroma, and taste, but it is mixed with poison. Drink it if you wish. If you drink it, it will gratify you with its colour, aroma, and taste, but by drinking it you will meet death or deadly suffering. ’ Then the man would think: ‘I can quench my thirst with water, whey, porridge, or soup, but I should not drink that beverage, since to do so would lead to my harm and suffering for a long time.’ Having reflected, he would not drink the beverage but would reject it,sn.ii.112and thereby he would not meet death or deadly suffering.",
    "sn12.66:14": "\"So too, bhikkhus, whatever ascetics and brahmins in the past … in the future … at present regard that in the world with a pleasant and agreeable nature as impermanent, as suffering, as nonself, as a disease, as fearful: they are abandoning craving. In abandoning craving … they are freed from suffering, I say.\"[n.192]Spk: In the counterpart, the man oppressed by the heat represents the meditator at the time he is still attached to the round. When he reflects, rejects the beverage, and dispels his thirst with some other drink, this is like the bhikkhu's abiding by the advice of his preceptor and teacher, guarding the sense doors, gradually developing insight, and attaining the fruit of arahantship. The other four beverages are like the four paths. As the man dispels his thirst with the other four beverages and goes happily wherever he wants, so the arahant, having drunk of the four paths, dispels craving and goes to the region of Nibbāna."
}