{
    "sn12.33:1": "At Sāvatthī. \"Bhikkhus, I will teach you forty-four cases of knowledge. Listen to that and attend closely, I will speak.\"",
    "sn12.33:2": "\"Bhikkhus, what are the forty-four cases of knowledge?sn.ii.57Knowledge of aging-and-death, knowledge of its origin, knowledge of its cessation, knowledge of the way leading to its cessation. Knowledge of birth … Knowledge of existence … Knowledge of clinging … Knowledge of craving … Knowledge of feeling … Knowledge of contact … Knowledge of the six sense bases … Knowledge of name-and-form … Knowledge of consciousness … Knowledge of volitional formations, knowledge of their origin, knowledge of their cessation, knowledge of the way leading to their cessation. These, bhikkhus, are the forty-four cases of knowledge.",
    "sn12.33:3–4": "\"And what, bhikkhus, is aging-and-death? …definition as in §2… Thus this aging and this death are together called aging-and-death. With the arising of birth there is the arising of aging-and-death. With the cessation of birth there is the cessation of aging-and-death. This Noble Eightfold Path is the way leading to the cessation of aging-and-death; that is, right view … right concentration.",
    "sn12.33:5–7": "\"When, bhikkhus, a noble disciple thus understands aging-and-death, its origin,sn.ii.58its cessation, and the way leading to its cessation, this is his knowledge of the principle.[n.102]Dhamme ñāṇa.Spkexplains the Dhamma here as the Four Noble Truths(catusaccadhamma)or path knowledge(maggañāṇadhamma).By means of this principle that is seen, understood, immediately attained, fathomed,[n.103] Iminā dhammena diṭṭhena viditena akālikena pattena pariyogāḷhena. Note that the string of participles here corresponds exactly to the terms used in the standard description of one who has gained \"the vision of the Dhamma\"(dhammacakkhu): diṭṭhadhammo, pattadhammo, viditadhammo, pariyogāḷhadhammo(\"seen the Dhamma, attained the Dhamma, understood the Dhamma, fathomed the Dhamma,\" e.g., atDN I 110,14–15). This implies that the Dhamma which the stream-enterer has seen is dependent origination, an inference additionally confirmed by the closing passage of the present sutta.Spk here treats akalikena as an independent adjective qualifying dhammena and explains it to mean that the path yields its fruit immediately after it is penetrated, without passage of time(kiñci kālaṁ anatikkamitvā paṭivedhānantaraṁ yeva phaladāyakena). However, in commenting onSN42.11(IV 328,21–22), where the same statement is found, Spk explains akalikena as an adverb of manner used in apposition topattena(see IV, n.352). I understandakālikenain the present passage in exactly the same way; otherwise it is difficult to see why it should be included amidst a string of past participles. Moreover, since the word here characterizes the relationship between temporal events like birth and aging, the common rendering of it as \"timeless\" is not entirely satisfactory. The desired sense in this context is \"not involving the passage of time,\" i.e., immediate, which qualifies the knowledge of the conditional relationship between the factors, not the factors themselves. The point is that this knowledge is a matter of direct \"ocular\" experience rather than of reasoning and inference.he applies the method to the past and to the future thus: ‘Whatever ascetics and brahmins in the past directly knew aging-and-death, its origin, its cessation, and the way leading to its cessation, all these directly knew it in the very same way that I do now. Whatever ascetics and brahmins in the future will directly know aging-and-death, its origin, its cessation, and the way leading to its cessation, all these will directly know it in the very same way that I do now.’ This is his knowledge of entailment.[n.104]Anvaye ñāṇa.Spk: The knowledge (that follows) as a consequence of the knowledge of the principle; this is a name for reviewing knowledge (see n.68). It is not possible to apply the method to the past and future by means of the dhamma of the four truths or the dhamma of path knowledge, but when the four paths have been penetrated by path knowledge, reviewing knowledge subsequently occurs, and one applies the method by means of that.This explanation is difficult to square with the account of reviewing knowledge at Vism 676 and elsewhere as knowledge of the path and fruit attained, the defilements abandoned, those remaining, and Nibbāna. What is meant here, rather, is an inference extended to past and future, based on the immediate discernment of the conditionality operative between any given pair of factors.The following paragraph is also atSN12.27,28.Spksays that the arahant's (prior) plane of traineeship(khiṇāsavāssa sekhabhūmi)is being discussed, on which Spk-pṭ remarks: the moment of the supreme path(aggamaggakhaṇa).",
    "sn12.33:8": "\"When, bhikkhus, a noble disciple has purified and cleansed these two kinds of knowledge—knowledge of the principle and knowledge of entailment—he is then called a noble disciple who is accomplished in view, accomplished in vision, who has arrived at this true Dhamma, who sees this true Dhamma, who possesses a trainee's knowledge, a trainee's true knowledge, who has entered the stream of the Dhamma, a noble one with penetrative wisdom, one who stands squarely before the door to the Deathless.",
    "sn12.33:9–10": "\"And what, bhikkhus, is birth? … What are the volitional formations? …definitions as in §2sn.ii.59… This Noble Eightfold Path is the way leading to the cessation of volitional formations; that is, right view … right concentration.",
    "sn12.33:11–13": "\"When, bhikkhus, a noble disciple thus understands volitional formations, their origin, their cessation, and the way leading to their cessation, this is his knowledge of the principle. By means of this principle that is seen, understood, immediately attained, fathomed, he applies the method to the past and to the future … . This is his knowledge of entailment.",
    "sn12.33:14": "\"When, bhikkhus, a noble disciple has purified and cleansed these two kinds of knowledge—knowledge of the principle and knowledge of entailment—he is then called a noble disciple who is accomplished in view … one who stands squarely before the door to the Deathless.\""
}