{
    "sn12.17:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary.sn.ii.9Then, in the morning, the Blessed One dressed and, taking bowl and robe, entered Rājagaha for alms. The naked ascetic Kassapa saw the Blessed One coming in the distance. Having seen him, he approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he stood to one side and said to him: \"We would like to ask Master Gotama about a certain point, if he would grant us the favour of answering our question.\"",
    "sn12.17:2": "A second time and a third time the naked ascetic Kassapa said to the Blessed One: \"We would like to ask Master Gotama about a certain point, if he would grant us the favour of answering our question.\"",
    "sn12.17:3": "\"How is it, Master Gotama: is suffering created by oneself?\"",
    "sn12.17:4": "\"Whether you are asked: ‘How is it, Master Gotama: is suffering created by oneself?’ or ‘Is it created by another?’ or ‘Is it created by both?’ or ‘Is it created by neither?’ in each case you say: ‘Not so, Kassapa.’ When you are asked: ‘How is it then, Master Gotama: is there no suffering?’ you say: ‘It is not that there is no suffering, Kassapa; there is suffering.’ When asked: ‘Then is it that Master Gotama does not know and see suffering?’ you say: ‘It is not that I do not know and see suffering, Kassapa. I know suffering, I see suffering.’ Venerable sir, let the Blessed One explain suffering to me. Let the Blessed One teach me about suffering.\"[n.38]Spkpoints out that the change of address, from the familiarbho Gotamato the respectfulbhante bhagava,indicates that he has acquired reverence for the Teacher.",
    "sn12.17:5": "\"Kassapa,if one thinks,‘The one who acts is the same as the one who experiencesthe result,’then one assertswith reference to one existing from the beginning: ‘Suffering is created by oneself.’ When one asserts thus, this amounts to eternalism.[n.39]Spkglossesadito sato as adimhi yeva,and explains it as meaning \"(if) at the beginning (one thinks)….\" It seems to me more likely that this phrase is part of the eternalist view itself and means \"of one existing from the beginning,\" i.e., of a being that has always existed. This interpretation can marshal support from the fact that the phrase is omitted just below in the corresponding restatement of the annihilationist view, which is otherwise constructed according to the same logic and thus, if Spk were correct, should include adito sato. Spk says \"it should be brought in,\" but the fact that the text replaces it by another phrase is strong evidence that it does not belong there; see n.40.Spk: If at the beginning (one thinks), \"The one who acts is the same as the one who experiences (the result),\" in such a case the belief(laddhi)afterwards follows, \"Suffering is created by oneself.\" And here, what is meant by suffering is the suffering of the round(vaṭṭadukkha). Asserting thus, from the beginning one declares eternalism, one grasps hold of eternalism. Why? Because that view of his amounts to this. Eternalism comes upon one who conceives the agent and the experiencer to be one and the same.Spk-pṭ: Prior to the belief that suffering is created by oneself there are the distortions of perception and of mind(saññacittavipallasa)in the notion, \"The one who acts is the same as the one who experiences (the result),\" and then a wrong adherence to these distortions develops, namely, the belief \"Suffering is created by oneself\" (a distortion of views,diṭṭhivipallasa).On the three levels of distortion with their four modes, seeAN II 2.But, Kassapa,if one thinks,‘The one who acts is one, the one who experiencesthe resultis another,’then one assertswith reference to one stricken by feeling: ‘Suffering is created by another.’ When one asserts thus, this amounts to annihilationism.[n.40] In this passage the phraseādito satofound in the preceding statement of eternalism is replaced byvedanābhitunnassa sato,which countermandsSpk'sproposal thatādito satoshould be brought in here. Spk interprets the sentence as stating that the annihilationist view is held by one who experiences the feeling associated with the view, but I understand the point to be that the view is held with reference to one \"stricken by feeling,\" perhaps by painful feeling.Spk: If at the beginning (one thinks), \"The one who acts is one, the one who experiences (the result) is another,\" in such a case afterwards there comes the belief, \"Suffering is created by another,\" held by one stricken by—that is, pierced by—the feeling associated with the annihilationist view that arises thus: \"The agent is annihilated right here, and someone else (‘another’) experiences (the results) of his deeds.\" Asserting thus, from the beginning one declares annihilationism, one grasps hold of annihilationism. Why? Because the view one holds amounts to this. Annihilationism comes upon him.Without veering towards either of these extremes, the Tathagata teaches the Dhamma by the middle:[n.41]Spk:The Tathagata teaches the Dhamma by the middle without veering to either of these extremes—eternalism and annihilationism—having abandoned them without reservation. He teaches while being established in the middle way. What is that Dhamma? By the formula of dependent origination, the effect is shown to occur through the cause and to cease with the cessation of the cause, but no agent or experiencer(kāraka, vedaka)is described.‘With ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering.sn.ii.21But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering.’\"",
    "sn12.17:6": "When this was said, the naked ascetic Kassapa said to the Blessed One: \"Magnificent, venerable sir! Magnificent, venerable sir! The Dhamma has been made clear in many ways by the Blessed One, as though he were turning upright what had been turned upside down, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go for refuge to the Blessed One, and to the Dhamma, and to the Bhikkhu Saṅgha. May I receive the going forth under the Blessed One, may I receive the higher ordination?\"[n.42] The going forth(pabbajja)is the initial ordination as a novice(sāmaṇera); the higher ordination(upasampada)admits the novice to full membership in the Saṅgha as a bhikkhu.",
    "sn12.17:7": "\"Kassapa, one formerly belonging to another sect who desires the going forth and the higher ordination in this Dhamma and Discipline lives on probation for four months. At the end of the four months, if the bhikkhus are satisfied with him, they may if they wish give him the going forth and the higher ordination to the state of a bhikkhu. But individual differences are recognized by me.\"[n.43] For details on the ordination of a wanderer formerly belonging to another sect, see Vin I 69–1.Spk: The candidate is actually given the going forth and lives as a novice during the probationary period, after which the bhikkhus give him the higher ordination if they are satisfied with him. The Buddha, however, is entitled to waive the usual procedure when he recognizes that the candidate is sufficiently competent and need not be tested. In Kassapa's case he had the going forth given to him; then, immediately after, Kassapa was brought back to him and he called an assembly of bhikkhus and administered the higher ordination.",
    "sn12.17:8": "\"If, venerable sir, one formerly belonging to another sect who desires the going forth and the higher ordination in this Dhamma and Discipline lives on probation for four months, and if at the end of the four months the bhikkhus, being satisfied with him, may if they wish give him the going forth and the higher ordination to the state of a bhikkhu, then I will live on probation for four years. At the end of the four years, if the bhikkhus are satisfied with me, let them if they wish give me the going forth and the higher ordination to the state of a bhikkhu.\"",
    "sn12.17:9": "Then the naked ascetic Kassapa received the going forth under the Blessed One, and he received the higher ordination. And soon, not long after his higher ordination, dwelling alone, withdrawn, diligent, ardent, and resolute, the Venerable Kassapa,sn.ii.22by realizing it for himself with direct knowledge, in this very life entered and dwelt in that unsurpassed goal of the holy life for the sake of which clansmen rightly go forth from the household life into homelessness. He directly knew: \"Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.\" And the Venerable Kassapa became one of the arahants.[n.44] See I, n.376."
}