{
    "sn12.37:1": "At Sāvatthī. \"Bhikkhus, this body is not yours, nor does it belong to others.[n.0]Spk: Since there actually is no self, there is nothing belonging to self; thus he says, \"It is not yours\"(na tumhākaṁ). And since there is no self of others, he says, \"Neither does it belong to others\"(na pi aññesaṁ). See tooSN22.33andSN35.0.sn.ii.65It is old kamma, to be seen as generated and fashioned by volition, as something to be felt.[n.] Spk: It is old kamma(purāṇam idaṁ kammaṁ): This body is not actually old kamma, but because it is produced by old kamma it is spoken of in terms of its condition. It should be seen as generated(abhisaṅkhata), in that it is made by conditions; as fashioned by volition(abhisañcetayita), in that it is based on volition, rooted in volition; and as something to be felt(vedaniya), in that it is a basis for what is to be felt (Spkpṭ: because it is a basis and object of feeling).See tooSN35.46, where the same idea is extended to the six internal sense bases. To reflect upon the body in terms of dependent origination, one considers that this body can be subsumed under \"form\" in the compound \"name-and-form.\" One then reflects that name-and-form comes into being with consciousness, i.e., the rebirth-consciousness, as a conascent condition, and that both consciousness and name-and-form originate from the volitional formations, i.e., the kammic activities of the preceding existence. Thus the theme of this sutta ties up with the three that immediately follow.",
    "sn12.37:2": "Therein, bhikkhus, the instructed noble disciple attends carefully and closely to dependent origination itself thus: ‘When this exists, that comes to be; with the arising of this, that arises. When this does not exist, that does not come to be; with the cessation of this, that ceases. That is, with ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering. But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering.\""
}