{
    "sn12.22:1": "At Sāvatthī. \"Bhikkhus, possessing the ten powers and the four grounds of self-confidence, the Tathāgata claims the place of the chief bull of the herd, roars his lion's roar in the assemblies, and sets rolling the Brahma-wheel thus: ‘Such is form, such its origin, such its passing away; such is feeling, such its origin, such its passing away; such is perception, such its origin, such its passing away; such are volitional formations, such their origin, such their passing away; such is consciousness, such its origin, such its passing away.[n.60a] This stock meditation formula on the five aggregates is also found in SN atSN2.23,22:78,89,0. It occurs too in the two versions of the Satipaṭṭhāna Sutta atDN II 30,29–302,3andMN I 6,3–8. The origin(samudaya)and the passing away(atthaṅgama)of the aggregates are explained from the standpoint of diachronic conditionality atSN22.5and from the standpoint of synchronic conditionality at SN22.56,57. See too n.23.Thus when this exists, that comes to be; with the arising of this, that arises. When this does not exist, that does not come to be; with the cessation of this, that ceases.[n.60b] This is the abstract formula of dependent origination: imasmiṁ sati idaṁ hoti, imass’ uppada idaṁ uppajjati; imasmiṁ asati idaṁ na hoti, imassa nirodha idaṁ nirujjhati.Spk-pṭ explains that what is meant by existence in the first part of the formula is not actual presence as such but \"the state of not having been brought to cessation by the path\"; similarly, what is meant by nonexistence in the second part of the formula is not mere absence as such but \"the state of having been brought to cessation by the path.\" A long, complex explanation of the formula (abridged in Spk-pṭ) is found at Ud-a 38–42 (translated inMasefield,The Udana Commentary,:66–72). See too n.4above. The use of the formula here, immediately following the statement on the aggregates, connects the origin and passing away of the five aggregates to dependent origination, indicating that the former should be understood in terms of the latter.That is, with ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering. But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering.’\"",
    "sn12.22:2": "\"Bhikkhus, the Dhamma has thus been well expounded by me, elucidated, disclosed, revealed, stripped of patchwork.[n.60]Chinnapilotika.Spk: Patchwork(pilotika)is an old cloth, cut up and torn, that has been sewn and stitched here and there. If one does not wear this, but is clothed in a sheet of uncut cloth, one is said to be \"free of patchwork.\" This Dhamma is similar, for in no way is it sewn up and stitched together by deceitful means, etc.This encomium of the Dhamma is also atMN I 141–4. AtSN16.11(II 0,1 and 1,5 foll.) there occurs the expressionpaṭapilotikanaṁ saṅghati,\"an outer robe of patches.\"When, bhikkhus, the Dhamma has thus been well expounded by me, elucidated, disclosed, revealed, stripped of patchwork, this is enough for a clansman who has gone forth out of faith to arouse his energy thus: ‘Willingly, let only my skin, sinews, and bones remain, and let the flesh and blood dry up in my body, but I will not relax my energy so long as I have not attained what can be attained by manly strength, by manly energy, by manly exertion. ’[n.61] Spk calls this four-factored energy(caturaṅgasamannāgataṁ viriyaṁ); the four factors are to be understood by way of skin, sinews, bones, and flesh-and-blood. The vow recurs below atSN1.3(II 76,1–16) and is also atMN I 481,1–5. At Ja I 71,4–7 the Bodhisatta makes the same resolve when he takes his seat at the foot of the Bodhi Tree.sn.ii.9",
    "sn12.22:3": "\"Bhikkhus, the lazy person dwells in suffering, soiled by evil unwholesome states, and great is the personal good that he neglects.[n.62]Spkglossessadatthaṁ: sobhanaṁ vā atthaṁ sakaṁ vā atthaṁ,\"beautiful good or own good.\" The latter explanation is more likely. The common translation of the expression as \"true good,\" takingsadto representsant,does not seem to have the support of the commentaries.But the energetic person dwells happily, secluded from evil unwholesome states, and great is the personal good that he achieves. It is not by the inferior that the supreme is attained; rather, it is by the supreme that the supreme is attained.[n.6]Spk: It is not by inferior faith, energy, mindfulness, concentration, and wisdom that the supreme—namely, arahantship—is to be attained. The supreme must be attained by supreme faith and so forth.Bhikkhus, this holy life is a beverage of cream; the Teacher is present.[n.64]Spkexplainsmaṇḍapeyyaas a compound ofmaṇḍain the sense of clear(pasanna)andpeyyain the sense of what is to be drunk(pātabba). It seems thatmaṇḍaoriginally meant the best part of milk or butter, i.e., the cream, and like the English word came to signify the essence or finest part of anything. AtSN4.1, etc., we findsappimaṇḍa,\"cream-of-ghee,\" the finest of dairy products.Spk: There are three types of cream: (i) the cream of teachings(desanamaṇḍa), i.e., the Four Noble Truths and the thirty-seven aids to enlightenment; (ii) the cream of recipients(paṭiggahamaṇḍa), i.e., disciples capable of understanding those teachings; and (iii) the cream of holy lives(brahmacariyamaṇḍa), i.e., the Noble Eightfold Path. The words \"while the Teacher is present\"(sattha sammukhibhūto)show the reason: since the Teacher is present, having made an energetic effort, you should drink this cream.This sentence serves as the heading for an entire treatise of Paṭis (No. 10; II 86–91), which applies the metaphor of cream in detail to all the factors of the Buddhist training.Therefore, bhikkhus, arouse your energy for the attainment of the as-yet-unattained, for the achievement of the as-yetunachieved, for the realization of the as-yet-unrealized,with the thought: ‘In such a way this going forth of ours will not be barren, but fruitful and fertile; and when we use the robes, almsfood, lodgings, and medicinal requisitesoffered to us by others, these services they provide for us will be of great fruit and benefit to them.’[n.65] We should read, withBeand Se,tesaṁ te kārā amhesu mahapphalā bhavissanti,as againsttesaṁ vo kārāin Ee. The sense of this line has been missed by C.Rh.D at KS 2:24, and Walshe follows her at SN-Anth :20. Cp.MN I 140,2–24, 1–2:Yaṁ kho idaṁ pubbe pariññātaṁ tattha me (no) evarūpā kārā karīyanti. PED recognizeskārāin the sense of \"service, act of mercy or worship,\" but does not include these references.Thus, bhikkhus, should you train yourselves."
}