{
    "sn12.48:1": "At Sāvatthī. Then a brahmin who was a cosmologist[n.28] Lokayatika.Spksays that he was versed in lokayata, the science of debate(vitaṇḍasatthe lokāyate kataparicayo). Spk-pṭ explains the etymology of the word thus: \"Lokāyatais so called because by means of this the world does not strive for, does not advance towards, future welfare(āyatiṁ hitaṁ tena loko na yatati na īhatī ti lokāyataṁ). For on account of this belief, beings do not arouse even the thought of doing deeds of merit, much less do they make the effort.\"Spk-pṭ's explanation seems to reflect the understanding oflokāyataheld at the time of the commentaries, as seen in MW's definition of the word as \"materialism, the system of atheistical philosophy (taught by Carvaka).\" There is cogent evidence, however, that the word acquired these connotations only in a later period. As Rhys Davids points out in a detailed discussion (atDialogues of the Buddha,:66–72), lokayāta is used in the Nikāyas in a complimentary sense to designate a branch of brahmanical learning (as atDN I 88,7, 4,3, etc.). He suggests that the word originally meant nature-lore and only gradually acquired the negative meaning of sophistry and materialism. Jayatilleke has proposed that since the word is always used with reference to loka, the world, orsabba,the all, it originally signified, not nature-lore in general, but cosmology, and that the arrangement oflokāyatatheses in opposing pairs indicates that the brahmins used the rival cosmological theories as topics of debate (Early Buddhist Theory of Knowledge,pp. 48–57).approached the Blessed One … and said to him:",
    "sn12.48:2": "\"How is it, Master Gotama: does all exist?\" \"‘All exists’: this, brahmin, is the oldest cosmology.\"[n.19]Jeṭṭhaṁ etaṁ lokāyataṁ.Spkglossesjeṭṭhaṁwithpaṭhamaṁand explains: \"Lokāyatais an inferior, tainted speculative view that appears great and deep\" (mahantaṁ gambhiran ti upaṭṭhitaṁ parittaṁ sāsavāṁ diṭṭhigataṁ;reading as in Se, which seems more reliable here than Be).",
    "sn12.48:3": "\"Then, Master Gotama, does all not exist?\" \"‘All does not exist’: this, brahmin, is the second cosmology.\"",
    "sn12.48:4": "\"How is it, Master Gotama: is all a unity?\"[n.130]Ekattaṁ.Spk: He asks whether it has a permanent nature(niccasabhāva); the first and third views are forms of the eternalist view(sassatadiṭṭhi).\"‘All is a unity’: this, brahmin, is the third cosmology.\"",
    "sn12.48:5": "\"Then, Master Gotama, is all a plurality?\"[n.131]Puthuttaṁ.Spk: This means a nature different from the previous nature; the second and fourth views are forms of the annihilationist view(ucchedadiṭṭhi).\"‘All is a plurality’: this, brahmin, is the fourth cosmology.",
    "sn12.48:6": "Without veering towards either of these extremes, the Tathāgata teaches the Dhamma by the middle … .\"",
    "sn12.48:7": "When this was said, that brahmin said to the Blessed One: \"Magnificent, Master Gotama! … From today let Master Gotama remember me as a lay follower who has gone for refuge for life.\""
}