{
    "sn12.21:1": "At Sāvatthī. \"Bhikkhus, possessing the ten powers and the four grounds of self-confidence, the Tathāgata claims the place of the chief bull of the herd, roars his lion's roar in the assemblies, and sets rolling the Brahma-wheel thus:[n.57] The ten powers, which are powers of knowledge(ñāṇabala), are expounded atMN2.9–20, where they are called Tathāgata powers(tathāgatabala). The ten types of knowledge are also claimed by the Venerable Anuruddha atSN52:5–5:24, but in part only, according toSpk. A detailed analysis is at Vibh 335–44. The four grounds of self-confidence(vesarajja)are explained atMN.7–72. In brief, they are the confidence: (i) that no one can challenge his claim to be enlightened about all phenomena; (ii) that no one can challenge his claim to have eradicated all the taints; (iii) that no one can challenge him regarding the states he declares to be obstacles; and (iv) that no one can challenge his claim that his teaching leads the one who practises it to liberation from suffering.Spk glossesbrahmaasseṭṭha, uttama,\"the best, the highest,\" and explains the Brahma-wheel as the purified Wheel of the Dhamma(visuddhadhammacakka). This is twofold, the knowledge of penetration(paṭivedhañāṇa)and the knowledge of teaching(desanañṇa). The former originates from wisdom and brings the Buddha’s own attainment of the noble fruits; the latter originates from compassion and enables him to teach in such a way that his disciples attain the fruits. The knowledge of penetration is supramundane(lokuttara), the knowledge of teaching mundane(lokiya). Both are self-begotten types of knowledge belonging exclusively to the Buddhas, not held in common with others.sn.ii.28‘Such is form, such its origin, such its passing away; such is feeling, such its origin, such its passing away; such is perception, such its origin, such its passing away; such are volitional formations, such their origin, such their passing away; such is consciousness, such its origin, such its passing away.[n.58] This stock meditation formula on the five aggregates is also found in SN atSN2.23,22:78,22:89,22:0. It occurs too in the two versions of the Satipaṭṭhāna Sutta atDN II 30,29–302,3andMN I 6,3–8.The origin(samudaya)and the passing away(atthaṅgama)of the aggregates are explained from the standpoint of diachronic conditionality atSN22.5and from the standpoint of synchronic conditionality atSN22.56,57. See too n.23.Thus when this exists, that comes to be; with the arising of this, that arises. When this does not exist, that does not come to be; with the cessation of this, that ceases.[n.59] This is the abstract formula of dependent origination:imasmiṁ sati idaṁ hoti, imass’ uppādā idaṁ uppajjati; imasmiṁ asati idaṁ na hoti, imassa nirodhā idaṁ nirujjhati.Spk-pṭ explains that what is meant by existence in the first part of the formula is not actual presence as such but \"the state of not having been brought to cessation by the path\"; similarly, what is meant by nonexistence in the second part of the formula is not mere absence as such but \"the state of having been brought to cessation by the path.\" A long, complex explanation of the formula (abridged in Spk-pṭ) is found at Ud-a 38–42 (translated in Masefield,The Udana Commentary,:66–72). See too n.4above. The use of the formula here, immediately following the statement on the aggregates, connects the origin and passing away of the five aggregates to dependent origination, indicating that the former should be understood in terms of the latter.That is, with ignorance as condition, volitional formationscome to be; with volitional formations as condition, consciousness … . Such is the origin of this whole mass of suffering. But with the remainderless fading away and cessation of ignorance comes cessation of volitional formations; with the cessation of volitional formations, cessation of consciousness … . Such is the cessation of this whole mass of suffering.’\""
}