{
    "sn12.31:1": "On one occasion the Blessed One was dwelling at Sāvatthī. … There the Blessed One addressed the Venerable Sāriputta thus: \"Sāriputta, in ‘The Questions of Ajita’ of the Parayana it is said:[n.87] The Parayana, the \"Going to the Far Shore,\" is the last chapter ofSn. It consists of sixteen sections (plus prologue and epilogue), in each of which the Buddha replies to questions posed by one of sixteen brahmin students. \"The Questions of Ajita\" is the first of the sixteen sections.",
    "sn12.31:2": "‘Those who have comprehended the Dhamma,And the manifold trainees here:Asked about their way of conduct,Being discreet, tell me, dear sir.’[n.88]Spk-pṭ: Those who have comprehended the Dhamma(saṅkhātadhamma)are the arahants, who have penetrated the (four) truths. The trainees(sekha)are the seven types of persons—those on the four paths and the lower three fruits.Saṅkhātadhammācould be understood to mean either \"those who have comprehended the Dhamma,\" i.e., the teaching, or \"those who have comprehended things,\" i.e., phenomena and their principles. Nidd II 34–35 (Be) glosses in both ways: as those who have known the Dhamma(ñātadhamma), by knowing all formations as impermanent, etc.; and as those who have comprehended the aggregates, elements, sense bases, etc. The trainees(sekhā)are so called because they train in the higher virtue, the higher mind (thejhānas), and the higher wisdom. Though Norman says that Pj II and Nidd II do not takesekhāandputhūas going together (GD, p. 367, n. to 1038), read correctly both these texts do place the two words in apposition. The trainees are manifold(puthū)because they fall into the seven types.",
    "sn12.31:3": "How should the meaning of this, stated in brief, be understood in detail?\"",
    "sn12.31:4": "A second time and a third time the Blessed One addressed the Venerable Sāriputta thus: \"Sāriputta, in ‘The Questions of Ajita’ in the Parayana it is said … A second time and a third time the Venerable Sāriputta was silent.[n.89] Spk: Why did he remain silent up to the third time? He was not puzzled by the question but by the Buddha’s intention(ajjhāsaya). For it was possible to answer in many ways—by way of the aggregates, elements, sense bases, or conditionality—and he wanted to catch the Teacher’s intention. Then the Teacher, aware of the reason for his silence, gave him the method with the words: “Do you see...?”sn.ii.8",
    "sn12.31:5": "‘Those who have comprehended the Dhamma,And the manifold trainees here:Asked about their way of conduct,Being discreet, tell me, dear sir.’",
    "sn12.31:6": "How should the meaning of this, stated in brief, be understood in detail?\"",
    "sn12.31:7": "\"Sāriputta, do you see: ‘This has come to be’? Sāriputta, do you see: ‘This has come to be’?\"",
    "sn12.31:8": "\"And how, venerable sir, has one comprehended the Dhamma? Venerable sir, one sees as it really is with correct wisdom: ‘This has come to be.’ Having seen as it really is with correct wisdom: ‘This has come to be,’ through revulsion towards what has come to be, through its fading away and cessation, one is liberated by nonclinging. One sees as it really is with correct wisdom: ‘Its origination occurs with that as nutriment.’ Having seen as it really is with correct wisdom: ‘Its origination occurs with that as nutriment,’ through revulsion towards its origination through nutriment, through its fading away and cessation, one is liberated by nonclinging. One sees as it really is with correct wisdom: ‘With the cessation of that nutriment, what has come to be is subject to cessation.’ Having seen as it really is with correct wisdom: ‘With the cessation of that nutriment, what has come to be is subject to cessation,’ through revulsion towards what is subject to cessation, through its fading awaysn.ii.49and cessation, one is liberated by nonclinging.[n.921] Anupādā vimutto.Spk: One is liberated by not grasping anything at all with the four kinds of clinging(upādāna). This section shows the arahant.It is in such a way that one has comprehended the Dhamma.",
    "sn12.31:9–10": "‘Those who have comprehended the Dhamma,And the manifold trainees here:Asked about their way of conduct,Being discreet, tell me, dear sir.’—",
    "sn12.31:11–14": "\"Good, good, Sāriputta! …the Buddha repeats here the entire statement of the Venerable Sāriputtasn.ii.50… it is in such a way that the meaning of this, stated in brief, should be understood in detail.\""
}