{
    "sn12.40:1": "At Sāvatthī.sn.ii.67\"Bhikkhus, what one intends, and what one plans, and whatever one has a tendency towards: this becomes a basis for the maintenance of consciousness. When there is a basis, there is a support for the establishing of consciousness. When consciousness is established and has come to growth, there is inclination. When there is inclination, there is coming and going. When there is coming and going, there is passing away and being reborn.[n.6]Spk: Inclination(nati)is craving, called \"inclination\" in the sense of inclining(namanaṭṭhena)towards pleasant forms, etc. There is coming and going(āgatigati): there is a going of consciousness by way of rebirth towards what has come up (at death), presenting itself as kamma or the sign of kamma or the sign of future destiny. (The allusion is to the three objects of the last conscious process preceding death; see CMA 5:35–37.) There is passing away, passing from here, and being reborn, rebirth there.When there is passing away and being reborn, future birth, aging-and-death, sorrow, lamentation, pain, displeasure, and despair come to be. Such is the origin of this whole mass of suffering.",
    "sn12.40:2": "\"If, bhikkhus, one does not intend, and one does not plan, but one still has a tendency towards something, this becomes a basis for the maintenance of consciousness. When there is a basis, there is a support for the establishing of consciousness … . Such is the origin of this whole mass of suffering.",
    "sn12.40:3": "\"But, bhikkhus, when one does not intend, and one does not plan, and one does not have a tendency towards anything, no basis exists for the maintenance of consciousness. When there is no basis, there is no support for the establishing of consciousness. When consciousness is unestablished and does not come to growth, there is no inclination. When there is no inclination, there is no coming and going. When there is no coming and going, there is no passing away and being reborn. When there is no passing away and being reborn, future birth, aging-and-death, sorrow, lamentation, pain, displeasure, and despair cease. Such is the cessation of this whole mass of suffering.\"[n.117] Cp. the \"teaching of the Blessed One\" recited by Mahācunda atSN5.87(IV 59,10–14)."
}