{
    "sn14.10:1": "At Sāvatthī. \"Bhikkhus, it is in dependence on the diversity of elements that there arises the diversity of perceptions …sn.ii.48as in the preceding sutta… in dependence on the diversity of quests that there arises the diversity of gains. The diversity of quests does not arise in dependence on the diversity of gains; the diversity of passions does not arise in dependence on the diversity of quests … the diversity of elements does not arise in dependence on the diversity of perceptions.",
    "sn14.10:2": "\"And how is it, bhikkhus, that in dependence on the diversity of elements there arises the diversity of perceptions … that in dependence on the diversity of quests there arises the diversity of gains? That the diversity of quests does not arise in dependence on the diversity of gains … that the diversity of elements does not arise in dependence on the diversity of perceptions?",
    "sn14.10:3": "\"In dependence on the form element there arises perception of form … in dependence on the mental-phenomena element there arises perception of mental phenomena … in dependence on the quest for mental phenomena there arises the gain of mental phenomena. The quest for mental phenomena does not arise in dependence on the gain of mental phenomena; passion for mental phenomena does not arise in dependence on the quest for mental phenomena;sn.ii.149desire for mental phenomena does not arise in dependence on passion for mental phenomena; feeling born of contact with mental phenomena does not arise in dependence on desire for mental phenomena; contact with mental phenomena does not arise in dependence on feeling born of contact with mental phenomena; intention regarding mental phenomena does not arise in dependence on contact with mental phenomena; perception of mental phenomena does not arise in dependence on intention regarding mental phenomena; the mental-phenomena element does not arise in dependence on perception of mental phenomena.",
    "sn14.10:4": "\"It is in this way, bhikkhus, that in dependence on the diversity of elements there arises the diversity of perceptions … that in dependence on the diversity of quests there arises the diversity of gains; that the diversity of quests does not arise in dependence on the diversity of gains … that the diversity of elements does not arise in dependence on the diversity of perceptions.\""
}