{
    "sn14.16:1–3": "At Sāvatthī.[n.244] This sutta, including the verses, is at It70–71. The verses alone, excluding the first two pādas, are atTh 147–48.\"Bhikkhus, it is by way of elements that beings come together and unite: those of an inferior disposition come together and unite with those of an inferior disposition. In the past they did so, in the future they will do so, and now at present they do so too.",
    "sn14.16:4": "\"Just as excrement comes together and unites with excrement, urine with urine, spittle with spittle, pus with pus, and blood with blood, so too, bhikkhus, it is by way of elements that beings come together and unite: those of an inferior disposition come together and unite with those of an inferior disposition. In the past they did so, in the future they will do so, and now at present they do so too.sn.ii.158",
    "sn14.16:6": "\"Bhikkhus, it is by way of elements that beings come together and unite: those of a good disposition come together and unite with those of a good disposition. In the past they did so, in the future they will do so, and now at present they do so too.",
    "sn14.16:7": "\"Just as milk comes together and unites with milk, oil with oil, ghee with ghee, honey with honey, and molasses with molasses, so too, bhikkhus, it is by way of elements that beings come together and unite: those of a good disposition come together and unite with those of a good disposition. In the past they did so, in the future they will do so, and now at present they do so too.\"",
    "sn14.16:8": "This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this:",
    "sn14.16:9": "“From association the woods of lust is born,[n.245]Saṁsaggā vanatho jāto.Onvanatha,see I, n.474.Spk:From association—from craving and affection based upon association through seeing and hearing—the woods is born, the woods of the defilements is born. By nonassociation it is cut: it is cut by nonassociation, by not-seeing, by avoiding standing and sitting privately (with a person of the opposite sex).By nonassociation the woods is cut.Just as one who has mounted a wooden plankWould sink upon the mighty sea,So one of virtuous living sinksBy consorting with a lethargic person.",
    "sn14.16:10": "\"Thus one should avoid such a person—One lethargic, devoid of energy.Keep company with the wise,With resolute meditators,With the noble ones who dwell secluded,Their energy constantly aroused.\"sn.ii.159"
}