{
    "sn14.7:1": "At Sāvatthī. \"Bhikkhus, it is in dependence on the diversity of elements that there arises the diversity of perceptions; in dependence on the diversity of perceptions that there arises the diversity of intentions; in dependence on the diversity of intentions that there arises the diversity of desires; in dependence on the diversity of desires that there arises the diversity of passions; in dependence on the diversity of passions that there arises the diversity of quests.",
    "sn14.7:2": "\"And how is it, bhikkhus, that in dependence on the diversity of elements there arises the diversity of perceptions … that in dependence on the diversity of passions there arises the diversity of quests?",
    "sn14.7:3": "\"In dependence on the form element there arises perception of form; in dependence on perception of form there arises intention regarding form; in dependence on intention regarding form there arises desire for form; in dependence on desire for form there arises passion for form; in dependence on passion for form there arises the quest for form….[n.227]Spk: Perception of form(rūpasaññā): the perception associated with eye-consciousness. Intention regarding form(rūpasaṅkappa): the intention associated with three cittas—the receiving, (investigating, and determining cittas). Desire for form(rūpacchanda): desire in the sense of desirousness for form. Passion for form(rūpapariḷāha): passion (lit. \"fever\") in the sense of a burning in regard to form (Spk-pṭ: for the fire of lust, etc., has the function of \"burning up\" its own support). The quest for form(rūpapariyesanā): searching in order to obtain that form, having taken along one's friends and comrades. Passion and the quest are found in different javana processes (so that passion can become an antecedent condition for the quest).",
    "sn14.7:4": "\"It is in this way, bhikkhus, that in dependence on the diversity of elements there arises the diversity of perceptions … that in dependence on the diversity of passions there arises the diversity of quests.\""
}