{
    "sn14.12:1": "At Sāvatthī. \"Bhikkhus, sensual thought arises with a source, not without a source; thought of ill will arises with a source, not without a source; thought of harming arises with a source, not without a source. And how is this so?",
    "sn14.12:2": "\"In dependence on the sensuality element there arises sensual perception;[n.34]Spk: The sensuality element(kamadhātu)is sensual thought, all sense-sphere phenomena in general, and in particular everything unwholesome except the ill-will element and the harmfulness element, which are mentioned separately here. Sensual perception arises in dependence on the sensuality element either by taking it as an object or by way of association (i.e., when sensual perception is associated with sensual thought in the same citta).All these elements are defined at Vibh 86–87, quoted by Spk. Vibh-a 74 correlates sensual thought with sensuality as defilement(kilesakāma)and sense-sphere phenomena with sensuality as sensual objects(vatthukāma). Sensual intention arises in dependence on sensual perception by way either of association or decisive support. (Association condition[sampayutta-paccaya]is a relation between simultaneous mental phenomena; decisive-support condition(upanissaya-paccaya)is a relation between a cause and effect separated in time.)in dependence on sensual perception there arises sensual intention; in dependence on sensual intention there arises sensual desire; in dependence on sensual desire there arises sensual passion; in dependence on sensual passion there arises a sensual quest. Engaged in a sensual quest, the uninstructed worldling conducts himself wrongly in three ways—with body, speech, and mind.",
    "sn14.12:3": "\"In dependence on the ill will element there arises perception of ill will;[n.25]Spk: The ill will element(byāpādadhātu)is thought of ill will or ill will itself [Spk-pṭ: i.e., hatred(dosa)]. Note that the commentaries, following the Abhidhamma's systematic treatment of the Buddha’s teaching, differentiate between ill will and thought of ill will. The two are distinct mental constituents(cetasikā dhammā), the former being a mode of the unwholesome mental factor hatred(dosa), the latter the thought(vitakka)associated with that mental factor. Similarly with harmfulness, etc.in dependence on perception of ill will there arises intention of ill will; in dependence on intention of ill will there arises desiredriven byill will; in dependence on desiredriven byill will there arises passiondriven byill will; in dependence on passiondriven byill will there arises a questdriven byill will. Engaged in a questdriven byill will, the uninstructed worldling conducts himself wrongly in three ways—with body, speech, and mind.",
    "sn14.12:4": "\"In dependence on the harmfulness element there arises perception of harming;[n.236]Spk: The harmfulness element(vihiṁsādhātu)is thought of harmfulness and harmfulness itself. Vibh 86 explains the harmfulness element as injuring beings in various ways.in dependence on perception of harming there arises intention to harm; in dependence on intention to harm there arises desire to harm; in dependence on desire to harm there arises passion to harm; in dependence on passion to harm there arises a quest to harm. Engaged in a quest to harm,sn.ii.152the uninstructed worldling conducts himself wrongly in three ways—with body, speech, and mind.",
    "sn14.12:5": "\"Suppose, bhikkhus, a man would drop a blazing grass torch into a thicket of dry grass. If he does not quickly extinguish it with his hands and feet, the creatures living in the grass and wood will meet with calamity and disaster. So too, if any ascetic or brahmin does not quickly abandon, dispel, obliterate, and annihilate the unrighteous perceptions that have arisen in him, he dwells in suffering in this very life, with vexation, despair, and fever; and with the breakup of the body, after death, a bad destination may be expected for him.",
    "sn14.12:6": "\"Bhikkhus, thought of renunciation arises with a source, not without a source; thought of non-ill will arises with a source, not without a source; thought of harmlessness arises with a source, not without a source. And how is this so?",
    "sn14.12:7": "\"In dependence on the renunciation element there arises perception of renunciation;[n.23]Spk: The renunciation element(nekkhammadhātu)is thought of renunciation and all wholesome states except the other two elements, which are to be explained separately. Perception of renunciation arises in dependence on the renunciation element by way of such conditions as conascence(sahajātapaccaya), etc.in dependence on perception of renunciation there arises intention of renunciation; in dependence on intention of renunciation there arises desire for renunciation; in dependence on desire for renunciation there arises passion for renunciation; in dependence on passion for renunciation there arises a quest for renunciation. Engaged in a quest for renunciation, the instructed noble disciple conducts himself rightly in three ways—with body, speech, and mind.",
    "sn14.12:8": "\"In dependence on the non-ill will element there arises perception of non-ill will;[n.23]Spk: The non-ill will element(abyāpādadhātu)is thought of non-ill will and non-ill will itself, i.e., lovingkindness towards beings.in dependence on perception of non-ill will there arises intention of non-ill will; in dependence on intention of non-ill will there arises desire(guided by)non-ill will; in dependence on desireguided bynon-ill will there arises passionguided bynon-ill will; in dependence on passionguided bynon-ill will there arises a questguided bynon-ill will. Engaged in a questguided bynon-ill will, the instructed noble disciple conducts himself rightly in three ways—with body, speech, and mind.",
    "sn14.12:9": "\"In dependence on the harmlessness element there arises perception of harmlessness;[n.23]Spk: The harmlessness element(avihiṁsādhātu)is thought of harmlessness and compassion.sn.ii.153in dependence on perception of harmlessness there arises intention of harmlessness; in dependence on intention of harmlessness there arises desire for harmlessness; in dependence on desire for harmlessness there arises passion for harmlessness; in dependence on passion for harmlessness there arises a quest for harmlessness. Engaged in a quest for harmlessness, the instructed noble disciple conducts himself rightly in three ways—with body, speech, and mind.",
    "sn14.12:10": "\"Suppose, bhikkhus, a man would drop a blazing grass torch into a thicket of dry grass. If he quickly extinguishes it with his hands and feet, the creatures living in the grass and wood will not meet with calamity and disaster. So too, if any ascetic or brahmin quickly abandons, dispels, obliterates, and annihilates the unrighteous perceptions that have arisen in him, he dwells happily in this very life, without vexation, despair, and fever; and with the breakup of the body, after death, a good destination may be expected for him.\""
}