{
    "sn14.1:1": "At Sāvatthī. \"Bhikkhus, I will teach you the diversity of elements.[n.223]Spk: Diversity of elements: the diversified intrinsic nature of phenomena, which gain the name \"elements\" in the sense that they have an intrinsic nature consisting in their emptiness and absence of a being(nissattaṭṭha-suññataṭṭhasaṅkhātena sabhāvaṭṭhena dhātū ti laddhanāmānaṁ dhammānaṁ nānāsabhāvo dhātunānattaṁ).Listen to that and attend closely, I will speak.\"",
    "sn14.1:2": "\"And what, bhikkhus, is the diversity of elements? The eye element, form element, eye-consciousness element; the ear element, sound element, ear-consciousness element; the nose element, odour element, nose-consciousness element; the tongue element, taste element, tongue-consciousness element; the body element, tactile-object element, body-consciousness element; the mind element, mental-phenomena element, mind-consciousness element. This, bhikkhus, is called the diversity of elements.\"[n.4]Spk: The eye element is eye-sensitivity(cakkhupasāda), the form element is the form object; the eye-consciousness element is the mind based on eye-sensitivity(cakkhupasādavatthukaṁ cittaṁ). The other four sense elements, their objects, and states of consciousness are explained in the same way, with the appropriate changes. The mind element(manodhātu)is the threefold mind element [Spk-pṭ: the two receiving(sampaṭicchana)mind elements and the functional mind element(= the five-door adverting citta)]. The mental-phenomena element(dhammadhātu)is the three aggregates—feeling, (perception, and volitional formations)—subtle form, and Nibbāna. The mind-consciousness element is all mind-consciousness (Spk-pṭ: of seventy-six types).Precise formal definitions of the elements are not to be found in the Nikāyas. Perhaps the oldest canonical source for the definitions of the eighteen elements is Vibh 87–90. This comes in the Abhidhamma-bhajaniya only, which implies that the compilers of Vibh considered the eighteen elements a proper Abhidhamma category rather than one pertaining to the suttas. Discussion from the commentarial standpoint is at Vism 484–90 (Ppn 15:17–43) and Vibh-a 76–8.The \"sensitivities\"(pasāda)are types of material phenomena, located in the gross sense organs, that are especially receptive to the appropriate types of sense objects. Both Vibh-a and Vism frame their explanations on the basis of the Abhidhamma theory of the cognitive process, which, though articulated as such only in the commentaries, already seems to underlie the classification of cittas in the Abhidhamma Piṭaka. This scheme, however, is clearly later than the Nikāyas, andSpk's attempts to reconcile the two standpoints sometimes seems contrived.The five types of sense consciousness are the cittas that exercise the rudimentary function of bare cognition of the sense object. Of the three mind elements, the \"functional\"(kiriya)is the first citta in the process, which merely adverts to the object, and hence is called the five-door adverting consciousness(pañcadvārāvajjana-citta). This is followed by the appropriate sense consciousness (eye-consciousness, etc.), a kammically resultant citta which may be either wholesome-resultant or unwholesome-resultant; hence the fivefold sense consciousness becomes tenfold. Next comes the receiving consciousness(sampaṭicchana-citta), which \"picks up\" the object for further scrutiny; this is a \"mind element\" and is either wholesome-resultant or unwholesome-resultant. Following this, an investigating consciousness(santiraṇa-citta)arises, a wholesome-resultant or unwholesome-resultant citta which investigates the object; then a determining consciousness(votthapana-citta), a functional citta which defines the object; and then comes a string of cittas calledjavana,which constitute either a wholesome or an unwholesome response to the object (or, in the case of the arahant, a merely \"functional\" response). This may be followed by a registration consciousness(tadārammaṇa), a resultant citta which records the impression of the object on the mental continuum. All the cittas from the investigating consciousness onwards are mind-consciousness element, which is of seventy-six types. In the mind door the process is somewhat different: it begins with a mind-door adverting consciousness(manodvārāvajjana-citta), followed immediately by the string ofjavanas.For details, see CMA 1:8–10,4:1–3.The mental-phenomena element(dhammadhātu)is not necessarily the object of mind-consciousness element, as one might suppose it to be by analogy with the other senses. Along with the object of mind-consciousness it includes all feeling, perception, and volitional factors that accompany consciousness in the process of cognition. Thus it belongs as much to the subjective pole of the cognitive act as to the objective pole. See particularly CMA, Table 7.4."
}