{
    "sn14.8:1": "At Sāvatthī. \"Bhikkhus, it is in dependence on the diversity of elements that there arises the diversity of perceptions …as in preceding sutta… in dependence on the diversity of passions that there arises the diversity of quests. The diversity of passions does not arise in dependence on the diversity of quests;sn.ii.45the diversity of desires does not arise in dependence on the diversity of passions; the diversity of intentions does not arise in dependence on the diversity of desires; the diversity of perceptions does not arise in dependence on the diversity of intentions; the diversity of elements does not arise in dependence on the diversity of perceptions.[n.228]Eeshould be corrected to read:no saṅkappanānattaṁ paṭicca uppajjati saññānānattaṁ; no saññānānattaṁ paṭicca uppajjati dhātunānattaṁ.",
    "sn14.8:2": "\"And how is it, bhikkhus, that in dependence on the diversity of elements there arises the diversity of perceptions … that in dependence on the diversity of passions there arises the diversity of quests? That the diversity of passions does not arise in dependence on the diversity of quests … that the diversity of elements does not arise in dependence on the diversity of perceptions?",
    "sn14.8:3": "\"In dependence on the form element there arises perception of form;… in dependence on passion for form there arises the quest for form. Passion for form does not arise in dependence on the quest for form; desire for form does not arise in dependence on passion for form; intention regarding form does not arise in dependence on desire for form; perception of form does not arise in dependence on intention regarding form; the form element does not arise in dependence on perception of form.…[n.229] Text enclosed in brackets is found inEeand Se, but without the elision. Se further develops the pattern for the sound element, while Be proceeds directly fromrūpadhātuṁ bhikkhave paṭicca uppajjati rūpasaññātodhammadhātuṁ paṭicca uppajjatidhammasaññāand develops the pattern for the mental-phenomena element alone.",
    "sn14.8:4": "\"It is in this way, bhikkhus, that in dependence on the diversity of elements there arises the diversity of perceptions … that in dependence on the diversity of passions there arises the diversity of quests. That the diversity of passions does not arise in dependence on the diversity of quests … that the diversity of elements does not arise in dependence on the diversity of perceptions.\""
}