{
    "sn14.11:1": "At Sāvatthī.sn.ii.50\"Bhikkhus, there are these seven elements. What seven? The light element, the beauty element, the base of the infinity of space element, the base of the infinity of consciousness element, the base of nothingness element, the base of neither-perception-nor-nonperception element, the cessation of perception and feeling element. These are the seven elements.\"[n.23]Spk: The light element(abhadhātu)is a name for the jhāna together with its object, that is, light(āloka)and thejhānaarisen after doing the preparatory work on the light-kasiṇa. The beauty element(subhadhātu)is just the jhāna together with its object, namely, the jhāna arisen on the basis of a beautifulkasiṇa.The others are self-explanatory.",
    "sn14.11:2": "When this was said, a certain bhikkhu asked the Blessed One: \"Venerable sir, as to the light element … the cessation of perception and feeling element: in dependence on what are these elements discerned?\"",
    "sn14.11:3": "\"Bhikkhu, the light element is discerned in dependence on darkness. The beauty element is discerned in dependence on foulness. The base of the infinity of space element is discerned in dependence on form. The base of the infinity of consciousness element is discerned in dependence on the base of the infinity of space. The base of nothingness element is discerned in dependence on the base of the infinity of consciousness. The base of neither-perception-nor-nonperception element is discerned in dependence on the base of nothingness. The cessation of perception and feeling element is discerned in dependence on cessation.\"[n.22]Spk: The light element is discerned in dependence on darkness: for darkness is delimited by (contrasted with) light, and light by darkness. Similarly, foulness is delimited by (contrasted with) beauty, and beauty by foulness. In dependence on form: in dependence on a form-sphere meditative attainment. For when one has a form-sphere attainment one can overcome form or attain the base of the infinity of space. In dependence on cessation(nirodhaṁ paṭicca): in dependence on the reflectively induced nonoccurrence(paṭisaṅkhā-appavatti)of the four (mental) aggregates. For the attainment of cessation is discerned in dependence on the cessation of the aggregates, not on their occurrence. And here it is just the cessation of the four aggregates that should be understood as \"the attainment of cessation.\"",
    "sn14.11:4": "\"But, venerable sir, as to the light element … the cessation of perception and feeling element: how is the attainment of these elements to be attained?\"",
    "sn14.11:5": "\"The light element, the beauty element, the base of the infinity of space element, the base of the infinity of consciousness element,sn.ii.11and the base of nothingness element: these elements are to be attained as attainments with perception. The base of neither-perception-nor-nonperception element: this element is to be attained as an attainment with a residue of formations.[n.233]Spk: An attainment with a residue of formations(saṅkhārā-vasesasamāpatti): because of a residue of subtle formations. According to Vism 337–38 (Ppn 10:47–4), in this attainment perception and the other mental factors are present merely in a subtle residual mode and thus cannot perform their decisive functions; hence the ambivalence in the name.The cessation of perception and feeling element: this element is to be attained as an attainment of cessation.\""
}