{
    "sn14.9:1": "At Sāvatthī. \"Bhikkhus, it is in dependence on the diversity of elements that there arises the diversity of perceptions; in dependence on the diversity of perceptions that there arises the diversity of intentions; in dependence on the diversity of intentions that there arises the diversity of contacts; in dependence on the diversity of contacts that there arises the diversity of feelings; in dependence on the diversity of feelings that there arises the diversity of desires; in dependence on the diversity of desires that there arises the diversity of passions; in dependence on the diversity of passions that there arises the diversity of quests; in dependence on the diversity of quests that there arises the diversity of gains.[n.230] This attempt to combine into one series the discrete sequences beginning with contact and perception leads to some strange incongruities, which become even more bizarre among the negations of the following sutta. Elsewhere contact is said to be the condition for the manifestation of the aggregates of feeling, perception, and volitional formations (e.g., atSN22.82III 0,33–02,2, and seeSN35.93(IV 68,5–6)); yet here contact and feeling are said to be dependent on perception and intention. NeitherSpknor Spk-pṭ shows any signs of uneasiness over the discrepancies nor tries to justify them.AtMN I ,35–2,3a sequence of mental phenomena is given as follows: contact > feeling > perception > thought > conceptual proliferation > obsession by perceptions and notions arisen from proliferation. The texts often treat thought(vitakka)as identical with intention(saṅkappa); proliferation(papañca)includes craving(taṇhā), which is synonymous with desire(chanda); and obsession(samudācāra)may comprise passions and quests, etc. This would then give us a more cogent version of the series. Spk does in fact refer to one elder, Uruvelayavasi Cūḷatissa Thera, who said: \"Although the Blessed One inserted contact and feeling in the middle of the text, having turned the text back(paḷiṁ pana parivaṭṭetva)we get: perception, intention, desire, passion, quest, and gain in regard to the stated object (form, etc.), ‘gain of form’ being the object gained together with craving; then there is contact as the (mental) contact with the object gained and feeling as the experiencing of the object. In such a way this pair—contact with form and feeling—is found.\"Spk continues on its own: \"And here, perception, intention, contact, feeling, and desire are found both in the same javana process and in different javana processes, while passion, quest, and gain are found only in differentjavanaprocesses.\"",
    "sn14.9:2": "\"And how is it, bhikkhus, that in dependence on the diversity of elementssn.ii.147there arises the diversity of perceptions … that in dependence on the diversity of quests there arises the diversity of gains?",
    "sn14.9:3": "\"In dependence on the form element there arises perception of form; in dependence on perception of form there arises intention regarding form; in dependence on intention regarding form there arises contact with form; in dependence on contact with form there arises feeling born of contact with form; in dependence on feeling born of contact with form there arises desire for form; in dependence on desire for form there arises passion for form; in dependence on passion for form there arises the quest for form; in dependence on the quest for form there arises the gain of form … .",
    "sn14.9:4": "\"It is in this way, bhikkhus, that in dependence on the diversity of elements there arises the diversity of perceptions … that in dependence on the diversity of quests there arises the diversity of gains.\""
}