{
    "sn14.31:1": "At Sāvatthī.sn.ii.70\"Bhikkhus, before my enlightenment, while I was still a bodhisatta, not yet perfectly enlightened, it occurred to me: ‘What is the gratification, what is the danger, what is the escape in the case of the earth element? What is the gratification, what is the danger, what is the escape in the case of the water element … the heat element … the air element?’",
    "sn14.31:2": "\"Then, bhikkhus, it occurred to me: ‘The pleasure and joy that arise in dependence on the earth element: this is the gratification in the earth element. That the earth element is impermanent, suffering, and subject to change: this is the danger in the earth element. The removal and abandonment of desire and lust for the earth element: this is the escape from the earth element.[n.48]Spk: Since it is contingent upon Nibbāna(nibbānaṁ āgamma)that desire and lust are removed and abandoned, Nibbāna is the escape from it.\"‘The pleasure and joy that arise in dependence on the water element … the heat element … the air element: this is the gratification in the air element. That the air element is impermanent, suffering, and subject to change: this is the danger in the air element. The removal and abandonment of desire and lust for the air element: this is the escape from the air element.’[n.49] Spk: In this sutta the Four Noble Truths are discussed. The gratification(assāda)in the four elements is the truth of the origin; the danger(ādīnava)is the truth of suffering; the escape(nissaraṇa)is the truth of cessation; the path that understands the escape is the truth of the path.",
    "sn14.31:3–4": "\"So long, bhikkhus, as I did not directly know as they really are the gratification, the danger, and the escape in the case of these four elements, I did not claim to have awakened to the unsurpassed perfect enlightenment in this world with its devas, Māra, and Brahma, in this generation with its ascetics and brahmins, its devas and humans. But when I directly knew all this as it really is, then I claimed to have awakened to the unsurpassed perfect enlightenment in this world with … its devas and humans.sn.ii.171"
}