{
    "sn15.20:1": "On one occasion the Blessed One was dwelling at Rājagaha on Mount Vulture Peak. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn15.20:2": "\"Bhikkhus, this saṁsara is without discoverable beginning. A first point is not discerned of beings roaming and wandering on hindered by ignorance and fettered by craving. In the past, bhikkhus, this Mount Vepulla was called Pacīnavaṁsa,sn.ii.191and at that time these people were called Tivaras. The life span of the Tivaras was 40,000 years.[n.63] On the variations in the human life span during the epochs of the different Buddhas, seeDN II 3,8–4,5.DN III 68–76explains how the life span of humans will decline still further as a result of moral degeneration until it reaches a low of ten years, after which it will increase until it reaches 80,000 years in the time of the future Buddha Metteyya.They could climb Mount Pacīnavaṁsa in four days and descend in four days. At that time the Blessed One Kakusandha, an Arahant, a Perfectly Enlightened One, had arisen in the world. His two chief disciples were named Vidhura and Sañjīva, an excellent pair. See, bhikkhus! That name for this mountain has disappeared, those people have died, and that Blessed One has attained final Nibbāna. So impermanent are formations, bhikkhus, so unstable, so unreliable. It is enough, bhikkhus, to experience revulsion towards all formations, enough to become dispassionate towards them, enough to be liberated from them.",
    "sn15.20:3": "\"At another timein the past, bhikkhus, this Mount Vepulla was called Vankaka, and at that time these people were called Rohitassas. The life span of the Rohitassas was 0,000 years.[n.264]Spksays that the text should not be interpreted to mean that the life span gradually decreased from Kakusandha's age directly to that of Koṇāgamana's. Rather, the life span after Kakusandha's parinibbāna continually decreased until it reached the minimum of ten years, then it increased to an incalculable(asaṅkheyya), and then decreased again until it reached 0,000 years, at which time Koṇāgamana arose in the world. The same pattern applies to the subsequent cases, including that of Metteyya (see n.26).They could climb Mount Vankaka in three days and descend in three days. At that time the Blessed One Koṇāgamana, an Arahant, a Perfectly Enlightened One, had arisen in the world. His two chief disciples were named Bhiyyosa and Uttarā, an excellent pair. See, bhikkhus! That name for this mountain has disappeared, those people have died, and that Blessed One has attained final Nibbāna.sn.ii.192So impermanent are formations … . It is enough to be liberated from them.",
    "sn15.20:4": "\"At still another timein the past, bhikkhus, this Mount Vepulla was called Supassa, and at that time these people were called Suppiyas. The life span of the Suppiyas was 20,000 years. They could climb Mount Supassa in two days and descend in two days. At that time the Blessed One Kassapa, an Arahant, a Perfectly Enlightened One, had arisen in the world. His two chief disciples were named Tissa and Bharadvaja, an excellent pair. See, bhikkhus! That name for this mountain has disappeared, those people have died, and that Blessed One has attained final Nibbāna. So impermanent are formations … . It is enough to be liberated from them.",
    "sn15.20:5": "\"At present, bhikkhus, this Mount Vepulla is called Vepulla, and at present these people are called Magadhans. The life span of the Magadhans is short, limited, fleeting; one who lives long lives a hundred years or a little more. The Magadhans climb Mount Vepulla in an hour and descend in an hour. At present I have arisen in the world, an Arahant, a Perfectly Enlightened One. My two chief disciples are named Sāriputta and Moggallana, an excellent pair. There will come a time, bhikkhus,sn.ii.193when the name for this mountain will have disappeared, when these people will have died, and I will have attained final Nibbāna. So impermanent are formations, bhikkhus, so unstable, so unreliable. It is enough, bhikkhus, to experience revulsion towards all formations, enough to become dispassionate towards them, enough to be liberated from them.\"",
    "sn15.20:6": "This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this:",
    "sn15.20:7": "\"This was called Pacīnavaṁsa by the Tivaras,And Vankaka by the Rohitassas,Supassa by the Suppiya people,Vepulla by the Magadhan folk.",
    "sn15.20:8": "\"Impermanent, alas, are formations,Their nature is to arise and vanish.Having arisen, they cease:Their appeasement is blissful.\"[n.265] Also atSN6.15(I, v.609). See toov. 21and I, n.20.sn.ii.194"
}