{
    "sn15.13:1": "At Rājagaha in the Bamboo Grove. Then thirty bhikkhus from Pava approached the Blessed One—all forest dwellers, almsfood eaters, rag-robe wearers, triple-robe users, yet all were still with fetters.[n.262] The same group of bhikkhus provided the occasion for the Buddha to institute the offering of thekaṭhinarobe at the end of the Vassa, the annual rains residence; see Vin I 253–54. Forest dwelling, etc., are four of the ascetic practices(dhutaṅga).Spk: Yet all were still with fetters(sabbe sasaṁyojanā): Some were stream-enterers, some oncereturners, some nonreturners, but among them there were no worldlings or arahants.Having approached, they paid homage to the Blessed One and sat down to one side. Then it occurred to the Blessed One: \"These thirty bhikkhus from Pava are all forest dwellers, almsfood eaters, rag-robe wearers, triple-robe users, yet all are still with fetters. Let me teach them the Dhamma in such a way that while they are sitting in these very seats their minds will be liberated from the taints by nonclinging.\"",
    "sn15.13:2": "\"Bhikkhus, this saṁsara is without discoverable beginning. A first point is not discerned of beings roaming and wandering on hindered by ignorance and fettered by craving. What do you think, bhikkhus, which is more: the stream of blood that you have shed when you were beheaded as you roamed and wandered on through this long course—this or the water in the four great oceans?\"",
    "sn15.13:3": "\"Good, good, bhikkhus! It is good that you understand the Dhamma taught by me in such a way. The stream of blood that you have shed when you were beheaded as you roamed and wandered on through this long course—this alone is more than the water in the four great oceans. For a long time, bhikkhus, you have been cows, and when as cows you were beheaded, the stream of blood that you shed is greater than the waters in the four great oceans. For a long time you have been buffalo, sheep, goats, deer, chickens, and pigs … . For a long time you have been arrested as burglars, highwaymen, and adulterers, and when you were beheaded, the stream of blood that you shed is greater than the water in the four great oceans. For what reason? Because, bhikkhus, this saṁsara is without discoverable beginning … . It is enough to be liberated from them.\"",
    "sn15.13:4": "This is what the Blessed One said. Elated, those bhikkhus delighted in the Blessed One's statement.sn.ii.189And while this exposition was being spoken, the minds of the thirty bhikkhus from Pava were liberated from the taints by nonclinging."
}