{
    "sn15.10:1": "On one occasion the Blessed One was dwelling at Rājagaha on Mount Vulture Peak. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"[n.260] The sutta, including the verses, is also atIt 7–8.",
    "sn15.10:2": "\"Bhikkhus, this saṁsara is without discoverable beginning. A first point is not discerned of beings roaming and wandering on hindered by ignorance and fettered by craving. One person, roaming and wandering on hindered by ignorance and fettered by craving, would leave behind a stack of bones, a heap of bones, a pile of bones as large as this Mount Vepulla, if there were someone to collect them and what is collected would not perish.[n.61]Spk: For these beings, the times when they are born as invertebrates is greater than the times when they are born as vertebrates; for when they become creatures such as worms, etc., they have no bones. But when they become fish and tortoises, etc., their bones are numerous. Therefore, skipping over the time when they are invertebrates and the time when they have extremely numerous bones, only the time when they have a moderate number of bones(samaṭṭhikakālo va)should be taken.For what reason? Because, bhikkhus, this saṁsara is without discoverable beginning … . It is enough to be liberated from them.\"",
    "sn15.10:3": "This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this:",
    "sn15.10:4": "\"The heap of bones one person leaves behindWith the passing of a single aeonWould form a heap as high as a mountain:So said the Great Sage.",
    "sn15.10:5": "This is declared to be as massiveAs the tall Vepulla MountainStanding north of Vulture PeakIn the Magadhan mountain raṅge.",
    "sn15.10:6": "\"But when one sees with correct wisdomThe truths of the noble ones—Suffering and its origin,The overcoming of suffering,And the Noble Eightfold PathThat leads to suffering's appeasement—Then that person, having wandered on",
    "sn15.10:7": "For seven more times at most,sn.ii.186Makes an end to sufferingBy destroying all the fetters.\""
}