{
    "sn16.10:1": "Thus have I heard. On one occasion the Venerable Mahākassapa was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the morning, the Venerable Ānanda dressed and,sn.ii.25taking bowl and robe, he approached the Venerable Mahākassapa and said: \"Come, Venerable Kassapa, let us go to the bhikkhunīs’ quarters.\"[n.286] From the absence of any reference to the Blessed One in the introduction it is likely that this sutta takes place after his parinibbāna.Spksupports this supposition (see following note), as does Ānanda's use of the vocative bhante when addressing Mahākassapa. Before the Buddha expired the monks used to address one another asāvuso,\"friend\" (seeDN II 54,9–5).Spk: Ānanda asked him to come to the bhikkhunis’ quarters in order to inspire them and to explain a meditation subject, thinking they would place faith in the talk of the disciple who was the Buddha’s counterpart(buddhapaṭibhāga-sāvaka).",
    "sn16.10:2": "Then, in the morning, the Venerable Mahākassapa dressed and, taking bowl and robe, went to the bhikkhunīs’ quarters with the Venerable Ānanda as his companion. When he arrived he sat down on the appointed seat. Then a number of bhikkhunīs approached the Venerable Mahākassapa, paid homage to him, and sat down to one side. As they were sitting there, the Venerable Mahākassapa instructed, exhorted, inspired, and gladdened those bhikkhunīs with a Dhamma talk, after which he rose from his seat and departed.",
    "sn16.10:3": "Then the bhikkhunī Thullatissa, being displeased, expressed her displeasure thus: \"How can Master Mahākassapa think of speaking on the Dhamma in the presence of Master Ānanda, the Videhan sage?[n.288] Her name means \"Fat Tissa.\"Spkglossesvedehimuniwithpaṇḍitamuni,\"wise sage,\" explaining: \"A wise person endeavours with erudition consisting in knowledge—that is, he does all his tasks—therefore he is called Videhan(paṇḍito hi ñāṇasaṅkha-tena vedena īhati … tasmā vedeho ti vuccati). He was Videhan and a sage, hence ‘the Videhan sage.’\" Ap-a 128,12, however, offers a more plausible explanation: \"Ānanda was calledvedehimunibecause he was a sage and the son of a mother from the Vedeha country(= Videha)(Vedeharaṭṭhe jātattā Vedehiyā putto).\" See I, n.2.For Master Mahākassapa to think of speaking on the Dhamma in the presence of Master Ānanda, the Videhan sage—this is just as if a needle-peddlersn.ii.216would think he could sell a needle to a needle-maker!\"",
    "sn16.10:4": "The Venerable Mahākassapa overheard the bhikkhunī Thullatissa making this statement and said to the Venerable Ānanda: \"How is it, friend Ānanda, am I the needle-peddler and you the needle-maker, or am I the needle-maker and you the needle-peddler?\"",
    "sn16.10:5": "\"Hold it, friend Ānanda! Don’t give the Saṅgha occasion to investigate you further.[n.290]Spk: This is what is meant: \"Do not let the Saṅgha think, ‘Ānanda restrained the disciple who was the Buddha’s counterpart, but he did not restrain the bhikkhuni. Could there be some intimacy or affection between them?’\" He utters the following passage (on his meditative attainments) to demonstrate how he is the Buddha’s counterpart.What do you think, friend Ānanda, was it you that the Blessed One brought forward in the presence of the Bhikkhu Saṅgha, saying: ‘Bhikkhus, to whatever extent I wish, secluded from sensual pleasures, secluded from unwholesome states, I enter and dwell in the first jhāna, which is accompanied by thought and examination, with rapture and happiness born of seclusion. Ānanda too, to whatever extent he wishes, secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhāna’?\"",
    "sn16.10:6–7": "\"I was the one, friend, that the Blessed One brought forward in the presence of the Bhikkhu Saṅgha, saying: ‘Bhikkhus, to whatever extent I wish, … I enter and dwell in the first jhāna … . Kassapa too, to whatever extent he wishes, enters and dwells in the first jhāna.’The same exchange is repeated for the remaining meditative attainments and the six direct knowledges, all as in the preceding sutta.sn.ii.217",
    "sn16.10:8": "\"I was the one, friend, that the Blessed One brought forward in the presence of the Bhikkhu Saṅgha, saying: ‘Bhikkhus, by the destruction of the taints, in this very life I enter and dwell in the taintless liberation of mind, liberation by wisdom, realizing it for myself with direct knowledge. Kassapa too, by the destruction of the taints, in this very life enters and dwells in the taintless liberation of mind, liberation by wisdom, realizing it for himself with direct knowledge.’",
    "sn16.10:9": "\"Friend, one might just as well think that a bull elephant seven or seven and a half cubits high could be concealed by a palm leaf as think that my six direct knowledges could be concealed.\"[n.21]Spkglossessattaratana(seven cubits) assattahatthappamāṇa(the measurement of seven hands); ahattha(lit. \"hand\"), which extends from the elbow to the fingertip, is approximately two feet. This is one of the rare texts in the Nikāyas where the wordabhiññāis used collectively to designate the six higher knowledges.",
    "sn16.10:10": "But the bhikkhunī Thullatissa fell away from the holy life.[n.292]Spk: After she had censured the disciple who was the Buddha’s counterpart, even while Mahākassapa was roaring his lion's roar about the sixabhiññās,her saffron robes began to irritate her body like thorny branches or a prickly plant. As soon as she removed them and put on the white clothes (of a lay woman) she felt at ease."
}