{
    "sn16.7:1": "At Rājagaha in the Bamboo Grove. Then the Venerable Mahākassapa approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him: \"Exhort the bhikkhus, Kassapa, give them a Dhamma talk. Either I should exhort the bhikkhus, Kassapa,sn.ii.206or you should. Either I should give them a Dhamma talk or you should.\"",
    "sn16.7:2": "\"Venerable sir, the bhikkhus are difficult to admonish now, and they have qualities which make them difficult to admonish. They are impatient and do not accept instruction respectfully. Venerable sir,[n.83] The following, slightly expanded and including the simile of the moon, is also atAN V 13,10–14,19, ascribed to Sāriputta. There too the Buddha approves of the disciple's statement and repeats it in full.for one who has no faith in regard to wholesome states, no sense of shame, no fear of wrongdoing, no energy, and no wisdom, whether day or night comes only decline is to be expected in regard to wholesome states, not growth.",
    "sn16.7:3": "Just as, during the dark fortnight, whether day or night comes the moon declines in colour, circularity, and luminosity, in diameter and circumference, so too, venerable sir, for one who has no faith in wholesome states, no sense of shame, no fear of wrongdoing, no energy, and no wisdom, whether day or night comes only decline is to be expected in regard to wholesome states, not growth.",
    "sn16.7:4": "\"A person without faith, venerable sir: this is a case of decline. A person without a sense of shame … who is unafraid of wrongdoing … who is lazy … unwise … angry … malicious: this is a case of decline. When there are no bhikkhus who are exhorters: this is a case of decline.",
    "sn16.7:5": "\"Venerable sir, for one who has faith in regard to wholesome states, a sense of shame, fear of wrongdoing, energy, and wisdom, whether day or night comes only growth is to be expected in regard to wholesome states, not decline.",
    "sn16.7:6": "Just as, during the bright fortnight, whether day or night comes the moon grows in colour, circularity,sn.ii.207and luminosity, in diameter and circumference, so too, venerable sir, for one who has faith in wholesome states, a sense of shame, fear of wrongdoing, energy, and wisdom, whether day or night comes only growth is to be expected in regard to wholesome states, not decline.",
    "sn16.7:7": "\"A person with faith, venerable sir: this is a case of nondecline. A person with a sense of shame … who is afraid of wrongdoing … energetic … wise … without anger … without malice: this is a case of nondecline. When there are bhikkhus who are exhorters: this is a case of nondecline.\"",
    "sn16.7:8–12": "\"Good, good, Kassapa!\"The Buddha then repeats the entire statement of the Venerable Mahākassapa.sn.ii.208"
}