{
    "sn16.6:1": "At Rājagaha in the Bamboo Grove. Then the Venerable Mahākassapa approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him: \"Exhort the bhikkhus, Kassapa, give them a Dhamma talk. Either Isn.ii.204should exhort the bhikkhus, Kassapa, or you should. Either I should give them a Dhamma talk or you should.\"[n.28]Spk: He says this in order to appoint Mahākassapa to his own position. But weren’t Sāriputta and Mahāmoggallāna around? They were, but he thought: \"They will not live much longer, but Kassapa will live until the age of 20. After my parinibbāna he will hold a recital of the Dhamma and the Vinaya in the Sattapaṇṇi Cave, and he will enable my Dispensation to endure for a full 5,000 years. Let me appoint him to my own position; then the bhikkhus will think he should be heeded.\" Despite this remark of Spk, it should be noted that the Buddha expressly refused to appoint a personal successor; instead he instructed the Saṅgha that the Dhamma and the Vinaya should represent him after his passing (DN II 54,4–8).",
    "sn16.6:2": "\"Venerable sir, the bhikkhus are difficult to admonish now, and they have qualities which make them difficult to admonish.[n.8]Dovacassakaraṇehi dhammehi samannāgatā:for a list of such qualities, seeMN I 95,18–96,16.They are impatient and do not accept instruction respectfully. Here, venerable sir, I saw a bhikkhu named Bhaṇḍa, a pupil of Ānanda, and a bhikkhu named Abhiñjika, a pupil of Anuruddha, competing with each other in regard to their learning, saying: ‘Come, bhikkhu, who can speak more? Who can speak better? Who can speak longer?’\"",
    "sn16.6:3": "Then the Blessed One addressed a certain bhikkhu thus: \"Come, bhikkhu, tell the bhikkhu Bhaṇḍa and the bhikkhu Abhiñjika in my name that the Teacher calls them.\"",
    "sn16.6:4": "\"Yes, friend,\" those bhikkhus replied, and they approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to them: \"Is it true, bhikkhus, that you have been competing with each other in regard to your learning, as to who can speak more, who can speak better, who can speak longer?\"",
    "sn16.6:5": "Then those bhikkhus prostrated themselves with their heads at the Blessed One's feet and said: \"Venerable sir, we have committed a transgression—so foolish, so confused, so inept were we—in that, having gone forth in such a well-expounded Dhamma and Discipline, we competed with each other in regard to our learning, as to who can speak more, who can speak better, who can speak longer. Venerable sir, may the Blessed One pardon us for our transgression seen as a transgression for the sake of future restraint.\"",
    "sn16.6:6": "\"Surely, bhikkhus, you have committed a transgression—so foolish, so confused, so inept were you—in that, having gone forth in such a well-expounded Dhamma and Discipline, you competed with each other in regard to your learning … . But since you see your transgression as a transgression and make amends for it in accordance with the Dhamma, we pardon you for it. For it is growth in the Noble One's Discipline when one sees one's transgression as a transgression, makes amends for it in accordance with the Dhamma, and undertakes future restraint.\""
}