{
    "sn16.2:1": "Thus have I heard. On one occasion the Venerable Mahākassapa and the Venerable Sāriputta were dwelling at Baraṇasī in the Deer Park at Isipatana. Then, in the evening, the Venerable Sāriputta emerged from seclusion and approached the Venerable Mahākassapa. He exchanged greetings with the Venerable Mahākassapa and, when they had concluded their greetings and cordial talk, he sat down to one side and said to him:",
    "sn16.2:2": "In what way is this so, friend?\" \"Here, friend, a bhikkhu does not arouse ardour by thinking: ‘If unarisen evil unwholesome states arise in me, this may lead to my harm’; nor by thinking: ‘If evil unwholesome states that have arisen in me are not abandoned, this may lead to my harm’; nor by thinking: ‘If unarisen wholesome states do not arise in me, this may lead to my harm’; nor by thinking: ‘If wholesome states that have arisen in me cease, this may lead to my harm.’ Thus he is not ardent.[n.71] The four parts of this reflection correspond to the four aspects of right effort (seeSN45.8) or the four right kinds of striving (see49:1–1).",
    "sn16.2:3": "\"And how, friend, is he unafraid of wrongdoing? Here, friend, a bhikkhu does not become afraid at the thought: ‘If unarisen evil unwholesome states arise in me, this may lead to my harm’ … nor at the thought: ‘If wholesome states that have arisen in me cease, this may lead to my harm.’ Thus he is unafraid of wrongdoing.",
    "sn16.2:4": "\"And how, friend, is one ardent? Here, friend, a bhikkhu arouses ardour by thinking: ‘If unarisen evil unwholesome states arise in me, this may lead to my harm’ … and by thinking: ‘If wholesome states that have arisen in me cease, this may lead to my harm.’ Thus he is ardent.",
    "sn16.2:5": "\"And how, friend, is he afraid of wrongdoing? Here, friend, a bhikkhu becomes afraid at the thought: ‘If unarisen evil unwholesome states arise in me, this may lead to my harm’; … and at the thought: ‘If wholesome states that have arisen in me cease, this may lead to my harm.’sn.ii.197Thus he is afraid of wrongdoing."
}