{
    "sn16.3:1": "At Sāvatthī. \"Bhikkhus, you should approach families like the moon—sn.ii.98drawing back the body and mind, always acting like newcomers, without impudence towards families.[n.272]Spk: \"As the moon, gliding across the sky, does not form intimacy, affection, or attachment with anyone, nor give rise to fondness, longing, and obsession, yet remains dear and agreeable to the multitude, so you too should not form intimacy, etc., with anyone; then, by doing so, you will approach families like the moon, dear and agreeable to the multitude. Further, as the moon dispels darkness and emits light, so you will dispel the darkness of defilements and emit the light of knowledge.\"Spk explainsapakassaas an absolutive, equivalent toapakassitvāand glossedapanetvā,\"having pulled away.\" A bhikkhu draws back the body when he lives in a forest abode (rather than a village temple) and draws back the mind when he refrains from sensual thoughts and other harmful mental states.Just as a man looking down an old well, a precipice, or a steep riverbank would draw back the body and mind, so too, bhikkhus, should you approach families.",
    "sn16.3:2": "\"Bhikkhus, Kassapa approaches families like the moon—drawing back the body and mind, always acting like a newcomer, without impudence towards families. What do you think, bhikkhus, what kind of bhikkhu is worthy to approach families?\"",
    "sn16.3:3": "Then the Blessed One waved his hand in space[n.27]Spk: This is a unique phrase(asambhinnapada)in the Word of the Buddha preserved in the Tipiṭaka. Spk-pṭ: For nowhere else has this phrase, \"The Blessed One waved his hand in space,\" been recorded.and said: \"Bhikkhus, just as this hand does not get caught in space, is not held fast by it, is not bound by it, so when a bhikkhu approaches families his mind does not get caught, held fast, and bound amidst families, thinking: ‘May those desiring gains acquire gains, may those desiring merits make merits!’[n.274] This is a self-serving thought. The bhikkhu wants to see the bhikkhus receive offerings and the lay followers \"make merit\" by offering gifts to them. The bhikkhu who is elated over the gains of others has the virtue of altruistic joy(muditā); he does not become envious when others are chosen to receive gifts rather than himself.He is as elated and happy over the gains of others as he is over his own gains. Such a bhikkhu is worthy to approach families.",
    "sn16.3:4": "\"Bhikkhus, when Kassapa approaches families his mind does not get caught, held fast, or bound amidst families, thinking: ‘May those desiring gains acquire gains, may those desiring merits make merits!’ He is as elated and happy over the gains of others as he is over his own gains.sn.ii.199",
    "sn16.3:5": "\"What do you think, bhikkhus, how is a bhikkhu's teaching of the Dhamma impure, and how is his teaching of the Dhamma pure?\"",
    "sn16.3:6": "\"A bhikkhu teaches the Dhamma to others with the thought: ‘Oh, may they listen to the Dhamma from me! Having listened, may they gain confidence in the Dhamma! Being confident, may they show their confidence to me!’[n.275]Pasannākāraṁ kareyyuṁ.This idiom also occurs below atSN20.9(II 29,24, 33) and atMN III 131,30–31andIII 144,18–19. Apasannākāraṁ(lit. \"a mode of the confident\") is a gift given as an expression of appreciation. The hiatus inEeshould be closed up.Spk: \"May they give the requisites, a robe and so forth!\"Such a bhikkhu's teaching of the Dhamma is impure.",
    "sn16.3:7": "\"But a bhikkhu teaches the Dhamma to others with the thought: ‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise. Oh, may they listen to the Dhamma from me! Having listened, may they understand the Dhamma! Having understood, may they practise accordingly!’ Thus he teaches the Dhamma to others because of the intrinsic excellence of the Dhamma; he teaches the Dhamma to others from compassion and sympathy, out of tender concern.[n.26]Kāruññaṁ paṭicca anudayaṁ paṭicca anukampāṁ upādāya.I generally translate bothkaruṇā(of whichkāruññaṁis a cognate) andanukampāas \"compassion.\" This is usually successful as the two seldom occur together, but the present passage is a rare exception; thus I use \"tender concern\" as a makeshift foranukampā.Spkglossesanudayawithrakkhaṇabhāva(the protective state) andanukampāwithmuducittatā(tender-heartedness), and says that both terms are synonymous withkāruññaṁ.In the next paragraph, where the same statement is applied to Kassapa, Ee has omitted a line (at II 200,3), apparently by oversight: …paresaṁ dhammaṁ deseti; kāruññaṁ paṭicca.…Such a bhikkhu's teaching of the Dhamma is pure.",
    "sn16.3:8": "\"Bhikkhus, Kassapa teaches the Dhamma to others with the thought: ‘The Dhamma is well expounded by the Blessed One … . Oh,sn.ii.200may they listen to the Dhamma from me! Having listened, may they understand the Dhamma! Having understood, may they practise accordingly!’ He teaches the Dhamma to others because of the intrinsic excellence of the Dhamma; he teaches the Dhamma to others from compassion and sympathy, out of tender concern."
}