{
    "sn16.13:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then the Venerable Mahākassapa approached the Blessed One, paid homage to him, sat down to one side, and said to him:sn.ii.224",
    "sn16.13:2": "\"Just as, Kassapa, gold does not disappear so long as counterfeit gold has not arisen in the world, but when counterfeit gold arises then true gold disappears, so the true Dhamma does not disappear so long as a counterfeit of the true Dhamma has not arisen in the world, but when a counterfeit of the true Dhamma arises in the world, then the true Dhamma disappears.",
    "sn16.13:3": "\"It is not the earth element, Kassapa, that causes the true Dhamma to disappear, nor the water element, nor the heat element, nor the air element. It is the senseless people who arise right here who cause the true Dhamma to disappear.",
    "sn16.13:4": "There are, Kassapa, five detrimental things[n.31] Pañca okkamaniya dhamma.Spkglosses: okkamaniya ti heṭṭhagamaniya, \"leading downwards.\" A parallel passage atAN III 27repeats the first four causes but replaces the fifth by \"lack of mutual respect and deference.\"that lead to the decay and disappearance of the true Dhamma. What are the five? Here the bhikkhus, the bhikkhunīs, the male lay followers, and the female lay followers dwell without reverence and deference towards the Teacher; they dwell without reverence and deference towards the Dhamma; they dwell without reverence and deference towards the Saṅgha;sn.ii.225they dwell without reverence and deference towards the training; they dwell without reverence and deference towards concentration.[n.315] Spk: One dwells without reverence for concentration when one does not attain the eight attainments(aṭṭha samāpattiyo)or make any effort to attain them.These, Kassapa, are the five detrimental things that lead to the decay and disappearance of the true Dhamma.",
    "sn16.13:5": "\"There are five things, Kassapa, that lead to the longevity of the true Dhamma, to its nondecay and nondisappearance. What are the five? Here the bhikkhus, the bhikkhunīs, the male lay followers, and the female lay followers dwell with reverence and deference towards the Teacher; they dwell with reverence and deference towards the Dhamma; they dwell with reverence and deference towards the Saṅgha; they dwell with reverence and deference towards the training; they dwell with reverence and deference towards concentration. These, Kassapa, are the five things that lead to the longevity of the true Dhamma, to its nondecay and nondisappearance.\""
}