{
    "sn16.5:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Then the Venerable Mahākassapa approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him: \"You are old now, Kassapa, and those worn-out hempen rag-robes must be burdensome for you. Therefore you should wear robes offered by householders, Kassapa, accept meals given on invitation, and dwell close to me.\"[n.278]Spk: Kassapa's robes are said to be worn-out(nibbasana)because the Blessed One, having worn them, had discarded them. (See belowSN6.; II 22,5–25.)The Buddha is apparently requesting Mahākassapa to abandon three of the ascetic practices—wearing rag-robes, eating only food collected on alms round, and living in the forest. The Buddha himself wore robes offered by householders, accepted invitations to meals, and dwelt in town monasteries; seeMN II 7–8. According to Spk, the Buddha did not really intend to make Kassapa give up his ascetic practices, but rather \"just as a drum does not give off a sound unless it is struck, so such persons do not roar their lion's roar unless they are ‘struck.’ Thus he spoke to him in this way intending to make him roar his lion's roar.\"",
    "sn16.5:2": "\"For a long time, venerable sir, I have been a forest dweller and have spoken in praise of forest dwelling; I have been an almsfood eater and have spoken in praise of eating almsfood; I have been a rag-robe wearer and have spoken in praise of wearing rag-robes; I have been a triple-robe user and have spoken in praise of using the triple robe; I have been of few wishes and have spoken in praise of fewness of wishes; I have been content and have spoken in praise of contentment; I have been secluded and have spoken in praise of solitude; I have been aloof from society and have spoken in praise of aloofness from society; I have been energetic and have spoken in praise of arousing energy.\"[n.79] This is Mahākassapa's lion's roar; see tooMN I 14,1–17, where Kassapa describes the ideal monk in the same terms. The first four items are ascetic practices; the next five, virtues nurtured by observance of these practices. AtAN I 3,0the Buddha declares Mahākassapa the foremost among his bhikkhu disciples who are proponents of the ascetic practices, as is clear too fromSN14.15above.",
    "sn16.5:3": "\"Considering what benefit, Kassapa, have you long been a forest dweller … and spoken in praise of arousing energy?\"",
    "sn16.5:4–5": "\"Considering two benefits, venerable sir.sn.ii.203For myself I see a pleasant dwelling in this very life, and I have compassion for later generations, thinking, ‘May those of later generations follow my example!’[n.280] Reading with Se: App’ eva nama pacchima janata diṭṭhanugatiṁ apajjeyya. Be and Ee have the plural apajjeyyuṁ. At KS 2:136 this is rendered: \"For surely these (those who will come after us) may fall into error.\" The translator here evidently understands diṭṭhanugati as resolvable into diṭṭhi + anugati, with diṭṭhi meaning wrong view.Spkand Spk-pṭ are silent, but I find it more plausible to take the first part of the compound as the past participle diṭṭha, \"the seen\" in the sense of an example or role model. This interpretation can claim support from the use of the idiom atAN I 126,19–20,127,22–23;III 108,5–6,251,8,and422,10, 19.See tooMLDB, n. 57.For when they hear, ‘The enlightened disciples of the Buddha were for a long time forest dwellers and spoke in praise of forest dwelling … were energetic and spoke in praise of arousing energy,’ then they will practise accordingly, and that will lead to their welfare and happiness for a long time.",
    "sn16.5:6": "Considering these two benefits, venerable sir, I have long been a forest dweller … and have spoken in praise of arousing energy.\"",
    "sn16.5:7": "\"Good, good, Kassapa! You are practising for the welfare and happiness of the multitude, out of compassion for the world, for the good, welfare, and happiness of devas and humans. Therefore, Kassapa, wear worn-out hempen rag-robes, walk for alms, and dwell in the forest.\""
}