{
    "sn16.8:1": "At Rājagaha in the Bamboo Grove. Then the Venerable Mahākassapa approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him: \"Exhort the bhikkhus, Kassapa, give them a Dhamma talk. Either I should exhort the bhikkhus, Kassapa, or you should. Either I should give them a Dhamma talk or you should.\"",
    "sn16.8:2": "\"Venerable sir, the bhikkhus are difficult to admonish now, and they have qualities which make them difficult to admonish. They are impatient and do not accept instruction respectfully.\"",
    "sn16.8:3": "\"Then, when a bhikkhu was a forest dweller and spoke in praise of forest dwelling …sn.ii.209… when he was energetic and spoke in praise of arousing energy, the elder bhikkhus would invite him to a seat, saying: ‘Come, bhikkhu. What is this bhikkhu's name? This is an excellent bhikkhu. This bhikkhu is keen on training. Come, bhikkhu, here's a seat, sit down.’",
    "sn16.8:4": "Then it would occur to the newly ordained bhikkhus: ‘It seems that when a bhikkhu is a forest dweller and speaks in praise of forest dwelling … when he is energetic and speaks in praise of arousing energy, the elder bhikkhus invite him to a seat … .’ They would practise accordingly, and that would lead to their welfare and happiness for a long time.",
    "sn16.8:5": "\"But now, Kassapa, the elder bhikkhus are no longer forest dwellers and do not speak in praise of forest dwelling …sn.ii.210… they are no longer energetic and do not speak in praise of arousing energy.",
    "sn16.8:6": "Now it is the bhikkhu who is well known and famous, one who gains robes, almsfood, lodgings, and medicinal requisites, that the elder bhikkhus invite to a seat, saying: ‘Come, bhikkhu. What is this bhikkhu's name? This is an excellent bhikkhu. This bhikkhu is keen on the company of his brothers in the holy life. Come, bhikkhu, here's a seat, sit down.’",
    "sn16.8:7": "Then it occurs to the newly ordained bhikkhus: ‘It seems that when a bhikkhu is well known and famous, one who gains robes, almsfood, lodgings, and medicinal requisites, the elder bhikkhus invite him to a seat … .’ They practise accordingly, and that leads to their harm and suffering for a long time."
}