{
    "sn16.1:1": "At Sāvatthī. \"Bhikkhus, this Kassapa is content with any kind of robe, and he speaks in praise of contentment with any kind of robe, and he does not engage in a wrong search, in what is improper, for the sake of a robe.[n.266]Spkdiscusses a threefold typology of contentment(santosa): (i) contentment that accords with one's gains(yathālābhasantosa), i.e., remaining content with any gains, whether fine or coarse; (ii) contentment that accords with one's ability(yathābālāsantosa), i.e., remaining content with whatever one needs to sustain one's health; and (iii) contentment that accords with suitability(yathāsāruppasantosa), i.e., disposing of any luxury items received and retaining only the simplest and most basic requisites. A translation of the full passage—from the parallel commentary to the Samaññaphala Sutta (Sv I 206–8)—may be found in Bodhi,Discourse on the Fruits of Recluseship,pp. 34–37. Various types of wrong search(anesanā)are discussed at Vism 22–30 (Ppn :60–84).If he does not get a robe he is not agitated, and if he gets one he uses it without being tied to it, uninfatuated with it, not blindly absorbed in it, seeing the danger in it, understanding the escape.[n.267] Spk: If he does not get a robe: If he does not get a robe he does not become agitated(na paritassati)like one who, failing to get a robe, becomes frightened and agitated and associates with meritorious bhikkhus, thinking \"How can I get a robe?\" Seeing the danger(ādīnavadassāvī): the danger of an offence in improper search and of use while being tied to it. Understanding the escape(nissaraṇapañña): he uses it knowing the escape stated in the formula, \"Only for warding off cold,\" etc. (On the formulas for the four requisites, seeMN I 0,4–20, with detailed analysis at Vism 30–35; Ppn :85–97) This passage (and the parallels in regard to the other requisites excluding medicines) is found in the Ariyavaṁsa Sutta in a description of the ideal ascetic monk (AN II 27–29).",
    "sn16.1:2–4": "\"Bhikkhus, this Kassapa is content with any kind of almsfood … with any kind of lodging … with any kind of medicinal requisites … and if he gets them he uses them without being tied to them, uninfatuated with them, not blindly absorbed in them, seeing the danger in them, understanding the escape.",
    "sn16.1:5": "\"Therefore, bhikkhus, you should train yourselves thus: ‘We will be content with any kind of robe, and we will speak in praise of contentment with any kind of robe,sn.ii.19and we will not engage in a wrong search, in what is improper, for the sake of a robe. If we do not get a robe we will not be agitated, and if we get one we will use it without being tied to it, uninfatuated with it, not blindly absorbed in it, seeing the danger in it, understanding the escape.",
    "sn16.1:6": "\"‘We will be content with any kind of almsfood … with any kind of lodging … with any kind of medicinal requisites … and if we get them we will use them without being tied to them, uninfatuated with them, not blindly absorbed in them, seeing the danger in them, understanding the escape.’ Thus should you train yourselves."
}