{
    "sn16.9:1": "At Sāvatthī. \"Bhikkhus, to whatever extent I wish, secluded from sensual pleasures, secluded from unwholesome states, I enter and dwell in the first jhāna, which is accompanied by thought and examination, with rapture and happiness born of seclusion.sn.ii.2Kassapa too, to whatever extent he wishes, secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhāna.",
    "sn16.9:2": "\"Bhikkhus, to whatever extent I wish, with the subsiding of thought and examination, I enter and dwell in the second jhāna, which has internal confidence and unification of mind, is without thought and examination, and has rapture and happiness born of concentration. Kassapa too, to whatever extent he wishes, with the subsiding of thought and examination, enters and dwells in the second jhāna.",
    "sn16.9:3": "\"Bhikkhus, to whatever extent I wish, with the fading away as well of rapture, I dwell equanimous, and mindful and clearly comprehending, I experience happiness with the body; I enter and dwell in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ Kassapa too, to whatever extent he wishes, enters and dwells in the third jhāna.",
    "sn16.9:4": "\"Bhikkhus, to whatever extent I wish, with the abandoning of pleasure and pain, and with the previous passing away of joy and displeasure, I enter and dwell in the fourth jhāna, which is neither painful nor pleasant and includes the purification of mindfulness by equanimity. Kassapa too, to whatever extent he wishes, enters and dwells in the fourth jhāna.",
    "sn16.9:5": "\"Bhikkhus, to whatever extent I wish, with the complete transcendence of perceptions of forms, with the passing away of perceptions of sensory impingement, with nonattention to perceptions of diversity, aware that ‘space is infinite,’ I enter and dwell in the base of the infinity of space. Kassapa too, to whatever extent he wishes, enters and dwells in the base of the infinity of space.",
    "sn16.9:6": "\"Bhikkhus, to whatever extent I wish, by completely transcending the base of the infinity of space, aware that ‘consciousness is infinite,’ I enter and dwell in the base of the infinity of consciousness.sn.ii.212Kassapa too, to whatever extent he wishes, enters and dwells in the base of the infinity of consciousness.",
    "sn16.9:7": "\"Bhikkhus, to whatever extent I wish, by completely transcending the base of the infinity of consciousness, aware that ‘there is nothing,’ I enter and dwell in the base of nothingness. Kassapa too, to whatever extent he wishes, enters and dwells in the base of nothingness.",
    "sn16.9:8": "\"Bhikkhus, to whatever extent I wish, by completely transcending the base of nothingness, I enter and dwell in the base of neither-perception-nor-nonperception. Kassapa too, to whatever extent he wishes, enters and dwells in the base of neither-perception-nor-nonperception.",
    "sn16.9:9": "\"Bhikkhus, to whatever extent I wish, by completely transcending the base of neither-perception-nor-nonperception, I enter and dwell in the cessation of perception and feeling. Kassapa too, to whatever extent he wishes, enters and dwells in the cessation of perception and feeling.",
    "sn16.9:10": "\"Bhikkhus, to whatever extent I wish, I wield the various kinds of spiritual power: having been one, I become many; having been many, I become one; I appear and vanish; I go unhindered through a wall, through a rampart, through a mountain as though through space; I dive in and out of the earth as though it were water; I walk on water without sinking as though it were earth; seated cross-legged, I travel in space like a bird; with my hand I touch and stroke the moon and sun so powerful and mighty; I exercise mastery with the body as far as the brahma world. Kassapa too, to whatever extent he wishes, wields the various kinds of spiritual power.",
    "sn16.9:11": "\"Bhikkhus, to whatever extent I wish, with the divine ear element, which is purified and surpasses the human, I hear both kinds of sounds, the divine and human, those that are far as well as near. Kassapa too, to whatever extent he wishes, with the divine ear element, which is purified and surpasses the human, hears both kinds of sounds.sn.ii.213",
    "sn16.9:12": "\"Bhikkhus, to whatever extent I wish, I understand the minds of other beings and persons, having encompassed them with my own mind. I understand a mind with lust as a mind with lust; a mind without lust as a mind without lust; a mind with hatred as a mind with hatred; a mind without hatred as a mind without hatred; a mind with delusion as a mind with delusion; a mind without delusion as a mind without delusion; a contracted mind as contracted and a distracted mind as distracted; an exalted mind as exalted and an unexalted mind as unexalted; a surpassable mind as surpassable and an unsurpassable mind as unsurpassable; a concentrated mind as concentrated and an unconcentrated mind as unconcentrated; a liberated mind as liberated and an unliberated mind as unliberated. Kassapa too, to whatever extent he wishes, understands the minds of other beings and persons, having encompassed them with his own mind.",
    "sn16.9:13": "\"Bhikkhus, to whatever extent I wish, I recollect my manifold past abodes, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion thus: ‘There I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn elsewhere, and there too I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn here.’ Thus I recollect my manifold past abodes with their modes and details. Kassapa too, to whatever extent he wishes, recollects his manifold past abodes with their modes and details.",
    "sn16.9:14": "\"Bhikkhus, to whatever extent I wish, with the divine eye, which is purified and surpasses the human, I see beingssn.ii.2passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and I understand how beings fare on according to their kamma thus: ‘These beings who engaged in misconduct of body, speech, and mind, who reviled the noble ones, held wrong view, and undertook actions based on wrong view, with the breakup of the body, after death, have been reborn in a state of misery, in a bad destination, in the nether world, in hell; but these beings who engaged in good conduct of body, speech, and mind, who did not revile the noble ones, who held right view, and undertook action based on right view, with the breakup of the body, after death, have been reborn in a good destination, in a heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, I see beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and I understand how beings fare on according to their kamma. Kassapa too, to whatever extent he wishes, with the divine eye, which is purified and surpasses the human, sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare on according to their kamma.",
    "sn16.9:15": "\"Bhikkhus, by the destruction of the taints, in this very life I enter and dwell in the taintless liberation of mind, liberation by wisdom, realizing it for myself with direct knowledge.[n.285] In MLDBcetovimutti paññāvimuttiis translated \"deliverance of mind and deliverance by wisdom,\" as if the two terms were separate items standing in conjunction. I now think it better to omit the conjunctive particle (which is not in the Pali) and to treat the two terms as a dual designation for what is essentially the same state.Spkexplainscetovimuttias the concentration of the fruit of arahantship(arahattaphalasamādhi), paññavimutti as the wisdom of the fruit of arahantship(arahattaphalapaññā).Kassapa too, by the destruction of the taints, in this very life enters and dwells in the taintless liberation of mind, liberation by wisdom, realizing it for himself with direct knowledge.\""
}