{
    "sn17.10:1": "At Sāvatthī. \"Bhikkhus, dreadful are gain, honour, and praise … . Bhikkhus, I see some person heresn.ii.232whose mind is overcome and obsessed by honour, with the breakup of the body, after death, reborn in a state of misery, in a bad destination, in the nether world, in hell. Then I see some person here whose mind is overcome and obsessed by lack of honour … reborn in a state of misery … . Then I see some person here whose mind is overcome and obsessed by both honour and lack of honour, with the breakup of the body, after death, reborn in a state of misery, in a bad destination, in the nether world, in hell. So dreadful, bhikkhus, are gain, honour, and praise … . Thus should you train yourselves.\"",
    "sn17.10:2": "This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this:",
    "sn17.10:3": "\"Whether he is showered with honour,Shown dishonour, or offered both,His concentration does not vacillateAs he dwells in the measureless state.[n.24] This verse and the next are atTh 1011–12andIt 74,22–75,. Here I read with Be and Seappamāṇavihārino,as against Eeappamādavihārino.The latter, however, is found in all three eds. ofTh 1011d; readings ofIt 74,25are divided.Spksupportsappamāṇa-with its gloss:appamāṇena phalasamādhinā viharantassa;\"as he is dwelling in the measureless fruition concentration.\" Th-a does not comment on the pāda at Th 1011, and the comment in It-a readsappamāda-in Be andappamāṇa-in Se.",
    "sn17.10:4": "When he meditates with perseverance,An insight-seer of subtle viewDelighting in the destruction of clinging,They call him truly a superior man.\"[n.325] We should read pāda b with Sesukhumadiṭṭhivipassakaṁas againstsukhumaṁ diṭṭhivipassakaṁin Be and Ee. The former is also the reading atTh 1012bandIt 75,1.Spk: It is a subtle view because (it is reached) through the view of the path of arahantship, and he is an insight-seer(vipassaka)because he has arrived there after having set up insight for the sake of fruition attainment. Delighting in the destruction of clinging: Delighted with Nibbāna, called the destruction of clinging.sn.ii.233"
}