{
    "sn18.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then the Venerable Rahula approached the Blessed One, paid homage to him, sat down to one side, and said to him:[n.337] Rahula was the Buddha’s son. He became a novice(sāmaṇera)at the age of seven, during the Buddha’s first visit to his native city of Kapilavatthu after his enlightenment. Other discourses spoken to him are:MN6,MN62,andMN47(the latter is the same asSN35:2) andSutta Nipata 2..",
    "sn18.1:2": "\"What do you think, Rahula, is the eye permanent or impermanent?\" –\"Impermanent, venerable sir.\" –\"Is what is impermanent suffering or happiness?\" –\"Suffering, venerable sir.\" –sn.ii.45\"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" –\"No, venerable sir.\"",
    "sn18.1:3": "\"Is the ear … the nose … the tongue … the body … the mind permanent or impermanent?\" –\"Impermanent, venerable sir.\" –\"Is what is impermanent suffering or happiness?\" –\"Suffering, venerable sir.\" –\"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" –\"No, venerable sir.\"",
    "sn18.1:4": "\"Seeing thus, Rahula, the instructed noble disciple experiences revulsion towards the eye, revulsion towards the ear, revulsion towards the nose, revulsion towards the tongue, revulsion towards the body, revulsion towards the mind. Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated.[n.338]Spkexplains the three \"grips\"(gāha)of \"mine, I, and my self\" exactly as in n.155. It takes dispassion(virāga)to denote the four paths, liberation(vimutti)the four fruits. Spk does not comment onnibbindati,\"experiences revulsion,\" but the commentaries consistently identify the corresponding nounnibbidāwith strong insight knowledge. See above n.69When it is liberated there comes the knowledge: ‘It's liberated.’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\""
}