{
    "sn19.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha, in the Bamboo Grove, the Squirrel Sanctuary. Now on that occasion the Venerable Lakkhaṇa and the Venerable Mahāmoggallāna were dwelling on Mount Vulture Peak.[n.343] The series of suttas included in this saṁyutta also occurs at Vin III 04–8.Spk: The Venerable Lakkhaṇa, a great disciple, had been one of the thousand jaṭila ascetics who received higher ordination by the \"Come, bhikkhu\" utterance (see Vin I 32–34). He attained arahantship at the end of the Discourse on Burning (SN35:28). Since he possessed a Brahma-like body that was endowed with auspicious marks(lakkhaṇasampanna), perfect in all respects, he was called \"Lakkhaṇa.\"Then, in the morning, the Venerable Mahāmoggallāna dressed and, taking bowl and robe, he approached the Venerable Lakkhaṇa and said to him: \"Come, friend Lakkhaṇa, let us enter Rājagaha for alms.\"",
    "sn19.1:2": "Then, when the Venerable Lakkhaṇa and the Venerable Mahāmoggallāna had walked for alms in Rājagaha and returned from their alms round, after their meal they approached the Blessed One. Having paid homage to the Blessed One, they sat down to one side, and the Venerable Lakkhaṇa said to the Venerable Mahāmoggallāna: \"Here, as he was coming down from Mount Vulture Peak, the Venerable Mahāmoggallāna displayed a smile in a certain place. For what reason, friend Moggallana, did you display that smile?\"",
    "sn19.1:3": "\"Here, friend, as I was coming down from Mount Vulture Peak, I saw a skeleton moving through the air. Vultures, crows, and hawks, following it in hot pursuit, were pecking at it between the ribs, stabbing it, and tearing it apart while it uttered cries of pain.[n.45] I follow Be:vitudenti vitacchenti virājenti.Se readsvitudantionly, while Ee hasvitacchenti vibhajenti.Spkcomments only on vitudenti: \"They ran and moved here and there, piercing him again and again with their metal beaks as sharp as sword blades.\" According to Spk, the vultures, etc., were actually yakkhas(yakkhagijjhā, yakkhakakā, yakkhakulalā); for such a form does not come into the visual raṅge of natural vultures, etc.It occurred to me: ‘It is wonderful, indeed! It is amazing, indeed! That there could be such a being, that there could be such a spirit, that there could be such a form of individual existence!’\"[n.46]Evarūpo pi nāma satto bhavissati evarūpo pi nāma yakkho bhavissati evarūpo pi nāma attabhāvapaṭilābho bhavissati.Spk: In saying this Moggallana shows his sense of urgency in the Dhamma, arisen out of compassion for such beings.The expressionattabhāvapaṭilābho,which literally means \"acquisition of selfhood,\" is used idiomatically to denote a concrete form of individual identity. Attabhāva sometimes occurs in a more restricted sense with reference to the physical body, for instance atUd 54,17–19.",
    "sn19.1:4": "Then the Blessed One addressed the bhikkhus thus: \"Bhikkhus, there are disciples who dwell having become vision, having become knowledge, in that a disciple can know, see, and witness such a sight. In the past, bhikkhus, I too saw that being, but I did not speak about it. For if I had spoken about it, others would not have believed me, and if they had not believed me that would have led to their harm and suffering for a long time.",
    "sn19.1:5": "\"That being, bhikkhus, used to be a cattle butcher in this same Rājagaha. Having been tormented in hell for many years, for many hundreds of years, for many thousands of years, for many hundreds of thousands of years as a result of that kamma,sn.ii.26as a residual result of that same kamma he is experiencing such a form of individual existence.\"[n.347]Spk: As a residual result of that same kamma(tass’ eva kammassa vipākāvasesena):of that \"kamma (to be experienced) in subsequent lives\"(aparāpariyakamma)accumulated by different volitions. For the rebirth in hell is produced by a certain volition, and when its result is exhausted rebirth is produced among the ghosts, etc., having as its object the residue of that kamma or the sign of the kamma (see CMA :3–38). Therefore, because that rebirth comes about through correspondence of kamma or correspondence of object(kammasabhāgatāya ārammaṇasabhāgatāya vā), it is called \"a residual result of that same kamma.\" It is said that at the time he passed away from hell, a heap of flesh-less cows’ bones became the sign (i.e., the object of the last conscious process, which then becomes the object of the rebirth-consciousness). Thus he became a ghost (in the form of) a skeleton, as if making manifest to the wise the hidden kamma."
}