{
    "sn2.7:1": "At Sāvatthī. Standing to one side, the young deva Pañcalacaṇḍa recited this verse in the presence of the Blessed One:",
    "sn2.7:2": "v.69\"The one of broad wisdom has indeed foundThe opening in the midst of confinement,The Buddha who discovered jhāna,The withdrawn chief bull, the sage.\"[n.151] AtAN IV 449–51the Venerable Ānanda gives a detailed explanation of the verse. Readings of the aorists in pādas b and c differ among the various eds., but without affecting the meaning.Spkexplains that there are two kinds of confinement(sambadha): confinement by the five hindrances and confinement by the five cords of sensual pleasure, the former being intended here. The opening pleasure, the former being intended here. The opening(okasa)is a name for jhāna. In the analysis given by Ānanda, however, confinement and the opening are explained sequentially: first the five cords of sensual pleasure are called confinement and the first jhāna the opening; thenvitakka-parajikaare confinement and the second jhāna the opening; and so on, culminating in the destruction of theāsavāsas the final opening.The withdrawn chief bull(paṭilinanisabho): The Buddha was called a chief bull atSN1.38. AtAN II 41,9–3a bhikkhu is said to bepaṭilina,\"withdrawn,\" when he has abandoned the conceit \"I am.\"",
    "sn2.7:3": "v.270\"Even in the midst of confinement they find it,O Pañcalacaṇḍa,\" said the Blessed One,\"The Dhamma for the attainment of Nibbāna—Those who have acquired mindfulness,Those perfectly well concentrated.\"[n.152] The \"Dhamma for the attainment of Nibbāna\"(dhammaṁ nibbanapattiya)is presumably the Noble Eightfold Path.Spk-pṭ: This young deva had been an obtainer of the first jhāna in a previous existence. He spoke his verse to extol the Blessed One for obtaining the bliss of jhāna. The Buddha’s reply is intended to show that the first form-sphere jhāna is a mere fragment of the infinite and immeasurable qualities of a Buddha. By mindfulness(sati)he refers to the mindfulness of insight and of the noble path. Well concentrated(susamahita)signifies both mundane and supramundane concentration.sn.i.49"
}