{
    "sn2.24:1": "Standing to one side, the young deva GhaṭikaraThe deva Ghaṭīkara had been a potter during the dispensation of the Buddha Kassapa, who had a monastic seat at Vehalinga, the potter's home town. At that time the future Buddha Gotama was his closest friend, the brahmin youth Jotipala. Although Jotipala went forth as a bhikkhu under the Buddha Kassapa, Ghaṭīkara had to remain in the household life to support his blind, aged parents. He was the Buddha’s chief supporter and had attained the stage of nonreturner. Highlights from the story, related inMN No. 8,appear in the verses to follow here. Aviha is one of the Pure Abodes (see n.83).Spksays that the seven bhikkhus were liberated by the liberation of the fruit of arahantship, which they attained immediately after taking rebirth into the Aviha brahma world.recited this verse in the presence of the Blessed One:",
    "sn2.24:2": "v.340\"Seven bhikkhus reborn in AvihaHave been fully liberated.With lust and hatred utterly destroyed,They have crossed over attachment to the world.\"",
    "sn2.24:3": "v.41\"And who are those who crossed the swamp,The realm of Death so hard to cross?Who, having left the human body,Have overcome the celestial bond?\"[n.176] in pāda a, I readpankaiṁwith Be and Ee1 as againstsaṅgaiṁ(\"tie\") in Se and Ee2.Spkstates that the abandoning of the human body implies the eradication of the five lower fetters and the celestial bond(dibbayoga)signifies the five higher fetters.",
    "sn2.24:4": "v.32\"Upaka and Palagaṇḍa,With Pukkusati—these are three.Then Bhaddiya and Bhaddadeva,And Bahudanti and Pingiya.These, having left the human body,Have overcome the celestial bond.\"[n.177] I follow the spelling of the names inSe.Upaka is the former Ajīvaka ascetic whom the newly enlightened Buddha met while en route to Isipatana (MN I 170,33–171, 20). Later, after an unhappy marriage, he entered the Saṅgha: see DPPN 1:386. The story of Pukkusati is related inMN No. 10and Ps V 33–63; see too DPPN 2:21–16.Pingiyahere may be identical with the pupil of Bavarī whose verses occur atSn 1131–9, though this remains uncertain. The identity of the other bhikkhus cannot be established.",
    "sn2.24:5": "v.343\"Good is the word you speak of them,Of those who have abandoned Māra's snares.Whose Dhamma was it that they understoodWhereby they cut through the bondage of existence?\"[n.178] I read pāda a with Be and Sekusali bhasasi tesaṁ.Spk:Kusalan ti idaṁ vacanaṁ imassa atthiti kusali; tesaṁ theranaṁ tvaṁ kusalaṁ anavajjaṁ bhasasi.",
    "sn2.24:6": "v.344\"It was not apart from the Blessed One!It was not apart from your Teaching!By having understood your DhammaThey cut through the bondage of existence.",
    "sn2.24:7": "v.345\"Where name-and-form ceases,Stops without remainder:By understanding that Dhamma hereThey cut through the bondage of existence.\"[n.19] On \"where name-and-form ceases\" see above n.46.Spkparaphrases the next to last line: \"Those elders (did so) having understood that Dhamma here in your dispensation.\"",
    "sn2.24:8": "v.346\"Deep is the speech you utter,Hard to understand, very hard to grasp.Having understood whose DhammaDo you utter such speech?\"",
    "sn2.24:9": "v.347\"In the past I was the potter,Ghaṭikara in Vehaḷinga.I supported my mother and father thenAs a lay follower of the Buddha Kassapa.",
    "sn2.24:10": "v.348\"I abstained from sexual intercourse,I was celibate, free from carnal ties.I was your fellow villager,In the past I was your friend.",
    "sn2.24:11": "v.349\"I am the one who knowsThese seven liberated bhikkhus,Who with lust and hatred utterly destroyedHave crossed over attachment to the world.\"",
    "sn2.24:12": "v.350\"Just so it was at that time,As you say, O Bhaggava:[n.180] Bhaggava was the potter's name, possibly a clan name.In the past you were the potter,Ghaṭikara in Vehaḷinga.You supported your mother and father thenAs a lay follower of the Buddha Kassapa.",
    "sn2.24:13": "v.351\"You abstained from sexual intercourse,You were celibate, free from carnal ties.You were my fellow villager,In the past you were my friend.\"",
    "sn2.24:14": "v.352Such was the meeting that took placeBetween those friends from the past,Both now inwardly developed,Bearers of their final bodies.[n.181]Spksays that the concluding verse was added by the redactors of the texts. The statement that both were inwardly developed(bhavitattanaṁ)and were bearing their final bodies(sarirantimadharinaṁ)implies that after his rebirth in the Pure Abodes, Ghaṭīkara too had become an arahant."
}