{
    "sn2.8:1": "At Sāvatthī. Then, when the night had advanced, the young deva Tayana, formerly the founder of a religious sect, of stunning beauty, illuminating the entire Jeta's Grove, approached the Blessed One.[n.53]Spkexplains \"religious sect\"(tittha)as the sixty-two views (of the Brahmajala Sutta,DN No. ). If he founded a sect based on one of these views, how could he have been reborn in heaven? Because he affirmed the doctrine of kamma and did many virtuous deeds. When he was reborn in heaven, he recognized the emancipating quality of the Buddha’s dispensation and came into the Master's presence in order to recite verses in praise of energy conformable with the dispensation.Having approached, he paid homage to the Blessed One, stood to one side, and recited these verses in the presence of the Blessed One:",
    "sn2.8:2": "v.71\"Having exerted oneself, cut the stream!Dispel sensual desires, O brahmin!Without having abandoned sensual desires,A sage does not reach unity.[n.154] in pāda a,parakkammais an absolutive, not an imperative, and hence in sense should precedechinda sotaṁ. Parakkama,the corresponding noun, is the third member of a set of three terms denoting successive stages in the development of energy:arambhadhātu, nikkamadhātu, parakkamadhātu;atSN46.,46:51 they have been translated \"the element of arousal, the element of endeavour, the element of exertion.\"",
    "sn2.8:3": "v.272\"If one would do what should be done,One should firmly exert oneself.For a slack wanderer's lifeOnly scatters more dust.",
    "sn2.8:4": "v.273\"Better left undone is the misdeed,A deed that later brings repentance.Better done is the good deedWhich when done is not repented.",
    "sn2.8:5": "v.274\"As kusa-grass, wrongly grasped,Only cuts one's hand,So the ascetic life, wrongly taken up,Drags one down to hell.",
    "sn2.8:6": "v.275\"Any deed that is slackly done,Any corrupted vow,A holy life that breeds suspicion,Does not yield great fruit.\"[n.155]Spkexplainssaṅkassaraṁin pāda c assaṅkaya saritaṁ,\"remembered with suspicion\": \"It is subject to such doubt and suspicion, ‘He must have done this, he must have done that.’\"",
    "sn2.8:7": "This is what the young deva Tayana said. Having said this, he paid homage to the Blessed One and, keeping him on the right, he disappeared right there.",
    "sn2.8:8": "Then, when the night had passed, the Blessed One addressed the bhikkhus thus: \"Bhikkhus, last night, when the night had advanced, the young deva Tayana, formerly the founder of a religious sect … … approached me … and in my presence recited these verses:",
    "sn2.8:9–13": "\"‘Having exerted oneself, cut the stream! …sn.i.50…Does not yield great fruit.’",
    "sn2.8:14": "\"This is what the young deva Tayana said. Having said this, he paid homage to me and, keeping me on the right, he disappeared right there. Learn Tayana's verses, bhikkhus. Master Tayana's verses, bhikkhus. Remember Tayana's verses, bhikkhus. Tayana's verses are beneficial, bhikkhus, they pertain to the fundamentals of the holy life.\""
}