{
    "sn2.17:1": "Standing to one side, the young deva Subrahma addressed the Blessed One in verse:[n.66]Spk: This young deva had been playing in the Nandana Grove together with his retinue of a thousand nymphs. Five hundred nymphs had climbed up a tree and were singing and throwing down flowers when they suddenly expired and were immediately reborn in the Avīci hell. When the young deva realized they were missing and discovered they had been reborn in hell, he examined his own vital force and saw that he himself and the other five hundred nymphs were due to die in seven days and to take rebirth in hell. Hence, in utter fear, he came to the Buddha seeking consolation.The story (along with the verses) is also related in the two commentaries to the Satipaṭṭhāna Sutta (Sv III 750,3–27; Ps I 235,6–236,3). Despite the commentaries, however, I prefer to regard the young deva’s question as an expression of the deep anxiety perpetually at the core of the human (and celestial) situation.",
    "sn2.17:2": "v.303\"Always frightened is this mind,The mind is always agitatedsn.i.54About unarisen problemsAnd about arisen ones.If there exists release from fear,Being asked, please declare it to me.\"[n.167] in pāda c, I readkicchesuwith Be, Se, and Ee, as againstkiccesu(duties) in Ee1 and certain SS.Kicchesuis better supported by the comment inSpk:imesu uppannanuppannesu dukkhesu,\"these sufferings both arisen and unarisen.\"",
    "sn2.17:3": "v.04\"Not apart from enlightenment and austerity,Not apart from restraint of the sense faculties,Not apart from relinquishing all,Do I see any safety for living beings.\"[n.168] I read pāda a with Be:naññatra bojjha tapasa.The readingbojjhaṅga-tapasa,in Se and Ee1 & 2, may have crept into the text from the commentarial paraphrase inSpk, which is most intelligible in the Be reading:Naññatra bojjha tapasa ti bojjhaṅgabhavanañ ca tapoguṇañ ca aññatra muñcitva sotthiṁ na passami.Spk-pṭ lends further support to this reading by glossingbojjhawithbodhitoand explaining it as an ablative. The Skt version cited at Ybhūś 5:2 hasjñanatapaso(Enomoto, CSCS, p. 8). Spk: Even though the development of the enlightenment factors is mentioned first and restraint of the sense faculties afterwards, sense restraint should be understood first. For when this is mentioned, the fourfold purification of virtue is implied (see Vism 15, 29–1 6, 16; Ppn 1:4 2). Established on this, a bhikkhu undertakes the ascetic practices, here called austerity(tapa), enters a forest, and by developing a meditation subject he develops the enlightenment factors together with insight. Then the noble path arises in him with Nibbāna as its object; the latter is what is meant by relinquishing all(sabbanissagga). (Spk-pṭ: For here everything comprised in formations is relinquished.) Thus the Blessed One turned the discourse into one on the Four Noble Truths, at the end of which the young deva was established in the fruit of stream-entry.Spk-pṭ: Though here only his own attainment of distinction is mentioned, it should be understood that the five hundred nymphs were also established in the fruit of stream-entry; for that is said in the commentary to the Mahasatipaṭṭhāna Sutta.NeitherSpknor Spk-pṭ comments on the single prose line that follows the verse (in Be:idam avoca, pa, tatth’ eva antaradhayi ti). Perhaps the young deva had acquired such a compelling sense of urgency that he quickly returned to the deva world to practise in accordance with the Buddha’s instructions. The Skt version has an additional verse, which reads in translation:After a long time at last I see",
    "sn2.17:4": "This is what the Blessed One said … . Hethe young devadisappeared right there."
}