{
    "sn2.30:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Then, when the night had advanced, a number of young devas, disciples of various sectarian teachers—Asama and Sahali and Ninka and Akoṭaka and Vetambari and Maṇavagamiya—of stunning beauty,sn.i.66illuminating the entire Bamboo Grove, approached the Blessed One. Having approached, they paid homage to the Blessed One and stood to one side.[n.90]Spk: \"These young devas were proponents of kamma; therefore they performed meritorious deeds and were reborn in heaven. Thinking that they had been reborn there on account of their confidence in their respective teachers, they came to the Buddha in order to recite verses in praise of those teachers.\" Both Pūraṇa Kassapa and Makkhali Gosāla advocated doctrines that were opposed to the Buddhist teaching on kamma; their teachings are classified among the views that normally lead to a bad rebirth.",
    "sn2.30:2": "v.365\"In injuring and killing here,In beating and extortion,Kassapa did not recognize evilNor see any merit for oneself.He indeed taught what is worthy of trust:That teacher deserves esteem.\"[n.191] The verse is a concise statement of Pūraṇa Kassapa's doctrine of nonaction(akiriyavada), for which seeDN I 5,–53,4andSN4.6(in the latter source no ascription of the view to a teacher is made). A detailed account of the teachings of the six \"heretical teachers\" (of whom four are mentioned here and all six just below atSN3.1) can be found in the Samaññaphala Sutta,DN No. ; for a translation with commentary, see Bodhi,The Discourse on the Fruits of Recluseship,esp. pp. 6–9, 19–6, 69–86.Spkparaphrases: \"In declaring that there is no result of evil or merit, he taught to beings what is trustworthy as the foundation, the support; therefore he deserves esteem, veneration, worship.\"",
    "sn2.30:3": "Then the young deva Sahali spoke this verse referring to Makkhali Gosāla in the presence of the Blessed One:[n.192] Makkhali Gosāla was the founder and leader of the sect of ascetics known as the ājīvikas. For his doctrine of non-causality (ahetukavāda), also called “purification by wandering on” (saṁsārasuddhi), seeDN I 5,25–54,21and24:7. A full account of his life and teachings can be found in Basham,History and Doctrines of the ājīvikas.",
    "sn2.30:4": "v.366\"By austerity and scrupulousnessHe attained complete self-restraint.He abandoned contentious talk with people,Refrained from falsehood, a speaker of truth.Surely such a one does no evil.\"[n.193] The verse alludes to Makkhali's style of ascetic practice but, strangely, makes no mention of his doctrines.Spkexplains his austerity(tapa)as bodily mortification and his scrupulousness(jiguccha)as the loathing of evil (Spk-pṭ: the undertaking of the vow of nudity, etc., in the belief that this is the way to eliminate evil). This explanation shows that Spk regardstapojigucchahere as a collectivedvandacompound, \"austerity and scrupulousness,\" and so I have rendered it. Sv III 83,37, however, commenting onDN III 0,13–52,22(where the Buddha gives a long disquisition on howtapojigucchais imperfect and perfect —aparipuṇṇa, paripuṇṇa), explains the compound as atappurisameaning \"scrupulousness by austerity\":Tapojiguccha ti viriyena papajiguccha papavivajjana;\"Austerity-scrupulousness: scrupulousness in regard to evil, the avoidance of evil, by means of energy.\"Tapassiandjegucchi(the corresponding nouns of personal reference) are used to designate separate factors of the Bodhisatta's \"fourfold holy life\" practised before his enlightenment atMN I 77,23–27 and 78,32–36. See too Basham, pp. 109–15, for a description of Ajīvika asceticism.",
    "sn2.30:5": "Then the young deva Ninka spoke this verse referring to Nigaṇṭha Nataputta in the presence of the Blessed One:",
    "sn2.30:6": "v.37\"A scrupulous discerning bhikkhu,Well restrained by the four controls,Explaining what is seen and heard:Surely, he could not be a sinner.\"[n.194] Nigaṇṭha Nataputta is identical with Mahavīra, the historical progenitor of Jainism. His discipline of restraint by the four controls(catuyamasaṁvara)is described atDN I 57,25–27andMN I 377,1–2.At MLDB, p. 482, the formula is translated: \"(he is) curbed by all curbs, clamped by all curbs, cleansed by all curbs, and claimed by all curbs.\" It is questionable whether either the text or its commentary (Sv I 18–9, Ps III 58–59) represents a genuine Jaina tradition.",
    "sn2.30:7": "Then the young deva Akoṭaka spoke this verse referring to various sectarian teachers in the presence of the Blessed One:",
    "sn2.30:8": "v.36\"Pakudhaka Katiyana and the Nigaṇṭha,Along with Makkhali and Pūraṇa:Teachers of companies, attained to ascetic stature:They were surely not far from superior men.\"[n.195] Pakudhaka Katiyana is an alternative spelling of Pakudha Kaccāyana, whose doctrine of the seven bodies(sattakaya)is described atDN I 56,21–57,34and atSN24..Spksays that the statement that \"they were not far from superior men\" means, in effect, that they were superior men(sappurisa), i.e., ariyans or noble ones.",
    "sn2.30:9": "Then the young deva Vetambari replied to the young deva Akoṭaka in verse:",
    "sn2.30:10": "v.369\"Even by howling along the wretched jackalRemains a vile beast, never the lion's peer.So though he be the teacher of a group,The naked ascetic, speaker of falsehood,Arousing suspicion by his conduct,Bears no resemblance to superior men.\"[n.196] in pāda a, Be and Se readsahacaritena;Ee1 readssagaravena,corrected in Ee2 tosāhāravena,\"along with (his) howling.\"Spk-pṭ supports this: \"By merely making a howl along with the roar of the lion; that is, the jackal (is not the lion's equal) merely by making a jackal's howl at the same time that the lion makes its lion's roar.\" The jackal and the lion form a classical pair of opposites in ancient Indian literature; see Ja Nos. 143 and 335, where a jackal does himself to death trying to emulate the lion's prowess in hunting, and especially Ja No. 172, where a jackal shames a group of young lions to silence by trying to imitate their roar.sn.i.67",
    "sn2.30:11": "Then Māra the Evil One took possession of the young deva Vetambari and recited this verse in the presence of the Blessed One:[n.197]Spk: Māra thought: “He has spoken dispraise of the other teachers. I will make him speak praise of them through his own mouth.”",
    "sn2.30:12": "v.370\"Those engaged in austerity and scrupulousness,Those protecting their solitude,And those who have settled on form,Delighting in the world of devas:Indeed, these mortals instruct rightlyIn regard to the other world.\"",
    "sn2.30:13": "Then the Blessed One, having understood, \"This is Māra the Evil One,\" replied to Māra the Evil One in verse:",
    "sn2.30:14": "v.371\"Whatever forms exist here or beyond,And those of luminous beauty in the sky,All these, indeed, you praise, Namuci,Like bait thrown out for catching fish.\"[n.198] Namuci is a name of Māra, whichSpk-pṭ (toSN4.1) explains as meaning \"he does not free\"(na muci: vaṭṭadukkhato aparimuttapaccayatta namuci);\"He is called Namuci because he does not let one get free from the suffering of the round.\" Spk paraphrases the Buddha’s remark: \"Just as a fisherman throws out bait at the end of a hook for the purpose of catching fish, so, by praising these forms, you throw them out in order to catch living beings.\" SeeSN35.230.",
    "sn2.30:15": "Then, in the Blessed One's presence, the young deva Maṇavagamiya recited these verses referring to the Blessed One:",
    "sn2.30:16": "v.372\"Vipula is called the best of mountainsAmong the hills of Rājagaha,Seta, the best of snow-clad mountains,The sun, the best of travellers in the sky.",
    "sn2.30:17": "v.373\"The ocean is the best body of water,The moon, the best of nocturnal lights,But in this world together with its devasThe Buddha is declared supreme.\""
}