{
    "sn2.15:1": "Standing to one side, the young deva Candana addressed the Blessed One in verse:",
    "sn2.15:2": "v.98\"Who here crosses over the flood,Unwearying by day and night?Who does not sink in the deep,Without support, without a hold?\"[n.164] The question and the reply are found, with several differences, atSn 173–75.I read pāda a with Se, Ee, andSn 173ko sū ’dha,as againstkathaṁ suin Be and Ee1; the Skt cited at Ybhūś 10:1 haska etam oghaṁ tarati(Enomoto, CSCS, p. 5).Spkexplains pāda c of the question: below it is without support(appatiṭṭhe), above it is without a hold(analambein text,analambanein gloss). The Pali wordspatiṭṭhaandalambana(orarammaṇa) have doctrinally important nuances; see n.above and1:38–40and:53–54.",
    "sn2.15:3": "v.299\"One always perfect in virtue,Endowed with wisdom, well concentrated,One energetic and resoluteCrosses the flood so hard to cross.",
    "sn2.15:4": "v.300\"One who desists from sensual perception,Who has overcome the fetter of form,Who has destroyed delight in existence—He does not sink in the deep.\"[n.165] in pāda c, I read with Ee1 and SSnandibhavaparikkhiṇo,as against Be, Se, and Ee2nandiragaparikkhiṇo(in both text andSpk). Spk's gloss on nandiraga here(tayo kammabhisaṅkhāra)corresponds so closely to its gloss onnandibhavain v.2(see n.8) that we might well suppose the original text available to the commentator read-bhava-rather than-rāga-.Sn 175also reads-bhava-,as does the version of the verse cited at Nett 16,22. Spk: By the mention of sensual perception(kamasañña)the five lower fetters are implied; by the fetter of form(rūpasaṁyojana), the five higher fetters; by delight in existence, the three kinds of kammic volitional formations (demeritorious, meritorious, imperturbable—seeSN12.51). Thus one who has abandoned the ten fetters and the three kinds of kammic formations does not sink in the deep, in the great flood. Or else: sensual perception implies sense-sphere existence; the fetter of form, form-sphere existence; and formless-sphere existence is implied by the former two. Delight in existence denotes the three kinds of kammic formations. Thus one who does not generate the three kinds of volitional formations regarding the three realms of existence does not sink in the deep."
}