{
    "sn2.23:1": "Standing to one side, the young deva Seri addressed the Blessed One in verse:",
    "sn2.23:2": "v.333\"They always take delight in food,Both devas and human beings.So what sort of spirit could it beThat does not take delight in food?\"",
    "sn2.23:3": "v.4\"When they give out of faithWith a heart of confidence,Food accrues tothe giverhimselfBoth in this world and the next.",
    "sn2.23:4": "v.335\"Therefore, having removed stinginess,The conqueror of the stain should give a gift.Merits are the support for living beingsWhen they arisein the other world.\"sn.i.58",
    "sn2.23:5": "\"It is wonderful, venerable sir! It is amazing, venerable sir! How well this was stated by the Blessed One:",
    "sn2.23:6": "v.33\"They always take delight in food,Both devas and human beings.So what sort of spirit could it beThat does not take delight in food?\"",
    "sn2.23:7": "v.33\"Therefore, having removed stinginess,The conqueror of the stain should give a gift.Merits are the support for living beingsWhen they arisein the other world.\"",
    "sn2.23:8": "\"Once in the past, venerable sir, I was a king named Seri, a donor, a philanthropist, one who spoke in praise of giving. At the four gates I had gifts given to ascetics, brahmins, paupers, wayfarers, mendicants, and beggars. Then, venerable sir, the harem women came to me and said: ‘Your majesty gives gifts, but we do not give gifts. It would be good if, with your majesty's assistance, we too might give gifts and do meritorious deeds.’ It occurred to me: ‘I am a donor, a philanthropist, one who speaks in praise of giving. So when they say, \"Let us give gifts,\" what am I to say to them?’ So, venerable sir, I gave the first gate to the harem women. There the harem women gave gifts, and my gifts returned to me.",
    "sn2.23:9": "\"Then, venerable sir, my khattiya vassals came to me and said: ‘Your majesty gives gifts, the harem women give gifts, but we do not give gifts. It would be good if, with your majesty's assistance, we too might give gifts and do meritorious deeds.’ It occurred to me: ‘I am a donor … .’ So, venerable sir, I gave the second gate to the khattiya vassals. There the khattiya vassals gave gifts, and my gifts returned to me.",
    "sn2.23:10": "\"Then, venerable sir, my troops came to me …sn.i.59… So, venerable sir, I gave the third gate to the troops. There the troops gave gifts, and my gifts returned to me.",
    "sn2.23:11": "\"Then, venerable sir, the brahmins and householders came to me … So, venerable sir, I gave the fourth gate to the brahmins and householders. There the brahmins and householders gave gifts, and my gifts returned to me.",
    "sn2.23:12": "\"Then, venerable sir, my men came to me and said: ‘Now your majesty is not giving gifts anywhere.’[n.175]Spk:koci=katthaci. Kociin this sense is probably a contraction ofkvaci.When this was said, I told those men: ‘Well then, I say, send half of the revenue generated in the outlying provinces from there to the palace. There itself give half as gifts to ascetics, brahmins, paupers, wayfarers, mendicants, and beggars.’",
    "sn2.23:13": "v.338\"‘When they give out of faithWith a heart of confidence,Food accrues tothe giverhimselfBoth in this world and the next.",
    "sn2.23:14": "v.339\"‘Therefore, having removed stinginess,The conqueror of the stain should give a gift.Deeds of merit are the support for living beingsWhen they arisein the other world.’\"sn.i.60"
}