{
    "sn2.10:1": "At Sāvatthī. Now on that occasion the young deva Suriya had been seized by Rahu, lord of the asuras.[n.58] Suriya (usually meaning simply the sun) is the deva dwelling in the mansion of the sun. Here the solar eclipse is being represented.Spk, after impressing us with Rahu's physical dimensions, offers some interesting insights into ancient Buddhist views about eclipses: When Rahu sees the sun and moon shining brightly, he becomes jealous and enters their orbital paths, where he stands with mouth agape. It then seems as if the lunar and solar mansions have been plunged into the great hell, and the devas in those mansions all cry out simultaneously in terror. While Rahu can cover the mansions with his hands, jaw, and tongue, and can even stuff his cheeks with them, he is unable to obstruct their motion. If he did make such an attempt they would split his head and come through the other side or pull him along and push him down (Spk-pṭ: because their motion is determined by the law of kamma and is extremely hard for anyone to stop directly).Then, recollecting the Blessed One, the young deva Suriya on that occasion recited this verse:",
    "sn2.10:2": "v.85\"Let homage be to you, the Buddha!O hero, you are everywhere released.I have fallen into captivity,So please be my refuge.\"",
    "sn2.10:3": "Then, referring to the young deva Suriya, the Blessed One addressed Rahu, lord of the asuras, in verse:",
    "sn2.10:4": "v.286\"Suriya has gone for refugeTo the Tathāgata, the Arahant.Release Suriya, O Rahu,Buddhas have compassion for the world.",
    "sn2.10:5": "v.287\"While moving across the sky, O Rahu,Do not swallow the radiant one,The maker of light in darkness,The disk of fiery might in the gloom.Rahu, release my child Suriya.\"[n.19]Pajaṁ mama.Spk: It is said that on the day the Buddha spoke the mahāsamaya Sutta (DN No. 20) the two young devas Candima and Suriya attained the fruit of stream-entry. Hence the Blessed One says \"my child,\" meaning \"he is my (spiritual) son.\" C.Rh.D's conjecture (at KS 1:72, n. 2) that the Buddha speaks thus with reference to his own (legendary) solar descent seems unlikely.",
    "sn2.10:6": "Then Rahu, lord of the asuras, released the young deva Suriya and hurriedly approached Vepacitti, lord of the asuras. Having approached, shocked and terrified, he stood to one side. Then, as he stood there, Vepacitti, lord of the asuras, addressed him in verse:",
    "sn2.10:7": "v.288\"Why, Rahu, did you come in a hurry?Why did you release Suriya?Having come as if in shock,Why do you stand there frightened?\"",
    "sn2.10:8": "v.29\"My head would have split in seven parts,While living I would have found no ease,If, when chanted over by the Buddha’s verses,I had not let go of Suriya.\""
}