{
    "sn2.26:1": "At Sāvatthī. Standing to one side, the young deva Rohitassa said to the Blessed One:",
    "sn2.26:2": "\"It is wonderful, venerable sir! It is amazing, venerable sir! How well this was stated by the Blessed One: ‘As to that end of the world, friend, … I say that it cannot be known, seen, or reached by travelling.’",
    "sn2.26:3": "\"Once in the past, venerable sir, I was a seer named Rohitassa, son of Bhoja, possessed of spiritual power, able to travel through the sky.sn.i.62My speed was such, venerable sir, that I could move just as swiftly as a firm-bowed archer—trained, skilful, practised, experienced—could easily shoot past the shadow of a palmyra tree with a light arrow.[n.181] This stock description of the archer is also atSN20.6(II 265,27–266,2).Spk:Daḷhadhammo = daḷhadhanu;possessed of a bow of the maximum size(uttamappamaṇena dhanuna samannagato). A pluraldaḷhadhamminooccurs below at v.708b. At EV I, n. to 1210, Norman proposes that this form must have been borrowed from a dialect where -nv- > -mm- instead of -nn-. MW lists two Skt words meaning \"with firm bows,\"dṛḍhadhanvananddṛḍhadhanvin. We might assume it is the former that appears in Pali asdaḷhadhamma,the latter asdaḷhadhammin;see too n.488. A similar development affected the homonymdhanvan(= desert); see n.264.My stride was such, venerable sir, that it seemed to reach from the eastern ocean to the western ocean. Then, venerable sir, the wish arose in me: ‘I will reach the end of the world by travelling.’ Possessing such speed and such a stride, and having a life span of a hundred years, living for a hundred years, I travelled for a hundred years, without pausing except to eat, drink, take meals and snacks, to defecate and urinate, to sleep and dispel fatigue; yet I died along the way without having reached the end of the world.",
    "sn2.26:4": "\"It is wonderful, venerable sir! It is amazing, venerable sir! How well this was stated by the Blessed One: ‘As to that end of the world, friend, where one is not born, does not age, does not die, does not pass away, and is not reborn—I say that it cannot be known, seen, or reached by travelling.’\"",
    "sn2.26:5": "\"However, friend, I say that without having reached the end of the world there is no making an end to suffering. It is, friend, in just this fathom-high carcass endowed with perception and mind that I make known the world, the origin of the world, the cessation of the world, and the way leading to the cessation of the world.[n.182]Spkglosseslokawithdukkhasaccaand each of the other terms by way of the other three noble truths. Thus the Buddha shows: \"I do not make known these four truths in external things like grass and wood, but right here in this body composed of the four great elements.\"This pithy utterance of the Buddha, which may well be the most profound proposition in the history of human thought, is elucidated atSN3.116by the Venerable Ānanda, who explains that in the Noble One's Discipline \"the world\" is \"that in the world by which one is a perceiver and conceiver of the world,\" i.e., the six sense bases. From Ānanda's explanation we can draw out the following implications: The world with which the Buddha’s teaching is principally concerned is \"the world of experience,\" and even the objective world is of interest only to the extent that it serves as the necessary external condition for experience. The world is identified with the six sense bases because the latter are the necessary internal condition for experience and thus for the presence of a world. As long as the six sense bases persist, a world will always be spread out before us as the objective raṅge of perception and cognition. Thus one cannot reach the end of the world by travelling, for wherever one goes one inevitably brings along the six sense bases, which necessarily disclose a world extended on all sides. Nevertheless, by reversing the direction of the search it is possible to reach the end of the world. For if the world ultimately stems from the six sense bases, then by bringing an end to the sense bases it is possible to arrive at the end of the world.Now the six sense bases are themselves conditioned, having arisen from a chain of conditions rooted in one's own ignorance and craving (seeSN12.44=SN3.107). Thus by removing ignorance and craving the re-arising of the six sense bases can be prevented, and therewith the manifestation of the world is terminated. This end of the world cannot be reached by travelling, but it can be arrived at by cultivating the Noble Eightfold Path. Perfect development of the path brings about the eradication of ignorance and craving, and with their removal the underlying ground is removed for the renewed emergence of the six senses, and therewith for the reappearance of a world. For a long philosophical commentary on this sutta by ñāṇananda, see SN-Anth 2:70–8.",
    "sn2.26:6": "v.357\"The world's end can never be reachedBy means of travellingthrough the world,Yet without reaching the world's endThere is no release from suffering.",
    "sn2.26:7": "v.358\"Therefore, truly, the world-knower, the wise one,Gone to the world's end, fulfiller of the holy life,Having known the world's end, at peace,Longs not for this world or another.\""
}