{
    "sn20.10:1": "At Sāvatthī. Now on that occasion a certain bhikkhu was socializing with families excessively. The other bhikkhus told him: \"The venerable one should not socialize with families excessively,\" but though he was admonished by them he did not desist.",
    "sn20.10:2": "The Blessed One said:\"Bhikkhus, once in the past a cat stood by an alley or a drain or a rubbish bin[n.374]Sandhisamalasaṅkaṭīre.Spkexplainssandhias an alley between two detached houses; samala as a channel for the discharge of waste from a house; and saṅkatira as a rubbish bin; see too Ps III 418,16 (commenting onMN I 334,7). At MLDB p. 433 the compound was translated, \"by a door-post or a dust-bin or a drain,\" but it seems these last two nouns should be inverted.watching for a little mouse, thinking: ‘When this little mouse comes out for food, right there I will grab it and eat it.’ Then that mouse came out for food, and the cat grabbed it and swallowed it hastily, without chewing it. Then that little mouse ate the cat's intestines and mesentery,sn.ii.71and on that account the cat met with death and deadly suffering.",
    "sn20.10:3": "\"So too, bhikkhus, here some bhikkhu dresses in the morning and, taking bowl and robe, enters a village or town for alms with body, speech, and mind unguarded, without setting up mindfulness, unrestrained in his sense faculties. He sees women there lightly clad or lightly attired and lust invades his mind. With his mind invaded by lust he meets death or deadly suffering. For this, bhikkhus, is death in the Noble One's Discipline: that one gives up the training and returns to the lower life. This is deadly suffering: that one commits a certain defiled offence of a kind that allows for rehabilitation.[n.75]Aññataraṁ saṅkiliṭṭhaṁ āpattiṁ āpajjati yathārūpāya āpattiyā vuṭṭhānaṁ paññāyati.An offence motivated by a defilement (in this case lust) but of a kind that can be expiated by undergoing the appropriate penalty (as opposed to an offence of the parajika class, which does not allow for expiation but requires permanent expulsion from the Saṅgha)."
}