{
    "sn20.6:1": "At Sāvatthī. \"Bhikkhus, suppose there were four firm-bowed archers,sn.ii.266trained, dexterous, experienced, standing in each of the four directions.[n.365] This sutta also appears in the introduction to Ja No. 476, which turns upon the same theme. In this story the Bodhisatta, in his incarnation as the swift goose Javanahaṁsa, performs the remarkable feat to be described just below.Spkexplains the stock description of the archers thus: Firm-bowed archers(daḷhadhammā dhanuggahā): archers with firm bows(daḷhadhanuno issāsā). A \"firm bow\" is called the strength of two thousand. \"The strength of two thousand\" means that a weight of metal, such as bronze or lead, etc. (used for the arrowhead), bound to the string when the bow is lifted (for the shot), is released from the earth when the bow is grasped by its handle and drawn back the full length of the arrow. Trained (Se and Ee:sikkhitā;Be:susikkhitā,\"well trained\"): they have studied the craft in their teacher's circle for ten or twelve years. Dexterous(katahatthā): one who has simply studied a craft is not yet dexterous, but these are dexterous, having achieved mastery over it. Experienced(katūpāsanā): they have displayed their craft in the king's court, etc.Then a man would come along, thinking: ‘I will catch the arrows shot by these four archers in each of the four directions before they reach the ground and then I will bring them back.’ What do you think, bhikkhus, would this be enough to say: ‘That man is a speedster endowed with supreme speed’?\"",
    "sn20.6:2": "\"Venerable sir, even if he could catch the arrow shot by one archer before it reached the ground and could bring it back, that would be enough to say: ‘That man is a speedster endowed with supreme speed.’ There is no need to speak about the arrows shot by all four archers!\"",
    "sn20.6:3": "\"Bhikkhus, as swift as that man is, still swifter are the sun and moon. As swift as that man is, and as swift as are the sun and moon, and as swift as are the deities that run before the sun and moon, the vital formations[n.66]Āyusaṅkhārā.Spk: This is said with reference to the physical life faculty(rūpajīvitindriya); for this perishes even faster than that. But it is not possible to describe the breakup of formless phenomena (i.e., of mental states, because according to the Abhidhamma they break up sixteen times faster than material phenomena).perish even more swiftly than that. Therefore, bhikkhus, you should train yourselves thus: ‘We will dwell diligently.’ Thus should you train yourselves.\""
}