{
    "sn22.76:1": "At Sāvatthī. \"Bhikkhus, form is impermanent. What is impermanent is suffering. What is suffering is nonself. What is nonselfsn.iii.83should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’ \"Feeling is impermanent … . Perception is impermanent … . Volitional formations are impermanent … . Consciousness is impermanent. What is impermanent is suffering. What is suffering is nonself. What is nonself should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’",
    "sn22.76:2": "\"Seeing thus, bhikkhus, the instructed noble disciple experiences revulsion towards form, revulsion towards feeling, revulsion towards perception, revulsion towards volitional formations, revulsion towards consciousness. Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated. When it is liberated there comes the knowledge: ‘It's liberated.’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’",
    "sn22.76:3": "This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this:",
    "sn22.76:4": "\"Happy indeed are the arahants!No craving can be found in them.Cut off is the conceit ‘I am,’Burst asunder is delusion's net.",
    "sn22.76:5": "“They have reached the unstirred state,[n.100] We should read with Be and Se:anejaṃ te anuppattā.Spk: This is arahantship, the abandoning of craving, which is known as “the stirring”(ejā).See 3:90, 91.Limpid are their minds;They are unsullied in the world—The holy ones, without taints.",
    "sn22.76:6": "\"Having fully understood the five aggregates,Ranging in the seven good qualities,[n.101]Sattasaddhammagocarā.The seven good qualities: faith, moral shame, fear of wrongdoing, learning, energy, mindfulness, and wisdom; seeMN I 35,1–21;DN III 252,10–12.Those praiseworthy superior menAre the Buddha’s bosom sons.",
    "sn22.76:7": "\"Endowed with the seven gems,Trained in the threefold training,[n.102] The seven gems(sattaratana)are the seven factors of enlightenment(satta bojjhaṅgā); seeSN46.42. The threefold training(tisikkhā)is the training in the higher virtue, the higher mind, and the higher wisdom; seeAN I 235–36.Those great heroes wander aboutWith fear and trembling abandoned.",
    "sn22.76:8": "\"Endowed with the ten factors,Those great nāgas, concentrated,Are the best beings in the world:No craving can be found in them.[n.103] The ten factors(dasaṅga): the eight perfected factors of the Noble Eightfold Path, augmented by right knowledge and right liberation. They are known more specifically as the ten factors of the one beyond training(asekha); seeMN I 446,29–447,6, II 29,2–12, etc. On nāga, see I, n.4.",
    "sn22.76:9": "\"The adepts’ knowledge has arisen in them:‘This body is the last I bear.’In regard to the core of the holy lifeThey no longer depend on others.sn.iii.84",
    "sn22.76:10": "“They do not waver in discrimination,[n.4]Vidhāsu na vikampati.Spk: This refers to the three modes of conceit (superior, equal, inferior).They are released from renewed existence.Having reached the stage of the tamed,They are the victors in the world.",
    "sn22.76:11": "\"Above, across, and below,Delight is no more found in them.They boldly sound their lion's roar:‘The enlightened are supreme in the world.’\""
}