{
    "sn22.85:1": "On one occasion the Venerable Sāriputta was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the following pernicious view had arisen in a bhikkhu named Yamaka: \"As I understand the Dhamma taught by the Blessed One, a bhikkhu whose taints are destroyed is annihilated and perishes with the breakup of the body and does not exist after death.\"[n.5] His position is not quite the same as that of the common annihilationist, since he does not hold that all beings are annihilated at death. He seems to hold an eternalist view in regard to unenlightened beings (since they have a lasting self which transmigrates) and annihilationism in regard to the arahant (since he utterly perishes at death).Spk: If he had thought, \"Formations arise and cease; a simple process of formations reaches nonoccurrence,\" this would not be a view(diṭṭhigata)but knowledge in accordance with the Teaching. But since he thought, \"A being is annihilated and destroyed,\" this becomes a view. What follows is paralleled byMN I 30–3andI 256–57.",
    "sn22.85:2": "A number of bhikkhus heard that such a pernicious view had arisen in the bhikkhu Yamaka. Then they approached the Venerable Yamaka and exchanged greetings with him, after which they sat down to one side and said to him: \"Is it true, friend Yamaka, that such a pernicious view as this has arisen in you:sn.iii.110‘As I understand the Dhamma taught by the Blessed One, a bhikkhu whose taints are destroyed is annihilated and perishes with the breakup of the body and does not exist after death’?\"",
    "sn22.85:3": "\"Exactly so, friends. As I understand the Dhamma taught by the Blessed One, a bhikkhu whose taints are destroyed is annihilated and perishes with the breakup of the body and does not exist after death.\"",
    "sn22.85:4": "\"Friend Yamaka, do not speak thus. Do not misrepresent the Blessed One. It is not good to misrepresent the Blessed One. The Blessed One would not speak thus: ‘A bhikkhu whose taints are destroyed is annihilated and perishes with the breakup of the body and does not exist after death.’\"",
    "sn22.85:5": "Since those bhikkhus were unable to detach the Venerable Yamaka from that pernicious view, they rose from their seats, approached the Venerable Sāriputta, and told him all that had occurred, adding: \"It would be good if the Venerable Sāriputta would approach the bhikkhu Yamaka out of compassion for him.\" The Venerable Sāriputta consented by silence.",
    "sn22.85:6": "\"Is it true, friend Yamaka, that such a pernicious view as this has arisen in you: ‘As I understand the Dhamma taught by the Blessed One,sn.iii.111a bhikkhu whose taints are destroyed is annihilated and perishes with the breakup of the body and does not exist after death’?\"",
    "sn22.85:7": "\"What do you think, friend Yamaka, is form permanent or impermanent?\" - \"Impermanent, friend.\" … - \"Therefore … Seeing thus … He understands: ‘ … there is no more for this state of being.’[n.152]Spk: At the end of this teaching on the three characteristics Yamaka became a stream-enterer. Sāriputta asks the following questions to examine him and to get him to show that he has given up his wrong view.Spk glossesTathāgatahere as \"a being\"(satta), which I think does not quite hit the mark. I take the subject of the discussion to be, not a being in general, but the arahant conceived as a being, as a substantial self. Thus the catechism will show that Yamaka has abandoned his identity view(sakkāyadiṭṭhi)regarding the arahant, and therewith his view of the arahant as a self that undergoes annihilation. We find a similar transition from the arahant(vimuttacitta bhikkhu)to the Tathāgata atMN I 140,3–andI 486–88.",
    "sn22.85:8": "\"What do you think, friend Yamaka, do you regard form as the Tathāgata?\" - \"No, friend.\" - \"Do you regard feeling … perception … volitional formations … consciousness as the Tathāgata?\" - \"No, friend.\"",
    "sn22.85:9": "\"What do you think, friend Yamaka, do you regard the Tathāgata as in form?\" - \"No, friend.\" - \"Do you regard the Tathāgata as apart from form?\" - \"No, friend.\" - \"Do you regard the Tathāgata as in feeling? As apart from feeling? As in perception? As apart from perception? As in volitional formations? As apart from volitional formations? As in consciousness? As apart from consciousness?\" - \"No, friend.\"",
    "sn22.85:10": "\"What do you think, friend Yamaka, do you regard form, feeling, perception, volitional formations, and consciousnesstaken togetheras the Tathāgata?\" - \"No, friend.\"sn.iii.112",
    "sn22.85:11": "\"What do you think, friend Yamaka, do you regard the Tathāgata as one who is without form, without feeling, without perception, without volitional formations, without consciousness?\" - \"No, friend.\"[n.153] The first three alternatives—conceiving the aggregates individually as the Tathāgata, the Tathāgata as within the aggregates, and the Tathāgata as apart from the aggregates—correspond to the first three modes of conceiving in the Mūlapariyaya Sutta (MN I 1), which are set in relation to the sense bases atSN35.30,31. The fourth position conceives the aggregates collectively as the Tathāgata (perhaps a view of supervenience); the fifth conceives the Tathāgata as entirely transcendent, without any essential relation to the aggregates. These modes of conceiving can also be correlated with the twenty types of identity view.",
    "sn22.85:12": "\"Formerly, friend Sāriputta, when I was ignorant, I did hold that pernicious view, but now that I have heard this Dhamma teaching of the Venerable Sāriputta I have abandoned that pernicious view and have made the breakthrough to the Dhamma.\"[n.155] See n.147.",
    "sn22.85:13": "\"If, friend Yamaka, they were to ask you: ‘Friend Yamaka, when a bhikkhu is an arahant, one whose taints are destroyed, what happens to him with the breakup of the body, after death?’—being asked thus, what would you answer?\"",
    "sn22.85:14": "\"Good, good, friend Yamaka! Now, friend Yamaka, I will make up a simile for you in order to convey this same meaning even more clearly. Suppose, friend Yamaka, there was a householder or a householder's son, a rich man, with much wealth and property, protected by a bodyguard. Then some man would appear who wanted to ruin him, to harm him, to endanger him, to take his life.sn.iii.113It would occur to that man: ‘This householder or householder's son is a rich man, with much wealth and property, protected by a bodyguard. It won’t be easy to take his life by force. Let me get close to him and then take his life.’",
    "sn22.85:15": "\"What do you think, friend Yamaka, when that man had approached that householder or householder's son and said to him: ‘I would serve you, sir,’ wasn’t he a murderer even then, though the other did not recognize him as ‘my murderer’? And when the man was serving him, rising up before him, retiring after him, doing whatever he wants, agreeable in his conduct, endearing in his speech, wasn’t he a murderer then too, though the other did not recognize him as ‘my murderer’? And when the man came upon him while he was alone and took his life with a sharp knife, wasn’t he a murderer then too, though the other did not recognize him as ‘my murderer’?\"",
    "sn22.85:16": "\"He does not understand as it really is impermanent form as ‘impermanent form’[n.159] The next four paragraphs are also atSN22.55.… impermanent feeling as ‘impermanent feeling’ … impermanent perception as ‘impermanent perception’ … impermanent volitional formations as ‘impermanent volitional formations’ … impermanent consciousness as ‘impermanent consciousness.’",
    "sn22.85:17": "\"He does not understand as it really is painful form as ‘painful form’ … painful feeling as ‘painful feeling’ … painful perception as ‘painful perception’ … painful volitional formations as ‘painful volitional formations’ … painful consciousness as ‘painful consciousness.’",
    "sn22.85:18": "\"He does not understand as it really is selfless form as ‘selfless form’ … selfless feeling as ‘selfless feeling’ … selfless perception as ‘selfless perception’ … selfless volitional formations as ‘selfless volitional formations’ … selfless consciousness as ‘selfless consciousness.’",
    "sn22.85:19": "\"He does not understand as it really is conditioned form as ‘conditioned form’ … conditioned feeling as ‘conditioned feeling’ … conditioned perception as ‘conditioned perception’ … conditioned volitional formations as ‘conditioned volitional formations’ … conditioned consciousness as ‘conditioned consciousness.’",
    "sn22.85:20": "\"He does not understand as it really is murderous form as ‘murderous form’ … murderous feeling as ‘murderous feeling’ … murderous perception as ‘murderous perception’ … murderous volitional formations as ‘murderous volitional formations’ … murderous consciousness as ‘murderous consciousness.’",
    "sn22.85:21": "\"He becomes engaged with form, clings to it, and takes a stand upon it as ‘my self.’[n.160] As inSN12.15; see II, n.31, n. 32.He becomes engaged with feeling … with perception … with volitional formations … with consciousness, clings to it, and takes a stand upon it as ‘my self.’ These same five aggregates of clinging, to which he becomes engaged and to which he clings, lead to his harm and suffering for a long time.",
    "sn22.85:22": "\"But, friend, the instructed noble disciple, who is a seer of the noble ones … does not regard form as self, or self as possessing form, or form as in self, or self as in form.",
    "sn22.85:23": "\"He understands as it really is impermanent form as ‘impermanent form’ … impermanent consciousness as ‘impermanent consciousness.’",
    "sn22.85:24": "\"He understands as it really is painful form as ‘painful form’ … painful consciousness as ‘painful consciousness.’",
    "sn22.85:25": "\"He understands as it really is selfless form as ‘selfless form’ … selfless consciousness as ‘selfless consciousness.’",
    "sn22.85:26": "\"He understands as it really is conditioned form as ‘conditioned form’ … conditioned consciousness as ‘conditioned consciousness. ’",
    "sn22.85:27": "\"He understands as it really is murderous form as ‘murderous form’ … murderous consciousness as ‘murderous consciousness.’",
    "sn22.85:28": "\"He does not become engaged with form, cling to it, and take a stand upon it as ‘my self.’ He does not become engaged with feeling … with perception … with volitional formations … with consciousness, cling to it, and take a stand upon it as ‘my self.’ These same five aggregates of clinging, to which he does not become engaged and to which he does not cling, lead to his welfare and happiness for a long time.\""
}