{
    "sn22.97:1": "At Sāvatthī. Sitting to one side, that bhikkhu said to the Blessed One: \"Is there, venerable sir, any form that is permanent, stable, eternal, not subject to change, and that will remain the same just like eternity itself? Is there any feeling … any perception … any volitional formations … any consciousness that is permanent, stable, eternal, not subject to change, and that will remain the same just like eternity itself?\"\n\n\"Bhikkhu, there is no form … no feeling … no perception … no volitional formations … no consciousness that is permanent, stable, eternal, not subject to change, and that will remain the same just like eternity itself.\"",
    "sn22.97:2": "Then the Blessed One took up a little bit of soil in his fingernail and said to that bhikkhu: \"Bhikkhu, there is not even this much form that is permanent, stable, eternal, not subject to change, and that will remain the same just like eternity itself. If there was this much form that was permanent, stable, eternal, not subject to change, this living of the holy life for the complete destruction of suffering could not be discerned. But because there is not even this much form that is permanent, stable, eternal, not subject to change, this living of the holy life for the complete destruction of suffering is discerned.sn.iii.148",
    "sn22.97:3–5": "\"There is not even this much feeling … perception … volitional formations … consciousness that is permanent, stable, eternal, not subject to change, and that will remain the same just like eternity itself. If there was this much consciousness … But because there is not even this much consciousness that is permanent, stable, eternal, not subject to change, this living of the holy life for the complete destruction of suffering is discerned.",
    "sn22.97:6": "\"What do you think, bhikkhu, is form permanent or impermanent?\" - \"Impermanent, venerable sir.\" …sn.iii.149… - \"Therefore … Seeing thus … He understands: ‘ … there is no more for this state of being.’\""
}