{
    "sn22.86:1": "On one occasion the Blessed One was dwelling at Vesālī in the Great Wood in the Hall with the Peaked Roof.[n.62] This sutta also occurs atSN44.2, with the questionnaire given in full (though abridged in this translation).Now on that occasion the Venerable Anuradha was dwelling in a forest hut not far from the Blessed One. Then a number of wanderers of other sects approached the Venerable Anuradha and exchanged greetings with him. When they had concluded their greetings and cordial talk, they sat down to one side and said to him:",
    "sn22.86:2": "When this was said, the Venerable Anuradha said to those wanderers: ‘Friends, when a Tathāgata is describing a Tathāgata—the highest type of person, the supreme person, the attainer of the supreme attainment—he describes him apart from these four cases: ‘The Tathāgata exists after death,’ or ‘The Tathāgata does not exist after death,’ or ‘The Tathāgata both exists and does not exist after death,’ or ‘The Tathāgata neither exists nor does not exist after death.’\"[n.164]Spk: It is said that he thought, \"These are hostile enemies of the Teaching. The Teacher would not describe (the Tathāgata) as they say. He must have described him in some other way.\"",
    "sn22.86:3": "Then, not long after those wanderers had left, it occurred to the Venerable Anuradha: \"If those wanderers of other sects should question me further, how should I answer if I am to state what has been said by the Blessed One and not misrepresent him with what is contrary to fact? And how should I explain in accordance with the Dhamma, so that no reasonable consequence of my assertion would give ground for criticism?\"",
    "sn22.86:4–6": "Then the Venerable Anuradha approached the Blessed One, paid homage to him, sat down to one side, and reported to the Blessed One everything that had happened,sn.iii.118asking: \"If those wanderers of other sects should question me further, how should I answer … so that no reasonable consequence of my assertion would give ground for criticism?\"",
    "sn22.86:7": "\"What do you think, Anuradha, is form permanent or impermanent?\" - \"Impermanent, venerable sir.\" … - \"Therefore … Seeing thus … He understands: ‘ … there is no more for this state of being.’",
    "sn22.86:8": "\"What do you think, Anuradha, do you regard form as the Tathāgata?\" - \"No, venerable sir.\" - \"Do you regard feeling … perception … volitional formations … consciousness as the Tathāgata?\" - \"No, venerable sir.\"",
    "sn22.86:9": "\"What do you think, Anuradha, do you regard the Tathāgata as in form?\" - \"No, venerable sir.\" - \"Do you regard the Tathāgata as apart from form?\" - \"No, venerable sir.\" - \"Do you regard the Tathāgata as in feeling? As apart from feeling? As in perception? As apart from perception? As in volitional formations? As apart from volitional formations? As in consciousness? As apart from consciousness?\" - \"No, venerable sir.\"",
    "sn22.86:10": "\"What do you think, Anuradha, do you regard form, feeling, perception, volitional formations, and consciousnesstaken togetheras the Tathāgata?\" - \"No, venerable sir.\"",
    "sn22.86:11": "\"What do you think, Anuradha, do you regard the Tathāgata as one who is without form, without feeling, without perception, without volitional formations, without consciousness?\" - \"No, venerable sir.\"",
    "sn22.86:12": "\"But, Anuradha, when the Tathāgata is not apprehended by you as real and actual here in this very life, is it fitting for you to declare: ‘Friends, when a Tathāgata is describing a Tathāgata—the highest type of person, the supreme person, the attainer of the supreme attainment—he describes him apart from these four cases:sn.iii.119‘The Tathāgata exists after death,’ or … ‘The Tathāgata neither exists nor does not exist after death’?\"",
    "sn22.86:13": "\"Good, good, Anuradha! Formerly, Anuradha, and also now, I make known just suffering and the cessation of suffering.\"[n.165] This oft-quoted dictum can be interpreted at two levels. At the more superficial level the Buddha can be read as saying that he does not make any declaration about such metaphysical questions as an afterlife but teaches only a practical path for reaching the end of suffering here and now. This interpretation, however, does not connect the dictum with the Buddha’s previous statement that the Tathāgata is not apprehended in this very life. To make this connection we have to bring in the second interpretation, according to which the \"Tathāgata\" is a mere term of conventional usage referring to a compound of impermanent formations, which are \"suffering\" because they contain no permanent essence. It is just these that stand while the Tathāgata lives, and just these that cease with his passing away. The context in which the dictum occurs atMN I 140,14–15also supports this interpretation."
}