{
    "sn22.5:1": "Thus have I heard. At Sāvatthī … . There the Blessed One said this:",
    "sn22.5:2": "\"And what, bhikkhus, is the origin of form? What is the origin of feeling? What is the origin of perception? What is the origin of volitional formations? What is the origin of consciousness? \"Here, bhikkhus, one seeks delight, one welcomes, one remains holding.",
    "sn22.5:3": "And what is it that one seeks delight in, what does one welcome, to what does one remain holding? One seeks delight in form, welcomes it, and remains holding to it. As a consequence of this, delight arises. Delight in form is clinging. With one's clinging as condition, existencecomes to be; with existence as condition, birth; with birth as condition, aging-and-death, sorrow, lamentation, pain, displeasure, and despair come to be. Such is the origin of this whole mass of suffering.",
    "sn22.5:4": "\"One seeks delight in feeling … in perception … in volitional formations … in consciousness, welcomes it, and remains holding to it. As a consequence of this, delight arises … . Such is the origin of this whole mass of suffering.",
    "sn22.5:5": "\"This, bhikkhus, is the origin of form; this is the origin of feeling; this is the origin of perception; this is the origin of volitional formations; this is the origin of consciousness.[n.30] Here the text speaks of the diachronic or distal origination of the five aggregates, in contrast to the synchronic or proximal origination shown below atSN22.6,7. The concluding portion of the passage shows that we have here a compressed statement of dependent origination. To \"seek delight, welcome, and remain holding\" is the work of craving(taṇhā). The delight(nandi)obtained is clinging(upādāna), from which the remaining links of the series flow. The passage thus demonstrates how craving for the present five aggregates is the efficient cause for the arising of a fresh batch of five aggregates in the next existence. The section on passing away should be understood in the converse manner: when craving for the present five aggregates ceases, one has eliminated the efficient cause for the arising of the five aggregates in a future existence.",
    "sn22.5:6": "\"And what, bhikkhus, is the passing away of form? What is the passing away of feeling? What is the passing away of perception? What is the passing away of volitional formations? What is the passing away of consciousness?",
    "sn22.5:7": "\"Here, bhikkhus, one does not seek delight, one does not welcome, one does not remain holding.",
    "sn22.5:8": "And what is it that one does not seek delight in? What doesn’t one welcome? To what doesn’t one remain holding? One does not seek delight in form, does not welcome it, does not remain holding to it. As a consequence of this, delight in form ceases. With the cessation of delight comes cessation of clinging; with cessation of clinging, cessation of existence … . Such is the cessation of this whole mass of suffering.",
    "sn22.5:9–11": "\"One does not seek delight in feeling …sn.iii.15… in perception … in volitional formations … in consciousness, does not welcome it, does not remain holding to it. As a consequence of this, delight in consciousness ceases … . Such is the cessation of this whole mass of suffering.",
    "sn22.5:12": "\"This, bhikkhus, is the passing away of form; this is the passing away of feeling; this is the passing away of perception; this is the passing away of volitional formations; this is the passing away of consciousness.\""
}