{
    "sn22.3:1": "Thus have I heard. On one occasion the Venerable Mahakaccana was dwelling among the people of Avanti on Mount Papata at Kuraraghara.[n.6] Mahakaccana was the Buddha’s foremost disciple in the detailed exposition of brief sayings, a skill he displays in this sutta and the next, and elsewhere in SN atSN35.30,32. For a concise account of his life and teachings, see Bodhi, \"Mahakaccana: The Master of Doctrinal Exposition,\" in Nyanaponika and Hecker,Great Disciples of the Buddha,pp. 23–44. Avanti, his native region, was to the far southwest of the Ganges basin. This entire sutta is quoted verbatim at Nidd I 97–200 in place of a commentary on the verse below.Then the householder Haliddakani approached the Venerable Mahakaccana, paid homage to him, sat down to one side, and said to him:",
    "sn22.3:2": "‘Having left home to roam without abode,In the village the sage is intimate with none;Rid of sensual pleasures, without expectations,He would not engage people in dispute.’",
    "sn22.3:3": "How, venerable sir, should the meaning of this, stated by the Blessed One in brief, be understood in detail?\"",
    "sn22.3:4": "\"The form element, householder, is the home of consciousness; one whose consciousness is shackled by lust for the form element is called one who roams about in a home.[n.18] The first line of the verse reads: okaṁ pahaya aniketasari. No mention is made of okasari or anokasari, \"one who roams in a home\" and \"one who roams about homeless,\" but Mahakaccana introduces these terms as implicit in the absolutive construction okaṁ pahaya. The use of dhātu as a synonym for khandha is unusual; more often the two are treated as headings for different schemes of classification. But seeSN22.5,53,5etc., where we also meet this usage. I follow the reading of the text in Se and Ee, rūpadhāturagavinibaddhaṁ, also supported bySpk(Be), as against Be -vinibandhaṁ. Spk resolves the compound, rūpadhātumhi ragena vinibaddhaṁ, and explains this consciousness as the kammic consciousness(kammaviññāṇa). The passage confirms the privileged status of consciousness among the five aggregates. While all the aggregates are conditioned phenomena marked by the three characteristics, consciousness serves as the connecting thread of personal continuity through the sequence of rebirths. This ties up with the idea expressed at12.38–0that consciousness is the persisting element in experience that links together the old existence with the new one. The other four aggregates serve as the \"stations for consciousness\" (viññāṇaṭṭhitiyo; see22.53–5). Even consciousness, however, is not a self-identical entity but a sequence of dependently arisen occasions of cognizing; seeMN38.The feeling element is the home of consciousness …sn.iii.10The perception element is the home of consciousness … The volitional formations element is the home of consciousness; one whose consciousness is shackled by lust for the volitional formations element is called one who roams about in a home. It is in such a way that one roams about in a home.[n.19] Spk: Why isn’t the consciousness element mentioned here (as a \"home for consciousness\")? To avoid confusion, for \"home\" is here spoken of in the sense of a condition(paccaya). An earlier kammic consciousness is a condition for both a later kammic consciousness and a resultant consciousness, and an (earlier) resultant consciousness for both a (later) resultant consciousness and a (later) kammic consciousness. Therefore the confusion could arise: \"What kind of consciousness is intended here?\" To avoid such confusion, consciousness is not included, and the teaching is expressed without disorder. Further, the other four aggregates, as objects (or bases: arammaṇavasena), are said to be \"stations for the kammically generative consciousness\"(abhisaṅkhāraviññāṇaṭṭhitiyo), and to show them thus consciousness is not mentioned here.",
    "sn22.3:5": "\"And how, householder, does one roam about homeless? The desire, lust, delight, and craving, the engagement and clinging, the mental standpoints, adherences, and underlying tendencies regarding the form element: these have been abandoned by the Tathāgata, cut off at the root, made like a palm stump, obliterated so that they are no more subject to future arising.[n.20] Engagement and clinging(upay′ upādāna), etc. SeeSN12.1and II, n.31.Spkexplains that although all arahants abandon these, the Tathāgata, the Perfectly Enlightened One, is mentioned as the supreme example because his status as an arahant is most evident to all the world.Therefore the Tathāgata is called one who roams about homeless. The desire, lust, delight, and craving, the engagement and clinging, the mental standpoints, adherences, and underlying tendencies regarding the feeling element … the perception element … the volitional formations element … the consciousness element:[n.21] Spk: Why is consciousness mentioned here? To show the abandoning of defilements. For defilements are not fully abandoned in relation to the other four aggregates only, but in relation to all five.these have been abandoned by the Tathāgata, cut off at the root, made like a palm stump, obliterated so that they are no more subject to future arising. Therefore the Tathāgata is called one who roams about homeless. It is in such a way that one roams about homeless.",
    "sn22.3:6": "\"And how, householder, does one roam about in an abode? By diffusion and confinement in the abodeconsisting inthe sign of forms, one is called one who roams about in an abode.[n.22] I read the long compound with Be and Serūpanimittaniketavisāravinibandha.Ee has-sāra-in place of-visāra-.The interpretation is as difficult as it looks. I have unravelled it with the aid ofSpk, which explains: \"Form itself is the ‘sign’(nimitta)in the sense that it is a condition for defilements, and it is also the abode (consisting in) the ‘sign of forms,’ being an abode in the sense of a dwelling place, namely, for the act of objectification. By the two terms ‘diffusion and confinement’(visāra-vinibandha)what is meant is the expansion of defilements and their confining (or binding) nature. (Thus the full compound should be resolved:) ‘diffusion and confinement in the abode (consisting in) the sign of forms.’ Hence the meaning is: ‘by the diffusion of defilements, and by the bondage of defilements arisen in the abode (consisting in) the sign of forms.’ One is called ‘one who roams about in an abode’: one is called ‘one who roams about in a dwelling place’ by making (forms) an object.\"By diffusion and confinement in the abodeconsisting inthe sign of sounds … the sign of odours … the sign of tastes … the sign of tactile objects … the sign of mental phenomena, one is called one who roams about in an abode.",
    "sn22.3:7": "\"And how, householder, does one roam about without abode? Diffusion and confinement in the abodeconsisting inthe sign of forms: these have been abandoned by the Tathāgata, cut off at the root, made like a palm stump, obliterated so that they are no more subject to future arising. Therefore the Tathāgata is called one who roams about without abode. Diffusion and confinement in the abodeconsisting inthe sign of sounds … the sign of odours … the sign of tastes … the sign of tactile objects … the sign of mental phenomena: these have been abandoned by the Tathāgata, cut off at the root, made like a palm stump,sn.iii.11obliterated so that they are no more subject to future arising. Therefore the Tathāgata is called one who roams about without abode. It is in such a way that one roams about without abode.[n.23]Spk: Why are the five aggregates here called \"home\"(oka), while the six objects are called \"an abode\"(niketa)? Because of the relative strength and weakness of desire and lust, respectively. For though they are similar in being places of residence, \"home\" means one's house, a permanent dwelling place, while \"abode\" is a place where one dwells for a special purpose, such as a park, etc. As desire and lust are strong in relation to one's home, which is inhabited by one's wife, children, wealth, and possessions, so too they are strong in regard to the internal aggregates. But as lust and desire are weaker in regard to such places as parks, etc., so too in relation to external objects. Spk-pṭ: Because desire and lust are strong in relation to the internal five aggregates, the latter are called \"home,\" and because desire and lust are weaker in relation to the six external objects, the latter are called \"an abode.\"",
    "sn22.3:8": "\"And how, householder, is one intimate in the village? Here, householder, someone lives in association with laypeople: he rejoices with them and sorrows with them, he is happy when they are happy and sad when they are sad, and he involves himself in their affairs and duties.[n.24] Such intimacy with lay people in the affairs of lay life is considered unsuitable for a monk; seeSN9.7andSN35.241(IV 10,17–21).It is in such a way that one is intimate in the village.",
    "sn22.3:9": "\"And how, householder, is one intimate with none in the village? Here, householder, a bhikkhu does not live in association with laypeople. He does not rejoice with them or sorrow with them, he is not happy when they are happy and sad when they are sad, and he does not involve himself in their affairs and duties. It is in such a way that one is intimate with none in the village.",
    "sn22.3:10": "\"And how, householder, is one not rid of sensual pleasures? Here, householder, someone is not devoid of lust, desire, affection, thirst, passion, and craving in regard to sensual pleasures. It is in such a way that one is not rid of sensual pleasures.",
    "sn22.3:11": "\"And how, householder, is one rid of sensual pleasures? Here, householder, someone is devoid of lust, desire, affection, thirst, passion, and craving in regard to sensual pleasures. It is in such a way that one is rid of sensual pleasures.",
    "sn22.3:12": "\"And how, householder, does one entertain expectations?[n.25] Se:purekkharāno;Be and Ee:purakkharano.Sn reads as in Se. The word usually means \"honouring, revering,\" but the text here plays on the literal meaning \"putting in front,\" interpreted as projecting into the future through desire.Spkglosses it withvaṭṭaṁ purato kurumāno,\"putting the round of existence in front.\" The negative apurekkharano is here glossed vaṭṭaṁ purato akurumano, and at Pj II 547,6–7āyatiṃ attabhāvaṃ anabhinibbattento,\"not producing individual existence in the future.\" Mahakaccana's explanation echoes the Buddha’s exegesis of the Bhaddekaratta verses atMN III 188,15–26.Here, householder, someone thinks: ‘May I have such form in the future! May I have such feeling in the future! May I have such perception in the future! May I have such volitional formations in the future! May I have such consciousness in the future!’ It is in such a way that one entertains expectations.",
    "sn22.3:13": "\"And how, householder, is one without expectations? Here, householder, someone does not think: ‘May I have such form in the future! …sn.iii.12May I have such consciousness in the future!’ It is in such a way that one is without expectations.",
    "sn22.3:14": "\"And how, householder, does one engage people in dispute? Here, householder, someone engages in such talk as this:[n.26] This passage is also found atSN56.9, also atDN1and elsewhere. The expressions used are probably taken from the arsenal of rhetoric used in the heated philosophical debates that took place between the wanderers of different sects. The mood of these debates, and the Buddha’s evaluation of them, is effectively conveyed by a number of suttas in the Aṭṭhakavagga; see Sn IV, 8, 12, 13.‘You don’t understand this Dhamma and Discipline. I understand this Dhamma and Discipline. What, you understand this Dhamma and Discipline! You’re practising wrongly, I’m practising rightly. What should have been said before you said after; what should have been said after you said before. I’m consistent, you’re inconsistent. What you took so long to think out has been overturned. Your thesis has been refuted. Go off to rescue your thesis, for you’re defeated, or disentangle yourself if you can.’ It is in such a way that one engages people in dispute.",
    "sn22.3:15": "\"And how, householder, does one not engage people in dispute? Here, householder, someone does not engage in such talk as this: ‘You don’t understand this Dhamma and Discipline … . ‘ It is in such a way that one does not engage people in dispute.",
    "sn22.3:16": "\"Thus, householder, when it was said by the Blessed One in ‘The Questions of Magandiya’ of the Aṭṭhakavagga:",
    "sn22.3:17": "‘Having left home to roam without abode,In the village the sage is intimate with none;Rid of sensual pleasures, without expectations,He would not engage people in dispute’—",
    "sn22.3:18": "it is in such a way that the meaning of this, stated in brief by the Blessed One, should be understood in detail.\""
}