{
    "sn22.94:1": "At Sāvatthī. \"Bhikkhus, I do not dispute with the world; rather, it is the world that disputes with me. A proponent of the Dhamma does not dispute with anyone in the world. Of that which the wise in the world agree upon as not existing, I too say that it does not exist. And of that which the wise in the world agree upon as existing, I too say that it exists.[n.85] This portion of the sutta offers an important counterpoint to the message of the Kaccanagotta Sutta (SN2.5). Here the Buddha emphasizes that he does not reject all ontological propositions, but only those that transcend the bounds of possible experience. While the Kaccanagotta Sutta shows that the \"middle teaching\" excludes static, substantialist conceptions of existence and nonexistence, the present text shows that the same \"middle teaching\" can accommodate definite pronouncements about these ontological issues. The affirmation of the existence of the five aggregates, as impermanent processes, serves as a rejoinder to illusionist theories, which hold that the world lacks real being.",
    "sn22.94:2": "\"And what is it, bhikkhus, that the wise in the world agree upon as not existing, of which I too say that it does not exist?sn.iii.139Form that is permanent, stable, eternal, not subject to change: this the wise in the world agree upon as not existing, and I too say that it does not exist. Feeling … Perception … Volitional formations … Consciousness that is permanent, stable, eternal, not subject to change: this the wise in the world agree upon as not existing, and I too say that it does not exist.",
    "sn22.94:3": "\"And what is it, bhikkhus, that the wise in the world agree upon as existing, of which I too say that it exists? Form that is impermanent, suffering, and subject to change: this the wise in the world agree upon as existing, and I too say that it exists. Feeling … Perception … Volitional formations … Consciousness that is impermanent, suffering, and subject to change: this the wise in the world agree upon as existing, and I too say that it exists.",
    "sn22.94:4": "\"That, bhikkhus, is what the wise in the world agree upon as existing, of which I too say that it exists.",
    "sn22.94:5": "\"There is, bhikkhus, a world-phenomenon[n.186]Lokadhamma.Spk: The five aggregates are called thus because it is their nature to disintegrate(lujjanasabhāvattā).Lokais derived fromlujjatiatSN3.82. The etymology cannot be accepted literally but serves a pedagogic purpose.in the world to which the Tathāgata has awakened and broken through. Having done so, he explains it, teaches it, proclaims it, establishes it, discloses it, analyses it, elucidates it.",
    "sn22.94:6": "When it is being thus explained …sn.iii.140… and elucidated by the Tathāgata, if anyone does not know and see, how can I do anything with that foolish worldling, blind and sightless, who does not know and does not see?",
    "sn22.94:7": "When it is being thus explained … and elucidated by the Tathāgata, if anyone does not know and see, how can I do anything with that foolish worldling, blind and sightless, who does not know and does not see?"
}