{
    "sn22.37:1": "At Sāvatthī. Then the Venerable Ānanda approached the Blessed One … . The Blessed One then said to the Venerable Ānanda as he was sitting to one side:",
    "sn22.37:2": "\"If, Ānanda, they were to ask you: ‘Friend Ānanda, what are the things of which an arising is discerned, a vanishing is discerned, an alteration of that which stands is discerned?’—being asked thus, how would you answer?\"[n.50]Uppāda, vaya, ṭhitassa aññathattaṃ.AtAN I 15,6–10these are called the three conditioned characteristics of the conditioned(tīṇi saṅkhatassa saṅkhatalakkhaṇāni). The commentaries identify them with the three sub-moments in the momentary life span of adhamma:arising(uppāda), persistence or presence(ṭhiti), and dissolution(bhaṅga). (For more on this, see CMA 4:6.)Spkexplainsṭhitassa aññathattaas the aging (or decay) of the persisting living entity(dharamānassa jīvamānassa jarā), namely, of the life faculty. The commentator mentions the opinion held by some teachers that it is not possible to posit a moment of decay in the case of the mental phenomena (feeling, etc.) (Spk-pṭ: because of the extreme brevity of the moment, decay being quickly overtaken by dissolution), but he rejects this view on the basis of the sutta itself. Spk-pṭ proposes a logical argument for the sub-moment of presence: \"Just as a stage of dissolution distinct from the stage of arising is admitted, for otherwise it would follow that an entity dissolves in the very act of arising, so we must admit, as distinct from the stage of dissolution, a stage when an entity ‘confronts its own dissolution’(bhaṅgābhimukhāvatthā); for something cannot break up unless it has confronted its own dissolution.\"sn.iii.38",
    "sn22.37:3": "\"Good, good, Ānanda! With form, Ānanda, an arising is discerned, a vanishing is discerned, an alteration of that which stands is discerned. With feeling … perception … volitional formations … consciousness an arising is discerned, a vanishing is discerned, an alteration of that which stands is discerned. These, Ānanda, are the things of which an arising is discerned, a vanishing is discerned, an alteration of that which stands is discerned. Being asked thus, Ānanda, you should answer in such a way.\""
}