{
    "sn22.87:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Now on that occasion the Venerable Vakkali was dwelling in a potter's shed, sick, afflicted, gravely ill.[n.66] Vakkali was declared by the Buddha the foremost bhikkhu of those resolved through faith (etadaggaṁ saddhādhimuttānaṁ;AN I 24,5).Spk: After completing the rains residence, the elder was on his way to see the Blessed One when he fell ill in the middle of the city. He could not walk, so they put him on a stretcher and carried him to a potter's shed.Then the Venerable Vakkali addressed his attendants:",
    "sn22.87:2": "Then the Blessed One dressed and, taking bowl and robe, approached the Venerable Vakkali.sn.iii.10The Venerable Vakkali saw the Blessed One coming in the distance and stirred on his bed.[n.167]Samadhosi.Spk: He showed his respect by making a movement; for, it is said, even a patient is obliged to show respect to a superior by making a gesture of rising.The Blessed One said to him: \"Enough, Vakkali, do not stir on your bed. There are these seats ready, I will sit down there.\"",
    "sn22.87:3": "\"Enough, Vakkali! Why do you want to see this foul body? One who sees the Dhamma sees me; one who sees me sees the Dhamma.[n.168]Yo kho Vakkali dhammaṁ passati, so maṁ passati. Yo maṁ passati, so dhammaṁ passati.Spk: Here the Blessed One shows (himself as) the Dhamma-body, as stated in the passage, \"The Tathāgata, great king, is the Dhamma-body.\" For the ninefold supramundane Dhamma is called the Tathāgata's body.I cannot trace a statement that corresponds exactly to the one cited by Spk. Spk may be misquotingDN III 84,2–24,which actually reads: \"For this, Vaseṭṭha, is a designation of the Tathāgata, that is, the Dhamma-body … \"(tathāgatassa h’ etaṁ Vāseṭṭha adhivacanaṁ dhammakāyo iti pi …). On the ninefold supramundane Dhamma, see n.51. Though the second clause seems to be saying that simply by seeing the Buddha’s body one sees the Dhamma, the meaning is surely that in order to really see the Buddha one should see the Dhamma, the truth to which he awakened. Hence the following catechism, intended to guide Vakkali towards that realization.For in seeing the Dhamma, Vakkali, one sees me; and in seeing me, one sees the Dhamma.",
    "sn22.87:4": "\"What do you think, Vakkali, is form permanent or impermanent?\" -sn.iii.121\"Impermanent, venerable sir.\" … - \"Therefore … Seeing thus … He understands: ‘ … there is no more for this state of being.’\"",
    "sn22.87:5": "Then the Blessed One, having given this exhortation to the Venerable Vakkali, rose from his seat and departed for Mount Vulture Peak.",
    "sn22.87:6": "Then, when the night had passed, the Blessed One addressed the bhikkhus thus: \"Come, bhikkhus, approach the bhikkhu Vakkali and say to him:",
    "sn22.87:7": "‘Friend Vakkali, listen to the word of the Blessed Onesn.iii.122and two devatas. Last night, friend, when the night was well advanced, two devatas of stunning beauty approached the Blessed One. One devata said to the Blessed One: \"Venerable sir, the bhikkhu Vakkali is intent on deliverance.\" The other devata said: \"Surely, venerable sir, he will be liberated as one well liberated.\" And the Blessed One says to you, friend Vakkali: \"Do not be afraid, Vakkali, do not be afraid! Your death will not be a bad one. Your demise will not be a bad one.\"’\"",
    "sn22.87:8": "Then the Venerable Vakkali addressed his attendants: \"Come, friends, lower me from the bed. How can one like me think of listening to the Blessed One's teaching while seated on a high seat.\"",
    "sn22.87:9": "Then those bhikkhus approached the Blessed One … and delivered their message.",
    "sn22.87:10": "The Blessed One then addressed the bhikkhus thus: \"Come, bhikkhus, let us go to the Black Rock on the Isigili Slope, where the clansman Vakkali has used the knife.\"",
    "sn22.87:11": "Now on that occasion a cloud of smoke, a swirl of darkness, was moving to the east, then to the west, to the north, to the south, upwards, downwards, and to the intermediate quarters. The Blessed One then addressed the bhikkhus thus: \"Do you see, bhikkhus, that cloud of smoke, that swirl of darkness, moving to the east, then to the west, to the north, to the south, upwards, downwards, and to the intermediate quarters?\""
}