{
    "sn22.60:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Vesālī in the Great Wood in the Hall with the Peaked Roof. Then Mahali the Licchavi approached the Blessed Onesn.iii.69… and said to him:",
    "sn22.60:2": "\"Venerable sir, Pūraṇa Kassapa speaks thus: ‘There is no cause or condition for the defilement of beings; beings are defiled without cause or condition. There is no cause or condition for the purification of beings; beings are purified without cause or condition. ’ What does the Blessed One say about this?\"[n.9] In the Samaññaphala Sutta this view is ascribed to the Ājīvika teacher Makkhali Gosāla (DN I 53,4–8). The same source ascribes to Pūraṇa Kassapa the theory of the inefficacy of action (akiriyavāda;DN I 5,1–53,), stated atSN4.6but without ascription. AtSN46.56a different noncausality doctrine(ahetukavāda)is ascribed to Pūraṇa Kassapa.",
    "sn22.60:3": "\"There is, Mahali, a cause and condition for the defilement of beings; beings are defiled with cause and condition. There is a cause and condition for the purification of beings; beings are purified with cause and condition.\"",
    "sn22.60:4": "\"But, venerable sir, what is the cause and condition for the defilement of beings? How is it that beings are defiled with cause and condition?\"",
    "sn22.60:5": "\"If, Mahali, this form were exclusively suffering, immersed in suffering, steeped in suffering, and if it were notalsosteeped in pleasure, beings would not become enamoured with it. But because form is pleasurable, immersed in pleasure, steeped in pleasure, and is not steepedonlyin suffering, beings become enamoured with it.[n.93] SeeSN14.34.By being enamoured with it, they are captivated by it, and by being captivated by it they are defiled. This, Mahali, is a cause and condition for the defilement of beings; it is thus that beings are defiled with cause and condition.",
    "sn22.60:6–8": "\"If, Mahali, this feeling were exclusively suffering … If this perception … these volitional formations …sn.iii.70… this consciousness were exclusively suffering … beings would not become enamoured with it. But because consciousness is pleasurable … beings become enamoured with it. By being enamoured with it, they are captivated by it, and by being captivated by it they are defiled. This too, Mahali, is a cause and condition for the defilement of beings; it is thus that beings are defiled with cause and condition.\"",
    "sn22.60:9": "\"But, venerable sir, what is the cause and condition for the purification of beings? How is it that beings are purified with cause and condition?\"",
    "sn22.60:10": "\"If, Mahali, this feeling were exclusively pleasurable … If this perception … these volitional formations … this consciousness were exclusively pleasurable … beings would not experience revulsion towards it. But because consciousness is suffering … beings experience revulsion towards it. Experiencing revulsion, they become dispassionate, and through dispassion they are purified.sn.iii.71This too, Mahali, is a cause and condition for the purification of beings; it is thus that beings are purified with cause and condition.\""
}