{
    "sn22.101:1": "At Sāvatthī. \"Bhikkhus, I say that the destruction of the taints is for one who knows and sees, not for one who does not know and does not see. For one who knows what, who sees what, does the destruction of the taints come about? ‘Such is form, such its origin, such its passing away; such is feeling … such is perception … such are volitional formations … such is consciousness, such its origin,sn.iii.53such its passing away’: it is for one who knows thus, for one who sees thus, that the destruction of the taints comes about.[n.20] Also atSN2.23. The following, through to the end, is also atAN7.7.",
    "sn22.101:2": "\"Bhikkhus, when a bhikkhu does not dwell devoted to development, even though such a wish as this might arise in him: ‘Oh, that my mind might be liberated from the taints by nonclinging!’ yet his mind is not liberated from the taints by nonclinging. For what reason? It should be said: because of nondevelopment. Because of not developing what? Because of not developing the four establishments of mindfulness … the four right strivings … the four bases for spiritual power … the five spiritual faculties … the five powers … the seven factors of enlightenment … the Noble Eightfold Path.[n.11] Again, these are the thirty-seven aids to enlightenment. The theme of this sutta might be compared withMN16, which deals with the question whether, in living the holy life, it is necessary to make a wish(āsañ ce pi karitvā)in order to achieve the fruit(phalassa adhigamaya). Here the word rendered \"wish\" isicchā.",
    "sn22.101:3": "\"Suppose, bhikkhus there was a hen with eight, ten, or twelve eggs that she had not covered, incubated, and nurtured properly. Even though such a wish as this might arise in her: ‘Oh, that my chicks might pierce their shells with the points of their claws and beaks and hatch safely!’ yet the chicks are incapable of piercing their shells with the points of their claws and beaks and hatching safely. For what reason? Because that hen with eight, ten, or twelve eggs had not covered, incubated, and nurtured them properly.",
    "sn22.101:4": "\"Bhikkhus, when a bhikkhu dwells devoted to development,sn.iii.15even though no such wish as this might arise in him: ‘Oh, that my mind might be liberated from the taints by nonclinging!’ yet his mind is liberated from the taints by nonclinging. For what reason? It should be said: because of development. Because of developing what? Because of developing the four establishments of mindfulness … the four right strivings … the four bases for spiritual power … the five spiritual faculties … the five powers … the seven factors of enlightenment … the Noble Eightfold Path.",
    "sn22.101:5": "\"Suppose, bhikkhus, there was a hen with eight, ten, or twelve eggs that she had covered, incubated, and nurtured properly. Even though no such wish as this might arise in her: ‘Oh, that my chicks might pierce their shells with the points of their claws and beaks and hatch safely!’ yet the chicks are capable of piercing their shells with the points of their claws and beaks and of hatching safely. For what reason? Because that hen with eight, ten, or twelve eggs had covered, incubated, and nurtured them properly.",
    "sn22.101:6": "\"When, bhikkhus, a carpenter[n.213] Readingpalagaṇḍassawith Be and Se.Spkglossesvaḍḍhakissa.or a carpenter's apprentice looks at the handle of his adze, he sees the impressions of his fingers and his thumb, but he does not know: ‘So much of the adze handle has been worn away today, so much yesterday, so much earlier.’ But when it has worn away, the knowledge occurs to him that it has worn away."
}