{
    "sn22.100:1": "\"Bhikkhus, this saṁsara is without discoverable beginning. A first point is not discerned of beings roaming and wandering on hindered by ignorance and fettered by craving … .",
    "sn22.100:2": "\"Bhikkhus, have you seen the picture called ‘Faring On’?\"[n.06]Caraṇaṁ nāma cittaṁ. Cittahere is the equivalent of Sktcitra,picture. The exact meaning of the picture's title is obscure.Spkglossesparajikaṇacitta,\"the wandering picture\" (Spk-pṭ: because they take it and wander about with it), but caraṇa here possibly means conduct, as in other contexts.Spk: The Sankha were a sect of heretical brahmins. Having taken a canvas, they had various pictures painted on it of the good and bad destinations to illustrate success and failure, and then they took it around on their wanderings. They would show it to the people, explaining, \"If one does this deed, one gets this result; if one does that, one gets that.\"",
    "sn22.100:3": "\"Bhikkhus, I do not see any other order of living beings so diversified as those in the animal realm. Even those beings in the animal realm have been diversified by the mind,[n.208]Te pi … tiracchānagatā pāṇā citten’ eva cittitā, tehi pi … tiracchānagatehi pāṇehi cittaññeva cittataraṃ.Another series of puns. The point is that the diversity of the creatures in the animal realm reflects the diversity of the past kamma that causes rebirth as an animal, and this diversity of kamma in turn stems from the diversity of volition(cetanā), a mental factor. As 64–65 discusses this passage at length.Spk: Quails and partridges, etc., do not accumulate diverse kamma, thinking, \"We will become diversified in such and such a way,\" but the kamma arrives at the appropriate species(yoni), and the diversity is rooted in the species. For beings that arise in a particular species become diversified in the way appropriate to that species. Thus the diversity is achieved through the species, and the species reflect kamma.yet the mind is even more diverse than those beings in the animal realm.",
    "sn22.100:4": "\"Suppose, bhikkhus, an artist or a painter, using dye or lac or turmeric or indigo or crimson, would create the figure of a man or a woman complete in all its features on a well-polished plank or wall or canvas.[n.209] The simile is also atSN12.6. See II, n.173.So too, when the uninstructed worldling produces anything, it is only form that he produces; only feeling that he produces; only perception that he produces; only volitional formations that he produces; only consciousness that he produces."
}