{
    "sn22.81:1": "On one occasion the Blessed One was dwelling at Kosambi in Ghosita's Park.",
    "sn22.81:2": "Then, not long after the Blessed One had departed, a certain bhikkhu approached the Venerable Ānanda and told him: \"Friend Ānanda, the Blessed One has set his lodging in order himself, taken his bowl and robe, and without informing his personal attendants, without taking leave of the Bhikkhu Saṅgha, he has set out on tour alone, without a companion.\"",
    "sn22.81:3": "Then the Blessed One, wandering by stages, arrived at Parileyyaka. There at Parileyyaka the Blessed One dwelt at the foot of an auspicious sal tree.[n.129]Spk: The residents of Pārileyyaka built a leaf hall for the Blessed One in a protected grove near their town. An auspicious(bhadda)sal tree grew there. While living in dependence on the town, the Blessed One dwelt at the foot of the tree near the leaf hut in the grove. Spk relates here the story of the bull elephant who came to wait upon the Buddha; seeUd 41–42and Vin I 52–5.",
    "sn22.81:4": "Then the Venerable Ānanda together with those bhikkhus approached the Blessed One at Parileyyaka, at the foot of the auspicious sal tree. Having approached, they paid homage to the Blessed One and sat down to one side. The Blessed One then instructed, exhorted, inspired, and gladdened those bhikkhus with a Dhamma talk.sn.iii.96Now on that occasion a reflection arose in the mind of a certain bhikkhu thus: \"How should one know, how should one see, for the immediate destruction of the taints to occur?\"[n.131] SeeSN22.55.Spkexplains this as referring to \"the fruit of arahantship immediately following the path\"(maggānantaraṁ arahattaphalaṁ). However, as in the commentarial system the fruit inevitably occurs in immediate succession to the path, I think the monk is really asking how to attain arahantship swiftly and directly, without being detained at any lower stage of awakening.",
    "sn22.81:5": "\"And how, bhikkhus, should one know, how should one see, for the immediate destruction of the taints to occur? Here, bhikkhus, the uninstructed worldling, who is not a seer of the noble ones and is unskilled and undisciplined in their Dhamma, who is not a seer of superior persons and is unskilled and undisciplined in their Dhamma, regards form as self. That regarding, bhikkhus, is a formation.[n.133]Spkglosses \"that regarding\"(sā sasamanupassanā)as a \"viewformation\"(diṭṭhi-saṅkhāra). I understandsaṅkhārahere as meaning what is conditioned rather than the active power of generation, i.e., as thesaṅkhata-saṅkhāraof the commentaries rather than asabhisaṅkhāraṇa-saṅkhāra,the act of volitional formation. The point, it seems, is that by calling the act of regarding a \"formation,\" the Buddha underlines its conditioned origination. This in turn highlights its impermanence, recognition of which knocks away the adherence to the very notion \"I am,\" thus culminating in arahantship. On “ignorance-contact”(avijjāsamphassa),see n.63.That formation—what is its source, what is its origin, from what is it born and produced? When the uninstructed worldling is contacted by a feeling born of ignorance-contact, craving arises: thence that formation is born.",
    "sn22.81:6": "\"He may not regard form as self, but he regards self as possessing form. That regarding is a formation …all as above… When one knows and sees thus, bhikkhus, the immediate destruction of the taints occurs.",
    "sn22.81:7": "\"He may not regard form as self or self as possessing form, but he regards form as in self. That regarding is a formation … .",
    "sn22.81:8": "\"He may not regard form as self or self as possessing form or form as in self, but he regards self as in form. That regarding is a formation … .sn.iii.9",
    "sn22.81:9": "\"He may not regard form as self … or self as in form, but he regards feeling as self … perception as self … volitional formations as self … consciousness as self … self as in consciousness. That regarding is a formation … . When one knows and sees thus, bhikkhus, the immediate destruction of the taints occurs.",
    "sn22.81:10": "\"He may not regard form as self …sn.iii.99… or self as in consciousness, but he holds such a view as this: ‘That which is the self is the world; having passed away, that I shall be—permanent, stable, eternal, not subject to change.’[n.134] This view, which posits the identity of the self and the world(so attā so loko), seems to be derived from the Upaniṣads. Strangely,Spkpasses over this view in silence, and Ps (commenting onMN I 135,37) offers only an unilluminating word gloss. For a discussion, see Wijesekera, \"An Aspect of Upaniṣadic Atman and Buddhist ‘Anatta,’\"Buddhist and Vedic Studies,pp. 261–63.That eternalist view is a formation … . When one knows and sees thus, bhikkhus, the immediate destruction of the taints occurs.",
    "sn22.81:11": "\"He may not regard form as self … or hold such aneternalistview, but he holds such a view as this: ‘I might not be, and it might not be for me; I will not be,andit will not be for me.’[n.135] Here I read with Se and Ee:no c’ assaṁ no ca me siyā, na bhavissāmi na me bhavissati.Be reads the third negated verb asnabhavissaṁ.Spk: \"If I were not, neither would there be my belongings; if I will not be in the future, neither will there be my belongings.\" For a fuller discussion, see n.75.That annihilationist view is a formation … .",
    "sn22.81:12": "\"He may not regard form as self … or hold such anannihilationistview, but he is perplexed, doubtful, indecisive in regard to the true Dhamma. That perplexity, doubtfulness, indecisive-ness in regard to the true Dhamma is a formation. That formation—what is its source, what is its origin, from what is it born and produced? When the uninstructed worldling is contacted by a feeling born of ignorance-contact, craving arises: thence that formation is born.[n.136]Spk: Even though doubt(vicikicchā)does not exist in the cittas associated with craving, the doubt-formation arises from it because craving has not been abandoned. For doubt arises in one who has not abandoned craving."
}