{
    "sn22.55:1": "At Sāvatthī. There the Blessed One uttered this inspired utterance: \"‘It might not be, and it might not be for me; it will not be,andit will not be for me’:sn.iii.56resolving thus, a bhikkhu can cut off the lower fetters.\"[n.75]Spk: The Blessed One uttered this inspired utterance because he was aroused by powerful joy while reviewing the emancipating nature(niyyānikabhāva)of the Teaching. The five lower fetters(pañc’ orambhāgiyāni saṃyojanāni)are: identity view, doubt, distorted grasp of rules and vows, sensual lust, and ill will.The formula for resolution recommended by the Buddha occurs in the suttas in two versions, one used by the annihilationists, the other the Buddha’s adaptation of this; as the two versions differ only with respect to two verb forms, they are sometimes confounded in the various recensions. From the commentarial glosses, it appears that the confusion had already set in before the age of the commentaries. Readings also differ among several editions of the same text. Generally I prefer the readings in Se, though in relation to the present sutta Se follows the lemma and gloss of Spk, which has adopted the first phrase in its annihilationist variant (though not interpreted as such). This corruption was probably already present in the text available to the commentators.The annihilationist version—explicitly identified asucchedadiṭṭhiatSN22.8and classed among the wrong views atSN22.52andSN24.4—reads:no c’ assaṃ no ca me siyā, na bhavissāmi na me bhavissati.AtAN V 63,28–64,2the Buddha describes this creed as the highest of outside speculative views(etadaggaṃ bāhirakānaṃ diṭṭhigatānaṃ), the reason being that one who accepts such a view will not be attracted to existence nor averse to the cessation of existence. It is problematic how the optative clause in the annihilationist version should be interpreted; perhaps it can be read as an assertion that personal existence, along with its experienced world, is utterly fortuitous (\"I might not have been and it might not have been mine\"). The clause in the future tense clearly asserts that personal existence and its world will terminate at death.The Buddha transformed this formula into a theme for contemplation consonant with his own teaching by replacing the first person verbs with their third person counterparts:No c’ assa no ca me siyā, na bhavissati na me bhavissati. The change of person shifts the stress from the view of self implicit in the annihilationist version (\"I will be annihilated\") to an impersonal perspective that harmonizes with the anatta doctrine. In the present sutta, resolving(adhimuccamāno)on the formula is said to culminate in the destruction of the five lower fetters, that is, in the stage of nonreturning(anāgāmitā). Elsewhere the formula includes a rider,yad atthi yaṁ bhūtaṁ taṁ pajahāmi,\"what exists, what has come to be, that I am abandoning.\" Contemplation of this is said to lead to equanimity. AtMN II 264,29–265,20practice guided by the full formula, with the rider, culminates in rebirth in the base of neither-perception-nor-nonperception (if the meditator clings to the equanimity) or in Nibbāna (if there is no clinging to the equanimity). AtAN IV 70–74, resolution guided by the formula, again with the rider, leads to one of the five levels of nonreturning or to arahantship. AtUd 78,2–3 the shorter formula is applied to mindfulness of the body; one who dwells thus gradually crosses attachment, i.e., wins arahantship.It may be significant that in the Nikāyas the precise meaning of the formula is never explicated, which suggests it may have functioned as an open-ended guide to reflection to be filled in by the meditator through personal intuition. As to the actual word meaning, the commentaries take the opening particlec’to representce,\"if,\" glossed sace bySpkandyadiby Spk-pṭ. On this basis they interpret each part of the formula as a conditional. Spk explains the formula in the present sutta on the basis of the questionable readingc’ assaṁ,though its second alternative conforms to the superior readingc’ assa.I translate here from Spk very literally, rendering the lemma in the way favoured by the explanation: \"If I were not, it would not be for me: If I were not(sace ahaṁ na bhaveyyaṁ), neither would there be my belongings(mama parikkhāro). Or else: If in my past there had not been kammic formation(kammabhi-saṅkharo), now there would not be for me these five aggregates. I will not be, (and) it will not be for me: I will now so strive that there will not be any kammic formation of mine producing the aggregates in the future; when that is absent, there will be for me no future rebirth.\"I part with the commentaries on the meaning of ā which I take to represent ca; the syntax of the phrase as a whole clearly requires this. The Skt parallels actually contain ca (e.g., at Uv 5:4, parallel toUd 78). If we accept this reading, then (in the present sutta) the first \"it\" can be taken to refer to the personal five aggregates, the second to the world apprehended through the aggregates. For the worldling this dyad is misconstrued as the duality of self and world; for the noble disciple it is simply the duality of internal and external phenomena. On this basis I would interpret the formula thus: \"The five aggregates can be terminated, and the world presented by them can be terminated. I will so strive that the five aggregates will be terminated, (and) so that the world presented by them will be terminated.\" Alternatively, the first \"it\" might be taken to refer to craving, and the second to the five aggregates arisen through craving. In the additional rider, \"what exists, what has come to be\" denotes the presently existent set of five aggregates, which are being abandoned through the abandonment of the cause for their continued re-manifestation, namely, craving or desire-and-lust.My understanding of this passage has been largely influenced by discussions with VĀT and Bhikkhu ñāṇatusita. I am also indebted to Peter Skilling for information on the Skt and Tibetan versions of the formula.",
    "sn22.55:2": "\"Here, bhikkhu, the uninstructed worldling, who is not a seer of the noble ones … regards form as self … or self as in consciousness.",
    "sn22.55:3": "\"He does not understand as it really is impermanent form as ‘impermanent form’ … impermanent feeling as ‘impermanent feeling’ … impermanent perception as ‘impermanent perception’ … impermanent volitional formations as ‘impermanent volitional formations’ … impermanent consciousness as ‘impermanent consciousness.’",
    "sn22.55:4": "\"He does not understand as it really is painful form as ‘painful form’ … painful feeling as ‘painful feeling’ … painful perception as ‘painful perception’ … painful volitional formations as ‘painful volitional formations’ … painful consciousness as ‘painful consciousness.’",
    "sn22.55:5": "\"He does not understand as it really is selfless form as ‘selfless form’ … selfless feeling as ‘selfless feeling’ … selfless perception as ‘selfless perception’ … selfless volitional formations as ‘selfless volitional formations’ … selfless consciousness as ‘selfless consciousness.’",
    "sn22.55:6": "\"He does not understand as it really is conditioned form as ‘conditioned form’ … conditioned feeling as ‘conditioned feeling’ … conditioned perception as ‘conditioned perception’ … conditioned volitional formations as ‘conditioned volitional formations’ … conditioned consciousness as ‘conditioned consciousness.’",
    "sn22.55:7": "\"The instructed noble disciple, bhikkhu, who is a seer of the noble ones … does not regard form as self … or self as in consciousness.",
    "sn22.55:8": "\"He understands as it really is impermanent form as ‘impermanent form’ … impermanent consciousness as ‘impermanent consciousness.’",
    "sn22.55:9": "\"With the extermination of form, feeling, perception, volitional formations, and consciousness, that bhikkhu, resolving thus: ‘It might not be, and it might not be for me; it will not be,andit will not be for me,’ can cut off the lower fetters.\"[n.77]Spk: With the extermination of form(rūpassa vibhava): by the seeing of extermination, together with insight (Spk-pṭ: for the word \"extermination\" in the text is stated by elision of the word \"seeing\"). For the four paths together with insight are called \"the seeing of the extermination of form, etc.\" This is said with reference to that.On the interpretation that I prefer (as stated in the preceding note), \"the extermination of form,\" etc., refers to the ultimate cessation of the aggregates in Nibbāna, and thus the realization that such cessation takes place functions as the spur implicit in the meditation formula that inspires the bhikkhu to break the five fetters.",
    "sn22.55:10": "\"Resolving thus, venerable sir, a bhikkhu can cut off the lower fetters. But how should one know, how should one see, for the immediate destruction of the taints to occur?\"[n.78]Anantarā āsavānaṁ khayo.Here \"the destruction of the taints\" refers to arahantship, and it seems the bhikkhu is asking how one can attain arahantship directly, without being detained at the stage of nonreturner.Spkexplains that there are two types of immediacy(anantara), proximate and distant. Insight is the proximate immediate cause for the path (since the supramundane path arises when insight has reached its peak), and the distant immediate cause for the fruit (since the fruit directly follows the path). Thus the bhikkhu is asking: \"How should one know and see, with insight as the immediate cause, to attain the fruit of arahantship called ‘the destruction of the taints’?\"",
    "sn22.55:11": "But the instructed noble disciple does not become frightened over an unfrightening matter. For this is not frightening to the noble disciple: ‘It might not be, and it might not be for me; it will not be,andit will not be for me.’[n.79]Spk: The worldling becomes frightened with the arising of weak insight(dubbalavipassanā;)for he cannot overcome self-love and thus he becomes afraid, thinking, \"Now I will be annihilated and won’t exist any more.\" He sees himself falling into an abyss (seeMN I 136,30–37,4and n.181below). But when strong insight occurs to the instructed noble disciple, he doesn’t become frightened but thinks, \"It is formations only that arise, formations only that cease.\" Spk-pṭ: When the good worldling sees, with the knowledge of appearance as fearful, that formations are fearful, he doesn’t become afraid.\"Knowledge of appearance as fearful\"(bhayat’ upaṭṭhānañāṇa)is an advanced stage of insight knowledge which lays bare the fearful nature of formations in all three periods of time; see Vism 645–47; Ppn 21:29–34.sn.iii.58",
    "sn22.55:12": "\"Bhikkhu, though someone might say: ‘Apart from form, apart from feeling, apart from perception, apart from volitional formations, I will make known the coming and going of consciousness, its passing away and rebirth, its growth, increase, and expansion’—that is impossible.",
    "sn22.55:13": "\"Bhikkhu, if a bhikkhu has abandoned lust for the form element, with the abandoning of lust the basis is cut off: there is no support for the establishing of consciousness. If he has abandoned lust for the feeling element … for the perception element … for the volitional formations element … for the consciousness element, with the abandoning of lust the basis is cut off: there is no support for the establishing of consciousness."
}