{
    "sn22.84:1": "At Sāvatthī. Now on that occasion the Venerable Tissa, the Blessed One's paternal cousin,[n.48] SeeSN2.9.informed a number of bhikkhus: \"Friends, my body seems as if it has been drugged, I have become disoriented, the teachings are no longer clear to me.[n.49] This passage occurs elsewhere, e.g., in SN atSN47.9(V 53,–2) andSN47.3(V 62,5–6).Spkdoes not explain the etymology of madhurakajato but paraphrases, \"It has become unwieldy, as if heavy.\" Madhuraka means \"sweet, pleasant, charming,\" but I follow PED's explanation, \"full of sweet drink, intoxicated.\" See madhupita in I, v.842and I, n.590. In explaining dhamma pi maṁ na paṭibhanti, Spk takes dhamma as \"the teachings\": \"Even the doctrinal teachings are not clear to me; what I learned and studied does not appear.\" Possibly dhamma here bears the more general sense of \"things.\"Sloth and torpor persist obsessing my mind. I am leading the holy life dissatisfied, and I have doubt about the teachings.\"",
    "sn22.84:2": "Then a number of bhikkhus approached the Blessed One, paid homage to him, sat down to one side, and reported this matter to him.",
    "sn22.84:3": "The Blessed One then addressed a certain bhikkhu thus: \"Come, bhikkhu, tell the bhikkhu Tissa in my name that the Teacher calls him.\"",
    "sn22.84:4": "\"Good, good, Tissa! So it is, Tissa, with one who is not devoid of lust for form. If one is not devoid of lust for feeling … for perception … for volitional formations … for consciousness, not devoid of desire,sn.iii.108affection, thirst, passion, and craving for it, then with the change and alteration of that consciousness, do sorrow, lamentation, pain, displeasure, and despair arise within?\"",
    "sn22.84:5": "\"Good, good, Tissa! So it is, Tissa, with one who is not devoid of lust for consciousness. If one is devoid of lust for form, devoid of desire, affection, thirst, passion, and craving for it, then with the change and alteration of that form, do sorrow, lamentation, pain, displeasure, and despair arise within?\"",
    "sn22.84:7": "\"Good, good, Tissa! So it is, Tissa, with one who is devoid of lust for form. If one is devoid of lust for feeling … for perception … for volitional formations … for consciousness, devoid of desire, affection, thirst, passion, and craving for it, then with the change and alteration of that consciousness, do sorrow, lamentation, pain, displeasure, and despair arise within?\"",
    "sn22.84:8": "\"Good, good, Tissa! So it is, Tissa, with one who is devoid of lust for consciousness. What do you think, Tissa, is form permanent or impermanent?\" - \"Impermanent, venerable sir.\" … —\"Therefore … Seeing thus … He understands: ‘ … there is no more for this state of being.’",
    "sn22.84:9": "\"Suppose, Tissa, there were two men: one unskilled in the path, the other skilled in the path. The man unskilled in the path would ask the skilled man a question about the path, and the latter would say: ‘Come, good man, this is the path. Go along it a little way and you will see a fork in the road. Avoid the left-hand branch and take the right-hand branch. Go a little further and you will see a dense thicket. Go a little further and you will see a vast marshy swamp. Go a little further and you will see a steep precipice. Go a little further and you will see a delightful expanse of level ground.’",
    "sn22.84:10": "\"I have made up this simile, Tissa, in order to convey a meaning. This here is the meaning: ‘The man unskilled in the path’: this is a designation for the worldling. ‘The man skilled in the path’: this is a designation for the Tathāgata, the Arahant, the Perfectly Enlightened One. ‘The forked road’: this is a designation for doubt.sn.iii.9‘The left-hand branch’: this is a designation for the wrong eightfold path; that is, wrong view … wrong concentration. ‘The right-hand branch’: this is a designation for the Noble Eightfold Path; that is, right view … right concentration. ‘The dense thicket’: this is a designation for ignorance. ‘The vast marshy swamp’: this is a designation for sensual pleasures. ‘The steep precipice’: this is a designation for despair due to anger. ‘The delightful expanse of level ground’: this is a designation for Nibbāna."
}