{
    "sn22.22:1": "At Sāvatthī … . There the Blessed One said this:",
    "sn22.22:2": "\"And what, bhikkhus, is the carrier of the burden? It should be said: the person, this venerable one of such a name and clan. This is called the carrier of the burden.[n.37] Thepuggalavādaor \"personalist\" schools of Buddhism appealed to this passage as proof for the existence of the person(puggala)as a real entity, neither identical with the five aggregates nor different from them. It is thepuggala,they claimed, that persists through change, undergoes rebirth, and eventually attains Nibbāna. This tenet was bluntly rejected by the other Buddhist schools, who saw in it a camouflaged version of theatman,the self of the non-Buddhist systems. For an overview of the arguments, see Dutt,Buddhist Sects in India,pp. 184–06. The mainstream Buddhist schools held that the person was a mere convention(vohāra)or concept(paññatti)derivative upon(upādāya)the five aggregates, not a substantial reality in its own right. For the Theravada response, see the first part of Kvu, a lengthy refutation of the \"personalist\" thesis.Spk: Thus, by the expression \"the carrier of the burden,\" he shows the person to be a mere convention. For the person is called the carrier of the burden because it \"picks up\" the burden of the aggregates at the moment of rebirth, maintains the burden by bathing, feeding, seating, and laying them down during the course of life, and then discards them at the moment of death, only to take up another burden of aggregates at the moment of rebirth.sn.iii.6",
    "sn22.22:3": "\"And what, bhikkhus, is the taking up of the burden? It is this craving that leads to renewed existence, accompanied by delight and lust, seeking delight here and there; that is, craving for sensual pleasures, craving for existence, craving for extermination. This is called the taking up of the burden.[n.8]Bhārādāna.This formula is identical with the definition of the second noble truth (seeSN56.11). So too, the explanation of the laying down of the burden(bhāranikkhepa)is identical with the definition of the third truth.Spk: Seeking delight here and there(tatratatrābhinandinī): having the habit of seeking delight in the place of rebirth or among the various objects such as forms. Lust for the five cords of sensual pleasure is craving for sensual pleasures(kāmataṇhā). Lust for form-sphere or formless-sphere existence, attachment to jhāna, and lust accompanied by the eternalist view: this is called craving for existence(bhavataṇhā). Lust accompanied by the annihilationist view is craving for extermination(vibhavataṇhā).This explanation of the last two kinds of craving seems to me too narrow. More likely, craving for existence should be understood as the primal desire to continue in existence (whether supported by a view or not), craving for extermination as the desire for a complete end to existence, based on the underlying assumption (not necessarily formulated as a view) that such extermination brings an end to a real \"I.\"",
    "sn22.22:4": "\"And what, bhikkhus, is the laying down of the burden? It is the remainderless fading away and cessation of that same craving, the giving up and relinquishing of it, freedom from it, non-reliance on it. This is called the laying down of the burden.\"[n.39]Spk: All these terms are designations for Nibbāna. For it is contingent upon this(taṁ hi āgamma)that craving fades away without remainder, ceases, is given up, is relinquished, and released; and here there is no reliance on sensual pleasures or views. For such a reason Nibbāna gains these names.",
    "sn22.22:5": "This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this:",
    "sn22.22:6": "\"The five aggregates are truly burdens,The burden-carrier is the person.Taking up the burden is suffering in the world,Laying the burden down is blissful.",
    "sn22.22:7": "Having laid the heavy burden downWithout taking up another burden,Having drawn out craving with its root,One is free from hunger, fully quenched.\"[n.40]Spk: The root of craving is ignorance. One draws out craving along with its root by the path of arahantship."
}