{
    "sn22.57:1": "At Sāvatthī. \"Bhikkhus, a bhikkhu who is skilled in seven cases and a triple investigator is called, in this Dhamma and Discipline, a consummate one, one who has fully lived the holy life, the highest kind of person.[n.87] The seven cases(sattaṭṭhānā)are obtained by merging the tetrad of the preceding sutta with the triad ofSN22.26.Spk: This sutta is a statement of both congratulations(ussadanandiya)and enticement(palobhanīya). For just as a king who has won a battle rewards and honours his victorious warriors in order to inspire the other soldiers to become heroes, so the Blessed One extols and praises the arahants in order to inspire the others to attain the fruit of arahantship.",
    "sn22.57:2": "\"And what, bhikkhus, is form? The four great elements and the form derived from the four great elements: this is called form. With the arising of nutriment there is the arising of form. With the cessation of nutriment there is the cessation of form. This Noble Eightfold Path is the way leading to the cessation of form; that is, right view … right concentration.",
    "sn22.57:3": "\"The pleasure and joy that arise in dependence on form: this is the gratification in form. That form is impermanent, suffering, and subject to change: this is the danger in form. The removal and abandonment of desire and lust for form: this is the escape from form.",
    "sn22.57:4": "\"Whatever ascetics and brahmins, having thus directly known form, its origin, its cessation, and the way leading to its cessation, having thus directly known the gratification, the danger, andsn.iii.63the escape in the case of form, are practising for the purpose of revulsion towards form, for its fading away and cessation, they are practising well. Those who are practising well have gained a foothold in this Dhamma and Discipline.",
    "sn22.57:5": "\"And whatever ascetics and brahmins, having thus directly known form, its origin, its cessation, and the way leading to its cessation, having thus directly known the gratification, the danger, and the escape in the case of form, through revulsion towards form, through its fading away and cessation, are liberated by nonclinging, they are well liberated. Those who are well liberated are consummate ones. As to those consummate ones, there is no round for describing them.",
    "sn22.57:6": "\"And what, bhikkhus, is feeling? There are these six classes of feeling: feeling born of eye-contact …as in preceding sutta… feeling born of mind-contact. This is called feeling. With the arising of contact there is the arising of feeling. With the cessation of contact there is the cessation of feeling. This Noble Eightfold Path is the way leading to the cessation of feeling; that is, right view … right concentration.",
    "sn22.57:7": "\"The pleasure and joy that arise in dependence on feeling: this is the gratification in feeling. That feeling is impermanent, suffering, and subject to change: this is the danger in feeling. The removal and abandonment of desire and lust for feeling: this is the escape from feeling.",
    "sn22.57:8": "\"Whatever ascetics and brahmins, having thus directly known feeling, its origin, its cessation, and the way leading to its cessation, having thus directly known the gratification, the danger, and the escape in the case of feeling, are practising for the purpose of revulsion towards feeling, for its fading away and cessation, they are practising well. Those who are practising well have gained a foothold in this Dhamma and Discipline.",
    "sn22.57:9": "\"And whatever ascetics and brahmins, having thus directly known feeling … and the escape in the case of feeling … As to those consummate ones, there is no round for describing them.",
    "sn22.57:10": "\"And what, bhikkhus, is perception? There are these six classes of perception: perception of forms … perception of mental phenomena. This is called perception. With the arising of contact there is the arising of perception. With the cessation of contact there is the cessation of perception. This Noble Eightfold Path is the way leading to the cessation of perception; that is, right view … right concentration.",
    "sn22.57:11": "\"And what, bhikkhus, are volitional formations? There are these six classes of volition: volition regarding forms … volition regarding mental phenomena. This is called volitional formations. With the arising of contact there is the arising of volitional formations. With the cessation of contact there is the cessation of volitional formations.sn.iii.64This Noble Eightfold Path is the way leading to the cessation of volitional formations; that is, right view … right concentration.",
    "sn22.57:12": "\"The pleasure and joy that arise in dependence on volitional formations: this is the gratification in volitional formations. That volitional formations are impermanent, suffering, and subject to change: this is the danger in volitional formations. The removal and abandonment of desire and lust for volitional formations: this is the escape from volitional formations.",
    "sn22.57:13": "\"Whatever ascetics and brahmins … As to those consummate ones, there is no round for describing them.",
    "sn22.57:14": "\"And what, bhikkhus, is consciousness? There are these six classes of consciousness: eye-consciousness … mind-consciousness. This is called consciousness. With the arising of name-and-form there is the arising of consciousness. With the cessation of name-and-form there is the cessation of consciousness. This Noble Eightfold Path is the way leading to the cessation of consciousness; that is, right view … right concentration.",
    "sn22.57:15": "\"The pleasure and joy that arise in dependence on consciousness: this is the gratification in consciousness. That consciousness is impermanent, suffering, and subject to change: this is the danger in consciousness. The removal and abandonment of desire and lust for consciousness: this is the escape from consciousness.",
    "sn22.57:16": "\"Whatever ascetics and brahmins, having thus directly known consciousness, its origin, its cessation, and the way leading to its cessation, having thus directly known the gratification, the danger, and the escape in the case of consciousness, are practising for the purpose of revulsion towards consciousness, for its fading away and cessation, they are practising well. Those who are practising well have gained a foothold in this Dhamma and Discipline.sn.iii.65",
    "sn22.57:17": "\"And whatever ascetics and brahmins, having thus directly known consciousness, its origin, its cessation, and the way leading to its cessation, having thus directly known the gratification, the danger, and the escape in the case of consciousness, through revulsion towards consciousness, through its fading away and cessation, are liberated by nonclinging, they are well liberated. Those who are well liberated are consummate ones. As to those consummate ones, there is no round for describing them.",
    "sn22.57:18": "\"And how, bhikkhus, is a bhikkhu a triple investigator? Here, bhikkhus, a bhikkhu investigates by way of the elements, by way of the sense bases, and by way of dependent origination. It is in such a way that a bhikkhu is a triple investigator.[n.88] A triple investigator(tividhūpaparikkhī). This may be understood by way of the dhātusaṁyutta (SN 14), the Saḷayatanasaṁyutta (SN 35), and the Nidanasaṁyutta (SN12). See tooMN No. 115, where skill in the elements, sense bases, and dependent origination is explained in detail, augmented by the skill of knowing the possible and the impossible."
}