{
    "sn22.62:1": "At Sāvatthī. \"Bhikkhus, there are these three pathways of language, pathways of designation, pathways of description,[n.95]Niruttipathā adhivacanapathā paññattipathā.Spk: Language (nirutti, linguistic expression) is itself the pathway of language; or alternatively, language is called the pathway of language because it is the pathway for the communication of meanings to be understood through language. The other two terms should be understood in the same way; the three are synonyms.Dhs §§306–8 distinguishes betweennirutti, adhivacana,andpaññattion the one hand, and their respectivepathaon the other. Thereniruttiand the other two are treated as synonymous, but their respective patha are said to comprise all phenomena(sabb’ eva dhammā). AtDN II 63,28–64,2,name-and-form together with consciousness is said to beadhivacanapatha, niruttipatha, paññattipatha.On the basis of these texts it seems that Spk has gone astray here, and we should understand that the three pathways of language, etc., are the five aggregates pertaining to the three time periods, and the corresponding temporal \"term, label, description\" applied to them is \"language, designation, description.\"The sutta is quoted at Kv 50 as support for the Theravadin argument against the Sarvastivadins, who held that past and future phenomena exist in some way.that are unmixed, that were never mixed, that are not being mixed, that will not be mixed, that are not rejected by wise ascetics and brahmins. What three?",
    "sn22.62:2–4": "\"Whatever feeling … Whatever perception … Whatever volitional formations …sn.iii.72Whatever consciousness has passed, ceased, changed: the term, label, and description ‘was’ applies to it, not the term ‘is’ or the term ‘will be.’",
    "sn22.62:5": "\"Whatever form, bhikkhus, has not been born, has not become manifest: the term, label, and description ‘will be’ applies to it, not the term ‘is’ or the term ‘was.’",
    "sn22.62:6–8": "\"Whatever feeling … Whatever perception … Whatever volitional formations … Whatever consciousness has not been born, has not become manifest: the term, label, and description ‘will be’ applies to it, not the term ‘is’ or the term ‘was.’",
    "sn22.62:9": "\"Whatever form, bhikkhus, has been born, has become manifest: the term, label, and description ‘is’ applies to it, not the term ‘was’ or the term ‘will be.’",
    "sn22.62:10–12": "\"Whatever feeling … Whatever perception … Whatever volitional formations … Whatever consciousness has been born, has become manifest: the term, label, and description ‘is’ applies to it, not the term ‘was’ or the term ‘will be.’",
    "sn22.62:13": "\"These, bhikkhus, are the three pathways of language, pathways of designation, pathways of description, that are unmixed, that were never mixed, that are not being mixed,sn.iii.73that will not be mixed, that are not rejected by wise ascetics and brahmins."
}