{
    "sn22.78:1": "At Sāvatthī. \"Bhikkhus, in the evening the lion, the king of beasts, comes out from his lair. Having come out, he stretches himself, surveys the four quarters all around, and roars his lion's roar three times. Then he sets out in search of game.sn.iii.85",
    "sn22.78:2": "\"So too, bhikkhus,[n.105]Spkelaborates point-by-point on the comparison between the lion's emerging from his lair and roaring, and the Buddha’s arising in the world and teaching the Dhamma. The lion's sounding his roar is like the Buddha’s \"setting in motion\" the Wheel of the Dhamma in the Deer Park, and the terror of the smaller animals like the \"arising of the terror of knowledge\"(ñāṇasantāsassa uppatti)in the long-lived deities when they hear the Buddha expound the Four Noble Truths.when the Tathāgata arises in the world, an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One, he teaches the Dhamma thus: ‘Such is form, such its origin, such its passing away; such is feeling … such is perception … such are volitional formations … such is consciousness, such its origin, such its passing away.’[n.106] Also atSN1.1, etc.; see II, n.58. Spk refers toSN.56for an explanation of the origin and passing away of the five aggregates.",
    "sn22.78:3": "\"When the Buddha, through direct knowledge,Sets in motion the Wheel of Dhamma,The peerless Teacher in this worldWith its devasmakes this known:",
    "sn22.78:4": "\"The cessation of identityAnd the origin of identity,Also the Noble Eightfold PathThat leads to suffering's appeasement.",
    "sn22.78:5": "\"Then those devas with long life spans,Beautiful, ablaze with glory,Are struck with fear, filled with terror,Like beasts who hear the lion's roar.",
    "sn22.78:6": "\"‘We’ve not transcended identity;It seems, sir, we’re impermanent,’So they sayhaving heard the utteranceOf the Arahant, the released Stable One.\""
}