{
    "sn22.89:1": "On one occasion a number of elder bhikkhus were dwelling at Kosambi in Ghosita's Park. Now on that occasion the Venerable Khemaka was living at Jujube Tree Park, sick, afflicted, gravely ill.",
    "sn22.89:2": "Then the Venerable Dasaka approached the elder bhikkhus and reported what the Venerable Khemaka had said. They told him: \"Come, friend Dasaka, approach the bhikkhu Khemaka and say to him: ‘The elders say to you, friend Khemaka: These five aggregates subject to clinging, friend, have been spoken of by the Blessed One; that is, the form aggregate subject to clinging, the feeling aggregate subject to clinging, the perception aggregate subject to clinging, the volitional formations aggregate subject to clinging, the consciousness aggregate subject to clinging. Does the Venerable Khemaka regard anything as self or as belonging to self among these five aggregates subject to clinging?’\"",
    "sn22.89:3": "\"Yes, friends,\" the Venerable Dasaka replied, and he approached the Venerable Khemaka and delivered his message.",
    "sn22.89:4": "Then the Venerable Dasaka approached the elder bhikkhus and reported what the Venerable Khemaka had said. They replied: \"Come, friend Dasaka, approach the bhikkhu Khemaka and say to him: ‘The elders say to you, friend Khemaka: These five aggregates subject to clinging, friend, have been spoken of by the Blessed One; that is, the form aggregate subject to clinging … the consciousness aggregate subject to clinging. If the Venerable Khemaka does not regard anything among these five aggregates subject to clinging as self or as belonging to self, then he is an arahant, one whose taints are destroyed.’\"",
    "sn22.89:5": "\"Yes, friends,\" the Venerable Dasaka replied, and he approached the Venerable Khemaka and delivered his message.",
    "sn22.89:6": "Then the Venerable Dasaka approached the elder bhikkhus and reported what the Venerable Khemaka had said. They replied:",
    "sn22.89:7": "\"Come, friend Dasaka, approach the bhikkhu Khemaka and say to him: ‘The elders say to you, friend Khemaka: Friend Khemaka, when you speak of this \"I am\"—what is it that you speak of as \"I am\"? Do you speak of form as \"I am,\" or do you speak of \"I am\" apart from form? Do you speak of feeling … of perception … of volitional formations … of consciousness as \"I am,\" or do you speak of \"I am\" apart from consciousness? When you speak of this \"I am,\" friend Khemaka, what is it that you speak of as \"I am\"?’\"",
    "sn22.89:8": "\"Yes, friends,\" the Venerable Dasaka replied, and he approached the Venerable Khemaka and delivered his message.",
    "sn22.89:9": "Then the Venerable Khemaka, leaning on his staff, approached the elder bhikkhus, exchanged greetings with them, and sat down to one side.sn.iii.130The elder bhikkhus then said to him: \"Friend Khemaka, when you speak of this ‘I am’ … what is it that you speak of as ‘I am’?\"",
    "sn22.89:10": "\"Suppose, friends, there is the scent of a blue, red, or white lotus. Would one be speaking rightly if one would say, ‘The scent belongs to the petals,’ or ‘The scent belongs to the stalk,’[n.177] I prefervaṇṭassa,found in SS, overvaṇṇassain all three printed eds.or ‘The scent belongs to the pistils’?\"",
    "sn22.89:11": "\"Friends, even though a noble disciple has abandoned the five lower fetters, still, in relation to the five aggregates subject to clinging, there lingers in him a residual conceit ‘I am,’ a desire ‘I am,’ an underlying tendency ‘I am’ that has not yet been uprooted. Sometime later he dwells contemplating rise and fall in the five aggregates subject to clinging: ‘Such is form, such its origin,sn.iii.131such its passing away; such is feeling … such is perception … such are volitional formations … such is consciousness, such its origin, such its passing away.’ As he dwells thus contemplating rise and fall in the five aggregates subject to clinging, the residual conceit ‘I am,’ the desire ‘I am,’ the underlying tendency ‘I am’ that had not yet been uprooted—this comes to be uprooted.",
    "sn22.89:12": "\"Suppose, friends, a cloth has become soiled and stained, and its owners give it to a laundryman. The laundryman would scour it evenly with cleaning salt, lye, or cowdung, and rinse it in clean water. Even though that cloth would become pure and clean, it would still retain a residual smell of cleaning salt, lye, or cowdung that had not yet vanished. The laundryman would then give it back to the owners. The owners would put it in a sweet-scented casket, and the residual smell of cleaning salt, lye, or cowdung that had not yet vanished would vanish.[n.178]Spk: The worldling's mental process is like the soiled cloth. The three contemplations (of impermanence, suffering, and nonself) are like the three cleansers. The mental process of the nonreturner is like the cloth that has been washed with the three cleansers. The defilements to be eradicated by the path of arahantship are like the residual smell of the cleansers. The knowledge of the path of arahantship is like the sweetly scented casket, and the destruction of all defilements by that path is like the vanishing of the residual smell of the cleansers from the cloth after it has been placed in the casket.",
    "sn22.89:13": "When this was said, the elder bhikkhus said to the Venerable Khemaka: \"We did not ask our questions in order to trouble the Venerable Khemaka,sn.iii.2but we thought that the Venerable Khemaka would be capable of explaining, teaching, proclaiming, establishing, disclosing, analysing, and elucidating the Blessed One's teaching in detail. And the Venerable Khemaka has explained, taught, proclaimed, established, disclosed, analysed, and elucidated the Blessed One's teaching in detail.\"",
    "sn22.89:14": "This is what the Venerable Khemaka said. Elated, the elder bhikkhus delighted in the Venerable Khemaka's statement. And while this discourse was being spoken, the minds of sixty elder bhikkhus and of the Venerable Khemaka were liberated from the taints by nonclinging."
}