{
    "sn22.79:1": "At Sāvatthī. \"Bhikkhus, those ascetics and brahmins who recollect their manifold past abodes all recollect the five aggregates subject to clinging or a certain one among them.[n.08]Spksays that this does not refer to recollection by direct knowledge (i.e., by retrocognition of the past) but to the recollection of one's past abodes by way of insight. Spk seems to understand the purport of the Buddha’s statement to be that they deliberately recollect the past in terms of the aggregates. I take the point differently, i.e., that though these ascetics imagine they are recalling the past experience of a permanent self, they are only recollecting past configurations of the five aggregates. This interpretation seems to be confirmed by the next paragraph, which reduces first-person memories(evaṁrūpo ahosiṁ)to experiences framed solely in terms of the aggregates(rūpaṁ yeva). It can also draw support from the parallel paragraph openingSN22.47. Spk entitles this passage \"the emptiness section\"(suññatāpabba). A parallel commentary on the passage, slightly more elaborate, is at Vibh-a 3–6.What five?",
    "sn22.79:2": "\"And why, bhikkhus, do you call it form?[n.109]Spk: Even though emptiness has been discussed, the discussion is not yet definitive because the characteristic of emptiness(suññatālakkhaṇa)has not been discussed. The present passage is introduced to show the characteristic of emptiness. Spk-pṭ: Since form, etc., are neither a self nor the belongings of a self, but are insubstantial and ownerless, they are empty of that (self). Their nature is emptiness, their characteristic is \"being deformed,\" etc.‘It is deformed,’ bhikkhus, therefore it is called form.[n.110]Ruppatī ti kho bhikkhave tasmā rūpan ti vuccati.I have tried, though clumsily, to capture the subtle word play of the Pali, which capitalizes on the apparent correspondence between the verbruppatiand the nounrūpa.Etymologically, the two are not related.Ruppatiis a passive verb from the rootrup(= Sktlup), \"to break, injure, spoil.\" MW listsrupyate(s.v. rup), \"to suffer violent or racking pain.\" See too PED, s.v. ruppati. Spk glosses:Ruppatī ti kuppati ghaṭṭīyati pīḷīyati, bhijjatī ti attho;\"It is deformed: it is disturbed, stricken, oppressed, meaning ‘it is broken.’\"At KS :73, n. 1, Woodward has misunderstood the point of the commentary. It is not the case that Buddhaghosa misconstrues \"these various contacts not as referring to this life, but as ‘informing’ creatures in other spheres.\" Rather, he merely cites the cold hells, hot hells, etc., as the realms where the different types of \"deformation\" are most evident(pākaṭa). Spk adds that being \"deformed\" is the specific characteristic, of form, which distinguishes it from feeling and the other aggregates; but the general characteristics(samaññalakkhaṇa)are what they have in common, namely, impermanence, suffering, and nonself.Deformed by what? Deformed by cold, deformed by heat, deformed by hunger, deformed by thirst, deformed by contact with flies, mosquitoes, wind, sun, and serpents. ‘It is deformed,’ bhikkhus, therefore it is called form.",
    "sn22.79:3": "\"And why, bhikkhus, do you call it feeling? ‘It feels,’ bhikkhus, therefore it is called feeling.[n.111]Spk: It is feeling itself that feels, not another—a being or a person.And what does it feel? It feels pleasure, it feels pain,sn.iii.87it feels neither-pain-nor-pleasure. ‘It feels,’ bhikkhus, therefore it is called feeling.",
    "sn22.79:4": "\"And why, bhikkhus, do you call it perception? ‘It perceives,’ bhikkhus, therefore it is called perception. And what does it perceive? It perceives blue, it perceives yellow, it perceives red, it perceives white. ‘It perceives,’ bhikkhus, therefore it is called perception.",
    "sn22.79:5": "\"And why, bhikkhus, do you call them volitional formations? ‘They construct the conditioned,’ bhikkhus, therefore they are called volitional formations.[n.112]Saṅkhataṃ abhisaṅkharontī ti bhikkhave tasmā saṅkhārā ti vuccanti.Unfortunately English is a poor medium for capturing the interconnections of this sentence in the Pali, with the object(saṅkhataṁ), the verb(abhisaṅkharonti), and the subject(saṅkhārā)all derived from the same stem. See my discussion of saṅkhāra in the General Introduction, pp. 44–47. To replicate the Pali we might have rendered it, \"They construct the constructed, therefore they are called volitional constructions,\" though this would bear certain connotations quite alien to the original. It is also an unfortunate coincidence that \"volitional formations,\" my rendering forsaṅkhāra,is related to \"form,\" my rendering forrūpa.In Pali there is no etymological tie betweenrūpaandsaṅkhārā. To capture the several nuances of the verbabhisaṅkharotiwe might have taken the liberty of rendering it, in this passage, by two verbs: \"to generate,\" which conveys the idea that the volitional formations actually produce the other aggregates (see the following note); and \"to form,\" which makes apparent the correspondence with the noun \"formations.\"This passage shows the active role of cetana, volition, in constructing experienced reality. Not only does volition influence the objective content of the experience, but it also shapes the psychophysical organism within which it has arisen and, via its role as kamma, shapes the future configurations of the five aggregates to be produced by kamma. In this connection seeSN3.146, on the six sense bases as \"old kamma.\"And what is the conditioned that they construct? They construct conditioned form as form;[n.113] All three printed eds. of SN read,rūpaṁ rūpattāya saṅkhataṁ abhisaṅkharonti,and so for the other aggregates, except viññāṇa, where Ee reads,viññāṇatthaya;however, since Ee has no note on vv.ll., this is almost certainly an editorial inconsistency rather than a meaningful variant.Spk(Se and Ee) readsrūpatthāyain its lemma, implying that the termination -atthāyashould apply to every aggregate, and apparently old Sinhalese mss of SN had this reading. Spk (Be), however, hasrūpattāya.The explanation in Spk is equally intelligible on either reading of SN.I follow Be here: \"As one is said to cook conjee as conjee, to bake a cake as a cake, so it (Spk-pṭ: the collection of states headed by volition) constructs, builds up, amasses(abhisaṅkharoti āyūhati sampiṇḍati)form itself—called ‘the conditioned’ because it is made by a combination of conditions—so that it becomes ‘conditioned form’ in accordance with its nature, for its formness(tathattāya rūpabhāvāya); the meaning is that it produces it(nipphādeti ti attho). This is the sense in brief: It constructs, produces the form arising along with itself and the associated feeling, etc. Here, too, the Blessed One shows just the specific characteristic of volitional formations, whose characteristic is volition. (Spk-pṭ: This is said because volition is the chief of the states belonging to the aggregate of volitional formations.)\"they construct conditioned feeling as feeling; they construct conditioned perception as perception; they construct conditioned volitional formations as volitional formations; they construct conditioned consciousness as consciousness. ‘They construct the conditioned,’ bhikkhus, therefore they are called volitional formations.",
    "sn22.79:6": "\"And why, bhikkhus, do you call it consciousness? ‘It cognizes, ’ bhikkhus, therefore it is called consciousness. And what does it cognize? It cognizes sour, it cognizes bitter, it cognizes pungent, it cognizes sweet, it cognizes sharp, it cognizes mild, it cognizes salty, it cognizes bland. ‘It cognizes,’ bhikkhus, therefore it is called consciousness.[n.114] The eight flavours are:ambila, tittaka, kaṭuka, madhuka, khārika, akhārika, loṇaka, aloṇaka;see tooSN47.8. The explanation ofviññāṇahere is very similar to that of saññā, the difference being only in the type of sense object they cognize.Spkexplains that the difference in object highlights a difference in their cognitive functions: \"Perception is analysed by way of the eye door because it is evident in grasping the appearance and shape of the object; consciousness is analysed by way of the tongue door because it can grasp particular distinctions in an object even when there is no appearance and shape.\" Spk continues with an explanation (also found at Vism 437; Ppn 14:3–5) according to whichsaññā, viññāṇa,and paññā are cognitive functions of increasing depth, discriminative acumen, and power of comprehension; this, however, is difficult to reconcile with the account of these factors found in the Nikāyas. Usually in the suttasviññāṇais presented simply as the basic awareness of an object through one of the sense bases, i.e., as bare \"consciousness of\" rather than as a discriminative capacity. A parallel treatment ofviññāṇaatMN I 292,2–29defines it through its ability to cognize the three types of feelings (pleasant, painful, neutral); this just shifts the problem to that of distinguishing betweenviññāṇaandvedanā.Hamilton discusses the problem posed by these passages (Identity and Experience,pp. 53–55, 92–93). She offers the helpful suggestion that althoughviññāṇais here defined in a way that encroaches upon the domain of saññā, we should understand thatsaññādoes the actual discrimination (of objects at all five senses) whileviññāṇa\"is the awareness by which we experience every stage of the cognitive process, including the process of discriminating\" (p. 92). From the commentarial standpoint, saññā is discussed more fully at As 110–11 andviññāṇa(under the namecitta) at As 3–4.",
    "sn22.79:7": "\"Therein, bhikkhus, the instructed noble disciple reflects thus: ‘I am now being devoured by form.[n.115]Spk: The first two sections—the emptiness section and the section on the characteristic of emptiness—have discussed the characteristic of nonself. Now he will discuss the characteristic of suffering. Therein, form does not devour one as a dog does a piece of meat, by tearing one apart, but rather in the way a soiled garment might cause discomfort, as when one says, \"This shirt is devouring me.\" The lines following the reflection incorporate the conclusion of22:9–11.In the past too I was devoured by form in the very same way that I am now being devoured by present form. If I were to seek delight in future form, then in the future too I shall be devoured by form in the very same way that I am now being devoured by present form.’ Having reflected thus, he becomes indifferent towards past form, he does not seek delight in future form, and he is practising for revulsion towards present form, for its fading away and cessation.",
    "sn22.79:8–10": "\"He reflects thus:‘I am now being devoured by feeling.’ …sn.iii.88… ‘I am now being devoured by perception.’ … ‘I am now being devoured by volitional formations.’ … ‘I am now being devoured by consciousness. In the past too I was devoured by consciousness in the very same way that I am now being devoured by present consciousness. If I were to seek delight in future consciousness, then in the future too I shall be devoured by consciousness in the very same way that I am now being devoured by present consciousness.’ Having reflected thus, he becomes indifferent towards past consciousness, he does not seek delight in future consciousness, and he is practising for revulsion towards present consciousness, for its fading away and cessation.",
    "sn22.79:11": "\"What do you think, bhikkhus, is form permanent or impermanent? … Is feeling … perception … volitional formations …sn.iii.89consciousness permanent or impermanent?\"[n.6]Spk: This passage is stated to show the characteristic of impermanence, and to do so by bringing the three characteristics together.- \"Impermanent, venerable sir.\" - \"Is what is impermanent suffering or happiness?\" - \"Suffering, venerable sir.\" - \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" - \"No, venerable sir.\"",
    "sn22.79:12": "\"This is called, bhikkhus, a noble disciple who dismantles and does not build up; who abandons and does not cling; who scatters and does not amass; who extinguishes and does not kindle.[n.117] I render this passage with the aid ofSpk, which glosses the last two pairs of terms thus:Visineti na ussinetī ti vikirati na sampiṇḍeti; vidhūpeti na sandhūpetī ti nibbāpeti na jālāpeti(some texts readviseneti, usseneti); cp.AN II 214–16. The present passage describes thesekha,who is still in the process of dismantling the round.",
    "sn22.79:13": "\"Seeing thus, bhikkhus, the instructed noble disciple experiences revulsion towards form, revulsion towards feeling, revulsion towards perception, revulsion towards volitional formations, revulsion towards consciousness. Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated. When it is liberated there comes the knowledge: ‘It's liberated.’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’",
    "sn22.79:14": "\"This is called, bhikkhus, a noble disciple who neither builds up nor dismantles, but who abides having dismantled; who neither abandons nor clings, but who abides having abandoned; who neither scatters nor amasses, but who abides having scattered; who neither extinguishes nor kindles, but who abides having extinguished.[n.118]Spk: This shows the arahant, who abides having dismantled the round.",
    "sn22.79:15": "\"‘Homage to you, O thoroughbred man!Homage to you, O highest among men!We ourselves do not directly knowDependent upon what you meditate.’\"[n.119] Pādas cd should be read:yassa te nābhijānāma, yampi nissāya jhāyati.SeeAN V 324–26andMN I 140,3–6.Spkstates that at the end of this discourse five hundred bhikkhus were established in arahantship."
}