{
    "sn22.48:1": "At Sāvatthī. \"Bhikkhus, I will teach you the five aggregates and the five aggregates subject to clinging. Listen to that …",
    "sn22.48:2": "\"And what, bhikkhus, are the five aggregates subject to clinging? Whatever kind of form there is, whether past, future, or present … far or near, that is tainted, that can be clung to: this is called the form aggregate subject to clinging. Whatever kind of feeling there is … that is tainted, that can be clung to: this is called the feeling aggregate subject to clinging. Whatever kind of perception there is … that is tainted, that can be clung to: this is called the perception aggregate subject to clinging. Whatever kind of volitional formations there are … that are tainted, that can be clung to: these are called the volitional formations aggregate subject to clinging.sn.iii.48Whatever kind of consciousness there is, whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near, that is tainted, that can be clung to: this is called the consciousness aggregate subject to clinging. These, bhikkhus, are called the five aggregates subject to clinging.\"[n.65] This sutta is quoted and discussed at Vism 477–78 (Ppn 14:14–15), in relation to the difference between the aggregates and the aggregates subject to clinging. The key terms distinguishing thepañc’ upādānakkhandhāfrom thepañcakkhandhaaresāsavā upādāniya,\"with taints and subject to clinging.\" Thepañc’ upādānakkhandhāare included within the pañcakkhandha, for all members of the former set must also be members of the latter set. However, the fact that a distinction is drawn between them implies that there are khandha which areanāsavā anupādāniya,\"untainted and not subject to clinging.\" On first consideration it would seem that the \"bare aggregates\" are those of the arahant, who has eliminated theāsavāandupādāna.However, in the Abhidhamma allrūpais classified assāsavāandupādāniya,and so too the resultant(vipāka)and functional(kiriya)mental aggregates of the arahant (see Dhs §§1103, 119). The only aggregates classed asanāsavāandanupādāniyaare the four mental aggregates occurring on the cognitive occasions of the four supramundane paths and fruits (see Dhs §§1104, 10). The reason for this is thatsāsavāandupādāniyado not mean \"accompanied by taints and by clinging,\" but \"capable of being taken as the objects of the taints and of clinging,\" and the arahant's mundane aggregates can be taken as objects of the taints and clinging by others (see As 347). For a detailed study of this problem, see Bodhi, \"Aggregates and Clinging Aggregates.\"Spk: Among the five aggregates the form aggregate is of the sense sphere, the other four aggregates are of the four planes (sense sphere, form sphere, formless sphere, supramundane). With taints(sāsavā)means: what becomes a condition for the taints by way of object; so too that can be clung to(upādāniya)means what becomes a condition for clinging (Spk-pṭ: by being made its object). Among the aggregates subject to clinging, stated by way of the practice of insight, the form aggregate is sense sphere, the others pertain to the three planes (i.e., excluding only the supramundane)."
}