{
    "sn22.82:1": "On one occasion the Blessed One was dwelling at Sāvatthī in the Eastern Park, in the Mansion of Migara's Mother, together with a great Saṅgha of bhikkhus.[n.38] This entire sutta is atMN No. 09.Now on that occasion—the Uposatha day of the fifteenth, a full-moon night—the Blessed One was sitting out in the open surrounded by the Saṅgha of bhikkhus.",
    "sn22.82:2": "Then a certain bhikkhu rose from his seat, arranged his upper robe over one shoulder, raised his joined hands in reverential salutation towards the Blessed One, and said to him: \"Venerable sir, I would ask the Blessed One about a certain point, if the Blessed One would grant me the favour of answering my question.\"",
    "sn22.82:3": "\"Those are the five aggregates subject to clinging, bhikkhu: that is, the form aggregate subject to clinging, the feeling aggregate subject to clinging, the perception aggregate subject to clinging, the volitional formations aggregate subject to clinging, the consciousness aggregate subject to clinging.\"",
    "sn22.82:4": "\"But, venerable sir, in what are these five aggregates subject to clinging rooted?\"",
    "sn22.82:5": "\"But, venerable sir, can there be diversity in the desire and lust for the five aggregates subject to clinging?\"",
    "sn22.82:6": "\"In what way, venerable sir, does the designation ‘aggregates’ apply to the aggregates?\"",
    "sn22.82:7": "\"What is the cause and condition, venerable sir, for the manifestation of the form aggregate?[n.141]Rūpakkhandhassa paññāpanāya.This might have been rendered \"for the description of the form aggregate.\"Paññāpanais literally \"making known,\" and something is \"made known\" either by becoming manifest or by being described.What is the cause and condition for the manifestation of the feeling aggregate? … for the manifestation of the perception aggregate? … for the manifestation of the volitional formations aggregate? … for the manifestation of the consciousness aggregate?\"",
    "sn22.82:8": "\"Venerable sir, how does identity view come to be?\"",
    "sn22.82:9": "\"But, venerable sir, how does identity view not come to be?\"",
    "sn22.82:10": "\"What, venerable sir, is the gratification, the danger, and the escape in the case of form? What is the gratification, the danger, and the escape in the case of feeling? … in the case of perception? … in the case of volitional formations? … in the case of consciousness?\"",
    "sn22.82:11": "\"Venerable sir, how should one know, how should one see so that, in regard to this body with consciousness and in regard to all external signs, I-making, mine-making, and the underlying tendency to conceit no longer occur within?\"",
    "sn22.82:12": "Now on that occasion the following reflection arose in the mind of a certain bhikkhu: \"So it seems that form is nonself, feeling is nonself, perception is nonself, volitional formations are nonself, consciousness is nonself. What self, then, will deeds done by what is nonself affect?\"[n.142] I prefer the reading of the parallel atMN III 19,–13,anattakatāni kammāni kam attānaṃ phusissanti.In the SN text, Be and Se readkatham attānaṁ,and Eekatam attanaṁ,which perhaps should be amended tokam attānaṁ.Spkis silent, but MA explains that this monk had slipped into an eternalist view.",
    "sn22.82:13": "\"It is possible, bhikkhus, that some senseless man here, obtuse and ignorant, with his mind dominated by craving, might think that he can outstrip the Teacher's Teaching thus: ‘So it seems that form is nonself … consciousness is nonself.sn.iii.104What self, then, will deeds done by what is nonself affect?’ Now, bhikkhus, you have been trained by me through interrogation here and there in regard to diverse teachings.[n.143]aṭipucchā-vinītā kho me tumhe bhikkhave tatra tatra tesu tesu dhammesu.The readings in Ee and MN (Ee) should be amended accordingly. Neither MA norSpkoffers any explanation, but it is clear enough that the \"training through interrogation\" is the catechistic method to be applied in the following paragraph.",
    "sn22.82:14": "\"What do you think, bhikkhu, is form permanent or impermanent?\" - \"Impermanent, venerable sir.\" … - \"Is feeling permanent or impermanent? … Is perception permanent or impermanent? … Are volitional formations permanent or impermanent? … Is consciousness permanent or impermanent?\" - \"Impermanent, venerable sir.\" - \"Is what is impermanent suffering or happiness?\" - \"Suffering, venerable sir.\" - \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" - \"No, venerable sir.\"",
    "sn22.82:15": "These are the ten questionsThe bhikkhu came to ask:Two about the aggregates,Whether the same, can there be,Designation and the cause,Two about identity,One each ongratificationAndthis bodywith consciousness.sn.iii.105"
}