{
    "sn22.43:1": "At Sāvatthī. \"Bhikkhus, dwell with yourselves as an island, with yourselves as a refuge, with no other refuge; with the Dhamma as an island, with the Dhamma as a refuge, with no other refuge.[n.53] These words are identical with the Buddha’s famous injunction to Ānanda in the Mahaparinibbāna Sutta atDN6(DN II 00,20–22), also below atSN47.9,3,4(V 54,5–6, 63,0–, 64,28–29). In explaining the expressionattadipa,\"with self as island,\"Spksays: \"What is meant by ‘self’? The mundane and supramundane Dhamma(ko pan’ ettha attā nāma? lokiyalokuttaro dhammo). Therefore he says next, ‘with the Dhamma as an island,’ etc.\" This comment overlooks the obvious point that the Buddha is inculcating self-reliance.When you dwell with yourselves as an island, with yourselves as a refuge, with no other refuge; with the Dhamma as an island, with the Dhamma as a refuge, with no other refuge, the basis itself should be investigated thus:[n.54] The Se reading seems best: yoni yeva upaparikkhitabbā. Be omitsyevaand Ee treatsyonias a masculine noun. Spk glosses yoni withkāraṇa,\"cause,\" and refers toMN26(MN III 42,23–24): yoni h’ esā Bhūmija phalassa adhigamāya; \"For this, Bhūmija, is the basis for the achievement of the fruit.\" See tooSN35.239(IV 75,27–28) andAN II 76,24–25. Spkpṭ offers an etymology: yavati etasmā phalaṃ pasavatī ti yoni. AtSN22.95we repeatedly find the phraseyoniso upaparikkhati,\"carefully investigates,\" and it is quite possible that here tooyonisowas the original reading. A Burmese v.l. cited by Ee actually hasyoniso va.‘From what are sorrow, lamentation, pain, displeasure, and despair born? How are they produced?’",
    "sn22.43:2": "\"And, bhikkhus, from what are sorrow, lamentation, pain, displeasure, and despair born? How are they produced? Here, bhikkhus, the uninstructed worldling, who is not a seer of the noble ones and is unskilled and undisciplined in their Dhamma, who is not a seer of superior persons and is unskilled and undisciplined in their Dhamma, regards form as self, or self as possessing form, or form as in self, or self as in form. That form of his changes and alters. With the change and alteration of form, there arise in him sorrow, lamentation, pain, displeasure, and despair.",
    "sn22.43:3": "\"But, bhikkhus, when one has understood the impermanence of form, its change, fading away, and cessation, and when one sees as it really is with correct wisdom thus: ‘In the past and also now all form is impermanent, suffering, and subject to change,’ then sorrow, lamentation, pain, displeasure, and despair are abandoned. With their abandonment, one does not become agitated.[n.55]Na paritassati.See n.above and II, n.17.Being unagitated, one dwells happily. A bhikkhu who dwells happily is said to be quenched in that respect.[n.56]Tadaṅganibbuto ti vuccati.Thoughnibbutois the past participle generally used to describe one who has attained Nibbāna, the prefixtadaṅga-qualifies that sense, suggesting he has not actually attained Nibbāna but has only approximated its attainment. One might have rendered this expression \"one who has attained Nibbāna in that respect,\" i.e., only in respect of a particular freedom.Spk: He is \"quenched in that respect\" because of the quenching of the defilements with respect to (or: through the factor of) insight. In this sutta it is just insight(vipassanā va)that is discussed."
}