{
    "sn22.90:1": "On one occasion a number of bhikkhus were dwelling at Baraṇasi in the Deer Park at Isipatana. Then, in the evening, the Venerable Channa emerged from seclusion and, taking his key, went from dwelling to dwelling saying to the elder bhikkhus: \"Let the elder venerable ones exhort me, let them instruct me, let them give me a Dhamma talk in such a way that I might see the Dhamma.\"[n.79]Spkidentifies this Channa with the Bodhisatta's charioteer who led him out of the palace on the night of his great renunciation. He had received ordination as a monk but, because of his former close relationship with the Buddha, he became proud and domineering and spoke harshly to the other bhikkhus. Shortly before his parinibbāna the Buddha had instructed the Saṅgha to impose on him thebrahmadaṇḍa,\"the silence treatment\" (DN II 54,8–23). When Channa realized he was being treated as a pariah by the Saṅgha, he was shaken by a sense of urgency(saṁvega). It is at this point that the sutta opens.",
    "sn22.90:2": "When this was said, the elder bhikkhus said to the Venerable Channa: \"Form, friend Channa, is impermanent, feeling is impermanent, perception is impermanent, volitional formations are impermanent, consciousness is impermanent. Form is nonself,sn.iii.133feeling is nonself, perception is nonself, volitional formations are nonself, consciousness is nonself. All formations are impermanent; all phenomena are nonself.\"[n.180]Spk: All formations of the three planes(sabbe tebhūmakā saṅkhārā)are impermanent; all phenomena of the four planes(sabbe catubhūmakā dhammā)are nonself. Why didn’t those bhikkhus mention the characteristic of suffering? Because they thought, \"This bhikkhu is argumentative. If we mention suffering he will quarrel with us, saying, ‘If form, etc., are suffering, the path and fruit too are suffering, so you monks have attained nothing but suffering.’\" Thus they answered in a way that could not be faulted.See tooMN I 8,10–14, 30,5–8,where only impermanence and nonself are mentioned in the explicit context of debate. The commentary to this passage gives a similar explanation of the omission of suffering.",
    "sn22.90:3": "Then it occurred to the Venerable Channa: \"I too think in this way: ‘Form is impermanent … consciousness is impermanent. Form is nonself … consciousness is nonself. All formations are impermanent; all phenomena are nonself.’ But my mind does not launch out upon the stilling of all formations, the relinquishing of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna; nor does it acquire confidence, settle down, and resolve on it. Instead, agitation and clinging arise and the mind turns back, thinking: ‘But who is my self?’[n.181]Atha ko carahi me attā.Spk: It is said that this elder had started to practise insight meditation without having done discernment of conditions. His weak insight could not eliminate the grip of self(attagāha), and thus when formations appeared to him as empty, agitation arose in him along with the annihilationist view, \"I will be annihilated, I will be destroyed.\" He saw himself falling into an abyss. [Spkpṭ: Agitation through fear(bhayaparitassanā)and clinging to views(diṭṭh’ upādāna)arose in him over the thought, \"If phenomena are nonself, then what self can deeds done by what is nonself affect?\" (seeSN22.82(III 104,1) and n.142)].Discernment of conditions(paccayapariggaha)is a stage in the development of insight in which the meditator explores the conditions for the five aggregates (see Vism, chap. 19). In the proper sequence of development this stage should precede investigation of the aggregates as impermanent, suffering, and nonself.But such does not happen to one who sees the Dhamma. So who can teach me the Dhamma in such a way that I might see the Dhamma?\"",
    "sn22.90:4–7": "Then it occurred to the Venerable Channa: \"This Venerable Ānanda is dwelling at Kosambi in Ghosita's Park, and he has been praised by the Teacher and is esteemed by his wise brothers in the holy life. The Venerable Ānanda is capable of teaching me the Dhamma in such a way that I might see the Dhamma. Since I have so much trust in the Venerable Ānanda, let me approach him.\"Then the Venerable Channa set his lodging in order, took his bowl and robe, and went to Ghosita's Park in Kosambi, where he approached the Venerable Ānanda and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and told the Venerable Ānanda everything that had happened, adding:sn.iii.134\"Let the Venerable Ānanda exhort me, let him instruct me, let him give me a Dhamma talk in such a way that I might see the Dhamma.\"",
    "sn22.90:8": "\"Even by this much am I pleased with the Venerable Channa. Perhaps the Venerable Channa has opened himself up and broken through his barrenness.[n.12]Khilaṁ pabhindi.MN I 101,9–27mentions five types of mental barrenness(cetokhila). Channa's problem seems to have been the fifth, anger and contemptuousness towards his fellow monks.Lend your ear, friend Channa, you are capable of understanding the Dhamma.\"",
    "sn22.90:9": "The Venerable Ānanda then said:\"In the presence of the Blessed One I have heard this, friend Channa, in his presence I have received the exhortation he spoke to the bhikkhu Kaccanagotta:",
    "sn22.90:10": "\"So it is, friend Ānanda, for those venerable ones who have such compassionate and benevolent brothers in the holy life to admonish and instruct them. And now that I have heard this Dhamma teaching of the Venerable Ānanda, I have made the breakthrough to the Dhamma.\""
}