{
    "sn22.96:1": "At Sāvatthī. Then a certain bhikkhu … Sitting to one side, that bhikkhu said to the Blessed One:",
    "sn22.96:2": "Then the Blessed One took up a little lump of cowdung in his hand and said to that bhikkhu: \"Bhikkhu, there is not even this much individual existence that is permanent, stable, eternal, not subject to change, and that will remain the same just like eternity itself. If there was this much individual existence that was permanent, stable, eternal, not subject to change, this living of the holy life for the complete destruction of suffering could not be discerned.[n.198]Spk: The holy life of the path arises stilling the formations of the three planes. If even this much individual existence were permanent, though the path might arise it would not be able to still the round of formations. Thus the holy life would not be discerned.But because there is not even this much individual existence that is permanent, stable, eternal, not subject to change, this living of the holy life for the complete destruction of suffering is discerned.",
    "sn22.96:3": "\"In the past, bhikkhu, I was a head-anointed khattiya king.[n.199]Spk: This is said to show: \"If any formations were permanent, then the success I enjoyed as King Mahāsudassana would have been permanent.\" On King Mahāsudassana, a past incarnation of the Buddha, see the eponymic sutta,DN No. 17.I had 84,000 cities, the chief of which was the capital Kusavati. I had 84,000 palaces, the chief of which was the palacenamedDhamma. I had 84,000 halls with peaked roofs, the chief of which was the hallnamedthe Great Array. I had 84,000 couches made of ivory, of heartwood, of gold and silver, decked with long-haired coverlets, embroidered with flowers, with choice spreads made of antelope hides,sn.iii.145with red awnings overhead and red cushions at both ends.",
    "sn22.96:4": "\"Of those 8,000 cities,[n.201] The passage beginning \"Of those 8,000 cities\" to the end is also atDN II 197–98, but the latter includes an additional closing paragraph. The homily on impermanence is atSN15.20(II 193,3–6).Spk: Having shown his success at the time when he was King Mahāsudassana, he now shows its impermanence. Just as a man might place a ladder against acampakatree, climb up, take acampakaflower, and then descend, so the Blessed One has climbed up the story of King Mahāsudassana's success, taken the characteristic of impermanence at the top, and descended.bhikkhu, there was only one city in which I resided at that time: the capital Kusavati. Of those 8,000 palaces,sn.iii.16there was only one palace in which I resided at that time: the palacenamedDhamma. Of those 8,000 halls with peaked roof, there was only one hall with peaked roof in which I resided at that time: the hallnamedthe Great Array. Of those 8,000 couches, there was only one couch that I used at that time, one made either of ivory or of heartwood or of gold or of silver."
}