{
    "sn22.59:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Baraṇasi in the Deer Park at Isipatana.[n.90] This is the second discourse of the Buddha, recorded at Vin I 3–4. The five bhikkhus are the first five disciples, who at this point are still trainees(sekha). They attain arahantship by the end of the discourse.Spk: Following the Dhammacakkappavattana Sutta (the first sermon), given on the full-moon day of Asaḷha (July), the five were gradually established in the fruit of stream-entry. On the fifth of the following fortnight, he addressed them, thinking, \"Now I will teach them the Dhamma for the destruction of the taints.\"There the Blessed One addressed the bhikkhus of the group of five thus: \"Bhikkhus!\"",
    "sn22.59:2": "\"Bhikkhus, form is nonself. For if, bhikkhus, form were self, this form would not lead to affliction, and it would be possible to have it of form: ‘Let my form be thus; let my form not be thus.’ But because form is nonself, form leads to affliction, and it is not possible to have it of form: ‘Let my form be thus; let my form not be thus.’[n.91] The sutta offers two \"arguments\" for thenattāthesis. The first demonstrates the selfless nature of the five aggregates on the ground that they are insusceptible to the exercise of mastery(avasavattitā). If anything is to count as our \"self\" it must be subject to our volitional control; since, however, we cannot bend the five aggregates to our will, they are all subject to affliction and therefore cannot be our self. For a fuller presentation of this argument, seeMN I 30–33. The second argument for anattā is introduced just below, beginning with the words \"What do you think? … \" This argument demonstrates the characteristic of nonself on the basis of the other two characteristics, impermanence and suffering, taken conjointly.",
    "sn22.59:3–5": "\"Feeling is nonself … .sn.iii.67… Perception is nonself … . Volitional formations are nonself … . Consciousness is nonself. For if, bhikkhus, consciousness were self, this consciousness would not lead to affliction, and it would be possible to have it of consciousness: ‘Let my consciousness be thus; let my consciousness not be thus.’ But because consciousness is nonself, consciousness leads to affliction, and it is not possible to have it of consciousness: ‘Let my consciousness be thus; let my consciousness not be thus.’",
    "sn22.59:6": "\"What do you think, bhikkhus, is form permanent or impermanent?\" - \"Impermanent, venerable sir.\" - \"Is what is impermanent suffering or happiness?\" - \"Suffering, venerable sir.\" - \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" - \"No, venerable sir.\"",
    "sn22.59:7": "\"Therefore, bhikkhus, any kind of form whatsoever, whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near, all form should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’",
    "sn22.59:8–10": "\"Any kind of feeling whatsoever … Any kind of perception whatsoever … Any kind of volitional formations whatsoever … Any kind of consciousness whatsoever, whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near, all consciousness should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’",
    "sn22.59:11": "\"Seeing thus, bhikkhus, the instructed noble disciple experiences revulsion towards form, revulsion towards feeling, revulsion towards perception, revulsion towards volitional formations, revulsion towards consciousness. Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated. When it is liberated there comes the knowledge: ‘It's liberated.’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\""
}