{
    "sn22.80:1": "On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in Nigrodha's Park.",
    "sn22.80:2": "Then, while the Blessed One was alone in seclusion, a reflection arose in his mind thus:[n.11] A similar passage is atMN I 457–59, but there the Sakyans first request the Buddha to pardon the bhikkhus, followed by Brahma Sahampati, who makes the same appeal. In the MN version the sequence of the two similes is inverted.\"The Saṅgha of bhikkhus has been dismissed by me. There are bhikkhus here who are newly ordained, not long gone forth, recently come to this Dhamma and Discipline. If they do not see me there may take place in them some alteration or change. Just as when a young calf does not see its mother there may take place in it some alteration or change, so too there are bhikkhus here who are newly ordained, not long gone forth, recently come to this Dhamma and Discipline. If they do not see me there may take place in them some alteration or change. Just as when young seedlings do not get water there may take place in them some alteration or change, so too there are bhikkhus here who are newly ordained, not long gone forth, recently come to this Dhamma and Discipline. If they do not see me there may take place in them some alteration or change. Let me assist the Saṅgha of bhikkhus now just as I have assisted it in the past.\"",
    "sn22.80:3": "Then Brahma Sahampati, having known with his own mind the reflection in the Blessed One's mind, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, disappeared from the brahma world and reappeared before the Blessed One.sn.iii.92He arranged his upper robe over one shoulder, raised his joined hands in reverential salutation towards the Blessed One, and said to him: \"So it is, Blessed One! So it is, Fortunate One! The Saṅgha of bhikkhus has been dismissed by the Blessed One. There are bhikkhus here who are newly ordained …as above, including the similes… If they do not see the Blessed One there may take place in them some alteration or change. Venerable sir, let the Blessed One take delight in the Saṅgha of bhikkhus! Let the Blessed One welcome the Saṅgha of bhikkhus! Let the Blessed One assist the Saṅgha of bhikkhus now just as he has assisted it in the past.\"",
    "sn22.80:4": "The Blessed One consented by silence. Then Brahma Sahampati, having understood the Blessed One's consent, paid homage to the Blessed One and, keeping him on his right, he disappeared right there.",
    "sn22.80:5": "Then in the evening the Blessed One emerged from seclusion and went to Nigrodha's Park. He sat down in the appointed seat and performed such a feat of spiritual power that the bhikkhus would come to him, alone and in pairs, in a timid manner.[n.122] I follow Se here, which reads:Tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāsi yathā te bhikkhū ekadvīhikāya sārajjamānarūpā yena bhagavā ten’ upasaṅkameyyuṃ.Be and Ee readyenāhaṁin place ofyena bhagavā;it seems the whole phrase is missing in SS.Spkglosses:Ekadvīhikāyā ti ek’ eko c’ eva dve dve ca hutvā. Sārajjamānarūpā ti ottappamānasabhāvā bhāyamānā.Spk: Why did the Buddha perform such a feat? From a desire for their welfare. For if they had come to him in groups they would not have shown reverence towards the Buddha nor would they have been able to receive a Dhamma teaching. But when they come timidly, ashamed, alone and in pairs, they show reverence and can receive a teaching.Then those bhikkhus approached the Blessed One, alone and in pairs, in a timid manner.sn.iii.93Having approached, they paid homage to the Blessed One and sat down to one side. The Blessed One then said to them:",
    "sn22.80:6": "\"Bhikkhus, this is the lowest form of livelihood, that is, gathering alms. In the world this is a term of abuse:[n.123]Abhisāpa,glossedakkosabySpk, which explains: \"For when people get angry they abuse their antagonist by saying, ‘You should put on a monk's robe, get yourself a begging bowl, and roam about seeking alms!’\"Kapāla,rendered here \"begging bowl,\" is not the usual word for a monk's almsbowl(= patta), but refers to the kind of bowl used by non-Buddhist ascetics (sometimes made from a skull); the use of the word seems pejorative. This paragraph and the next are also atIt 89–90. Some of the terms describing the deviant monk just below are commented on in I, n.17.‘You alms-gatherer; you roam about with a begging bowl in your hand!’ And yet, bhikkhus, clansmen intent on the good take up that way of life for a valid reason. It is not because they have been driven to it by kings that they do so, nor because they have been driven to it by thieves, nor owing to debt, nor from fear, nor to earn a livelihood. But they do so with the thought: ‘I am immersed in birth, aging, and death; in sorrow, lamentation, pain, displeasure, and despair. I am immersed in suffering, oppressed by suffering. Perhaps an ending of this entire mass of suffering might be discerned!’",
    "sn22.80:7": "\"It is in such a way, bhikkhus, that this clansman has gone forth. Yet he is covetous, inflamed by lust for sensual pleasures, with a mind full of ill will, with intentions corrupted by hate, muddle-minded, lacking clear comprehension, unconcentrated, scatter-brained, loose in his sense faculties. Just as a brand from a funeral pyre, burning at both ends and smeared with excrement in the middle, cannot be used as timber either in the village or in the forest, in just such a way do I speak about this person: he has missed out on the enjoyments of a householder, yet he does not fulfil the goal of asceticism.",
    "sn22.80:8": "\"There are, bhikkhus, these three kinds of unwholesome thoughts: sensual thought, thought of ill will, thought of harming.[n.124]Spksays this passage is introduced to show that this person has become like a brand from a funeral pyre because of his evil thoughts. The \"signless concentration\"(animittasamādhi)is insight concentration(vipassanā-samādhi), called \"signless\" because it removes the signs of permanence, etc. For more on the signless concentration, see IV, nn.20,312, 36., 36.And where, bhikkhus, do these three unwholesome thoughts cease without remainder? For one who dwells with a mind well established in the four establishments of mindfulness, or for one who develops the signless concentration. This is reason enough, bhikkhus, to develop the signless concentration. When the signless concentration is developed and cultivated, bhikkhus, it is of great fruit and benefit.",
    "sn22.80:9": "\"There are, bhikkhus, these two views: the view of existence and the view of extermination.[n.125]Spk: The view of existence(bhavadiṭṭhi)is eternalism(sassatadiṭṭhi); the view of extermination(vibhavadiṭṭhi)is annihilationism(ucchedadiṭṭhi). This passage is introduced to show that the signless concentration removes not only the three wrong thoughts but also eternalism and annihilationism.sn.iii.4Therein, bhikkhus, the instructed noble disciple reflects thus: ‘Is there anything in the world that I could cling to without being blameworthy?’ He understand thus: ‘There is nothing in the world that I could cling to without being blameworthy. For if I should cling, it is only form that I would be clinging to, only feeling … only perception … only volitional formations … only consciousness that I would be clinging to. With that clinging of mine as condition, there would be existence; with existence as condition, birth; with birth as condition, aging-and-death, sorrow, lamentation, pain, displeasure, and despair would come to be. Such would be the origin of this whole mass of suffering.’[n.126] Here the Buddha connects clinging, which arises on the basis of the mere five aggregates mistakenly held to as a self, with the last portion of the formula on dependent origination, thus showing present clinging to be the sustaining cause for the continuation of the round of existence. For a parallel, seeMN I 511,30–512,2.",
    "sn22.80:10": "\"What do you think, bhikkhus, is form permanent or impermanent? … Is feeling … perception … volitional formations … consciousness permanent or impermanent?\" - \"Impermanent, venerable sir.\" - \"Is what is impermanent suffering or happiness?\" - \"Suffering, venerable sir.\" - \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" - \"No, venerable sir.\""
}