{
    "sn22.99:1": "At Sāvatthī. \"Bhikkhus, this saṁsara is without discoverable beginning. A first point is not discerned of beings roaming and wandering on hindered by ignorance and fettered by craving.[n.203] As atSN5., etc. See II, n.254.",
    "sn22.99:2": "\"Suppose, bhikkhus, a dog tied up on a leash was bound to a strong post or pillar: it would just keep on running and revolving around that same post or pillar. So too, the uninstructed worldling … regards form as self … feeling as self … perception as self … volitional formations as self … consciousness as self … . He just keeps running and revolving around form, around feeling, around perception, around volitional formations, around consciousness.[n.05] The simile of the dog is also atMN II 3,4–33,4.Spk: The foolish worldling is like the dog, his view is like the leash, his personal identity(sakkāya)is like the post. Like the dog's running around the post is the worldling's running around his personal identity bound to it by craving and views.As he keeps on running and revolving around them, he is not freed from form, not freed from feeling, not freed from perception, not freed from volitional formations, not freed from consciousness. He is not freed from birth, aging, and death; not freed from sorrow, lamentation, pain, displeasure, and despair; not freed from suffering, I say.",
    "sn22.99:3": "\"But the instructed noble disciple … does not regard form as self … nor feeling as self … nor perception as self … nor volitional formations as self … nor consciousness as self … . He no longer keeps running and revolving around form, around feeling, around perception, around volitional formations, around consciousness. As he no longer keeps running and revolving around them, he is freed from form, freed from feeling, freed from perception, freed from volitional formations, freed from consciousness. He is freed from birth, aging, and death; freed from sorrow, lamentation, pain, displeasure, and despair; freed from suffering, I say.\"sn.iii.151"
}