{
    "sn22.47:1": "At Sāvatthī. \"Bhikkhus, those ascetics and brahmins who regardanything asself in various ways all regardas selfthe five aggregates subject to clinging, or a certain one among them. What five?",
    "sn22.47:2": "\"Thus this way of regarding things andthe notion‘I am’ have not vanished in him.[n.61] I read with Be and Se:asmi ti c’ assa avigataṁ hoti.Ee, and many mss, readadhigataṁforavigataṁ.That the latter reading must be correct is proved byAN III 9,16–17, where the affirmative occurs,asmi ti kho me vigataṁ.This same argument applies to the reading atSN.89below (III 18,34 foll.), despite the prevalence ofadhigataṁthere.Spkexplains \"this way of regarding things\" as regarding with views(diṭṭhisamanupassanā), and \"the notion ‘I am’\" as the \"triple proliferation\"(papañcattaya)of craving, conceit, and views. The two differ in that \"regarding\" is a conceptually formulated view, the notion \"I am\" a subtler manifestation of ignorance expressive of desire and conceit; see the important discussion atSN.89. The view of self is eliminated by the path of stream-entry; the notion \"I am\" is fully eradicated only by the path of arahantship.As ‘I am’ has not vanished, there takes place a descent of the five faculties—of the eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty.[n.6] I take this terse sentence to be describing the rebirth process contingent upon the persistence of the delusion of personal selfhood. Elsewhere \"descent\"(avakkanti)—of consciousness, or of name-and-form—indicates the commencement of a new existence (as atSN1.39,58,59). Spk: When there is this group of defilements, there is the production of the five faculties conditioned by defilements and kamma.There is, bhikkhus, the mind, there are mental phenomena, there is the element of ignorance. When the uninstructed worldling is contacted by a feeling born of ignorance-contact, ‘I am’ occurs to him; ‘I am this’ occurs to him; ‘I will be’ and ‘I will not be,’ and ‘I will consist of form’ and ‘I will be formless,’ and ‘I will be percipient’ and ‘I will be nonpercipient’ and ‘I will be neither percipient nor nonpercipient’—these occur to him.[n.63] I interpret this whole passage as a demonstration of how the new kammically active phase of existence commences through the renewal of conceiving in terms of the notion \"I am\" and speculative views of selfhood. Spk identifies \"mind\"(mano)with the kamma-mind(kammamano)and \"mental phenomena\"(dhammā)with its objects, or the former as thebhavaṅgaand adverting consciousness. Ignorance-contact(avijjāsamphassa)is the contact associated with ignorance(avijjāsampayuttaphassa).Ignorance is the most fundamental condition underlying this process, and when this is activated by feeling it gives rise to the notion \"I am\" (a manifestation of craving and conceit). The idea \"I am this\" arises subsequently, when the vacuous \"I\" is given a content by being identified with one or another of the five aggregates. Finally, full eternalist and annihilationist views originate when the imagined self is held either to survive death or to undergo destruction at death. This passage thus presents us with an alternative version of dependent origination, where the \"way of regarding things\" and the notion \"I am\" belong to the causally active side of the past existence; the five faculties to the resultant side of the present existence; and the recurrence of the notion \"I am\" to the causal side of the present existence. This will in turn generate renewed existence in the future.sn.iii.47",
    "sn22.47:3": "\"The five faculties remain right there, bhikkhus, but in regard to them the instructed noble disciple abandons ignorance and arouses true knowledge. With the fading away of ignorance and the arising of true knowledge, ‘I am’ does not occur to him; ‘I am this’ does not occur to him; ‘I will be’ and ‘I will not be,’ and ‘I will consist of form’ and ‘I will be formless,’ and ‘I will be percipient’ and ‘I will be nonpercipient’ and ‘I will be neither percipient nor nonpercipient’—these do not occur to him.\""
}