{
    "sn24.1:1": "At Sāvatthī. \"Bhikkhus, when what exists, by clinging to what, by adhering to what, does such a view as this arise: ‘The winds do not blow, the rivers do not flow, pregnant women do not give birth, the moon and sun do not rise and set but stand as steady as a pillar′?\"[n.249] This strange view seems to be a poetic statement of the illusory nature of change. The compoundesikaṭṭhāyiṭṭhita,\"stands as steady as a pillar,\" occurs in the statement of the eternalist views atDN I 4–6and in the doctrine of the seven bodies just below (SN24.8; III 2,8). A doctrine holding time and change to be illusory(avicalita-nityatva)emerged later in the history of the Ājīvika school and may have been brought into the system from the school of Pakudha Kaccāyana, the propounder of the \"doctrine of the seven bodies.\" See Basham,History and Doctrines of the Ājīvikas,p. 236. At Mvu III 37 a similar view, stated in nearly identical terms, is cited as an example of the \"wicked and wrong beliefs\" that were circulating in Magadha before the Buddha arrived on the scene; see Jones SN3.306.Spk: This, it is said, was their view: \"Although winds blow breaking the branches of trees, etc., these are not (really) winds; they are facsimiles of wind (vātalesā;Spk-pṭ:vātalesā ti vātasadisā). The wind stands as steady as a pillar and a mountain peak. [Spk-pṭ: The phrase ‘as a pillar’ shows its immobility(niccalabhāva); ‘a mountain peak,’ its eternality(sassatisama).] Similarly with water. Though it is said that pregnant women give birth, the fetuses do not (really) emerge; those are facsimiles of fetuses. Though the sun and moon rise and set, they do not (really) do so; those are facsimiles of the sun and moon, which stand as steady as a pillar and a mountain peak.\"",
    "sn24.1:2": "\"Venerable sir, our teachings are rooted in the Blessed One … .\"",
    "sn24.1:3–4": "\"When there is form, bhikkhus, by clinging to form, by adhering to form, such a view as this arises: ‘The winds do not blow … but stand as steady as a pillar.’ When there is feeling … perception … volitional formations … consciousness, by clinging to consciousness, by adhering to consciousness, such a view as this arises: ‘The winds do not blow … but stand as steady as a pillar.’",
    "sn24.1:5": "\"When, bhikkhus, a noble disciple has abandoned perplexity in these six cases,[n.21] I readimesu chasu ṭhānesu,with Se and Ee, as against Beimesu ca ṭhānesu.Spkis silent, but it seems the six cases are the five aggregates and the tetrad of sense objects taken collectively as one. Cp.MN I 13,34–36, where the tetrad of sense objects actually replaces viññāṇa as a basis for wrong views(diṭṭhiṭṭhāna).and when, further, he has abandoned perplexity about suffering, the origin of suffering, the cessation of suffering, and the way leading to the cessation of suffering, he is then called a noble disciple who is a stream-enterer, no longer bound to the nether world, fixed in destiny, with enlightenment as his destination.\""
}