{
    "sn24.6:1": "At Sāvatthī. \"Bhikkhus, when what exists, by clinging to what, by adhering to what, does such a view as this arise:[n.255] The doctrine of the inefficacy of action(akiriyavāda), atDN I 52,22–53,2ascribed to Pūraṇa Kassapa. SeeFruits of Recluseship,pp. 69–70.‘When one acts or makes others act, when one mutilates or makes others mutilate, when one tortures or makes others inflict torture, when one inflicts sorrow or makes others inflict sorrow, when one oppresses or makes others inflict oppression, when one intimidates or makes others inflict intimidation, when one destroys life, takes what is not given, breaks into houses, plunders wealth, commits burglary, ambushes highways, seduces another's wife, utters falsehood—no evil is done by the doer. If, with a razor-rimmed wheel, one were to make the living beings of this earth into one mass of flesh, into one heap of flesh, because of this there would be no evil and no outcome of evil. If one where to go along the south bank of the Gangessn.iii.209killing and slaughtering, mutilating and making others mutilate, torturing and making others inflict torture, because of this there would be no evil and no outcome of evil. If one where to go along the north bank of the Ganges giving gifts and making others give gifts, making offerings and making others make offerings, because of this there would be no merit and no outcome of merit. By giving, by taming oneself, by self-control, by speaking truth, there is no merit and no outcome of merit’?\"",
    "sn24.6:2–3": "\"When there is form, bhikkhus, when there is feeling … perception … volitional formations … consciousness, by clinging to consciousness, by adhering to consciousness, such a view as this arises: ‘When one acts or makes others act … there is no merit and no outcome of merit.’ …",
    "sn24.6:4": "\"When, bhikkhus, a noble disciple has abandoned perplexity in these six cases … he is then called a noble disciple who is a stream-enterer … with enlightenment as his destination.\"sn.iii.210"
}