{
    "sn25.1:1": "At Sāvatthī. \"Bhikkhus, the eye is impermanent, changing, becoming otherwise. The ear … The nose … The tongue … The body … The mind is impermanent, changing, becoming otherwise. One who places faith in these teachings and resolves on them thus is called a faith-follower, one who has entered the fixed course of rightness, entered the plane of superior persons, transcended the plane of the worldlings. He is incapable of doing any deed by reason of which he might be reborn in hell, in the animal realm, or in the domain of ghosts; he is incapable of passing away without having realized the fruit of stream-entry.[n.268] The faith-follower(saddhānusārī)and the Dhamma-follower(dhammānusārī), described just below, are the two classes of disciples who are practising for realization of the fruit of stream-entry. The two are the lowest ranking members of a comprehensive sevenfold typology of noble disciples found, with formal definitions, atMN70. The seven types are also defined, somewhat differently, at Pp 4–5 (§§30–36) and at Vism 659–60 (Ppn 2:74–78). The faith-follower and the Dhamma-follower are also distinguished atSN55:24andSN55:25, though the terms themselves are not used there. AtSN48:2–7they come at the end of the more usual list of noble persons, in place of the one practising for the realization of the fruit of stream-entry, and here the faith-follower is placed below the Dhamma-follower for the reason that his faculties are weaker.Briefly, the faith-follower and the Dhamma-follower differ with regard to their dominant faculty: the former relies on faith as the vehicle of progress, the latter on wisdom. When they attain the fruit of stream-entry, the former becomes \"one liberated by faith\" (saddhāvimutta; seeMN70), the latter \"one attained by view\"(diṭṭhippatta.).According to the Abhidhamma system, with its conception of the supramundane path as lasting for only a single mind-moment, both the faith-follower and the Dhamma-follower should be such for only the one mind-moment of the path. This interpretation, however, though advocated by the commentaries, is difficult to reconcile with the Nikāyas. For an interesting discussion of the two models, see Gethin,The Buddhist Path to Awakening,pp. 29–33.Spkexplains \"the fixed course of rightness\"(sammattaniyāma)as the noble path(ariyamagga). On the clause, \"he is incapable of passing away without having realized the fruit of stream-entry,\" Spk says that once the path has arisen there can be no obstruction to the fruit. It quotes Pp 3 (§20): \"Should this person be one practising for the realization of the fruit of stream-entry, and should it be the time when the aeon is to burn up, the aeon will not burn up until that person realizes the fruit of stream-entry.\"",
    "sn25.1:2": "\"One for whom these teachings are accepted thus after being pondered to a sufficient degree with wisdom is called a Dhamma-follower,[n.69] On the Dhamma-follower … the commentaries do not clarify the syntax of the expressionime dhammā evaṃ paññāya mattaso nijjhānaṃ khamanti.Thoughnijjhānamis accusative, in English idiom it is more naturally rendered with an ablative sense.Spk:Mattaso nijjhānaṁ khamanti ti pamaṇato olokanaṁ khamanti;\"Accepted after being pondered to a sufficient degree\": accepted in measure (through) examination. Spk-pṭ:Olokanan ti saccābhisamayasaṅkhātaṃ dassanaṁ; khamanti sahanti, ñayanti ti attho;\"Examination\": vision consisting in the breakthrough to the truths. \"Accepted\": consented to, meaning \"are known.\"Spk-pṭ is trying to identify the Dhamma-follower's \"examination\" or \"pondering\" of the teachings with the breakthrough to the truths achieved on the occasion of stream-entry, but the sutta itself distinguishes them, the former being merely preliminary to the latter.one who has entered the fixed course of rightness, entered the plane of superior persons, transcended the plane of the worldlings. He is incapable of doing any deed by reason of which he might be reborn in hell, in the animal realm, or in the domain of ghosts; he is incapable of passing away without having realized the fruit of stream-entry."
}