{
    "sn3.16:1": "At Sāvatthī. Then King Pasenadi of Kosala approached the Blessed One, paid homage to him, and sat down to one side. Then a certain man approached King Pasenadi and informed him in a whisper: \"Sire, Queen Mallika has given birth to a daughter.\" When this was said, King Pasenadi was displeased.[n.238]Spk: He was displeased thinking, \"I elevated Queen Mallika from a poor family to the rank of queen. If she had given birth to a son she would have won great honour, but now she has lost that opportunity.\" This daughter was almost certainly the Princess Vajīrī (seeMN II 0, 0–8), who was later married to King Ajatasattu of Magadha after the two kings were reconciled. Prince Viḍūḍabha, the heir to the throne, was begotten from another wife of Pasenadi, Vasabha-khattiya, a Sakyan lady of mixed descent who was passed off to Pasenadi as a pure-bred Sakyan princess. Viḍūḍabha later usurped the throne and left his father to die in exile. When he learned that the Sakyans had deceived his father he massacred them and almost decimated the entire Saykan clan.",
    "sn3.16:2": "Then the Blessed One, having understood that King Pasenadi was displeased, on that occasion recited these verses:",
    "sn3.16:3": "v.408\"A woman, O lord of the people,May turn out better than a man:She may be wise and virtuous,A devoted wife, revering her mother-in-law.[n.29] in pāda b, I follow Ee1 & 2 in readingposa,\"than a man,\" though Be and Se, as well asSpk, readposa,which Spk glosses as the imperativeposehi,\"nourish (her).\" Spk sees the comparison with a son implicit inseyya:\"Even a woman may be better than a dull, stupid son.\" in pāda d,sassudevaliterally means \"having (her) mother-in-law as a deva\"; Spk adds father-in-law in the gloss.",
    "sn3.16:4": "v.09\"The son to whom she gives birthMay become a hero, O lord of the land.The son of such a blessed womanMay even rule the realm.\"[n.20] in pāda b, it is uncertain from the text whetherdisampatiis nominative or vocative, but I followSpk, which glosses it with the vocativedisajeṭṭhaka.With Be, Se, and Ee2, I read pāda c astadisa subhagiya puttoand comply with Spk by translatingtadisaas if it were a truncated genitive qualifying the woman. Ee1 readstadisoin apposition toputto."
}