{
    "sn3.15:1": "sn.i.84Opening as in §4:In that battle King Pasenadi defeated King Ajatasattu and captured him alive. Then it occurred to King Pasenadi: \"Although this King Ajatasattu of Magadha has transgressed against me while I have not transgressed against him, still, he is my nephew. Let me now confiscate all his elephant troops, all his cavalry, all his chariot troops, and all his infantry, and let him go with nothing but his life.\"",
    "sn3.15:2": "Then King Pasenadi confiscated all King Ajatasattu's elephant troops, all his cavalry, all his chariot troops, and all his infantry, and let him go with nothing but his life.",
    "sn3.15:3–5": "Then, in the morning, a number of bhikkhus dressed and, taking their bowls and robes, entered Sāvatthī for alms. When they had walked for alms in Sāvatthī and had returned from their alms round, after the meal they approached the Blessed One, paid homage to him, sat down to one side, and reported what had happened.sn.i.85",
    "sn3.15:6": "Then the Blessed One, having understood the meaning of this, on that occasion recited these verses:",
    "sn3.15:7": "v.405\"A man will go on plunderingSo long as it serves his ends,But when others plunder him,The plunderer is plundered.[n.236] I read pāda d with Be and Se:so vilutto viluppati,as against Ee1 & 2 vilumpati.Spkglosses the line, in its occurrence at v.40f, with a passive verb:so vilumpako vilumpiyati.To preserve the logic of the verse it is really necessary to accept the passive verb and to understand the passive past participle as active in sense. The BHS version at Uv 9:9 is more intelligible, with an agent noun in place of the past participle:so vilopta vilupyate.",
    "sn3.15:8": "v.406\"The fool thinks fortune is on his sideSo long as his evil does not ripen,But when the evil ripensThe fool incurs suffering.",
    "sn3.15:9": "v.407\"The killer begets a killer,One who conquers, a conqueror.The abuser begets abuse,The reviler, one who reviles.Thus by the unfolding of kammaThe plunderer is plundered.\"[n.237]Spkglosseskammavivaṭṭena:\"By the maturation of kamma, when the kamma of plundering yields its result.\" Spk-pṭ adds: \"The kamma which has vanished matures when it gains an opportunity (to ripen) by meeting a condition (conducive to its ripening).\"sn.i.86"
}