{
    "sn3.13:1": "At Sāvatthī. Now on that occasion King Pasenadi of Kosala had eaten a bucket measure of rice and curries.[n.229] Be:doṇapākakuraṁ;Se and Ee:doṇapākasudaṁ;Ee2:doṇapākaṁ sudaṁ.Spk: He ate rice cooked from adoṇaof rice grains along with suitable soups and curries. Thedoṇais a measure of volume, perhaps a \"bucket,\" obviously far more than the capacity of an ordinary person's stomach.Then, while still full, huffing and puffing, the king approached the Blessed One, paid homage to him, and sat down to one side.",
    "sn3.13:2": "Then the Blessed One, having understood that King Pasenadi was full and was huffing and puffing, on that occasion recited this verse:",
    "sn3.13:3": "v.402\"When a man is always mindful,Knowing moderation in the food he eats,His ailments then diminish:He ages slowly, guarding his life.\"sn.i.82",
    "sn3.13:4": "Now on that occasion the brahmin youth Sudassana was standing behind King Pasenadi of Kosala. The king then addressed him thus: \"Come now, dear Sudassana, learn this verse from the Blessed One and recite it to me whenever I am taking my meal. I will then present you daily with a hundred kahāpaṇas as a perpetual grant.\"[n.230] The kahāpaṇa was the standard currency unit of the period. See Singh,Life in North-Eastern India,pp. 255–57.",
    "sn3.13:5": "v.403\"When a man is always mindful …He ages slowly, guarding his life.\"",
    "sn3.13:6": "Then King Pasenadi of Kosala gradually reduced his intake of food to at most a pint-pot measure of boiled rice.[n.231]Spksays that thenaḷika,which I render pint-pot (after Burlingame), is the proper portion for a man; I could not find any source specifying the relation betweendoṇaandnaḷika.Spk explains that the Buddha had instructed Sudassana to recite the verse, not when the king began his meal, but when he approached the end. In this way each day the king gradually left aside the last portion of food until he reached the proper measure.A more elaborate version of the story is at Dhp-a III 24–, where it serves as the background toDhp 325; see BL 3:7–77. In this version the king's advisor is Prince Uttarā rather than the brahmin youth Sudassana.At a later time, when his body had become quite slim, King Pasenadi of Kosala stroked his limbs with his hand and on that occasion uttered this inspired utterance: \"The Blessed One showed compassion towards me in regard to both kinds of good—the good pertaining to the present life and that pertaining to the future life.\"[n.232]Spk: The good pertaining to the present life was the slimming of the body; the good pertaining to the future was virtue(sīla), one aspect of which is moderation in eating. SeeSN3:17."
}