{
    "sn3.22:1": "At Sāvatthī. Then, in the middle of the day, King Pasenadi of Kosala approached the Blessed One. … The Blessed One said to him as he was sitting to one side:sn.i.97\"Where are you coming from, great king, in the middle of the day?\"",
    "sn3.22:2": "\"Venerable sir, my grandmother has died. She was old, aged, burdened with years, advanced in life, come to the last stage, 10 years from birth. Venerable sir, my grandmother was dear and beloved to me. If, venerable sir, by means of the elephant-gem I could have redeemed her from death, I would have given away even the elephant-gem so that she would not have died.[n.51] Lit., \"If by means of the elephant-gem I could have it, ‘Let my grandmother not die,’ I would have given away the elephant-gem, (thinking), ‘Let my grandmother not die.’\"Spk: When his mother died his grandmother filled her place in bringing him up; hence he had such strong affection for her. The elephant-gem was an elephant worth 100,000kahapaṇa,decked with ornaments worth the same amount. The same explanation applies to the horse-gem and the prize village.If by means of the horse-gem I could have redeemed her from death … If by a prize village I could have redeemed her from death … If by means of the country I could have redeemed her from death, I would have given away even the country so that she would not have died.\"",
    "sn3.22:3": "\"So it is, great king! So it is, great king! All beings, great king, are subject to death, terminate in death, and cannot escape death. Just as all the potter's vessels, whether unbaked or baked, are subject to a breakup, terminate in their breakup, and cannot escape their breakup, so all beings are subject to death, terminate in death, and cannot escape death.",
    "sn3.22:4": "v.31\"All beings will die,For life ends in death.They will fare according to their deeds,Reaping the fruits of their merit and evil:The doers of evil go to hell,The doers of merit to a happy realm.",
    "sn3.22:5": "v.432\"Therefore one should do what is goodAs a collection for the future life.Merits are the support for living beingsWhen they arisein the other world.\"sn.i.98"
}