{
    "sn3.8:1": "At Sāvatthī. Now on that occasion King Pasenadi of Kosala had gone together with Queen Mallika to the upper terrace of the palace. Then King Pasenadi of Kosala said to Queen Mallika: \"Is there, Mallika, anyone more dear to you than yourself?\"[n.22] Mallika had been a poor flower girl whom King Pasenadi met by chance after a military defeat. He fell in love with her, married her, and appointed her his chief queen (see prologue to Ja No. 45).Spk: The king had asked her this question expecting her to say, \"You are dearer to me than myself,\" and then to ask him the same question, to which he would have given the same reply, so that they would have strengthened their mutual love. But Mallika, being wise and learned, answered with complete honesty(sarasen’ eva) and the king too had to reply in the same way. The translation ofattaas soul at KS :0 is misleading, despite the attempt at justification in the accompanying footnote. The sutta (inclusive of the verse) is atUd 47, with the verse described as an \"inspired utterance\"(udana).The conversation between King Pasenadi and Mallika is strikingly reminiscent of the discussion between the sage Yajñavalkya and his wife Maitreyī recorded at Bṛhadaraṇyaka Upaniṣad II.4.5 (also at IV.5.6): \"Verily, a husband is not dear, that you may love the husband; but that you may love the Self, therefore a husband is dear. Verily, a wife is not dear, that you may love the wife; but that you may love the Self, therefore a wife is dear\" (Müller,The Upanishads,2:09–0, 82–83). It is conceivable that the Buddhist conversation is modelled after the Upaniṣad but with a different message. Whereas Yajñavalkya affirms a transcendent Self—theAtman—which is \"to be seen, to be heard, to be perceived, to be marked,\" the Buddha extracts an ethical maxim: since one loves oneself above all others, one should realize the same is true of others and treat them with kindness and respect.",
    "sn3.8:2": "Then King Pasenadi of Kosala descended from the palace and approached the Blessed One. Having approached, he paid homage to the Blessed One, sat down to one side, and related to the Blessed One his conversation with Queen Mallika.",
    "sn3.8:3": "Then the Blessed One, having understood the meaning of this, on that occasion recited this verse:",
    "sn3.8:4": "v.392\"Having traversed all quarters with the mind,One finds none anywhere dearer than oneself.Likewise, each person holds himself most dear;Hence one who loves himself should not harm others.\""
}