{
    "sn3.20:1–2": "As in previous sutta except that the amount is a hundred lakhs of gold, a lakh being equal to a hundred thousand:sn.i.92",
    "sn3.20:3": "\"So it is, great king! So it is, great king! Once in the past, great king, that financier householder provided a paccekabuddha named Tagarasikhi with almsfood. Having said, ‘Give alms to the ascetic,’ he rose from his seat and departed. But after giving, he later felt regret and thought: ‘It would have been better if the slaves or workers had eaten that almsfood!’ Moreover, he murdered his brother's only son for the sake of his fortune.[n.247] Apaccekabuddhais one who attains enlightenment independently of a perfectly enlightened Buddha(samma sambuddha,)but unlike a perfectly enlightened Buddha does not establish a sasana, a religious \"dispensation.\" They are said to arise only at times when a Buddha’s dispensation does not exist in the world. The story is elaborated inSpkand at Dhp-a IV 77–78; see BL :240. A version at Ja No. 90 does not mention the murder of the nephew or the rebirth in hell. A partly parallel story of abuse towards the paccekabuddha Tagarasikhī is related atUd 50,14–19.",
    "sn3.20:4": "\"Because that financier householder provided the paccekabuddha Tagarasikhi with almsfood, as a result of that kamma he was reborn seven times in a good destination, in the heavenly world. As a residual result of that same kamma, he obtained the position of financier seven times in this same city of Sāvatthī. But because that financier householder later felt regret about giving, as a result of that kamma his mind did not incline to the enjoyment of excellent food, excellent clothing, and excellent vehicles, nor to the enjoyment of excellent items among the five cords of sensual pleasure. And because that financier householder murdered his brother's only son for the sake of his fortune, as a result of that kamma he was tormented in hell for many years, for many hundreds of years, for many thousands of years, for many hundreds of thousands of years. As a residual result of that same kamma, he has furnished the royal treasury with this seventh heirless fortune.",
    "sn3.20:5": "v.416\"Grain, wealth, silver, gold,Or whatever other possessions there are,Slaves, workers, messengers,And those who live as one's dependants:",
    "sn3.20:6": "v.417Without taking anything one must go,Everything must be left behind.\"But what one has done by body,Or by speech or mind:",
    "sn3.20:7": "v.418This is what is truly one's own,This one takes when one goes;This is what follows one alongLike a shadow that never departs.",
    "sn3.20:8": "v.419\"Therefore one should do what is goodAs a collection for the future life.Merits are the support for living beingsWhen they arisein the other world.\""
}