{
    "sn3.21:1": "At Sāvatthī. Then King Pasenadi of Kosala approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him:",
    "sn3.21:2": "\"Great king, there are these four kinds of persons found existing in the world. What four? The one heading from darkness to darkness, the one heading from darkness to light, the one heading from light to darkness, the one heading from light to light.[n.49] The sutta without the similes and verses is atAN II 85–86; see too Pp 51,1–5,3.Spk: One is in darkness(tamo)because one is conjoined with darkness by being reborn in a low family, and one is heading towards darkness(tamoparayaṇa)because one is approaching the darkness of hell. One is in light(joti)because one is conjoined with light by being reborn in a high family, and one is heading towards light(jotiparayaṇa)because one is approaching the light of a heavenly rebirth.\"And how, great king, is a person one heading from darkness to darkness? Here some person has been reborn in a low family—a family of caṇḍalas, bamboo workers, hunters, cartwrights, or flower-scavengers—a poor family in which there is little food and drink and which subsists with difficulty,sn.i.94one where food and clothing are obtained with difficulty; and he is ugly, unsightly, deformed, chronically ill—purblind or cripple-handed or lame or paralyzed.[n.50] The caṇḍalas were the most despised of the outcasts; see Singh, Life in North-Eastern India, pp. 16–0. Spk glosses venakula as vilivakarakula, family of basket weavers; the two occupations are listed separately at Mil 331. Rathakarakula is glossed as cammakarakula, family of leather workers (Spk-pṭ: because the straps of carts are made of leather); and pukkusakula as pupphachaḍḍakakula, family of those who throw away wilted flowers. Perhaps the latter more generally included all sweepers and refuse removers.He is not one who gains food, drink, clothing, and vehicles; garlands, scents, and unguents; bedding, housing, and lighting. He engages in misconduct of body, speech, and mind. Having done so, with the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the nether world, in hell.",
    "sn3.21:3": "\"Suppose, great king, a man would go from darkness to darkness, or from gloom to gloom, or from stain to stain: this person, I say, is exactly similar. It is in this way, great king, that a person is one heading from darkness to darkness.",
    "sn3.21:4": "\"And how, great king, is a person one heading from darkness to light? Here some person has been reborn in a low family … one where food and clothing are obtained with difficulty; and he is ugly … or paralyzed. He is not one who gains food … and lighting. He engages in good conduct of body, speech, and mind. Having done so, with the breakup of the body, after death, he is reborn in a good destination, in a heavenly world.",
    "sn3.21:5": "\"Suppose, great king, a man would climb from the ground on to a palanquin, or from a palanquin on to horseback, or from horseback to an elephant mount, or from an elephant mount to a mansion: this person, I say, is exactly similar. It is in this way, great king, that a person is one heading from darkness to light.",
    "sn3.21:6": "\"And how, great king, is a person one heading from light to darkness? Here some person has been reborn in a high family—an affluent khattiya family, an affluent brahmin family, or an affluent householder family—one which is rich, with great wealth and property,sn.i.95with abundant gold and silver, abundant treasures and commodities, abundant wealth and grain; and he is handsome, attractive, graceful, possessing supreme beauty of complexion. He is one who gains food, drink, clothing, and vehicles; garlands, scents, and unguents; bedding, housing, and lighting. He engages in misconduct of body, speech, and mind. Having done so, with the breakup of the body, after death, he is reborn in the plane of misery, in a bad destination, in the nether world, in hell.",
    "sn3.21:7": "\"Suppose, great king, a man would descend from a mansion to an elephant mount, or from an elephant mount to horseback, or from horseback to a palanquin, or from a palanquin to the ground, or from the ground to underground darkness: this person, I say, is exactly similar. It is in this way, great king, that a person is one heading from light to darkness.",
    "sn3.21:8": "\"And how, great king, is a person one heading from light to light? Here some person has been reborn in a high family … with abundant wealth and grain; and he is handsome, attractive, graceful, possessing supreme beauty of complexion. He is one who gains food … and lighting. He engages in good conduct of body, speech, and mind. Having done so, with the breakup of the body, after death, he is reborn in a good destination, in a heavenly world.",
    "sn3.21:9": "\"Suppose, great king, a man would cross over from palanquin to palanquin, or from horseback to horseback, or from elephant mount to elephant mount, or from mansion to mansion: this person, I say, is exactly similar. It is in this way, great king, that a person is one heading from light to light.sn.i.6",
    "sn3.21:10": "v.419\"The person, O king, who is poor,Lacking in faith, stingy,Niggardly, with bad intentions,Wrong in views, disrespectful,",
    "sn3.21:11": "v.420Who abuses and reviles ascetics,Brahmins, and other mendicants;A nihilist, a scoffer, who hindersAnother giving food to beggars:",
    "sn3.21:12": "v.421When such a person dies, O king,He goes, lord of the people,To the terrible hell,Heading from darkness to darkness.",
    "sn3.21:13": "v.422\"The person, O king, who is poor,Endowed with faith, generous,One who gives, with best intentions,A person with unscattered mind",
    "sn3.21:14": "v.423Who rises up and venerates ascetics,Brahmins, and other mendicants;One who trains in righteous conduct,Who hinders none giving food to beggars:",
    "sn3.21:15": "v.424When such a person dies, O king,He goes, lord of the people,To the triple heaven,Heading from darkness to light.",
    "sn3.21:16": "v.425\"The person, O king, who is rich,Lacking in faith, stingy,Niggardly, with bad intentions,Wrong in views, disrespectful,",
    "sn3.21:17": "v.426Who abuses and reviles ascetics,Brahmins, and other mendicants;A nihilist, a scoffer, who hindersAnother giving food to beggars:",
    "sn3.21:18": "v.427When such a person dies, O king,He goes, lord of the people,To the terrible hell,Heading from light to darkness.",
    "sn3.21:19": "v.428\"The person, O king, who is rich,Endowed with faith, generous,One who gives, with best intentions,A person with unscattered mind",
    "sn3.21:20": "v.429Who rises up and venerates ascetics,Brahmins, and other mendicants;One who trains in righteous conduct,Who hinders none giving food to beggars:",
    "sn3.21:21": "v.430When such a person dies, O king,He goes, lord of the people,To the triple heaven,Heading from light to light.\""
}