{
    "sn3.12:1": "At Sāvatthī. Now on that occasion five kings headed by King Pasenadi were enjoying themselves supplied and endowed with the five cords of sensual pleasure when this conversation arose among them: \"What is the chief of sensual pleasures?\"[n.224]Spkdoes not identify the other four kings. The fact that they are designated raja does not necessarily imply they were rulers of independent states on a par with Pasenadi, though the mutual use of the addressmarisasuggests they enjoyed parity of status with him.",
    "sn3.12:2": "Since those kings were unable to convince one another, King Pasenadi of Kosala said to them: \"Come, dear sirs, let us approach the Blessed One and question him about this matter. As the Blessed One answers us, so we should remember it.\"",
    "sn3.12:3": "Then those five kings, headed by King Pasenadi, approached the Blessed One, paid homage to him, and sat down to one side. King Pasenadi then reported their entire discussion to the Blessed One, asking: \"What now, venerable sir, is the chief of sensual pleasures?\"",
    "sn3.12:4": "\"Great king, I say that what is chief among the five cords of sensual pleasure is determined by whatever is most agreeable.[n.226]Manāpapariyantaṁ khvāhaṁ mahārāja pañcasu kāmaguṇesu aggan ti vadāmi.My rendering expands slightly on the compressed Pali idiom.Spkglossesmanāpapariyantaṁbymanāpanipphattiṁ manapakoṭikaṁ.Spk-pṭ: Whatever a person cherishes, being in his view the chief, is presented by him as the culmination, as the ultimate.Those same forms that are agreeable to one person, great king, are disagreeable to another. When one is pleased and completely satisfied with certain forms, then one does not yearn for any other form higher or more sublime than those forms. For him those forms are then supreme; for him those forms are unsurpassed.",
    "sn3.12:5–8": "\"Those same sounds … Those same odours … Those same tastes … … Those same tactile objects that are agreeable to one person, great king, are disagreeable to another.sn.i.81When one is pleased and completely satisfied with certain tactile objects, then one does not yearn for any other tactile object higher or more sublime than those tactile objects. For him those tactile objects are then supreme; for him those tactile objects are unsurpassed.\"",
    "sn3.12:9": "Now on that occasion the lay follower Candanaṅgalika was sitting in that assembly. Then the lay follower Candanaṅgalika rose from his seat, arranged his upper robe over one shoulder, and, raising his joined hands in reverential salutation towards the Blessed One, said to him: \"An inspiration has come to me, Blessed One! An inspiration has come to me, Fortunate One!\"",
    "sn3.12:10": "Then the lay follower Candanaṅgalika, in the presence of the Blessed One, extolled him with an appropriate verse:",
    "sn3.12:11": "v.401\"As the fragrant red lotus KokanadaBlooms in the morning, its fragrance unspent,Behold Angirasa, the Radiant One,Like the sun beaming in the sky.\"[n.228]Spk:Kokanadais a synonym for the red lotus(paduma). The Buddha is calledAṅgīrasabecause rays issue from his body(aṅgato rasmiyo nikkhamanti). A parallel including the verse is atAN III 239–40. See too Vism 388,1–4 (Ppn 12:60) and Dhp-a I 244 (BL 1:302), and cp. v.752.On Aṅgīrasa Malalasekera remarks (DPPN 1:20): \"It is, however, well known that, according to Vedic tradition, the Gautamas belong to the Añgīrasa tribe; the word, as applied to the Buddha, therefore is probably a patronymic.\"",
    "sn3.12:12": "Then those five kings bestowed five upper robes upon the lay follower Candanaṅgalika. But the lay follower Candanaṅgalika bestowed those five upper robes upon the Blessed One."
}