{
    "sn3.19:1": "At Sāvatthī. Then King Pasenadi of Kosala approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him: \"Where are you coming from, great king, in the middle of the day?\"",
    "sn3.19:2": "\"Here, venerable sir, a financier householder in Sāvatthī has died. I have come after conveying his heirless fortune to the palace, as he died intestate.[n.45] Theseṭṭhiwere the wealthy money lenders in the large towns and cities of northern India. Originally guild masters, in time they came to function as private bankers and often played decisive roles in political affairs. Anāthapiṇḍika was said to be aseṭṭhi.See Singh,Life in North-Eastern India,pp. 49–51. Apparently when a wealthy man died intestate, the king was entitled to his fortune.There were eighty lakhs of gold,sn.i.90not to speak of silver, and yet, venerable sir, that financier householder's meals were like this: he ate red rice along with sour gruel. His clothes were like this: he wore a three-piece hempen garment. His vehicle was like this: he went about in a dilapidated little cart with a leaf awning.\"[n.46] A lakh is a hundred thousand.Spkexplainskaṇajakaas rice with the red powder from the husk(sakuṇḍakabhatta);tipakkhavasana,as a garment made by sewing together three pieces of cloth.",
    "sn3.19:3": "\"So it is, great king! So it is, great king! When an inferior man gains abundant wealth, he does not make himself happy and pleased, nor does he make his mother and father happy and pleased, nor his wife and children, nor his slaves, workers, and servants, nor his friends and colleagues; nor does he establish an offering for ascetics and brahmins, one leading upwards, of heavenly fruit, resulting in happiness, conducive to heaven. Because his wealth is not being used properly, kings take it away, or thieves take it away, or fire burns it, or water carries it away, or unloved heirs take it. Such being the case, great king, that wealth, not being used properly, goes to waste, not to utilization.",
    "sn3.19:4": "\"Suppose, great king, in a place uninhabited by human beings, there was a lotus pond with clear, cool, sweet, clean water, with good fords, delightful; but no people would take that water, or drink it, or bathe in it, or use it for any purpose. In such a case, great king, that water, not being used properly, would go to waste, not to utilization. So too, great king, when an inferior man gains abundant wealth … that wealth, not being used properly, goes to waste, not to utilization.",
    "sn3.19:5": "\"But, great king, when a superior man gains abundant wealth, he makes himself happy and pleased, and he makes his mother and father happy and pleased, and his wife and children, and his slaves, workers, and servants, and his friends and colleagues; and he establishes an offering for ascetics and brahmins, one leading upwards, of heavenly fruit, resulting in happiness, conducive to heaven. Because his wealth is being used properly,sn.i.91kings do not take it away, thieves do not take it away, fire does not burn it, water does not carry it away, and unloved heirs do not take it. Such being the case, great king, that wealth, being used properly, goes to utilization, not to waste.",
    "sn3.19:6": "\"Suppose, great king, not far from a village or a town, there was a lotus pond with clear, cool, sweet, clean water, with good fords, delightful; and people would take that water, and drink it, and bathe in it, and use it for their purposes. In such a case, great king, that water, being used properly, would go to utilization, not to waste. So too, great king, when a superior man gains abundant wealth … that wealth, being used properly, goes to utilization, not to waste.",
    "sn3.19:7": "v.414\"As cool water in a desolate placeEvaporates without being drunk,So when a scoundrel acquires wealthHe neither enjoys himself nor gives.",
    "sn3.19:8": "v.415\"But when the wise man obtains wealthHe enjoys himself and does his duty.Having supported his kin, free from blame,That noble man goes to a heavenly state.\""
}