{
    "sn3.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then King Pasenadi of Kosala approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Blessed One: \"Does Master Gotama too claim, ‘I have awakened to the unsurpassed perfect enlightenment’?\"[n.99] King Pasenadi was to become one of the Buddha’s most devoted lay followers, though the texts never say that he attained any of the stages of sanctity. This sutta, it seems, records his first personal encounter with the Buddha. His cordial (as distinct from reverential) manner of greeting the Blessed One indicates that he has not yet acknowledged the Buddha as his master.",
    "sn3.1:2": "\"Master Gotama, even those ascetics and brahmins who are the heads of orders and companies, the teachers of companies, well known and famous founders of sects considered by the multitude to be holy men—that is, Pūraṇa Kassapa, Makkhali Gosāla, Nigaṇṭha Nataputta, Sañjaya Belaṭṭhiputta, Pakudha Kaccāyana, Ajita Kesakambalī—even these, when I asked them whether they had awakened to the unsurpassed perfect enlightenment, did not claim to have done so.[n.00] These are the six sectarian teachers(cha sattharo)or \"ford makers\"(titthakara), of whom four are mentioned inSN.30. Of the two not mentioned above, Sañjaya Belaṭṭhiputta was a sceptic (DN I 58,3–59,7) and Ajita Kesakambalī a materialist (DN I 55,15–56,31).So why then should Master Gotama (make such a claim) when he is so young in years and has newly gone forth?\"sn.i.69",
    "sn3.1:3": "\"There are four things, great king, that should not be despised and disparaged as ‘young.’[n.201]Spk:Na uññatabba = na avajanitabba; na paribhotabba = na paribhavitabba.Spk distinguishes between \"to despise\" and \"to disparage\" with respect to each of the four things mentioned by the Buddha. For example: One despises a young prince if, when one meets him, one does not yield way or remove one's cloak or rise up from one's seat, etc. One disparages him if one says such things as, \"This prince has a big neck (Se: big ears) and a big belly. How will he be able to exercise rulership?\"What four? A khattiya, great king, should not be despised and disparaged as ‘young’; a snake should not be despised and disparaged as ‘young’; a fire should not be despised and disparaged as ‘young’; and a bhikkhu should not be despised and disparaged as ‘young.’ These are the four.\"",
    "sn3.1:4": "This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this:",
    "sn3.1:5": "v.374\"One should not despise as ‘young’A khattiya of noble birth,A high-born prince of glorious fame:A man should not disparage him.",
    "sn3.1:6": "v.375For it may happen that this lord of men,This khattiya, shall gain the throne,And in his anger thrash one harshlyWith a royal punishment.Therefore guarding one's own life,One should avoid him.",
    "sn3.1:7": "v.36\"One should not despise as ‘young’A serpent one may see by chanceIn the village or a forest:A man should not disparage it.",
    "sn3.1:8": "v.377For as that fierce snake glides along,Manifesting in diverse shapes,[n.202]Uccavacehi vaṇṇehi.This line reflects the belief, widespread in Indian mythology, that serpents can change their appearance at will. AsSpktestifies: \"A serpent glides along in whatever form it finds prey, even in the form of a squirrel.\" See Vin I 6–7, where a nāga serpent assumes the form of a young man in order to receive ordination as a monk.It may attack and bite the fool,Whether a man or a woman.Therefore guarding one's own life,One should avoid it.",
    "sn3.1:9": "v.378\"One should not despise as ‘young’A blazing fire that devours much,A conflagration with blackened trail:A man should not disparage it.",
    "sn3.1:10": "v.379For if it gains a stock of fuel,Having become a conflagration,It may attack and burn the fool,Whether a man or a woman.Therefore guarding one's own life,One should avoid it.",
    "sn3.1:11": "v.380\"When a fire burns down a forest—That conflagration with blackened trail—The shoots there spring to life once moreAs the days and nights pass by.",
    "sn3.1:12": "v.381But if a bhikkhu of perfect virtueBurns one withhis virtue'sfire,One does not gain sons and cattle,Nor do one's heirs acquire wealth.Childless and heirless they become,Like stumps of palmyra trees.[n.203] The grim consequences of despising and disparaging a virtuous bhikkhu do not come to pass because he harbours vindictive intentions, but as natural fruits of the offensive deeds.Spkexplains that a bhikkhu who retaliates when provoked is incapable of harming anyone with \"(his virtue's) fire\"(tejasa); the transgressor is burned only when the bhikkhu bears up patiently. In this respect the bhikkhu contrasts with the archetypal Indian figure of the maligned holy man who deliberately inflicts a curse on his enemies (see belowSN11.10).sn.i.70",
    "sn3.1:13": "v.382\"Therefore a person who is wise,Out of regard for his own good,Should always treat these properly:A fierce serpent and a blazing fire,A famous khattiya,And a bhikkhu of perfect virtue.\"",
    "sn3.1:14": "When this was said, King Pasenadi of Kosala said to the Blessed One: \"Magnificent, venerable sir! Magnificent, venerable sir! The Dhamma has been made clear in many ways by the Blessed One, as though he were turning upright what had been turned upside down, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go for refuge to the Blessed One, and to the Dhamma, and to the Bhikkhu Saṅgha. From today let the Blessed One remember me as a lay follower who has gone for refuge for life.\""
}