{
    "sn3.7:1": "At Sāvatthī. Sitting to one side, King Pasenadi of Kosala said to the Blessed One: \"Here, venerable sir, when I am sitting in the judgement hall,[n.20] Be:aṭṭākārāṇa;Se and Ee & 2:atthakaraṇa.See CPD, s.v.aṭṭa,for hypotheses concerning the derivation.Spk-pṭ explainsaṭṭākārāṇaasvinicchayaṭṭhana,a place for making judgements (regarding litigation).I see even affluent khattiyas, affluent brahmins, and affluent householders—rich, with great wealth and property, with abundant gold and silver, abundant treasures and commodities, abundant wealth and grain—speaking deliberate lies for the sake of sensual pleasures, with sensual pleasures as the cause, on account of sensual pleasures. Then, venerable sir, it occurs to me: ‘I’ve had enough now with the judgement hall! Now it is Good Face who will be known by his judgements.’\"[n.2] Spk: One day, when the king was sitting in the judgement hall, he saw his ministers accepting bribes and deciding cases in favour of their benefactors. He thought, \"When they do such things right in front of me, the sovereign, what won’t they do behind my back? Now it is General Viḍūḍabha who will be known through his own reign. Why should I sit in the same place with these bribe-eating liars?\" The exact purport of this last sentence is obscure, and neither Spk nor Spk-pṭ sheds much light on it .Bhadramukha,\"Good Face,\" is a term of affection (seeMN II 53,27,20,foll.; Ja II 26,4; Vism 92,2), which according to Spk and Spk-pṭ here refers to Viḍūḍabha, the king's son and commander-in-chief. However, the prologue to Ja No. 465 (Ja IV 48–50) relates that King Pasenadi's earlier commander-in-chief was a warrior named Bandhula, who assumed the role of judge when he learned that the official judges had become corrupt. Thus, despite the gloss, it is possible the king here uses the term with reference to Bandhula rather than his son.",
    "sn3.7:2": "\"So it is, great king! So it is, great king! Even affluent khattiyas, affluent brahmins, and affluent householders … speak deliberate lies for the sake of sensual pleasures, with sensual pleasures as the cause, on account of sensual pleasures. That will lead to their harm and suffering for a long time to come.",
    "sn3.7:3": "v.91\"Enamoured with their pleasures and wealth,Greedy, dazed by sensual pleasures,They do not realize they have gone too farLike fish that enter the net spread out.Afterwards the bitter fruit is theirs,For bad indeed is the result.\"sn.i.75"
}