{
    "sn3.24:1": "At Sāvatthī. Sitting to one side, King Pasenadi of Kosala said to the Blessed One:",
    "sn3.24:2": "\"What do you think, great king? Suppose you are at war and a battle is about to take place. Then a khattiya youth would arrive, one who is trained, skilful, practised, experienced, brave, courageous, bold, ready to stand his place. Would you employ that man, and would you have any use for such a man?\"",
    "sn3.24:3": "\"So too, great king, when a person has gone forth from the household life into homelessness, no matter from what clan, if he has abandoned five factors and possesses five factors, then what is given to him is of great fruit. What five factors have been abandoned? Sensual desire has been abandoned; ill will has been abandoned; sloth and torpor have been abandoned; restlessness and remorse have been abandoned; doubt has been abandoned. What five factors does he possess? He possesses the aggregate of virtue of one beyond training, the aggregate of concentration of one beyond training, the aggregate of wisdom of one beyond training,sn.i.100the aggregate of liberation of one beyond training, the aggregate of the knowledge and vision of liberation of one beyond training. He possesses these five factors. Thus what is given to one who has abandoned five factors and who possesses five factors is of great fruit.[n.255] The five factors abandoned are the five hindrances(pañca nivaraṇa); the five factors possessed are the five aggregates of one beyond training(pañca asekhakkhandha), the asekha being the arahant.",
    "sn3.24:4": "v.3\"As a king intent on waging warWould employ a youth skilled with the bow,One endowed with strength and vigour,But not the coward on account of his birth",
    "sn3.24:5": "v.43So even though he be of low birth,One should honour the person of noble conduct,The sagely man in whom are establishedThe virtues of patience and gentleness.[n.26]Spkequates patience(khanti)with forbearance(adhivasana)and gentleness(soracca)with arahantship [Spk-pṭ: because only the arahant is exclusively gentle(sorata)]. Dhs §1342 defines soracca as nontransgression by body, speech, and mind, and as complete restraint by virtue; but see n.462.",
    "sn3.24:6": "v.43\"One should build delightful hermitagesAnd invite the learned to dwell in them;One should build water tanks in the forestAnd causeways over rough terrain.",
    "sn3.24:7": "v.43\"With a confident heart one should giveTo those of upright character:Give food and drink and things to eat,Clothing to wear and beds and seats.",
    "sn3.24:8": "v.43\"For as the rain-cloud, thundering,Wreathed in lightning, with a hundred crests,Pours down its rain upon the earth,Flooding both the plain and valley",
    "sn3.24:9": "v.43So the wise man, faithful, learned,Having had a meal prepared,Satisfies with food and drinkThe mendicants who live on alms.Rejoicing, he distributes gifts,And proclaims, ‘Give, give.’",
    "sn3.24:10": "v.440\"For that is his thunderingLike the sky when it rains.That shower of merit, so vast,Will pour down on the giver.\""
}