{
    "sn3.17:1": "At Sāvatthī. Sitting to one side, King Pasenadi of Kosala said to the Blessed One: \"Is there, venerable sir, one thing which secures both kinds of good, the good pertaining to the present life and that pertaining to the future life?\"",
    "sn3.17:2": "\"There is one thing, great king, which secures both kinds of good, the good pertaining to the present life and that pertaining to the future life.\"",
    "sn3.17:3": "\"But what, venerable sir, is that one thing?\"",
    "sn3.17:4": "\"Diligence, great king. Just as the footprints of all living beings that walk fit into the footprint of the elephant, and the elephant's footprint is declared to be their chief by reason of its size, so diligence is the one thing which secures both kinds of good,sn.i.87the good pertaining to the present life and that pertaining to the future life.[n.21]Spkexplainsappamadaaskarapaka-appamada,\"activating diligence,\" which Spk-pṭ says is diligence that motivates one to engage in the three bases of meritorious deeds (giving, virtue, and meditation). Spk: Diligence, though mundane, is still the chief even among the exalted and supramundane states (i.e., the jhānas, paths, and fruits) because it is the cause for their attainment.",
    "sn3.17:5": "v.410\"For one who desires long life and health,Beauty, heaven, and noble birth,A variety oflofty delightsFollowing in succession,",
    "sn3.17:6": "v.411The wise praise diligenceIn doing deeds of merit.\"The wise person who is diligentSecures both kinds of good:",
    "sn3.17:7": "v.412The good visible in this very lifeAnd the good of the future life.The steadfast one, by attaining the good,Is called a person of wisdom.\"[n.242] in pāda e,atthabhisamayais glossed bySpkwithatthapaṭilabha.The couplet is often quoted by the commentaries, when commenting on theekaṁ samayaṁformula, to illustratesamayaas meaningpaṭilabha.I have tried to avoid the tautology of translatingdhiro paṇḍito ti vuccati\"the wise one is called a person of wisdom\" by renderingdhirawith its homonym, \"steadfast\"; see n.2."
}