{
    "sn3.14:1": "At Sāvatthī. Then King Ajatasattu of Magadha, the Videhan son, mobilized a four-division army and marched in the direction of Kasi against King Pasenadi of Kosala.[n.233] Ajatasattu was Pasenadi's nephew, son of his sister and King Bimbisāra, ruler of Magadha. While still a prince Ajatasattu was incited by Devadatta to usurp the throne and have his father executed; soon afterwards his mother died of grief. War broke out when Pasenadi and Ajatasattu both laid claim to the prosperous village of Kasī, situated between the two kingdoms, which Pasenadi's father, King Mahakosala, had given to his daughter when she married Bimbisāra (see prologue to Ja No. 239). The four divisions of the army are elephant troops, cavalry, chariot troops, and infantry, enumerated in the next sutta.Spkexplains the epithetVedehiputta:\"Vedehimeans wise; he was so called because he was the son of a wise woman.\" This is almost certainly a fabrication. Videha was a country in north India, and the epithet suggests his ancestry was from that land. Since Ajatasattu's mother was from Kosala, Geiger surmises that it must have been his maternal grandmother who came from Videha (GermTr, p. 3, n. 3). See too II, n.288.King Pasenadi heard this report, mobilized a four-division army, and launched a counter-march in the direction of Kasi against King Ajatasattu.sn.i.83Then King Ajatasattu of Magadha and King Pasenadi of Kosala fought a battle. In that battle King Ajatasattu defeated King Pasenadi, and King Pasenadi, defeated, retreated to his own capital of Sāvatthī.",
    "sn3.14:2–3": "Then, in the morning, a number of bhikkhus dressed and, taking their bowls and robes, entered Sāvatthī for alms. When they had walked for alms in Sāvatthī and had returned from their alms round, after the meal they approached the Blessed One, paid homage to him, sat down to one side, and reported what had happened.The Blessed One said:",
    "sn3.14:4": "\"Bhikkhus, King Ajatasattu of Magadha has evil friends, evil companions, evil comrades. King Pasenadi of Kosala has good friends, good companions, good comrades. Yet for this day, bhikkhus, King Pasenadi, having been defeated, will sleep badly tonight.[n.23]Spksays Ajatasattu has evil friends such as Devadatta, Pasenadi has good friends such as Sāriputta.Papamittaandkalyaṇamittaarebahubbihicompounds meaning respectively \"one with an evil friend\" and \"one with a good friend.\" They do not mean, as C.Rh.D translates at KS 1:112, \"a friend of that which is wicked\" and \"a friend of that which is righteous\"; nor do they mean \"a friend of evil people\" and \"a friend of good people\" (though this is entailed). The rare wordajjatañ(as in Se and Ee1; Be has normalized the difficult reading toajj’ eva) seems to mean \"for today, for this day,\" with the implication that the situation will soon change.",
    "sn3.14:5": "v.404\"Victory breeds enmity,The defeated one sleeps badly.The peaceful one sleeps at ease,Having abandoned victory and defeat.\"[n.23]Spk:Jayaṁ veraṁ pāsavāti ti jinanto veraṁ pāsavāti, veripuggalaṁ labhati;ʺThe victorious one breeds enmity: one conquering breeds enmity, begets an inimical person.\" Spk thus interpretsjayaṁin pāda a as a nominative present participle functioning as subject. At EV II, n. to 26, Norman suggests it might be a ṇamul absolutive, i.e., a rare type of absolutive formed from the-aṁtermination (see too EV I, n. to 22). While at v.407we do findjayaṁas a participle, the word also occurs as a neuter nominative at v.619c, and thus there should be no reason not to interpret it in the same way here. See the discussion in Brough,Gandhari Dharmapada,pp. 238–39, n. to 180."
}