{
    "sn3.25:1": "At Sāvatthī. Then, in the middle of the day, King Pasenadi of Kosala approached the Blessed One. … The Blessed One said to him as he was sitting to one side: \"Now where are you coming from, great king, in the middle of the day?\"",
    "sn3.25:2": "\"What do you think, great king?sn.i.101Here, a man would come to you from the east, one who is trustworthy and reliable; having approached, he would tell you: ‘For sure, great king, you should know this: I am coming from the east, and there I saw a great mountain high as the clouds coming this way, crushing all living beings. Do whatever you think should be done, great king.’ Then a second man would come to you from the west … Then a third man would come to you from the north … … Then a fourth man would come to you from the south, one who is trustworthy and reliable; having approached, he would tell you: ‘For sure, great king, you should know this: I am coming from the south, and there I saw a great mountain high as the clouds coming this way, crushing all living beings. Do whatever you think should be done, great king.’ If, great king, such a great peril should arise, such a terrible destruction of human life, the human state being so difficult to obtain, what should be done?\"",
    "sn3.25:3": "\"If, venerable sir, such a great peril should arise, such a terrible destruction of human life, the human state being so difficult to obtain, what else should be done but to live by the Dhamma, to live righteously, and to do wholesome and meritorious deeds?\"[n.258]Spkexplainsdhammacariyaas the ten wholesome courses of kamma and says thatsamacariya,righteous conduct, means the same.",
    "sn3.25:4": "\"I inform you, great king, I announce to you, great king: aging and death are rolling in on you. When aging and death are rolling in on you, great king, what should be done?\"",
    "sn3.25:5": "\"So it is, great king! So it is, great king! As aging and death are rolling in on you, what else should be done but to live by the Dhamma, to live righteously, and to do wholesome and meritorious deeds?\"",
    "sn3.25:6": "v.441\"Just as mountains of solid rock,Massive, reaching to the sky,Might draw together from all sides,Crushing all in the four quarters—So aging and death comeRolling over living beings",
    "sn3.25:7": "v.442Khattiyas, brahmins, vessas, suddas,Caṇḍalas and scavengers:They spare none along the wayBut come crushing everything.",
    "sn3.25:8": "v.443\"There's no ground there for elephant troops,For chariot troops and infantry.One can’t defeat them by subterfuge,Or buy them off by means of wealth.",
    "sn3.25:9": "v.444\"Therefore a person of wisdom here,Out of regard for his own good,Steadfast, should settle faithIn the Buddha, Dhamma, and Saṅgha.",
    "sn3.25:10": "v.445\"When one conducts oneself by DhammaWith body, speech, and mind,They praise one here in the present life,And after death one rejoices in heaven.\""
}