{
    "sn3.11:1": "On one occasion the Blessed One was dwelling at Sāvatthī in the Eastern Park in the Mansion of Migara's Mother.[n.28] The sutta is also atUd 64–66, but with a different verse attached. The Eastern Park is the monastery built by Visākha, the Buddha’s chief female patron, who was called \"Mother\" by her father-in-law Migara because she skilfully led him to the Dhamma.Now on that occasion, in the evening, the Blessed One had emerged from seclusion and was sitting by the outer gateway. Then King Pasenadi of Kosala approached the Blessed One, paid homage to him, and sat down to one side.sn.i.78",
    "sn3.11:2": "Now on that occasion seven jaṭilas, seven nigaṇṭhas, seven naked ascetics, seven one-robed ascetics, and seven wanderers—with hairy armpits, long fingernails and long body hairs, carrying their bundles of requisites—passed by not far from the Blessed One.[n.19] The jaṭilas were matted hair ascetics; the nigaṇṭhas, the Jains, followers of Nataputta.Then King Pasenadi of Kosala rose from his seat, arranged his upper robe over one shoulder, knelt down with his right knee on the ground, and, raising his joined hands in reverential salutation towards the seven jaṭilas, seven nigaṇṭhas, seven naked ascetics, seven one-robed ascetics, and seven wanderers, he announced his name three times: \"I am the king, venerable sirs, Pasenadi of Kosala! … I am the king, venerable sirs, Pasenadi of Kosala!\"",
    "sn3.11:3": "Then, not long after those seven jaṭilas … … and seven wanderers had departed, King Pasenadi of Kosala approached the Blessed One, paid homage to him, sat down to one side, and said to the Blessed One: \"Those, venerable sir, are to be included among the men in the world who are arahants or who have entered upon the path to arahantship.\"[n.220] All eds. of SN read this sentence as a declarative(ye te bhante loke arahanto), butUd 65,22–2 (Ee) reads it as an interrogative(ye nu keci kho bhante loke arahanto).",
    "sn3.11:4": "\"Great king, being a layman who enjoys sensual pleasures, dwelling in a home crowded with children, enjoying the use of Kasian sandalwood, wearing garlands, scents, and unguents, receiving gold and silver, it is difficult for you to know: ‘These are arahants or these have entered upon the path to arahantship. ’",
    "sn3.11:5": "\"It is by living together with someone, great king, that his virtue is to be known, and that after a long time, not after a short time; by one who is attentive, not by one who is inattentive; by one who is wise, not by a dullard.",
    "sn3.11:6": "\"It is wonderful, venerable sir! It is amazing, venerable sir! How well this has been stated by the Blessed One: ‘Great king, being a layman … it is difficult for you to know …as above… by one who is wise, not by a dullard.’",
    "sn3.11:7": "\"These, venerable sir, are my spies, undercover agents, coming back after spying out the country.[n.222]Ete bhante mama purisā carā(Se:cārā)ocarakā janapadaṁ ocaritvā agacchanti.Some SS readcorā(= thieves) in place ofcarā,and the same v.l. appears in many eds. of Ud. Uda 333,18–24, commenting on the passage, explains why the king's spies can be considered thieves, which indicates that even Dhammapala had accepted the Ud reading corā.Spk, however, treatsocarakāandcarāas synonyms, glossing both asheṭṭhacarakā,\"undercover agents,\" those who move below the surface (for the purpose of gathering intelligence). Spk-pṭ says: \"The expression ‘undercover agents’—which is what is meant by carā—refers to those who enter amidst (other groups) in order to investigate the secrets of others.\" The expressioncarapurisāoccurs too at Dhp-a I 193,1, Ja II 404,9–18, and Ja VI 469,12, in contexts where it can only mean spies.First information is gathered by them and afterwards I will make them disclose it.[n.223] Be and Ee1 & 2 readosāpayissāmi,Seoyāyissāmi.Texts of Ud and Ud-a record still more vv.ll., even up to nine; see Masefield,The Udana Commentary,2:918, n. 195.NeitherSpknor Spk-pṭ offers any help. Ud-a 333,25 glossespaṭipajjissāmi karissāmi,\"I will enter upon it, I will act,\" which seems a learned way of admitting uncertainty. If we accept Norman's reasonable suggestion (at EV I, n. to 119) that we should recognize in Pali a verboseti,\"to deposit\" (< Skt*avaśrayati),osāpetican then be understood as the causative form of this verb (< Skt*avaśrayati,as pointed out by Norman in the same note). Here it is the first person future used metaphorically to mean \"I will make them deposit the information with me.\" See too n.542and n.65. Its absolutive,osāpetvā,occurs at Spk III 92,2, meaning \"having put away.\"Now, venerable sir, when they have washed off the dust and dirt and are freshly bathed and groomed, with their hair and beards trimmed, clad in white garments, they will enjoy themselves supplied and endowed with the five cords of sensual pleasure.\"",
    "sn3.11:8": "Then the Blessed One, having understood the meaning of this, on that occasion recited these verses:",
    "sn3.11:9": "v.3\"A man is not easily known by outward formNor should one trust a quick appraisal,For in the guise of the well controlledUncontrolled men move in this world.",
    "sn3.11:10": "v.400\"Like a counterfeit earring made of clay,Like a bronze half-pence coated with gold,Some move about in disguise:Inwardly impure, outwardly beautiful.\""
}