{
    "sn3.9:1": "At Sāvatthī. Now on that occasion a great sacrifice had been set up for King Pasenadi of Kosala. Five hundred bulls, five hundred bullocks, five hundred heifers,sn.i.76five hundred goats, and five hundred rams had been led to the pillar for the sacrifice. And his slaves, servants, and workers, spurred on by punishment and fear, were busy making the preparations, wailing with tearful faces.[n.23]Spkrelates the background story, also found (in greater detail) at Dhp-a II –2; see BL 2:00–7 and Ja No. 34. In brief: The king had become infatuated with a married woman and planned to have her husband killed so that he could take his wife. One night, unable to sleep, he heard eerie cries of inexplicable origin. The next day, when he anxiously asked his brahmin chaplain to explain the meaning, the priest told him that the voices portended his imminent death, which he could avert only by performing a great sacrifice. When the king later inquired from the Buddha about the voices, the Buddha told him these were the cries of adulterers boiling in a cauldron in the great hell.",
    "sn3.9:2": "Then, in the morning, a number of bhikkhus dressed and, taking their bowls and robes, entered Sāvatthī for alms. When they had walked for alms in Sāvatthī and had returned from their alms round, after the meal they approached the Blessed One, paid homage to him, sat down to one side, and said: \"Here, venerable sir, a great sacrifice has been set up for King Pasenadi of Kosala. Five hundred bulls … have been led to the pillar for the sacrifice. And his slaves … are busy making preparations, wailing with tearful faces.\"",
    "sn3.9:3": "Then the Blessed One, having understood the meaning of this, on that occasion recited these verses:",
    "sn3.9:4": "v.393\"The horse sacrifice, human sacrifice,Sammapasa, vajapeyya, niraggaḷa:These great sacrifices, fraught with violence,Do not bring great fruit.[n.21] The sacrifices are also referred to atIt 21,12–17, and their origin related atSn 299–305.Spkexplains that in the times of the ancient kings the first four sacrifices were actually the four bases of beneficence(saṅgahavatthu)—giving, pleasant speech, beneficent conduct, and equality of treatment—by means of which the kings conferred benefits on the world. But during the time of King Okkaka the brahmins reinterpreted the bases of beneficence (which they augmented to five) as bloody sacrifices involving slaughter and violence.n pāda c, I includemahayañña,found in Se and Ee2 but absent from Be and Ee1.Spkexplainsmāhārambhaasmahakicca mahakaraṇiya,\"great activities, great duties,\" which Spk-pṭ clarifies:bahupasughatakamma,\"the action of slaughtering many animals.\"",
    "sn3.9:5": "v.394\"The great seers of right conductDo not attend that sacrificeWhere goats, sheep, and cattleOf various kinds are slain.",
    "sn3.9:6": "v.395\"But when sacrifices free from violenceAre always offered by family custom,[n.215]Yajanti anukulaṁ sada.Spk-pṭ explainsanukulaṁaskulanugataṁ,\"what has come down in the family (as family tradition).\" Spk: The regular meal offering that was started by people earlier—this the people give in uninterrupted succession through the generations.Where no goats, sheep, or cattleOf various kinds are slain:The great seers of right conductAttend a sacrifice like this.",
    "sn3.9:7": "v.396\"The wise person should offer this,A sacrifice bringing great fruit.For one who makes such sacrificeIt is indeed better, never worse.Such a sacrifice is truly vastAnd the devatas too are pleased.\""
}