{
    "sn35.96:1": "\"Bhikkhus, I will teach you about one who is subject to decline, about one who is not subject to decline, and about the six mastered bases. Listen to that …",
    "sn35.96:2": "\"Further, bhikkhus, when a bhikkhu has heard a sound with the ear … cognized a mental phenomenon with the mind,sn.iv.77there arise in him evil unwholesome states, memories and intentions connected with the fetters. If the bhikkhu tolerates them and does not abandon them, dispel them, put an end to them, and obliterate them, he should understand this thus: ‘I am declining away from wholesome states. For this has been called decline by the Blessed One.’",
    "sn35.96:3": "\"And how, bhikkhus, is one not subject to decline? Here, bhikkhus, when a bhikkhu has seen a form with the eye, there arise in him evil unwholesome states, memories and intentions connected with the fetters. If the bhikkhu does not tolerate them, but abandons them, dispels them, puts on end to them, and obliterates them, he should understand this thus: ‘I am not declining away from wholesome states. For this has been called nondecline by the Blessed One.’",
    "sn35.96:4": "\"Further, bhikkhus, when a bhikkhu has heard a sound with the ear … cognized a mental phenomenon with the mind, there arise in him evil unwholesome states, memories and intentions connected with the fetters. If the bhikkhu does not tolerate them, but abandons them, dispels them, puts an end to them, and obliterates them, he should understand this thus: ‘I am not declining away from wholesome states. For this has been called nondecline by the Blessed One.’",
    "sn35.96:5": "\"And what, bhikkhus, are the six mastered bases?[n.80]Cha abhibhāyatanāni.Spkglosses withabhibhavitāni āyatanāni.These are altogether different from theaṭṭha abhibhāyatanāni,the eight bases of mastery (mentioned atDN II 110–11,MN II 13–14, etc.).Here, bhikkhus, when a bhikkhu has seen a form with the eye, there do not arise in him evil unwholesome states, nor any memories and intentions connected with the fetters. The bhikkhu should understand this thus: ‘This base has been mastered. For this has been called a mastered base by the Blessed One.’"
}