{
    "sn35.232:1": "On one occasion the Venerable Sāriputta and the Venerable Mahakoṭṭhita were dwelling at Baraṇasī in the Deer Park at Isipatana. Then, in the evening, the Venerable Mahakoṭṭhita emerged from seclusion and approached the Venerable Sāriputta. He exchanged greetings with the Venerable Sāriputta and, when they had concluded their greetings and cordial talk, he sat down to one side and said to him:",
    "sn35.232:2": "\"How is it, friend Sāriputta, is the eye the fetter of forms or are forms the fetter of the eye? Is the ear the fetter of sounds or are sounds the fetter of the ear? …sn.iv.163Is the mind the fetter of mental phenomena or are mental phenomena the fetter of the mind?\"",
    "sn35.232:3": "\"Friend Koṭṭhita, the eye is not the fetter of forms nor are forms the fetter of the eye, but rather the desire and lust that arise there in dependence on both: that is the fetter there. The ear is not the fetter of sounds nor are sounds the fetter of the ear, but rather the desire and lust that arise there in dependence on both: that is the fetter there … . The mind is not the fetter of mental phenomena nor are mental phenomena the fetter of the mind, but rather the desire and lust that arise there in dependence on both: that is the fetter there.",
    "sn35.232:4": "\"Suppose, friend, a black ox and a white ox were yoked together by a single harness or yoke. Would one be speaking rightly if one were to say: ‘The black ox is the fetter of the white ox; the white ox is the fetter of the black ox’?\"",
    "sn35.232:5": "\"So too, friend, the eye is not the fetter of forms … nor are mental phenomena the fetter of the mind, but rather the desire and lust that arise there in dependence on both: that is the fetter there.",
    "sn35.232:6": "\"If, friend, the eye were the fetter of forms or if forms were the fetter of the eye, this living of the holy life could not be discerned for the complete destruction of suffering.[n.18] Because, as long as one has the six sense bases, one would always be fettered to the six sense objects and thus liberation would be impossible.But since the eye is not the fetter of forms nor are forms the fetter of the eyesn.iv.14—but rather the desire and lust that arise there in dependence on both is the fetter there—the living of the holy life is discerned for the complete destruction of suffering.",
    "sn35.232:7–9": "\"If, friend, the ear were the fetter of sounds or if sounds were the fetter of the ear … If the mind were the fetter of mental phenomena or if mental phenomena were the fetter of the mind, this living of the holy life could not be discerned for the complete destruction of suffering. But since the mind is not the fetter of mental phenomena nor are mental phenomena the fetter of the mind—but rather the desire and lust that arise there in dependence on both is the fetter there—the living of the holy life is discerned for the complete destruction of suffering.",
    "sn35.232:10": "There exists in the Blessed One the eye, the Blessed One sees a form with the eye, yet there is no desire and lust in the Blessed One; the Blessed One is well liberated in mind. There exists in the Blessed One the ear, the Blessed One hears a sound with the ear … There exists in the Blessed One the nose, the Blessed One smells an odour with the nose … There exists in the Blessed One the tongue, the Blessed One savours a taste with the tongue … There exists in the Blessed One the body, the Blessed One feels a tactile object with the body … There exists in the Blessed One the mind, the Blessed One cognizessn.iv.165a mental phenomenon with the mind, yet there is no desire and lust in the Blessed One; the Blessed One is well liberated in mind.",
    "sn35.232:11": "\"In this way, friend, it can be understood how the eye is not the fetter of forms nor forms the fetter of the eye, but rather the desire and lust that arise there in dependence on both is the fetter there; how the ear is not the fetter of sounds nor sounds the fetter of the ear … ; how the mind is not the fetter of mental phenomena nor mental phenomena the fetter of the mind, but rather the desire and lust that arise there in dependence on both is the fetter there.\""
}