{
    "sn35.243:1": "On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in Nigrodha's Park. Now on that occasion a new assembly hall had just been built for the Sakyans of Kapilavatthu and it had not yet been inhabited by any ascetic or brahmin or by any human being at all. Then the Sakyans of Kapilavatthu approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "sn35.243:2": "Then, when the Sakyans understood that the Blessed One had consented, they rose from their seats and, after paying homage to the Blessed One, keeping him on their right, they went to the new assembly hall. They covered it thoroughly with mats, prepared seats, put out a large water jug, and hung up an oil lamp. Then they approached the Blessed One and informed him of this, adding: \"Let the Blessed One come at his own convenience.\"",
    "sn35.243:3": "Then, not long after the Sakyans of Kapilavatthu had left, the Blessed One addressed the Venerable Mahāmoggallāna thus: \"The Saṅgha of bhikkhus is free from sloth and torpor, Moggallana. Give a Dhamma talk to the bhikkhus. My back is aching, so I will stretch it.\"[n.19]Spk: During his six years of ascetic practice the Blessed One had experienced great bodily pain. Therefore, in his old age, he suffered from back winds (piṭṭhivāta,rheumatism?). Or else he lay down because he wanted to use the council hall in all four postures, having already used it by way of walking, standing, and sitting.",
    "sn35.243:4": "\"How, friends, is one corrupted? Here, having seen a form with the eye, a bhikkhu is intent upon a pleasing form and repelled by a displeasing form.[n.195] As atSN35.132(IV 119,27–120,11).He dwells without having set up mindfulness of the body, with a limited mind, and he does not understand as it really is that liberation of mind, liberation by wisdom, wherein those evil unwholesome states cease without remainder.sn.iv.185Having heard a sound with the ear … Having cognized a mental phenomenon with the mind, he is intent upon a pleasing mental phenomenon and repelled by a displeasing mental phenomenon. He dwells without having set up mindfulness of the body, with a limited mind, and he does not understand as it really is that liberation of mind, liberation by wisdom, wherein those evil unwholesome states cease without remainder.",
    "sn35.243:5": "\"Suppose, friends, there is a shed made of reeds or of grass, dried up, desiccated, past its prime. If a man approaches it from the east with a blazing grass torch, or from the west, from the north, from the south, from below, or from above, whichever way he approaches it the fire gains access to it, the fire gets a hold on it. So too, friends, when a bhikkhu dwells thus, if Māra approaches him through the eye … through the mind, Māra gains access to him, Māra gets a hold on him.",
    "sn35.243:6": "\"And how, friends, is one uncorrupted? Here, having seen a form with the eye, a bhikkhu is not intent upon a pleasing form and not repelled by a displeasing form. He dwells having set up mindfulness of the body, with a measureless mind, and he understands as it really is that liberation of mind, liberation by wisdom, wherein those evil unwholesome states cease without remainder. Having heard a sound with the ear … Having cognized a mental phenomenon with the mind, he is not intent upon a pleasing mental phenomenon and not repelled by a displeasing mental phenomenon. He dwells having set up mindfulness of the body, with a measureless mind, and he understands as it really is that liberation of mind, liberation by wisdom, wherein those evil unwholesome states cease without remainder.",
    "sn35.243:7": "\"Suppose, friends, there is a peaked house or a hallsn.iv.18built of thickly packed clay and freshly plastered. If a man approaches it from the east with a blazing grass torch, or from the west, from the north, from the south, from below, or from above, whichever way he approaches it the fire fails to gain access to it, the fire fails to get a hold on it. So too, friends, when a bhikkhu dwells thus, if Māra approaches him through the eye … through the mind, Māra fails to gain access to him, Māra fails to get a hold on him.",
    "sn35.243:8": "Then the Blessed One got up and addressed the Venerable Mahāmoggallāna thus: \"Good, good, Moggallana! You have spoken well to the bhikkhus the exposition on the corrupted and the uncorrupted.\"",
    "sn35.243:9": "This is what the Venerable Mahāmoggallāna said.sn.iv.188The Teacher approved. Elated, those bhikkhus delighted in the Venerable Mahāmoggallāna's statement."
}