{
    "sn35.246:1": "\"Bhikkhus, if in any bhikkhu or bhikkhunī desire or lust or hatred or delusion or aversion of mind should arise in regard to forms cognizable by the eye, such a one should rein in the mind from them thus:[n.2] Apart fromSN 5, references to bhikkhunīs are rare in SN, but seeSN35.23above. The five defilements are also atMN III 294–95.Spk: Desire(chanda)is freshly arisen weak craving(taṇhā), lust(rāga)is repeatedly arisen strong craving. Similarly, hatred(dosa)is freshly arisen weak anger(kodha), aversion(paṇigha)is repeatedly arisen strong anger. The five terms incorporate the three unwholesome roots, and when these are included, all the subsidiary defilements are included. The five terms also imply the twelve unwholesome cittas (of the Abhidhamma—see CMA :4–7).‘This path is fearful, dangerous, strewn with thorns, covered by jungle, a deviant path, an evil path, a way beset by scarcity.[n.22]Duhitika.Spkanalyses this word asdu-ihiti-ka,ihitibeing synonymous withiriyana,\"moving, faring\":Ettha ihitı̄ ti iriyanā; dukkhā ihiti etthā ti duhitiko(verbal analysis). Along whatever path there is no food or refreshments such as roots and fruits, the faring there is difficult; one cannot fare on it to reach one's destination. Similarly, one cannot reach success by faring along the path of defilements, thus the path of defilements isduhitika.The correct derivation ofduhitika,apparently lost by the time of the commentators, is fromdu-hita.See the discussion below at n.347, and see too MW, s.v.dur-hita,and its antonym,su-hita.This is a path followed by inferior people; it is not the path followed by superior people. This is not for you.’ In this way the mind should be reined in from these states regarding forms cognizable by the eye. So too regarding sounds cognizable by the ear … regarding mental phenomena cognizable by the mind.",
    "sn35.246:2": "\"Suppose, bhikkhus, that the barley has ripened and the watchman is negligent. If a bull fond of barley enters the barley field, he might indulge himself as much as he likes.sn.iv.196So too, bhikkhus, the uninstructed worldling who does not exercise restraint over the six bases for contact indulges himself as much as he likes in the five cords of sensual pleasure.[n.13] I follow Se and Ee, which do not includepamādaṃ āpajjeyya/āpajjati,found in Be.Spk: Just as the owner of the crops fails to gain the fruits of the harvest when, due to the watchman's negligence, the bull eats the barley, so when the mind is separated from the mindfulness that guards the six sense doors, it enjoys the five cords of sensual pleasure; then, because his wholesome qualities are destroyed, the bhikkhu fails to attain the fruits of asceticism.",
    "sn35.246:3": "\"Suppose, bhikkhus, that the barley has ripened and the watchman is vigilant. If a bull fond of barley enters the barley field, the watchman would catch hold of him firmly by the muzzle. While holding him firmly by the muzzle, he would get a secure grip on the locks between his horns and, keeping him in check there, would give him a sound beating with his staff. After giving him that beating, he would drive the bull away. This might happen a second time and a third time. Thus that bull fond of barley, whether he has gone to the village or the forest, whether he is accustomed to standing or to sitting, remembering the previous beating he got from the staff, would not enter that barley field again.",
    "sn35.246:4": "\"Suppose, bhikkhus, there was a king or a royal minister who had never before heard the sound of a lute. He might hear the sound of a lute and say: ‘Good man, what is making this sound—so tantalizing, so lovely, so intoxicating,sn.iv.197so entrancing, so enthralling?’ They would say to him: ‘Sire, it is a lute that is making this sound—so tantalizing, so lovely, so intoxicating, so entrancing, so enthralling.’ He would reply: ‘Go, man, bring me that lute.’"
}