{
    "sn35.127:1": "On one occasion the Venerable Piṇḍola Bharadvaja was dwelling at Kosambı in Ghosita's Park.[n.6] AtAN.95(AN I 23,25) he is declared the foremost of those who sound a lion's roar(etadaggaṁ sīhanādikīṇaṁ). His declaration of arahantship is atSN48.49; see too Vin II –2.Then King Udena approached the Venerable Piṇḍola Bharadvaja and exchanged greetings with him.[n.7] He was the king of Kosambı; for details of his story, see Dhp-a I 6–227; BL :247–93.Spk: One day the king had gone to his park and was lying down while some of his concubines massaged his feet and others entertained him with music and song. When he dozed off the women left him to take a walk around the park. They saw the Venerable Bharadvaja meditating under a tree and approached him to pay their respects. Meanwhile the king awoke and, seeing his concubines sitting around the ascetic, he became furious and tried to attack the elder with a nest of biting ants. His plan backfired and the ants fell over him and bit him all over. The women reproached him for his rude conduct and he became repentant. On the next occasion when the elder came to the park, the king approached him and asked his questions.When they had concluded their greetings and cordial talk, he sat down to one side and said to him:",
    "sn35.127:2": "\"The mind is wanton, Master Bharadvaja. Sometimes states of lust arise even towards women old enough to be one's mother; sometimes they arise towards women of an age to be one's sister; sometimes they arise towards women young enough to be one's daughter. Is there any other cause and reason why these young bhikkhus … lead the complete and pure holy life all their lives and maintain it continuously?\"",
    "sn35.127:3": "\"Great king, this was said by the Blessed One who knows and sees, the Arahant, the Fully Enlightened One: ‘Come, bhikkhus, review this very body upwards from the soles of the feet, downwards from the tips of the hairs, enclosed in skin, as full of many kinds of impurities:[n.120] This is the meditation subject calledsubhasaññā,perception of foulness e.g., atAN10.60(AN V 109,18–27), orkāyagatāsati,explained in detail at Vism 29–66 (Ppn 8:42–144).\"There are in this body head-hairs, body-hairs, nails, teeth, skin, flesh, sinews, bones, bone-marrow, kidneys, heart, liver, pleura, spleen, lungs, intestines, mesentery, contents of the stomach, excrement, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, snot, fluid of the joints, urine.\"’ This too, great king, is a cause and reason why these young bhikkhus … lead the complete and pure holy life all their lives and maintain it continuously.\"",
    "sn35.127:4": "\"Great king, this was said by the Blessed One who knows and sees, the Arahant, the Fully Enlightened One: ‘Come, bhikkhus, dwell guarding the doors of the sense faculties. Having seen a form with the eye, do not grasp its signs and features. Since, if you leave the eye faculty unguarded, evil unwholesome states of covetousness and displeasure might invade you, practise the way of its restraint, guard the eye faculty, undertake the restraint of the eye faculty. Having heard a sound with the ear… Having smelt an odour with the nose … Having savoured a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, do not grasp its signs and features. Since, if you leave the mind faculty unguarded, evil unwholesome states of covetousness and displeasure might invade you, practise the way of its restraint, guard the mind faculty, undertake the restraint of the mind faculty.’ This too, great king, is a cause and reason why these young bhikkhus … lead the complete and pure holy life all their lives and maintain it continuously.\"",
    "sn35.127:5": "\"It is wonderful, Master Bharadvaja! It is amazing, Master Bharadvaja! How well this has been stated by the Blessed One who knows and sees, the Arahant, the Fully Enlightened One. So this is the cause and reason why these young bhikkhus, lads with black hair, endowed with the blessing of youth, in the prime of life, who have not dallied with sensual pleasures, lead the complete and pure holy life all their lives and maintain it continuously. In my case too, when I enter my harem unguarded in body, speech, and mind, without setting up mindfulness, unrestrained in the sense faculties, on that occasion states of lust assail me forcefully. But when I enter my harem guarded in body, speech, and mind,sn.iv.113with mindfulness set up, restrained in the sense faculties, on that occasion states of lust do not assail me in such a way."
}