{
    "sn35.95:1": "Then the Venerable Mālunkyaputta approached the Blessed One … and said to him:[n.72] Mālunkyaputta appears atMN Nos. 63and64. His verses here are also atTh 794–87. See tooAN II 248–49, where he again requests a teaching in his old age.Spkexplains that in his youth he had been negligent and had dallied with sensual pleasures; now in his old age he wanted to dwell in the forest and practise meditation.\"Venerable sir, it would be good if the Blessed One would teach me the Dhamma in brief, so that, having heard the Dhamma from the Blessed One, I might dwell alone, withdrawn, diligent, ardent, and resolute.\"",
    "sn35.95:2": "\"Here now, Mālunkyaputta, what should I say to the young bhikkhus when a bhikkhu like you—old, aged, burdened with years, advanced in life, come to the last stage—asks me for an exhortation in brief?\"[n.73]Spk: The Blessed One speaks thus both to reproach him and to extol him. He reproaches him for putting off the work of an ascetic until old age, and extols him in order to set an example for the younger monks.",
    "sn35.95:3": "\"Although, venerable sir, I am old, aged, burdened with years, advanced in life, come to the last stage, let the Blessed One teach me the Dhamma in brief, let the Fortunate One teach me the Dhamma in brief. Perhaps I may understand the meaning of the Blessed One's statement, perhaps I may become an heir to the Blessed One's statement.\"",
    "sn35.95:4": "\"What do you think, Mālunkyaputta, do you have any desire, lust, or affection for those forms cognizable by the eye that you have not seen and never saw before, that you do not see and would not think might be seen?\"[n.7]Spkexplainsdiṭṭhā adiṭṭhapubbāas respectively \"not seen in this existence\" and \"never seen before\" in the past. An illustration can be found atSN2.11(IV 329,20–22).",
    "sn35.95:5": "\"Do you have any desire, lust, or affection for those sounds cognizable by the ear … for those odours cognizable by the nose … for those tastes cognizable by the tongue … for those tactile objects cognizable by the body …sn.iv.73for those mental phenomena cognizable by the mind that you have not cognized and never cognized before, that you do not cognize and would not think might be cognized?\"",
    "sn35.95:10": "\"Here, Mālunkyaputta, regarding things seen, heard, sensed, and cognized by you: in the seen there will be merely the seen; in the heard there will be merely the heard; in the sensed there will be merely the sensed; in the cognized there will be merely the cognized.",
    "sn35.95:11": "\"I understand in detail, venerable sir, the meaning of what was stated by the Blessed One in brief:",
    "sn35.95:12": "\"Having seen a form with mindfulness muddled,Attending to the pleasing sign,One experiences it with infatuated mindAnd remains tightly holding to it.",
    "sn35.95:13": "\"Many feelings flourish within,Originating from the visible form,Covetousness and annoyance as wellBy which one's mind becomes disturbed.[n.76] We should read:cittam ass’ ūpahaññati.For one who accumulates suffering thusNibbāna is said to be far away.",
    "sn35.95:14–15": "\"Having heard a sound with mindfulness muddled …sn.iv.74",
    "sn35.95:16–17": "\"Having smelt an odour with mindfulness muddled …",
    "sn35.95:18–19": "\"Having enjoyed a taste with mindfulness muddled …",
    "sn35.95:20–21": "\"Having felt a contact with mindfulness muddled …",
    "sn35.95:22": "\"Having known an object with mindfulness muddled …For one who accumulates suffering thusNibbāna is said to be far away.",
    "sn35.95:24": "\"When, firmly mindful, one sees a form,One is not inflamed by lust for forms;One experiences it with dispassionate mindAnd does not remain holding it tightly.",
    "sn35.95:26–27": "\"When, firmly mindful, one hears a sound,One is not inflamed by lust for sounds; …sn.iv.75",
    "sn35.95:28–29": "\"When, firmly mindful, one smells an odour,One is not inflamed by lust for odours; …",
    "sn35.95:30–31": "\"When, firmly mindful, one enjoys a taste,One is not inflamed by lust for tastes; …",
    "sn35.95:32–33": "\"When, firmly mindful, one feels a contact,One is not inflamed by lust for contacts; …",
    "sn35.95:34–35": "\"When, firmly mindful, one knows an object,One is not inflamed by lust for objects; …For one diminishing suffering thusNibbāna is said to be close by.",
    "sn35.95:36": "\"It is in such a way, venerable sir, that I understand in detail the meaning of what was stated by the Blessed One in brief.\"",
    "sn35.95:41": "\"It is in such a way, Mālunkyaputta, that the meaning of what was stated by me in brief should be understood in detail.\"",
    "sn35.95:42": "Then the Venerable Mālunkyaputta, having delighted and rejoiced in the Blessed One's words, rose from his seat, and, after paying homage to the Blessed One, keeping him on his right, he departed."
}