{
    "sn35.132:1": "On one occasion the Venerable Mahakaccana was dwelling among the people of Avanti in a forest hut at Makkarakaṭa.sn.iv.7Then a number of brahmin youths, students of the brahmin Lohicca, while collecting firewood, approached the Venerable Mahakaccana's forest hut. Having approached, they stomped and trampled all around the hut, and in a boisterous and noisy manner they played various pranks,[n.29] Be:Seleyyakāni karonti;Se:selissakāni karontā;Ee:selissakāni karonti.Spk's explanation suggests the games were like our \"leapfrog,\" i.e., one boy jumping over the back of another.saying: \"These shaveling ascetics, menials, swarthy offspring of the Lord's feet, are honoured, respected, esteemed, worshipped, and venerated by their servile devotees.\"[n.30] The first four terms are a stock brahmanical denigration of ascetics.Bandhupādāpaccāalludes to the brahmin idea that Brahma created ascetics from the soles of his feet (below even the suddas, who were created from his knees, while the brahmins were created from his mouth). Spk glosses bharataka askuṭumbikā,\"landholders,\" though I think it is a derogatory term for the Buddhist lay supporters.",
    "sn35.132:2–3": "\"Those men of old who excelled in virtue,Those brahmins who recalled the ancient rules,Their sense doors guarded, well protected,Dwelt having vanquished wrath within.They took delight in Dhamma and meditation,[n.131]Spk: They took delight in Dhamma, namely, in the ten courses of wholesome action, and in meditation(jhāna), i.e., in the meditations of the eight attainments.Those brahmins who recalled the ancient rules.",
    "sn35.132:4": "\"But these have fallen, claiming ‘We recite.’Puffed up by clan, faring unrighteously,Overcome by anger, armed with diverse weapons,They molest both frail and firm.",
    "sn35.132:5–6": "\"For one with sense doors unguardedAll the vows he undertakesare vainJust like the wealth a man gains in a dream:sn.iv.118Fasting and sleeping on the ground,Bathing at dawn,study ofthe three Vedas,Rough hides, matted locks, and dirt;Hymns, rules and vows, austerities,Hypocrisy, bent staffs, ablutions:These emblems of the brahminsAre used to increase their worldly gains.[n.132]Kata kiñcikkhabhāvanā.The exact meaning is obscure, but I translate in accordance with the gloss ofSpk:āmisakiñcikkhassa vaḍḍhanatthāya katan ti attho,\"done for the sake of an increase in their material possessions.\"",
    "sn35.132:7": "\"A mind that is well concentrated,Clear and free from blemish,Tender towards all sentient beings—That is the path for attaining Brahma.\"",
    "sn35.132:8": "Then those brahmin youths, angry and displeased, approached the brahmin Lohicca and told him: \"See now, sir, you should know that the ascetic Mahakaccana categorically denigrates and scorns the hymns of the brahmins.\"",
    "sn35.132:9": "Then the brahmin Lohicca, together with those brahmin youths, approached the Venerable Mahakaccana.sn.iv.11He exchanged greetings with the Venerable Mahakaccana and, when they had concluded their greetings and cordial talk, he sat down to one side and said to him: \"Master Kaccāna, did a number of brahmin youths, my students, come this way while collecting firewood?\"",
    "sn35.132:10": "\"‘Those men of old who excelled in virtue,Those brahmins who recalled the ancient rules, …Tender towards all sentient beings—That is the path for attaining Brahma.’",
    "sn35.132:11": "Such was the conversation that I had with those youths.\"",
    "sn35.132:12": "\"Master Kaccāna said ‘with sense doors unguarded.’ In what way, Master Kaccāna, is one ‘with sense doors unguarded’?\"",
    "sn35.132:13": "But Master Kaccāna said ‘with sense doors guarded.’ In what way, Master Kaccāna, is one ‘with sense doors guarded’?\"",
    "sn35.132:14": "\"It is wonderful, Master Kaccāna! It is amazing, Master Kaccāna!sn.iv.121How Master Kaccāna has declared one whose sense doors are actually guarded to be one ‘with sense doors guarded’! Magnificent, Master Kaccāna! Magnificent, Master Kaccāna! The Dhamma has been made clear in many ways by Master Kaccāna … (as in §127) … From today let Master Kaccāna remember me as a lay follower who has gone for refuge for life."
}