{
    "sn35.248:1": "\"Bhikkhus, suppose a sheaf of barley were set down at a crossroads. Then six men would come along with flails in their hands[n.220]Byābhaṅgihatthā.Spkglosseskājahatthā,Spk-pṭdaṇḍahatthā.and they would strike that sheaf of barley with the six flails. Thus that sheaf of barley would be well struck, having been struck by the six flails. Then a seventh man would come along with a flail in his hand and he would strike that sheaf of barley with the seventh flail. Thus that sheaf of barley would be struck even still more thoroughly, having been struck by the seventh flail.",
    "sn35.248:2": "\"Once in the past, bhikkhus, the devas and the asuras were arrayed for battle.[n.] On the enmity between the devas and the asuras, see11:1–6. The following is parallel toSN11.4(I 1,3–17).Then Vepacitti, lord of the asuras, addressed the asuras thus: ‘Good sirs, if in this impending battle the asuras win and the devas are defeated, bind Sakka, lord of the devas, by his four limbs and neck and bring him to me in the city of the asuras.’ And Sakka, lord of the devas, addressed the Tāvatiṁsa devas: ‘Good sirs, if in this impending battle the devas win and the asuras are defeated, bind Vepacitti, lord of the asuras, by his four limbs and neck and bring him to me in Sudhamma, the assembly hall of the devas.’",
    "sn35.248:3": "\"Bhikkhus, ‘I am’ is a conceiving; ‘I am this’ is a conceiving; ‘I shall be’ is a conceiving; ‘I shall not be’ is a conceiving; ‘I shall consist of form’ is a conceiving; ‘I shall be formless’ is a conceiving; ‘I shall be percipient’ is a conceiving; ‘I shall be nonpercipient’ is a conceiving; ‘I shall be neither percipient nor nonpercipient’ is a conceiving.[n.224]Maññita.Spk: \"I am\"(asmi)is a conceiving through craving; \"I am this\"(ayam aham asmi), a conceiving through views; \"I shall be,\" a conceiving through the eternalist view; \"I shall not be,\" a conceiving through the annihilationist view. The rest are specific types of eternalism.The connection Spk makes between \"I am\" and craving is unusual, as the notion \"I am\"(asmi)is typically ascribed to conceit; however,SN22.89(III 10,1) has asmī ti chando, and possibly the commentator had this in mind. \"I am this\" is the seminal type of identity view, whereby a person establishes a personal identity by identifying one or another of the five aggregates as a self. The ninefold conceiving is mentioned atSN22.47; see tooMN III 246,11–17.Conceiving is a disease, conceiving is a tumour, conceiving is a dart. Therefore, bhikkhus, you should train yourselves thus: ‘We will dwell with a mind devoid of conceiving.’",
    "sn35.248:4": "\"Bhikkhus, ‘I am’ is a perturbation;[n.225] The key terms of the next three paragraphs areiñjita, phandita,andpapañcita.Spk: \"This is to show that on account of these defilements (craving, etc.), beings are perturbed, vacillate, and procrastinate.\" Papañca is often explained in the commentaries aspamādakarā dhammā,the factors responsible for heedlessness or procrastination.‘I am this’ is a perturbation; ‘I shall be’ is a perturbation … ‘I shall be neither percipient nor nonpercipient’ is a perturbation. Perturbationsn.iv.203is a disease, perturbation is a tumour, perturbation is a dart. Therefore, bhikkhus, you should train yourselves thus: ‘We will dwell with an imperturbable mind.’",
    "sn35.248:5": "\"Bhikkhus, ‘I am’ is a palpitation; ‘I am this’ is a palpitation; ‘I shall be’ is a palpitation … ‘I shall be neither percipient nor nonpercipient’ is a palpitation. Palpitation is a disease, palpitation is a tumour, palpitation is a dart. Therefore, bhikkhus, you should train yourselves thus: ‘We will dwell with a mind devoid of palpitation. ’",
    "sn35.248:6": "\"Bhikkhus, ‘I am’ is a proliferation; ‘I am this’ is a proliferation; ‘I shall be’ is a proliferation … ‘I shall be neither percipient nor nonpercipient’ is a proliferation. Proliferation is a disease, proliferation is a tumour, proliferation is a dart. Therefore, bhikkhus, you should train yourselves thus: ‘We will dwell with a mind devoid of proliferation.’",
    "sn35.248:7": "\"Bhikkhus, ‘I am’ is an involvement with conceit;[n.226]Mānagata.Spk: Conceit itself is an involvement with conceit. In this passage, \"I am\" is stated by way of the conceit associated with craving; \"I am this,\" by way of view. Although conceit does not arise in immediate conjunction with views (according to the Abhidhamma analysis of mind-moments, they are mutually exclusive), views occur because conceit has not been abandoned. So this is said with reference to views rooted in conceit.‘I am this’ is an involvement with conceit; ‘I shall be’ is an involvement with conceit; ‘I shall not be’ is an involvement with conceit; ‘I shall consist of form’ is an involvement with conceit; ‘I shall be formless’ is an involvement with conceit ; ‘I shall be percipient’ is an involvement with conceit; ‘I shall be nonpercipient’ is an involvement with conceit; ‘I shall be neither percipient nor nonpercipient’ is an involvement with conceit. Involvement with conceit is a disease, involvement with conceit is a tumour, involvement with conceit is a dart. Therefore, bhikkhus, you should train yourselves thus: ‘We will dwell with a mind in which conceit has been struck down.’ Thus should you train yourselves.\""
}