{
    "sn35.1:1": "[n.] 35.–22 are composed in accordance with templates met with earlier. In this saṁyutta, each template is instantiated twice, first with the internal bases, then with the external ones.Thus have I heard.[n.2] The \"internal\"(ajjhattika = adhi + atta + ika)exclusively denotes the six sense faculties, and is contrasted with \"external\"(bāhira), which exclusively denotes the six sense objects (though according to the Abhidhamma,dhammāyatanadenotes the objects of manoviññāṇa and the mental concomitants of allviññāṇa). Despite the similarity, the dyadajjhattika–bāhirais not synonymous with the dyadajjhatta–bahiddhā;the latter marks the distinction between what pertains to oneself and what is external to oneself. The sense faculties of other beings are ajjhattika but bahiddhā, while one's own pigmentation, voice, scent, etc., are ajjhatta but bahira.On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn35.1:2": "\"Bhikkhus, the eye is impermanent.[n.]Spkdistinguishes the different types of \"eyes\" referred to in the canon. These are first divided into two general classes: the eye of knowledge(ñāṇacakkhu)and the physical eye(maṁsacakkhu). The former is fivefold: (i) the Buddha eye(buddhacakkhu), the knowledge of the inclinations and underlying tendencies of beings, and the knowledge of the degree of maturity of their spiritual faculties; (ii) the Dhamma eye(dhammacakkhu), the knowledge of the three lower paths and fruits; (iii) the universal eye(samantacakkhu), the Buddha’s knowledge of omniscience; (iv) the divine eye(dibbacakkhu), the knowledge arisen by suffusion of light (which sees the passing away and rebirth of beings); and (v) the wisdom eye(paññācakkhu), the discernment of the Four Noble Truths. The physical eye is twofold: (i) the composite eye(sasambhāracakkhu), the physical eyeball; and (ii) the sensitive eye(pasadacakkhu), i.e., the sensitive substance in the visual apparatus that responds to forms(perhaps the retina and optic nerve). Here the Blessed One speaks of the sensitive eye as the \"eye base.\" The ear, etc., should be similarly understood. Mind(mano)is the mind of the three planes, which is the domain of exploration with insight(tebhāmakasammasanacaracitta).For the commentarial treatment of the sense bases, see Vism 444–46 (Ppn 14:36–53). Hamilton challenges the commentarial classification of the first five sense bases under therūpakkhandha,arguing from the fact that the standard definition of the form aggregate in the suttas does not include them. In her view, the sense faculties are powers of perception partaking of both material and mental characteristics and thus unclassifiable exclusively underrūpa(Identity and Experience,pp. 14–). By the same logic, however, it might be argued that the five external sense bases should not be assigned to therūpakkhandha, for again the suttas do not place them there. The plain fact is that the correlations between the khandhas, āyatanas, anddhātusare not made explicit in the Nikāyas at all, but only in the Abhidhamma Piṭaka, which classifies both the first five internal and external sense bases underrūpa.The five faculties and four sense objects (excluding the tactile object) are categorized as \"derivative form\"(upādā rūpa), i.e., form derived from the four primary elements; the tactile object is classified under three of the primary elements: earth (hardness or softness), heat (hotness or coolness), and air (pressure and motion). The suttas themselves do not enumerate the types of derivative form, and the Abhidhamma texts seem to be filling in this lacuna.What is impermanent is suffering. What is suffering is nonself. What is nonself should be seen as it really is with correct wisdom thus: ‘This is not mine, this I am not, this is not my self.’"
}