{
    "sn35.75:6": "\"If, bhikkhu you understand that the Dhamma has not been taught by me for the sake of purification of virtue, then for what purpose do you understand the Dhamma to have been taught by me?\"",
    "sn35.75:7": "\"Venerable sir, I understand the Dhamma to have been taught by the Blessed One for the sake of final Nibbāna without clinging.\"",
    "sn35.75:8": "\"Good, good, bhikkhu! It is good that you understand the Dhamma to have been taught by me for the sake of final Nibbāna without clinging. For the Dhamma is taught by me for the sake of final Nibbāna without clinging.[n.41]Anupādāparinibbānatthaṃ.Here there is a double entendre, for the Pali upādāor upādānameans both clinging and fuel, so the goal of the Dhamma can also be understood as \"the quenchingof a firethrough lack of fuel.\" The fire, of course, is the threefold fire of lust, hatred, and delusion (seeSN35.2). Ee omits the next paragraph on the assumption that it is identical with the corresponding section of the preceding sutta, and Woodward follows suit at KS 4:25. This is not the case, however, in Be and Se. The preceding sutta mentions only the six internal bases, but this one enumerates all the phenomena that originate through each sense base. \nThis may explainat least in partwhy the bhikkhu here attained arahantship, while the bhikkhu in the preceding sutta gained only the vision of the Dhamma.",
    "sn35.75:9": "\"What do you think, bhikkhu, is the eye permanent or impermanent?\" - \"Impermanent, venerable sir.\" … \"Is the ear … the nose … the tongue … the body … the mind … mind-consciousness … mind-contact … whatever feeling arises with mind-contact as condition—whether pleasant or painful or neither-painful-nor-pleasant—permanent or impermanent?\" - \"Impermanent, venerable sir.\" - \"Is what is impermanent suffering or happiness?\" - \"Suffering, venerable sir.\" - \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" - \"No, venerable sir.\"",
    "sn35.75:17": "\"Seeing thus … He understands: ‘ … there is no more for this state of being.’\"",
    "sn35.75:18": "This is what the Blessed One said. Elated, that bhikkhu delighted in the Blessed One's statement. And while this discourse was being spoken, that bhikkhu's mind was liberated from the taints by nonclinging."
}