{
    "sn35.117:1": "\"Bhikkhus, before my enlightenment, while I was still a bodhisatta, not yet fully enlightened, the thought occurred to me: ‘My mind may often stray towards those five cords of sensual pleasure that have already left their impression on the heart[n.00]Cetaso samphuṭṭhapubbā,glossed bySpkwithcittena anubhūtapubbā,\"experienced before by the mind.\"Spk: My mind may often stray(tatra me cittaṁ bahulaṁ gaccheyya): He shows, \"On many occasions it would move towards the five cords of sensual pleasure previously experienced when I was enjoying prosperity in the three palaces with their three kinds of dancing girls, etc.\" Or towards those that are present(paccuppannesu vā): He shows, \"During my years of striving it would often arise having taken, as cords of sensual pleasure, such beautiful sense objects as the flowering groves and flocks of birds, etc.\" Or slightly towards those in the future(appāṇa vā anāgatesu):He shows, \"It might arise even slightly towards the future, when he thinks, ‘Metteyya will be the Buddha, Sankha the king, Ketumati the capital.’\" ApparentlySpkcannot conceive of beautiful future sense objects apart from a future Buddha.but which have passed, ceased, and changed, or towards those that are present, or slightly towards those in the future.’ Then it occurred to me: ‘Being set on my own welfare,[n.0]Attarūpena.Spk:Attano hitakāmajātikena,\"by one who desires his own welfare.\" The expression also occurs atAN II 20,7foll. Spk explains that diligence and mindfulness are to be practised for the purpose of guarding the mind in regard to the five cords of sensual pleasures.I should practise diligence, mindfulness, and guarding of the mind in regard to those five cords of sensual pleasure that have already left their impression on the heart, which have passed, ceased, and changed.’",
    "sn35.117:2–7": "Having said this, the Blessed One rose from his seat and entered his dwelling. Then, soon after the Blessed One had left, the bhikkhus considered …all as in preceding sutta down to:… The Venerable Ānanda said this:",
    "sn35.117:8": "\"Friends, when the Blessed One rose from his seat and entered his dwelling after reciting a synopsis in brief without expounding the meaning in detail—that is: ‘Therefore, bhikkhus, that base should be understood, where the eye ceases and perception of forms fades away … . That base should be understood, where the mind ceases and perception of mental phenomena fades away. That base should be understood’—I understand the detailed meaning of this synopsis as follows: This was stated by the Blessed One, friends, with reference to the cessation of the six sense bases.[n.104]Saḷāyatananirodhaṃ … sandhāya bhāsitaṃ.Spk: \"It is Nibbāna that is called the cessation of the six sense bases, for in Nibbāna the eye, etc., cease and perceptions of forms, etc., fade away.\" We might note that Ānanda's answer, though called an account of the \"detailed meaning,\" is actually shorter than the Buddha’s original statement.",
    "sn35.117:9": "\"Yes, friends,\" those bhikkhus replied, and having risen from their seats, they went to the Blessed One. After paying homage to him, they sat down to one side and told the Blessed One all that had taken place after he had left, adding:",
    "sn35.117:10": "sn.iv.1\"Then, venerable sir, we approached the Venerable Ānanda and asked him about the meaning. The Venerable Ānanda expounded the meaning to us in these ways, with these terms, with these phrases.\"",
    "sn35.117:11": "\"Ānanda is wise, bhikkhus, Ānanda has great wisdom. If you had asked me the meaning of this, I would have explained it to you in the same way that it has been explained by Ānanda. Such is the meaning of this, and so you should remember it.\""
}