{
    "sn35.241:1": "On one occasion the Blessed One was dwelling at Kosambı on the bank of the river Ganges. The Blessed One saw a great log being carried along by the current of the river Ganges, and he addressed the bhikkhus thus: \"Do you see, bhikkhus, that great log being carried along by the current of the river Ganges?\"",
    "sn35.241:2": "\"So too, bhikkhus, if you do not veer towards the near shore, do not veer towards the far shore, do not sink in mid-stream, do not get cast up on high ground, do not get caught by human beings, do not get caught by nonhuman beings, do not get caught in a whirlpool, and do not become inwardly rotten,sn.iv.180you will slant, slope, and incline towards Nibbāna. For what reason? Because right view slants, slopes, and inclines towards Nibbāna.\"",
    "sn35.241:3": "\"‘The near shore,’ bhikkhu: this is a designation for the six internal sense bases. ‘The far shore’: this is a designation for the six external sense bases. ‘Sinking in mid-stream’: this is a designation for delight and lust. ‘Getting cast up on high ground’: this is a designation for the conceit ‘I am.’",
    "sn35.241:4": "\"And what, bhikkhu, is getting caught by human beings? Here, someone lives in association with laypeople; he rejoices with them and sorrows with them, he is happy when they are happy and sad when they are sad, and he involves himself in their affairs and duties.[n.187] Also atSN22.3(III 11,5–7).This is called getting caught by human beings.",
    "sn35.241:5": "\"And what, bhikkhu, is getting caught by nonhuman beings? Here, someone lives the holy life with the aspirationto be reborninto a certain order of devas, thinking: ‘By this virtue or vow or austerity or holy life I will become a deva or one among the devas.’ This is called getting caught by nonhuman beings.",
    "sn35.241:6": "\"And what, bhikkhu, is inward rottenness? Here someone is immoral, one of evil character, of impure and suspect behaviour, secretive in his acts, no ascetic though claiming to be one,sn.iv.181not a celibate though claiming to be one, inwardly rotten, corrupt, depraved.[n.188] Also atAN II 239,29–240,1,IV 128,23–2,201,20–23;Ud 52,13–1, 55,10–13. Onsaṅkassarasamācāro,\"of suspect behaviour,\"Spksays: \"His conduct is to be recalled with suspicion(sȧkāya saritabbasamācāro)by others thus, ‘It seems he did this and that’; or else he recalls the conduct of others with suspicion(saṅkāya paresaṁ samācāraṁ sarati), thinking, when he sees a few people talking among themselves, ‘They must be discussing my faults.’\" Spk glosseskasambujātothus:rāgādı̄hi kilesehi kacavarajāto,\"rubbish-like because of such defilements as lust, etc.\"This is called inward rottenness.\"",
    "sn35.241:7": "Now on that occasion the cowherd Nanda was standing near the Blessed One. He then said to the Blessed One: \"Venerable sir, I will not veer[n.189] I understand upagacchāmi here to be a true future form, in conformity with the futures that follow.towards the near shore, I will not veer towards the far shore, I will not sink in mid-stream, I will not get cast up on high ground, I will not get caught by human beings, I will not get caught by nonhuman beings, I will not get caught in a whirlpool, I will not become inwardly rotten. May I receive the going forth under the Blessed One, may I receive the higher ordination?\""
}