{
    "sn35.239:1": "\"Bhikkhus, by possessing three qualities, a bhikkhu lives full of happiness and joy in this very life, and he has laid a foundation[n.83]Yoni c’ assa āraddhā hoti.Spk:Kāraṇañ c’ assa paripuṇṇaṃ hoti;\"and the cause for it is complete.\" See III, n.54. Cp.AN I 3–4. The simile of the charioteer is also atMN III 97,6–0.for the destruction of the taints. What are the three? He is one who guards the doors of the sense faculties, who is moderate in eating, and who is devoted to wakefulness.sn.iv.76",
    "sn35.239:2": "\"And how, bhikkhus, is a bhikkhu one who guards the doors of the sense faculties? Here, having seen a form with the eye, a bhikkhu does not grasp its signs and features. Since, if he left the eye faculty unrestrained, evil unwholesome states of covetousness and displeasure might invade him, he practises the way of its restraint, he guards the eye faculty, he undertakes the restraint of the eye faculty. Having heard a sound with the ear … Having smelt an odour with the nose … Having tasted a taste with the tongue … Having felt a tactile object with the body … Having cognized a mental phenomenon with the mind, a bhikkhu does not grasp its signs and its features. Since, if he left the mind faculty unrestrained, evil unwholesome states of covetousness and displeasure might invade him, he practises the way of its restraint, he guards the mind faculty, he undertakes the restraint of the mind faculty.",
    "sn35.239:3": "\"And how, bhikkhus, is a bhikkhu moderate in eating? Here, reflecting wisely, a bhikkhu takes food neither for amusement nor for intoxication nor for the sake of physical beauty and attractiveness, but only for the support and maintenance of this body, for ending discomfort, and for assisting the holy life, considering: ‘Thus I shall terminate the old feeling and not arouse a new feeling, and I shall be healthy and blameless and live in comfort. ’sn.iv.177Just as a person anoints a wound only for the purpose of enabling it to heal, or just as one greases an axle only for the sake of transporting a load, so a bhikkhu, reflecting wisely, takes food … for assisting the holy life. It is in this way, bhikkhus, that a bhikkhu is moderate in eating.",
    "sn35.239:4": "\"And how, bhikkhus, is a bhikkhu devoted to wakefulness? Here, during the day, while walking back and forth and sitting, a bhikkhu purifies his mind of obstructive states. In the first watch of the night, while walking back and forth and sitting, he purifies his mind of obstructive states. In the middle watch of the night he lies down on the right side in the lion's posture with one foot overlapping the other, mindful and clearly comprehending, after noting in his mind the idea of rising. After rising, in the last watch of the night, while walking back and forth and sitting, he purifies his mind of obstructive states. It is in this way, bhikkhus, that a bhikkhu is devoted to wakefulness."
}