{
    "sn35.247:1": "\"Bhikkhus, suppose a man with limbs wounded and festering would enter a wood of thorny reeds,[n.28]Saravanaṁ.Spk(Se) glosses withkaṇṭakavanaṁ.Sara, according to PED, is the reedSaccharum sara,used to make arrows.and the Kusa thorns would prick his feet and the reed blades would slash his limbs. Thus that man would thereby experience even more pain and displeasure. So too, bhikkhus, some bhikkhu here, gone to the village or the forest, meets someone who reproaches him thus: ‘This venerable one, acting in such a way, behaving in such a way, is a foul village thorn.’ Having understood him thus as a ‘thorn,’ one should understand restraint and nonrestraint.[n.29] Here Be and Se both read: …asucigāmakaṇṭako ti. Taṃ kaṇṭako ti iti viditvā saṃvaro ca asaṃvaro ca veditabbo.Ee is the same except for the omission ofiti.See n.200. Spk: He is a foul village thorn: \"foul\" in the sense of impure, a \"village thorn\" in the sense of wounding the villagers (Spk-pṭ: that is, oppressing them by accepting their services while being unworthy of them).",
    "sn35.247:2": "\"And how, bhikkhus is there nonrestraint? Here, having seen a form with the eye, a bhikkhu is intent upon a pleasing form and repelled by a displeasing form. He dwells without having set up mindfulness of the body, with a limited mind, and he does not understand as it really is that liberation of mind, liberation by wisdom, wherein those evil unwholesome states cease without remainder. Having heard a sound with the ear … Having cognized a mental phenomenon with the mind, he is intent upon a pleasing mental phenomenon and repelled by a displeasing mental phenomenon. He dwells without having set up mindfulness of the body, with a limited mind, and he does not understand as it really is that liberation of mind, liberation by wisdom, wherein those evil unwholesome states cease without remainder.",
    "sn35.247:3": "\"Suppose, bhikkhus, a man would catch six animals—with different domains and different feeding grounds—and tie them by a strong rope. He would catch a snake, a crocodile, a bird, a dog,sn.iv.199a jackal, and a monkey, and tie each by a strong rope. Having done so, he would tie the ropes together with a knot in the middle and release them. Then those six animals with different domains and different feeding grounds would each pull in the direction of its own feeding ground and domain. The snake would pull one way, thinking, ‘Let me enter an anthill.’ The crocodile would pull another way, thinking, ‘Let me enter the water.’ The bird would pull another way, thinking, ‘Let me fly up into the sky.’ The dog would pull another way, thinking, ‘Let me enter a village.’ The jackal would pull another way, thinking, ‘Let me enter a charnel ground.’ The monkey would pull another way, thinking, ‘Let me enter a forest.’",
    "sn35.247:4": "\"And how, bhikkhus, is there restraint? Here, having seen a form with the eye, a bhikkhu is not intent upon a pleasing form and not repelled by a displeasing form. He dwells having set up mindfulness of the body, with a measureless mind, and he understands as it really is that liberation of mind, liberation by wisdom, wherein those evil unwholesome states cease without remainder. Having heard a sound with the ear … Having cognized a mental phenomenon with the mind, he is not intent upon a pleasing mental phenomenon and not repelled by a displeasing mental phenomenon.sn.iv.200He dwells having set up mindfulness of the body, with a measureless mind, and he understands as it really is that liberation of mind, liberation by wisdom, wherein those evil unwholesome states cease without remainder. It is in such a way that there is restraint.",
    "sn35.247:5": "\"Suppose, bhikkhus, a man would catch six animals—with different domains and different feeding grounds—and tie them by a strong rope. He would catch a snake, a crocodile, a bird, a dog, a jackal, and a monkey, and tie each by a strong rope. Having done so, he would bind them to a strong post or pillar. Then those six animals with different domains and different feeding grounds would each pull in the direction of its own feeding ground and domain. The snake would pull one way, thinking, ‘Let me enter an anthill’ …as above… The monkey would pull another way, thinking, ‘Let me enter a forest.’",
    "sn35.247:6": "\"‘A strong post or pillar’: this, bhikkhus, is a designation for mindfulness directed to the body. Therefore, bhikkhus, you should train yourselves thus: ‘We will develop and cultivate mindfulness directed to the body, make it our vehicle, make it our basis, stabilize it, exercise ourselves in it, and fully perfect it.’ Thus should you train yourselves.\"sn.iv.201"
}