{
    "sn35.121:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.[n.09] Identical withMN No. 47.Then, while the Blessed One was alone in seclusion, a reflection arose in his mind thus: \"The states that ripen in liberation have come to maturity in Rahula. Let me lead him on further to the destruction of the taints.\"[n.0]Vimuttiparipācaniyā dhammā.Spkinterprets these as the fifteen qualities that purify the five faculties (faith, energy, mindfulness, concentration, and wisdom), namely, in regard to each faculty: avoiding people who lack the faculty, associating with those endowed with it, and reflecting on suttas that inspire its maturation. Spk expands on this with another fifteen qualities: the five faculties again; the five perceptions partaking of penetration, namely, perception of impermanence, \nsuffering, nonself, abandoning, and dispassion (on the last two, seeAN V 0,3–20); and the five qualities taught to Meghiya, namely, noble friendship, the virtue of the monastic rules, suitable conversation, energy, and wisdom (seeAN IV 357,5–30;Ud 36,3–28).",
    "sn35.121:2": "Now on that occasion many thousands of devatas followed the Blessed One, thinking: \"Today the Blessed One will lead the Venerable Rahula on further to the destruction of the taints.\"[n.111]Spk: These devas had made their aspiration (for enlightenment) along with Rahula when the latter made his aspiration (to become the son of a Buddha) at the feet of the Buddha Padumuttara. They had been reborn in various heavenly worlds but on this day they all assembled in the Blind Men's Grove.Then the Blessed One plunged into the Blind Men's Grove and sat down at the foot of a certain tree on a seat that was prepared for him. The Venerable Rahula paid homage to the Blessed One and sat down to one side.sn.iv.106The Blessed One then said to him:",
    "sn35.121:3–8": "\"What do you think, Rahula, is the eye permanent or impermanent?\" –\"Impermanent, venerable sir.\" –\"Is what is impermanent suffering or happiness?\" –\"Suffering, venerable sir.\" –\"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" –\"No, venerable sir.\"",
    "sn35.121:9–20": "\"Are forms permanent or impermanent? … Is eye-consciousness … Is eye-contact … Is anything included in feeling, perception, volitional formations, and consciousness arisen with eye-contact as condition permanent or impermanent?\" –\"Impermanent, venerable sir.\"The rest as in the preceding paragraph.",
    "sn35.121:21–50": "\"Is the ear … the mind permanent or impermanent? …sn.iv.107… Are mental phenomena … Is mind-consciousness … Is mind-contact … Is anything included in feeling, perception, volitional formations, and consciousness arisen with mind-contact as condition permanent or impermanent?\" –\"Impermanent, venerable sir.\" –\"Is what is impermanent suffering or happiness?\" –\"Suffering, venerable sir.\" –\"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" –\"No, venerable sir.\"",
    "sn35.121:51": "\"Seeing thus, Rahula, the instructed noble disciple experiences revulsion towards the eye, revulsion towards forms, revulsion towards eye-consciousness, revulsion towards eye-contact; revulsion towards anything included in feeling, perception, volitional formations, and consciousness arisen with eye-contact as condition. He experiences revulsion towards the ear … towards the mind … towards anything included in feeling, perception, volitional formations, and consciousness arisen with mind-contact as condition.",
    "sn35.121:52": "\"Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated. When it is liberated there comes the knowledge: ‘It's liberated.’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\"",
    "sn35.121:53": "This is what the Blessed One said. Elated, the Venerable Rahula delighted in the Blessed One's statement. And while this discourse was being spoken, the Venerable Rahula's mind was liberated from the taints by nonclinging, and in those many thousands of devatas there arose the dust-free, stainless vision of the Dhamma: \"Whatever is subject to origination is all subject to cessation.\"[n.112]Spk: In this sutta \"the vision of the Dhamma\" denotes the four paths and their fruits. For some devas became streamenterers, some once-returners, some nonreturners, and some arahants. The devas were innumerable."
}