{
    "sn35.245:1": "One bhikkhu approached another and asked him: \"In what way, friend, is a bhikkhu's vision well purified?\"[n.202] The purification of vision(dassana)usually means the attainment of stream-entry, the gaining of \"the vision of the Dhamma\"(dhammacakkhu). Here, however, the qualification \"well purified\"(suvisuddhaṇ)seems to imply that the question concerns the path to arahantship. It is so taken bySpk.",
    "sn35.245:2": "Then the first bhikkhu, dissatisfied with the other's answer, approached another bhikkhu and asked him: \"In what way, friend, is a bhikkhu's vision well purified?\"",
    "sn35.245:3": "Again, the first bhikkhu, dissatisfied with the other's answer, approached still another bhikkhu and asked him: \"In what way, friend, is a bhikkhu's vision well purified?\"",
    "sn35.245:4": "Again, the first bhikkhu, dissatisfied with the other's answer, approached still another bhikkhu and asked him: \"In what way, friend, is a bhikkhu's vision well purified?\"",
    "sn35.245:5": "Then the first bhikkhu, dissatisfied with the other's answer, approached the Blessed One, reported everything that had happened,sn.iv.193and asked: \"In what way, venerable sir, is a bhikkhu's vision well purified?\"",
    "sn35.245:6": "\"Bhikkhu, suppose there was a man who had never before seen a Kiṁ tree.[n.204]Kiṁsukameans literally \"what's it?\" The name may have originated from an ancient Indian folk riddle.Kiṁśukais also known in Skt literature (see MW, s.v. kị). Both PED and MW identify it as the tree Butea frondosa. Liyanaratne lists two kinds ofkiṁsuka(\"South Asian flora as reflected in the Abhidhānappadīpikā,\" §§43–44.). One, also called thepaḷibadda,is identified asErythrina variegata;the English equivalent is the coral tree (elsewhere used to render thepāricchattakatree—seeSN48.8). The other, also called thepalāsa,is identified asButea monosperma;its English name is the Bengal kino tree or the dhak tree. Woodward translates it as \"Judas tree,\" but this is unlikely as the Judas tree is of the genusSercis.The Kiṁsukopama Jataka (No. 248; Ja II 25–) begins with an incident similar to the one with which the present sutta starts, but employs a somewhat different story about thekiṁsukato make the same point. In the Jataka version thekiṁsukaappears like a charred stump at the time the buds are sprouting; like a banyan tree, when the leaves turn green; like a piece of meat, at the time of blossoming; like an acacia, when bearing fruit. According toSpk, thekiṁsukais like a charred stump when the leaves have been shed; like a piece of meat, when blossoming; with strips of bark hanging down and burst pods, when bearing fruit; and giving abundant shade, when covered with leaves. The similarity of its flowers to meat is the theme of a humorous poem at Vism 19,5–15 (Ppn :91–92), about a jackal who chanced upon akiṁsukaand rejoiced at finding \"a meat-bearing tree.\"He might approach a man who had seen a Kiṁ tree and ask him: ‘Sir, what is a Kiṁ tree like?’ The other might answer: ‘Good man, a Kiṁ tree is blackish, like a charred stump.’ On that occasion a kịsuka tree might have been exactly as that man had seen it.",
    "sn35.245:7": "\"Then that man, dissatisfied with the other's answer, might approach another man who had seen a kịsuka tree and ask him: ‘Sir, what is a kịsuka tree like?’ The other might answer: ‘Good man, a kịsuka tree is reddish, like a piece of meat.’ On that occasion a kịsuka tree might have been exactly as that man had seen it.",
    "sn35.245:8": "\"Suppose, bhikkhu, a king had a frontier city with strong ramparts, walls, and arches, and with six gates.[n.207]Spk: Why is this introduced? If that bhikkhu understood (the meaning being conveyed by thekiṁsukasimile), then it is introduced to teach him the Dhamma. If he did not understand, this simile of the city is introduced to explain and clarify the meaning.Again, Spk gives a much more elaborate version of the simile and its application. In brief: The lord of the city is a prince, son of a virtuous world monarch, who had been appointed by his father to administer one of the outlying provinces. Under the influence of bad friends the prince had become dissolute and passed his time drinking liquor and enjoying music and dance. The king sent the two messengers to admonish the prince to abandon his heedless ways and resume his duties. One messenger is a brave warrior (representing thesamathameditation subject), the other a wise minister (representing thevipassanāmeditation subject). The brave warrior grabs hold of the wayward prince by the head and threatens to decapitate him if he doesn’t change his ways: this is like the time the mind has been grabbed and made motionless by the concentration arisen through the first jhāna. The fleeing of the prince's dissolute friends is like the disappearance of the five hindrances when the first jhāna has arisen. When the prince agrees to follow the king's command, this is like the time the meditator has emerged from jhāna. When the minister delivers the king's command, this is like the time when the meditator, with his mind made pliable through concentration, develops insight meditation. When the two messengers raise up the white canopy over the prince after he has been coronated, this is like the time the white canopy of liberation is raised over the meditator after he has attained arahantship by means of serenity and insight.The gatekeeper posted there would be wise, competent, and intelligent; one who keeps out strangers and admits acquaintances. A swift pair of messengers would come from the east and ask the gatekeeper: ‘Where, good man, is the lord of this city?’ He would reply: ‘He is sitting in the central square.’ Then the swift pair of messengers would deliver a message of reality to the lord of the city and leave by the route by which they had arrived. Similarly, messengers would come from the west, from the north, from the south, deliver their message, and leave by the route by which they had arrived.",
    "sn35.245:9": "\"I have made up this simile, bhikkhu, in order to convey a meaning. This is the meaning here: ‘The city’: this is a designation for this body consisting of the four great elements, originating from mother and father, built up out of boiled rice and gruel, subject to impermanence, to being worn and rubbed away, to breaking apart and dispersal.[n.208] Also atSN35.103; see above n.87.‘The six gates’: this is a designation for the six internal sense bases. ‘The gatekeeper’: this is a designation for mindfulness.sn.iv.15‘The swift pair of messengers’: this is a designation for serenity and insight. ‘The lord of the city’: this is designation for consciousness.[n.20]Spkidentifies this as the insight-mind(vipassanācitta), which is the prince to be coronated with the coronation of arahantship by the two messengers, serenity and insight. This interpretation strikes me as too narrow. I see the point to be simply that consciousness is the functional centre of personal experience.‘The central square’: this is a designation for the four great elements—the earth element, the water element, the heat element, the air element. ‘A message of reality’: this is a designation for Nibbāna.[n.210]Spk: Nibbāna is called the \"message of reality\"(yathabhataṇ vacanaṁ)because in its real nature it is unshakable and immutable(yathabhūtasabhavaṁ akuppaṁ avikari).‘The route by which they had arrived’: this is a designation for the Noble Eightfold Path; that is, right view … right concentration.\""
}