{
    "sn35.81:1": "Then a number of bhikkhus approached the Blessed One … and said to him:sn.iv.5\"Here, venerable sir, wanderers of other sects ask us: ‘For what purpose, friends, is the holy life lived under the ascetic Gotama?’ When we are asked thus, venerable sir, we answer those wanderers thus: ‘It is, friends, for the full understanding of suffering that the holy life is lived under the Blessed One.’ We hope, venerable sir, that when we answer thus we state what has been said by the Blessed One and do not misrepresent him with what is contrary to fact; that we explain in accordance with the Dhamma, and that no reasonable consequence of our assertion gives ground for criticism.\"[n.44] A stock passage in the Nikāyas, recurring in SN in slightly different forms determined by the context, atSN2.25,2:26,SN22.2,22:86,SN35.8,42:3,SN44.2, andSN45.5. The readings alternate, even within the same volume, betweenvādānuvādoandvādānupāto,and it is uncertain which of the two is more original. The passage has stumped previous translators, mainly because of the phrasekoci sahadhammiko vādānupāto,which at KS 2:28 is rendered \"one who is of his doctrine, a follower of his views.\" To avoid such errors two meanings ofsahadhammikamust be distinguished: (i) a noun meaning a follower of the same doctrine (unambiguously so atMN(MN I 64,3)); and (ii) an adjective meaning legitimate, reasonable (unambiguously so atSN4.8(IV 299,25 foll.)). Here the second meaning is applicable.Spkexplains: \"How (should we answer) so that not the slightest consequence or implication(vadanupato vadappavatti)of the ascetic Gotama's assertion—(a consequence) which is reasonable because of the reason stated(vutta-karaṇena sakaraṇo hutva)—might give ground for criticism?\" This is meant: \"How can there be no ground for criticism in any way of the ascetic Gotama's assertion?\" I dissent from Spk on what is to be safeguarded against criticism: Spk takes it to be the Buddha’s assertion, while I understand it to be the inquirer's account of the Buddha’s assertion. In other words, the inquirer wants to be sure he is representing the Buddha’s position correctly, whether or not he agrees with it.AtAN5.5(AN III 4,0, 9)sahadhammikā vādānuvādā gārayhā ṭhānā āgacchantioccurs in a context where it means simply \"reasonable rebukes, grounds for criticism, come up,\" and is contrasted withsahadhammikā pāsaṁsā ṭhānā āgacchanti,\"reasonable grounds for praise come up.\"",
    "sn35.81:2": "\"For sure, bhikkhus, when you answer thus you state what has been said by me and do not misrepresent me with what is contrary to fact; you explain in accordance with the Dhamma, and no reasonable consequence of your assertion gives ground for criticism. For, bhikkhus, it is for the full understanding of suffering that the holy life is lived under me."
}