{
    "sn35.153:1": "\"Is there a method of exposition, bhikkhus, by means of which a bhikkhu—apart from faith, apart from personal preference, apart from oral tradition, apart from reasoned reflection, apart from acceptance of a view after pondering it[n.50] As at2:68. These five grounds for the acceptance of a thesis are examined critically by the Buddha atMN95(MN II 70,26-7,25); see tooMN0(MN II 28,5-2). Here they are being contrasted with personal knowledge(paccattameva ñāṇa). For a detailed discussion, see Jayatilleke,Early Buddhist Theory of Knowledge,pp. 82-88, 274-76.Spk: One person accepts something through faith(saddhā)by placing faith in another and accepting what he says as true. Another accepts something through personal preference(ruci)when he approves of some thesis by reflecting on it and then takes it to be true. One accepts a thesis by oral tradition(anussava)when one thinks: \"This has come down from ancient times by oral tradition, so it must be true.\" For another, as he thinks, a certain thesis appears valid, and he concludes, \"So it is\": he accepts it by reasoned reflection(ākārāparivitakka). (Jayatilleke discussesākārāas meaning \"reason\" at p. 274.) In the fifth case, as one reflects, a view arises by pondering some hypothesis; this is acceptance of a view after pondering it(diṭṭhinijjhānakkhanti)..—sn.iv.39can declare final knowledge thus: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being’?\"",
    "sn35.153:2": "And what is that method of exposition? Here, bhikkhus, having seen a form with the eye, if there is lust, hatred, or delusion internally, a bhikkhu understands: ‘There is lust, hatred, or delusion internally’; or, if there is no lust, hatred, or delusion internally, he understands: ‘There is no lust, hatred, or delusion internally.’[n.151] Cp.SN35.70.Spksays that in this sutta the reviewing(paccavekkhaṇā)of thesekhaand the arahant is discussed.Since this is so, are these things to be understood by faith, or by personal preference, or by oral tradition, or by reasoned reflection, or by acceptance of a view after pondering it?\"",
    "sn35.153:3-4": "\"Further, bhikkhus, having heard a sound with the ear …sn.iv.140… Having cognized a mental phenomenon with the mind, if there is lust, hatred, or delusion internally, a bhikkhu understands: ‘There is lust, hatred, or delusion internally’; or, if there is no lust, hatred, or delusion internally, he understands: ‘There is no lust, hatred, or delusion internally.’ Since this is so, are these things to be understood by faith, or by personal preference, or by oral tradition, or by reasoned reflection, or by acceptance of a view after pondering it?\""
}