{
    "sn35.136:1": "\"Bhikkhus, devas and humans delight in forms, take delight in forms, rejoice in forms. With the change, fading away, and cessation of forms, devas and humans dwell in suffering. Devas and humans delight in sounds … delight in odours … delight in tastes … delight in tactile objects … delight in mental phenomena,sn.iv.27take delight in mental phenomena, rejoice in mental phenomena. With the change, fading away, and cessation of mental phenomena, devas and humans dwell in suffering.",
    "sn35.136:2": "\"Forms, sounds, odours, tastes,Tactiles and all objects of mind—Desirable, lovely, agreeable,So long as it's said: ‘They are.’",
    "sn35.136:3": "\"These are considered happinessBy the world with its devas;But where these cease,That they consider suffering.",
    "sn35.136:4": "\"The noble ones have seen as happinessThe ceasing of identity.Thisviewof those who clearly seeRuns counter to the entire world.[n.12]Spk: This view of the wise who see(idaṁ passantānaṃ paṇḍitānaṃ dassanaṃ)runs counter(paccanīkaṇ), contrary, to the entire world. For the world conceives the five aggregates as permanent, happiness, self, and beautiful, while to the wise they are impermanent, suffering, nonself, and foul.",
    "sn35.136:5": "\"What others speak of as happiness,That the noble ones say is suffering;What others speak of as suffering,That the noble ones know as bliss.",
    "sn35.136:6": "\"Behold this Dhamma hard to comprehend:Here the foolish are bewildered.For those with blocked minds it is obscure,Sheer darkness for those who do not see.sn.iv.128",
    "sn35.136:7": "\"But for the good it is disclosed,It is light here for those who see.The dullards unskilled in the DhammaDon’t understand it in its presence.",
    "sn35.136:8": "\"This Dhamma isn’t easily understoodBy those afflicted with lust for existence,Who flow along in the stream of existence,Deeply mired in Māra's realm.",
    "sn35.136:9": "\"Who else apart from the noble onesAre able to understand this state?When they have rightly known that state,The taintless ones are fully quenched.\"[n.143]Spk: Who else except the noble ones are able to know that state of Nibbāna(Nibbānapadaṁ)? Having known it rightly by the wisdom of arahantship, they immediately become taintless and are fully quenched by the quenching of the defilements(kilesaparinibb̄nena parinibbanti). Or else, having become taintless by rightly knowing, in the end they are fully quenched by the quenching of the aggregates(khandhaparinibbānena parinibbanti)."
}