{
    "sn35.88:1": "Then the Venerable Puṇṇa approached the Blessed One … and said to him:[n.58] Also atMN No. 45, entitled Puṇṇovada Sutta; the opening and closing paragraphs of the two versions are slightly different. According toSpk, Puṇṇa had been a merchant from the Sunaparanta country who came to Sāvatthī on business. Hearing the Buddha preach, he decided to become a bhikkhu. After his ordination he found the area around Sāvatthī uncongenial to his meditation and wished to return to his home country to continue his practice. He approached the Buddha to obtain guidance before departing. For biographical details, see DPPN 2:220–2. Sunāparanta was on the west coast of India. Its capital was Suppāraka, modern Sopāra in the district of Thāna near modern Mumbai.\"Venerable sir, it would be good if the Blessed One would teach me the Dhamma in brief, so that, having heard the Dhamma from the Blessed One, I might dwell alone, withdrawn, diligent, ardent, and resolute.\"",
    "sn35.88:2": "\"Puṇṇa, there are forms cognizable by the eye that are desirable, lovely, agreeable, pleasing, sensually enticing, tantalizing. If a bhikkhu seeks delight in them, welcomes them, and remains holding to them, delight arises in him. With the arising of delight, Puṇṇa, there is the arising of suffering, I say. There are, Puṇṇa, sounds cognizable by the ear … mental phenomena cognizable by the mind that are desirable, lovely, agreeable, pleasing, sensually enticing, tantalizing. If a bhikkhu seeks delight in them, welcomes them, and remains holding to them, delight arises in him. With the arising of delight, Puṇṇa, there is the arising of suffering, I say.",
    "sn35.88:3": "\"Puṇṇa, there are forms cognizable by the eye … mental phenomena cognizable by the mind that are desirable, lovely, agreeable, pleasing, sensually enticing, tantalizing.sn.iv.61If a bhikkhu does not seek delight in them, does not welcome them, and does not remain holding to them, delight ceases in him. With the cessation of delight, Puṇṇa, there is the cessation of suffering, I say.",
    "sn35.88:4": "\"Now that you have received this brief exhortation from me, Puṇṇa, in which country will you dwell?\"",
    "sn35.88:5": "\"Puṇṇa, the people of Sunaparanta are wild and rough. If they abuse and revile you, what will you think about that?\"",
    "sn35.88:6": "\"Venerable sir, if the people of Sunaparanta abuse and revile me, then I will think: ‘These people of Sunaparanta are excellent, truly excellent, in that they do not give me a blow with the fist.’ Then I will think thus, Blessed One; then I will think thus, Fortunate One.\"",
    "sn35.88:7": "\"But, Puṇṇa, if the people of Sunaparanta do give you a blow with the fist, what will you think about that?\"",
    "sn35.88:8": "\"Venerable sir, if the people of Sunaparanta give me a blow with the fist, then I will think: ‘These people of Sunaparanta are excellent, truly excellent, in that they do not give me a blow with a clod.’ Then I will think thus, Blessed One; then I will think thus, Fortunate One.\"",
    "sn35.88:9": "\"But, Puṇṇa, if the people of Sunaparanta do give you a blow with a clod, what will you think about that?\"",
    "sn35.88:10": "\"Venerable sir, if the people of Sunaparanta give me a blow with a clod, then I will think: ‘These people of Sunaparanta are excellent, truly excellent, in that they do not give me a blow with a rod.’sn.iv.62Then I will think thus, Blessed One; then I will think thus, Fortunate One.\"",
    "sn35.88:11": "\"But, Puṇṇa, if the people of Sunaparanta do give you a blow with a rod, what will you think about that?\"",
    "sn35.88:12": "\"Venerable sir, if the people of Sunaparanta give me a blow with a rod, then I will think: ‘These people of Sunaparanta are excellent, truly excellent, in that they do not stab me with a knife.’ Then I will think thus, Blessed One; then I will think thus, Fortunate One.\"",
    "sn35.88:13": "\"But, Puṇṇa, if the people of Sunaparanta do stab you with a knife, what will you think about that?\"",
    "sn35.88:14": "\"Venerable sir, if the people of Sunaparanta stab me with a knife, then I will think: ‘These people of Sunaparanta are excellent, truly excellent, in that they do not take my life with a sharp knife.’ Then I will think thus, Blessed One; then I will think thus, Fortunate One.\"",
    "sn35.88:15": "\"But, Puṇṇa, if the people of Sunaparanta do take your life with a sharp knife, what will you think about that?\"",
    "sn35.88:16": "\"Venerable sir, if the people of Sunaparanta take my life with a sharp knife, then I will think: ‘There have been disciples of the Blessed One who, being repelled, humiliated, and disgusted by the body and by life, sought for an assailant.[n.59] SeeSN54.9.But I have come upon this assailant even without a search.’ Then I will think thus, Blessed One; then I will think thus, Fortunate One.\"",
    "sn35.88:17": "\"Good, good, Puṇṇa! Endowed with such self-control and peacefulness, you will be able to dwell in the Sunaparanta country. Now, Puṇṇa, you may go at your own convenience.\"[n.60] See I, n.650.",
    "sn35.88:18": "Then, having delighted and rejoiced in the Blessed One's statement, the Venerable Puṇṇa rose from his seat, paid homage to the Blessed One,sn.iv.63and departed, keeping him on his right. He then set his lodging in order, took his bowl and outer robe, and set out to wander towards the Sunaparanta country. Wandering by stages, he eventually arrived in the Sunaparanta country, where he dwelt. Then, during that rains, the Venerable Puṇṇa established five hundred male lay followers and five hundred female lay followers in the practice, and he himself, during that same rains, realized the three true knowledges. And during that same rains he attained final Nibbāna.[n.61] Ee omitsen’ ev’ antaravassena pañcamattāni upāsikāsatāni paṭipādesi,found in Be and Se (but in the latter with the verbpaṭivedesi). AtMN III 269,28–29it is said that he attained final Nibbāna \"at a later time\"(aparena samayena), without specifying that this occurred during the same rains.",
    "sn35.88:19": "Then a number of bhikkhus approached the Blessed One … and said to him: \"Venerable sir, the clansman named Puṇṇa, who was given a brief exhortation by the Blessed One, has died. What is his destination? What is his future bourn?\"",
    "sn35.88:20": "\"Bhikkhus, the clansman Puṇṇa was wise. He practised in accordance with the Dhamma and did not trouble me on account of the Dhamma. The clansman Puṇṇa has attained final Nibbāna.\""
}