{
    "sn35.87:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary.[n.48] The sutta is also atMN44, entitled the Channovada Sutta. Obviously, this Channa is different from the one who appears atSN22.90.Now on that occasion the Venerable Sāriputta, the Venerable Mahācunda, and the Venerable Channa were dwelling on Mount Vulture Peak, and the Venerable Channa was sick, afflicted, gravely ill. Then, in the evening, the Venerable Sāriputtasn.iv.56emerged from seclusion, approached the Venerable Mahācunda, and said to him: \"Come, friend Cunda, let us approach the Venerable Channa and ask about his illness.\"",
    "sn35.87:2": "Then the Venerable Sāriputta and the Venerable Mahācunda approached the Venerable Channa and exchanged greetings with him, after which they sat down in the appointed seats. The Venerable Sāriputta then said to the Venerable Channa: \"I hope you are bearing up, friend Channa, I hope you are getting better. I hope that your painful feelings are subsiding and not increasing, and that their subsiding, not their increase, is to be discerned.\"",
    "sn35.87:3": "\"Friend Sāriputta, I am not bearing up, I am not getting better.[n.49] What follows is the stock description of unbearable pain.Strong painful feelings are increasing in me, not subsiding, and their increase, not their subsiding, is to be discerned. Just as if a strong man were to split my head open with a sharp sword, so too violent winds cut through my head. I am not bearing up … . Just as if a strong man were to tighten a tough leather strap around my head as a headband, so too there are violent pains in my head. I am not bearing up … . Just as if a skilled butcher or his apprentice were to carve up an ox's belly with a sharp butcher's knife, so too violent winds are carving up my belly. I am not bearing up … . Just as if two strong men were to seize a weaker man by both arms and roast him over a pit of hot coals,sn.iv.57so too there is a violent burning in my body. \nI am not bearing up, I am not getting better. Strong painful feelings are increasing in me, not subsiding, and their increase, not their subsiding, is to be discerned. I will use the knife,[n.50]Satthaṁ aharissami.An expression for committing suicide.friend Sāriputta, I have no desire to live.\"",
    "sn35.87:4": "\"Let the Venerable Channa not use the knife. Let the Venerable Channa live. We want the Venerable Channa to live. If the Venerable Channa lacks suitable food, I will go in search of suitable food for him; if he lacks suitable medicine, I will go in search of suitable medicine for him; if he lacks a proper attendant, I will attend on him. Let the Venerable Channa not use the knife. Let the Venerable Channa live. We want the Venerable Channa to live.\"",
    "sn35.87:5": "\"Friend Sāriputta, it is not that I lack suitable food; I have suitable food. It is not that I lack suitable medicine; I have suitable medicine. It is not that I lack proper attendants; I have proper attendants. Moreover, friend, for a long time the Teacher has been served by me in an agreeable way, not in a disagreeable way; for it is proper for a disciple to serve the Teacher in an agreeable way, not in a disagreeable way. Remember this, friend Sāriputta: the bhikkhu Channa will use the knife blamelessly.\"[n.1]Anupavajjaṁ Channo bhikkhu satthaṁ āharissati.By this he seems to be insinuating that he is an arahant.Spkglosses \"blamelessly\"(anupavajjaṇ)with \"without continued existence, without rebirth(appavattikaṇ appaṇtisandhikaṁ).\"",
    "sn35.87:6": "\"We would ask the Venerable Channa about a certain point, if he would grant us the favour of answering our question.\"sn.iv.58",
    "sn35.87:7": "\"Friend Channa, do you regard the eye, eye-consciousness, and things cognizable with eye-consciousness thus: ‘This is mine, this I am, this is my self’? Do you regard the ear, ear-consciousness, and things cognizable with ear-consciousness thus … ? Do you regard the mind, mind-consciousness, and things cognizable with mind-consciousness thus: ‘This is mine, this I am, this is my self’?",
    "sn35.87:8": "\"Friend Sāriputta, I regard the eye, eye-consciousness, and things cognizable with eye-consciousness thus: ‘This is not mine, this I am not, this is not my self.’ I regard the ear, ear-consciousness, and things cognizable with ear-consciousness thus … I regard the mind, mind-consciousness, and things cognizable with mind-consciousness thus: ‘This is not mine, this I am not, this is not my self.’\"",
    "sn35.87:9": "\"Friend Channa, what have you seen and directly known in the eye, in eye-consciousness, and in things cognizable with eye-consciousness, that you regard them thus: ‘This is not mine, this I am not, this is not my self’? What have you seen and directly known in the ear … in the mind, in mind-consciousness, and in things cognizable with mind-consciousness, that you regard them thus: ‘This is not mine, this I am not, this is not my self’?\"",
    "sn35.87:10": "\"Friend Sāriputta, it is because I have seen and directly known cessation in the eye, in eye-consciousness, and in things cognizable with eye-consciousness, that I regard them thus: ‘This is not mine, this I am not, this is not my self.’ It is because I have seen and directly known cessation in the ear …sn.iv.59… in the mind, in mind-consciousness, and in things cognizable with mind-consciousness, that I regard them thus: ‘This is not mine, this I am not, this is not my self.’\"[n.52]Spk: Channa replied to Sāriputta's questions by ascribing arahantship to himself, but Sāriputta, while knowing that he was still a worldling, just kept quiet. Mahācunda, however, gave him an exhortation to convince him of this.",
    "sn35.87:11": "When this was said, the Venerable Mahācunda said to the Venerable Channa: \"Therefore, friend Channa, this teaching of the Blessed One is to be constantly given close attention: ‘For one who is dependent there is wavering; for one who is independent there is no wavering. When there is no wavering, there is tranquillity; when there is tranquillity, there is no inclination; when there is no inclination, there is no coming and going; when there is no coming and going, there is no passing away and being reborn; when there is no passing away and being reborn, there is neither here nor beyond nor in between the two. This itself is the end of suffering.’\"[n.53] This \"teaching of the Blessed One\" is atUd 4.4.Spkexplains the connection between the teaching and the present situation thus: For one who is dependent(nissitassa): \"dependent\" on account of craving, conceit, and views; there is wavering(calitaṇ): palpitation. As Channa is unable to endure the arisen pain, there is now the palpitation of one who isn’t free from the grip of such thoughts as \"I am in pain, the pain is mine.\" By this, he is telling him, \"You’re still a worldling.\" No inclination(nati): no inclination of craving. No coming by way of rebirth, no going by way of death. This itself is the end of suffering: this itself is the end, the termination, the limit, of the suffering of defilements and of the suffering of the round. As to those who argue that the phrase \"in between the two\"(ubhayamantarena)implies an intermediate state(antarābhava), their statement is nonsense, for the existence of an intermediate state is rejected in the Abhidhamma. Therefore the meaning is: \"Neither here, nor there, nor both—the other alternative.\"Though the Theravada Abhidhamma (see Kvu 362–66) and the commentaries argue against the existence of anantarabhava,a number of canonical texts seem to support this notion. See below n. 382, and V, n. 65.",
    "sn35.87:12": "Then, when the Venerable Sāriputta and the Venerable Mahācunda had given the Venerable Channa this exhortation, they rose from their seats and departed. Then, soon after they had left, the Venerable Channa used the knife.[n.54]Spk: He cut his jugular vein and just then the fear of death entered him. As the sign of his rebirth destiny appeared, he realized he was still a worldling and his mind became agitated. He set up insight, discerned the formations, and reaching arahantship, he attained final Nibbāna as a \"same-header\"(samasīsī).Spk: The elder, thinking, \"What is the use of living?\" lay down and slit his jugular vein with a knife. Painful feelings arose. He suppressed them, comprehended the pains (with insight), set up mindfulness, explored his meditation subject, and attained arahantship as a \"same-header\"(samasisi;see Pp 13,25–27, commented on at Pp-a 186–87). He was ajīvitasamasisi,one who attains the destruction of defilements and the end of life simultaneously. (Another kind ofsamasisirecovers from a grave illness at the same time that he attains arahantship.)",
    "sn35.87:13": "Then the Venerable Sāriputta approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Venerable sir, the Venerable Channa has used the knife. What is his destination, what is his future bourn?\""
}