{
    "sn35.94:1": "At Sāvatthī. \"Bhikkhus, these six bases for contact—if untamed, unguarded, unprotected, unrestrained—are bringers of suffering.[n.69]Dukkhādhivāhā.Spk: They are bringers(āvahanakā)of extreme suffering(adhidukkha), classified as infernal, etc.What six?",
    "sn35.94:2": "\"Bhikkhus, these six bases for contact—if well tamed, well guarded, well protected, well restrained—are bringers of happiness.[n.70]Sukhādhivāhā.Spk: They are bringers of extreme happiness, classified as jhāna, path, and fruit.What six?",
    "sn35.94:3": "\"Just six, O bhikkhus, are the bases for contact,Where one unrestrained meets with suffering.Those who know how to restrain themDwell uncorrupted, with faith their partner.",
    "sn35.94:4": "\"Having seen forms that delight the mindAnd having seen those that give no delight,Dispel the path of lust towards the delightfulAnd do not soil the mind by thinking,‘The otheris displeasing to me.’sn.iv.71",
    "sn35.94:5": "\"Having heard sounds both pleasant and raucous,Do not be enthralled with pleasant sound.Dispel the course of hate towards the raucous,And do not soil the mind by thinking,‘This oneis displeasing to me.’",
    "sn35.94:6": "\"Having smelt a fragrant, delightful scent,And having smelt a putrid stench,Dispel aversion towards the stenchAnd do not yield to desire for the lovely.",
    "sn35.94:7": "\"Having enjoyed a sweet delicious taste,And having sometimes tasted what is bitter,Do not greedily enjoy the sweet taste,Do not feel aversion towards the bitter.",
    "sn35.94:8": "\"When touched by pleasant contact do not be enthralled,Do not tremble when touched by pain.Look evenly on both the pleasant and painful,Not drawn or repelled by anything.",
    "sn35.94:9": "\"When common people of proliferated perceptionPerceive and proliferate they become engaged.Having dispelled every mind-state bound to the home life,One travels on the road of renunciation.[n.71] Pada a reads,papañcasaññā itarītarā narā,on whichSpkcomments: \"Common beings become ‘of proliferated perception’ on account of defiled perception(kilesasaññ̄ya).\" On how \"perceptions and notions affected by proliferation\" arise and obsess a person, seeMN I 111,35–112,13.Papañcais explained by the commentaries as of threefold origin: through craving, conceit, and views(taṇhā, māna, diṭṭhi)in their capacity to cause mental distortion and obsession. \"Proliferated perception\" might be interpreted as the distorted perception of permanence, pleasure, self, and beauty in relation to what is really impermanent, suffering, nonself, and foul (see the treatment ofsaññāvipallāsaatAN II 52). Such distorted perception is caused by the proliferating defilements.\"Mind-state\" rendersmanomaya, an adjective meaning \"mind-made,\" with the qualified noun left implicit. Spk glosses the second couplet thus: \"Having dispelled every mind-made thought(manomayaṁ vitakkaṁ)connected to the ‘home life’ of the five cords of sensual pleasure, a competent bhikkhu travels on (the way) bound up with renunciation.\" The contrast between worldly pleasure and the pleasure of renunciation is developed atMN III 217,13–218,6.",
    "sn35.94:10": "\"When the mind is thus well developed in six,If touched, one's mind never flutters anywhere.Having vanquished both lust and hate, O bhikkhus,Go to the far shore beyond birth and death!\"sn.iv.72"
}