{
    "sn35.133:1": "On one occasion the Venerable Udayī was living at Kamaṇḍa in the brahmin Todeyya's Mango Grove. Then a brahmin youth, a student of the brahmin lady of the Verahaccani clan, approached the Venerable Udayī and greeted him. When they had concluded their greetings and cordial talk, he sat down to one side, and the Venerable Udayī instructed, exhorted, inspired, and gladdened him with a Dhamma talk. Having been instructed, exhorted, inspired, and gladdened by the Dhamma talk, the brahmin youth rose from his seat, approached the brahmin lady of the Verahaccani clan, and said to her: \"See now, madam, you should know that the ascetic Udayī teaches a Dhamma that is good in the beginning, good in the middle, and good in the end,sn.iv.22with the right meaning and phrasing; he reveals a holy life that is perfectly complete and pure.\"",
    "sn35.133:2": "\"In that case, young man, invite the ascetic Udayī in my name for tomorrow's meal.\"",
    "sn35.133:3": "A second time that brahmin youth approached the Venerable Udayī …as above down to:… \"See now, madam, you should know that the ascetic Udayī teaches a Dhamma that is good in the beginning, good in the middle,sn.iv.12and good in the end, with the right meaning and phrasing; he reveals a holy life that is perfectly complete and pure.\"",
    "sn35.133:4": "\"In such a way, young man, you keep on praising the ascetic Udayī, but when I told him, ‘Preach the Dhamma, ascetic,’ he said, ‘There will be an occasion for that, sister,’ and he rose from his seat and departed.\"",
    "sn35.133:5": "When the Venerable Udayī had finished eating and had put away his bowl, the brahmin lady removed her sandals, sat down on a low seat, uncovered her head, and said to him: \"Venerable sir, what do the arahants maintain must exist for there to be pleasure and pain? And what is it that the arahants maintain must cease to exist for there to be no pleasure and pain?\"",
    "sn35.133:6": "\"Sister, the arahants maintain that when the eye exists there is pleasure and pain, and when the eye does not exist there is no pleasure and pain.sn.iv.124The arahants maintain that when the ear exists there is pleasure and pain, and when the ear does not exist there is no pleasure and pain … . The arahants maintain that when the mind exists there is pleasure and pain, and when the mind does not exist there is no pleasure and pain.\"",
    "sn35.133:7": "When this was said, the brahmin lady of the Verahaccani clan said to the Venerable Udayī: \"Magnificent, venerable sir! Magnificent, venerable sir! The Dhamma has been made clear in many ways by Master Udayī …as in §12… From today let Master Udayī remember me as a lay follower who has gone for refuge for life.\""
}