{
    "sn35.238:1": "\"Bhikkhus, suppose there were four vipers of fierce heat and deadly venom.[n.73]Spksays this sutta was addressed to bhikkhus who practised meditation using the characteristic of suffering as their meditation subject. Spk takes the \"four vipers\"(cattāro āsı̄visā)as referring to the four families of vipers, not four individual serpents. The four are: (i) the wooden-mouthed(kaṇ̣hamukha), whose bite causes the victim's entire body to stiffen like dry wood; (ii) the putrid-mouthed(pātimukha), whose bite makes the victim's body decay and ooze like a decaying fruit; (iii) the fiery-mouthed(aggimukha), whose bite causes its victim's body to burn up and scatter like ashes or chaff (seeSN35.69); and (iv) the dagger-mouthed(satthamukha), whose bite causes the victim's body to break apart like a pole struck by lightning.The etymology ofāsīvisais uncertain. Spk offers three alternatives, none especially persuasive: (i)āsittavisā,\"with besprinkled poison,\" because their poison is stored as if it were sprinkling(āsiñcitvā viya)their whole body; (ii)asitavisa,\"with eaten poison,\" because whatever they eat becomes poison; and (iii)asisadisavisa,\"with swordlike poison,\" because their poison is sharp like a sword. Sp I 220,3 offers:asu sīghaṁ etassa visaṁ agacchati ti asīviso;\"it is a viper because its poison comes on quick and fast.\" Four types of asīvisa are mentioned atAN4.0(AN II 0–).Then a man would come along wanting to live, not wanting to die, desiring happiness and averse to suffering. They would tell him: ‘Good man, these four vipers are of fierce heat and deadly venom.sn.iv.73From time to time they must be lifted up; from time to time they must be bathed; from time to time they must be fed; from time to time they must be laid to rest.[n.74] Be and Se:saṁvesetabbā(Ee:pavesetabbā). Spk glosses withnipajjāpetabbā,\"to be made to lie down.\" Spk provides an elaborate background story, making this a punishment imposed on the man by the king.But if one or another of these vipers ever becomes angry with you, then, good man, you will meet death or deadly suffering. Do whatever has to be done, good man!’",
    "sn35.238:2": "\"Then, bhikkhus, afraid of the four vipers of fierce heat and deadly venom, that man would flee in one direction or another. They would tell him: ‘Good man, five murderous enemies are pursuing you, thinking, \"Wherever we see him, we will take his life right on the spot.\" Do whatever has to be done, good man!’",
    "sn35.238:3": "\"Then, bhikkhus, afraid of the four vipers of fierce heat and deadly venom, and of the five murderous enemies, that man would flee in one direction or another. They would tell him: ‘Good man, a sixth murderer, an intimate companion,[n.175]Chaṭṭho antaracaro vadhako.Spk: The king spoke to his ministers thus: \"First, when he was pursued by the vipers, he fled here and there, tricking them. Now, when pursued by five enemies, he flees even more swiftly. We can’t catch him, but by trickery we can. Therefore send as a murderer an intimate companion from his youth, one who used to eat and drink with him.\" The ministers then sought out such a companion and sent him as a murderer.is pursuing you with drawn sword, thinking, \"Wherever I see him I will cut off his head right on the spot.\" Do whatever has to be done, good man!’",
    "sn35.238:4": "\"Then, bhikkhus, afraid of the four vipers of fierce heat and deadly venom, and of the five murderous enemies, and of the sixth murderer, the intimate companion with drawn sword, that man would flee in one direction or another. He would see an empty village. Whatever house he enters is void, deserted, empty. Whatever pot he takes hold of is void, hollow, empty. They would tell him: ‘Good man, just now village-attacking dacoits will raid[n.176] Be:pivisanti;Se and Ee:vadhissanti.this empty village. Do whatever has to be done, good man!’sn.iv.17",
    "sn35.238:5": "\"Then, bhikkhus, afraid of the four vipers of fierce heat and deadly venom, and of the five murderous enemies, and of the sixth murderer—the intimate companion with drawn sword—and of the village-attacking dacoits, that man would flee in one direction or another. He would see a great expanse of water whose near shore was dangerous and fearful, and whose further shore was safe and free from danger, but there would be no ferryboat or bridge for crossing over from the near shore to the far shore.[n.177] See the better known simile of the raft atMN22(MN I 134–3).",
    "sn35.238:6": "\"Then the man would collect grass, twigs, branches, and foliage, and bind them together into a raft, so that by means of that raft, making an effort with his hands and feet, he would get safely across to the far shore. Crossed over, gone beyond, the brahmin stands on high ground.[n.178] As atSN35.228above.",
    "sn35.238:7": "\"I have made up this simile, bhikkhus, in order to convey a meaning. This is the meaning here: ‘The four vipers of fierce heat and deadly venom’: this is a designation for the four great elements—the earth element, the water element, the heat element, the air element.[n.19]Spkcorrelates each element with a particular family of vipers: the earth element with the wooden-mouthed; the water element with the putrid-mouthed; the fire element with the fiery-mouthed; and the air element with the dagger-mouthed. See too Vism 36–68 (Ppn 11:102). Spk devotes three pages to elaborating on the comparison.",
    "sn35.238:8": "\"‘The five murderous enemies’: this is a designation for the five aggregates subject to clinging; that is, the material form aggregate subject to clinging, the feeling aggregate subject to clinging, the perception aggregate subject to clinging, the volitional formations aggregate subject to clinging, the consciousness aggregate subject to clinging.[n.10] See the simile of the murderous servant atSN22.5(III 112–14). The explanation Spk gives here is almost identical with the explanation it gives of the wordvadhakoinSN22.95, v. 5c,summarized as follows:Spkexplains thatmāyāyaṁ bālalāpinī,in pāda b, refers specifically to the aggregate of consciousness. The aggregate-mass is a murderer in two ways: (i) because the aggregates slay each other; and (ii) because murder appears in dependence on the aggregates. As to (i), when the earth element breaks up it takes along the other elements, and when the form aggregate breaks up it takes along the mental aggregates. As to (ii), when the aggregates exist such things as murder, bondage, injury, etc., come into being.",
    "sn35.238:9": "\"‘The sixth murderer, the intimate companion with drawn sword’: this is a designation for delight and lust.[n.181]Nandirāga.Spk: Delight and lust is like a murderer with drawn sword in two respects: (i) because when greed arises for a specific object it fells one's head, namely, the head of wisdom; and (ii) because it sends one off to rebirth in the womb, and all fears and punishments are rooted in rebirth.",
    "sn35.238:10": "\"‘The empty village’: this is a designation for the six internal sense bases. If, bhikkhus, a wise, competent, intelligent person examines them by way of the eye, they appear to be void, hollow,sn.iv.175empty. If he examines them by way of the ear… by way of the mind, they appear to be void, hollow, empty.",
    "sn35.238:11": "\"‘Village-attacking dacoits’: this is a designation for the six external sense bases. The eye, bhikkhus, is attacked by agreeable and disagreeable forms. The ear … The nose … The tongue … The body … The mind is attacked by agreeable and disagreeable mental phenomena.",
    "sn35.238:12": "\"‘The great expanse of water’: this is a designation for the four floods: the flood of sensuality, the flood of existence, the flood of views, and the flood of ignorance.",
    "sn35.238:13": "\"‘The near shore, which is dangerous and fearful’: this is a designation for identity.[n.182]sakkāya.Spk: \"Identity\" (personal identity) is the five aggregates pertaining to the three planes. Like the near shore with its vipers, etc., \"identity\" is dangerous and fearful because of the four great elements and so forth.",
    "sn35.238:14": "\"‘The further shore, which is safe and free from danger’: this is a designation for Nibbāna.",
    "sn35.238:15": "\"‘The raft’: this is a designation for the Noble Eightfold Path; that is, right view … right concentration.",
    "sn35.238:16": "\"‘Making effort with hands and feet’: this is a designation for the arousing of energy.",
    "sn35.238:17": "\"‘Crossed over, gone beyond, the brahmin stands on high ground’: this is a designation for the arahant.\""
}