{
    "sn35.74:1": "At Sāvatthī. Then a certain bhikkhu approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Venerable sir, in such and such a dwelling there is a certain newly ordained bhikkhu, not well known, who is sick, afflicted, gravely ill. It would be good, venerable sir, if the Blessed One would approach that bhikkhu out of compassion.\"",
    "sn35.74:2": "Then, when the Blessed One heard the words \"newly ordained\" and \"sick,\" and understood that he was not a well-known bhikkhu, he went to him. That bhikkhu saw the Blessed One coming in the distance and stirred on his bed.[n.38]Spk:SamadhosiHe showed his respect by making a movement; for, it is said, even a patient is obliged to show respect to a superior by making a geture of rising. The sequel is also atSN.87.The Blessed One said to him: \"Enough, bhikkhu, do not stir on your bed. There are these seats ready, I will sit down there.\"",
    "sn35.74:3": "\"Venerable sir, I am not bearing up, I am not getting better. Strong painful feelings are increasing in me, not subsiding, and their increase, not their subsiding, is to be discerned.\"",
    "sn35.74:4": "\"I hope then, bhikkhu, that you are not troubled by remorse and regret.\"",
    "sn35.74:5": "\"Indeed, venerable sir, I have quite a lot of remorse and regret.\"sn.iv.47",
    "sn35.74:6": "\"I hope, bhikkhu, that you have nothing for which to reproach yourself in regard to virtue.\"",
    "sn35.74:7": "\"I have nothing, venerable sir, for which to reproach myself in regard to virtue.\"",
    "sn35.74:8": "\"Then, bhikkhu, if you have nothing for which to reproach yourself in regard to virtue, why are you troubled by remorse and regret?\"",
    "sn35.74:9": "\"I understand, venerable sir, that it is not for the sake of purification of virtue that the Dhamma has been taught by the Blessed One.\"",
    "sn35.74:10": "\"If, bhikkhu, you understand that the Dhamma has not been taught by me for the sake of purification of virtue, then for what purpose do you understand the Dhamma to have been taught by me?\"",
    "sn35.74:11": "\"Venerable sir, I understand the Dhamma to have been taught by the Blessed One for the sake of the fading away of lust.\"[n.39]Rāgavirāgatthaṃ.The sense of the expression is almost reiterative, sincevirāgaitself means the absence ofrāgaor lust. But virāga originally meant the removal of colour, and thus the whole expression could be taken to mean the \"fading away\" of the \"colour\" spread by lust.",
    "sn35.74:12–19": "\"Good, good, bhikkhu! It is good that you understand the Dhamma to have been taught by me for the sake of the fading away of lust. For the Dhamma is taught by me for the sake of the fading away of lust.",
    "sn35.74:20": "\"Seeing thus … He understands: ‘ … there is no more for this state of being.’\"",
    "sn35.74:21": "This is what the Blessed One said. Elated, that bhikkhu delighted in the Blessed One's statement. And while this discourse was being spoken, there arose in that bhikkhu the dust-free, stainless vision of the Dhamma: \"Whatever is subject to origination is all subject to cessation.\"[n.40] The arising of the vision of the Dhamma(dhammacakkhu)means the attainment of one of the three lower stages of awakening, usually stream-entry."
}