{
    "sn35.116:1": "\"Bhikkhus, I say that the end of the world cannot be known, seen, or reached by travelling. Yet, bhikkhus, I also say that without reaching the end of the world there is no making an end to suffering.\"[n.96] SeeSN2.26(=AN II 47–49), to which this sutta might be taken as a commentary.",
    "sn35.116:2": "Then they considered: \"The Venerable Ānanda is praised by the Teacher and esteemed by his wise brothers in the holy life; the Venerable Ānanda is capable of expounding in detail the meaning of this synopsis recited in brief by the Blessed One without expounding the meaning in detail. Let us approach him and ask him the meaning of this.\"",
    "sn35.116:3–4": "Then those bhikkhus approached the Venerable Ānanda and exchanged greetings with him, after which they sat down to one side and told him what had taken place,sn.iv.94adding: \"Let the Venerable Ānanda expound it to us.\"",
    "sn35.116:5": "The Venerable Ānanda replied:\"Friends, it is as though a man needing heartwood, seeking heartwood, wandering in search of heartwood, would pass over the root and trunk of a great tree standing possessed of heartwood, thinking that heartwood should be sought among the branches and foliage. And so it is with you venerable ones: when you were face to face with the Teacher you passed by the Blessed One, thinking that I should be asked about the meaning. For, friends, knowing, the Blessed One knows; seeing, he sees; he has become vision, he has become knowledge, he has become the Dhamma, he has become the holy one; he is the expounder, the proclaimer, the elucidator of meaning, the giver of the Deathless, the lord of the Dhamma, the Tathāgata. That was the time when you should have asked the Blessed One the meaning.sn.iv.9As he explained it to you, so you should have remembered it.\"",
    "sn35.116:6": "\"Surely, friend Ānanda, knowing, the Blessed One knows; seeing, he sees; he has become vision … the Tathāgata. That was the time when we should have asked the Blessed One the meaning, and as he explained it to us, so we should have remembered it. Yet the Venerable Ānanda is praised by the Teacher and esteemed by his wise brothers in the holy life; the Venerable Ānanda is capable of expounding the detailed meaning of this synopsis recited in brief by the Blessed One without expounding the meaning in detail. Let the Venerable Ānanda expound it without finding it troublesome.\"",
    "sn35.116:7": "\"Then listen, friends, and attend closely to what I shall say.\"",
    "sn35.116:8": "\"Friends, when the Blessed One rose from his seat and entered his dwelling after reciting a synopsis in brief without expounding the meaning in detail, that is: ‘Bhikkhus, I say that the end of the world cannot be known, seen, or reached by travelling. Yet, bhikkhus, I also say that without reaching the end of the world there is no making an end to suffering,’ I understand the detailed meaning of this synopsis as follows: That in the world by which one is a perceiver of the world, a conceiver of the world—this is called the world in the Noble One's Discipline.[n.9]ena kho āvuso lokasmiṃ lokasaññī hoti lokamānī ayaṃ vuccati ariyassa vinaye loko.On the implications of this, seeSN2.26and I, n.12.And what, friends, is that in the world by which one is a perceiver of the world, a conceiver of the world? The eye is that in the world by which one is a perceiver of the world, a conceiver of the world .[n.99] On the six sense bases as \"the world\" in the sense of disintegrating, seeSN35.2. Here they are called the world because they are the conditions for being a perceiver and a conceiver of the world. We might conjecture that the five physical sense bases are prominent in making one a \"perceiver of the world,\" the mind base in making one a \"conceiver of the world.\" No such distinction, however, is made in the text. The six sense bases are at once part of the world (\"that in the world\") and the media for the manifestation of a world (\"that by which\"). The \"end of the world\" that must be reached to make an end to suffering is Nibbāna, which is called (among other things) the cessation of the six sense bases.The ear … The nose … The tongue … The body … The mind is that in the world by which one is a perceiver of the world, a conceiver of the world. That in the world by which one is a perceiver of the world, a conceiver of the world—this is called the world in the Noble One's Discipline.sn.iv.96",
    "sn35.116:9–10": "\"Yes, friends,\" those bhikkhus replied, and having risen from their seats, they went to the Blessed One. After paying homage to him, they sat down to one side and told the Blessed One all that had taken place after he had left, adding:sn.iv.97\"Then, venerable sir, we approached the Venerable Ānanda and asked him about the meaning. The Venerable Ānanda expounded the meaning to us in these ways, with these terms, with these phrases.\"",
    "sn35.116:11": "\"Ānanda is wise, bhikkhus, Ānanda has great wisdom. If you had asked me the meaning of this, I would have explained it to you in the same way that it has been explained by Ānanda. Such is the meaning of this, and so you should remember it.\""
}