{
    "sn35.32:1": "\"Bhikkhus, I will teach you the way that is suitable for uprooting all conceivings. Listen to that. \"And what, bhikkhus, is the way that is suitable for uprooting all conceivings?",
    "sn35.32:2": "What do you think, bhikkhus, is the eye permanent or impermanent?\"",
    "sn35.32:3": "\"Impermanent, venerable sir.\"",
    "sn35.32:4": "\"Is what is impermanent suffering or happiness?\"sn.iv.25",
    "sn35.32:5": "\"Suffering, venerable sir.\"",
    "sn35.32:6": "\"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\"",
    "sn35.32:7": "\"No, venerable sir.\"",
    "sn35.32:8–21": "\"Are forms permanent or impermanent? … Is eye-consciousness … Is eye-contact … Is any feeling that arises with eye-contact as condition—whether pleasant or painful or neither-painful-nor-pleasant—permanent or impermanent? …",
    "sn35.32:22": "\"Impermanent, venerable sir.\"",
    "sn35.32:23": "\"Is what is impermanent suffering or happiness?\"",
    "sn35.32:24": "\"Suffering, venerable sir.\"",
    "sn35.32:25": "\"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\"",
    "sn35.32:26": "\"No, venerable sir.\"sn.iv.",
    "sn35.32:27": "\"Seeing thus, bhikkhus, the instructed noble disciple experiences revulsion towards the eye, towards forms, towards eye-consciousness, towards eye-contact, towards whatever feeling arises with eye-contact as condition—whether pleasant or painful or neither-painful-nor-pleasant. He experiences revulsion towards the ear … towards the mind … towards whatever feeling arises with mind-contact as condition … . Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated. When it is liberated there comes the knowledge: ‘It's liberated.’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’"
}