{
    "sn35.235:1": "\"Bhikkhus, I will teach you a Dhamma exposition on the theme of burning. Listen to that …",
    "sn35.235:2": "\"It would be better, bhikkhus, for the ear faculty to be lacerated by a sharp iron stake burning, blazing, and glowing, than for one to grasp the sign through the features in a sound cognizable by the ear. For if consciousness should stand tied to gratification in the sign or in the features, and if one should die on that occasion, it is possible that one will go to one of two destinations: hell or the animal realm. Having seen this danger, I speak thus.sn.iv.169",
    "sn35.235:3": "\"It would be better, bhikkhus, for the nose faculty to be lacerated by a sharp nail cutter burning, blazing, and glowing, than for one to grasp the sign through the features in an odour cognizable by the nose. For if consciousness should stand tied to gratification in the sign or in the features, and if one should die on that occasion, it is possible that one will go to one of two destinations: hell or the animal realm. Having seen this danger, I speak thus.",
    "sn35.235:4": "\"It would be better, bhikkhus, for the tongue faculty to be lacerated by a sharp razor burning, blazing, and glowing, than for one to grasp the sign through the features in a taste cognizable by the tongue. For if consciousness should stand tied to gratification in the sign or in the features, and if one should die on that occasion, it is possible that one will go to one of two destinations: hell or the animal realm. Having seen this danger, I speak thus.",
    "sn35.235:5": "\"It would be better, bhikkhus, for the body faculty to be lacerated by a sharp spear burning, blazing, and glowing, than for one to grasp the sign through the features in a tactile object cognizable by the body. For if consciousness should stand tied to gratification in the sign or in the features, and if one should die on that occasion, it is possible that one will go to one of two destinations: hell or the animal realm. Having seen this danger, I speak thus.",
    "sn35.235:6": "\"It would be better, bhikkhus, to sleep—for sleep, I say, is barren for the living, fruitless for the living, insensibility for the living—than to think such thoughts as would induce one who has come under their control to bring about a schism in the Saṅgha.sn.iv.170Having seen this danger, I speak thus.[n.171] Maliciously creating a schism in the Saṅgha is one of the five crimes with immediate retribution(ānantarikakamma)said to bring about rebirth in hell in the next existence; seeIt 18-19andKhandaka 17(Vin II 198, 204–5).I read the last sentence with Se:imaṁ khvahaṁ bhikkhave ādı̄navaṃ disvā evaṃ vadāmi.Be and Ee (following a Burmese ms) readimaṃ khvāhaṃ bhikkhave vañjaṃ jı̄vitānaṃ ādı̄navaṃ disvā,which seems unintelligible.",
    "sn35.235:7": "\"In regard to this, bhikkhus, the instructed noble disciple reflects thus: ‘Leave off lacerating the eye faculty with a red-hot iron pin burning, blazing, and glowing. Let me attend only to this: So the eye is impermanent, forms are impermanent, eye-consciousness is impermanent, eye-contact is impermanent, whatever feeling arises with eye-contact as condition—whether pleasant or painful or neither-painful-nor-pleasant—that too is impermanent.",
    "sn35.235:8": "\"‘Leave off lacerating the ear faculty with a sharp iron stake burning, blazing, and glowing. Let me attend only to this: So the ear is impermanent, sounds are impermanent, ear-consciousness is impermanent, ear-contact is impermanent, whatever feeling arises with ear-contact as condition … that too is impermanent.",
    "sn35.235:9": "\"‘Leave off lacerating the nose faculty with a sharp nail cutter burning, blazing, and glowing. Let me attend only to this: So the nose is impermanent, odours are impermanent, nose-consciousness is impermanent, nose-contact is impermanent, whatever feeling arises with nose-contact as condition … that too is impermanent.",
    "sn35.235:10": "\"‘Leave off lacerating the tongue faculty with a sharp razor burning, blazing, and glowing. Let me attend only to this: So the tongue is impermanent, tastes are impermanent, tongue-consciousness is impermanent, tongue-contact is impermanent, whatever feeling arises with tongue-contact as condition … that too is impermanent.",
    "sn35.235:11": "\"‘Leave off lacerating the body faculty with a sharp spear burning, blazing, and glowing. Let me attend only to this: So the body is impermanent,sn.iv.171tactile objects are impermanent, body-consciousness is impermanent, body-contact is impermanent, whatever feeling arises with body-contact as condition … that too is impermanent.",
    "sn35.235:12": "\"‘Leave off sleeping. Let me attend only to this: So the mind is impermanent, mental phenomena are impermanent, mind-consciousness is impermanent, mind-contact is impermanent, whatever feeling arises with mind-contact as condition … that too is impermanent.’",
    "sn35.235:13": "\"Seeing thus, bhikkhus, the instructed noble disciple experiences revulsion towards the eye, forms, eye-consciousness, eye-contact, and whatever feeling arises with eye-contact as condition—whether pleasant or painful or neither-painful-nor-pleasant … towards the mind, mental phenomena, mind-consciousness, mind-contact, and whatever feeling arises with mind-contact as condition … . Experiencing revulsion, he becomes dispassionate. Through dispassionhis mindis liberated. When it is liberated there comes the knowledge: ‘It's liberated.’ He understands: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’"
}