{
    "sn36.31:1": "\"Bhikkhus, there is carnal rapture, there is spiritual rapture, there is rapture more spiritual than the spiritual. There is carnal happiness, there is spiritual happiness, there is happiness more spiritual than the spiritual. There is carnal equanimity, there is spiritual equanimity, there is equanimity more spiritual than the spiritual. There is carnal deliverance, there is spiritual deliverance, there is deliverance more spiritual than the spiritual.",
    "sn36.31:2": "\"And what, bhikkhus, is spiritual rapture? Here, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna, which is accompanied by thought and examination, with rapture and happiness born of seclusion. With the subsiding of thought and examination, he enters and dwells in the second jhāna, which has internal confidence and unification of mind, is without thought and examination, and has rapture and happiness born of concentration. This is called spiritual rapture.",
    "sn36.31:3": "\"And what, bhikkhus, is rapture more spiritual than the spiritual? When a bhikkhu whose taints are destroyed reviews his mind liberated from lust, liberated from hatred, liberated from delusion, there arises rapture. This is called rapture more spiritual than the spiritual.[n.260]Nirāmisā nirāmisatarā pı̄ti.Spk: More spiritual than the spiritual rapture of the jhānas.",
    "sn36.31:4": "\"And what, bhikkhus, is carnal happiness? There are, bhikkhus, these five cords of sensual pleasure. What five? Forms cognizable by the eye … tactile objects cognizable by the body that are desirable, lovely, agreeable, pleasing, sensually enticing, tantalizing. These are the five cords of sensual pleasure. The happiness that arises in dependence on these five cords of sensual pleasure: this is called carnal happiness.",
    "sn36.31:5": "\"And what, bhikkhus, is spiritual happiness? Here, bhikkhus, secluded from sensual pleasures … a bhikkhu enters and dwells in the first jhāna … the second jhāna … . With the fading away as well of rapture, he dwells equanimous and, mindful and clearly comprehending, he experiences happiness with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ This is called spiritual happiness.",
    "sn36.31:6": "\"And what, bhikkhus, is happiness more spiritual than the spiritual? When a bhikkhu whose taints are destroyed reviews his mind liberated from lust, liberated from hatred,sn.iv.237liberated from delusion, there arises happiness. This is called happiness more spiritual than the spiritual.",
    "sn36.31:7": "\"And what, bhikkhus, is carnal equanimity? There are, bhikkhus, these five cords of sensual pleasure. What five? Forms cognizable by the eye … tactile objects cognizable by the body that are desirable, lovely, agreeable, pleasing, sensually enticing, tantalizing. These are the five cords of sensual pleasure. The equanimity that arises in dependence on these five cords of sensual pleasure: this is called carnal equanimity.",
    "sn36.31:8": "\"And what, bhikkhus, is spiritual equanimity? With the abandoning of pleasure and pain, and with the previous passing away of joy and displeasure, a bhikkhu enters and dwells in the fourth jhāna, which is neither painful nor pleasant and includes the purification of mindfulness by equanimity.",
    "sn36.31:9": "\"And what, bhikkhus, is equanimity more spiritual than the spiritual? When a bhikkhu whose taints are destroyed reviews his mind liberated from lust, liberated from hatred, liberated from delusion, there arises equanimity. This is called equanimity more spiritual than the spiritual.",
    "sn36.31:10": "\"And what, bhikkhus, is carnal deliverance? Deliverance connected with the form sphere is carnal deliverance.",
    "sn36.31:11": "\"And what, bhikkhus, is spiritual deliverance? Deliverance connected with the formless sphere is spiritual deliverance.[n.261] Having called the rapture, etc., of the jhānas spiritual (lit. \"noncarnal\") rapture, etc., it seems contradictory for the text to say that the form-sphere deliverance is carnal.Spkexplains that form-sphere deliverance is called carnal because its object is a carnal form(rūpāmisavasen’eva sāmiso nāma).",
    "sn36.31:12": "\"And what, bhikkhus, is deliverance more spiritual than the spiritual? When a bhikkhu whose taints are destroyed reviews his mind liberated from lust, liberated from hatred, liberated from delusion, there arises deliverance. This is called deliverance more spiritual than the spiritual.\""
}