{
    "sn36.19:1": "Then the carpenter Pañcakanga approached the Venerable Udayī, paid homage to him, sat down to one side, and asked him: \"Venerable Udayī, how many kinds of feelings have been spoken of by the Blessed One?\"[n.245] This sutta is also atMN No. 59, entitled the Bahuvedanīya Sutta.",
    "sn36.19:2–3": "A second timesn.iv.224and a third time the Venerable Udayī stated his position, and a second time and a third time the carpenter Pañcakanga stated his, but the Venerable Udayī could not convince the carpenter Pañcakanga nor could the carpenter Pañcakanga convince the Venerable Udayī.",
    "sn36.19:4": "Then he approached the Blessed One, paid homage to him, sat down to one side, and reported to the Blessed One the entire conversation.The Blessed One said:",
    "sn36.19:5": "\"Ānanda, it was a true method of exposition that the carpenter Pañcakanga would not approve of from the bhikkhu Udayī, and it was a true method of exposition that the bhikkhu Udayī would not approve of from the carpenter Pañcakanga. I have spoken of two kinds of feelings byonemethod of exposition; I have spoken of three kinds of feelings byanothermethod of exposition; I have spoken of five kinds of feelings … six kinds of feelings … eighteen kinds of feelings … thirty-six kinds of feelings byanothermethod of exposition;sn.iv.22and I have spoken of one hundred and eight kinds of feelings bystill anothermethod of exposition. Thus, Ānanda, the Dhamma has been taught by me throughdifferentmethods of exposition.[n.246] All are explained atSN36.22.",
    "sn36.19:6": "\"Ānanda, there are these five cords of sensual pleasure. What five? Forms cognizable by the eye that are desirable, lovely, agreeable, pleasing, sensually enticing, tantalizing. Sounds cognizable by the ear … Odours cognizable by the nose … Tastes cognizable by the tongue … Tactile objects cognizable by the body that are desirable, lovely, agreeable, pleasing, sensually enticing, tantalizing. These are the five cords of sensual pleasure. The pleasure and joy that arise in dependence on these five cords of sensual pleasure: this is called sensual pleasure.",
    "sn36.19:7": "\"Though some may say, ‘This is the supreme pleasure and joy that beings experience,’ I would not concede this to them. Why is that? Because there is another kind of happiness more excellent and sublime than that happiness. And what is that other kind of happiness? Here, Ānanda, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna, which is accompanied by thought and examination, with rapture and happiness born of seclusion. This is that other kind of happiness more excellent and sublime than the previous kind of happiness.sn.iv.226",
    "sn36.19:8": "\"Though some may say, ‘This is the supreme pleasure and joy that beings experience,’ I would not concede this to them. Why is that? Because there is another kind of happiness more excellent and sublime than that happiness. And what is that other kind of happiness? Here, Ānanda, with the subsiding of thought and examination, a bhikkhu enters and dwells in the second jhāna, which has internal confidence and unification of mind, is without thought and examination, and has rapture and happiness born of concentration. This is that other kind of happiness more excellent and sublime than the previous kind of happiness.",
    "sn36.19:9": "\"Though some may say, ‘This is the supreme pleasure and joy that beings experience,’ I would not concede this to them. Why is that? Because there is another kind of happiness more excellent and sublime than that happiness. And what is that other kind of happiness? Here, Ānanda, with the fading away as well of rapture, a bhikkhu dwells equanimous and, mindful and clearly comprehending, he experiences happiness with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ This is that other kind of happiness more excellent and sublime than the previous kind of happiness.",
    "sn36.19:10": "\"Though some may say, ‘This is the supreme pleasure and joy that beings experience,’ I would not concede this to them. Why is that? Because there is another kind of happiness more excellent and sublime than that happiness. And what is that other kind of happiness? Here, Ānanda, with the abandoning of pleasure and pain, and with the previous passing away of joy and displeasure, a bhikkhu enters and dwells in the fourth jhāna, which is neither painful nor pleasant and includes the purification of mindfulness by equanimity. This is that other kind of happiness more excellent and sublime than the previous kind of happiness.[n.247]Spk: From the fourth jhāna up, there is neither-painful-nor-pleasant feeling, called pleasure (or happiness) in the sense that it is peaceful and sublime.",
    "sn36.19:11": "\"Though some may say, ‘This is the supreme pleasure and joy that beings experience,’ I would not concede this to them.sn.iv.227Why is that? Because there is another kind of happiness more excellent and sublime than that happiness. And what is that other kind of happiness? Here, Ānanda, with the complete transcendence of perceptions of forms, with the passing away of perceptions of sensory impingement, with nonattention to perceptions of diversity, aware that ‘space is infinite,’ a bhikkhu enters and dwells in the base of the infinity of space. This is that other kind of happiness more excellent and sublime than the previous kind of happiness.",
    "sn36.19:12": "\"Though some may say, ‘This is the supreme pleasure and joy that beings experience,’ I would not concede this to them. Why is that? Because there is another kind of happiness more excellent and sublime than that happiness. And what is that other kind of happiness? Here, Ānanda, by completely transcending the base of the infinity of space, aware that ‘consciousness is infinite,’ a bhikkhu enters and dwells in the base of the infinity of consciousness. This is that other kind of happiness more excellent and sublime than the previous kind of happiness.",
    "sn36.19:13": "\"Though some may say, ‘This is the supreme pleasure and joy that beings experience,’ I would not concede this to them. Why is that? Because there is another kind of happiness more excellent and sublime than that happiness. And what is that other kind of happiness? Here, Ānanda, by completely transcending the base of the infinity of consciousness, aware that ‘there is nothing,’ a bhikkhu enters and dwells in the base of nothingness. Thissn.iv.228is that other kind of happiness more excellent and sublime than the previous kind of happiness.",
    "sn36.19:14": "\"Though some may say, ‘This is the supreme pleasure and joy that beings experience,’ I would not concede this to them. Why is that? Because there is another kind of happiness more excellent and sublime than that happiness. And what is that other kind of happiness? Here, Ānanda, by completely transcending the base of nothingness, a bhikkhu enters and dwells in the base of neither-perception-nor-nonperception. This is that other kind of happiness more excellent and sublime than the previous kind of happiness.",
    "sn36.19:15": "\"Though some may say, ‘This is the supreme pleasure and joy that beings experience,’ I would not concede this to them. Why is that? Because there is another kind of happiness more excellent and sublime than that happiness. And what is that other kind of happiness? Here, Ānanda, by completely transcending the base of neither-perception-nor-nonperception, a bhikkhu enters and dwells in the cessation of perception and feeling. This is that other kind of happiness more excellent and sublime than the previous kind of happiness.[n.248]Spk: Cessation is called happiness in the sense that it is unfelt happiness (avedayitasukha,the happiness of nonfeeling). Thus felt happiness(vedayitasukha)arises by way of the cords of sensual pleasure and the eight meditative attainments, while cessation is called unfelt happiness. Whether it is felt or not, it is exclusively happiness in that happiness consists in the absence of suffering(niddukkhabhāva).",
    "sn36.19:16": "\"Now it is possible, Ānanda, that wanderers of other sects might speak thus: ‘The ascetic Gotama speaks of the cessation of perception and feeling, and he maintains that it is included in happiness. What is that? How is that?’ When wanderers of other sects speak thus, Ānanda, they should be told: ‘The Blessed One, friends, does not describe a state as included in happiness only with reference to pleasant feeling. But rather, friends, wherever happiness is found and in whatever way, the Tathāgata describes that as included in happiness.’\"[n.249] I read:Yattha yattha āvuso sukhaṃ upalabbhati yamhi yamhi, taṃ taṃ tathāgato sukhasmiṃ paññāpeti.Spk: Whether felt happiness or unfelt happiness is found, the Tathāgata describes whatever is without suffering as happiness."
}