{
    "sn36.21:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Then the wanderer Moḷiyasīvaka approached the Blessed One and exchanged greetings with him.[n.250]Spk: His name was Sīvaka, but because he had a topknot(cūḷā)he was called Moḷiyasīvaka (moḷiormolibeing another word for topknot).When they had concluded their greetings and cordial talk, he sat down to one side and said to the Blessed One:",
    "sn36.21:2": "\"Some feelings, Sīvaka, arise here originating from bile disorders: that some feelings arise here originating from bile disorders one can know for oneself, and that is considered to be true in the world. Now when those ascetics and brahmins hold such a doctrine and view as this, ‘Whatever a person experiences, whether it be pleasant or painful or neither-painful-nor-pleasant, all that is caused by what was done in the past,’ they overshoot what one knows by oneself and they overshoot what is considered to be true in the world. Therefore I say that this is wrong on the part of those ascetics and brahmins.[n.5] In the argument,vedanāis being used in the narrower sense of painful feeling. Bile(pitta), phlegm(semha), and wind(vīta)are the three bodily humours(dosa)of Indian Ayurveda medicine. It should be noted that the Buddha’s appeal to personal experience and common sense as the two criteria for rejecting the view that all feeling is caused by past kamma implies that the view against which he is arguing is the claim that past kamma is the sole and sufficient cause of all present feeling. However, the Buddha’s line of argument also implies that he is not denying kamma may induce the illnesses, etc., that serve as the immediate causes of the painful feelings; for this level of causality is not immediately perceptible to those who lack supernormal cognitive faculties. Thus kamma can still be an indirect cause for the painful feeling directly induced by the first seven causes. It is the sufficient cause only in the eighth case, though even then it must operate in conjunction with various other conditions.",
    "sn36.21:3": "\"Some feelings, Sīvaka, arise here originating from phlegm disorders … originating from wind disorders … originating from an imbalanceof the three… produced by change of climate … produced by careless behaviour … caused by assault …sn.iv.21produced as the result of kamma: that some feelings arise here produced as the result of kamma one can know for oneself, and that is considered to be true in the world.[n.25] I have translatedsannipātikāni, visamaparihārajāni,andopakkamikāniin accordance with the explanations given bySpk. Onkammavipākajāni vedayitāni,Spk says that these are produced solely(kevalaṁ)as a result of kamma. Feelings arisen directly from the other seven causes are not \"feelings produced by kamma,\" even though kamma may function as an underlying cause of the illness, etc., responsible for the painful feelings. According to the Abhidhamma, all bodily painful feeling is the result of kamma(kammavipāka), but it is not necessarily produced exclusively by kamma; kamma usually operates through more tangible networks of causality to yield its result.Spk says that this sutta is spoken from the standpoint of worldly convention(lokavohāra), on which Spk-pṭ comments: \"Because it is generally accepted in the world that (feelings) originate from bile and so forth. Granted, feelings based on the physical body are actually produced by kamma, but this worldly convention is arrived at by way of the present condition(paccuppannapaccayavasena). Accepting what is said, the opponent's doctrine is refuted.\"Now when those ascetics and brahmins hold such a doctrine and view as this, ‘Whatever a person experiences, whether it be pleasant or painful or neither-painful-nor-pleasant, all that is caused by what was done in the past,’ they overshoot what one knows by oneself and they overshoot what is considered to be true in the world. Therefore I say that this is wrong on the part of those ascetics and brahmins.\"",
    "sn36.21:4": "When this was said, the wanderer Moḷiyasīvaka said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! … From today let Master Gotama remember me as a lay follower who has gone for refuge for life.\"",
    "sn36.21:5": "Bile, phlegm, and also wind,Imbalance and climate too,Carelessness and assault,With kamma result as the eighth."
}