{
    "sn36.7:1": "On one occasion the Blessed One was dwelling at Vesalī in the Great Wood in the Hall with the Peaked Roof. Then, in the evening, the Blessed One emerged from seclusion and went to the sick ward,[n.237]Spk: He went so that the bhikkhus, seeing the Tathāgata, the foremost person in the world, attending on the sick, would think, \"We too should attend on the sick.\" He also went to explain a meditation subject to those who needed one.where he sat down in the appointed seat and addressed the bhikkhus thus:sn.iv.2",
    "sn36.7:2": "\"Bhikkhus, a bhikkhu should await his time mindful and clearly comprehending. This is our instruction to you.",
    "sn36.7:3": "\"And how, bhikkhus, is a bhikkhu mindful? Here, bhikkhus, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, mindful, having put away covetousness and displeasure in regard to the world. He dwells contemplating feelings in feelings … mind in mind … phenomena in phenomena, ardent, clearly comprehending, mindful, having put away covetousness and displeasure in regard to the world. It is in such a way that a bhikkhu is mindful.",
    "sn36.7:4": "\"And how, bhikkhus, does a bhikkhu exercise clear comprehension? Here, bhikkhus, a bhikkhu is one who acts with clear comprehension when going forward and returning; when looking ahead and looking aside; when drawing in and extending the limbs; when wearing his robes and carrying his outer robe and bowl; when eating, drinking, chewing his food, and tasting; when defecating and urinating; when walking, standing, sitting, falling asleep, waking up, speaking, and keeping silent. It is in such a way that a bhikkhu exercises clear comprehension.",
    "sn36.7:5": "\"Bhikkhus, while a bhikkhu dwells thus, mindful and clearly comprehending, diligent, ardent, and resolute, if there arises in him a pleasant feeling, he understands thus: ‘There has arisen in me a pleasant feeling. Now that is dependent, not independent. Dependent on what? Dependent on this very body. But this body is impermanent, conditioned, dependently arisen. So when the pleasant feeling has arisen in dependence on a body that is impermanent, conditioned, dependently arisen, how could it be permanent?’ He dwells contemplating impermanence in the body and in pleasant feeling, he dwells contemplating vanishing, contemplating fading away, contemplating cessation, contemplating relinquishment.[n.238]Spk: At this point, what has been shown? This bhikkhu's way of arrival [Spk-pṭ: the preliminary practice(pubbabhāgapaṭipadā)that is the cause for arrival at the noble path]. For the establishments of mindfulness are only preliminary, and in regard to clear comprehension the contemplations of impermanence, vanishing, and fading away are also only preliminary. These two—contemplation of cessation and of relinquishment—are mixed (Spk-pṭ: mundane and supramundane). At this point, the time of the bhikkhu's development (in meditation) is shown.As he dwells thus,sn.iv.212the underlying tendency to lust in regard to the body and in regard to pleasant feeling is abandoned by him.",
    "sn36.7:6": "\"Bhikkhus, while a bhikkhu dwells thus, mindful and clearly comprehending, diligent, ardent, and resolute, if there arises in him a painful feeling, he understands thus: ‘There has arisen in me a painful feeling. Now that is dependent, not independent. Dependent on what? Dependent on just this body. But this body is impermanent, conditioned, dependently arisen. So when the painful feeling has arisen in dependence on a body that is impermanent, conditioned, dependently arisen, how could it be permanent? ’ He dwells contemplating impermanence in the body and in painful feeling, he dwells contemplating vanishing, contemplating fading away, contemplating cessation, contemplating relinquishment. As he dwells thus, the underlying tendency to aversion in regard to the body and in regard to painful feeling is abandoned by him.",
    "sn36.7:7": "\"Bhikkhus, while a bhikkhu dwells thus, mindful and clearly comprehending, diligent, ardent, and resolute, if there arises in him a neither-painful-nor-pleasant feeling, he understands thus: ‘There has arisen in me a neither-painful-nor-pleasant feeling. Now that is dependent, not independent. Dependent on what? Dependent on just this body. But this body is impermanent, conditioned, dependently arisen. So when the neither-painful-nor-pleasant feeling has arisen in dependence on a body that is impermanent, conditioned, dependently arisen, how could it be permanent?’ He dwells contemplating impermanence in the body and in neither-painful-nor-pleasant feeling, he dwells contemplating vanishing, contemplating fading away, contemplating cessation, contemplating relinquishment. As he dwells thus, the underlying tendency to ignorance in regard to the body and in regard to neither-painful-nor-pleasant feeling is abandoned by him.sn.iv.213",
    "sn36.7:8": "\"If he feels a pleasant feeling,[n.239] From here to the end also atSN12.51(but with a different simile) and also atSN22.andSN54.(with the same simile).he understands: ‘It is impermanent’; he understands: ‘It is not held to’; he understands: ‘It is not delighted in.’ If he feels a painful feeling, he understands: ‘It is impermanent’; he understands: ‘It is not held to’; he understands: ‘It is not delighted in.’ If he feels a neither-painful-nor-pleasant feeling, he understands: ‘It is impermanent’; he understands: ‘It is not held to’; he understands: ‘It is not delighted in.’",
    "sn36.7:9": "\"Just as, bhikkhus, an oil lamp burns in dependence on the oil and the wick, and with the exhaustion of the oil and the wick it is extinguished through lack of fuel, so too, bhikkhus, when a bhikkhu feels a feeling terminating with the body … terminating with life … He understands: ‘With the breakup of the body, following the exhaustion of life, all that is felt, not being delighted in, will become cool right here.’\""
}