{
    "sn4.23:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Now on that occasion the Venerable Godhika was dwelling on the Black Rock on the Isigili Slope. Then, while the Venerable Godhika was dwelling diligent, ardent, and resolute, he reached temporary liberation of mind, but he fell away from that temporary liberation of mind.[n.308] The story of Godhika is told at Dhp-a I 43–33; see BL 2:90–9.Spkexplainssamayika cetovimutti,\"temporary liberation of mind,\" as the mundane meditative attainments(lokiya-samāpatti), i.e., the jhānas and formless attainments, so called because at the moments of absorption the mind is liberated from the opposing states and is resolved upon its object. He fell away from this liberation of mind on account of illness. Being disposed to chronic illness due to winds, bile, and phlegm (the \"three humours\" of traditional Indian medicine), he could not fulfil the states conducive to concentration. Each time he entered upon an attainment, he soon fell away from it.A second time, while the Venerable Godhika was dwelling diligent, ardent, and resolute, he reached temporary liberation of mind, but he fell away from that temporary liberation of mind. A third time … A fourth time …sn.i.2A fifth time … A sixth time, while the Venerable Godhika was dwelling diligent, ardent, and resolute, he reached temporary liberation of mind, but he fell away from that temporary liberation of mind. A seventh time, while the Venerable Godhika was dwelling diligent, ardent, and resolute, he reached temporary liberation of mind.",
    "sn4.23:2": "Then it occurred to the Venerable Godhika: \"Six times already I have fallen away from temporary liberation of mind. Let me use the knife.\"[n.309]Sattham ahareyyam.A euphemistic expression for suicide; seeSN.87(III 13,10,6),SN35.87(IV 57,6), andSN54.9(V 30,4–5).Spk: He reflected thus: \"Since the destination after death of one who has fallen away from jhāna is uncertain, while one who has not fallen away is certain of rebirth in the brahma world, let me use the knife.\" On the Buddha’s own attitude towards suicide, seeSN35.87(IV 60,1–5).",
    "sn4.23:3": "v.496\"Having conquered the army of Death,Not returning to renewed existence,Having drawn out craving with its root,Godhika has attained final Nibbāna.\"",
    "sn4.23:4": "v.91\"O great hero who has vanquished death,Your disciple is longing for death.He intendsto take his own life:Restrain him from this, O luminous one!",
    "sn4.23:5": "v.492\"How, O Blessed One, can your disciple—One delighting in the Teaching,A trainee seeking his mind's ideal—Take his own life, O widely famed?\"[n.311]Spk:Jane suta ti jane vissuta;lit. \"heard among the people = famed among the people,\" i.e., widely famed. There is a delicious irony, in the above three verses, in the way Māra—who usually addresses the Buddha discourteously as \"ascetic\"—here showers him with glowing epithets.",
    "sn4.23:6": "Now on that occasion the Venerable Godhika had just used the knife.[n.312]Spk: The elder, thinking, \"What is the use of living?\" lay down and slit his jugular vein with a knife. Painful feelings arose. He suppressed them, comprehended the pains (with insight), set up mindfulness, explored his meditation subject, and attained arahantship as a \"same-header\"(samasisi;see Pp 13,25–27, commented on at Pp-a 18–87). He was ajīvitasamasisi,one who attains the destruction of defilements and the end of life simultaneously. (Another kind ofsamasisirecovers from a grave illness at the same time that he attains arahantship.)Then the Blessed One, having understood, \"This is Māra the Evil One,\" addressed him in verse:",
    "sn4.23:7": "v.493\"Such indeed is how the steadfast act:They are not attached to life.Having drawn out craving with its root,Godhika has attained final Nibbāna.\"",
    "sn4.23:8": "Then the Blessed One addressed the bhikkhus thus: \"Come, bhikkhus, let us go to the Black Rock on the Isigili Slope, where the clansman Godhika has used the knife.\"\"Yes, venerable sir,\" those bhikkhus replied.",
    "sn4.23:9": "Then the Blessed One, together with a number of bhikkhus, went to the Black Rock on the Isigili Slope. The Blessed One saw in the distance the Venerable Godhika lying on the bed with his shoulder turned.[n.313]Spk:Vivattakkhandhan ti parivattakkhandham;\"with his shoulder turned\" means with twisted shoulder. He had been lying on his back when he took the knife, but because he was accustomed to lying on his right side, he had turned his head towards the right and had so remained.sn.i.122Now on that occasion a cloud of smoke, a swirl of darkness, was moving to the east, then to the west, to the north, to the south, upwards, downwards, and to the intermediate quarters.",
    "sn4.23:10": "The Blessed One then addressed the bhikkhus thus: \"Do you see, bhikkhus, that cloud of smoke, that swirl of darkness, moving to the east, then to the west, to the north, to the south, upwards, downwards, and to the intermediate quarters?\"",
    "sn4.23:11": "v.494\"Above, below, and across,In the four quarters and in between,I have been searching but do not findWhere Godhika has gone.\"",
    "sn4.23:12": "v.495\"That steadfast man was resolute,A meditator always rejoicing in meditation,Applying himself day and nightWithout attachment even to life.",
    "sn4.23:14": "v.497So much was he stricken with sorrowThat his lute dropped from his armpit.Thereupon that disappointed spiritDisappeared right on the spot.[n.315] The verse (which must have been added by the redactors) occurs atSn 449,where, however, it follows the verses that correspond to vv.504–5. In the verse Māra is spoken of as yakkha."
}