{
    "sn4.25:1": "Then Māra the Evil One, having spoken these verses of disappointment in the presence of the Blessed One, went away from that spot and sat down cross-legged on the ground not far from the Blessed One, silent, dismayed, with his shoulders drooping, downcast, brooding, unable to speak, scratching the ground with a stick.[n.32] This passage, as far as \"unable to speak,\" is the stock description of the defeated contestant; also atMN I 32,28–30,234,–2,258,28–30. Se and Ee make this paragraph the last of the preceding sutta, but I follow Be and Ee2. As the two suttas form a single narrative, the division between them is arbitrary.",
    "sn4.25:2": "v.506\"Why are you despondent, father?Who's the man for whom you grieve?We’ll catch him with the snare of lustAs they catch the forest elephant.We’ll bind him tightly and bring him back,And he’ll be under your control.\"[n.33]Spk's explanation shows that there is more to the simile than meets the eye: \"They capture an elephant and lead him out of the forest by sending a female decoy, who entices him by displaying her feminine wiles.\"",
    "sn4.25:3": "v.507–8\"The Arahant, the Fortunate One in the world,Is not easily drawn by means of lust.He has gone beyond Māra's realm:Therefore I sorrow so bitterly.\"",
    "sn4.25:4": "Then Māra's daughters—Taṇha, Arati, and rāga—approached the Blessed One and said to him: \"We serve at your feet, ascetic.\" But the Blessed One paid no attention, as he was liberated in the unsurpassed extinction of acquisitions.[n.32] On the idiompade te samaṇa paricarema,Geiger remarks: \"In courteous speech one usespada,feet, for the person. The meaning is: ‘We want to be at your command like slave-women’\" (GermTr, p. 193, n. 5). A sexual innuendo is unmistakable.Spk, strangely, does not offer any explanation here ofanuttare upadhisaṅkhaye vimutto,but see n.356.",
    "sn4.25:5": "Then Māra's daughters—Taṇha, Arati, and rāga—went off to the side and took counsel: \"Men's tastes are diverse. Suppose we each manifest ourselves in the form of a hundred maidens.\"sn.i.12Then Māra's three daughters, each manifesting herself in the form of a hundred maidens, approached the Blessed One and said to him: \"We serve at your feet, ascetic.\" But the Blessed One paid no attention, as he was liberated in the unsurpassed extinction of acquisitions.",
    "sn4.25:6–8": "Then Māra's daughters went off to the side and again took counsel: \"Men's tastes are diverse. Suppose we each manifest ourselves in the form of a hundred women who have never given birth.\" Then Māra's three daughters, each manifesting herself in the form of a hundred women who have never given birth … in the form of a hundred women who have given birth once … … in the form of a hundred women who have given birth twice … in the form of a hundred women of middle age … in the form of a hundred old women, approached the Blessed One and said to him: \"We serve at your feet, ascetic.\" But the Blessed One paid no attention, as he was liberated in the unsurpassed extinction of acquisitions.",
    "sn4.25:9": "Then Māra's daughters—Taṇha, Arati, and rāga—went off to the side and said: \"What our father told us is true:",
    "sn4.25:10": "\"‘The Arahant, the Fortunate One in the world …Therefore I sorrow so bitterly.’",
    "sn4.25:11": "\"If we had assailed with such tactics any ascetic or brahmin who was not devoid of lust, either his heart would have burst, or he would have vomited hot blood from his mouth,sn.i.126or he would have gone mad or become mentally deranged; or else he would have dried up and withered away and become shrivelled, just as a green reed that has been mowed down would dry up and wither away and become shrivelled.\"",
    "sn4.25:12": "Then Māra's daughters—Taṇha, Arati, and rāga—approached the Blessed One and stood to one side. Standing to one side, Māra's daughter Taṇha addressed the Blessed One in verse:",
    "sn4.25:13": "v.509\"Is it because you are sunk in sorrowThat you meditate in the woods?Because you’ve lost wealth or pine for it,Or committed some crime in the village?Why don’t you make friends with people?Why don’t you form any intimate ties?\"",
    "sn4.25:14": "v.510\"Having conquered the army of the pleasant and agreeable,Meditating alone, I discovered bliss,The attainment of the goal, the peace of the heart.[n.325]Spkglossessenam as kilesasenam,\"the army of defilements,\" and paraphrases: \"Having conquered the army of the pleasant and agreeable, meditating alone, I discovered the bliss of arahantship, which is called ‘the attainment of the goal, the peace of the heart’(atthassa pattim hadayassa santim).\" Mahakaccana provides a long commentary on this verse atAN V 47,3–48,4. Onpiyarūpam satarūpam,\"the pleasant and agreeable,\" seeSN12.66(II 109–12),DN II 308–11.Therefore I don’t make friends with people,Nor will I form any intimate ties.\"",
    "sn4.25:15": "Then Māra's daughter Arati addressed the Blessed One in verse:",
    "sn4.25:16": "v.511\"How does a bhikkhu here often dwellThat, five floods crossed, he here has crossed the sixth?How does he meditate so sensual perceptionsAre kept at bay and fail to grip him?\"[n.326] Both the BHS version of these verses (at Mvu III 283–84) and the Skt (cited at Ybhūś 4:1–3; Enomoto, CSCS, pp. 25–26) have the present tensetaratiin pāda b, as against the aoristatariin the Pali; while the present makes better sense, I translate following the Pali.Spk: Five floods crossed(pañcoghatiṇṇo): one who has crossed the flood of defilements in the five sense doors. The sixth: he has crossed the sixth flood of defilements, that pertaining to the mind door. Or alternatively: by the mention of five floods, the five lower fetters are meant; by the sixth, the five higher fetters.",
    "sn4.25:17": "v.512\"Tranquil in body, in mind well liberated,Not generating, mindful, homeless,Knowing Dhamma, meditating thought-free,He does not erupt, or drift, or stiffen.[n.327]Spk: Tranquil in body(passaddhikayo): this comes about with the tranquillizing of the in-and-out breathing by the fourth jhāna (seeAN II 41,21–28). In mind well liberated(suvimuttacitto): well liberated by the liberation of the fruit of arahantship. Not generating(asaṅkhārano): not generating the three types of volitional formations (seeSN12.51; also n.165). Meditating thought-free in the fourth jhāna. He does not erupt, etc.: He does not erupt(na kuppati)because of hatred, or drift(sarati)because of lust, or stiffen(na thino)because of delusion. Or alternatively: by the first term the hindrance of ill will is intended; by the second, the hindrance of sensual desire; by the third, the remaining hindrances (seeSN46.2).",
    "sn4.25:18": "v.513\"When a bhikkhu here often dwells thus,With five floods crossed, he here has crossed the sixth.When he meditates thus, sensual perceptionsAre kept at bay and fail to grip him.\"sn.i.127",
    "sn4.25:19": "Then Māra's daughter rāga addressed the Blessed One in verse:",
    "sn4.25:20": "v.514\"He has cut off craving, faring with his group and order;Surely many other beings will cross.Alas, this homeless one will snatch many peopleAnd lead them away beyond the King of Death.\"[n.328] in pāda a, I readacchejjiwith Se, an aorist ofchindati,to cut. The finite verb seems to me preferable to the absolutiveacchejjaof Be and Ee1 & 2; the variantacchecchisuggested by PED may also be acceptable. This verb should be distinguished fromacchejja(oracchijja,Ee1) in pāda d, an absolutive ofacchindati,to rob, to snatch away. The Be and Ee1 reading of pāda a may have arisen through a confusion of the two forms. I read pāda b:addha tarissanti bahū ca satta.Be, Ee2, and SS read the last word assaddhā,but the gloss inSpksupportssatta: addha aññe pi bahujana ekamsena tarissanti.The BHT version of Mvu is too different to be of help and may be corrupt, but Jones (at SN3.273, n. 4) suggests replacingraktawithsattva,which would then support the reading I have adopted.Tarissantiis certainly preferable to the v.l.carissanti,found in Be, Se, and Ee1.",
    "sn4.25:21": "v.515\"Truly the Tathāgatas, the great heroes,Lead by means of the true Dhamma.When they are leading by means of the Dhamma,What envy can there be in those who understand?\"[n.329] The verse occurs in a different context at Vin I 43,27–28. I follow Be and Se in reading, in pāda c, the activenayamananam,the prevalent reading of Vin. Ee1 & 2, on the basis of SS, read the passiveniyamananam/niyyamananam.BHS versions at Uv :8 and Mvu III 90 also have the active form, while the Prakrit at G-Dhp 267 is ambiguous.",
    "sn4.25:22": "Then Māra's daughters—Taṇha, Arati, and rāga—approached Māra the Evil One. Māra saw them coming in the distance and addressed them in verses:[n.330] In the BHS version vv.516–17are ascribed to the Buddha. The concluding verse was apparently added by the redactors.",
    "sn4.25:23": "v.516\"Fools! You tried to batter a mountainWith the stalks of lotus flowers,To dig up a mountain with your nails,To chew iron with your teeth.",
    "sn4.25:24": "v.517\"As if, having lifted a rock with your head,You sought a foothold in the abyss;As if you struck a stump with your breast,You part from Gotama disappointed.\"",
    "sn4.25:25": "v.518They had come to him glittering with beauty—Taṇha, Arati, and rāga—But the Teacher swept them away right thereAs the wind, a fallen cotton tuft."
}