{
    "sn4.20:1": "On one occasion the Blessed One was dwelling among the Kosalans in a small forest hut in the Himalayan region. Then, when the Blessed One was alone in seclusion, a reflection arose in his mind thus: \"Is it possible to exercise rulership righteously: without killing and without instigating others to kill, without confiscating and without instigating others to confiscate, without sorrowing and without causing sorrow?\"[n.298] A slightly more elaborate version of the incident, including the verses, is recorded at Dhp-a IV 3–33; see BL 3:23–4.Spk: \"The Buddha reflected thus with compassion, having seen people afflicted with punishments in realms ruled by unrighteous kings.\"",
    "sn4.20:2": "Then Māra the Evil One, having known with his own mind the reflection in the Blessed One's mind, approached the Blessed One and said to him: \"Venerable sir, let the Blessed One exercise rulership righteously: without killing and without instigating others to kill, without confiscating and without instigating others to confiscate, without sorrowing and without instigating others to cause sorrow.\"",
    "sn4.20:3": "v.486\"If there were a mountain made of gold,Made entirely of solid gold,Not double this would suffice for one:Having known this, fare evenly.[n.00] in pāda c, Be and Se readdvittava,though the orthography in Ee1 & 2,dvitta va,is preferable.Spk: \"Let alone one mountain, even as much as double(dvikkhattum pi tava)a large golden mountain would not suffice for one person.\" BHS parallels to this verse readvittam,treasure, in place ofdvitta(see Concordance 1 [B]).",
    "sn4.20:4": "v.87\"How could a person incline to sensual pleasuresWho has seen the source whence suffering springs?Having known acquisition as a tie in the world,A person should train for its removal.\"[n.301]Spk: \"Suffering has its source in the five cords of sensual pleasure; that is ‘the source whence it springs’(yatonidanam). When a person has seen this thus, for what reason should he incline to those sensual pleasures which are the source of suffering?\"Upadhiin pāda c is glossed by Spk askamaguṇa-upadhi;see n.21. In place of saṅgo, tie, the BHS versions readśalyam(Pali:sallam, dart).Spk-pṭ: The source of suffering is craving, and the source of craving is the five cords of sensual pleasure. Therefore it is said that the five cords of sensual pleasure—the condition for craving—are the source of suffering. When one who has fully understood reality has seen suffering as it really is with the eye of wisdom, and seen the cords of sensual pleasure to be its source, there is no reason for him to incline to sensual pleasures.",
    "sn4.20:5": "Then Māra the Evil One, realizing, \"The Blessed One knows me, the Fortunate One knows me,\" sad and disappointed, disappeared right there."
}