{
    "sn4.7:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Then, when the night was fading, the Blessed One, having spent much of the night walking back and forth in the open, washed his feet, entered his dwelling, and lay down on his right side in the lion's posture, with one leg overlapping the other, mindful and clearly comprehending, having attended to the idea of rising.",
    "sn4.7:2": "\"What, you sleep? Why do you sleep?What's this, you sleep like a wretch?[n.77] Be, Se, and Ee readdubbhago;Ee1dubbhayo(which may be a misprint); SSdubbhato.Spk: Like one dead and unconscious(mato viya visaññi viya ca). Spk-pṭ: A wretch is one who is luckless, whose fortune has been broken; he is similar to the dead and the unconscious.Thinking ‘The hut's empty’ you sleep:What's this, you sleep when the sun has risen?\"",
    "sn4.7:3": "v.460\"Within him craving no longer lurks,Entangling and binding, to lead him anywhere;With the destruction of all acquisitionsThe Awakened One sleeps:Why should this concern you, Māra?\"[n.278]Spk: Craving is said to be entangling(jalini)because it spreads net-like over the three realms of existence. It is called binding(visattika)because it latches on to sense objects such as forms. It leads anywhere (Spk-pṭ: within the three realms of existence). The acquisitions that are all destroyed are the aggregates, defilements, volitional formations, and cords of sensual pleasure (see n.21). Why should this concern you, Māra?: \"Māra, why do you go about finding fault with this and that like small flies unable to settle on hot porridge?\" This sutta might be compared withSN4.1andSN9.2, which have a similar theme. I have translatedBuddhahere as \"Awakened One\" to highlight the contrast with sleep, but it is uncertain whether such a tension of ideas was intended in the original. On the description of craving as \"entangling and binding,\" seeAN II 211–1.",
    "sn4.7:4": "Then Māra the Evil One … disappeared right there."
}