{
    "sn4.18:1": "On one occasion the Blessed One was dwelling among the Magadhans at the brahmin village of Pañcasala.sn.i.4Now on that occasion the gift-festival of the young people was being held at the brahmin village of Pañcasala.[n.293] Se and Ee & 2 havekumarakanamas against Be kumarikanam,\"of the young girls.\"Spkexplains that on this day—\"a kind of St. Valentine's Day\" (KS :43, n. )—the young girls send presents to their sweethearts among the boys, and the boys send ornaments to the girls, even a garland of flowers if they can give nothing else.Then, in the morning, the Blessed One dressed and, taking bowl and robe, entered Pañcasala for alms. Now on that occasion Māra the Evil One had taken possession of the brahmin householders of Pañcasala, (inciting in them the thought,) \"Don’t let the ascetic Gotama get alms.\"",
    "sn4.18:2": "Then the Blessed One left Pañcasala with his bowl just as cleanly washed as it was when he entered it for alms. Then Māra the Evil One approached the Blessed One and said to him: \"Maybe you got alms, ascetic?\"",
    "sn4.18:3": "v.482\"You have produced demerit, Māra,Having assailed the Tathāgata.Do you really think, O Evil One,‘My evil does not ripen’?",
    "sn4.18:4": "v.83\"Happily indeed we live,We who own nothing at all.We shall dwell feeding on raptureLike the devas of Streaming Radiance.\"[n.295]Spkexplainskiñcana,in pāda b, as \"the various kinds of defilements such as the ‘something’ (called) lust, etc.\" On the use ofkiñcanato denote defilements, seeSN1.7(IV 297,18–19). The devas of Streaming Radiance(deva abhassara)inhabit the highest plane corresponding to the second jhāna, located in the form realm. They are said to subsist on rapture(pitibhakkha)because they are sustained by the nourishment of the jhāna. The verse occurs atDhp 200, the story at Dhp-a 257–58; see BL 3:72–73. In the sequel to the verse, omitted in BL, the five hundred girls hear the Buddha’s verse and become established in the fruit of stream-entry.",
    "sn4.18:5": "Then Māra the Evil One … disappeared right there."
}