{
    "sn4.24:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Uruvela on the bank of the river Nerañjara at the foot of the Goatherd's Banyan Tree. Now on that occasion Māra the Evil One had been following the Blessed One for seven years, seeking to gain access to him but without success.[n.36]Spkexplains the seven years of pursuit as the Buddha’s six years (of striving) before the enlightenment and the first year after. However, the next sutta, which apparently follows in immediate temporal sequence, is the temptation by Māra's daughters, which other sources clearly place right after the enlightenment (see n.322). The present sutta seems to confirm this by locating the dialogue with Māra at the foot of the Goatherd's Banyan Tree, in the vicinity of the Bodhi Tree. The commentaries generally assign the Buddha’s stay under this tree to the fifth week after the enlightenment (see Ja I 78,9–). Seeking to gain access(otarapekkho). Spk: He thought: \"If I see anything improper(ananucchavikam)in the ascetic Gotama's conduct through the body door, etc., I will reprove him.\" But he could not find even a dust mote (of misconduct) to be washed away. Onotara(=vivara,Spk) seeSN35.240(IV 78,3–6, 33),SN35.243(IV 85,–5; 86,27–30),SN47.6(V 47,7–8, 27–28),SN47.7(V 49,7, 6).Then Māra the Evil One approached the Blessed One and addressed him in verse:sn.i.23",
    "sn4.24:2": "v.498\"Is it because you are sunk in sorrowThat you meditate in the woods?Because you’ve lost wealth or pine for it,Or committed some crime in the village?Why don’t you make friends with people?Why don’t you form any intimate ties?\"",
    "sn4.24:3": "v.499\"Having dug up entirely the root of sorrow,Guiltless, I meditate free from sorrow.Having cut off all greedy urge for existence,[n.17]Spk: Bhavalobhajappan ti bhavalobhasaṅkhatam taṇham; \"The greedy urge for existence is craving consisting in greed for existence.\"I meditate taintless, O kinsman of the negligent!\"",
    "sn4.24:4": "v.500\"That of which they say ‘It's mine,’And those who speak in terms of ‘mine’—If your mind exists among these,You won’t escape me, ascetic.\"",
    "sn4.24:5": "v.01\"That which they speak of is not mine,I’m not one of those who speakof mine.You should know thus, O Evil One:Even my path you will not see.\"",
    "sn4.24:6": "v.502\"If you have discovered the path,The secure way leading to the Deathless,Be off and walk that path alone;What's the point of instructing others?\"",
    "sn4.24:7": "v.503\"Those people going to the far shoreAsk what lies beyond Death's realm.When asked, I explain to themThe truth without acquisitions.\"[n.318] I read pāda d with Be, Se, and Ee2:yam saccam tam nirūpadhim(Ee1:yam sabbantam nirūpadhim). Nibbāna, the supreme truth(paramasacca), is often described assabbupadhipaṭinissagga,\"the relinquishing of all acquisitions,\" and here asnirūpadhi.See n.21.",
    "sn4.24:8": "Māra:\"Suppose, venerable sir, not far from a village or a town there was a lotus pond in which a crab was living.[n.319] The same simile occurs in a very different context atMN I 234,7–1.Then a group of boys and girls would leave the village or town and go to the pond. They would pull the crab out from the water and set it down on high ground. Then, whenever that crab would extend one of its claws, those boys and girls would cut it off, break it, and smash it to bits with sticks and stones. Thus, when all its claws have been cut off, broken, and smashed to bits, that crab would be unable to return to that pond. So too, venerable sir, all those distortions, manoeuvres, and contortions of mine have been cut off,sn.i.124broken, and smashed to bits by the Blessed One. Now, venerable sir, I am unable to approach the Blessed One again seeking to gain access to him.\"",
    "sn4.24:9": "v.504\"There was a crow that walked aroundA stone that looked like a lump of fat.‘Let's find something tender here,’he thought,‘Perhaps there's something nice and tasty.’",
    "sn4.24:10": "v.505But because he found nothing tasty there,The crow departed from that spot.Just like the crow that attacked the stone,We leave Gotama disappointed.\""
}