{
    "sn4.5:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Baraṇasi in the Deer Park at Isipatana. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn4.5:2": "\"Bhikkhus, I am freed from all snares, both celestial and human. You too, bhikkhus, are freed from all snares, both celestial and human. Wander forth, O bhikkhus, for the welfare of the multitude, for the happiness of the multitude, out of compassion for the world, for the good, welfare, and happiness of devas and humans. Let not two go the same way. Teach, O bhikkhus, the Dhamma that is good in the beginning, good in the middle, good in the end, with the right meaning and phrasing. Reveal the perfectly complete and purified holy life. There are beings with little dust in their eyes who are falling away because they do not hear the Dhamma.sn.i.106There will be those who will understand the Dhamma. I too, bhikkhus, will go to Senanigama in Uruvela in order to teach the Dhamma.\"[n.73] This is the Buddha’s famous injunction to his first sixty arahant disciples to go forth and spread the Dhamma. The passage also occurs at Vin I 0,36–1,16, in correct temporal sequence, precedingSN4.4. Vv.476–77follow immediately, though here they are separated and assigned to an encounter in Sāvatthī. A BHS parallel, including the verses, is at Mvu III 415–16; see Jones, 3:416–17Spkexplains the threefold goodness of the Dhamma in various ways pertaining both to practice and doctrine. For example, virtue is the beginning; serenity, insight, and the path are the middle; the fruits and Nibbāna are the end; or the opening of a sutta is good, and so too the middle portion and the conclusion. When the Buddha went to Uruvela he converted the thousand jaṭila ascetics, which culminated in the Fire Sermon (SN35.8).",
    "sn4.5:3": "v.454\"You are bound by all the snaresBoth celestial and human;You are bound by the great bondage:You won’t escape me, ascetic!\"",
    "sn4.5:4": "v.55\"I am freed from all the snaresBoth celestial and human;I am freed from the great bondage:You’re defeated, End-maker!\"",
    "sn4.5:5": "Then Māra the Evil One … disappeared right there."
}