{
    "sn4.13:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha in the Maddakucchi Deer Park. Now on that occasion the Blessed One's foot had been cut by a stone splinter. Severe pains assailed the Blessed One—bodily feelings that were painful, racking, sharp, piercing, harrowing, disagreeable. But the Blessed One endured them, mindful and clearly comprehending, without becoming distressed. Then the Blessed One had his outer robe folded in four, and he lay down on his right side in the lion posture with one leg overlapping the other, mindful and clearly comprehending.[n.283] SeeSN.38and n.86.",
    "sn4.13:2": "v.470\"Do you lie down in a daze or drunk on poetry?Don’t you have sufficient goals to meet?Alone in a secluded lodgingWhy do you sleep with a drowsy face?\"[n.84]Spkparaphraseskaveyyamattoin pāda a thus: \"Do you lie down thinking up a poem like a poet, who lies down intoxicated with the composing of poetry?\" The expression recurs at v.753a.Sampacura,glossed bybahuvo,is atAN II 59,1and61,10,also in apposition toattha.",
    "sn4.13:3": "v.471\"I do not lie in a daze or drunk on poetry;Having reached the goal, I am rid of sorrow.Alone in a secluded lodgingI lie down full of compassion for all beings.",
    "sn4.13:4": "v.72\"Even those with a dart stuck in the breastPiercing their heart moment by moment—Even these here, stricken, get to sleep;sn.i.111So why should I not get to sleepWhen my dart has been drawn out?[n.285]Muhuṁ muhuṁ,in pāda b, is not in PED, andSpkand Spk-pṭ are silent, but see MW, s.v. muhur. The expression occurs atTh 125d, glossed by Th-a II 7,13–1 asabhikkhaṇaṁ,and atTh 1129b, glossed by Th-a III 158,8–9 asabhiṇhato.Both glosses mean \"often,\" but here it seems the more literal sense of \"moment by moment\" or \"constantly\" is implied. The dart(salla)is elsewhere identified with craving; see vv.21c,737c. AtSN35.90(IV 6,33–3) it is said that the dart is the state of being stirred(eja sallaṁ),ejabeing a synonym fortaṇhā;and the Tathāgata, who is unstirred by craving, dwells with the dart removed(vitasallo). See tooMN II 260,17:Sallan ti kho Sunakkhatta taṇhay’ etaṁ adhivacanaṁ.",
    "sn4.13:5": "v.473\"I do not lie awake in dread,Nor am I afraid to sleep.The nights and days do not afflict me,I see for myself no decline in the world.Therefore I can sleep in peace,Full of compassion for all beings.\"",
    "sn4.13:6": "Then Māra the Evil One … disappeared right there."
}