{
    "sn40.10:1": "On one occasion the Venerable Mahāmoggallāna was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, the Venerable Mahāmoggallāna disappeared from Jeta's Grove and reappeared among the Tāvatiṁsa devas. Then Sakka, lord of the devas, approached the Venerable Mahāmoggallāna together with five hundred devatas.sn.iv.270Having approached, he paid homage to the Venerable Mahāmoggallāna and stood to one side. The Venerable Mahāmoggallāna then said to him:",
    "sn40.10:2": "\"Good, lord of the devas, is the going for refuge to the Buddha. Because of going for refuge to the Buddha, some beings here, with the breakup of the body, after death, are reborn in a good destination, in a heavenly world. Good, lord of the devas, is the going for refuge to the Dhamma. Because of going for refuge to the Dhamma, some beings here, with the breakup of the body, after death, are reborn in a good destination, in a heavenly world. Good, lord of the devas, is the going for refuge to the Saṅgha. Because of going for refuge to the Saṅgha, some beings here, with the breakup of the body, after death, are reborn in a good destination, in a heavenly world.\"",
    "sn40.10:4–6": "Then Sakka, lord of the devas, approached the Venerable Mahāmoggallāna together with six hundred devatas … seven hundred devatas … eight hundred devatas … eighty thousand devat̄s.[n.282] Reading with Be and Seası̄tiyā devatāsahassehi saddhiṃ,as against Eeası̄tiyā devatāsatehi saddhiṃ,\"eighty hundred.\"Having approached, he paid homage to the Venerable Mahāmoggallāna and stood to one side. The Venerable Mahāmoggallāna then said to him:",
    "sn40.10:7": "Then Sakka, lord of the devas, approached the Venerable Mahāmoggallāna together with five hundred devatas. Having approached, he paid homage to the Venerable Mahāmoggallāna and stood to one side. The Venerable Mahāmoggallāna then said to him:",
    "sn40.10:8": "\"Good, lord of the devas, is the possession of confirmed confidence in the Buddha thus:[n.23]Buddhe aveccappasada.This is the faith of a noble disciple at the minimal level of stream-enterer; see II, n.120. The four qualities to be extolled here are called the four factors of stream-entry(sot̄pattiyȧga); seeSN12.41. Sakka is shown attaining stream-entry atDN II 2,20–23.‘The Blessed One is an arahant, fully enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One.’ Because of possessing confirmed confidence in the Buddha, some beings here, with the breakup of the body, after death, are reborn in a good destination, in a heavenly world.",
    "sn40.10:9": "\"Good, lord of the devas, is the possession of confirmed confidence in the Dhamma thus:sn.iv.272‘The Dhamma is well expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’ Because of possessing confirmed confidence in the Dhamma, some beings here, with the breakup of the body, after death, are reborn in a good destination, in a heavenly world.",
    "sn40.10:10": "\"Good, lord of the devas, is the possession of confirmed confidence in the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practising the good way, practising the straight way, practising the true way, practising the proper way; that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’ Because of possessing confirmed confidence in the Saṅgha, some beings here, with the breakup of the body, after death, are reborn in a good destination, in a heavenly world.",
    "sn40.10:11": "\"Good, lord of the devas, is the possession of the virtues dear to the noble ones, unbroken, untorn, unblemished, unmottled, freeing, praised by the wise, ungrasped, leading to concentration. Because of possessing the virtues dear to the noble ones, some beings here, with the breakup of the body, after death, are reborn in a good destination, in a heavenly world.\"",
    "sn40.10:12–15": "\"Good, Sir Moggallana, is the possession of confirmed confidence in the Buddha … the possession of confirmed confidence in the Dhamma … the possession of confirmed confidence in the Sȧgha …sn.iv.273… the possession of the virtues dear to the noble ones, unbroken … leading to concentration. Because of possessing the virtues dear to the noble ones, some beings here, with the breakup of the body, after death, are reborn in a good destination, in a heavenly world.\"",
    "sn40.10:16–24": "Then Sakka, lord of the devas, approached the Venerable Mahāmoggallāna together with six hundred devatas … seven hundred devatas … eight hundred devatas … eighty thousand devatas. Having approached, he paid homage to the Venerable Mahāmoggallāna and stood to one side. The Venerable Mahāmoggallāna then said to him:As above.sn.iv.274",
    "sn40.10:25": "Then Sakka, lord of the devas, approached the Venerable Mahāmoggallāna together with five hundred devatas. Having approached, he paid homage to the Venerable Mahāmoggallāna and stood to one side. The Venerable Mahāmoggallāna then said to him:",
    "sn40.10:26–31": "\"Good, lord of the devas, is the going for refuge to the Buddha. Because of going for refuge to the Buddha, some beings here,sn.iv.275with the breakup of the body, after death, are reborn in a good destination, in a heavenly world. They surpass other devas in ten respects: in celestial life span, in celestial beauty, in celestial happiness, in celestial fame, in celestial sovereignty, and in celestial forms, sounds, odours, tastes, and tactile objects.",
    "sn40.10:32–36": "Then Sakka, lord of the devas, approached the Venerable Mahāmoggallāna together with six hundred devatas … seven hundred devatas …sn.iv.276… eight hundred devatas … eighty thousand devatas. Having approached, he paid homage to the Venerable Mahāmoggallāna and stood to one side. The Venerable Mahāmoggallāna then said to him:",
    "sn40.10:37–41": "Then Sakka, lord of the devas, approached the Venerable Mahāmoggallāna together with five hundred devatas. Having approached, he paid homage to the Venerable Mahāmoggallāna and stood to one side.sn.iv.277The Venerable Mahāmoggallāna then said to him:",
    "sn40.10:42–45": "\"Good, Sir Moggallana, is the possession of confirmed confidence in the Buddha … the possession of confirmed confidence in the Dhamma … the possession of confirmed confidence in the Sȧgha …sn.iv.278… the possession of the virtues dear to the noble ones, unbroken … leading to concentration. Because of possessing the virtues dear to the noble ones some beings here, with the breakup of the body, after death, are reborn in a good destination, in a heavenly world. They surpass other devas in ten respects: in celestial life span, in celestial beauty, in celestial happiness, in celestial fame, in celestial sovereignty, and in celestial forms, sounds, odours, tastes, and tactile objects.\"",
    "sn40.10:46–54": "Then Sakka, lord of the devas, approached the Venerable Mahāmoggallāna together with six hundred devatas … seven hundred devatas … eight hundred devatas … eighty thousand devatas. Having approached, he paid homage to the Venerable Mahāmoggallāna and stood to one side. The Venerable Mahāmoggallāna then said to him:"
}