{
    "sn41.8:1": "Now on that occasion Nigaṇṭha Nataputa had arrived at Macchikasaṇḍasn.iv.298together with a large retinue of nigạ̣has.[n.38] Nigaṇṭha Nataputta is identical with Mahavīra, the historical progenitor of Jainism. Though he makes several personal appearances in the Pali Canon (see particularlyMN No. 56), there is no report of him meeting the Buddha. His followers were called nigaṇṭhas, \"knotless ones.\"Citta the householder heard about this and, together with a number of lay followers, approached Nigaṇṭha Nataputta.[n.39]Spk: Why did this noble disciple, a nonreturner, approach a wretched, misguided, naked ascetic? To free (the Buddhists) from blame and to refute his doctrine. For the nigaṇṭhas held that the Buddha’s followers do not show hospitality to anyone else, and he wanted to free his coreligionists from this criticism. He also approached with the idea of refuting Nataputta's doctrine.He exchanged greetings with Nigaṇṭha Nataputta and, when they had concluded their greetings and cordial talk, sat down to one side. Nigaṇṭha Nataputta then said to him: \"Householder, do you have faith in the ascetic Gotama when he says: ‘There is a concentration without thought and examination, there is a cessation of thought and examination’?\"[n.320]Atthi avitakko avicāro samādhi, atthi vitakkavicārānaṃ nirodho.As will be shown, this refers to the second jhāna.",
    "sn41.8:2": "\"In this matter, venerable sir, I do not go by faith in the Blessed One[n.31]Na khvāhaṃ ettha bhante bhagavato saddhāya gacchāmi.Citta is here laying a verbal trap, which will be sprung just below. While he appears to be disclaiming allegiance to the Buddha, he is actually asserting that he has realized the truth of the Buddha’s statement by personal experience and thus need not rely on mere faith in his word. The pun recurs at48:44.when he says: ‘There is a concentration without thought and examination, there is a cessation of thought and examination.’\"",
    "sn41.8:3": "\"What do you think, venerable sir, which is superior: knowledge or faith?\"",
    "sn41.8:4": "When this was said, Nigaṇṭha Nataputta looked askance at his own retinue and said: \"See this, sirs! How crooked is this Citta the householder! How fraudulent and deceptive!\"",
    "sn41.8:5": "\"Just now, venerable sir, we understood you to say: ‘See this, sirs! How straightforward is this Citta the householder! How honest and open!’—yet now we understand you to say: ‘See this, sirs! How crooked is this Citta the householder! How fraudulent and deceptive!’ If your former statement is true, venerable sir, then your latter statement is false, while if your former statement is false, then your latter statement is true."
}