{
    "sn41.6:1": "On one occasion the Venerable Kamabhū was dwelling at Macchikasaṇḍa in the Wild Mango Grove. Then Citta the householder approached the Venerable Kamabhū, paid homage to him, sat down to one side, and said to him: \"Venerable sir, how many kinds of formations are there?\"[n.297]Spkexplains that Citta used to abide in cessation (Spk-pṭ: as a nonreturner) and thus he raised the question to ask about the formations that are the basis for cessation (see n.299).",
    "sn41.6:2": "\"Good, venerable sir,\" Citta the householder said. Then … he asked him a further question: \"But, venerable sir, why are in-breathing and out-breathing the bodily formation? Why are thought and examination the verbal formation? Why are perception and feeling the mental formation?\"",
    "sn41.6:3": "Saying, \"Good, venerable sir,\" … he then asked him a further question: \"Venerable sir, how does the attainment of the cessation of perception and feeling come about?\"[n.299] The question refers tosaññāvedayitanirodha, also callednirodhasamāpatti,the attainment of cessation, a meditative state in which mind and all mental functions stop. It is said to be accessible only to arahants and nonreturners who have mastered the eight attainments of samādhi. For a detailed treatment according to the commentarial method, see Vism 702–9 (Ppn 2:16–52).Spksays Citta had asked this question to find out if the monk was familiar with the attainment.",
    "sn41.6:4": "Saying, \"Good, venerable sir,\" … he then asked him a further question: \"Venerable sir, when a bhikkhu is attaining the cessation of perception and feeling, which of these things ceases first in him: the bodily formation, the verbal formation, or the mental formation?\"",
    "sn41.6:5": "Saying, \"Good, venerable sir,\" … he then asked him a further question: \"Venerable sir, what is the difference between one who is dead and gone, and a bhikkhu who has attained the cessation of perception and feeling?\"",
    "sn41.6:6": "Saying, \"Good, venerable sir,\" … he then asked him a further question: \"Venerable sir, how does emergence from the cessation of perception and feeling come about?\"",
    "sn41.6:7": "Saying, \"Good, venerable sir,\" … he then asked him a further question: \"Venerable sir, when a bhikkhu is emerging from the attainment of the cessation of perception and feeling, which of these things arises first in him: the bodily formation, the verbal formation, or the mental formation?\"",
    "sn41.6:8": "Saying, \"Good, venerable sir,\" … he then asked him a further question: \"Venerable sir, when a bhikkhu has emerged from the attainment of the cessation of perception and feeling, how many kinds of contact touch him?\"",
    "sn41.6:9": "Saying, \"Good, venerable sir,\" … he then asked him a further question: \"Venerable sir, when a bhikkhu has emerged from the attainment of the cessation of perception and feeling, towards what does his mind slant, slope, and incline?\"",
    "sn41.6:10": "\"Good, venerable sir,\" Citta the householder said. Then, having delighted and rejoiced in the Venerable Kamabhū's statement, he asked him a further question: \"Venerable sir, how many things are helpful for the attainment of the cessation of perception and feeling?\""
}