{
    "sn41.5:1": "On one occasion the Venerable Kamabhū was dwelling at Macchikasaṇḍa in the Wild Mango Grove. Then Citta the householder approached the Venerable Kamabhū, paid homage to him, and sat down to one side. The Venerable Kamabhū then said to him:",
    "sn41.5:2": "\"This has been said, householder:",
    "sn41.5:3": "\"‘With faultless wheel and a white awning,The one-spoked chariot rolls.See it coming, trouble-free,The stream cut, without bondage.’[n.296] AtUd 76,26–27, spoken with reference to the arahant Lakuṇṭaka Bhaddiya (seeSN21.6). All the terms refer literally to a chariot and figuratively to an arahant. The key to the riddle is given just below in the text, with fuller explanations at Ud-a 70–71; see the translation in Masefield,The Udana Commentary,2:959–61. The following is a summary:elais a fault(dosa); one without faults isnela,faultless. The chariot is described asnelaṅgabecause its wheel (aṅga,I follow Masefield, and see MW, s.v.rathaṅga)—its most essential part—is faultless. In the application of the simile this represents the virtue associated with the fruit of arahantship. \"Awning\" is the woollen cloth spread on top of the chariot; the white awning(setapachāda)signifies the liberation associated with the fruit of arahantship, which is by nature thoroughly and completely pure. \"Trouble-free\"(anīgha)means without the agitation(parikhobha)of the defilements, as with a vehicle in which jolting(khobha)is absent. \"The stream cut\"(chinnasota): an ordinary chariot has an uninterrupted stream of oil smeared on the axle-heads and nave, but this one has \"the stream cut\" because the thirty-six streams (of craving) have been fully abandoned. \"Without bondage\"(abandhana): an ordinary chariot has an abundance of bonds to prevent the platform from being shaken by the axle, etc., but in this one all the bonds—that is, the fetters—have been completely destroyed; thus it is \"without bondage.\"",
    "sn41.5:4": "How, householder, should the meaning of this brief statement be understood in detail?\"",
    "sn41.5:5": "\"‘Faultless’: this, venerable sir, is a designation for the virtues. ‘White awning’: this is a designation for liberation. ‘One spoke’: this is a designation for mindfulness. ‘Rolls’: this is a designation for going forward and returning. ‘Chariot’: this is a designation for this body consisting of the four great elements, originating from mother and father, built up out of rice and gruel, subject to impermanence, to being worn and rubbed away, to breaking apart and dispersal.",
    "sn41.5:6": "\"‘With faultless wheel and a white awning,The one-spoked chariot rolls.See it coming, trouble-free,The stream cut, without bondage’—",
    "sn41.5:7": "\"It is in such a way that I understand in detail the meaning of what was stated by the Blessed One in brief.\""
}