{
    "sn42.10:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Now on that occasion the members of the king's retinue had assembled in the royal palace and were sitting together when the following conversation arose: \"Gold and silver are allowable for the ascetics following the Sakyan son; the ascetics following the Sakyan son consent to gold and silver; the ascetics following the Sakyan son accept gold and silver.\"",
    "sn42.10:2": "Now on that occasion Maṇicūḷaka the headman was sitting in that assembly. Then Maṇicūḷaka the headman said to that assembly: \"Do not speak thus, masters. Gold and silver are not allowable for the ascetics following the Sakyan son; the ascetics following the Sakyan son do not consent to gold and silver; the ascetics following the Sakyan son do not accept gold and silver. They have renounced jewellery and gold; they have given up the use of gold and silver.\"[n.350] The rule is Nissaggiya-pacittiya No. 18; see Vin III 36–39 and Vin I 45,–7. The sutta is cited at Vin II 96–97 as testimony for the prohibition against the acceptance of gold and silver by bhikkhus. At Vin III 38, \"silver\" is more broadly defined as including coins made of silver, copper, wood, or lac, or whatever serves as a medium of exchange. Its commentary (Sp III 690) extends this to include bone, hide, fruit, seeds, etc., whether imprinted with a figure or not. Thus in effect the expression \"gold and silver\" signifies money. Onsamaṇa sakyaputtiya,see II, n.376.And Maṇicūḷaka was able to convince that assembly.",
    "sn42.10:3": "\"For sure, headman, when you answered thus you stated what has been said by me and did not misrepresent me with what is contrary to fact; you explained in accordance with the Dhamma, and no reasonable consequence of your statement gives ground for criticism. For, headman, gold and silver are not allowable for the ascetics following the Sakyan son; the ascetics following the Sakyan son do not consent to gold and silver; the ascetics following the Sakyan son do not accept gold and silver. They have renounced jewellery and gold; they have given up the use of gold and silver. If gold and silver are allowable for anyone, the five cords of sensual pleasure are allowable for him. If the five cords of sensual pleasure are allowable for anyone, you can definitely consider him to be one who does not have the character of an ascetic or of a follower of the Sakyan son."
}