{
    "sn42.7:1": "On one occasion the Blessed One was dwelling at Nalanda in Pavarika's Mango Grove. Then Asibandhakaputta the headman approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Venerable sir, doesn’t the Blessed One dwell compassionate towards all living beings?\"",
    "sn42.7:2": "\"Headman, just like the field that is excellent are the bhikkhus and bhikkhunīs to me. I teach them the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; I reveal the holy life that is perfectly complete and pure. For what reason? Because they dwell with me as their island, with me as their shelter, with me as their protector, with me as their refuge.",
    "sn42.7:3": "\"Suppose, headman, a man had three waterpots: one without cracks, which does not let water seep through and escape; one without cracks, but which lets water seep through and escape; and one with cracks, which lets water seep through and escape. What do you think, headman? If that man wants to store water, where would he store it first: in the waterpot that is without cracks, which does not let water seep through and escape; or in the waterpot that is without cracks, but which lets water seep through and escape; or in the waterpot that has cracks, which lets water seep through and escape?\"",
    "sn42.7:4": "\"Headman, just like the waterpot that is without cracks, which does not let water seep through and escape, are the bhikkhus and bhikkhunīs to me. I teach them the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; I reveal the holy life that is perfectly complete and pure. For what reason? Because they dwell with me as their island, with me as their shelter, with me as their protector, with me as their refuge.",
    "sn42.7:5": "When this was said, Asibandhakaputta the headman said to the Blessed One: \"Magnificent, venerable sir! … From today let the Blessed One remember me as a lay follower who has gone for refuge for life.\""
}