{
    "sn42.3:1": "Then the headman Yodhajīva the Mercenary[n.339]Spkexplains the name as meaning \"one who earns his living by warfare\"(yuddhena jīvikaṁ kappanako); this name, too, was assigned by the redactors of the Dhamma. I take the occupation to be that of a mercenary or professional soldier.approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Venerable sir, I have heard it said by mercenaries of old in the lineage of teachers: ‘When a mercenary is one who strives and exerts himself in battle, if others slay him and finish him off while he is striving and exerting himself in battle, then with the breakup of the body, after death, he is reborn in the company of the battle-slain devas.’[n.340] This free rendering of the name was suggested by VāT. Se and Ee readsarañjitanaṁ,but Beparajitānaṁ,\"conquered by others,\" makes better sense.What does the Blessed One say about that?\"",
    "sn42.3:2": "\"Surely, headman, I am not getting through to you when I say, ‘Enough, headman, let it be! Don’t ask me that!’ But still, I will answer you. When, headman, a mercenary is one who strives and exerts himself in battle, his mind is already low, depraved, misdirected by the thought: ‘Let these beings be slain, slaughtered, annihilated, destroyed, or exterminated.’ If others then slay him and finish him off while he is striving and exerting himself in battle, then with the breakup of the body, after death, he is reborn in the ‘Battle-Slain Hell.’[n.341] Again,Spksays this is not a separate hell but a section of Avīci where beings appear as soldiers conquered in battle.But should he hold such a view as this: ‘When a mercenary strives and exerts himself in battle, if others slay him and finish him off while he is striving and exerting himself in battle, then with the breakup of the body, after death, he is reborn in the company of the battle-slain devas’—that is a wrong view on his part. For a person with wrong view, I say, there is one of two destinations: either hell or the animal realm.\"",
    "sn42.3:3": "When this was said, Yodhajīva the headman cried out and burst into tears.The Blessed One said:\"So I did not get through to you when I said, ‘Enough, headman, let it be! Don’t ask me that!’\""
}