{
    "sn42.12:1": "Then Rasiya the headman approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Venerable sir, I have heard: ‘The ascetic Gotama criticizes all austerity. He categorically blames and reviles any ascetic who leads a rough life.’ Do those who speak thus, venerable sir, state what has been said by the Blessed One and not misrepresent him with what is contrary to fact? Do they explain in accordance with the Dhamma so that no reasonable consequence of their assertion would be open to criticism?\"",
    "sn42.12:2": "\"There are, headman, these two extremes which should not be cultivated by one who has gone forth into homelessness: the pursuit of sensual happiness in sensual pleasures, which is low, vulgar, the way of worldlings, ignoble, unbeneficial; and the pursuit of self-mortification, which is painful, ignoble, unbeneficial. Without veering towards either of these extremes, the Tathāgata has awakened to the middle way,sn.iv.331which gives rise to vision, which gives rise to knowledge, which leads to peace, to direct knowledge, to enlightenment, to Nibbāna. And what is that middle way awakened to by the Tathāgata, which gives rise to vision … leads to Nibbāna? It is this Noble Eightfold Path; that is, right view … right concentration. This is that middle way awakened to by the Tathāgata, which gives rise to vision, which gives rise to knowledge, which leads to peace, to direct knowledge, to enlightenment, to Nibbāna.[n.354] These are the words with which the Buddha opened his first sermon; seeSN56.11.Spk: The pursuit of sensual happiness is mentioned to show the types who enjoy sensual pleasure (ii –iii); the pursuit of self-mortification to show the ascetics (iv–v); the middle way to show the three types of wearing away (vi). What is the purpose in showing all this? The Tathāgata, who attained perfect enlightenment by abandoning the two extremes and by following the middle way, does not criticize or praise all enjoyers of sensual pleasures or all ascetics. He criticizes those who deserve criticism and praises those who deserve praise.",
    "sn42.12:3": "\"There are, headman, these three persons who enjoy sensual pleasures existing in the world. What three?[n.55] The three coordinates of the pattern to be expanded upon are: (i) how wealth is acquired, whether unlawfully, lawfully, or both; (ii) whether or not it is used for one's own benefit; and (iii) whether or not it is used to benefit others. Those who rank positive on all three counts will be further divided into those who remain attached to their wealth and those who are unattached to it. This same tenfold analysis of thekāmabhogı̄is atAN V 177–82.",
    "sn42.12:4": "\"Then, headman, someone here who enjoys sensual pleasures seeks wealth both lawfully and unlawfully, both by violence and without violence. Having done so,sn.iv.332he does not make himself happy and pleased, nor does he share it and do meritorious deeds.",
    "sn42.12:5": "\"Then, headman, someone here who enjoys sensual pleasures seeks wealth lawfully, without violence. Having done so, he does not make himself happy and pleased, nor does he share it and do meritorious deeds.",
    "sn42.12:6": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth unlawfully, by violence, and who does not make himself happy and pleased nor share it and do meritorious deeds, may be criticized on three grounds. On what three grounds may he be criticized? ‘He seeks wealth unlawfully, by violence’—this is the first ground on which he may be criticized. ‘He does not make himself happy and pleased’—this is the second ground on which he may be criticized. ‘He does not share it and do meritorious deeds’—this is the third ground on which he may be criticized. This one enjoying sensual pleasures may be criticized on these three grounds.",
    "sn42.12:7": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth unlawfully, by violence, and who makes himself happy and pleased but does not share it and do meritorious deeds, may be criticized on two grounds and praised on one ground. On what two grounds may he be criticized? ‘He seeks wealth unlawfully, by violence’—this is the first ground on which he may be criticized. ‘He does not share it and do meritorious deeds’—this is the second ground on which he may be criticized. And on what one ground may he be praised? ‘He makes himself happy and pleased’—this is the one ground on which he may be praised. This one enjoying sensual pleasures may be criticized on these two grounds and praised on this one ground.",
    "sn42.12:8": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth unlawfully, by violence, andsn.iv.334makes himself happy and pleased, and shares it and does meritorious deeds, may be criticized on one ground and praised on two grounds. On what one ground may he be criticized? ‘He seeks wealth unlawfully, by violence’—this is the one ground on which he may be criticized. And on what two grounds may he be praised? ‘He makes himself happy and pleased’—this is the first ground on which he may be praised. ‘He shares it and does meritorious deeds’—this is the second ground on which he may be praised. This one enjoying sensual pleasures may be criticized on this one ground and praised on these two grounds.",
    "sn42.12:9": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth both lawfully and unlawfully, both by violence and without violence, and who does not make himself happy and pleased nor share it and do meritorious deeds, may be praised on one ground and criticized on three grounds. On what one ground may he be praised? ‘He seeks wealth lawfully, without violence’—this is the one ground on which he may be praised. On what three grounds may he be criticized? ‘He seeks wealth unlawfully, by violence’—this is the first ground on which he may be criticized. ‘He does not make himself happy and pleased’—this is the second ground on which he may be criticized. ‘He does not share it and do meritorious deeds’—this is the third ground on which he may be criticized. This one enjoying sensual pleasures may be praised on this one ground and criticized on these three grounds.",
    "sn42.12:10": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth both lawfully and unlawfully, both by violence and without violence, and who makes himself happy and pleased but does not share it and do meritorious deeds, may be praised on two grounds and criticized on two grounds. On what two grounds may he be praised? ‘He seeks wealth lawfully, without violence’—this is the first ground on which he may be praised. ‘He makes himself happy and pleased’—this is the second ground on which he may be praised.sn.iv.335On what two grounds may he be criticized? ‘He seeks wealth unlawfully, by violence’—this is the first ground on which he may be criticized. ‘He does not share it and do meritorious deeds’—this is the second ground on which he may be criticized. This one enjoying sensual pleasures may be praised on these two grounds and criticized on these two grounds.",
    "sn42.12:11": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth both lawfully and unlawfully, both by violence and without violence, and who makes himself happy and pleased and shares it and does meritorious deeds, may be praised on three grounds and criticized on one ground. On what three grounds may he be praised? ‘He seeks wealth lawfully, without violence’—this is the first ground on which he may be praised. ‘He makes himself happy and pleased’—this is the second ground on which he may be praised. ‘He shares it and does meritorious deeds’—this is the third ground on which he may be praised. On what one ground may he be criticized? ‘He seeks wealth unlawfully, by violence’—this is the one ground on which he may be criticized. This one enjoying sensual pleasures may be praised on these three grounds and criticized on this one ground.",
    "sn42.12:12": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth lawfully, without violence, and who does not make himself happy and pleased nor share it and do meritorious deeds, may be praised on one ground and criticized on two grounds. On what one ground may he be praised? ‘He seeks wealth lawfully, without violence’—this is the one ground on which he may be praised. On what two grounds may he be criticized? ‘He does not make himself happy and pleased’—this is the first ground on which he may be criticized. ‘He does not share it and do meritorious deeds’—this is the second ground on which he may be criticized. This one enjoying sensual pleasures may be praised on this one ground and criticized on these two grounds.sn.iv.336",
    "sn42.12:13": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth lawfully, without violence, and who makes himself happy and pleased but does not share it and do meritorious deeds, may be praised on two grounds and criticized on one ground. On what two grounds may he be praised? ‘He seeks wealth lawfully, without violence’—this is the first ground on which he may be praised. ‘He makes himself happy and pleased’—this is the second ground on which he may be praised. On what one ground may he be criticized? ‘He does not share it and do meritorious deeds’—this is the one ground on which he may be criticized. This one enjoying sensual pleasures may be praised on these two grounds and criticized on this one ground.",
    "sn42.12:14": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth lawfully, without violence, and makes himself happy and pleased, and shares it and does meritorious deeds, but who uses that wealth while being tied to it, infatuated with it, blindly absorbed in it, not seeing the danger in it, not understanding the escape—he may be praised on three grounds and criticized on one ground. On what three grounds may he be praised? ‘He seeks wealth lawfully, without violence’—this is the first ground on which he may be praised. ‘He makes himself happy and pleased’—this is the second ground on which he may be praised. ‘He shares it and does meritorious deeds’—this is the third ground on which he may be praised. On what one ground may he be criticized? ‘He uses that wealth while being tied to it, infatuated with it, blindly absorbed in it, not seeing the danger in it, not understanding the escape’—this is the one ground on which he may be criticized. This one enjoying sensual pleasures may be praised on these three grounds and criticized on this one ground.",
    "sn42.12:15": "\"Therein, headman, the one enjoying sensual pleasures who seeks wealth lawfully, without violence, and makes himself happy and pleased, and shares it and does meritorious deeds,sn.iv.337and who uses that wealth without being tied to it, uninfatuated with it, not blindly absorbed in it, seeing the danger in it, understanding the escape—he may be praised on four grounds. On what four grounds may he be praised? ‘He seeks wealth lawfully, without violence’—this is the first ground on which he may be praised. ‘He makes himself happy and pleased’—this is the second ground on which he may be praised. ‘He shares it and does meritorious deeds’—this is the third ground on which he may be praised. ‘He uses that wealth without being tied to it, uninfatuated with it, not blindly absorbed in it, seeing the danger in it, understanding the escape’—this is the fourth ground on which he may be praised. This one enjoying sensual pleasures may be praised on these four grounds.",
    "sn42.12:16": "\"There are, headman, these three kinds of ascetics of rough life existing in the world. What three?",
    "sn42.12:17": "\"Then, headman, some ascetic of rough life has gone forth out of faith … . He afflicts and torments himself, and achieves a wholesome state, yet he does not realize a superhuman distinction in knowledge and vision worthy of the noble ones.sn.iv.338",
    "sn42.12:18": "\"Then, headman, some ascetic of rough life has gone forth out of faith … . He afflicts and torments himself, achieves a wholesome state, and realizes a superhuman distinction in knowledge and vision worthy of the noble ones.",
    "sn42.12:19": "\"Therein, headman, the ascetic of rough life who afflicts and torments himself, yet does not achieve a wholesome state or realize a superhuman distinction in knowledge and vision worthy of the noble ones, may be criticized on three grounds. On what three grounds may he be criticized? ‘He afflicts and torments himself’—this is the first ground on which he may be criticized. ‘He does not achieve a wholesome state’—this is the second ground on which he may be criticized. ‘He does not realize a superhuman distinction in knowledge and vision worthy of the noble ones’—this is the third ground on which he may be criticized. This ascetic of rough life may be criticized on these three grounds.",
    "sn42.12:20": "\"Therein, headman, the ascetic of rough life who afflicts and torments himself, and achieves a wholesome state, yet does not realize a superhuman distinction in knowledge and vision worthy of the noble ones, may be criticized on two grounds and praised on one ground. On what two grounds may he be criticized? ‘He afflicts and torments himself’—this is the first ground on which he may be criticized. ‘He does not realize a superhuman distinction in knowledge and vision worthy of the noble ones’—this is the second ground on which he may be criticized. On what one ground may he be praised? ‘He achieves a wholesome state’—this is the one ground on which he may be praised. This ascetic of rough life may be criticized on these two grounds and praised on this one ground.sn.iv.339",
    "sn42.12:21": "\"Therein, headman, the ascetic of rough life who afflicts and torments himself, achieves a wholesome state, and realizes a superhuman distinction in knowledge and vision worthy of the noble ones, may be criticized on one ground and praised on two grounds. On what one ground may he be criticized? ‘He afflicts and torments himself’—this is the one ground on which he may be criticized. On what two grounds may he be praised? ‘He achieves a wholesome state’—this is the first ground on which he may be praised. ‘He realizes a superhuman distinction in knowledge and vision worthy of the noble ones’—this is the second ground on which he may be praised. This ascetic of rough life may be criticized on this one ground and praised on these two grounds.",
    "sn42.12:22": "\"There are, headman, these three kinds of wearing away that are directly visible,[n.357]Tisso sandiṭṭhikā nijjarā. Nijjarā,\"wearing away,\" was a Jain term adopted by the Buddha. The Jains held that ascetic practice was the means to \"wear away\" all suffering(sabbaṁ dukkhaṁ nijjiṇṇaṁ bhavissati); see their position atMN I 93,2–11andII 214,7–13, and the Buddha’s alternative approach to \"wearing away\" atMN II 3–25. Three other kinds ofsandiṭṭhikā nijjarāare described atAN I 1,5–30(i.e., virtue, the jhānas, the destruction of the taints) and a twentyfoldnijjarais atMN III 76,12–77,23.Spksays that one path is described as three kinds of wearing away because of the wearing away of the three defilements.immediate, inviting one to come and see, applicable, to be personally experienced by the wise. What three?",
    "sn42.12:23": "When this was said, Rasiya the headman said to the Blessed One: \"Magnificent, venerable sir! … From today let the Blessed One remember me as a lay follower who has gone for refuge for life.\""
}