{
    "sn42.2:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Then Talapuṭa the troupe headman[n.334] His name means \"palmyra box.\"Spksays he was called thus because his facial complexion was the colour of a ripe palmyra fruit just fallen from its stalk. He was the director of a large troupe of actors and had become famous throughout India. His verses, which stand out by their moral earnestness, are atTh 09–45.approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Venerable sir, I have heard it said among actors of old in the lineage of teachers: ‘If an actor, in the theatre or the arena, entertains and amuses people by truth and lies,[n.335]Saccālikena.Woodward renders \"by his counterfeiting of the truth\" (KS 4:24), but I follow Spk, which glosses this as advandacompound:saccena ca alikena ca.then with the breakup of the body, after death, he is reborn in the company of the laughing devas.’ What does the Blessed One say about that?\"",
    "sn42.2:2": "\"Surely, headman, I am not getting through to you[n.336] Here, where the present is required, we should read with Be and Se nalabhāmi,and below, where the aorist is appropriate,nālatthaṃ.Ee has the latter reading in both places.when I say, ‘Enough, headman, let it be! Don’t ask me that!’ But still, I will answer you. In the theatre or arena, among beings who are not yet free from lust, who are bound by the bondage of lust, an actor entertains them with titillating things that excite them even more strongly to lust. In the theatre or arena, among beings who are not yet free from hatred, who are bound by the bondage of hatred, an actor entertains them with infuriating things that excite them even more strongly to hatred. In the theatre or arena, among beings who are not yet free from delusion, who are bound by the bondage of delusion, an actor entertains them with bewildering things that excite them even more strongly to delusion.",
    "sn42.2:3": "When this was said, Talapuṭa the troupe headman cried out and burst into tears.The Blessed One said:\"So I did not get through to you when I said, ‘Enough, headman, let it be! Don’t ask me that!’\""
}