{
    "sn42.13:1": "On one occasion the Blessed One was dwelling among the Koliyans where there was a town of the Koliyans named Uttarā. Then Paṭaliya the headman approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "sn42.13:2": "\"I have heard, venerable sir: ‘The ascetic Gotama knows magic.’[n.358]Samaṇo Gotamo māyaṃ jānāti.AtMN I 375,1–14the Jains proclaim, \"The ascetic Gotama is a magician(māyāvī); he knows a converting magic(āvaṭṭiniṁ māyaṁ jānāti)by which he converts the disciples of other teachers.\" The same charge comes up for discussion atAN II 190–94.I hope, venerable sir, that those who say, ‘The ascetic Gotama knows magic,’ state what has been said by the Blessed One and do not misrepresent him with what is contrary to fact; that they explain in accordance with the Dhamma, and that no reasonable consequence of their assertion gives ground for criticism. For we would not wish to misrepresent the Blessed One, venerable sir.\"",
    "sn42.13:3": "\"What do you think, headman? Do you know the Koliyans’ hirelings with drooping head-dresses?\"[n.60]Lambacūḷakā bhaṭā.Spkgives no help, but Rhys Davids interprets the passage thus in hisBuddhist India(p. 21): \"The Koliyan central authorities were served by a special body of peons, or police, distinguished, as by a kind of uniform, from which they took their name, by a special head-dress. These particular men had a bad reputation for extortion and violence.\"",
    "sn42.13:4": "\"I understand, headman, the destruction of life, and the result of the destruction of life, and I understand how one who destroys life, faring along, with the breakup of the body, after death, is reborn in a state of misery, in a bad destination, in the nether world, in hell.",
    "sn42.13:5": "\"There are, headman, some ascetics and brahmins who hold such a doctrine and view as this: ‘Anyone at all who destroys life experiences pain and grief in this very life. Anyone at all who takes what is not given … who engages in sexual misconduct … who speaks falsely experiences pain and grief in this very life.’",
    "sn42.13:6": "\"Someone here, headman, is seen garlanded and adorned, freshly bathed and groomed, with hair and beard trimmed, enjoying sensual pleasures with women as if he were a king. They ask someone about him: ‘Sir, what has this man done, that he has been garlanded and adorned … enjoying sensual pleasures with women as if he were a king?’sn.iv.344They answer: ‘Sir, this man attacked the king's enemy and took his life. The king was pleased with him and bestowed a reward upon him. That is why this man is garlanded and adorned … enjoying sensual pleasures with women as if he were a king.’",
    "sn42.13:7": "\"Then, headman, someone here is seen with his arms tightly bound behind him with a strong rope, his head shaven, being led around from street to street, from square to square, to the ominous beating of a drum, and then taken out through the south gate and beheaded to the south of the city. They ask someone about him: ‘Sir, what has this man done, that with his arms tightly tied behind his back … he is beheaded to the south of the city?’ They answer: ‘Sir, this man, an enemy of the king, has taken the life of a man or a woman. That is why the rulers, having had him arrested, imposed such a punishment upon him.’",
    "sn42.13:8": "\"What do you think, headman, have you ever seen or heard of such a case?\"",
    "sn42.13:9": "\"Then, headman, someone here is seen garlanded and adorned, freshly bathed and groomed, with hair and beard trimmed, enjoying sensual pleasures with women as if he were a king. They ask someone about him: ‘Sir, what has this man done, that he has been garlanded and adorned … enjoying sensual pleasures with women as if he were a king?’ They answer: ‘Sir, this man attacked the king's enemy and stole a gem. The king was pleased with him and bestowed a reward upon him. That is why this man is garlanded and adorned … enjoying sensual pleasures with women as if he were a king.’",
    "sn42.13:10": "\"Then, headman, someone here is seen with his arms tightly bound behind him with a strong rope, his head shaven, being led around from street to street, from square to square, to the ominous beating of a drum, and then taken out through the south gate and beheaded to the south of the city. They ask someone about him: ‘Sir, what has this man done, that with his arms tightly bound behind him … he is beheaded to the south of the city?’ They answer: ‘Sir, this man, an enemy of the king, stole something from a village or a forest, he committed theft. That is why the rulers, having had him arrested, imposed such a punishment on him.’",
    "sn42.13:11": "\"Then, headman, someone here is seen garlanded and adorned, freshly bathed and groomed, with hair and beard trimmed, enjoying sensual pleasures with women as if he were a king. They ask someone about him: ‘Sir, what has this man done, that he has been garlanded and adorned … enjoying sensual pleasures with women as if he were a king?’ They answer: ‘Sir, this man seduced the wives of the king's enemy. The king was pleased with him and bestowed a reward upon him. That is why this man is garlanded and adorned … enjoying sensual pleasures with women as if he were a king.’",
    "sn42.13:12": "\"Then, headman, someone here is seen with his arms tightly bound behind him with a strong rope, his head shaven, being led around from street to street, from square to square, to the ominous beating of a drum, and then taken out through the south gate and beheaded to the south of the city. They ask someone about him: ‘Sir, what has this man done, that with his arms tightly bound behind him … he is beheaded to the south of the city?’ They answer: ‘Sir, this man seduced women and girls of good families. That is why the rulers, having had him arrested, imposed such a punishment upon him.’",
    "sn42.13:13": "\"Then, headman, someone here is seen garlanded and adorned, freshly bathed and groomed, with hair and beard trimmed, enjoying sensual pleasures with women as if he were a king. They ask someone about him: ‘Sir, what has this man done, that he has been garlanded and adorned … enjoying sensual pleasures with women as if he were a king?’ They answer: ‘Sir, this man amused the king with false speech. The king was pleased with him and bestowed a reward upon him. That is why this man is garlanded and adorned … enjoying sensual pleasures with women as if he were a king.’",
    "sn42.13:14": "\"Then, headman, someone here is with his arms tightly bound behind him with a strong rope, his head shaven, being led around from street to street, from square to square, to the ominous beating of a drum, and then taken out through the south gate and beheaded to the south of the city. They ask someone about him: ‘Sir, what has this man done, that with his arms tightly bound behind him … he is beheaded to the south of the city?’ They answer: ‘Sir, this man has brought to ruin a householder or a householder's son with false speech. That is why the rulers, having had him arrested, imposed such a punishment upon him.’",
    "sn42.13:15": "\"It is wonderful, venerable sir! It is amazing, venerable sir! I have a rest house in which there are beds, seats, a waterpot, and an oil lamp. When any ascetic or brahmin comes to reside there, then I share it with him to the best of my means and ability. In the past, venerable sir, four teachers—holding different views, with different convictions, different preferences—came to dwell in that rest house.",
    "sn42.13:16": "\"One teacher held such a doctrine and view as this:[n.361] See SN24.5, III, n.254.‘There is nothing given, nothing offered, nothing presented in charity; no fruit or result of good and bad actions; no this world, no other world; no mother, no father; no beings who are reborn spontaneously; no ascetics and brahmins faring and practising rightly in the world who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’",
    "sn42.13:17": "\"One teacher held such a doctrine and view as this: ‘There is what is given,sn.iv.349what is offered, what is presented in charity; there is fruit and result of good and bad actions; there is this world and the other world; there is mother and father; there are beings who are reborn spontaneously; there are ascetics and brahmins faring and practising rightly in the world who, having realized this world and the other world for themselves by direct knowledge, make them known to others.’",
    "sn42.13:18": "\"One teacher held such a doctrine and view as this:[n.362] See SN24.6, III, n.255.‘When one acts or makes others act, when one mutilates or makes others mutilate, when one tortures or makes others inflict torture, when one inflicts sorrow or makes others inflict sorrow, when one oppresses or makes others inflict oppression, when one intimidates or makes others inflict intimidation, when one destroys life, takes what is not given, breaks into houses, plunders wealth, commits burglary, ambushes highways, seduces another's wife, utters falsehood—no evil is done by the doer. If, with a razor-rimmed wheel, one were to make the living beings of this earth into one mass of flesh, into one heap of flesh, because of this there would be no evil and no outcome of evil. If one were to go along the south bank of the Ganges killing and slaughtering, mutilating and making others mutilate, torturing and making others inflict torture, because of this there would be no evil and no outcome of evil. If one were to go along the north bank of the Ganges giving gifts and making others give gifts, making offerings and making others make offerings, because of this there would be no merit and no outcome of merit. By giving, by taming oneself, by self-control, by speaking truth, there is no merit and no outcome of merit.’",
    "sn42.13:19": "\"One teacher held such a doctrine and view as this: ‘When one acts or makes others act, when one mutilates or makes others mutilate …sn.iv.350… evil is done by the doer. If, with a razor-rimmed wheel, one were to make the living beings of this earth into one mass of flesh, into one heap of flesh, because of this there would be evil and an outcome of evil. If one were to go along the south bank of the Ganges killing and slaughtering, mutilating and making others mutilate, torturing and making others inflict torture, because of this there would be evil and an outcome of evil. If one were to go along the north bank of the Ganges giving gifts and making others give gifts, making offerings and making others make offerings, because of this there would be merit and an outcome of merit. By giving, by taming oneself, by self-control, by speaking truth, there is merit and an outcome of merit.’",
    "sn42.13:20": "\"There arose in me, venerable sir, the perplexity and doubt: ‘Which of these honourable ascetics and brahmins speak truth and which speak falsehood?’\"",
    "sn42.13:21": "\"It is fitting for you to be perplexed, headman, fitting for you to doubt. Doubt has arisen in you about a perplexing matter.\"",
    "sn42.13:22": "\"There is, headman, concentration of the Dhamma. If you were to obtain concentration of mind in that, you might abandon this state of perplexity.[n.363]Spkproposes alternative interpretations ofdhammasamādhiandcittasamādhi:(i)dhammasamādhiis the dhamma of the ten wholesome courses of action,cittasamādhithe four paths along with insight; (ii) the five dhamma (mentioned below)—namely, gladness, rapture, tranquillity, happiness, and concentration—are calleddhammasamādhi,whilecittasamādhiis again the four paths along with insight; (iii) the ten wholesome courses of action and the four divine abodes aredhammasamādhi,the one-pointedness of mind arisen for one who fulfils thisdhammasamādhiiscittasamādhi.And what, headman, is concentration of the Dhamma?",
    "sn42.13:23": "\"Then, headman, that noble disciple—who is thus devoid of covetousness, devoid of ill will, unconfused, clearly comprehending, ever mindful—dwells pervading one quarter with a mind imbued with lovingkindness, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with lovingkindness, vast, exalted, measureless, without hostility, without ill will.",
    "sn42.13:24": "\"Then, headman, that noble disciple—who is thus devoid of covetousness, devoid of ill will, unconfused, clearly comprehending, ever mindful—dwells pervading one quarter with a mind imbued with lovingkindness … without ill will.",
    "sn42.13:25": "\"Then, headman, that noble disciple—who is thus devoid of covetousness, devoid of ill will, unconfused, clearly comprehending, ever mindful—dwells pervading one quarter with a mind imbued with lovingkindness …sn.iv.353without ill will.",
    "sn42.13:26": "\"Then, headman, that noble disciple—who is thus devoid of covetousness, devoid of ill will, unconfused, clearly comprehending, ever mindful—dwells pervading one quarter with a mind imbued with lovingkindness …sn.iv.354… without ill will.",
    "sn42.13:27": "\"Then, headman, that noble disciple—who is thus devoid of covetousness, devoid of ill will, unconfused, clearly comprehending, ever mindful—dwells pervading one quarter with a mind imbued with compassion …sn.iv.355… with a mind imbued with altruistic joy …",
    "sn42.13:28": "… with a mind imbued with equanimity, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with equanimity, vast, exalted, measureless, without hostility, without ill will.",
    "sn42.13:29": "\"Then, headman, that noble disciple—who is thus devoid of covetousness, devoid of ill will, unconfused, clearly comprehending, ever mindful—dwells pervading one quarter with a mind imbued with compassion … with a mind imbued with altruistic joy … with a mind imbued with equanimity …sn.iv.356… without ill will.",
    "sn42.13:30": "…",
    "sn42.13:31": "…",
    "sn42.13:32": "When this was said, Paṭaliya the headman said to the Blessed One: \"Magnificent, venerable sir! … From today let the Blessed One remember me as a lay follower who has gone for refuge for life.\"sn.iv.359"
}