{
    "sn42.6:1": "On one occasion the Blessed One was dwelling at Nalanda in Pavarika's Mango Grove.sn.iv.32Then Asibandhakaputta the headman approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "sn42.6:2": "\"Venerable sir, the brahmins of the western region—those who carry around waterpots, wear garlands of water plants, immerse themselves in water, and tend the sacred fire—are said to direct a dead person upwards, to guide him along, and conduct him to heaven.[n.34] The three verbs areuyyāpenti(glossedupari yāpenti),saññāpenti(glossed samma ñāpenti), andsaggaṁ okkāmenti,on whichSpksays: \"They stand around him saying, ‘Go, sir, to the brahma world; go, sir, to the brahma world,’ and thus make him enter(pavesenti)heaven.\"But the Blessed One, the Arahant, the Perfectly Enlightened One, is able to bring it about that with the breakup of the body, after death, the entire world might be reborn in a good destination, in a heavenly world.\"",
    "sn42.6:3": "\"Well then, headman, I will question you about this. Answer as you see fit.",
    "sn42.6:4": "What do you think, headman? Suppose there is a person here who destroys life, takes what is not given, engages in sexual misconduct, speaks falsely, speaks divisively, speaks harshly, chatters idly, one who is covetous, full of ill will, and holds wrong view. Then a great crowd of people would come together and assemble around him, and they would send up prayers and recite praise and circumambulate him making reverential salutations, saying: ‘With the breakup of the body, after death, may this person be reborn in a good destination, in a heavenly world.’ What do you think, headman? Because of the prayers of the great crowd of people, because of their praise, because they circumambulate him making reverential salutations, would that person, with the breakup of the body, after death, be reborn in a good destination, in a heavenly world?\"",
    "sn42.6:5": "\"Suppose, headman, a person would hurl a huge boulder into a deep pool of water. Then a great crowd of people would come together and assemble around it, and they would send up prayers and recite praise and circumambulate it making reverential salutations, saying: ‘Emerge, good boulder! Rise up,sn.iv.313good boulder! Come up on to high ground, good boulder!’ What do you think, headman? Because of the prayers of the great crowd of people, because of their praise, because they circumambulate it making reverential salutations, would that boulder emerge, rise up, and come up on to high ground?\"",
    "sn42.6:6": "\"What do you think, headman? Suppose there is a person here who abstains from the destruction of life, from taking what is not given, from sexual misconduct, from false speech, from divisive speech, from harsh speech, from idle chatter, one who is not covetous, without ill will, who holds right view. Then a great crowd of people would come together and assemble around him, and they would send up prayers and recite praise and circumambulate him making reverential salutations, saying: ‘With the breakup of the body, after death, may this person be reborn in a state of misery, in a bad destination, in the nether world, in hell.’ What do you think, headman? Because of the prayers of the great crowd of people, because of their praise, because they circumambulate him making reverential salutations, would that person, with the breakup of the body, after death, be reborn in a state of misery … in hell?\"",
    "sn42.6:7": "\"Suppose, headman, a man submerges a pot of ghee or a pot of oil in a deep pool of water and breaks it. Any of its shards or fragments there would sink downwards, but the ghee or oil would rise upwards.sn.iv.314Then a great crowd of people would come together and assemble around it, and they would send up prayers and recite praise and circumambulate it making reverential salutations, saying: ‘Sink down, good ghee or oil! Settle, good ghee or oil! Go downwards, good ghee or oil!’ What do you think, headman? Because of the prayers of the great crowd of people, because of their praise, because they circumambulate it making reverential salutations, would that ghee or oil sink down or settle or go downwards?\"",
    "sn42.6:8": "\"So, too, headman, if a person is one who abstains from the destruction of life … who holds right view, even though a great crowd of people would come together and assemble around him … still, with the breakup of the body, after death, that person will be reborn in a good destination, in a heavenly world.\""
}