{
    "sn43.12:1": "\"Bhikkhus, I will teach you the unconditioned and the path leading to the unconditioned. Listen to that … .",
    "sn43.12:2": "ii… \"And what, bhikkhus, is the path leading to the unconditioned? Insight: this is called … the path leading to the unconditioned … .\"",
    "sn43.12:3": "iii… \"And what, bhikkhus, is the path leading to the unconditioned?sn.iv.6Concentration with thought and examination: this is called the path leading to the unconditioned … .\"",
    "sn43.12:4": "vi… \"And what, bhikkhus, is the path leading to the unconditioned? Emptiness concentration … .\"",
    "sn43.12:5": "ix… \"And what, bhikkhus, is the path leading to the unconditioned? Here, bhikkhus, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world: this is called the path leading to the unconditioned … .\"",
    "sn43.12:6": "xiii… \"And what, bhikkhus, is the path leading to the unconditioned? Here, bhikkhus, a bhikkhu generates desire for the nonarising of unarisen evil unwholesome states; he makes an effort, arouses energy, applies his mind, and strives: this is called the path leading to the unconditioned … .\"",
    "sn43.12:7": "xvii… \"And what, bhikkhus, is the path leading to the unconditioned? Here, bhikkhus, a bhikkhu develops the basis for spiritual power that possesses concentration due to desire and volitional formations of striving: this is called the path leading to the unconditioned … .\"",
    "sn43.12:8": "xxi… \"And what, bhikkhus, is the path leading to the unconditioned? Here, bhikkhus, a bhikkhu develops the faculty of faith, which is based upon seclusion, dispassion, and cessation, maturing in release: this is called the path leading to the unconditioned … .\"sn.iv.366",
    "sn43.12:9": "xxvi… \"And what, bhikkhus, is the path leading to the unconditioned? Here, bhikkhus, a bhikkhu develops the power of faith, which is based upon seclusion, dispassion, and cessation, maturing in release: this is called the path leading to the unconditioned … .\"",
    "sn43.12:10": "xxxi… \"And what, bhikkhus, is the path leading to the unconditioned? Here, bhikkhus, a bhikkhu develops the enlightenment factor of mindfulness, which is based upon seclusion, dispassion, and cessation, maturing in release: this is called the path leading to the unconditioned … .\"",
    "sn43.12:11": "… \"And what, bhikkhus, is the path leading to the unconditioned? Here, bhikkhus, a bhikkhu develops right view, which is based upon seclusion, dispassion, and cessation, maturing in release: this is called the path leading to the unconditioned … .\"sn.iv.368"
}