{
    "sn44.8:1": "Then the wanderer Vacchagotta approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to him:",
    "sn44.8:2": "\"What, Master Gotama, is the cause and reason why, when wanderers of other sects are asked such questions, they give such answers as: ‘The world is eternal’ … or ‘The Tathāgata neither exists nor does not exist after death.’ And what is the cause and reason why, when Master Gotama is asked such questions, he does not give such answers?\"",
    "sn44.8:3": "\"Vaccha, wanderers of other sects regard form as self, or self as possessing form, or form as in self, or self as in form. They regard feeling as self … perception as self … volitional formations as self … consciousness as self, or self as possessing consciousness, or consciousness as in self, or self as in consciousness. Therefore,sn.iv.96when the wanderers of other sects are asked such questions, they give such answers as: ‘The world is eternal’ … or ‘The Tathāgata neither exists nor does not exist after death.’ But, Vaccha, the Tathāgata, the Arahant, the Perfectly Enlightened One, does not regard form as self … or self as in consciousness. Therefore, when the Tathāgata is asked such questions, he does not give such answers.\"",
    "sn44.8:4": "Then the wanderer Vacchagotta rose from his seat and approached the Venerable Mahāmoggallāna. He exchanged greetings with the Venerable Mahāmoggallāna … and said to him:",
    "sn44.8:5": "\"What, Master Moggallana, is the cause and reason why, when wanderers of other sects are asked such questions, they give such answers as: ‘The world is eternal’ … or ‘The Tathāgata neither exists nor does not exist after death’? And what is the cause and reason why when the ascetic Gotama is asked such questions, he does not give such answers?\"sn.iv.397",
    "sn44.8:6": "\"Vaccha, wanderers of other sects regard form as self … or self as in consciousness. Therefore, when the wanderers of other sects are asked such questions, they give such answers as: ‘The world is eternal’ … or ‘The Tathāgata neither exists nor does not exist after death.’ But, Vaccha, the Tathāgata, the Arahant, the Perfectly Enlightened One, does not regard form as self … or self as in consciousness. Therefore, when the Tathāgata is asked such questions, he does not give such answers.\"",
    "sn44.8:7": "\"It is wonderful, Master Moggallana! It is amazing, Master Moggallana! How the meaning and the phrasing of both teacher and disciple coincide and agree with each other and do not diverge, that is, in regard to the chief matter. Just now, Master Moggallana, I approached the ascetic Gotama and asked him about this matter. The ascetic Gotama explained this matter to me in exactly the same terms and phrases that Master Moggallana used. It is wonderful, Master Moggallana! It is amazing, Master Moggallana! How the meaning and the phrasing of both teacher and disciple coincide and agree with each other and do not diverge, that is, in regard to the chief matter.\"sn.iv.398"
}