{
    "sn44.6:1": "On one occasion the Venerable Sāriputta and the Venerable Mahakoṭṭhita were dwelling at Baraṇasī in the Deer Park at Isipatana. Then, in the evening, the Venerable Sāriputta emerged from seclusion and approached the Venerable Mahakoṭṭhita. He exchanged greetings with the Venerable Mahakoṭṭhita and, when they had concluded their greetings and cordial talk, he sat down to one side and said to him:",
    "sn44.6:2": "\"Friend, it is one who delights in form, who takes delight in form, who rejoices in form, and who does not know and see the cessation of form as it really is, that thinks:sn.iv.389‘The Tathāgata exists after death’ … or ‘The Tathāgata neither exists nor does not exist after death.’ It is one who delights in feeling … who delights in perception … who delights in volitional formations … who delights in consciousness, who takes delight in consciousness, who rejoices in consciousness, and who does not know and see the cessation of consciousness as it really is, that thinks: ‘The Tathāgata exists after death’ … or ‘The Tathāgata neither exists nor does not exist after death.’",
    "sn44.6:3": "\"But, friend, one who does not delight in form … who does not delight in feeling … who does not delight in perception … who does not delight in volitional formations … who does not delight in consciousness, who does not take delight in consciousness, who does not rejoice in consciousness, and who knows and sees the cessation of consciousness as it really is, does not think: ‘The Tathāgata exists after death’ … or ‘The Tathāgata neither exists nor does not exist after death.’",
    "sn44.6:4": "\"But, friend, could there be another method of explaining why this has not been declared by the Blessed One?\"",
    "sn44.6:5": "\"But, friend, could there be another method of explaining why this has not been declared by the Blessed One?\"",
    "sn44.6:6": "\"But, friend, could there be another method of explaining why this has not been declared by the Blessed One?\"",
    "sn44.6:7": "\"But, friend, could there be another method of explaining why this has not been declared by the Blessed One?\""
}