{
    "sn44.7:1": "Then the wanderer Vacchagotta approached the Venerable Mahāmoggallāna and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Venerable Mahāmoggallāna:",
    "sn44.7:2": "\"How is it, Master Moggallana, is the world eternal?\"",
    "sn44.7:3": "\"What, Master Moggallana, is the cause and reason why, when wanderers of other sects are asked such questions, they give such answers as: ‘The world is eternal’ or ‘The world is not eternal’; or ‘The world is finite’ or ‘The world is infinite’; or ‘The soul and the body are the same’ or ‘The soul is one thing, the body is another’; or ‘The Tathāgata exists after death,’ or ‘The Tathāgata does not exist after death,’ or ‘The Tathāgata both exists and does not exist after death,’ or ‘The Tathāgata neither exists nor does not exist after death’?sn.iv.9And what is the cause and reason why, when the ascetic Gotama is asked such questions, he does not give such answers?\"",
    "sn44.7:4": "\"Vaccha, wanderers of other sects regard the eye thus: ‘This is mine, this I am, this is my self.’ They regard the ear … the nose … the tongue … the body … the mind thus: ‘This is mine, this I am, this is my self.’ Therefore, when the wanderers of other sects are asked such questions, they give such answers as: ‘The world is eternal’ … or ‘The Tathāgata neither exists nor does not exist after death.’ But, Vaccha, the Tathāgata, the Arahant, the Perfectly Enlightened One, regards the eye thus: ‘This is not mine, this I am not, this is not my self.’ He regards the ear … the mind thus: ‘This is not mine, this I am not, this is not my self.’ Therefore, when the Tathāgata is asked such questions, he does not give such answers.\"",
    "sn44.7:5": "Then the wanderer Vacchagotta rose from his seat and approached the Blessed One. He exchanged greetings with the Blessed One …and said to him:\"How is it, good Gotama, is the world eternal?\"All as above down to:",
    "sn44.7:6": "\"What, Master Gotama, is the cause and reason why, when wanderers of other sects are asked such questions, they give such answers as: ‘The world is eternal’ … or ‘The Tathāgata neither exists nor does not exist after death’? And what is the cause and reason why, when the ascetic Gotama is asked such questions, he does not give such answers?\"",
    "sn44.7:7": "\"Vaccha, wanderers of other sects regard the eye … the mind thus: ‘This is mine, this I am, this is my self.’ Therefore, when the wanderers of other sects are asked such questions, they give such answers as: ‘The world is eternal’ … or ‘The Tathāgata neither exists nor does not exist after death.’ But, Vaccha, the Tathāgata, the Arahant, the Perfectly Enlightened One, regards the eye … the mind thus: ‘This is not mine, this I am not, this is not my self.’ Therefore, when the Tathāgata is asked such questions, he does not give such answers.\"",
    "sn44.7:8": "\"It is wonderful, Master Gotama! It is amazing, Master Gotama! How the meaning and the phrasing of both teacher and disciple coincide and agree with each other and do not diverge, that is, in regard to the chief matter. Just now, Master Gotama, I approached the ascetic Moggallanasn.iv.395and asked him about this matter. The ascetic Moggallana explained this matter to me in exactly the same terms and phrases that Master Gotama used. It is wonderful, Master Gotama! It is amazing, Master Gotama! How the meaning and the phrasing of both teacher and disciple coincide and agree with each other and do not diverge, that is, in regard to the chief matter.\""
}