{
    "sn45.2:1": "Thus have I heard. On one occasion the Blessed One was dwelling among the Sakyans where there was a town of the Sakyans named Nagaraka.[n.4] This entire sutta is quoted by the Buddha atSN3:8, in a conversation with King Pasenadi.Spkhas commented on the text there and thus passes over it here. I draw the excerpts below from Spk's exegesis of the earlier text. In Be and Ee the name of the town is Sakkara.Then the Venerable Ānanda approached the Blessed One. Having approached, he paid homage to the Blessed One, sat down to one side, and said to him:",
    "sn45.2:2": "\"Not so, Ānanda! Not so, Ānanda! This is the entire holy life, Ānanda, that is, good friendship, good companionship, good comradeship. When a bhikkhu has a good friend, a good companion, a good comrade, it is to be expected that he will develop and cultivate the Noble Eightfold Path.[n.6] C.Rh.D renderskalyāṇamitto bhikkhu\"a bhikkhu who is a friend of righteousness\" (KS 1:113); Woodward, \"a monk who is a friend of what is lovely\" (KS 5:); Ireland, \"a bhikkhu who is a friend of the good\" (SN-Anth 1:75). These renderings all rest on a misunderstanding of the grammatical form of the expression. As an independent substantive,kalyāṇamittameans a good friend, i.e., a spiritual friend who gives advice, guidance, and encouragement. When used in apposition to bhikkhu, however,kalyāṇamittabecomes abahubbbihicompound, and the whole expression means \"a bhikkhu who has a good friend.\" To represent this formally:yassa bhikkhuno kalyāṇamittaṁ hoti(notyo bhikkhu kalyāṇassa mittaṁ hoti),so kalyāṇamitto bhikkhū ti vuccati(my own etymology). On the importance of the good friend, see belowSN45:49,SN45:63,SN45:77and alsoAN9.1(AN IV 351–53 =Ud 4.1).Spk: With children, it isn’t possible to say, \"So much comes from the mother, so much from the father\"; the same is true in this case too. One cannot say, \"So much of right view, etc., comes from good friends, so much from one's own manly effort.\" The Blessed One says in effect: \"The four paths, the four fruits, etc., are all rooted in the good friend.\"",
    "sn45.2:3": "\"And how, Ānanda, does a bhikkhu who has a good friend, a good companion, a good comrade, develop and cultivate the Noble Eightfold Path? Here, Ānanda, a bhikkhu develops right view, which is based upon seclusion, dispassion, and cessation, maturing in release.[n.7] Thevivekanisṣitaformula is affixed to the path factors at Vibh 26.Spkexplains seclusion(viveka)in the light of the commentarial notion of the fivefold seclusion: (i) \"in a particular respect\" (tadaṅga, temporarily, by the practice of insight); (ii) by suppression (vikkhambhana, temporarily, by attainment of jhāna); (iii) by eradication (samuccheda,permanently, by the supramundane path); (iv) by subsiding (paṭippassaddhi,permanently, in fruition); and (v) by escape (nissaraṇa,permanently, in Nibbāna). In the next two paragraphs I translate from Spk.\"He develops right view dependent on seclusion(vivekanissitaṁ): dependent on seclusion in a particular respect, dependent on seclusion by eradication, dependent on seclusion by escape. For at the moment of insight this meditator, devoted to the development of the noble path, develops right view dependent on seclusion in a particular respect by way of function and dependent on seclusion by escape as inclination (since he inclines to Nibbāna); at the time of the path, he develops it dependent on seclusion by eradication as function and dependent on seclusion by escape as object (since the path takes Nibbāna as object). The same method of explanation is also extended to the terms ‘dependent on dispassion’(virāganissita)and ‘dependent on cessation’(nirodhanissita).\"Release(vossagga)is twofold, release as giving up(pariccāga)and release as entering into(pakkhandana). ‘Release as giving up’ is the abandoning(pahāna)of defilements: in a particular respect(tadaṅgavasena)on the occasion of insight, by eradication(samucchedavasena)at the moment of the supramundane path. ‘Release as entering into’ is the entering into Nibbāna: by way of inclination towards that(tadninnabhāvena)on the occasion of insight, and by making it the object(ārammaṇakaraṇena)at the moment of the path. Both methods are suitable in this exposition, which combines the mundane (insight) and the supramundane (the path). The path is maturing in release(vossaggapariṇāmi)because it is maturing towards or has matured in release, meaning that it is ripening towards or has ripened (in release). The bhikkhu engaged in developing the path is ‘ripening’ the path for the sake of giving up defilements and entering into Nibbāna, and he develops it so that it has ‘ripened’ thus.\"When I translatevossaggaas \"release,\" this should be understood as the act of releasing or the state of having released rather than as the experience of being released.Vossaggaandpaṭinissaggaare closely related, both etymologically and in meaning, but as used in the Nikayas a subtle difference seems to separate them.Paṭinissagga,here translated \"relinquishment,\" pertains primarily to the phase of insight and thus might be understood as the active elimination of defilements through insight into the impermanence of all conditioned things.Vossagga,as that in which the path matures, probably signifies the final state in which all attachment is utterly given up, and thus comes close in meaning to Nibbāna as the goal of the path.Paṭinissaggaoccurs as a distinct contemplation, the last, in the sixteen steps in the development of mindfulness of breathing (seeSN54:1). ThoughSpkglosses it in the same way as it doesvossagga(see n.29below), in the suttas themselves the two terms are used with different nuances.He develops right intention … right speech … right action … right livelihood … right effort … right mindfulness … right concentration, which is based upon seclusion, dispassion, and cessation, maturing in release. It is in this way, Ānanda, that a bhikkhu who has a good friend, a good companion, a good comrade, develops and cultivates the Noble Eightfold Path.sn.v.",
    "sn45.2:4": "\"By the following method too, Ānanda, it may be understood how the entire holy life is good friendship, good companionship, good comradeship: by relying upon me as a good friend, Ānanda, beings subject to birth are freed from birth; beings subject to aging are freed from aging; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, displeasure, and despair are freed from sorrow, lamentation, pain, displeasure, and despair. By this method, Ānanda, it may be understood how the entire holy life is good friendship, good companionship, good comradeship.\""
}