{
    "sn45.8:1": "At Sāvatthī. \"Bhikkhus, I will teach you the Noble Eightfold Path and I will analyse it for you. Listen to that and attend closely, I will speak.\"",
    "sn45.8:2": "\"And what, bhikkhus, is the Noble Eightfold Path? Right view … right concentration.[n.16] The definitions of the path factors to follow are also atDNandMN3etc. In the Abhidhamma Piṭaka, they are incorporated into the formal treatment of the path according to the sutta method in the Suttantabhajaniya at Vibh 35–36 (but see the following note).",
    "sn45.8:3": "\"And what, bhikkhus, is right view? Knowledge of suffering, knowledge of the origin of suffering,sn.v.9knowledge of the cessation of suffering, knowledge of the way leading to the cessation of suffering: this is called right view.",
    "sn45.8:4": "\"And what, bhikkhus, is right intention? Intention of renunciation, intention of non-ill will, intention of harmlessness: this is called right intention.",
    "sn45.8:5": "\"And what, bhikkhus, is right speech? Abstinence from false speech, abstinence from divisive speech, abstinence from harsh speech, abstinence from idle chatter: this is called right speech.",
    "sn45.8:6": "\"And what, bhikkhus, is right action? Abstinence from the destruction of life, abstinence from taking what is not given, abstinence from sexual misconduct:[n.17] All eds. of SN have hereabrahmacariyā veramaṇī,but elsewhere the reading iskāmesu micchācāra veramaṇī,\"abstinence from sexual misconduct\" (seeMN3). The former phrase is found in the precept observed by monks and nuns, the latter in the precept undertaken by the laity.Spkdoes not comment, which suggests that the SN reading is the result of a scribal error, probably introduced after the age of the commentary; otherwise Spk surely would have explained the variant. I have therefore translated on the assumption that the correct reading should bekāmesu micchācāra veramaṇī.this is called right action.",
    "sn45.8:7": "\"And what, bhikkhus, is right livelihood? Here a noble disciple, having abandoned a wrong mode of livelihood, earns his living by a right livelihood: this is called right livelihood.",
    "sn45.8:8": "\"And what, bhikkhus, is right effort? Here, bhikkhus, a bhikkhu generates desire for the nonarising of unarisen evil unwholesome states; he makes an effort, arouses energy, applies his mind, and strives. He generates desire for the abandoning of arisen evil unwholesome states … . He generates desire for the arising of unarisen wholesome states … . He generates desire for the maintenance of arisen wholesome states, for their nondecay, increase, expansion, and fulfilment by development; he makes an effort, arouses energy, applies his mind, and strives. This is called right effort.",
    "sn45.8:9": "\"And what, bhikkhus is right mindfulness? Here, bhikkhus, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating feelings in feelings, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating mind in mind, ardent,sn.v.10clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating phenomena in phenomena, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. This is called right mindfulness.",
    "sn45.8:10": "\"And what, bhikkhus, is right concentration? Here, bhikkhus, secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and dwells in the first jhāna, which is accompanied by thought and examination, with rapture and happiness born of seclusion. With the subsiding of thought and examination, he enters and dwells in the second jhāna, which has internal confidence and unification of mind, is without thought and examination, and has rapture and happiness born of concentration. With the fading away as well of rapture, he dwells equanimous and, mindful and clearly comprehending, he experiences happiness with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ With the abandoning of pleasure and pain, and with the previous passing away of joy and displeasure, he enters and dwells in the fourth jhāna, which is neither painful nor pleasant and includes the purification of mindfulness by equanimity. This is called right concentration.\""
}