{
    "sn45.4:1": "At Sāvatthī. Then, in the morning, the Venerable Ānanda dressed and, taking bowl and robe, entered Sāvatthī for alms. The Venerable Ānanda saw the brahmin Jaṇussoṇi departing from Sāvatthī in an all-white chariot drawn by mares.[n.9] The brahmin Jaṇussoṇi was a chaplain of King Pasenadi. He departs from Sāvatthī in a white chariot also atMN27(MNI 75, 5–7) andMN99(MNII 208, 24–25). According toSpk, once every six months he rode around the city in his chariot \"as if strewing the city with the excellence of his glory and prosperity.\"The horses yoked to it were white, its ornaments were white, the chariot was white, its upholstery was white, the reins, goad, and canopy were white, his turban, clothes, and sandals were white, and he was being fanned by a white chowry. People, having seen this, said: \"Divine indeed, sir, is the vehicle! It appears to be a divine vehicle indeed, sir!\"[n.0]Brahmaṁ vata bho yānaṁ, brahmayānarūpaṁ vata hoti.Here, brahma has the sense of best(seṭṭha).",
    "sn45.4:2": "Then, when the Venerable Ānanda had walked for alms in Sāvatthī and returned from his alms round, after his meal he approached the Blessed One,sn.v.5paid homage to him, sat down to one side, and said to him:",
    "sn45.4:3": "\"Here, venerable sir, in the morning I dressed and, taking bowl and robe, entered Sāvatthī for alms. I saw the brahmin Jaṇussoṇi departing from Sāvatthī in an all-white chariot drawn by mares … . People, having seen this, said: ‘Divine indeed, sir, is the vehicle! It appears to be a divine vehicle indeed, sir!’ Is it possible, venerable sir, to point out a divine vehicle in this Dhamma and Discipline?\"",
    "sn45.4:4": "\"It is possible, Ānanda,\" the Blessed One said. \"This is a designation for this Noble Eightfold Path: ‘the divine vehicle’ and ‘the vehicle of Dhamma’ and ‘the unsurpassed victory in battle.’",
    "sn45.4:5": "\"Right view, Ānanda, when developed and cultivated, has as its final goal the removal of lust, the removal of hatred, the removal of delusion. Right intention … Right concentration, when developed and cultivated,sn.v.6has as its final goal the removal of lust, the removal of hatred, the removal of delusion.",
    "sn45.4:6": "\"In this way, Ānanda, it may be understood how this is a designation for this Noble Eightfold Path: ‘the divine vehicle’ and ‘the vehicle of Dhamma’ and ‘the unsurpassed victory in battle.’\"",
    "sn45.4:7": "This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this:",
    "sn45.4:8": "\"Its qualities of faith and wisdomAre always yoked evenly together.[n.11] The relative pronoun yassa with which the verses begin is completed only by the demonstrative etad in the last verse. Since English does not lend itself to such complex syntax, I am compelled to break up the passage into shorter sentences. I rely onSpkin interpreting the verses. See the other chariot simile atSN1.46.Shame is its pole, mind its yoke-tie,Mindfulness the watchful charioteer.",
    "sn45.4:9": "\"The chariot's ornament is virtue,Its axle jhāna,[n.12]Jhānakkho.Spk: \"The axle made of jhāna by way of the five jhāna factors accompanying insight.\" The five jhāna factors are thought, examination, rapture, happiness, and one-pointedness of mind. Though when fully mature they bring the mind to the first jhāna, these factors are also present, though less prominently, in the concentration that accompanies insight meditation.energy its wheels;Equanimity keeps the burden balanced,Desirelessness serves as upholstery.",
    "sn45.4:10": "\"Good will, harmlessness, and seclusion:These are the chariot's weaponry,Forbearance its armour and shield,[n.13] I readvammasannāhowith Se, as against Becamma-and Eedhamma-.As it rolls towards security from bondage.",
    "sn45.4:11": "\"This divine vehicle unsurpassedOriginates from within oneself.[n.14]Spk: This vehicle of the path(maggayāna)is said to \"originate within oneself\"(attani sambhūtaṁ)because it is gained in dependence on one's own manly effort.The wise depart from the world in it,Inevitably winning the victory.\""
}