{
    "sn45.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn45.1:2": "\"Bhikkhus, ignorance is the forerunner in the entry upon unwholesome states, with shamelessness and fearlessness of wrongdoing following along.[n.1] Also at AN V 14, but withmicchāñāṇaandmicchāvimuttiadded to the “dark side,” andsammāñāṇaandsammāvimuttiadded to the “bright side.” The opening statements about ignorance and (just below) true knowledge are atIt 34,6-10. See tooMN III 76,1-9.Spk: Ignorance is the forerunner(pubbaṅgama)in two modes, as a conascent condition (sahajātavasena,a condition for simultaneously arisen states) and as a decisive-support condition (upanissayavasena, a strong causal condition for subsequently arisen states). Spk-pṭ: It is a forerunner by way of conascence when it makes associated states conform to its own mode of confusion about the object, so that they grasp impermanent phenomena as permanent, etc.; it is a forerunner by way of both conascence and decisive support when a person overcome by delusion engages in immoral actions. Shamelessness(ahirika)has the characteristic of lack of shame (alajjanā,or lack of conscience regarding evil); fearlessness of wrongdoing(anottappa), the characteristic of lack of fear (abhāyanā,regarding evil conduct). Spk glossesanudeva(oranvadevain Be):sah’ eva ekato’ va, na vinā tena uppajjati;\"it arises along with it, in unison, not without it.\"For an unwise person immersed in ignorance, wrong view springs up. For one of wrong view, wrong intention springs up. For one of wrong intention, wrong speech springs up. For one of wrong speech, wrong action springs up. For one of wrong action, wrong livelihood springs up. For one of wrong livelihood, wrong effort springs up. For one of wrong effort, wrong mindfulness springs up. For one of wrong mindfulness, wrong concentration springs up.",
    "sn45.1:3": "\"Bhikkhus, true knowledge is the forerunner in the entry upon wholesome states, with a sense of shame and fear of wrongdoing following along.[n.2]Spk: True knowledge(vijjā)is knowledge of one's responsibility for one's own action(kammassakatañāṇa). Here, too, it is a forerunner by way of both conascence and decisive support. Shame(hiri)and fear of wrongdoing(ottappa)are called \"the guardians of the world\"AN2.7-9(AN I 51,19–28). For a detailed discussion of hiri and ottappa, see As 124–27, presented more concisely at Vism 464–65 (Ppn 14:142).sn.v.2For a wise person who has arrived at true knowledge, right view springs up. For one of right view, right intention springs up. For one of right intention, right speech springs up. For one of right speech, right action springs up. For one of right action, right livelihood springs up. For one of right livelihood, right effort springs up. For one of right effort, right mindfulness springs up. For one of right mindfulness, right concentration springs up.\"[n.]Spksays that at the moment of the mundane path these are not all found together, but they are found together at the moment of the supramundane path. Even in the development of the mundane path it would be a mistake to see the eight factors as following in direct sequence. Right view is the guide for all the other path factors and the direct condition for right intention. Right view and right intention jointly condition the next three factors, which make up the virtue group. These in turn serve as the foundation for right effort and right mindfulness, the effort being the application of energy to the practice of the four establishments of mindfulness. The fruit of right effort and right mindfulness is right concentration."
}