{
    "sn46.39:1": "\"Bhikkhus, there are huge trees with tiny seeds and huge bodies, encirclers of other trees, and the trees which they encircle become bent, twisted, and split. And what are those huge trees with tiny seeds and huge bodies? The assattha, the banyan, the pilakkha, the udumbara, the kacchaka, and the kapitthana: these are those huge trees with tiny seeds and huge bodies, encirclers of other trees, and the trees which they encircle become bent, twisted, and split.[n.8] These trees are all of the type known as strangling figs. On their behaviour I cannot do better than to quote from E.J.H. Corner'sWayside Trees of Malaya,cited by Emeneau.The Strangling Figs in Sanskrit Literature,\" pp. 347–49: Fig-trees whose trunks are composed of a basket-work of interlacing and anastomosing roots are called strangling figs because normally they begin life on other trees and gradually squeeze them to death. Birds, squirrels, and monkeys, which eat the fruits, drop the seeds on the branches of the forest-trees, where they grow into epiphytic bushes that hold on by strong roots encircling the branches. From thence their roots spread down the trunk of the supporting tree to the ground, where they grow vigorously. Side-roots encircle the trunk, joining up with other side-roots where they touch, and aerial roots grow down into the soil from various heights … . [T]he supporting trunk becomes enveloped in a basket of fig-roots and the branches of the fig-bush begin to spread widely through the crown of its support. As the fig-roots and their supporting trunk increase in thickness they press upon each other, but the fig-roots, being the stronger, slowly crush the bark of the support against its wood, with the effect that the supporting trunk is gradually ringed, and its limbs begin to die back, its crown becoming stag-headed and uneven. A long struggle ensues between parasite and host, but if the fig-plant is vigorous it surely kills its support and finally stands in its place on a massive basket of roots.Two Jataka stories (Nos. 370 and 42) use the strangling fig to drive home the lesson that one should never tolerate the slightest evil, for while evil may appear innocuous in its origins it eventually proves fatal.So too, bhikkhus, when some clansman here has left behind sensual pleasures and gone forth from the household life into homelessness, he becomes bent, twisted, and split because of those same sensual pleasures, or because of others worse than them.",
    "sn46.39:2": "\"These five, bhikkhus, are obstructions, hindrances, encirclers of the mind, weakeners of wisdom. What five? Sensual desire is an obstruction, a hindrance encircling the mind, a weakener of wisdom. Ill will … Sloth and torpor … Restlessness and remorse … Doubt is an obstruction … a weakener of wisdom.sn.v.97These are the five obstructions, hindrances, encirclers of the mind, weakeners of wisdom.",
    "sn46.39:3": "\"These seven factors of enlightenment, bhikkhus, are nonobstructions, nonhindrances, nonencirclers of the mind; when developed and cultivated they lead to the realization of the fruit of true knowledge and liberation. What seven? The enlightenment factor of mindfulness is a nonobstruction … The enlightenment factor of equanimity is a nonobstruction. … These seven factors of enlightenment are nonobstructions, nonhindrances, nonencirclers of the mind; when developed and cultivated they lead to the realization of the fruit of true knowledge and liberation.\""
}