{
    "sn46.52:1": "Then, in the morning, a number of bhikkhus dressed and, taking their bowls and robes, entered Sāvatthī for alms. Then it occurred to them: \"It is still too early to walk for alms in Sāvatthī. Let us go to the park of the wanderers of other sects.\"",
    "sn46.52:2": "Then those bhikkhus went to the park of the wanderers of other sects. They exchanged greetings with those wanderers and, when they had concluded their greetings and cordial talk, sat down to one side. The wanderers then said to them:",
    "sn46.52:3": "\"Friends, the ascetic Gotama teaches the Dhamma to his disciples thus: ‘Come, bhikkhus, abandon the five hindrances, the corruptions of the mind that weaken wisdom, and develop correctly the seven factors of enlightenment.’ We too teach the Dhamma to our disciples thus: ‘Come, friends, abandon the five hindrances, the corruptions of the mind that weaken wisdom, and develop correctly the seven factors of enlightenment.’ So, friends, what here is the distinction, the disparity, the difference between the ascetic Gotama and us, that is, regarding the one Dhamma teaching and the other, regarding the one manner of instruction and the other?\"[n.98]Spksays that the teachers of other sects do not have any original teachings on the five hindrances and the seven enlightenment factors. When they teach their own disciples they plagiarize the Buddha’s teachings on these topics. Gethin points out, however, that the sutta itself does not go as far as the commentary but only stresses the differences between the two modes of teaching (Buddhist Path to Awakening,p. 180).",
    "sn46.52:4–7": "Then those bhikkhus neither delighted in nor rejected the statement of those wanderers. Without delighting in it, without rejecting it, they rose from their seats and left, thinking, \"We shall learn the meaning of this statement in the presence of the Blessed One.\"",
    "sn46.52:8": "\"Bhikkhus, when wanderers of other sects speak thus, they should be asked: ‘Friends, is there a method of exposition by means of which the five hindrances become ten, and the seven factors of enlightenment become fourteen?’ Being asked thus, those wanderers would not be able to reply and, further, they would meet with vexation. For what reason? Because that would not be within their domain. I do not see anyone, bhikkhus, in this world with its devas, Māra, and Brahma, in this generation with its ascetics and brahmins, its devas and humans, who could satisfy the mind with an answer to these questions except the Tathagata or a disciple of the Tathagata or one who has heard it from them.sn.v.110",
    "sn46.52:9": "\"And what, bhikkhus, is the method of exposition by means of which the five hindrances become ten?",
    "sn46.52:10": "\"And what, bhikkhus, is the method of exposition by means of which the seven factors of enlightenment become fourteen?[n.0] The bifurcation of each enlightenment factor is also found at Vibh 228, modelled on the present sutta.",
    "sn46.52:11": "\"Whenever one discriminates things internally with wisdom, examines them, makes an investigation of them, that is the enlightenment factor of discrimination of states; whenever one discriminates things externally with wisdom, examines them, makes an investigation of them, that is also the enlightenment factor of discrimination of states. Thus what is spoken of concisely as the enlightenment factor of discrimination of states becomes, by this method of exposition, twofold.",
    "sn46.52:12": "\"Whatever bodily energy there is, is the enlightenment factor of energy; whatever mental energy there is, is also the enlightenment factor of energy. Thus what is spoken of concisely as the enlightenment factor of energy becomes, by this method of exposition, twofold.",
    "sn46.52:13": "\"Whatever rapture there is accompanied by thought and examination is the enlightenment factor of rapture; whatever rapture there is without thought and examination is also the enlightenment factor of rapture.[n.101] The former is the rapture of the first jhāna, the latter the rapture of the second jhāna.Thus what is spoken of concisely as the enlightenment factor of rapture becomes, by this method of exposition, twofold.",
    "sn46.52:14": "\"Whatever tranquillity of body there is, is the enlightenment factor of tranquillity; whatever tranquillity of mind there is, is also the enlightenment factor of tranquillity.[n.102]Spkexplains tranquillity of body(kāyappassaddhi)as the tranquillizing of distress in the three aggregates (feeling, perception, volitional formations), tranquillity of mind(cittappassaddhi)as the tranquillizing of distress in the aggregate of consciousness. But see n.61above.Thus what is spoken of concisely as the enlightenment factor of tranquillity becomes, by this method of exposition, twofold.",
    "sn46.52:15": "\"Whatever concentration there is accompanied by thought and examination is the enlightenment factor of concentration; whatever concentration there is without thought and examination is also the enlightenment factor of concentration.[n.103] The former is the concentration of the first jhāna and the access to it; the latter, the concentration of the second jhāna and higher stages.Thus what is spoken of concisely as the enlightenment factor of concentration becomes, by this method of exposition, twofold.",
    "sn46.52:16": "\"Whatever equanimity there is regarding things internal is the enlightenment factor of equanimity; whatever equanimity there is regarding things external is also the enlightenment factor of equanimity. Thus what is spoken of concisely as the enlightenment factor of equanimity becomes, by this method of exposition, twofold."
}