{
    "sn46.30:1": "On one occasion the Blessed One was dwelling among the Sumbhas, where there was a town of the Sumbhas named Sedaka. Then the Venerable Udayī approached the Blessed One … and said to him:",
    "sn46.30:2": "\"It is wonderful, venerable sir! It is amazing, venerable sir, how helpful has been my devotion and reverence for the Blessed One, my sense of shame and fear of wrongdoing. For in the past, venerable sir, when I was still a householder, I did not have much concern for the Dhamma or the Saṅgha.[n.74] I have translated this passage according to its apparent sense, but it is hard to see howbahukataṁin the previous sentence, used as an abstract noun, can have the same meaning as it does, in negative form, inabahukatohere, an adjective set in apposition toahaṁ.Spkglossesabahukatowithakatabahumano,\"(i) was without much esteem,\" but passes overbahukataṁjust above.But when I considered my devotion and reverence for the Blessed One, and my sense of shame and fear of wrongdoing, I went forth from the household life into homelessness. The Blessed One taught me the Dhamma thus: ‘Such is form, such its origin, such its passing away; such is feeling … such is perception … such are volitional formations … such is consciousness, such its origin, such its passing away.’",
    "sn46.30:3": "\"Then, venerable sir, while I was staying in an empty hut following along with the surge and decline[n.75]Ukkujjāvakujjaṁ samparivattento.Spksays that arising is called surge(ukkujja)and fall is decline(avakujja). Thus he was exploring the aggregates by way of rise and fall(udayabbayavasena). His realization of the Four Noble Truths while contemplating rise and fall marks his attainment of the supramundane path.of the five aggregates subject to clinging, I directly knew as it really is: ‘This is suffering’;sn.v.90I directly knew as it really is: ‘This is the origin of suffering’; I directly knew as it really is: ‘This is the cessation of suffering’; I directly knew as it really is: ‘This is the way leading to the cessation of suffering.’ I have made the breakthrough to the Dhamma, venerable sir, and have obtained the path[n.76]Dhammo ca me bhante abhisamito, maggo ca paṭiladdho.The regular past participle ofabhisametiisabhisameta.Spk says that he has arrived at the Dhamma of insight(vipassanādhamma)and gained the path of insight(vipassanāmagga), but these expressions invariably indicate the realization of the supramundane Dhamma and the gaining of the supramundane path. The text does not specify his level of attainment, but it would be at least that of stream-enterer, implied by making \"the breakthrough to the Dhamma.\" As he must still develop the path further, he could not be an arahant.which, when I have developed and cultivated it, will lead me on, while I am dwelling in the appropriate way, to such a state that I shall understand: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’",
    "sn46.30:4": "\"I have obtained the enlightenment factor of mindfulness which, when I have developed and cultivated it, will lead me on, while I am dwelling in the appropriate way, to such a state that I shall understand: ‘Destroyed is birth … there is no more for this state of being.’ … I have obtained the enlightenment factor of equanimity which, when I have developed and cultivated it, will lead me on, while I am dwelling in the appropriate way, to such a state that I shall understand: ‘Destroyed is birth … there is no more for this state of being.’",
    "sn46.30:5": "\"Good, good, Udayī! Indeed, Udayī, this is the path that you have obtained, and when you have developed and cultivated it, it will lead you on, while you are dwelling in the appropriate way, to such a state that you will understand: ‘Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\"sn.v.91"
}