{
    "sn46.53:1": "Then, in the morning, a number of bhikkhus dressed and, taking their bowls and robes, entered Sāvatthī for alms …as in §52 down to:…[n.04] Quoted at Vism 30–3, 33 (Ppn 4:5, 57). Cp.AN6.55(AN III 375,8–22), which compares the balancing of the faculties to the tuning of a lute: for the pitch to be right the strings must be neither too tight nor too loose.The Blessed One said:",
    "sn46.53:2": "\"Bhikkhus, when wanderers of other sects speak thus, they should be asked: ‘Friends, when the mind becomes sluggish, which factors of enlightenment is it untimely to develop on that occasion, and which factors of enlightenment is it timely to develop on that occasion? Then, friends, when the mind becomes excited, which factors of enlightenment is it untimely to develop on that occasion, and which factors of enlightenment is it timely to develop on that occasion?’ Being asked thus, those wanderers would not be able to reply and, further, they would meet with vexation. For what reason? Because that would not be within their domain.",
    "sn46.53:3": "I do not see anyone, bhikkhus, in this world with its devas, Māra, and Brahma, in this generation with its ascetics and brahmins, its devas and humans, who could satisfy the mind with an answer to these questions except the Tathagata or a disciple of the Tathagata or one who has heard it from them.",
    "sn46.53:4": "\"On an occasion, bhikkhus, when the mind becomes sluggish, it is untimely to develop the enlightenment factor of tranquillity, the enlightenment factor of concentration, and the enlightenment factor of equanimity. For what reason? Because the mind is sluggish, bhikkhus, and it is difficult to arouse it with those things.",
    "sn46.53:5": "\"Suppose, bhikkhus, a man wants to make a small fire flare up. If he throws wet grass, wet cowdung, and wet timber into it,sn.v.113sprays it with water, and scatters soil over it, would he be able to make that small fire flare up?\"",
    "sn46.53:6": "\"So too, bhikkhus, on an occasion when the mind becomes sluggish, it is untimely to develop the enlightenment factor of tranquillity, the enlightenment factor of concentration, and the enlightenment factor of equanimity. For what reason? Because the mind is sluggish, bhikkhus, and it is difficult to arouse it with those things.",
    "sn46.53:7": "\"On an occasion, bhikkhus, when the mind becomes sluggish, it is timely to develop the enlightenment factor of discrimination of states, the enlightenment factor of energy, and the enlightenment factor of rapture. For what reason? Because the mind is sluggish, bhikkhus, and it is easy to arouse it with those things.",
    "sn46.53:8": "\"Suppose, bhikkhus, a man wants to make a small fire flare up. If he throws dry grass, dry cowdung, and dry timber into it, blows on it, and does not scatter soil over it, would he be able to make that small fire flare up?\"",
    "sn46.53:9": "\"So too, bhikkhus, on an occasion when the mind becomes sluggish, it is timely to develop the enlightenment factor of discrimination of states, the enlightenment factor of energy, and the enlightenment factor of rapture. For what reason? Because the mind is sluggish, bhikkhus, and it is easy to arouse it with those things.",
    "sn46.53:10": "\"On an occasion, bhikkhus, when the mind becomes excited, it is untimely to develop the enlightenment factor of discrimination of states, the enlightenment factor of energy,sn.v.114and the enlightenment factor of rapture. For what reason? Because the mind is excited, bhikkhus, and it is difficult to calm it down with those things.",
    "sn46.53:11": "\"Suppose, bhikkhus, a man wants to extinguish a great bonfire. If he throws dry grass, dry cowdung, and dry timber into it, blows on it, and does not scatter soil over it, would he be able to extinguish that great bonfire?\"",
    "sn46.53:12": "\"So too, bhikkhus, on an occasion when the mind becomes excited, it is untimely to develop the enlightenment factor of discrimination of states, the enlightenment factor of energy, and the enlightenment factor of rapture. For what reason? Because the mind is excited, bhikkhus, and it is difficult to calm it down with those things.",
    "sn46.53:13": "\"On an occasion, bhikkhus, when the mind becomes excited, it is timely to develop the enlightenment factor of tranquillity, the enlightenment factor of concentration, and the enlightenment factor of equanimity. For what reason? Because the mind is excited, bhikkhus, and it is easy to calm it down with those things.",
    "sn46.53:14": "\"Suppose, bhikkhus, a man wants to extinguish a great bonfire. If he throws wet grass, wet cowdung, and wet timber into it, sprays it with water, and scatters soil over it, would he be able to extinguish that great bonfire?\"",
    "sn46.53:15": "\"So too, bhikkhus, on an occasion when the mind becomes excited,sn.v.1it is timely to develop the enlightenment factor of tranquillity, the enlightenment factor of concentration, and the enlightenment factor of equanimity. For what reason? Because the mind is excited, bhikkhus, and it is easy to calm it down with those things."
}