{
    "sn46.54:1": "On one occasion the Blessed One was dwelling among the Koliyans, where there was a town of the Koliyans named Haliddavasana.[n.06] Quoted at Vism 324,9–5 (Ppn 9:9), which calls it the Haliddavasana Sutta.Then, in the morning, a number of bhikkhus dressed and, taking their bowls and robes, entered Haliddavasana for alms. Then it occurred to them: \"It is still too early to walk for alms in Haliddavasana. Let us go to the park of the wanderers of other sects.\"",
    "sn46.54:2": "Then those bhikkhus went to the park of the wanderers of other sects. They exchanged greetings with those wanderers and, when they had concluded their greetings and cordial talk, sat down to one side. The wanderers then said to them: \"Friends, the ascetic Gotama teaches the Dhamma to his disciples thus:",
    "sn46.54:3": "‘Come, bhikkhus, abandon the five hindrances, the corruptions of the mind that weaken wisdom, and dwell pervading one quarter with a mind imbued with lovingkindness, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to oneself, dwell pervading the entire world with a mind imbued with lovingkindness,sn.v.116vast, exalted, measureless, without hostility, without ill will. Dwell pervading one quarter with a mind imbued with compassion, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to oneself, dwell pervading the entire world with a mind imbued with compassion, vast, exalted, measureless, without hostility, without ill will. Dwell pervading one quarter with a mind imbued with altruistic joy, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to oneself, dwell pervading the entire world with a mind imbued with altruistic joy, vast, exalted, measureless, without hostility, without ill will. Dwell pervading one quarter with a mind imbued with equanimity, likewise the second quarter, the third quarter, and the fourth quarter. Thus above, below, across, and everywhere, and to all as to oneself, dwell pervading the entire world with a mind imbued with equanimity, vast, exalted, measureless, without hostility, without ill will.’",
    "sn46.54:4": "\"We too, friends, teach the Dhamma to our disciples thus: ‘Come, friends, abandon the five hindrances …all as above… dwell pervading the entire world with a mind imbued with lovingkindness … compassion … altruistic joy … equanimity … without ill will.’ So, friends, what here is the distinction, the disparity, the difference between the ascetic Gotama and us, that is,sn.v.117regarding the one Dhamma teaching and the other, regarding the one manner of instruction and the other?\"[n.107]Spkrefers back to its comment recorded in n.98. The other sects, according to Spk, do not have any original teachings on the abandonment of the five hindrances or the development of the divine abodes but plagiarize them from the Buddha. When they teach their own disciples they plagiarize the Buddha’s teachings on these topics. Gethin points out, however, that the sutta itself does not go as far as the commentary but only stresses the differences between the two modes of teaching (Buddhist Path to Awakening,p. 180)",
    "sn46.54:5": "Then those bhikkhus neither delighted in nor rejected the statement of those wanderers. Without delighting in it, without rejecting it, they rose from their seats and left, thinking, \"We shall learn the meaning of this statement in the presence of the Blessed One.\"",
    "sn46.54:6–10": "Then, when those bhikkhus had walked for alms in Haliddavasana and had returned from the alms round, after their meal they approached the Blessed One. Having paid homage to him, they sat down to one side and reported to him the entire discussion between those wanderers and themselves.sn.v.118The Blessed One said:",
    "sn46.54:11": "\"Bhikkhus, when wanderers of other sects speak thus, they should be asked: ‘Friends, how is the liberation of the mind by lovingkindness developed? What does it have as its destination, its culmination, its fruit, its final goal?[n.108]Kiṁgatikā kiṁparamā kiṁphalā kiṁpariyosānā.How is the liberation of the mind by compassion developed? What does it have as its destination, its culmination, its fruit, its final goal? How is the liberation of the mind by altruistic joy developed? What does it have as its destination, its culmination, its fruit, its final goal? How is the liberation of the mind by equanimity developed? What does it have as its destination, its culmination, its fruit, its final goal?’ Being asked thus, those wanderers would not be able to reply and, further, they would meet with vexation. For what reason? Because that would not be within their domain. I do not see anyone, bhikkhus, in this world with its devas, Māra, and Brahma, in this generation with its ascetics and brahmins, its devas and humans, who could satisfy the mind with an answer to these questions except the Tathagata or a disciple of the Tathagata or one who has heard it from them.sn.v.9",
    "sn46.54:12": "\"And how, bhikkhus, is the liberation of the mind by lovingkindness developed? What does it have as its destination, its culmination, its fruit, its final goal? Here, bhikkhus, a bhikkhu develops the enlightenment factor of mindfulness accompanied by lovingkindness … the enlightenment factor of equanimity accompanied by lovingkindness, based upon seclusion, dispassion, and cessation, maturing in release.[n.109] This conjunction of the enlightenment factors with the four divine abodes is unusual. On their own momentum the divine abodes lead to rebirth in the brahma world rather than to Nibbāna (seeMN83,MN99,AN4.5). When integrated into the structure of the Buddha’s path, however, they can be used to generate concentration of sufficient strength to serve as a basis for insight, which in turn brings enlightenment. A striking instance is atMN52.Spk: The monk develops the three jhanas based on lovingkindness, then takes this as a basis for developing insight and attains arahantship. The enlightenment factors are developed by insight and the path.If he wishes: ‘May I dwell perceiving the repulsive in the unrepulsive,’ he dwells perceiving the repulsive therein. If he wishes: ‘May I dwell perceiving the unrepulsive in the repulsive,’ he dwells perceiving the unrepulsive therein. If he wishes: ‘May I dwell perceiving the repulsive in the unrepulsive and in the repulsive,’ he dwells perceiving the repulsive therein. If he wishes: ‘May I dwell perceiving the unrepulsive in the repulsive and in the unrepulsive,’ he dwells perceiving the unrepulsive therein. If he wishes: ‘Avoiding both the unrepulsive and the repulsive, may I dwell equanimously, mindful and clearly comprehending,’ then he dwells therein equanimously, mindful and clearly comprehending.[n.110] AtAN5.144, this practice is discussed more fully, with reference to the benefits of each contemplation. AtDN28it is called a \"spiritual power which is taintless, acquisitionless, and noble\"(ayaṁ iddhi anāsavā anupadhikā ariyā), and Paṭis II 2–13 calls it \"the noble ones’ spiritual power\"(ariyiddhi); further explanation is given at Vism 381–82 (Ppn :36–38). The following is condensed from Spk: (i) to perceive the repulsive in the unrepulsive(appaṭikkūle paṭikkūlasaññī)one pervades an unrepulsive object (e.g., a sensually attractive person) with the idea of foulness or attends to it as impermanent; (ii) to perceive the unrepulsive in the repulsive(paṭikkūle appaṭikkūlasaññī)one pervades a repulsive object (e.g., a hostile person) with lovingkindness or attends to it as elements; (iii) and (iv) simply extend the first two modes of perception to both types of objects conjointly; and (v) is self-explanatory.Or else he enters and dwells in the deliverance of the beautiful. Bhikkhus, the liberation of mind by lovingkindness has the beautiful as its culmination, I say, for a wise bhikkhu here who has not penetrated to a superior liberation.[n.111] Spk: This teaching is brought in for one who is unable to reach arahantship after exploring formations based on jhāna through lovingkindness.Spk explainsidha paññassaas if it were a bahubbihi compound meaning \"one of mundane wisdom\"(lokiyapaññassa); the expression also occurs atDhp375andAN10.219. Mp V 78,10–11 explains it as \"wisdom in regard to this teaching\"(imasmiṁ sāsane paññā), which sounds more convincing than Spk's gloss.In the commentaries the four divine abodes are regarded as practices that lead to form-sphere jhāna (see Vism 111,15–16; Ppn 3:107). While the Nikayas do not draw explicit connections between the divine abodes and levels of jhāna, in several places they describe the divine abodes as means to rebirth in the brahma world or the form realm (see n.109). ThusSpkis compelled to give a laboured explanation of the puzzling stipulations made here about the \"upper limit\" of each meditation subject, particularly in regard to the formless attainments; the passage is also at Vism 324–25 (Ppn 9:0–23). In brief: (i) one who abides in lovingkindness can easily apply his mind to a beautiful colour kasiṇa and quickly attain the beautiful liberation (i.e., jhāna based on a colourkasiṇa); (ii) one who abides in compassion recognizes the danger in form and thus develops the base of the infinity of space, which is the escape from form; (iii) one who abides in altruistic joy apprehends the joyful consciousness of beings and thus easily enters the base of the infinity of consciousness; and (iv) one who abides in equanimity is skilled in diverting his mind from pleasure and pain, and thus can easily divert it to the absence of any concrete entity in the base of nothingness.",
    "sn46.54:13": "\"And how, bhikkhus, is the liberation of the mind by compassion developed? What does it have as its destination, its culmination, its fruit, its final goal? Here, bhikkhus, a bhikkhu develops the enlightenment factor of mindfulness accompanied by compassion … the enlightenment factor of equanimity accompanied by compassion, based upon seclusion, dispassion, and cessation, maturing in release. If he wishes: ‘May I dwell perceiving the repulsive in the unrepulsive,’ he dwells perceiving the repulsive therein … . If he wishes: ‘Avoiding both the unrepulsive and the repulsive, may I dwell equanimously, mindful and clearly comprehending,’ then he dwells therein equanimously, mindful and clearly comprehending. Or else, with the complete transcendence of perceptions of forms, with the passing away of perceptions of sensory impingement, with nonattention to perceptions of diversity, aware that ‘space is infinite,’ he enters and dwells in the base of the infinity of space.sn.v.120Bhikkhus, the liberation of mind by compassion has the base of the infinity of space as its culmination, I say, for a wise bhikkhu here who has not penetrated to a superior liberation.",
    "sn46.54:14": "\"And how, bhikkhus, is the liberation of the mind by altruistic joy developed? What does it have as its destination, its culmination, its fruit, its final goal? Here, bhikkhus, a bhikkhu develops the enlightenment factor of mindfulness accompanied by altruistic joy … the enlightenment factor of equanimity accompanied by altruistic joy, based upon seclusion, dispassion, and cessation, maturing in release. If he wishes: ‘May I dwell perceiving the repulsive in the unrepulsive,’ he dwells perceiving the repulsive therein … . If he wishes: ‘Avoiding both the unrepulsive and the repulsive, may I dwell equanimously, mindful and clearly comprehending, ’ then he dwells therein equanimously, mindful and clearly comprehending. Or else, by completely transcending the base of the infinity of space, aware that ‘consciousness is infinite,’ he enters and dwells in the base of the infinity of consciousness. Bhikkhus, the liberation of mind by altruistic joy has the base of the infinity of consciousness as its culmination, I say, for a wise bhikkhu here who has not penetrated to a superior liberation.",
    "sn46.54:15": "\"And how, bhikkhus, is the liberation of the mind by equanimity developed? What does it have as its destination, its culmination, its fruit, its final goal? Here, bhikkhus, a bhikkhu develops the enlightenment factor of mindfulness accompanied by equanimity … the enlightenment factor of equanimity accompanied by equanimity, based upon seclusion, dispassion, and cessation, maturing in release. If he wishes: ‘May I dwell perceiving the repulsive in the unrepulsive,’ he dwells perceiving the repulsive therein … . If he wishes: ‘Avoiding both the unrepulsive and the repulsive, may I dwell equanimously, mindful and clearly comprehending,’ then he dwells therein equanimously, mindful and clearly comprehending.sn.v.121Or else, by completely transcending the base of the infinity of consciousness, aware that ‘there is nothing,’ he enters and dwells in the base of nothingness. Bhikkhus, the liberation of mind by equanimity has the base of nothingness as its culmination, I say, for a wise bhikkhu here who has not penetrated to a superior liberation.\""
}