{
    "sn46.14:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary.[n.70] This sutta and the next two are included as protective discourses in the Sinhalese Maha Pirit Pota. Monks often recite them to patients.Now on that occasion the Venerable Mahākassapa was dwelling in the Pipphali Cave—sick, afflicted, gravely ill. Then, in the evening, the Blessed One emerged from seclusion and approached the Venerable Mahākassapa. He sat down in the appointed seat and said to the Venerable Mahākassapa:",
    "sn46.14:2": "\"I hope you are bearing up, Kassapa, I hope you are getting better. I hope that your painful feelings are subsiding and not increasing, and that their subsiding, not their increase, is to be discerned.\"sn.v.80",
    "sn46.14:3": "\"These seven factors of enlightenment, Kassapa, have been rightly expounded by me; when developed and cultivated, they lead to direct knowledge, to enlightenment, to Nibbāna. What seven? The enlightenment factor of mindfulness has been rightly expounded by me; when developed and cultivated, it leads to direct knowledge, to enlightenment, to Nibbāna … . The enlightenment factor of equanimity has been rightly expounded by me; when developed and cultivated, it leads to direct knowledge, to enlightenment, to Nibbāna. These seven factors of enlightenment, Kassapa, have been rightly expounded by me; when developed and cultivated, they lead to direct knowledge, to enlightenment, to Nibbāna.\"",
    "sn46.14:4": "This is what the Blessed One said. Elated, the Venerable Mahākassapa delighted in the Blessed One's statement. And the Venerable Mahākassapa recovered from that illness.[n.71]Spk: As the elder listened closely to this teaching on the development of the enlightenment factors, it is said, the thought occurred to him: \"When I penetrated the truths on the seventh day of my going forth, these enlightenment factors became manifest\" (seeSN16.11). Thinking, \"The Master's teaching is indeed emancipating!\" his blood became clear, his bodily humours were purified, and the disease departed from his body like a drop of water fallen on a lotus leaf.In such a way the Venerable Mahākassapa was cured of his illness."
}