{
    "sn46.1:1": "At Sāvatthī. \"Bhikkhus, based upon the Himalayas, the king of mountains, the nāgas nurture their bodies and acquire strength.[n.5] As atSN45:5.When they have nurtured their bodies and acquired strength, they then enter the pools. From the pools they enter the lakes, then the streams, then the rivers, and finally they enter the ocean. There they achieve greatness and expansiveness of body. So too, bhikkhus, based upon virtue, established upon virtue, a bhikkhu develops and cultivates the seven factors of enlightenment, and thereby he achieves greatness and expansiveness in (wholesome) states.[n.52]Bojjhaṅgais a compound ofbodhi + aṅga.Spkoffers a twofold definition: \"Enlightenment factors are factors of enlightenment or (factors) of the one being enlightened(bodhiyā bodhissa vā aṅgā ti bojjhaṅgā).What is meant? It is through the assemblage of states consisting in mindfulness … equanimity, arisen at the moment of the mundane and supramundane paths(lokiyalokuttaramaggakkhaṇe)… that the noble disciple is enlightened; therefore (that assemblage of states) is called enlightenment. ‘He is enlightened’ means that he rises up from the sleep of the continuum of defilements; what is meant is that he penetrates the Four Noble Truths or realizes Nibbāna. The enlightenment factors are the factors of the enlightenment consisting in that assemblage of states. Also, the noble disciple who becomes enlightened through the aforesaid assemblage of states is called ‘one being enlightened’(bodhi).The factors of the one being enlightened are enlightenment factors.\"In the Abhidhamma Piṭaka, the Bojjhanga-vibhaṅga (Vibh 227–29) first explains the enlightenment factors by the sutta method in three ways modelled onSN46:3,SN46:46–52(ii), and the bare vivekanissita formula, respectively. Then it analyses them according to the Abhidhamma method, which treats them solely as factors of the supramundane path (Vibh 229–32). For this reason the definitions in the Abhidhamma commentaries (As 27, Vibh-a 30), parallel to the passage cited from Spk above, omit \"mundane\" (lokiya) in relation to the path.The Buddha’s own definition ofbojjhaṅga,atSN46:5below, implies they were originally conceived not as factors that constitute enlightenment (the position taken by the commentaries), but as factors that lead to enlightenment. This is further supported by the sequential account of their origination atSN46:3. Hence comparison of the different strata of early Pali literature shows the usage of the term to have undergone some degree of evolution, from the more general and pragmatic to the more specific and technical."
}