{
    "sn46.2:1": "At Sāvatthī. \"Bhikkhus, just as this body, sustained by nutriment, subsists in dependence on nutriment and does not subsist without nutriment, so too the five hindrances, sustained by nutriment, subsist in dependence on nutriment and do not subsist without nutriment.[n.53] Nutriment(āhāra)here has the meaning of condition(paccaya). This portion of the sutta is repeated below atSN46:5, to whichSpkgives a detailed explanation of the nutriments for the individual enlightenment factors. See below nn.SN46:85–9Cp.ANI 3–5.",
    "sn46.2:2": "\"And what, bhikkhus, is the nutriment for the arising of unarisen sensual desire and for the increase and expansion of arisen sensual desire? There is, bhikkhus, the sign of the beautiful:[n.54] The sign of the beautiful(subhanimitta)is a sensually attractive object, particularly an object that arouses sexual desire. The word nimitta is difficult to render in a way that fits all the major contexts where it occurs. I returned to \"sign\" only after several experiments with alternatives—\"aspect,\" \"feature,\" and \"appearance\"—proved unsatisfactory. Elsewhere it clearly means basis, cause, condition (e.g., atSN48:40; V 13, 16, etc.).Spkglosses careless attention(ayoniso manasikāra)with \"unmethodical attention, offtrack attention\" (anupāyamanasikāra, uppathamanasikara;Spk-pṭ: because it is not the right method for gaining welfare and happiness). The commentaries consistently explain it as attention directed to the impermanent as permanent, to suffering as happiness, to the selfless as self, and to the foul as beautiful. This explanation is found already at Vibh 373.frequently giving careless attention to it is the nutriment for the arising of unarisen sensual desire and for the increase and expansion of arisen sensual desire.",
    "sn46.2:3": "\"And what, bhikkhus, is the nutriment for the arising of unarisen ill will and for the increase and expansion of arisen ill will? There is, bhikkhus, the sign of the repulsive:[n.55]Paṭighanimitta.Spk: The sign of the repulsive is aversion(paṭigha)or a repulsive object(paṭighārammaṇa).frequently giving careless attention to it is the nutriment for the arising of unarisen ill will and for the increase and expansion of arisen ill will.",
    "sn46.2:4": "\"And what, bhikkhus, is the nutriment for the arising of unarisen sloth and torpor and for the increase and expansion of arisen sloth and torpor? There are, bhikkhus, discontent, lethargy, lazy stretching, drowsiness after meals, sluggishness of mind:[n.56] The terms are defined, mostly by chains of synonyms, at Vibh 352.Spkcites the passage here. They are also mentioned at I, vv.30–31.sn.v.65frequently giving careless attention to them is the nutriment for the arising of unarisen sloth and torpor and for the increase and expansion of arisen sloth and torpor.",
    "sn46.2:5": "\"And what, bhikkhus, is the nutriment for the arising of unarisen restlessness and remorse and for the increase and expansion of arisen restlessness and remorse? There is, bhikkhus, unsettledness of mind:[n.7]Cetaso avūpasama.Spk: Unsettledness of mind is, in denotation, restlessness and remorse themselves.frequently giving careless attention to it is the nutriment for the arising of unarisen restlessness and remorse and for the increase and expansion of arisen restlessness and remorse.",
    "sn46.2:6": "\"And what, bhikkhus, is the nutriment for the arising of unarisen doubt and for the increase and expansion of arisen doubt? There are, bhikkhus, things that are the basis for doubt: frequently giving careless attention to them is the nutriment for the arising of unarisen doubt and for the increase and expansion of arisen doubt.",
    "sn46.2:7": "\"Just as this body, bhikkhus, sustained by nutriment, subsists in dependence on nutriment and does not subsist without nutriment, so too the five hindrances, sustained by nutriment, subsist in dependence on nutriment and do not subsist without nutriment.",
    "sn46.2:8": "\"Bhikkhus, just as this body, sustained by nutriment, subsists in dependence on nutriment and does not subsist without nutriment, so too the seven factors of enlightenment, sustained by nutriment, subsist in dependence on nutriment and do not subsist without nutriment.",
    "sn46.2:9": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of mindfulness and for the fulfilment by development of the arisen enlightenment factor of mindfulness? There are, bhikkhus, things that are the basis for the enlightenment factor of mindfulness:[n.58]Satisambojjhaṅgaṭṭhaniya dhammā.Spk: The things that become objects of mindfulness (Spk-pṭ: the four establishments of mindfulness), the thirty-seven aids to enlightenment, and the nine supramundane states.frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of mindfulness and for the fulfilment by development of the arisen enlightenment factor of mindfulness.sn.v.66",
    "sn46.2:10": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of discrimination of states and for the fulfilment by development of the arisen enlightenment factor of discrimination of states? There are, bhikkhus, wholesome and unwholesome states, blameable and blameless states, inferior and superior states, dark and bright states with their counterparts:[n.59]Kaṇhasukkasappaṭibhāga.Spk: Dark states are \"with counterparts\" because they yield dark results, and bright states because they yield bright results; the meaning is \"having similar results.\" Or \"with counterparts\" means \"with opposites\": the dark states have the bright as their opposites, the bright the dark. Or \"with counterparts\" means \"with exclusion\": the unwholesome excludes the wholesome and yields its own results, and conversely.An extended example of the opposition between good and bad states is found inMN8, where the Buddha enumerates forty-four pairs of wholesome and unwholesome opposites. The explanation of this enlightenment factor suggests that while \"discrimination of states\" may be technically identified withpaññā,the initial function ofpaññāas an enlightenment factor is not to discern the three characteristics, etc., but simply to discriminate between the good and bad mental states that become apparent with the deepening of mindfulness.frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of discrimination of states and for the fulfilment by development of the arisen enlightenment factor of discrimination of states.",
    "sn46.2:11": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of energy and for the fulfilment by development of the arisen enlightenment factor of energy? There are, bhikkhus, the element of arousal, the element of endeavour, the element of exertion:[n.60]Spk: The element of arousal(ārambhadhātu)is the initial phase of energy, the element of endeavour(nikkamadhātu)intermediate energy, the element of exertion(parakkamadhātu)energy at full intensity.frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of energy and for the fulfilment by development of the arisen enlightenment factor of energy.",
    "sn46.2:12": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of rapture and for the fulfilment by development of the arisen enlightenment factor of rapture? There are, bhikkhus, things that are the basis for the enlightenment factor of rapture: frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of rapture and for the fulfilment by development of the arisen enlightenment factor of rapture.",
    "sn46.2:13": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of tranquillity and for the fulfilment by development of the arisen enlightenment factor of tranquillity? There are, bhikkhus, tranquillity of body, tranquillity of mind:[n.61]Spk: Tranquillity of body(kāyappassaddhi)is the tranquillizing of distress in the three mental aggregates (feeling, perception, volitional formations), tranquillity of mind(cittappassaddhi)the tranquillizing of distress in the aggregate of consciousness.The commentaries frequently interpret the pair, body and mind, mentioned in the texts in the light of the Abhidhamma, which draws a contrast between mind(citta), the chief factor in cognition, and its accompanying \"body\" of mental factors(cetasika), which perform secondary cognitive functions. It seems, however, that in such passages as the present one, \"body\" was intended quite literally as meaning the physical body, considered as actively contributing to the qualitative tone of an experience.frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of tranquillity and for the fulfilment by development of the arisen enlightenment factor of tranquillity.",
    "sn46.2:14": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of concentration and for the fulfilment by development of the arisen enlightenment factor of concentration? There are, bhikkhus, the sign of serenity, the sign of nondispersal:[n.62]Spk: The sign of serenity(samathanimitta)is serenity itself as well as its object (Spk-pṭ: thepaṭibhāganimittaor counterpart sign); the sign of nondispersal(abyagganimitta)is synonymous with it.frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of concentration and for the fulfilment by development of the arisen enlightenment factor of concentration.sn.v.67",
    "sn46.2:15": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of equanimity and for the fulfilment by development of the arisen enlightenment factor of equanimity? There are, bhikkhus, things that are the basis for the enlightenment factor of equanimity: frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of equanimity and for the fulfilment by development of the arisen enlightenment factor of equanimity.",
    "sn46.2:16": "\"Just as this body, bhikkhus, sustained by nutriment, subsists in dependence on nutriment and does not subsist without nutriment, so too these seven factors of enlightenment, sustained by nutriment, subsist in dependence on nutriment and do not subsist without nutriment.\""
}