{
    "sn46.51:1": "At Sāvatthī. \"Bhikkhus, I will teach you the nutriment and the denourishment in regard to the five hindrances and the seven factors of enlightenment. Listen to that. …",
    "sn46.51:2": "\"And what, bhikkhus, is the nutriment for the arising of unarisen ill will and for the increase and expansion of arisen ill will? There is, bhikkhus, the sign of the repulsive: frequently giving careless attention to it is the nutriment for the arising of unarisen ill will and for the increase and expansion of arisen ill will.",
    "sn46.51:3": "\"And what, bhikkhus, is the nutriment for the arising of unarisen sloth and torpor and for the increase and expansion of arisen sloth and torpor? There are, bhikkhus, discontent, lethargy, lazy stretching, drowsiness after meals, sluggishness of mind: frequently giving careless attention to them is the nutriment for the arising of unarisen sloth and torpor and for the increase and expansion of arisen sloth and torpor.",
    "sn46.51:4": "\"And what, bhikkhus, is the nutriment for the arising of unarisen restlessness and remorse and for the increase and expansion of arisen restlessness and remorse? There is, bhikkhus, unsettledness of mind: frequently giving careless attention to it is the nutriment for the arising of unarisen restlessness and remorse and for the increase and expansion of arisen restlessness and remorse.",
    "sn46.51:5": "\"And what, bhikkhus, is the nutriment for the arising of unarisen doubt and for the increase and expansion of arisen doubt? There are, bhikkhus, things that are the basis for doubt: frequently giving careless attention to them is the nutriment for the arising of unarisen doubt and for the increase and expansion of arisen doubt.",
    "sn46.51:6": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of mindfulness and for the fulfilment by development of the arisen enlightenment factor of mindfulness? There are, bhikkhus, things that are the basis for the enlightenment factor of mindfulness:sn.v.104frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of mindfulness and for the fulfilment by development of the arisen enlightenment factor of mindfulness.[n.85]Spk: Besides this, there are four other conditions for the arising of the mindfulness enlightenment factor: (i) mindfulness and clear comprehension in all activities; (ii) avoiding unmindful people; (iii) associating with mindful people; and (iv) right resolution (i.e., a mind that \"slants, slopes, and inclines\" towards the establishing of mindfulness).",
    "sn46.51:7": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of discrimination of states and for the fulfilment by development of the arisen enlightenment factor of discrimination of states? There are, bhikkhus, wholesome and unwholesome states, blameable and blameless states, inferior and superior states, dark and bright states with their counterparts: frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of discrimination of states and for the fulfilment by development of the arisen enlightenment factor of discrimination of states.[n.86]Spk: There are seven other conditions for its arising: (i) interrogation (about the meaning of the aggregates, elements, sense bases, etc.); (ii) personal cleanliness; (iii) balancing the faculties (see Vism 129–30; Ppn 4:45–49); (iv) reflecting on the sphere of deep knowledge; (v-vii) avoiding unwise people, associating with wise people, and right resolution.",
    "sn46.51:8": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of energy and for the fulfilment by development of the arisen enlightenment factor of energy? There are, bhikkhus, the element of arousal, the element of endeavour, the element of exertion: frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of energy and for the fulfilment by development of the arisen enlightenment factor of energy.[n.7]Spk: Eleven other conditions are: (i) reflecting on the fearfulness of the plane of misery; (ii) seeing the benefits in arousal of energy; (iii) reflecting that one is following the path taken by all the Buddhas, etc.; (iv) reflecting on the need to honour the gifts of alms; (v-viii) reflecting on the greatness of the heritage, of the Master, of the lineage, and of one's fellow monks; (ix-xi) avoiding lazy people, associating with energetic people, and right resolution.",
    "sn46.51:9": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of rapture and for the fulfilment by development of the arisen enlightenment factor of rapture? There are, bhikkhus, things that are the basis for the enlightenment factor of rapture: frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of rapture and for the fulfilment by development of the arisen enlightenment factor of rapture.[n.88]Spk: Eleven other conditions are: (i-vii) recollection of the Buddha, the Dhamma, the Saṅgha, virtue, generosity, the devas, and peace; (viii) avoiding coarse people; (ix) associating with refined people; (x) reflecting on inspiring suttas; and (xi) right resolution.",
    "sn46.51:10": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of tranquillity and for the fulfilment by development of the arisen enlightenment factor of tranquillity? There are, bhikkhus, tranquillity of body, tranquillity of mind: frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of tranquillity and for the fulfilment by development of the arisen enlightenment factor of tranquillity.[n.89]Spk: Seven other conditions are: (i) nutritious food; (ii) a congenial climate; (iii) the right posture; (iv) effort at neutrality; (v-vii) avoiding restless people, associating with calm people, and right resolution.sn.v.5",
    "sn46.51:11": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of concentration and for the fulfilment by development of the arisen enlightenment factor of concentration? There are, bhikkhus, the sign of serenity, the sign of nondispersal: frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of concentration and for the fulfilment by development of the arisen enlightenment factor of concentration.[n.90]Spk: Ten other conditions are: (i) personal cleanliness; (ii) balancing the faculties; (iii) skill in the sign (i.e., the meditation object); (iv-vi) exerting, restraining, and gladdening the mind at the right time for each; (vii) looking on with equanimity at the right time; (viii-x) avoiding unconcentrated people, associating with concentrated people, and right resolution. (The commentaries to the Satipaṭṭhāna Sutta add, as an eleventh factor, reflecting on the jhānas and the deliverances.)",
    "sn46.51:12": "\"And what, bhikkhus, is the nutriment for the arising of the unarisen enlightenment factor of equanimity and for the fulfilment by development of the arisen enlightenment factor of equanimity? There are, bhikkhus, things that are the basis for the enlightenment factor of equanimity: frequently giving careful attention to them is the nutriment for the arising of the unarisen enlightenment factor of equanimity and for the fulfilment by development of the arisen enlightenment factor of equanimity.[n.91]Spk: Five other conditions are: (i) a detached attitude towards beings; (ii) a detached attitude towards formations (i.e., inanimate objects); (iii-v) avoiding possessive people, associating with equanimous people, and right resolution. All the enlightenment factors, after arising, reach \"fulfilment by development\"(bhāvanāya pāripūri)through the path of arahantship.",
    "sn46.51:13": "\"And what, bhikkhus, is the denourishment that prevents unarisen sensual desire from arising and arisen sensual desire from increasing and expanding? There is, bhikkhus, the sign of foulness: frequently giving careful attention to it is the denourishment that prevents unarisen sensual desire from arising and arisen sensual desire from increasing and expanding.[n.93] The sign of foulness(asubhanimitta), according toSpk, is one or another of the \"ten foul objects,\" i.e., a corpse in one of the ten stages of decomposition (see Vism 178–79; Ppn 6:1‒11). In sutta usage, however, the perception of foulness(asubhasaññā)is explained as the contemplation of the thirty-one parts of the body (as atAN V 109,19–27, increased to thirty-two in Paṭis and the commentaries by the addition of the brain).Spk: Six things lead to the abandoning of sensual desire: (i) learning the foulness object, (ii) devotion to meditation on foulness; (iii) guarding the sense faculties; (iv) moderation in food; (v) good friendship; and (vi) suitable talk. Sensual desire, (temporarily) abandoned in these six ways, is fully abandoned by the path of arahantship. Spk-pṭ: This is said by taking sensual desire, according to the Abhidhamma method, to represent all greed (i.e., greed for existence as well as greed for sensual pleasures).",
    "sn46.51:14": "\"And what, bhikkhus, is the denourishment that prevents unarisen ill will from arising and arisen ill will from increasing and expanding? There is, bhikkhus, the liberation of mind through lovingkindness: frequently giving careful attention to it is the denourishment that prevents unarisen ill will from arising and arisen ill will from increasing and expanding.[n.94]Spk: The liberation of the mind through lovingkindness(mettācetovimutti)is absorption(= jhāna). Six things lead to abandoning ill will: (i) learning the lovingkindness object; (ii) devotion to meditation on lovingkindness; (iii) reflecting on one's responsibility for one's own actions; (iv) frequent consideration; (v) good friendship; and (vi) suitable talk. Ill will is fully abandoned by the path of nonreturning.",
    "sn46.51:15": "\"And what, bhikkhus, is the denourishment that prevents unarisen sloth and torpor from arising and arisen sloth and torpor from increasing and expanding? There are, bhikkhus, the element of arousal, the element of endeavour, the element of exertion: frequently giving careful attention to them is the denourishment that prevents unarisen sloth and torporsn.v.106from arising and arisen sloth and torpor from increasing and expanding.[n.95]Spk: Six things lead to the abandoning of sloth and torpor: (i) avoidance of overeating; (ii) change of postures; (iii) attending to the perception of light (seeSN51.20); (iv) dwelling out in the open; (v) good friendship; and (vi) suitable talk. Sloth and torpor are fully abandoned by the path of arahantship.",
    "sn46.51:16": "\"And what, bhikkhus, is the denourishment that prevents unarisen restlessness and remorse from arising and arisen restlessness and remorse from increasing and expanding? There is, bhikkhus, peacefulness of mind: frequently giving careful attention to it is the denourishment that prevents unarisen restlessness and remorse from arising and arisen restlessness and remorse from increasing and expanding.[n.96]Spk: Six things lead to the abandoning of restlessness and remorse: (i) much learning; (ii) investigation; (iii) familiarity with the Vinaya; (iv) association with mature people; (v) good friendship; and (vi) suitable talk. Restlessness is abandoned by the path of arahantship, remorse by the path of nonreturning.",
    "sn46.51:17": "\"And what, bhikkhus, is the denourishment that prevents unarisen doubt from arising and arisen doubt from increasing and expanding? There are, bhikkhus, wholesome and unwholesome states, blameable and blameless states, inferior and superior states, dark and bright states with their counterparts: frequently giving careful attention to them is the denourishment that prevents unarisen doubt from arising and arisen doubt from increasing and expanding.[n.97]Spk: Six things lead to the abandoning of doubt: (i) much learning; (ii) investigation; (iii) familiarity with the Vinaya; (iv) resoluteness; (v) good friendship; and (vi) suitable talk. Doubt is fully abandoned by the path of stream-entry.",
    "sn46.51:18": "\"And what, bhikkhus, is the denourishment that prevents the unarisen enlightenment factor of mindfulness from arising and the arisen enlightenment factor of mindfulness from reaching fulfilment by development? There are, bhikkhus, things that are the basis for the enlightenment factor of mindfulness: not frequently giving attention to them is the denourishment that prevents the unarisen enlightenment factor of mindfulness from arising and the arisen enlightenment factor of mindfulness from reaching fulfilment by development.",
    "sn46.51:19": "\"And what, bhikkhus, is the denourishment that prevents the unarisen enlightenment factor of discrimination of states from arising and the arisen enlightenment factor of discrimination of states from reaching fulfilment by development? There are, bhikkhus, wholesome and unwholesome states, blameable and blameless states, inferior and superior states, dark and bright states with their counterparts: not frequently giving attention to them is the denourishment that prevents the unarisen enlightenment factor of discrimination of states from arising and the arisen enlightenment factor of discrimination of states from reaching fulfilment by development.",
    "sn46.51:20": "\"And what, bhikkhus, is the denourishment that prevents the unarisen enlightenment factor of energy from arising and the arisen enlightenment factor of energy from reaching fulfilment by development?sn.v.107There are, bhikkhus, the element of arousal, the element of endeavour, the element of exertion: not frequently giving attention to them is the denourishment that prevents the unarisen enlightenment factor of energy from arising and the arisen enlightenment factor of energy from reaching fulfilment by development.",
    "sn46.51:21": "\"And what, bhikkhus, is the denourishment that prevents the unarisen enlightenment factor of rapture from arising and the arisen enlightenment factor of rapture from reaching fulfilment by development? There are, bhikkhus, things that are the basis for the enlightenment factor of rapture: not frequently giving attention to them is the denourishment that prevents the unarisen enlightenment factor of rapture from arising and the arisen enlightenment factor of rapture from reaching fulfilment by development.",
    "sn46.51:22": "\"And what, bhikkhus, is the denourishment that prevents the unarisen enlightenment factor of tranquillity from arising and the arisen enlightenment factor of tranquillity from reaching fulfilment by development? There are, bhikkhus, tranquillity of body, tranquillity of mind: not frequently giving attention to them is the denourishment that prevents the unarisen enlightenment factor of tranquillity from arising and the arisen enlightenment factor of tranquillity from reaching fulfilment by development.",
    "sn46.51:23": "\"And what, bhikkhus, is the denourishment that prevents the unarisen enlightenment factor of concentration from arising and the arisen enlightenment factor of concentration from reaching fulfilment by development? There are, bhikkhus, the sign of serenity, the sign of nondispersal: not frequently giving attention to them is the denourishment that prevents the unarisen enlightenment factor of concentration from arising and the arisen enlightenment factor of concentration from reaching fulfilment by development.",
    "sn46.51:24": "\"And what, bhikkhus, is the denourishment that prevents the unarisen enlightenment factor of equanimity from arising and the arisen enlightenment factor of equanimity from reaching fulfilment by development. There are, bhikkhus, things that are the basis for the enlightenment factor of equanimity: not frequently giving attention to them is the denourishment that prevents the unarisen enlightenment factor of equanimity from arising and the arisen enlightenment factor of equanimity from reaching fulfilment by development.\"sn.v.108"
}