{
    "sn47.20:1": "Thus have I heard. On one occasion the Blessed One was living among the Sumbhas, where there was a town of the Sumbhas named Sedaka.sn.v.70There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn47.20:2": "\"Bhikkhus, suppose that on hearing, ‘The most beautiful girl of the land! The most beautiful girl of the land!’ a great crowd of people would assemble. Now that most beautiful girl of the land would dance exquisitely and sing exquisitely. On hearing, ‘The most beautiful girl of the land is dancing! The most beautiful girl of the land is singing!’ an even larger crowd of people would assemble.[n.17] From the Pali it cannot be determined whether the crowd gathers because they have heard \"The most beautiful girl of the land!\" being announced or gathers exclaiming \"The most beautiful girl of the land!\" I take it in the former way.Spksays such a girl is devoid of six physical defects (too tall or too short, too thin or too stout, too dark or too fair) and endowed with five kinds of beauty (of skin, flesh, sinews, bones, and age). The expressionparamapāsāvinī nacce, paramapāsāvinī gīteseems to be unique to this text. PED explainspāsāvinas \"bringing forth,\" but see MW, s.v.pra-sava() >pra-savin,derived frompra-sūti(1) and meaning \"impelling, exciting.\" Spk: \"In dancing and singing her presentation is supreme, her performance is the best; she dances and sings supremely well.\"Then a man would come along, wishing to live, not wishing to die, wishing for happiness, averse to suffering. Someone would say to him: ‘Good man, you must carry around this bowl of oil filled to the brim between the crowd and the most beautiful girl of the land. A man with a drawn sword will be following right behind you, and wherever you spill even a little of it, right there he will fell your head.’",
    "sn47.20:3": "\"I have made up this simile, bhikkhus, in order to convey a meaning. This here is the meaning: ‘The bowl of oil filled to the brim’: this is a designation for mindfulness directed to the body. Therefore, bhikkhus, you should train yourselves thus: ‘We will develop and cultivate mindfulness directed to the body, make it our vehicle, make it our basis, stabilize it, exercise ourselves in it, and fully perfect it.’ Thus, bhikkhus, should you train yourselves.\""
}