{
    "sn47.4:1": "On one occasion the Blessed One was dwelling among the Kosalans at the brahmin village of Sala. There the Blessed One addressed the bhikkhus thus:",
    "sn47.4:2": "\"Bhikkhus, those bhikkhus who are newly ordained, not long gone forth, recently come to this Dhamma and Discipline, should be exhorted, settled, and established by you in the development of the four establishments of mindfulness. What four?",
    "sn47.4:3": "\"Bhikkhus, those bhikkhus who are trainees, who have not attained their mind's ideal, who dwell aspiring for the unsurpassed security from bondage: they too dwell contemplating the body in the body, ardent, clearly comprehending, unified, with limpid mind, concentrated, with one-pointed mind, in order to fully understand the body as it really is. They too dwell contemplating feelings in feelings … in order to fully understand feelings as they really are. They too dwell contemplating mind in mind … in order to fully understand mind as it really is. They too dwell contemplating phenomena in phenomena … in order to fully understand phenomena as they really are.",
    "sn47.4:4": "\"Bhikkhus, those bhikkhus who are arahants, whose taints are destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached their own goal, utterly destroyed the fetters of existence, and are completely liberated through final knowledge: they too dwell contemplating the body in the body, ardent, clearly comprehending, unified, with limpid mind, concentrated, with one-pointed mind, detached from the body. They too dwell contemplating feelings in feelings … detached from feelings. They too dwell contemplating mind in mind … detached from mind. They too dwell contemplating phenomena in phenomena … detached from phenomena.",
    "sn47.4:5": "\"Bhikkhus, those bhikkhus who are newly ordained, not long gone forth, recently come to this Dhamma and Discipline, should be exhorted, settled, and established by you in the development of these four establishments of mindfulness.\""
}