{
    "sn47.40:1": "\"Bhikkhus, I will teach you the establishment of mindfulness,[n.77] Here the singular is used and the preferred sense would be \"the establishing of mindfulness.\"and the development of the establishment of mindfulness, and the way leading to the development of the establishment of mindfulness. Listen to that …",
    "sn47.40:2": "\"And what, bhikkhus, is the development of the establishment of mindfulness? Here, bhikkhus, a bhikkhu dwells contemplating the nature of origination in the body; he dwells contemplating the nature of vanishing in the body; he dwells contemplating the nature of origination and vanishing in the body—ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world.[n.178] This practice is calledsatipaṭṭhānabhāvanāpresumably because it carries the practice of contemplation to a deeper level than the basic exercise. In the basic exercise the task set for the meditator is to contemplate the particular establishment chosen according to the prescribed pattern. At this stage, however, one gains insight into the arising and vanishing of the object, which prepares the way for the deeper insight knowledges to emerge.The expressionsamudayadhammānupassī kāyasmiṃ viharatiis usually translated \"he abides contemplating in the body its arising factors\" (as at MLDB, p. 149), on the assumption that the compound contains a plural, samudayadhamma. A plural sense, however, is not mandatory, and it is more consistent with the use of the suffix-dhammaelsewhere to take it as meaning \"subject to\" or \"having the nature of\" here as well. AtSN.16(III 171–7)samudayadhamma, vayadhamma,andsamudayavayadhammaserve asbahubbīhi(adjectival) compounds in apposition to each of the five aggregates, and it seems that in this passage too the terms should be understood in the same sense, as singulars meaning \"subject to origination,\" etc.He dwells contemplating the nature of origination in feelings … He dwells contemplating the nature of origination in mind … He dwells contemplating the nature of origination in phenomena; he dwells contemplating the nature of vanishing in phenomena; he dwells contemplating the nature of origination and vanishing in phenomena—ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. This is called the development of the establishment of mindfulness.",
    "sn47.40:3": "\"And what, bhikkhus, is the way leading to the development of the establishment of mindfulness? It is this Noble Eightfold Path; that is, right view … right concentration. This is called the way leading to the development of the establishment of mindfulness.\""
}