{
    "sn47.18:1": "On one occasion the Blessed One was dwelling at Uruvela on the bank of the river Nerañjara at the foot of the Goatherd's Banyan Tree just after he had become fully enlightened. Then, while the Blessed One was alone in seclusion, a reflection arose in his mind thus: \"This is the one-way path for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and displeasure, for the achievement of the method, for the realization of Nibbāna, that is, the four establishments of mindfulness.",
    "sn47.18:2": "What four? Here a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating feelings in feelings … mind in mind … phenomena in phenomena, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. This is the one-way path for the purification of beings … that is, the four establishments of mindfulness.\"",
    "sn47.18:3": "Then Brahma Sahampati, having known with his own mind the reflection in the Blessed One's mind, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, disappeared from the brahma world and reappeared before the Blessed One.[n.166] As atSN6.1,SN6.2.He arranged his upper robe over one shoulder, raised his joined hands in reverential salutation towards the Blessed One, and said to him: \"So it is, Blessed One! So it is, Fortunate One! Venerable sir, this is the one-way path for the purification of beings …",
    "sn47.18:4": "What four? Here a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating feelings in feelings … mind in mind … phenomena in phenomena, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. This is the one-way path for the purification of beings … that is, the four establishments of mindfulness.\"",
    "sn47.18:5": "This is what Brahma Sahampati said. Having said this, he further said this:",
    "sn47.18:6": "\"The seer of the destruction of birth,Compassionate, knows the one-way pathBy which in the past they crossed the flood,By which they will cross and cross over now.\""
}