{
    "sn47.13:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.[n.57] The event related in this sutta poses a problem for the traditional chronology of the Buddha’s life. In the Mahaparinibbāna Sutta, Sāriputta's lion's roarjust abovetakes place during what appears to be the Buddha’s final journey along the route from Rājagaha to Vesālī. From Vesālī the Buddha heads towards Kusinārāā without ever returning to Sāvatthī, some 200 km to the west. Yet the present sutta shows the Buddha residing at Sāvatthī when he receives the news of Sāriputta's death. To preserve the traditional chronology, the commentaries (Spkhere, and Sv II 550) have the Buddha make an additional side trip to Sāvatthī following his rains retreat at Beluvagāmaka (seeDN II 98–99), an excursion not mentioned in the Mahaparinibbāna Sutta. Sāriputta accompanies him on this trip to Sāvatthī, later takes his leave, and returns to his native village Nālakagāma, where he falls ill and dies. For the commentarial story of Sāriputta's death, see Nyanaponika, \"Sāriputta: The Marshal of the Dhamma,\" in Nyanaponika and Hecker,Great Disciples of the Buddha,pp. 47–59.Now on that occasion the Venerable Sāriputta was dwelling among the Magadhans at Nālakagāma—sick, afflicted, gravely ill—and the novice Cunda was his attendant.[n.58] Spk identifies this Cunda as Sāriputta's younger brother and says, improbably, that because the bhikkhus used to address him as \"novice Cunda\" before his higher ordination they continued to address him thus even when he was an elder.",
    "sn47.13:2": "Then, because of that illness, the Venerable Sāriputta attained final Nibbāna.",
    "sn47.13:3": "\"Friend Cunda, we should see the Blessed One about this piece of news. Come, friend Cunda, let us go to the Blessed One and report this matter to him.\"",
    "sn47.13:4": "Then the Venerable Ānanda and the novice Cunda approached the Blessed One, paid homage to him, and sat down to one side. The Venerable Ānanda then said to the Blessed One: \"This novice Cunda, venerable sir, says that the Venerable Sāriputta has attained final Nibbāna, and this is his bowl and robe. Venerable sir, since I heard that the Venerable Sāriputta has attained final Nibbāna, my body seems as if it has been drugged, I have become disoriented, the teachings are no longer clear to me.\"[n.159]Spksays that here dhamma signifies the condensed and catechistic teachings(uddesaparipucchā dhammā). The expression also occurs atSN22.8andSN7.9.",
    "sn47.13:5": "\"Why, Ānanda, when Sāriputta attained final Nibbāna, did he take away your aggregate of virtue, or your aggregate of concentration, or your aggregate of wisdom, or your aggregate of liberation, or your aggregate of the knowledge and vision of liberation?\"[n.160] These are the five \"aggregates of Dhamma\"(dhammakkhandha)possessed in full only by arahants; seeSN6.2. The ascription to Ānanda of the last two aggregates (liberation, and the knowledge and vision of liberation) seems puzzling, as he is still a trainee and thus not yet fully liberated. Such anomalies, however, do occasionally occur in the texts, as atSN.26(V 384,1–12) where right knowledge and right liberation, usually unique attributes of the arahant, are ascribed to the stream-enterer Anāthapiṇḍika.",
    "sn47.13:6": "\"But have I not already declared, Ānanda, that we must be parted, separated, and severed from all who are dear and agreeable to us?sn.v.13How, Ānanda, is it to be obtained here: ‘May what is born, come to be, conditioned, and subject to disintegration not disintegrate!’? That is impossible. It is just as if the largest branch would break off a great tree standing possessed of heartwood: so too, Ānanda, in the great Bhikkhu Saṅgha standing possessed of heartwood, Sāriputta has attained final Nibbāna. How, Ānanda, is it to be obtained here: ‘May what is born, come to be, conditioned, and subject to disintegration not disintegrate!’? That is impossible.",
    "sn47.13:7": "\"Therefore, Ānanda, dwell with yourselves as your own island, with yourselves as your own refuge, with no other refuge; dwell with the Dhamma as your island, with the Dhamma as your refuge, with no other refuge …as in §9… Those bhikkhus, Ānanda, either now or after I am gone, who dwell with themselves as their own island, with themselves as their own refuge, with no other refuge; who dwell with the Dhamma as their island, with the Dhamma as their refuge, with no other refuge—it is these bhikkhus, Ānanda, who will be for me topmost of those keen on the training.\""
}