{
    "sn47.1:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Vesālī in Ambapali's Grove. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"[n.22] What follows is theuddesa(condensed statement) of the Satipaṭṭhāna Sutta (DN No. 22;MN No. 0) without theniddesa(elaboration). Full-length commentaries on the text are at Sv III 74–6 and Ps II 244–66; the commentary inSpkis much abridged. The relevant passages, with excerpts from the subcommentary, are translated in Soma,The Way of Mindfulness,pp. 35–64. The commentaries offer two derivations ofsatipaṭṭhāna:one fromsati + upaṭṭhana,\"the establishment of mindfulness\"; the other fromsati + paṭṭhana,\"the foundation of mindfulness.\" The former emphasizes the act of setting up mindfulness, the latter the objects to which mindfulness is applied. While the commentaries lean towards the derivation fromsati + paṭṭhana,the former is certainly more original and is supported by the Sktsmṛtyupasthana.See too the common expressions,upaṭṭhitasati,\"with mindfulness established\" (e.g., atSN54.3; V 33,0, etc.) andparimukhaṁ satiṁ upaṭṭhapetva,\"having established mindfulness in front of him\" (e.g., atSN54.; V 3,3, etc.). Paṭis, by consistently glossingsatiwithupaṭṭhana,also shows a preference for this derivation. For a brief explanation of the expression according to the commentarial method, see Vism 678–79 (Ppn 22:34).",
    "sn47.1:2": "\"Bhikkhus, this is the one-way path for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and displeasure, for the achievement of the method, for the realization of Nibbāna, that is, the four establishments of mindfulness.[n.13]Ekāyano ayaṁ maggois often translated \"This is the only way\" (Soma) or \"This is the sole way\"(Nyanaponika), implying that the Buddha’s way of mindfulness is an exclusive path. The commentary to the Satipaṭṭhāna Sutta, however, gives five explanations of the phrase, of which only one suggests exclusivity (see Sv III 743–44; Ps I 9–30; translated in Soma,The Way of Mindfulness,pp. 36–39).Spkhere mentions only the first:ekamaggo ayaṁ bhikkhave maggo, na dvedhāpathabhūto;\"a single path, bhikkhus, is this path, not a forked path.\"Ekāyana maggaoccurs elsewhere in the Nikāyas only atMN I 74,14–15foll., where it clearly means a path leading straight to its destination. I thus understand the metaphorical use of the phrase to be a way of indicating thatsatipaṭṭhānaleads straight to \"the purification of beings,\" etc.; perhaps the way of mindfulness is being contrasted with other types of meditation that do not always lead straight to the goal. For a fuller discussion, see Gethin, TheBuddhist Path to Awakening,pp. 59–66. The word should not be confused withekayāna,\"one vehicle,\" the central theme of the Saddharma Puṇḍarika Sūtra.Spk explains the \"method\"(ñaya)as the Noble Eightfold Path. Thus, by developing the path of satipaṭṭhāna, which is mundane in the preliminary phase, one eventually achieves the supramundane path. On ñaya, see II, n.1.What four?",
    "sn47.1:3": "This is what the Blessed One said. Elated, those bhikkhus delighted in the Blessed One's statement.sn.v.142"
}