{
    "sn47.9:1": "Thus have I heard.[n.37] This incident is recorded in the Mahaparinibbāna Sutta, atDN II 98–0.Spkassigns the incident to the tenth month before the Master's demise.On one occasion the Blessed One was dwelling at Vesālī in Beluvagāmaka. There the Blessed One addressed the bhikkhus thus:",
    "sn47.9:2": "Then, when the Blessed One had entered upon the rains, a severe illness arose in him and terrible pains bordering on death assailed him. But the Blessed One endured them, mindful and clearly comprehending, without becoming distressed. Then the thought occurred to the Blessed One: \"It is not proper for me to attain final Nibbāna without having addressed my attendants and taken leave of the Bhikkhu Saṅgha. Let me then suppress this illness by means of energy and live on, having resolved upon the life formation.\"[n.138]Jīvitasaṅkhāraṃ adhiṭṭhāya.Spk: The life formation is life itself (Spk-pṭ: because of revitalizing the body without letting it fail) as well as fruition attainment, by which life is vitalized, sustained, prolonged. The latter is intended here. The concise meaning is, \"I will attain fruition attainment, which is capable of prolonging life.\" He entered the attainment with the determination, \"Let the pain not arise for another ten months,\" and the pain, suppressed by the attainment, did not arise for another ten months.sn.v.153Then the Blessed One suppressed that illness by means of energy and lived on, having resolved upon the life formation.",
    "sn47.9:3": "The Blessed One then recovered from that illness. Soon after he had recovered, he came out from his dwelling and sat down in the seat that had been prepared in the shade behind the dwelling. The Venerable Ānanda then approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"It's splendid, venerable sir, that the Blessed One is bearing up, splendid that he has recovered![n.19] I follow Se and Ee, which do not include the initial exclamation found in Be,diṭṭho me bhante bhagavato phāsu;the latter, however, is atDN II 99,21. I think Ee is correct in retainingdiṭṭha;in Se and Be the word is taken as a past participle and is represented as neuterdiṭṭhaṁ,but here it seems to function idiomatically with the meaning \"lucky\" or \"splendid.\" SeeDN III 7,18:diṭṭhā bho satta jīvasi,\"It's splendid, sir being, that you’re alive.\" The lines that follow are atSN22:84(III 106,19–21); see III, n.SN22:149. HereSpkexplainsdhamma pi nappaṭibhantias meaning, \"The teachings on the establishments of mindfulness(satipaṭṭhānadhammā)are not clear to me.\" Possibly the expression means simply, \"Things (in general) aren’t clear to me.\"But, venerable sir, when the Blessed One was ill my body seemed as if it were drugged, I had become disoriented, the teachings were not clear to me. Nevertheless, I had this much consolation: that the Blessed One would not attain final Nibbāna without having made some pronouncement concerning the Bhikkhu Saṅgha.\"",
    "sn47.9:4": "\"What does the Bhikkhu Saṅgha now expect from me, Ānanda? I have taught the Dhamma, Ānanda, without making a distinction between inside and outside.[n.10]Anantaraṁ abāhiraṁ.Spk: Without making a distinction of inside and outside with respect either to Dhamma or persons. One makes the distinction with respect to Dhamma when one thinks, \"I will teach so much Dhamma to others but this much I won’t teach.\" One does so with respect to persons when one thinks, \"I’ll teach this person but not that one.\" The Master did not teach in this way. The \"teacher's closed fist\"(ācariyamuṭṭhi)is found among outsiders, who reserve certain teachings for their favourite pupils only when they are lying on their deathbed; but the Tathāgata does not have this.In connection with these two ideas, see Mil 1–5, 159–60.The Tathāgata has no closed fist of a teacher in regard to the teachings. If, Ānanda, anyone thinks, ‘I will take charge of the Bhikkhu Saṅgha,’ or ‘The Bhikkhu Saṅgha is under my direction,’ it is he who should make some pronouncement concerning the Bhikkhu Saṅgha. But, Ānanda, it does not occur to the Tathāgata, ‘I will take charge of the Bhikkhu Saṅgha,’ or ‘The Bhikkhu Saṅgha is under my direction, ’ so why should the Tathāgata make some pronouncement concerning the Bhikkhu Saṅgha? Now I am old, Ānanda, aged, burdened with years, advanced in life, come to the last stage. My age is now turning eighty. Just as an old cart keeps going by a combination of straps,[n.11] Readings of this obscure compound vary. Be hasvekhamissakena,Seveghamissakena(the reading at EeDN II 100,1–15), Eevedhamissakena.In a note Be proposesveṭhamissakena,the actual reading in the gloss given by Spk (both Be and Se). A similar expression occurs atTh 13a, in Eeveghamissena.At EV I, n. to 13, Norman presents the case forveṭha(= Sktveṣṭa,\"band, noose\"). Gombrich discusses the problem in \"Old Bodies Like Carts,\" arguing for the readingvedha,\"trembling,\" but it is hard to see how this sits comfortably in a compound withmissakena.Hence I follow Spk and Norman in readingveṭhamissakena.Spk: By a combination of straps: by a combination of straps through being repaired with bands for the arms, bands for the wheels, etc.(bāhābandhacakkabandhādinā paṭisaṅkharaṇena veṭhamissakena). So it seems … keeps going(maññe yāpeti): He shows, \"Like an old cart, it seems it is by a combination of straps, i.e., by being strapped with the fruition of arahantship(arahattaphalaveṭhanena), that the body of the Tathāgata assumes the four modes of deportment.\"It should be noted that this passage would hardly make sense if the commentaries were right in holding that Ānanda was born on the same day as the Bodhisatta, for the Buddha would not need to insist on the frailties of old age if Ānanda too was an old man. See II, n.296.so it seems the body of the Tathāgata keeps going by a combination of straps.sn.v.15",
    "sn47.9:5": "\"Whenever, Ānanda, by nonattention to all signs and by the cessation of certain feelings, the Tathāgata enters and dwells in the signless concentration of mind, on that occasion, Ānanda, the body of the Tathāgata is more comfortable.[n.142] The expression used here isanimitta cetosamādhi,but this concentration must be different from the one with the same name mentioned atSN40.9.Spkexplains the latter as deep insight concentration, the present one as fruition attainment(phalasamāpatti). This would then make it identical with theanimitta cetovimuttiofSN41.7(IV 297,4–6).Therefore, Ānanda, dwell with yourselves as your own island, with yourselves as your own refuge, with no other refuge; dwell with the Dhamma as your island, with the Dhamma as your refuge, with no other refuge.",
    "sn47.9:6": "And how, Ānanda, does a bhikkhu dwell with himself as his own island, with himself as his own refuge, with no other refuge; with the Dhamma as his island, with the Dhamma as his refuge, with no other refuge? Here, Ānanda, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating feelings in feelings … mind in mind … phenomena in phenomena, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world."
}