{
    "sn47.12:1": "On one occasion the Blessed One was dwelling at Nalanda in Pavarika's Mango Grove.[n.5] This sutta is included in the Mahāparinibbāna Sutta atDN II 8–83but without the last paragraph; a much more elaborate version makes upDN No. 28. In the former its chronological position seems questionable; see n.57.Then the Venerable Sāriputta approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "sn47.12:2": "Have you now, Sāriputta, encompassed with your mind the minds of all the Arahants, the Perfectly Enlightened Ones, arisen in the past and known thus: ‘Those Blessed Ones were of such virtue, or of such qualities, or of such wisdom, or of such dwellings, or of such liberation’?\"[n.153]Spkexplainsevaṁdhammāassamādhipakkhā dhammā,\"the states pertaining to concentration,\" and saysevaṁvihārinois added in order to include the attainment of cessation.",
    "sn47.12:3": "\"Then, Sāriputta, have you encompassed with your mind the minds of all the Arahants, the Perfectly Enlightened Ones, who will arise in the future and known thus: ‘Those Blessed Ones will be of such virtue, or of such qualities, or of such wisdom, or of such dwellings, or of such liberation’?\"sn.v.160",
    "sn47.12:4": "\"Then, Sāriputta, have you encompassed with your mind my own mind—I being at present the Arahant, the Perfectly Enlightened One—and known thus: ‘The Blessed One is of such virtue, or of such qualities, or of such wisdom, or of such dwellings, or of such liberation’?\"",
    "sn47.12:5": "\"Sāriputta, when you do not have any knowledge encompassing the minds of the Arahants, the Perfectly Enlightened Ones of the past, the future, and the present, why do you utter this lofty, bellowing utterance and roar this definitive, categorical lion's roar: ‘Venerable sir, I have such confidence in the Blessed One that I believe there has not been nor ever will be nor exists at present another ascetic or brahmin more knowledgeable than the Blessed One with respect to enlightenment’?\"",
    "sn47.12:6": "\"I do not have, venerable sir, any knowledge encompassing the minds of the Arahants, the Perfectly Enlightened Ones of the past, the future, and the present, but still I have understood this by inference from the Dhamma.[n.154]Api ca dhammanvayo vidito.Spk: Inferential knowledge(anumanañāṇa)has arisen in accordance with the implications of his personal knowledge of the Dhamma; the methodology(nayāggaha)has been understood. He says, \"Standing just upon the knowledge of a disciple's perfections, I know from this angle, O Blessed One.\"Suppose, venerable sir, a king had a frontier city with strong ramparts, walls, and arches, and with a single gate. The gatekeeper posted there would be wise, competent, and intelligent; one who keeps out strangers and admits acquaintances. While he is walking along the path that encircles the city he would not see a cleft or an opening in the walls even big enough for a cat to slip through. He might think: ‘Whatever large creatures enter or leave this city, all enter and leave through this one gate.’",
    "sn47.12:7": "\"Good, good, Sāriputta! Therefore, Sāriputta, you should repeat this Dhamma exposition frequently to the bhikkhus and the bhikkhunis, to the male lay followers and the female lay followers. Even though some foolish people may have perplexity or uncertainty regarding the Tathāgata, when they hear this Dhamma exposition their perplexity or uncertainty regarding the Tathāgata will be abandoned.\"[n.156] This conclusion also comes at the end ofDN No. 28, at DN III 116, following the much more effusive praise of the Buddha found there."
}