{
    "sn47.8:1": "\"Bhikkhus, suppose a foolish, incompetent, unskilful cook were to present a king or a royal minister with various kinds of curries: sour, bitter, pungent, sweet, sharp, mild, salty, bland.sn.v.50",
    "sn47.8:2": "\"That foolish, incompetent, unskilful cook does not pick up the sign of his own master's preference:[n.134] Reading with Se,akassa bhattu nimittaṃ na uggaṇhāti.Be and Ee havebhattassa,butbhattuis genitive ofbhattar,the relevant noun here (notbhatta). I translate literally, even at the cost of awkwardness, to preserve the parallel with the meditating monk.‘Today this curry pleased my master, or he reached for this one, or he took a lot of this one, or he spoke in praise of this one; or the sour curry pleased my master today, or he reached for the sour one, or he took a lot of the sour one, or he spoke in praise of the sour one; or the bitter curry … or the pungent curry … or the sweet curry … or the sharp curry … or the mild curry … or the salty curry … or the bland curry pleased my master … or he spoke in praise of the bland one.’",
    "sn47.8:3": "\"That foolish, incompetent, unskilful cook does not gaingifts ofclothing, wages, and bonuses. For what reason? Because that foolish, incompetent, unskilful cook does not pick up the sign of his own master's preference.",
    "sn47.8:4": "\"That foolish, incompetent, unskilful bhikkhu does not gain pleasant dwellings in this very life, nor does he gainsn.v.151mindfulness and clear comprehension. For what reason? Because, bhikkhus, that foolish, incompetent, unskilful bhikkhu does not pick up the sign of his own mind.",
    "sn47.8:5": "\"Suppose, bhikkhus, a wise, competent, skilful cook were to present a king or a royal minister with various kinds of curries: sour, bitter, pungent, sweet, sharp, mild, salty, bland.[n.136] This portion of the sutta is quoted at Vism 10–1 (Ppn 4:122).Spksays thatsatipaṭṭhānais treated as insight of the preliminary stage.",
    "sn47.8:6": "\"That wise, competent, skilful cook picks up the sign of his own master's preference: ‘Today this curry pleased my master … or he spoke in praise of the bland one.’",
    "sn47.8:7": "\"So too, bhikkhus, here some wise, competent, skilful bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. While he dwells contemplating the body in the body, his mind becomes concentrated, his corruptionssn.v.152are abandoned, he picks up that sign. He dwells contemplating feelings in feelings … mind in mind … phenomena in phenomena, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. While he dwells contemplating phenomena in phenomena, his mind becomes concentrated, his corruptions are abandoned, he picks up that sign.",
    "sn47.8:8": "\"That wise, competent, skilful bhikkhu gains pleasant dwellings in this very life, and he gains mindfulness and clear comprehension. For what reason? Because, bhikkhus, that wise, competent, skilful bhikkhu picks up the sign of his own mind.\""
}