{
    "sn48.39:1": "\"Bhikkhus, there are these five faculties. What five? The pleasure faculty … the equanimity faculty.",
    "sn48.39:2": "\"In dependence on a contact to be experienced as painful, bhikkhus, the pain faculty arises. Being in a state of pain, one understands: ‘I am in a state of pain.’ One understands: ‘With the cessation of that contact to be experienced as painful, the corresponding feeling—the pain faculty that arose in dependence on thatsn.v.1contact to be experienced as painful—ceases and subsides. ’",
    "sn48.39:3": "\"In dependence on a contact to be experienced joyously, bhikkhus, the joy faculty arises. Being in a state of joy, one understands: ‘I am in a state of joy.’ One understands: ‘With the cessation of that contact to be experienced joyously, the corresponding feeling—the joy faculty that arose in dependence on that contact to be experienced joyously—ceases and subsides.’",
    "sn48.39:4": "\"In dependence on a contact to be experienced with displeasure, bhikkhus, the displeasure faculty arises. Being in a state of displeasure, one understands: ‘I am in a state of displeasure.’ One understands: ‘With the cessation of that contact to be experienced with displeasure, the corresponding feeling—the displeasure faculty that arose in dependence on that contact to be experienced with displeasure—ceases and subsides.’",
    "sn48.39:5": "\"In dependence on a contact to be experienced with equanimity, bhikkhus, the equanimity faculty arises. Being in a state of equanimity, one understands: ‘I am in a state of equanimity.’ One understands: ‘With the cessation of that contact to be experienced with equanimity, the corresponding feeling—the equanimity faculty that arose in dependence on that contact to be experienced with equanimity—ceases and subsides.’",
    "sn48.39:6–7": "\"Bhikkhus, just as heat is generated and fire is produced from the conjunction and friction of two fire-sticks, but when the sticks are separated and laid aside the resultant heat ceases and subsides; so too, in dependence on a contact to be experienced as pleasant …sn.v.213… a contact to be experienced as painful … a contact to be experienced joyously … a contact to be experienced with displeasure … a contact to be experienced with equanimity, the equanimity faculty arises … . One understands: ‘With the cessation of that contact to be experienced with equanimity, the corresponding feeling … ceases and subsides.’\""
}