{
    "sn48.42:1": "At Sāvatthī. Then the brahmin Uṇṇabha approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Blessed One:",
    "sn48.42:2": "\"Master Gotama, these five faculties have different domains, different resorts; they do not experience each others’ resort and domain. What five? The eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty.[n.5] The same conversation is recorded atMN I 95,5–17. Though the five faculties are usually identified with the physical sense organs, here they seem to correspond to the five kinds of sense consciousness, for the physical sense faculties cannot properly be said to experience(paccanubhoti)an objective domain(visaya)or resort(gocara). Their function is only to serve as the media through which consciousness cognizes objects.sn.v.18Now, Master Gotama, as these five faculties have different domains, different resorts, and do not experience each others’ resort and domain, what is it that they take recourse in? And what is it that experiences their resort and domain?\"",
    "sn48.42:3": "\"Brahmin, these five faculties have different domains, different resorts; they do not experience each others’ resort and domain. What five? The eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty. Now, brahmin, these five faculties having different domains, different resorts, not experiencing each others’ resort and domain—they take recourse in the mind, and the mind experiences their resort and domain.\"[n.226]Manopaṭisaraṇaṁ mano ca nesaṁ gocaravisayaṁ paccanubhoti.Spkexplains mano here as the mind-door javana, which experiences the object by way of lust, hatred, or delusion. In my view, this introduces an unnecessary ethical slant on the passage, which I take to be primarily epistemic in import. I interpret the sentence simply to mean that mind-consciousness has access to the data provided by the five types of sense consciousness, which it collates, categorizes, and interprets with its own stock-in-trade, namely, concepts.",
    "sn48.42:4": "\"But, Master Gotama, what is it that the mind takes recourse in?\"",
    "sn48.42:5": "Then the brahmin Uṇṇabha, having delighted and rejoiced in the Blessed One's statement, rose from his seat and paid homage to the Blessed One, after which he departed keeping him on his right.",
    "sn48.42:6": "Then, not long after the brahmin Uṇṇabha had departed, the Blessed One addressed the bhikkhus thus:"
}