{
    "sn48.10:1": "\"Bhikkhus, there are these five faculties. What five? The faculty of faith … the faculty of wisdom.",
    "sn48.10:2": "\"And what, bhikkhus, is the faculty of energy? Here, bhikkhus, the noble disciple dwells with energy aroused for the abandoning of unwholesome states and the acquisition of wholesome states; he is strong, firm in exertion, not shirking the responsibility of cultivating wholesome states. He generates desire for the nonarising of unarisen evil unwholesome states; he makes an effort, arouses energy, applies his mind, and strives. He generates desire for the abandoning of arisen evil unwholesome states; he makes an effort, arouses energy, applies his mind, and strives. He generates desire for the arising of unarisen wholesome states; he makes an effort, arouses energy, applies his mind, and strives. He generates desire for the maintenance of arisen wholesome states, for their nondecay, increase, expansion, and fulfilment by development; he makes an effort, arouses energy, applies his mind, and strives. This is called the faculty of energy.",
    "sn48.10:3": "\"And what, bhikkhus, is the faculty of mindfulness? Here, bhikkhus, the noble disciple is mindful, possessing supreme mindfulness and discretion, one who remembers and recollects what was done and said long ago. He dwells contemplating the body in the body … feelings in feelings … mind in mind … phenomena in phenomena, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. This is called the faculty of mindfulness.",
    "sn48.10:4": "\"And what, bhikkhus, is the faculty of concentration? Here, bhikkhus, the noble disciple gains concentration, gains one-pointedness of mind, having made release the object. Secluded from sensual pleasures, secluded from unwholesome states, he enters and dwells in the first jhāna, which is accompanied by thought and examination, with rapture and happiness born of seclusion. With the subsiding of thought and examination, he enters and dwells in the second jhāna, which has internal confidence and unification of mind, is without thought and examination, and has rapture and happiness born of concentration. With the fading away as well of rapture, he dwells equanimous and, mindful and clearly comprehending, he experiences happiness with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ With the abandoning of pleasure and pain, and with the previous passing away of joy and displeasure, he enters and dwells in the fourth jhāna, which is neither painful nor pleasant and includes the purification of mindfulness by equanimity. This is called the faculty of concentration.sn.v.199",
    "sn48.10:5": "\"And what, bhikkhus, is the faculty of wisdom? Here, bhikkhus, the noble disciple is wise; he possesses wisdom directed to arising and passing away, which is noble and penetrative, leading to the complete destruction of suffering. He understands as it really is: ‘This is suffering.’ He understands as it really is: ‘This is the origin of suffering.’ He understands as it really is: ‘This is the cessation of suffering.’ He understands as it really is: ‘This is the way leading to the cessation of suffering.’ This is called the faculty of wisdom."
}