{
    "sn48.50:1": "Thus have I heard. On one occasion the Blessed One was dwelling among the Angans, where there was a town of the Angans named Apaṇa. There the Blessed One addressed the Venerable Sāriputta thus:",
    "sn48.50:2": "\"Venerable sir, the noble disciple who is completely dedicated to the Tathāgata and has full confidence in him does not entertain any perplexity or doubt about the Tathāgata or the Tathāgata's teaching. It is indeed to be expected, venerable sir, that a noble disciple who has faith will dwell with energy aroused for the abandoning of unwholesome states and the acquisition of wholesome states; that he will be strong, firm in exertion, not shirking the responsibility of cultivating wholesome states. That energy of his, venerable sir, is his faculty of energy.",
    "sn48.50:3": "\"It is indeed to be expected, venerable sir, that a noble disciple who has faith and whose energy is aroused will be mindful, possessing supreme mindfulness and discretion, one who remembers and recollects what was done and said long ago. That mindfulness of his, venerable sir, is his faculty of mindfulness.",
    "sn48.50:4": "\"It is indeed to be expected, venerable sir, that a noble disciple who has faith, whose energy is aroused, and whose mindfulness is established, will gain concentration, will gain one-pointedness of mind, having made release the object. That concentration of his, venerable sir, is his faculty of concentration.",
    "sn48.50:5": "\"It is indeed to be expected, venerable sir, that a noble disciple who has faith, whose energy is aroused, whose mindfulness is established,sn.v.226and whose mind is concentrated, will understand thus: ‘This saṁsara is without discoverable beginning. A first point is not discerned of beings roaming and wandering on, hindered by ignorance and fettered by craving. But the remainderless fading away and cessation of ignorance, the mass of darkness: this is the peaceful state, this is the sublime state, that is, the stilling of all formations, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna.’ That wisdom of his, venerable sir, is his faculty of wisdom.",
    "sn48.50:6": "\"And, venerable sir, when he has again and again strived in such a way, again and again recollected in such a way, again and again concentrated his mind in such a way, again and again understood with wisdom in such a way, that noble disciple gains complete faith thus: ‘As to these things that previously I had only heard about, now I dwell having contacted them with the body and, having pierced them through with wisdom, I see.’ That faith of his, venerable sir, is his faculty of faith.\"[n.234]Spkcalls this \"reviewing faith\"(paccavekkhaṇasaddhā). Since the disciple has \"pierced with wisdom\" the things \"previously heard,\" the precise role of faith here is unclear.",
    "sn48.50:7": "\"Good, good, Sāriputta! Sāriputta, the noble disciple who is completely dedicated to the Tathāgata and has full confidence in him does not entertain any perplexity or doubt about the Tathāgata or the Tathāgata's teaching.\""
}