{
    "sn48.40:1": "[n.24]Uppaṭipātika.Spk: Though taught in the order that accords with the taste of the Dhamma (following Be:yathādhammarasena;Se hasyathādhammārammaṇavasena), it is named \"Irregular Order\" because it is not taught like the other suttas in this Analysis of Faculties. Spk-pṭ: What is meant is that it is taught in the sequence of things to be abandoned, not like the other suttas which proceed in the regular sequence beginning with the pleasure faculty.\"Bhikkhus, there are these five faculties. What five? The pleasure faculty … the equanimity faculty.",
    "sn48.40:2": "\"Here, bhikkhus, while a bhikkhu is dwelling diligent, ardent, and resolute, there arises in him the displeasure faculty.sn.v.14He understands thus: ‘There has arisen in me this displeasure faculty. That has a basis, a source, a causal formation, a condition. It is impossible for that displeasure faculty to arise without a basis, without a source, without a causal formation, without a condition. ’ He understands the displeasure faculty; he understands the origin of the displeasure faculty; he understands the cessation of the displeasure faculty; and he understands where the arisen displeasure faculty ceases without remainder.",
    "sn48.40:3": "\"Here, bhikkhus, while a bhikkhu is dwelling diligent, ardent, and resolute, there arises in him the pleasure faculty. He understands thus: ‘There has arisen in me this pleasure faculty. That has a basis, a source, a causal formation, a condition. It is impossible for that pleasure faculty to arise without a basis, without a source, without a causal formation, without a condition.’ He understands the pleasure faculty; he understands the origin of the pleasure faculty; he understands the cessation of the pleasure faculty; and he understands where the arisen pleasure faculty ceases without remainder.",
    "sn48.40:4": "\"Here, bhikkhus, while a bhikkhu is dwelling diligent, ardent, and resolute, there arises in him the joy faculty. He understands thus: ‘There has arisen in me this joy faculty. That has a basis, a source, a causal formation, a condition. It is impossible for that joy faculty to arise without a basis, without a source, without a causal formation, without a condition.’ He understands the joy faculty; he understands the origin of the joy faculty; he understands the cessation of the joy faculty; and he understands where the arisen joy faculty ceases without remainder.",
    "sn48.40:5": "\"Here, bhikkhus, while a bhikkhu is dwelling diligent, ardent, and resolute, there arises in him the equanimity faculty. He understands thus: ‘There has arisen in me this equanimity faculty. That has a basis, a source, a causal formation, a condition. It is impossible for that equanimity faculty to arise without a basis, without a source, without a causal formation, without a condition. ’ He understands the equanimity faculty; he understands the origin of the equanimity faculty; he understands the cessation of the equanimity faculty; and he understands where the arisen equanimity faculty ceases without remainder."
}