{
    "sn48.36:1": "\"Bhikkhus, there are these five faculties. What five? The pleasure faculty … the equanimity faculty.",
    "sn48.36:2": "\"And what, bhikkhus, is the pleasure faculty? Whatever bodily pleasure there is, whatever bodily comfort,[n.11]āKayikaṁ sātaṁ.Spk: \"Bodily\" means based on bodily sensitivity(kāyappasādavatthuka); \"comfort\" is synonymous with pleasure and means sweet(madhura).the pleasant comfortable feeling born of body-contact: this, bhikkhus, is called the pleasure faculty.",
    "sn48.36:3": "\"And what, bhikkhus, is the pain faculty? Whatever bodily pain there is, whatever bodily discomfort, the painful uncomfortable feeling born of body-contact: this, bhikkhus, is called the pain faculty.",
    "sn48.36:4": "\"And what, bhikkhus, is the joy faculty? Whatever mental pleasure there is, whatever mental comfort, the pleasant comfortable feeling born of mind-contact: this, bhikkhus, is called the joy faculty.",
    "sn48.36:5": "\"And what, bhikkhus, is the displeasure faculty? Whatever mental pain there is, whatever mental discomfort, the painful uncomfortable feeling born of mind-contact: this, bhikkhus, is called the displeasure faculty.",
    "sn48.36:6": "\"And what, bhikkhus, is the equanimity faculty? Whatever feeling there is, whether bodily or mental, that is neither comfortable nor uncomfortable: this, bhikkhus, is called the equanimity faculty.[n.212] According to the Abhidhamma, all bodily feeling, that is, feeling arisen through bodily sensitivity(kāyappasāda), is either pleasant or painful; there is no neutral feeling based on bodily sensitivity. HenceSpkexplains the bodily equanimity as feeling arisen based on the other four senses, the eye, etc. The wordupekkhā,translated as equanimity, has two main denotations. In relation to feeling it denotes neutral feeling,adukkhamasukha vedanā,feeling which is neither painful nor pleasant. As a mental quality, however, it denotes mental neutrality, impartiality, or balance of mind (calledtatramajjhattatāin the Abhidhamma, which assigns it to thesaṅkhārakkhandha). In this sense it occurs as the fourth divine abode (impartiality towards beings), as the seventh factor of enlightenment (mental equipoise), and as a quality of the meditative mind mentioned in the formulas for the third and fourth jhānas. For a fuller discussion of the different types of upekkha, see Vism 10–2 (Ppn 4:15–70)."
}