{
    "sn5.5:1": "At Sāvatthī. Then, in the morning, the bhikkhuni Uppalavaṇṇā dressed … she stood at the foot of a sal tree in full flower.[n.345] She was the foremost among the bhikkhunīs in the exercise of supernormal powers(iddhi),to which she testifies in vv. 534–35. Her verses are atThī 224–35.Vv. 532–35 correspond toThī 230–33, but with significant differences.Thī 234is identical with v.52here ascribed to āḷavikā.",
    "sn5.5:2": "v.53\"Having gone to a sal tree with flowering top,You stand at its foot all alone, bhikkhuni.There is none whose beauty rivals yours:Foolish girl, aren’t you afraid of rogues?\"[n.346] Pada c:Na c’ atthi te dutiya vaṇṇadhātu.I translate freely in accordance with the gloss ofSpk: \"There is no second beauty element like your beauty element; there is no other bhikkhunī similar to you.\" A pun on the bhikkhunī's name is probably intended. Se and Ee1 &  include an additional pāda between pādas c and d,idh’ agata tadisika bhaveyyum,absent in Be andThī 30. This seems to me a scribal error, as it is identical with pāda b of the next verse, where it fits.",
    "sn5.5:3": "Then it occurred to the bhikkhuni Uppalavaṇṇā:sn.i.12\"Now who is this … ? This is Māra the Evil One … desiring to make me fall away from concentration.\"",
    "sn5.5:4": "v.533\"Though a hundred thousand roguesJust like you might come here,I stir not a hair, I feel no terror;Even alone, Māra, I don’t fear you.[n.37]Spkexplains pādas ab as if they meant: \"Though a hundred thousand rogues might come here, they would be treated just like you in that they would get no intimacy or affection.\" I translate, however, in accordance with the apparent sense, which also can claim support from the gloss of Thī-a onThī 231.",
    "sn5.5:5": "v.34\"I can make myself disappearOr I can enter inside your belly.I can stand between your eyebrowsYet you won’t catch a glimpse of me.",
    "sn5.5:6": "v.535\"I am the master of my mind,The bases of power are well developed;I am freed from all bondage,Therefore I don’t fear you, friend.\"[n.348] Theiddhipāda,\"bases for spiritual power,\" are the supporting conditions for the exercise of theiddhior supernormal powers described in the previous verse. SeeSN51.11.",
    "sn5.5:7": "Then Māra the Evil One, realizing, \"The bhikkhuni Uppalavaṇṇā knows me,\" sad and disappointed, disappeared right there."
}