{
    "sn5.3:1": "At Sāvatthī. Then, in the morning, the bhikkhuni Kisagotami dressed and, taking bowl and robe, entered Sāvatthī for alms.[n.339]Spkrecapitulates the popular story of her search for the mustard seeds to bring her dead son back to life, told in greater detail at Dhp-a II 270–75; see BL 2:257–60 andCommentary on the Verses,pp. 222–24. Her verses atThī 23–23do not correspond to the verses here.When she had walked for alms in Sāvatthī and had returned from her alms round,sn.i.30after her meal she went to the Blind Men's Grove for the day's abiding. Having plunged into the Blind Men's Grove, she sat down at the foot of a tree for the day's abiding.",
    "sn5.3:2": "v.55\"Why now, when your son is dead,Do you sit alone with tearful face?Having entered the woods all alone,Are you on the lookout for a man?\"",
    "sn5.3:3": "Then it occurred to the bhikkhuni Kisagotami: \"Now who is this that recited the verse—a human being or a nonhuman being?\" Then it occurred to her: \"This is Māra the Evil One, who has recited the verse desiring to arouse fear, trepidation, and terror in me, desiring to make me fall away from concentration.\"",
    "sn5.3:4": "Then the bhikkhuni Kisagotami, having understood, \"This is Māra the Evil One,\" replied to him in verses:",
    "sn5.3:5": "v.26\"I’ve gotten past the death of sons;With this, the search for men has ended.I do not sorrow, I do not weep,Nor do I fear you, friend .[n.340] Pādas ab read: Accantam mataputtamhi/Purisa etadantika. A pun seems to be intended between two senses of being \"past the death of sons.\" I translate in accordance with the paraphrase ofSpk: \"I have ‘gotten past the death of sons’ as one for whom the death of a son is over and done with. Now I will never again undergo the death of a son … . The ending of the death of sons is itself the ending of men. Now it is impossible for me to seek a man.\"Etadantikaoccurs too atThī 138b.",
    "sn5.3:6": "v.527\"Delight everywhere has been destroyed,The mass of darkness has been sundered.Having conquered the army of Death,I dwell without defiling taints.\"[n.341] The first couplet is common in Thī, found at vv.59,142,195,203,235,etc.Spkelaborates: \"The delight of craving has been destroyed for me in regard to all the aggregates, sense bases, elements, kinds of existence, modes of origin, destinations, stations, and abodes. The mass of ignorance has been broken up by knowledge.\"",
    "sn5.3:7": "Then Māra the Evil One, realizing, \"The bhikkhuni Kisagotami knows me,\" sad and disappointed, disappeared right there."
}