{
    "sn5.2:1": "At Sāvatthī. Then, in the morning, the bhikkhuni Soma dressed and, taking bowl and robe, entered Sāvatthī for alms.[n.335]Thī-a64 identifies her as the daughter of King Bimbisāra's chaplain. Two verses here =Thī 60–6, also ascribed to Soma, but the third verse differs in the two sources. For the background, seeCommentary on the Verses,pp. 87–90.When she had walked for alms in Sāvatthī and had returned from her alms round, after her meal she went to the Blind Men's Grove for the day's abiding. Having plunged into the Blind Men's Grove, she sat down at the foot of a tree for the day's abiding.",
    "sn5.2:2": "v.5\"That state so hard to achieveWhich is to be attained by the seers,Can’t be attained by a womanWith her two-fingered wisdom.\"[n.336]Spk: That state(ṭhana):arahantship.With her two-fingered wisdom(dvaṅgulapaññāya):with limited wisdom(parittapaññāya);or else this is said of women because they cut the thread while holding the cotton ball between two fingers. Spk-pṭ and Thī-a 65 offer a different explanation: \"From the age of seven on they are always testing whether the rice is cooked by taking grains out from the pot and pressing them between two fingers. Therefore they are said to have ‘two-fingered wisdom.’\" It should be noted that it is Māra who voices this ancient bias. See too Mvu III 391,19, where we finddvaṅgulaprajñaye strimatraye.",
    "sn5.2:3": "Then it occurred to the bhikkhuni Soma: \"Now who is this that recited the verse—a human being or a nonhuman being?\" Then it occurred to her: \"This is Māra the Evil One, who has recited the verse desiring to arouse fear, trepidation, and terror in me, desiring to make me fall away from concentration.\"",
    "sn5.2:4": "v.523\"What does womanhood matter at allWhen the mind is concentrated well,When knowledge flows on steadilyAs one sees correctly into Dhamma.[n.337]Spk: When knowledge flows on steadily(ñāṇamhi vattamanamhi):while the knowledge of the attainment of fruition is occurring(phalasamāpattiñaṇe pavattamane).As one sees correctly into Dhamma(samma dhammam vipassato):seeing into the Dhamma of the four truths, or into the five aggregates that form the object of insight in the preliminary phase of practice.Spk-pṭ: By mentioning the occurrence of the knowledge of fruition attainment, the commentator shows that she has been dwelling in nondelusion regarding the four truths(catūsu saccesu asammohaviharo).Seeing into(vipassantassa; or, \"seeing with insight\"): for one seeing distinctly by the penetration of nondelusion; for one seeing into the five aggregates themselves in the preliminary portion (of the practice) prior to the breakthrough to the truths(asammohapaṭivedhato visesena passantassa khandhapañcakam eva saccabhisamayato pubbabhage vipassantassa.)Spk explains in terms of the knowledge of fruition attainment because Soma, being already an arahant, would have been dwelling in the concentration of fruition. In elucidatingvipassantassa,Spk-pṭ, in the first clause, connects the word with the realization of the Four Noble Truths on the occasion of the supramundane path; in the second, it takes the word as signifying vipassanā in the technical sense of the preparatory work of insight meditation that leads to the path and fruition.",
    "sn5.2:5": "v.24\"One to whom it might occur,‘I’m a woman’ or ‘I’m a manʹOr ‘I’m anything at all’—Is fit for Māra to address.\"[n.338]Spksays one entertains such thoughts on account of craving, conceit, and views. In pāda c, I read with Ee1 & 2asmi ti,as against Be and Seaññasmim.Strangely, though it delivers the coup de grace to Māra, this verse is without a parallel in Thī.",
    "sn5.2:6": "Then Māra the Evil One, realizing, \"The bhikkhuni Soma knows me,\" sad and disappointed, disappeared right there."
}