{
    "sn5.10:1": "At Sāvatthī. Then, in the morning, the bhikkhuni Vajira dressed and, taking bowl and robe, entered Sāvatthī for alms.[n.360]Spkprovides no personal identification, and no verses in her name have come down in Thī.When she had walked for alms in Sāvatthīsn.i.35and had returned from her alms round, after her meal she went to the Blind Men's Grove for the day's abiding. Having plunged into the Blind Men's Grove, she sat down at the foot of a tree for the day's abiding.",
    "sn5.10:2": "v.55\"By whom has this being been created?Where is the maker of the being?Where has the being arisen?Where does the being cease?\"",
    "sn5.10:3": "Then it occurred to the bhikkhuni Vajira: \"Now who is this that recited the verse—a human being or a nonhuman being?\" Then it occurred to her: \"This is Māra the Evil One, who has recited the verse desiring to arouse fear, trepidation, and terror in me, desiring to make me fall away from concentration.\"",
    "sn5.10:4": "v.553\"Why now do you assume ‘a being’?Māra, is that your speculative view?This is a heap of sheer formations:Here no being is found.",
    "sn5.10:5": "v.4\"Just as, with an assemblage of parts,The word ‘chariot’ is used,So, when the aggregates exist,There is the convention ‘a being.’",
    "sn5.10:6": "v.555\"It's only suffering that comes to be,Suffering that stands and falls away.Nothing but suffering comes to be,Nothing but suffering ceases.\"[n.31] The simile of the chariot is elaborated at Mil 27–28, which quotes the previous verse. Vism 593,18–19 (Ppn 18:28) also quotes these two verses to confirm that \"there is no being apart from name-and-form.\" Vv.553–54are quoted at Abhidh-k-bh pp. 45–, ascribed to the arahant nun Śaila (= Sela); see Enomoto, CSCS, p. 42. In v.555suffering signifies the inherent unsatisfactoriness of the five aggregates(pañcakkhandhadukkha), which is identical with the heap of sheer formations(suddhasaṅkhārapuñja)in v.553c. See tooSN12.15: \"What arises is only suffering arising, what ceases is only suffering ceasing.\"",
    "sn5.10:7": "Then Māra the Evil One, realizing, \"The bhikkhuni Vajira knows me,\" sad and disappointed, disappeared right there."
}