{
    "sn5.8:1": "At Sāvatthī. Then, in the morning, the bhikkhuni Sisupacala dressed … she sat down at the foot of a tree for the day's abiding.",
    "sn5.8:2": "v.544\"Under whom have you shaved your head?You do appear to be an ascetic,Yet you don’t approve of any creed,So why wander as if bewildered?\"[n.355] Pāsaṇḍa, in pāda c, refers to the \"heretical\" systems outside the Buddha’s dispensation. I render it, inadequately, as \"creed.\"Spkexplains the word derivation by way of \"folk etymology\": \"They are calledpāsaṇḍasbecause they lay out a snare (Be:pasam ḍenti;Se:pasam oḍḍenti); the meaning is that they throw out the snare of views among the minds of beings. But the Buddha’s dispensation frees one from the snare, so it is not called apāsaṇḍa;thepasaṇḍasare found only outside the dispensation.\" MW definespāsaṇḍaas \"a heretic … anyone who falsely assumes the characteristics of an orthodox Hindu, a Jaina, a Buddhist, etc.; a false doctrine, heresy.\"",
    "sn5.8:3": "v.545\"Outside here the followers of creedsPlace their confidence in views.I don’t approve of their teachings;They are not skilled in the Dhamma.sn.i.14",
    "sn5.8:4": "v.56\"But there's one born in the Sakyan clan,The Enlightened One, without an equal,Conqueror of all, Māra's subduer,Who everywhere is undefeated,Everywhere freed and unattached,The One with Vision who sees all.",
    "sn5.8:5": "v.47\"Attained to the end of all kamma,Liberated in the extinction of acquisitions,That Blessed One is my Teacher:His is the teaching I approve.\"[n.36]Spkexplains vimutto upadhisaṅkhaye in pāda d thus: \"He is liberated into Nibbāna, known as the extinction of acquisitions, as object.\" The expression is also atMN I 44,3–4andII 260,22–23. Spk-pṭ defines \"the end of all kamma\"(sabbakammakkhaya)as arahantship and \"the extinction of acquisitions\" as Nibbāna. See tooSN4.2and n.324.",
    "sn5.8:6": "Then Māra the Evil One, realizing, \"The bhikkhuni Sisupacala knows me,\" sad and disappointed, disappeared right there."
}