{
    "sn5.4:1": "At Sāvatthī. Then, in the morning, the bhikkhuni Vijaya dressed … she sat down at the foot of a tree for the day's abiding.[n.342]Thī-a56 says that in lay life she had been a friend of Khema, the chief consort of King Bimbisāra. When she heard that Khema had gone forth under the Buddha, she visited her and was so inspired by their conversation that she too decided to take ordination. Khema became her preceptor. SeeCommentary on the Verses,pp. 204–6. Her verses are atThī 69–74. While the verses here are not among them, interestingly vv. 528 and 530 (with minor differences) are found among Khema's verses,Thī 39 and 40.",
    "sn5.4:2": "v.58\"You are so young and beautiful,And I too am a youth in my prime.Come, noble lady, let us rejoiceWith the music of a fivefold ensemble.\"[n.343]Spkenumerates the five instruments:ātata, vitata, ātatavitata, susira, ghana.Spk-pṭ explainsātataas an instrument with one surface covered by skin, such as a kettle drum(kumbha);an instrument with two surfaces covered with skins, such as thebheriandmudiṅgadrums;ātatavitata,an instrument with a head covered with skin and bound with strings, such as a lute (vīṇā);susira,wind instruments, include flutes, conches, and horns; andghanais the class of percussion instruments (excluding drums) such as cymbals, tambourines, and gongs.",
    "sn5.4:3": "Then it occurred to the bhikkhuni Vijaya: \"Now who is this … ? This is Māra the Evil One … desiring to make me fall away from concentration.\"",
    "sn5.4:4": "v.529\"Forms, sounds, tastes, odours,And delightful tactile objects—I offer them right back to you,For I, O Māra, do not need them.",
    "sn5.4:5": "v.30\"I am repelled and humiliatedBy this foul, putrid body,Subject to break up, fragile:I’ve uprooted sensual craving.[n.344] Though three eds. read in pāda cbhindanena,Ee2and SS havebhindarena,which perhaps points to an historical readingbhidurena.The Thī counterpart, v.140, hasaturena,butThī 3acontains the phrasebhiduro kayo.Bothbhindanaandbhiduraare glossed identically in their respective commentaries asbhijjanasabhava,\"subject to breaking up.\"",
    "sn5.4:6": "v.531\"As to those beings who fare amidst form,And those who abide in the formless,And those peaceful attainments too:Everywhere darkness has been destroyed.\"[n.345]Spk: pāda a refers to the form realm, pāda b to the formless realm, and pāda c to the eight mundane meditative attainments. By the mention of the two higher realms, the sensory realm is also implied. Hence she says, \"everywhere the darkness of ignorance has been dispelled.\"",
    "sn5.4:7": "Then Māra the Evil One, realizing \"The bhikkhuni Vijaya knows me,\" sad and disappointed, disappeared right there."
}