{
    "sn5.9:1": "At Sāvatthī. Then, in the morning, the bhikkhuni Sela dressed … she sat down at the foot of a tree for the day's abiding.[n.357] There is no way to determine whether this bhikkhunī is identical with āḷavikā; see n.33. The verses do not appear in Thī.",
    "sn5.9:2": "v.548By whom has this puppet been created?Where is the maker of the puppet?Where has the puppet arisen?Where does the puppet cease?\"[n.358]Spk: Both puppet (bimba) here, and misery(agha)at v.549b, refer to individual existence(attabhava),in the latter case because individual existence is a foundation for suffering. The philosophers of the Buddha’s time were divided on the question whether suffering is created by oneself(attakata)or by another(parakata). The former was the position of the eternalists, who held there is a permanent self which transmigrates from life to life reaping the fruits of its own deeds. The latter was the position of the annihilationists, who held that a being is annihilated at death and nothing survives, so that one's share of suffering and happiness is due entirely to external conditions. See the debates recorded atSN1.17,18,4,5.",
    "sn5.9:3": "Then it occurred to the bhikkhuni Sela: \"Now who is this … ? This is Māra the Evil One … desiring to make me fall away from concentration.\"",
    "sn5.9:4": "v.59\"This puppet is not made by itself,Nor is this misery made by another.It has come to be dependent on a cause;With the cause's breakup it will cease.",
    "sn5.9:5": "v.0\"As when a seed is sown in a fieldIt grows depending on a pair of factors:It requires both the soil's nutrientsAnd a steady supply of moisture:",
    "sn5.9:6": "v.551\"Just so the aggregates and elements,And these six bases of sensory contact,Have come to be dependent on a cause;With the cause's breakup they will cease.\"[n.359] One key to the interpretation of Sela's reply isAN I 223–24, where it is said that kamma is the field, consciousness the seed, and craving the moisture, for the production of future renewed existence. The cause(hetu), then, is the kammically formative consciousness accompanied by ignorance and craving. When that dissolves through the elimination of ignorance and craving there is no production of aggregates, elements, and sense bases in a future life. The imagery of seeds and vegetation recurs atSN22.54, which also helps to illuminate these verses.",
    "sn5.9:7": "Then Māra the Evil One, realizing, \"The bhikkhuni Sela knows me,\" sad and disappointed, disappeared right there."
}