{
    "sn51.20:1": "\"Bhikkhus, these four bases for spiritual power, when developed and cultivated, are of great fruit and benefit.",
    "sn51.20:2": "\"And how, bhikkhus, are the four bases for spiritual power developed and cultivated so that they are of great fruit and benefit?",
    "sn51.20:3": "\"And what, bhikkhus, is desire that is too slack? It is desire that is accompanied by lassitude, associated with lassitude.[n.271]Kosajjasahagata.I usually translatekosajjaas laziness, but that seems too strong here. What is intended is a slight dullness or feebleness in the force of desire.This is called desire that is too slack.",
    "sn51.20:4": "\"And what, bhikkhus, is desire that is too tense? It is desire that is accompanied by restlessness, associated with restlessness. This is called desire that is too tense.",
    "sn51.20:5": "\"And what, bhikkhus, is desire that is constricted internally? It is desire that is accompanied by sloth and torpor, associated with sloth and torpor. This is called desire that is constricted internally.",
    "sn51.20:6": "\"And what, bhikkhus, is desire that is distracted externally? It is desire that is repeatedly distracted externally, repeatedly disturbed, on account of the five cords of sensual pleasure. This is called desire that is distracted externally.",
    "sn51.20:7": "\"And how, bhikkhus, does a bhikkhu dwell perceiving after and before: ‘As before, so after; as after, so before’?sn.v.28Here, bhikkhus, the perception of after and before is well grasped by a bhikkhu, well attended to, well considered, well penetrated by wisdom. It is in this way, bhikkhus, that a bhikkhu dwells perceiving after and before: ‘As before, so after; as after, so before.’[n.22]Yathā pure tathā pacchā, yathā pacchā tathā pure.Spk: This should be understood: (i) by way of the meditation subject; and (ii) by way of the teaching. (i) The interpretation (abhinivesa,or \"introduction\") of the meditation subject is \"before\" and arahantship is \"after.\" A bhikkhu who, after interpreting the root meditation subject, does not allow the mind to fall into the four undesirable conditions (overly lax, etc.) goes on to attain arahantship; he is called one who dwells \"as before, so after.\" (ii) By way of teaching, the head-hairs are \"before\" and the brain is \"after\" (among the solid parts in the contemplation of the body). A bhikkhu who develops his meditation from beginning to end without sliding into the four undesirable conditions is called one who dwells \"as before, so after.\"The explanation sounds strained. The phrase refers simply to maintaining consistency in attending to the meditation subject in all its aspects throughout the session, from start to finish. See too the use of the phrase in the sentencepacchāpure saññī caṅkamaṁ adhiṭṭheyyāsi(AN IV 8,2–3), where it seems to have a spatial meaning: \"Percipient of what is behind and in front, you should determine on walking back and forth.\"",
    "sn51.20:8": "\"And how, bhikkhus, does a bhikkhu dwell ‘as below, so above; as above, so below’? Here, bhikkhus, a bhikkhu reviews this very body upwards from the soles of the feet, downwards from the tips of the hairs, enclosed in skin, as full of many kinds of impurities: ‘There are in this body head-hairs, body-hairs, nails, teeth, skin, flesh, sinews, bones, bone-marrow, kidneys, heart, liver, pleura, spleen, lungs, intestines, mesentery, contents of the stomach, excrement, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, snot, fluid of the joints, urine.’ It is in this way, bhikkhus, that a bhikkhu dwells ‘as below, so above; as above, so below.’",
    "sn51.20:9": "\"And how, bhikkhus, does a bhikkhu dwell ‘as by day, so at night; as at night, so by day’? Here, bhikkhus, at night a bhikkhu develops the basis for spiritual power that possesses concentration due to desire and volitional formations of striving by way of the same qualities, the same features, the same aspects, as he develops that basis for spiritual power by day. Or else by day he develops the basis for spiritual power that possesses concentration due to desire and volitional formations of striving by way of the same qualities, the same features, the same aspects, as he develops that basis for spiritual power at night. It is in this way, bhikkhus, that a bhikkhu dwells ‘as by day, so at night; as at night, so by day.’",
    "sn51.20:10": "\"And how, bhikkhus, does a bhikkhu, with a mind that is open and unenveloped, develop the mind imbued with luminosity? Here, bhikkhus, the perception of light is well grasped by a bhikkhu; the perception of day is well resolved upon.[n.273]Spk: A bhikkhu sits on the terrace attending to the perception of light, sometimes shutting his eyes, sometimes opening them. When (the light) appears to him the same whether his eyes are open or shut, then the perception of light has arisen. Whether it be day or night, if one dispels sloth and torpor with light and attends to one's meditation subject, the perception arisen in regard to the light has been well grasped.It is in this way, bhikkhus, that a bhikkhu, with a mind that is open and unenveloped, develops the mind imbued with luminosity.sn.v.279",
    "sn51.20:11": "\"And what, bhikkhus, is energy that it too slack? It is energy that is accompanied by lassitude, associated with lassitude. This is called energy that is too slack.",
    "sn51.20:12": "\"And what, bhikkhus, is energy that is too tense? It is energy that is accompanied by restlessness, associated with restlessness. This is called energy that is too tense.",
    "sn51.20:13": "\"And what, bhikkhus, is energy that is constricted internally? It is energy that is accompanied by sloth and torpor, associated with sloth and torpor. This is called energy that is constricted internally.",
    "sn51.20:14": "\"And what, bhikkhus, is energy that is distracted externally? It is energy that is repeatedly distracted externally, repeatedly disturbed, on account of the five cords of sensual pleasure. This is called energy that is distracted externally …all as above…",
    "sn51.20:15": "\"It is in this way, bhikkhus, that a bhikkhu, with a mind that is open and unenveloped, develops the mind imbued with luminosity.",
    "sn51.20:16": "\"And what, bhikkhus, is mind that is too slack? It is mind that is accompanied by lassitude, associated with lassitude. This is called mind that is too slack.",
    "sn51.20:17": "\"And what, bhikkhus, is mind that is too tense? It is mind that is accompanied by restlessness, associated with restlessness. This is called mind that is too tense.",
    "sn51.20:18": "\"And what, bhikkhus, is mind that is constricted internally? It is mind that is accompanied by sloth and torpor, associated with sloth and torpor. This is called mind that is constricted internally.sn.v.280",
    "sn51.20:19": "\"And what, bhikkhus, is mind that is distracted externally? It is mind that is repeatedly distracted externally, repeatedly disturbed, on account of the five cords of sensual pleasure. This is called mind that is distracted externally …all as above…",
    "sn51.20:20": "\"And what, bhikkhus, is investigation that is too slack? It is investigation that is accompanied by lassitude, associated with lassitude. This is called investigation that is too slack.",
    "sn51.20:21": "\"And what, bhikkhus, is investigation that is too tense? It is investigation that is accompanied by restlessness, associated with restlessness. This is called investigation that is too tense.",
    "sn51.20:22": "\"And what, bhikkhus, is investigation that is constricted internally? It is investigation that is accompanied by sloth and torpor, associated with sloth and torpor. This is called investigation that is constricted internally.",
    "sn51.20:23": "\"And what, bhikkhus, is investigation that is distracted externally? It is investigation that is repeatedly distracted externally, repeatedly disturbed, on account of the five cords of sensual pleasure. This is called investigation that is distracted externally …all as above…",
    "sn51.20:24": "\"When, bhikkhus, the four bases for spiritual power have been developed and cultivated in this way, a bhikkhu, by the destruction of the taints,sn.v.281in this very life enters and dwells in the taintless liberation of mind, liberation by wisdom, realizing it for himself with direct knowledge.\""
}