{
    "sn51.1:1": "\"Bhikkhus, these four bases for spiritual power, when developed and cultivated, lead to going beyond from the near shore to the far shore. What four? Here, bhikkhus, a bhikkhu develops the basis for spiritual power that possesses concentration due to desire and volitional formations of striving.[n.246] The formula is analysed below atSN5.3. The terms are explained more elaborately, according to the sutta method, at Vibh 26–20. As usual, the Abhidhamma analysis, at Vibh 220–24, treats the iddhipāda as factors of the supramundane paths. Additional explanation is found at Vism 385 (Ppn 2:50–53) and Vibh-a 303–8.Spkresolvesiddhipādainto bothiddhiyā pādaṁ,\"base for spiritual power,\" andiddhibhūtaṁ pādaṁ,\"base which is spiritual power.\"Iddhi,from the verbijjhati—to prosper, to succeed, to flourish—originally meant success, but by the time of the Buddha it had already acquired the special nuance of spiritual success or, even more to the point, spiritual power. This can be of two kinds: success in the exercise of theiddhividha,the supernormal powers (as atSN5.,SN5.4,SN5.7), and success in the endeavour to win liberation. The two converge in arahantship, which is both the sixthabhiññā(in continuity with the supernormal powers) and the final fruit of the Noble Eightfold Path. A full treatise on the various kinds ofiddhimentioned in the canon is at Paṭis 205–4.The analysis atSN5.3makes it clear that aniddhipādacontains three main components: concentration(samādhi), the four volitional formations of striving(padhānasaṅkhāra), and the particular factor responsible for generating concentration—desire(chanda), energy(viriya), mind(citta), and investigation(vimaṁsā). While concentration and striving are common to all fouriddhipāda,it is the last-named factors that differentiate them as fourfold.He develops the basis for spiritual power that possesses concentration due to energy and volitional formations of striving. He develops the basis for spiritual power that possesses concentration due to mind and volitional formations of striving. He develops the basis for spiritual power that possesses concentration due to investigation and volitional formations of striving. These four bases for spiritual power, when developed and cultivated, lead to going beyond from the near shore to the far shore.\""
}