{
    "sn51.15:1": "Thus have I heard. On one occasion the Venerable Ānanda was dwelling at Kosambi in Ghosita's Park.sn.v.272Then the brahmin Uṇṇabha approached the Venerable Ānanda and exchanged greetings with him.[n.265] A brahmin of this name appears atSN48.42. It is uncertain whether the two are the same person.When they had concluded their greetings and cordial talk, he sat down to one side and said to the Venerable Ānanda: \"For what purpose, Master Ānanda, is the holy life lived under the ascetic Gotama?\"",
    "sn51.15:2": "\"But, Master Ānanda, is there a path, is there a way for the abandoning of this desire?\"",
    "sn51.15:3": "\"But, Master Ānanda, what is the path, what is the way for the abandoning of this desire?\"",
    "sn51.15:4": "\"Such being the case, Master Ānanda, the situation is interminable, not terminable.[n.266] All three eds. read heresantakaṁ hoti no asantakaṁ.This, however, is exactly the wording we find at the end of the sutta, when the brahmin has been won over by Ānanda's argument.Spkoffers no help, but as Woodward realized, the reading required is found in SS:anantakaṁ hoti no santakaṁ,\"it is without an end (i.e., an infinite regress), not with an end.\"Santakaissa + antaka.It is impossible that one can abandon desire by means of desire itself.\"",
    "sn51.15:5": "\"It is exactly the same, brahmin, with a bhikkhu who is an arahant, one whose taints are destroyed, who has lived the holy life, done what had to be done, laid down the burden, reached his own goal, utterly destroyed the fetters of existence, and is completely liberated through final knowledge. He earlier had the desire for the attainment of arahantship, and when he attained arahantship, the corresponding desire subsided. He earlier had aroused energy for the attainment of arahantship, and when he attained arahantship, the corresponding energy subsided. He earlier had made up his mind to attain arahantship, and when he attained arahantship, the corresponding resolution subsided. He earlier made an investigation for the attainment of arahantship, and when he attained arahantship, the corresponding investigation subsided.[n.268] Cp.AN II 14,3–146,21, where Ānanda shows how craving is abandoned in reliance upon craving, conceit in reliance upon conceit.",
    "sn51.15:6": "\"Surely, Master Ānanda, such being the case, the situation is terminable, not interminable.[n.29] Here again all three eds. readsantakaṁ hoti no asantakaṁ.And again, the most intelligible reading is buried in SS:santakaṁ hoti no anantakaṁ.Magnificent, Master Ānanda! … From today let Master Ānanda remember me as a lay follower who has gone for refuge for life.\""
}