{
    "sn51.10:1": "Thus have I heard.[n.248] The incident is included in the Mahāparinibbāna Sutta atDN II 02–7, withSpkhere parallel to Sv II 554–58. The passage also occurs atUd 62–64, commented on at Ud-a 322–30.On one occasion the Blessed One was dwelling at Vesālī in the Great Wood in the Hall with the Peaked Roof.sn.v.259Then, in the morning, the Blessed One dressed and, taking bowl and robe, entered Vesālī for alms. When he had walked for alms in Vesālī and had returned from the alms round, after his meal he addressed the Venerable Ānanda thus:",
    "sn51.10:2": "The Blessed One then went to the Capala Shrine and sat down on a seat that was prepared. The Venerable Ānanda, having paid homage to the Blessed One, also sat down to one side. The Blessed One then said to the Venerable Ānanda:",
    "sn51.10:3": "\"Delightful is Vesālī, Ānanda. Delightful is the Udena Shrine, delightful the Gotamaka Shrine, delightful the Sattamba Shrine, delightful the Bahuputta Shrine, delightful the Sarandada Shrine, delightful the Capala Shrine. Whoever, Ānanda, has developed and cultivated the four bases for spiritual power, made them a vehicle, made them a basis, stabilized them, exercised himself in them, and fully perfected them could, if he so wished, live on for the aeon or for the remainder of the aeon. The Tathāgata, Ānanda, has developed and cultivated the four bases for spiritual power, made them a vehicle, made them a basis, stabilized them, exercised himself in them, and fully perfected them. If he so wished, the Tathāgata could live on for the aeon or for the remainder of the aeon.\"[n.249]Kappaṁ vā tiṭṭheyya kappāvasesaṃ vā.Spkglosseskappa,\"aeon,\" asāyukappa,\"the life aeon,\" explained as the full normal life span of human beings at a particular time, presently a hundred years.Kappāvasesaṁ,\"the remainder of the aeon,\" is explained as a little more than the normal life span of a hundred years. Spk mentions the view of one Mahāsīva Thera, who held that the Buddha could live on for the rest of thisbhaddakappa,\"excellent cosmic aeon,\" only to reject this proposition on the basis of the ancient commentaries. Mil 141 also interpretskappahere asāyukappa,perhaps drawing from the same source as the commentaries. Nevertheless, nowhere else in the Nikāyas is kappa used in the sense of a normal human life span, and there seems to be no valid reason to ascribe tokappahere a different meaning from the usual one, i.e., a cosmic aeon. Whether the present passage is genuine or an interpolation, and whether meditative success can confer such extraordinary powers, are different questions about which conflicting opinions have been voiced.",
    "sn51.10:4": "But though the Venerable Ānanda was given such an obvious signal by the Blessed One, though he was given such an obvious hint, he was unable to penetrate it. He did not implore the Blessed One: \"Venerable sir, let the Blessed One live on for the aeon! Let the Fortunate One live on for the aeon, for the welfare of the multitude, for the happiness of the multitude, out of compassion for the world, for the good, welfare, and happiness of devas and humans.\" To such an extent was his mind obsessed by Māra.[n.250]Yathā taṁ Mārena pariyuṭṭhitacitto.Spk: Māra is able to obsess the mind of anyone who has not entirely abandoned all cognitive distortions(vipallāsa), and Ānanda had not done so (being still a stream-enterer, he was still subject to distortions of mind and perception, though not of views). Māra obsessed his mind by displaying a frightful sight, and when he saw it the elder failed to catch the hint given him by the Buddha.",
    "sn51.10:5": "A second time …sn.v.260A third time the Blessed One addressed the Venerable Ānanda: \"Delightful is Vesālī, Ānanda … . Whoever, Ānanda, has developed and cultivated the four bases for spiritual power … could, if he so wished, live on for the aeon or for the remainder of the aeon … . If he so wished, the Tathāgata could live on for the aeon or for the remainder of the aeon.\"",
    "sn51.10:6": "But again, though the Venerable Ānanda was given such an obvious signal by the Blessed One, though he was given such an obvious hint, he was unable to penetrate it … . To such an extent was his mind obsessed by Māra.",
    "sn51.10:7": "Then the Blessed One addressed the Venerable Ānanda: \"You may go, Ānanda, at your own convenience.\"",
    "sn51.10:8": "Then, not long after the Venerable Ānanda had left, Māra the Evil One approached the Blessed One and said to him: \"Venerable sir, let the Blessed One now attain final Nibbāna!",
    "sn51.10:9": "Let the Fortunate One now attain final Nibbāna! Now is the time for the Blessed One's final Nibbāna! This statement was made, venerable sir, by the Blessed One:[n.251] Interestingly, no such earlier conversation between the Buddha and Māra is recorded elsewhere in the Nikāyas. Among the terms describing the disciples,pattayogakkhemā,\"secure from bondage,\" is not found in Be nor mentioned inSpk(though all the other terms are glossed), but it does come in Se and Ee. The parallelDN II 104–5excludes it, butDN III 125,1has it.sn.v.261‘I will not attain final Nibbāna, Evil One, until I have bhikkhu disciples who are wise, disciplined, confident, secure from bondage, learned, upholders of the Dhamma, practising in accordance with the Dhamma, practising in the proper way, conducting themselves accordingly; who have learned their own teacher's doctrine and can explain it, teach it, proclaim it, establish it, disclose it, analyse it, and elucidate it; who can refute thoroughly with reasons the prevalent tenets of others and can teach the efficacious Dhamma.’[n.252]Sappāṭihāriyaṁ dhammaṁ desenti.Spk does not explain the derivation ofsappāṭihāriyabut paraphrases: \"They will teach the Dhamma, having made it emancipating.\" Spk-pṭ expands on this: \"They will explain the Dhamma with reasons and examples so that it conveys the intended meaning; they will convey the ninefold supramundane Dhamma.\"",
    "sn51.10:10": "But at present, venerable sir, the Blessed One has bhikkhu disciples who are wise … and who can teach the efficacious Dhamma. Venerable sir, let the Blessed One now attain final Nibbāna! Let the Fortunate One now attain final Nibbāna! Now is the time for the Blessed One's final Nibbāna!",
    "sn51.10:11": "\"And this statement was made, venerable sir, by the Blessed One: ‘I will not attain final Nibbāna, Evil One, until I have bhikkhuni disciples",
    "sn51.10:12": "… until I have male lay disciples …",
    "sn51.10:13": "… until I have female lay disciples who are wise … and who can teach the efficacious Dhamma.’",
    "sn51.10:14": "But at present, venerable sir, the Blessed One has female lay disciples who are wise, disciplined, confident, secure from bondage, learned, upholders of the Dhamma, practising in accordance with the Dhamma,sn.v.262practising in the proper way, conducting themselves accordingly; who have learned their own teacher's doctrine and can explain it, teach it, proclaim it, establish it, disclose it, analyse it, and elucidate it; who can refute thoroughly with reasons the prevalent tenets of others and can teach the efficacious Dhamma. Venerable sir, let the Blessed One now attain final Nibbāna! Let the Fortunate One now attain final Nibbāna! Now is the time for the Blessed One's final Nibbāna!",
    "sn51.10:15": "\"And this statement was made, venerable sir, by the Blessed One: ‘I will not attain final Nibbāna, Evil One, until this holy life of mine has become successful and prosperous, extensive, popular, widespread, well proclaimed among devas and humans.’ That holy life of the Blessed One, venerable sir, has become successful and prosperous, extensive, popular, widespread, well proclaimed among devas and humans.[n.253] SeeSN12.65.",
    "sn51.10:16": "When this was said, the Blessed One said to Māra the Evil One: \"Be at ease, Evil One. It will not be long before the Tathāgata's final Nibbāna takes place. Three months from now the Tathāgata will attain final Nibbāna.\"",
    "sn51.10:17": "Then the Blessed One, at the Capala Shrine, mindfully and with clear comprehension relinquished his vital formation.[n.254]Āyusaṅkhāraṁ ossaji.Spk: The Blessed One did not relinquish his vital formation in the way one drops a clod of earth with one's hand, but he made a determination, \"I will enter fruition attainment for only three months more, but not beyond that.\" Spk does not comment onāyusaṅkhāra,but it is probably identical withjīvitindriya,the life faculty, and withjīvitasaṅkhāra(atSN47.9, V 152,29) in its role of maintaining the future continuity of life.Āyusaṅkhāra(plural) occurs atSN20.6(II 266,19), and there is a discussion about the term atMN I 295,36–296,6.And when the Blessed One had relinquished his vital formation, a great earthquake occurred, frightening and terrifying, and peals of thunder shook the sky.",
    "sn51.10:18": "\"Comparing the incomparable and continued existence,The sage relinquished the formation of existence.Rejoicing within, concentrated, he brokeContinued self-existence like a coat of armour.\"[n.255] The verse is difficult, especially the first couplet. It is commented on identically bySpk, Sv II 557–58, Mp IV 153–54, and Ud-a 329–30. These commentaries offer two alternative modes of interpretation, one takingtulaṁandatulaṁas contrasted opposites, the other takingtulaṁas a present participle andatulaṁandsambhavaṁas the contrasted opposites.I translate from Spk: \"(1)Tulaṁistulitaṁ,measured, that is delimited(paricchinnaṁ), because it is directly apparent even to dogs and jackals, etc.; this is sense-sphere kamma.Atulaṁis what is not measurable (not comparable), because there is no other mundane kamma like it; this is exalted kamma (mahaggata-kamma,the kamma of the jhānas and formless attainments). Or else:tulaṁis sense-sphere and form-sphere kamma, atulaṁ formless-sphere kamma. Ortulaṁis (kamma) with few results,atulaṁkamma with many results. ‘Continued existence’(sambhavaṁ)is the cause of continued existence, meaning the amassment or heaping up (of kamma). ‘The formation of existence’(bhavasaṅkhāraṁ)is the formation (which engenders) renewed existence. … This is meant: He rejected mundane kamma consisting of the comparable and incomparable (measurable and measureless), which(kamma)is called ‘continued existence’ in the sense that it produces results and ‘the formation of existence’ in the sense that it engenders (future) existence. ‘The sage’ is the Buddha-sage(buddhamuni); ‘self-existence’(attasambhavaṁ)is the defilements produced within oneself. Like a great warrior at the head of battle, rejoicing within and concentrated, he broke, like a coat of armour, self-existence and the defilements.\"(2) Or alternatively:Tulaṁis (the present participle)tulento,‘comparing’ =tīrento,‘scrutinizing.’ ‘The incomparable’ and ‘continued existence’ are, respectively, Nibbāna and existence; ‘the formation of existence’ is kamma leading to existence. ‘The sage relinquished’: comparing the five aggregates as impermanent with Nibbāna, their cessation, as permanent, and having seen the danger in existence and the advantage in Nibbāna, the Buddha-sage relinquished the ‘formation of existence,’ which is the root-cause of the aggregates, by means of the noble path, which effects the destruction of kamma; as it is said, ‘It leads to the destruction of kamma.’\"So the commentary. Initially it seemed to me very unlikely thattulaṁandatulaṁshould function in grammatically distinct ways, and I therefore inclined to the former interpretation, in principle if not in details. On reflection, however, I now believe that the verse is deliberately playing upontulaṁandatulaṁas different grammatical forms rather than as a pair of opposites.Atulaṁ(or its cognates) occurs elsewhere in the texts: at Sn 85batulyodescribes a teacher of the path (readingmaggakkhāyīwith Be), probably the Buddha; at Sn 683a, it is used in apposition to the Bodhisatta, the future Buddha; atThi 201aatuliyaṁdescribes theakampitaṁ dhammaṁ,\"the unshaken state,\" presumably Nibbāna. Nevertheless, though I believe the commentary's second explanation is correct grammatically, I disagree with its interpretation.In my understanding,sambhavaṁhere does not mean continued existence in saṁsara, the cause of which the Buddha had already ended with his attainment of enlightenment forty-five years earlier. Here the word means, rather, the continuation of his present life until the end of the kappa.Bhavasaṅkhārais not \"kamma leading to new existence,\" but the vital formation(āyusaṅkhāra)that the Buddha has just rejected. On this interpretation, the meaning that emerges from the verse is perfectly consonant with the preceding prose passage: Having compared the prospect of continuing on until the end of the aeon with the prospect of attaining final Nibbāna, \"the incomparable,\" the Buddha opted for the latter; and he did so by mindfully relinquishing his vital formation, the same life formation (asjīvitasaṅkhāra) that earlier, during his illness, he had resolved to maintain (seeSN47.9). Thus by rejecting thebhavasaṅkhārathat might have sustained him until the end of the aeon, the Buddha renounced the extension of his life.On the second coupletSpksays: \"He rejoiced within by way of insight, and was concentrated by way of serenity. Thus, from the preliminary stage onwards, by the power of serenity and insight he broke the entire mass of defilements that had enveloped his whole individual existence like a coat of armour and that was called ‘self-existence’(attasambhavaṁ)because it originates within oneself. When there are no more defilements, in the absence of rebirth kamma is said to be relinquished; thus he cast off kamma by the abandoning of defilements. Since there is no fear for one who has abandoned defilements, he relinquished his vital formation fearlessly. The Buddha ‘uttered this inspired utterance’ to show his freedom from fear.\"There is also an ancient commentary on this verse at Nett 61. This commentary takestulaṁas thesaṅkhāradhātu,the totality of conditioned things, andatulaṁas thenibbānadhātu. Apparently heretulaṁandatulaṁare taken as by-forms oftullaṁandatullaṁrespectively."
}