{
    "sn51.11:1": "At Sāvatthī. \"Bhikkhus, before my enlightenment, while I was still a bodhisatta, not yet fully enlightened, it occurred to me: ‘What now is the cause and condition for the development of the bases for spiritual power?’ It occurred to me: ‘Here, a bhikkhu develops the basis for spiritual power that possesses concentration due to desire and volitional formations of striving, thinking: \"Thus my desire will be neither too slack nor too tense; and it will be neither constricted internally nor distracted externally.\" And he dwells perceiving after and before: \"As before, so after; as after, so before; as below, so above; as above, so below; as by day, so at night; as at night, so by day.\" Thus, with a mind that is open and unenveloped, he develops the mind imbued with luminosity.[n.256] A detailed analysis of the terms is found below atSN5.20.sn.v.264",
    "sn51.11:2": "\"‘He develops the basis for spiritual power that possesses concentration due to energy and volitional formations of striving, thinking: \"Thus my energy will be neither too slack nor too tense; and it will be neither constricted internally nor distracted externally.\" And he dwells perceiving after and before: \"As before, so after; as after, so before; as below, so above; as above, so below; as by day, so at night; as at night, so by day.\" Thus, with a mind that is open and unenveloped, he develops the mind imbued with luminosity.",
    "sn51.11:3": "\"‘He develops the basis for spiritual power that possesses concentration due to mind and volitional formations of striving, thinking: \"Thus my mind will be neither too slack nor too tense; and it will be neither constricted internally nor distracted externally.\" And he dwells perceiving after and before: \"As before, so after; as after, so before; as below, so above; as above, so below; as by day, so at night; as at night, so by day.\" Thus, with a mind that is open and unenveloped, he develops the mind imbued with luminosity.",
    "sn51.11:4": "\"‘He develops the basis for spiritual power that possesses concentration due to investigation and volitional formations of striving, thinking: \"Thus my investigation will be neither too slack nor too tense; and it will be neither constricted internally nor distracted externally.\" And he dwells perceiving after and before: \"As before, so after; as after, so before; as below, so above; as above, so below; as by day, so at night; as at night, so by day.\" Thus, with a mind that is open and unenveloped, he develops the mind imbued with luminosity.",
    "sn51.11:5": "\"‘When the four bases for spiritual power have been developed and cultivated in this way, a bhikkhu wields the various kinds of spiritual power:[n.27]Anekavihitaṁ iddhividhaṁ paccanubhoti.This passage shows the exercise of the supernormal powers to be the fruit of developing the fouriddhipādas.The six direct knowledges appear above atSN12.70andSN16.9. The mundane modes of supernormal power are analysed in detail in Vism chaps. 12 and 13.having been one, he becomes many; having been many, he becomes one; he appears and vanishes; he goes unhindered through a wall, through a rampart, through a mountain as though through space; he dives in and out of the earth as though it were water; he walks on water without sinking as though it were earth;sn.v.26seated cross-legged, he travels in space like a bird; with his hand he touches and strokes the moon and sun so powerful and mighty; he exercises mastery with the body as far as the brahma world.",
    "sn51.11:6": "\"‘When the four bases for spiritual power have been developed and cultivated in this way, a bhikkhu, with the divine ear element, which is purified and surpasses the human, hears both kinds of sounds, the divine and human, those that are far as well as near.",
    "sn51.11:7": "\"‘When the four bases for spiritual power have been developed and cultivated in this way, a bhikkhu understands the minds of other beings and persons, having encompassed them with his own mind. He understands a mind with lust as a mind with lust; a mind without lust as a mind without lust; a mind with hatred as a mind with hatred; a mind without hatred as a mind without hatred; a mind with delusion as a mind with delusion; a mind without delusion as a mind without delusion; a contracted mind as contracted and a distracted mind as distracted; an exalted mind as exalted and an unexalted mind as unexalted; a surpassable mind as surpassable and an unsurpassable mind as unsurpassable; a concentrated mind as concentrated and an unconcentrated mind as unconcentrated; a liberated mind as liberated and an unliberated mind as unliberated.",
    "sn51.11:8": "\"‘When the four bases for spiritual power have been developed and cultivated in this way, a bhikkhu recollects his manifold past abodes, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fiftysn.v.266births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion thus: \"There I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn elsewhere, and there too I was so named, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my life span; passing away from there, I was reborn here.\" Thus he recollects his manifold past abodes with their modes and details.",
    "sn51.11:9": "\"‘When the four bases for spiritual power have been developed and cultivated in this way, a bhikkhu, with the divine eye, which is purified and surpasses the human, sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare on in accordance with their kamma thus: \"These beings who engaged in misconduct of body, speech, and mind, who reviled the noble ones, held wrong view, and undertook actions based on wrong view, with the breakup of the body, after death, have been reborn in a state of misery, in a bad destination, in the nether world, in hell; but these beings who engaged in good conduct of body, speech, and mind, who did not revile the noble ones, who held right view, and undertook action based on right view, with the breakup of the body, after death, have been reborn in a good destination, in the heavenly world.\" Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare on in accordance with their kamma.",
    "sn51.11:10": "\"‘When the four bases for spiritual power have been developed and cultivated in this way, a bhikkhu, by the destruction of the taints, in this very life enters and dwells in the taintless liberation of mind, liberation by wisdom, realizing it for himself with direct knowledge.’\"sn.v.267"
}