{
    "sn51.14:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in the Eastern Park in the Mansion of Migara's Mother. Now on that occasion a number of bhikkhus who dwelt on the ground floor of the mansion were restless, puffed up, personally vain, rough-tongued, rambling in their talk, muddle-minded, without clear comprehension, unconcentrated, scatter-brained, loose in their faculties.[n.262] As atSN2.5,9:3.",
    "sn51.14:2": "Then the Blessed One addressed the Venerable Mahāmoggallāna thus: \"Moggallana, your brothers in the holy life,sn.v.70dwelling on the ground floor of the Mansion of Migara's Mother, are restless … loose in their faculties. Go, Moggallana, stir up a sense of urgency in those bhikkhus.\"",
    "sn51.14:3": "\"Yes, venerable sir,\" the Venerable Mahāmoggallāna replied. Then he performed a feat of spiritual power such that he made the Mansion of Migara's Mother shake, quake, and tremble with his toe.[n.26]Spk: He entered into meditation on the water-kasiṇa,emerged, and determined that the ground on which the mansion stood should become water. Then he rose up into the air and struck it with his toe.Then those bhikkhus, shocked and terrified, stood to one side and said: \"It is wonderful indeed, sir! It is amazing indeed, sir! There is no wind, and this Mansion of Migara's Mother has a deep base and is securely planted, immobile, unshaking; yet it shook, quaked, and trembled.\"",
    "sn51.14:4": "Then the Blessed One approached those bhikkhus and said to them: \"Why, bhikkhus, are you standing to one side, shocked and terrified?\"",
    "sn51.14:5": "\"Then listen, bhikkhus … . It is because he has developed and cultivated the four bases for spiritual power that the bhikkhu Moggallana has become so powerful and mighty. What four? Here, bhikkhus, the bhikkhu Moggallana has developed the basis for spiritual power that possesses concentration due to desire and volitional formations of striving. He has developed the basis for spiritual power that possesses concentration due to energy … concentration due to mind … concentration due to investigation and volitional formations of striving, thinking: ‘Thus my investigation will be neither too slack nor too tense; and it will be neither constricted internally nor distracted externally. ’ … Thus, with a mind that is open and unenveloped, he has developed the mind imbued with luminosity."
}