{
    "sn51.22:1": "At Sāvatthī. Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said to him: \"Venerable sir, does the Blessed One recall ever having gone to the brahma world by spiritual power with a mind-made body?\"[n.274] The mind-made body(manomayakāya)is a subtle body created from the physical body by a meditator who has mastered the fourth jhāna. It is described as \"consisting of form, mind-made, complete in all its parts, not lacking faculties(rūpiṁ manomayaṁ sabbaṅgapaccangiṁ ahindriyaṁ).\" SeeDN,MN77; Paṭis II 20–, quoted and expanded upon at Vism 406 (Ppn 2:39). For a contemporary discussion, see Hamilton,Identity and Experience,pp. 55–64.Onupasaṅkamitāas a misconstrued absolutive, not a true agent noun, see von Hinüber, \"Pāli as an Artificial Language,\" pp. 35–37.",
    "sn51.22:2": "\"That the Blessed One is able[n.76] Be: Yañ ca kho omati bhante; Se: Opatiha bhante; Ee: Yaṁ ca kho opapati ha bhante. The verb is not encountered elsewhere.Spk(Be) glosses,omātī ti pahoti sakkoti,and remarks: \"This is a term of unique occurrence in the Word of the Buddha preserved in the Tipiṭaka(idaṁ tepiṭake buddhavacane asambhinnapadaṁ).\" Spk (Se) omits\"omātī ti,\"or anything corresponding to it, and highlightspahotias if it were the lemma.to go to the brahma world by spiritual power with a mind-made body, and thatsn.v.83he recalls having gone to the brahma world by spiritual power with this body composed of the four great elements: that is wonderful and amazing, venerable sir, on the part of the Blessed One.\"",
    "sn51.22:3": "\"When, Ānanda, the Tathāgata immerses the body in the mind and the mind in the body,[n.277] In both cases I read the verb with Be assamodahati,oversamādahatiin Se and Ee. Both Be and Se ofSpkhavesamodahati,which is strongly supported by the explanation: \"(He) immerses the body in the mind: having taken the body, he mounts it on the mind; he makes it dependent on the mind; he sends it along the course of the mind. The mind is an exalted mind. Movement along the course of the mind is buoyant (quick). (He) immerses the mind in the body: having taken the mind, he mounts it on the body; he makes it dependent on the body; he sends it along the course of the body. The body is the coarse physical body. Movement along the course of the body is sluggish (slow). A blissful perception, a buoyant perception(sukhasaññañ ca lahusaññañ ca): this is the perception associated with the mind of direct knowledge; for it is a blissful perception because it accompanies the peaceful bliss (of this mind), and a buoyant perception because there is no inhibition by the defilements.\"A more detailed account of this supernormal power is at Paṭis II 209, quoted and expanded on at Vism 401–5 (Ppn 12:119–6).and when he dwells having entered upon a blissful perception and a buoyant perception in regard to the body, on that occasion the body of the Tathāgata becomes more buoyant, malleable, wieldy, and luminous.",
    "sn51.22:4": "\"Just as an iron ball, Ānanda, heated all day, becomes more buoyant, malleable, wieldy, and luminous, so too, when the Tathāgata immerses the body in the mind and the mind in the body, and when he dwells having entered upon a blissful perception and a buoyant perception in regard to the body, on that occasion the body of the Tathāgata becomes more buoyant, malleable, wieldy, and luminous.",
    "sn51.22:5": "\"When, Ānanda, the Tathāgata immerses the body in the mind and the mind in the body, and when he dwells having entered upon a blissful perception and a buoyant perception in regard to the body, on that occasion the body of the Tathāgata rises up without difficulty from the earth into the air. He wields the various kinds of spiritual power: having been one, he becomes many; having been many, he becomes one; … he exercises mastery with the body as far as the brahma world.sn.v.284",
    "sn51.22:6": "\"Just as, Ānanda, a tuft of cotton wool or kapok, being light, sustained by the wind, rises up without difficulty from the earth into the air, so too, when the Tathāgata immerses the body in the mind and the mind in the body, and when he dwells having entered upon a blissful perception and a buoyant perception in regard to the body, on that occasion the body of the Tathāgata rises up without difficulty from the earth into the air. He wields the various kinds of spiritual power: having been one, he becomes many; having been many, he becomes one; … he exercises mastery with the body as far as the brahma world.\""
}