{
    "sn51.13:1": "\"Bhikkhus, if a bhikkhu gains concentration, gains one-pointedness of mind based upon desire,[n.258]Spkglosses desire(chanda)as the \"wish-to-do\" (kattukaṁyatāchanda). See too Vibh 26,27–29.this is called concentration due to desire. He generates desire for the nonarising of unarisen evil unwholesome states; he makes an effort, arouses energy, applies his mind, and strives. He generates desire for the abandoning of arisen evil unwholesome states; he makes an effort, arouses energy, applies his mind, and strives. He generates desire for the arising of unarisen wholesome states; he makes an effort, arouses energy, applies his mind, and strives. He generates desire for the maintenance of arisen wholesome states, for their nondecay, increase, expansion, and fulfilment by development; he makes an effort, arouses energy, applies his mind, and strives. These are called volitional formations of striving.[n.259] Spk: The \"volitional formations of striving\"(padhānasaṅkhāra)is a designation for energy which accomplishes the fourfold function of right striving.Thus this desire and this concentration due to desire and these volitional formations of striving: this is called the basis for spiritual power that possesses concentration due to desire and volitional formations of striving.",
    "sn51.13:2": "\"If, bhikkhus, a bhikkhu gains concentration, gains one-pointedness of mind based upon energy, this is called concentration due to energy. He generates desire for the nonarising of unarisen evil unwholesome states … for the maintenance of arisen wholesome states, for their nondecay, increase, expansion, and fulfilment by development; he makes an effort, arouses energy, applies his mind, and strives. These are called volitional formations of striving. Thus this energy and this concentration due to energy and these volitional formations of striving: this is called the basis for spiritual power that possesses concentration due to energy and volitional formations of striving.sn.v.69",
    "sn51.13:3": "\"If, bhikkhus, a bhikkhu gains concentration, gains one-pointedness of mind, based upon mind, this is called concentration due to mind.[n.260] Vibh 218,29–1 definescittaonly with the stock register of terms but does not specify how it becomes a basis for power.He generates desire for the nonarising of unarisen evil unwholesome states … for the maintenance of arisen wholesome states, for their nondecay, increase, expansion, and fulfilment by development; he makes an effort, arouses energy, applies his mind, and strives. These are called volitional formations of striving. Thus this mind and this concentration due to mind and these volitional formations of striving: this is called the basis for spiritual power that possesses concentration due to mind and volitional formations of striving.",
    "sn51.13:4": "\"If, bhikkhus, a bhikkhu gains concentration, gains one-pointedness of mind based upon investigation, this is called concentration due to investigation.[n.261] Vibh 219,23–25 definesvimaṁsāwith the register of terms forpaññā.Spksays that the elder Raṭṭhapala (MN82) produced the supramundane state(lokuttara dhamma)by putting emphasis on desire; the elder Soṇa (AN 1:205,Khandaka 5), by putting emphasis on energy; the elder Sambhūta (Th 291–9), by putting emphasis on mind; and the elder Mogharaja (Sn 1116–19), by putting emphasis on investigation. Spk illustrates these with the case of four royal ministers aspiring to high appointment. One who gains his position by waiting upon the king day and night, seeking to satisfy his wishes and preferences, is comparable to one who produces a supramundane state by emphasizing desire. One who gains the position by his valour, as in crushing a border rebellion, is like one who produces a supramundane state by emphasizing energy. One who gains the position by offering the king counsel in statecraft is like one who produces a supramundane state by emphasizing mind. And one who gains the position solely by reason of his birth (or class, jati) is like one who produces a supramundane state by emphasizing investigation.The same explanation is at Sv II 62–3, but a variant at Vibh-a 305–6 inverts the illustrations for mind and investigation, with birth representing mind and counsel representing investigation. This seems more cogent, since investigation(vimaṁsa)and counsel(manta)are both from the root man, to think, and mind is often classified according to its class(jati)as wholesome, unwholesome, or indeterminate. Gethin discusses the two versions of the simile, TheBuddhist Path to Awakening,pp. 90–91.He generates desire for the nonarising of unarisen evil unwholesome states … for the maintenance of arisen wholesome states, for their nondecay, increase, expansion, and fulfilment by development; he makes an effort, arouses energy, applies his mind, and strives. These are called volitional formations of striving. Thus this investigation and this concentration due to investigation and these volitional formations of striving: this is called the basis for spiritual power that possesses concentration due to investigation and volitional formations of striving.\""
}