{
    "sn52.2:1": "At Sāvatthī. Then, while the Venerable Anuruddha was alone in seclusion, a reflection arose in his mind thus: \"Those who have neglected these four establishments of mindfulness have neglected the noble path leading to the complete destruction of suffering. Those who have undertaken these four establishments of mindfulness have undertaken the noble path leading to the complete destruction of suffering.\"",
    "sn52.2:2–3": "Then the Venerable Mahāmoggallāna, having known with his own mind the reflection in the Venerable Anuruddha's mind, just assn.v.297quickly as a strong man might extend his drawn-in arm or draw in his extended arm, appeared in the presence of the Venerable Anuruddha and said to him:",
    "sn52.2:4": "\"Here, friend, a bhikkhu dwells contemplating the body in the body internally, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating the body in the body externally, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating the body in the body internally and externally, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world.",
    "sn52.2:5": "\"He dwells contemplating feelings in feelings internally … contemplating feelings in feelings externally … contemplating feelings in feelings internally and externally, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world.",
    "sn52.2:6": "\"He dwells contemplating mind in mind internally … contemplating mind in mind externally … contemplating mind in mind internally and externally, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world.",
    "sn52.2:7": "\"He dwells contemplating phenomena in phenomena internally … contemplating phenomena in phenomena externally … contemplating phenomena in phenomena internally and externally, ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world."
}