{
    "sn52.1:1": "Thus have I heard. On one occasion the Venerable Anuruddha was dwelling at Sāvatthī in Jeta's Grove, Anathapiṇḍika's Park.[n.280] The Venerable Anuruddha already appears as a proponent ofsatipaṭṭhānaat47.26–28. The present saṁyutta is virtually an appendix to the Satipaṭṭhānasaṁyutta.Then, while the Venerable Anuruddha was alone in seclusion, a reflection arose in his mind thus: \"Those who have neglected these four establishments of mindfulness have neglected the noble path leading to the complete destruction of suffering. Those who have undertaken these four establishments of mindfulness have undertaken the noble path leading to the complete destruction of suffering.\"",
    "sn52.1:2": "Then the Venerable Mahāmoggallāna, having known with his own mind the reflection in the Venerable Anuruddha's mind, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, appeared in the presence of the Venerable Anuruddha and said to him:",
    "sn52.1:3": "\"Here, friend, a bhikkhu dwells contemplating the nature of origination in the body internally;[n.281] This paragraph and the two that follow merge the two supplementary sections to each exercise in the Satipaṭṭhāna Sutta; in the latter they follow in sequence but are kept distinct. I explain my reason for translatingsamudayadhamma,etc., as “the nature of origination,” etc., in n.178.he dwells contemplating the nature of vanishing in the body internally; he dwells contemplating the nature of origination and vanishing in the body internally—sn.v.295ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world.",
    "sn52.1:4": "\"If he wishes:[n.282] What follows is atSN6.5(V 119,6-16); see n.110.‘May I dwell perceiving the repulsive in the unrepulsive,’ he dwells perceiving the repulsive therein. If he wishes: ‘May I dwell perceiving the unrepulsive in the repulsive, ’ he dwells perceiving the unrepulsive therein. If he wishes: ‘May I dwell perceiving the repulsive in the unrepulsive and in the repulsive,’ he dwells perceiving the repulsive therein. If he wishes: ‘May I dwell perceiving the unrepulsive in the repulsive and in the unrepulsive,’ he dwells perceiving the unrepulsive therein. If he wishes: ‘Avoiding both the unrepulsive and the repulsive, may I dwell equanimously, mindful and clearly comprehending,’ then he dwells therein equanimously, mindful and clearly comprehending.",
    "sn52.1:5": "\"He dwells contemplating the nature of origination … the nature of vanishing … the nature of origination and vanishing in feelings internally … in feelings externally … in feelings internally and externally—sn.v.296ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world.",
    "sn52.1:6": "\"If he wishes: ‘May I dwell perceiving the repulsive in the unrepulsive,’ he dwells perceiving the repulsive therein … . If he wishes: ‘Avoiding both the unrepulsive and the repulsive, may I dwell equanimously, mindful and clearly comprehending,’ then he dwells therein equanimously, mindful and clearly comprehending.",
    "sn52.1:7": "\"He dwells contemplating the nature of origination … the nature of vanishing … the nature of origination and vanishing in mind internally … in mind externally … in mind internally and externally—ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world.",
    "sn52.1:8": "\"If he wishes: ‘May I dwell perceiving the repulsive in the unrepulsive,’ he dwells perceiving the repulsive therein … . If he wishes: ‘Avoiding both the unrepulsive and the repulsive, may I dwell equanimously, mindful and clearly comprehending,’ then he dwells therein equanimously, mindful and clearly comprehending.",
    "sn52.1:9": "\"He dwells contemplating the nature of origination … the nature of vanishing … the nature of origination and vanishing in phenomena internally … in phenomena externally … in phenomena internally and externally—ardent, clearly comprehending, mindful, having removed covetousness and displeasure in regard to the world.",
    "sn52.1:10": "\"If he wishes: ‘May I dwell perceiving the repulsive in the unrepulsive,’ he dwells perceiving the repulsive therein … . If he wishes: ‘Avoiding both the unrepulsive and the repulsive, may I dwell equanimously, mindful and clearly comprehending,’ then he dwells therein equanimously, mindful and clearly comprehending."
}