{
    "sn54.12:1": "On one occasion the Venerable Lomāsavāngisa was dwelling among the Sakyans at Kapilavatthu in Nigrodha's Park. Then Mahānāma the Sakyan approached the Venerable Lomāsavāngisa, paid homage to him, sat down to one side, and said to him:",
    "sn54.12:2": "\"It is not the case, friend Mahānāma, that the dwelling of a trainee is itself the same as the Tathāgata's dwelling; rather, the dwelling of a trainee is one thing and the Tathāgata's dwelling is another.",
    "sn54.12:3": "Those bhikkhus who are trainees … dwell having abandoned these five hindrances.",
    "sn54.12:4": "\"But, friend Mahānāma, for those bhikkhus who are arahants, whose taints are destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached their own goal, utterly destroyed the fetters of existence, become completely liberated through final knowledge, the five hindrances have been abandoned, cut off at the root, made like palm stumps, obliterated so that they are no more subject to future arising.[n.315]Tesaṁ pañca nīvaraṇā pahīnā ucchinnamūlā tālāvatthukatā anabhāvakatā āyatiṁ anuppādadhamma.This emphasizes the final and complete abandonment of the five hindrances.What five? The hindrances of sensual desire, ill will, sloth and torpor, restlessness and remorse, and doubt.sn.v.328For those bhikkhus who are arahants … these five hindrances have been abandoned, cut off at the root, made like palm stumps, obliterated so that they are no more subject to future arising.",
    "sn54.12:5": "\"By the following method too, friend Mahānāma, it can be understood how the dwelling of a trainee is one thing and the Tathāgata's dwelling is another.",
    "sn54.12:6": "\"On this one occasion, friend Mahānāma, the Blessed One was dwelling at Icchanaṅgala in the Icchanaṅgala Wood. There the Blessed One addressed the bhikkhus thus: ‘Bhikkhus, I wish to go into seclusion for three months. I should not be approached by anyone except the one who brings me almsfood.’He here repeats the entire contents of the preceding sutta, down to:",
    "sn54.12:11": "\"‘If anyone, bhikkhus, speaking rightly could say of anything: \"It is a noble dwelling, a divine dwelling, the Tathāgata's dwelling,\" it is of concentration by mindfulness of breathing that one could rightly say this.’"
}