{
    "sn54.8:1": "\"Bhikkhus, concentration by mindfulness of breathing, when developed and cultivated, is of great fruit and benefit. And how, bhikkhus, is concentration by mindfulness of breathing developed and cultivated so that it is of great fruit and benefit?sn.v.37",
    "sn54.8:2": "\"Here, bhikkhus, a bhikkhu, having gone to the forest, to the foot of a tree, or to an empty hut, sits down. Having folded his legs crosswise, straightened his body, and set up mindfulness in front of him, just mindful he breathes in, mindful he breathes out … . He trains thus: ‘Contemplating relinquishment, I will breathe in’; he trains thus: ‘Contemplating relinquishment, I will breathe out.’",
    "sn54.8:3": "\"I too, bhikkhus, before my enlightenment, while I was still a bodhisatta, not yet fully enlightened, generally dwelt in this dwelling. While I generally dwelt in this dwelling, neither my body nor my eyes became fatigued and my mind, by not clinging, was liberated from the taints.",
    "sn54.8:4": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May neither my body nor my eyes become fatigued and may my mind, by not clinging, be liberated from the taints,’ this same concentration by mindfulness of breathing should be closely attended to.[n.296]Spk: When one works on other meditation subjects the body becomes fatigued and the eyes are strained. For example, when one works on the meditation subject of the (four) elements, the body becomes fatigued and reaches a stage of oppression such that one feels as if one has been thrown into a mill. When one works on a kasiṇa, the eyes throb and become fatigued and when one emerges one feels as if one is tumbling. But when one works on this meditation subject the body is not fatigued and the eyes do not become strained.",
    "sn54.8:5": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May the memories and intentions connected with the household life be abandoned by me,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:6": "\"Therefore, bhikkhus, if a bhikkhu wishes:[n.297] See n.110.Spk: This passage on the \"noble one's spiritual power\"(ariyiddhi)is included to show the advantage (in developing mindfulness of breathing). For if a bhikkhu wishes for the noble one's spiritual power, or the four jhānas, or the four formless attainments, or the attainment of cessation, he should attend closely to this concentration by mindfulness of breathing. Just as, when a city is captured, all the merchandise in the four quarters that enters the city through the four gates and the country is captured as well—this being the advantage of a city—so all the attainments listed in the text are achieved by a meditator when this concentration by mindfulness of breathing has been fully developed.‘May I dwell perceiving the repulsive in the unrepulsive,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:7": "If a bhikkhu wishes: ‘May I dwell perceiving the unrepulsive in the repulsive,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:8": "If a bhikkhu wishes: ‘May I dwell perceiving the repulsive in the unrepulsive and the repulsive,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:9": "If a bhikkhu wishes:sn.v.318‘May I dwell perceiving the unrepulsive in the repulsive and the unrepulsive,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:10": "If a bhikkhu wishes: ‘Avoiding both the unrepulsive and the repulsive, may I dwell equanimous, mindful and clearly comprehending,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:11": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May I, secluded from sensual pleasures, secluded from unwholesome states, enter and dwell in the first jhāna, which is accompanied by thought and examination, with rapture and happiness born of seclusion,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:12": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May I, with the subsiding of thought and examination, enter and dwell in the second jhāna, which has internal confidence and unification of mind, is without thought and examination, and has rapture and happiness born of concentration,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:13": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May I, with the fading away as well of rapture, dwell equanimous and, mindful and clearly comprehending, may I experience happiness with the body; may I enter and dwell in the third jhāna of which the noble ones declare: \"He is equanimous, mindful, one who dwells happily,\" ’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:14": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May I, with the abandoning of pleasure and pain, and with the previous passing away of joy and displeasure, enter and dwell in the fourth jhāna, which is neither painful nor pleasant and includes the purification of mindfulness by equanimity,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:15": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May I, with the complete transcendence of perceptions of forms, with the passing away of perceptions of sensory impingement, with nonattention to perceptions of diversity, aware that \"space is infinite,\" enter and dwell in the base of the infinity of space,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:16": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May I, by completely transcending the base of the infinity of space,sn.v.319aware that \"consciousness is infinite,\" enter and dwell in the base of the infinity of consciousness,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:17": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May I, by completely transcending the base of the infinity of consciousness, aware that \"there is nothing,\" enter and dwell in the base of nothingness, ’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:18": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May I, by completely transcending the base of nothingness, enter and dwell in the base of neither-perception-nor-nonperception,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:19": "\"Therefore, bhikkhus, if a bhikkhu wishes: ‘May I, by completely transcending the base of neither-perception-nor-nonperception, enter and dwell in the cessation of perception and feeling,’ this same concentration by mindfulness of breathing should be closely attended to.",
    "sn54.8:20": "\"When, bhikkhus, the concentration by mindfulness of breathing has been developed and cultivated in this way, if he feels a pleasant feeling, he understands: ‘It is impermanent’; he understands: ‘It is not held to’; he understands: ‘It is not delighted in.’[n.298] From here down as atSN12.51,22:88, andSN36.7.If he feels a painful feeling, he understands: ‘It is impermanent’; he understands: ‘It is not held to’; he understands: ‘It is not delighted in.’ If he feels a neither-painful-nor-pleasant feeling, he understands: ‘It is impermanent’; he understands: ‘It is not held to’; he understands: ‘It is not delighted in.’",
    "sn54.8:21": "\"If he feels a pleasant feeling, he feels it detached; if he feels a painful feeling, he feels it detached; if he feels a neither-painful-nor-pleasant feeling, he feels it detached.",
    "sn54.8:22": "\"Just as, bhikkhus, an oil lamp burns in dependence on the oil and the wick, and with the exhaustion of the oil and the wick it is extinguished through lack of fuel, so too, bhikkhus, when a bhikkhusn.v.320feels a feeling terminating with the body … terminating with life … He understands: ‘With the breakup of the body, following the exhaustion of life, all that is felt, not being delighted in, will become cool right here.’\""
}