{
    "sn54.9:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Vesālī in the Great Wood in the Hall with the Peaked Roof.[n.299] A more elaborate version of the strange background story to this sutta is the background story to Parajika 3 atin the Vibhaṅga. I summarize the commentarial version just below at n.30. The problems raised by the story are discussed in Mills, \"The Case of the Murdered Monks.\"Now on that occasion the Blessed One was giving the bhikkhus a talk on foulness in many ways, was speaking in praise of foulness, was speaking in praise of the development of foulness meditation.[n.300] That is, he was explaining the meditation on the thirty-one parts of the body (increased to thirty-two in the commentaries) and the stages of decomposition of a corpse.",
    "sn54.9:2": "Then the Blessed One addressed the bhikkhus thus: \"Bhikkhus, I wish to go into seclusion for half a month. I should not be approached by anyone except the one who brings me almsfood.\"[n.301]Spk:Why did he speak thus? In the past, it is said, five hundred men earned their living together as hunters. They were reborn in hell, but later, through some good kamma, they took rebirth as human beings and went forth as monks under the Blessed One. However, a portion of their original bad kamma had gained the opportunity to ripen during this fortnight and was due to bring on their deaths both by suicide and homicide. The Blessed One foresaw this and realized he could do nothing about it. Among those monks, some were worldlings, some stream-enterers, some once-returners, some nonreturners, some arahants. The arahants would not take rebirth, the other noble disciples were bound for a happy rebirth, but the worldlings were of uncertain destiny. The Buddha spoke of foulness to remove their attachment to the body so that they would lose their fear of death and could thus be reborn in heaven. Therefore he spoke on foulness in order to help them, not with the intention of extolling death. Realizing he could not turn back the course of events, he went into seclusion to avoid being present when destiny took its toll.So the commentary, but the idea of a kammically predetermined suicide seems difficult to reconcile with the conception of suicide as a volitionally induced act.",
    "sn54.9:3": "Then those bhikkhus, thinking: \"The Blessed One was giving a talk on foulness in many ways, was speaking in praise of foulness, was speaking in praise of the development of foulness meditation,\" dwelt devoted to the development of foulness meditation in its many aspects and factors. Being repelled, humiliated, and disgusted with this body, they sought for an assailant. In one day ten bhikkhus used the knife, or in one day twenty or thirty bhikkhus used the knife.[n.02] In the Vinaya account (repeated bySpk) they take their own lives, and deprive one another of life, and request the “sham ascetic” Migalaṇḍika to kill them. Spk adds that the noble ones did not kill anyone, or enjoin others to kill, or consent to killing; it was only the worldlings who did so.",
    "sn54.9:4": "Then, when that half-month had passed, the Blessed One emerged from seclusion and addressed the Venerable Ānanda: \"Why, Ānanda, does the Bhikkhu Saṅgha look so diminished?\"[n.303]Spk's paraphrase is poignant: \"Earlier, Ānanda, many bhikkhus gathered in the assembly, and the park seemed ablaze with them. But now, after only half a month, the Saṅgha has become diminished, thin, scanty, like sparse foliage. What is the cause? Where have the bhikkhus gone?\"",
    "sn54.9:5": "\"Well then, Ānanda, assemble in the attendance hall all the bhikkhus who are living in dependence on Vesālī.\"",
    "sn54.9:6": "Then the Blessed One went to the attendance hall, sat down in the appointed seat, and addressed the bhikkhus thus:",
    "sn54.9:7": "\"Just as, bhikkhus, in the last month of the hot season, when a mass of dust and dirt has swirled up, a great rain cloud out of season disperses it and quells it on the spot,[n.306] The simile is also atSN45.156.so too concentration by mindfulness of breathing, when developed and cultivated, is peaceful and sublime,sn.v.322an ambrosial pleasant dwelling, and it disperses and quells on the spot evil unwholesome states whenever they arise. And how is this so?",
    "sn54.9:8": "\"Here, bhikkhus, a bhikkhu, having gone to the forest, to the foot of a tree, or to an empty hut, sits down. Having folded his legs crosswise, straightened his body, and set up mindfulness in front of him, just mindful he breathes in, mindful he breathes out … . He trains thus: ‘Contemplating relinquishment, I will breathe in’; he trains thus: ‘Contemplating relinquishment, I will breathe out.’"
}