{
    "sn55.27:3": "… \"I am not bearing up, venerable sir, I am not getting better. Strong painful feelings are increasing in me, not subsiding, and their increase, not their subsiding, is to be discerned.\"sn.v.86",
    "sn55.27:4": "\"Householder, for the uninstructed worldling who possesses four things there is fright, there is trepidation, there is fear of imminent death.[n.352]Samparāyikaṁ maraṇabhayaṁ.Spk:samparāyahetukaṁ maraṇabhayaṁ,which might mean \"fear of death caused (by expectations for) the next life.\"What four?",
    "sn55.27:5": "\"Again, householder, the uninstructed worldling has distrust towards the Dhamma, and when he considers within himself that distrust towards the Dhamma, there is fright, trepidation, and fear of imminent death.",
    "sn55.27:6": "\"Again, householder, the uninstructed worldling has distrust towards the Saṅgha, and when he considers within himself that distrust towards the Saṅgha, there is fright, trepidation, and fear of imminent death.",
    "sn55.27:7": "\"Again, householder, the uninstructed worldling is immoral, and when he considers within himself that immorality, there is fright, trepidation, and fear of imminent death.",
    "sn55.27:8": "\"For the uninstructed worldling who possesses these four things there is fright, trepidation, and fear of imminent death.\"Householder, for the instructed noble disciple who possesses four things there is no fright, no trepidation, no fear of imminent death. What four?\"Here, householder, the instructed noble disciple possesses confirmed confidence in the Buddha thus: ‘The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.’ When he considers within himself that confirmed confidence in the Buddha, there is no fright, trepidation, or fear of imminent death.",
    "sn55.27:9": "\"Again, householder, the instructed noble disciple possesses confirmed confidence in the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One … to be personally experienced by the wise.’ When he considers within himself that confirmed confidence in the Dhamma, there is no fright, trepidation, or fear of imminent death.",
    "sn55.27:10": "\"Again, householder, the instructed noble disciple possesses confirmed confidence in the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practising the good way … the unsurpassed field of merit for the world.’ When he considers within himself that confirmed confidence in the Saṅgha, there is no fright, trepidation, or fear of imminent death.",
    "sn55.27:11": "\"Again, householder, the instructed noble disciple possesses the virtues dear to the noble ones, unbroken … leading to concentration. When he considers within himself those virtues dear to the noble ones,sn.v.387there is no fright, trepidation, or fear of imminent death.",
    "sn55.27:12": "\"I am not afraid, Venerable Ānanda. Why should I be afraid? For, venerable sir, I possess confirmed confidence in the Buddha … in the Dhamma … in the Saṅgha. And as to these training rules for the laity taught by the Blessed One, I do not see within myself any that has been broken.\""
}