{
    "sn55.25:1–2": "At Kapilavatthu. Now on that occasion Sarakāni the Sakyan had died, and the Blessed One had declared him to be a stream-enterer, no longer bound to the nether world, fixed in destiny, with enlightenment as his destination. Thereupon a number of Sakyans, having met and assembled, deplored this, grumbled, and complained about it, saying: \"It is wonderful indeed, sir! It is amazing indeed, sir! Now who here won’t be a stream-enterer when the Blessed One has declared Sarakāni the Sakyan after he died to be a stream-enterer … with enlightenment as his destination? Sarakāni the Sakyan was one who had failed to fulfil the training!\"[n.348]Sikkhāya aparipūrakārī ahosi.The wording is slightly different from that in the preceding sutta but the purport is the same.",
    "sn55.25:3": "\"Mahānāma, when, over a long time, a lay follower has gone for refuge to the Buddha, the Dhamma, and the Saṅgha, how could he go to the nether world? … Mahānāma, over a long time Sarakāni the Sakyan had gone for refuge to the Buddha, the Dhamma, and the Saṅgha, so how could he go to the nether world?",
    "sn55.25:4": "\"Here, Mahānāma, some person is completely dedicated to the Buddha and has full confidence in him thus:[n.39] As atSN8.50. The expression,ekantagato abhippasanno,is effectively synonymous withaveccappasādena samannāgato.‘The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.’ And so in regard to the Dhamma and the Saṅgha. He is one of joyous wisdom, of swift wisdom, and he has attained liberation. By the destruction of the taints, in this very life he enters and dwells in the taintless liberation of mind, liberation by wisdom, realizing it for himself with direct knowledge. This person, Mahānāma, is freed from hell, the animal realm, and the domain of ghosts, freed from the plane of misery, the bad destinations, the nether world.",
    "sn55.25:5": "\"Here, Mahānāma, some person is completely dedicated to the Buddha and has full confidence in him … . And so in regard to the Dhamma and the Saṅgha. He is one of joyous wisdom, of swift wisdom, yet he has not attained liberation. With the utter destruction of the five lower fetters he has become one who attains final knowledge early in this very life, or one who attains final knowledge at the time of death, or an attainer of Nibbāna in the interval, or an attainer of Nibbāna upon landing, or an attainer of Nibbāna without exertion, or an attainer of Nibbāna with exertion, or one bound upstream, heading towards the Akaniṭṭha realm.[n.30] A fivefold elaboration on the nonreturner; see n.6.This person too, Mahānāma, is freed from hell, the animal realm, and the domain of ghosts, freed from the plane of misery, the bad destinations, the nether world.",
    "sn55.25:6": "\"Here, Mahānāma, some person is completely dedicated to the Buddha and has full confidence in him … . And so in regard to the Dhamma and the Saṅgha. He is not one of joyous wisdom, nor of swift wisdom, and he has not attained liberation. With the utter destruction of three fetters and with the diminishing of greed, hatred, and delusion, he is a once-returner who, after coming back to this world only one more time, will make an end to suffering. This person too, Mahānāma,sn.v.379is freed from hell, the animal realm, and the domain of ghosts, freed from the plane of misery, the bad destinations, the nether world.",
    "sn55.25:7": "\"Here, Mahānāma, some person is completely dedicated to the Buddha and has full confidence in him … . And so in regard to the Dhamma and the Saṅgha. He is not one of joyous wisdom, nor of swift wisdom, and he has not attained liberation. With the utter destruction of three fetters he is a stream-enterer, no longer bound to the nether world, fixed in destiny, with enlightenment as his destination. This person too, Mahānāma, is freed from hell, the animal realm, and the domain of ghosts, freed from the plane of misery, the bad destinations, the nether world.",
    "sn55.25:8": "\"Here, Mahānāma, some person is not completely dedicated to the Buddha and does not have full confidence in him thus: ‘The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.’ And so in regard to the Dhamma and the Saṅgha. He is not one of joyous wisdom, nor of swift wisdom, and he has not attained liberation. However, he has these five things: the faculty of faith … the faculty of wisdom. And the teachings proclaimed by the Tathāgata are accepted by him after being pondered to a sufficient degree with wisdom. This person too, Mahānāma, is one who does not go to hell, the animal realm, or the domain of ghosts, to the plane of misery, the bad destinations, the nether world.",
    "sn55.25:9": "\"Here, Mahānāma, some person is not completely dedicated to the Buddha and does not have full confidence in him … . And so in regard to the Dhamma and the Saṅgha. He is not one of joyous wisdom, nor of swift wisdom, and he has not attained liberation. However, he has these five things: the faculty of faith … the faculty of wisdom. And he has sufficient faith in the Tathāgata, sufficient devotion to him. This person too, Mahānāma, is one who does not go to hell, the animal realm, or the domain of ghosts, to the plane of misery, the bad destinations, the nether world.",
    "sn55.25:10": "\"Suppose, Mahānāma, there is a bad field, a bad piece of ground, with stumps not cleared, and the seeds sown there would be broken, spoilt, damaged by wind and sun, unfertile, not planted securely, and the sky would not send down a proper rainfall. Would those seeds come to growth, increase, and expansion?\"",
    "sn55.25:11": "\"Suppose, Mahānāma, there is a good field, a good piece of ground, well cleared of stumps, and the seeds sown there would be unbroken, unspoilt, undamaged by wind and sun, fertile, planted securely, and the sky would send down a proper rainfall. Would those seeds come to growth, increase, and expansion?\""
}