{
    "sn55.7:1": "Thus have I heard. On one occasion the Blessed One was walking on tour among the Kosalans together with a great Saṅgha of bhikkhus when he reached the brahmin village of the Kosalans named Bamboo Gate. Then the brahmin householders of Bamboo Gate heard: \"It is said, sirs, that the ascetic Gotama, the son of the Sakyans who went forth from a Sakyan family, has been walking on tour among the Kosalans together with a great Saṅgha of bhikkhus and has arrived at Bamboo Gate. Now a good report concerning that Master Gotama has spread about thus: ‘That Blessed One is an arahant, perfectly enlightened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Enlightened One, the Blessed One. Having realized by his own direct knowledge this world with its devas, Māra, and Brahma, this generation with its ascetics and brahmins, its devas and humans, he makes it known to others. He teaches a Dhamma that is good in the beginning, good in the middle, good in the end, with the right meaning and phrasing; he reveals a holy life that is perfectly complete and pure.’ It is good to see such arahants.\"sn.v.353",
    "sn55.7:2": "Then those brahmin householders of Bamboo Gate approached the Blessed One. Having approached, some paid homage to the Blessed One and sat down to one side. Some greeted the Blessed One and, having exchanged greetings and cordial talk, sat down to one side. Some extended their joined hands in reverential salutation towards the Blessed One and sat down to one side. Some announced their name and clan to the Blessed One and sat down to one side. Some remained silent and sat down to one side. Sitting to one side, those brahmin householders of Bamboo Gate said to the Blessed One:",
    "sn55.7:3": "\"I will teach you, householders, a Dhamma exposition applicable to oneself.[n.28]Attūpanāyikaṁ dhammapariyāyaṁ.Spk-pṭ: Having related it to oneself, it is to be applied to others(attani netā parasmiṁ upanetabbaṁ). As it is said: \"What is displeasing and disagreeable to me is displeasing and disagreeable to the other too.\"What follows are the first seven of the ten courses of wholesome action, each practised in three ways: by observing them oneself, by enjoining others to observe them, and by speaking in their praise.Listen to that and attend closely, I will speak.\"",
    "sn55.7:4": "\"What, householders, is the Dhamma exposition applicable to oneself? Here, householders, a noble disciple reflects thus: ‘I am one who wishes to live, who does not wish to die; I desire happiness and am averse to suffering. Since I am one who wishes to live … and am averse to suffering, if someone were to take my life, that would not be pleasing and agreeable to me. Now if I were to take the life of another—of one who wishes to live, who does not wish to die, who desires happiness and is averse to suffering—that would not be pleasing and agreeable to the other either. What is displeasing and disagreeable to mesn.v.35is displeasing and disagreeable to the other too. How can I inflict upon another what is displeasing and disagreeable to me?’ Having reflected thus, he himself abstains from the destruction of life, exhorts others to abstain from the destruction of life, and speaks in praise of abstinence from the destruction of life. Thus this bodily conduct of his is purified in three respects.[n.329] Eeti koṭiparisuddhoshould be corrected totikoṭiparisuddho(without the hiatus). The \"three respects\" are: personally abstaining from killing, exhorting others to abstain, and speaking in praise of abstinence from killing.",
    "sn55.7:5": "\"Again, householders, a noble disciple reflects thus: ‘If someone were to take from me what I have not given, that is, to commit theft, that would not be pleasing and agreeable to me. Now if I were to take from another what he has not given, that is, to commit theft, that would not be pleasing and agreeable to the other either. What is displeasing and disagreeable to me is displeasing and disagreeable to the other too. How can I inflict upon another what is displeasing and disagreeable to me?’ Having reflected thus, he himself abstains from taking what is not given, exhorts others to abstain from taking what is not given, and speaks in praise of abstinence from taking what is not given. Thus this bodily conduct of his is purified in three respects.",
    "sn55.7:6": "\"Again, householders, a noble disciple reflects thus: ‘If someone were to commit adultery with my wives, that would not be pleasing and agreeable to me. Now if I were to commit adultery with the wives of another, that would not be pleasing and agreeable to the other either. What is displeasing and disagreeable to me is displeasing and disagreeable to the other too. How can I inflict upon another what is displeasing and disagreeable to me?’ Having reflected thus, he himself abstains from sexual misconduct, exhorts others to abstain from sexual misconduct, and speaks in praise of abstinence from sexual misconduct. Thus this bodily conduct of his is purified in three respects.",
    "sn55.7:7": "\"Again, householders, a noble disciple reflects thus: ‘If someone were to damage my welfare with false speech, that would not be pleasing and agreeable to me. Now if I were to damage the welfare of another with false speech, that would not be pleasing and agreeable to the other either.sn.v.355What is displeasing and disagreeable to me is displeasing and disagreeable to the other too. How can I inflict upon another what is displeasing and disagreeable to me?’ Having reflected thus, he himself abstains from false speech, exhorts others to abstain from false speech, and speaks in praise of abstinence from false speech. Thus this verbal conduct of his is purified in three respects.",
    "sn55.7:8": "\"Again, householders, a noble disciple reflects thus: ‘If someone were to divide me from my friends by divisive speech, that would not be pleasing and agreeable to me. Now if I were to divide another from his friends by divisive speech, that would not be pleasing and agreeable to the other either. … ’ Thus this verbal conduct of his is purified in three respects.",
    "sn55.7:9": "\"Again, householders, a noble disciple reflects thus: ‘If someone were to address me with harsh speech, that would not be pleasing and agreeable to me. Now if I were to address another with harsh speech, that would not be pleasing and agreeable to the other either. … ’ Thus this verbal conduct of his is purified in three respects.",
    "sn55.7:10": "\"Again, householders, a noble disciple reflects thus: ‘If someone were to address me with frivolous speech and idle chatter, that would not be pleasing and agreeable to me. Now if I were to address another with frivolous speech and idle chatter, that would not be pleasing and agreeable to the other either. What is displeasing and disagreeable to me is displeasing and disagreeable to the other too. How can I inflict upon another what is displeasing and disagreeable to me?’ Having reflected thus, he himself abstains from idle chatter, exhorts others to abstain from idle chatter, and speaks in praise of abstinence from idle chatter. Thus this verbal conduct of his is purified in three respects.",
    "sn55.7:11": "\"He possesses confirmed confidence in the Buddha thus: ‘The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.’sn.v.356He possesses confirmed confidence in the Dhamma … in the Saṅgha. … He possesses the virtues dear to the noble ones, unbroken … leading to concentration.",
    "sn55.7:12": "When this was said, the brahmin householders of Bamboo Gate said: \"Magnificent, Master Gotama! … We go for refuge to Master Gotama, and to the Dhamma, and to the Bhikkhu Saṅgha. From today let the Blessed One remember us as lay followers who have gone for refuge for life.\""
}