{
    "sn55.3:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Now on that occasion the lay follower Dighavu was sick, afflicted, gravely ill. Then the lay follower Dighavu addressed his father, the householder Jotika, thus: \"Come, householder, approach the Blessed One, pay homage to him in my name with your head at his feet, and say: ‘Venerable sir, the lay follower Dighavu is sick, afflicted, gravely ill; he pays homage to the Blessed One with his head at the Blessed One's feet.’ Then say: ‘It would be good, venerable sir, if the Blessed One would come to the residence of the lay follower Dighavu out of compassion.’\"",
    "sn55.3:2": "Then the Blessed One dressed and, taking bowl and robe, went to the residence of the lay follower Dighavu.sn.v.345He then sat down in the appointed seat and said to the lay follower Dighavu: \"I hope you are bearing up, Dighavu, I hope you are getting better. I hope your painful feelings are subsiding and not increasing, and that their subsiding, not their increase, is to be discerned.\"",
    "sn55.3:3": "\"Venerable sir, as to these four factors of stream-entry that have been taught by the Blessed One, these things exist in me, and I live in conformity with those things. For, venerable sir, I possess confirmed confidence in the Buddha … in the Dhamma … in the Saṅgha. … I possess the virtues dear to the noble ones, unbroken … leading to concentration.\"",
    "sn55.3:4": "\"Venerable sir, as to these six things that partake of true knowledge that have been taught by the Blessed One, these things exist in me, and I live in conformity with those things. For, venerable sir, I dwell contemplating impermanence in all formations, perceiving suffering in what is impermanent, perceiving nonself in what is suffering, perceiving abandonment, perceiving fading away, perceiving cessation. However, venerable sir, the thought occurs to me: ‘After I am gone, may this householder Jotika not fall into distress.’\"sn.v.36",
    "sn55.3:5": "Then the Blessed One, having given this exhortation to the lay follower Dighavu, rose from his seat and departed. Then, not long after the Blessed One had left, the lay follower Dighavu died."
}