{
    "sn55.40:1": "On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in Nigrodha's Park. Then Nandiya the Sakyan approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "sn55.40:2": "\"Nandiya, I say that one in whom the four factors of stream-entry are completely and totally absent is ‘an outsider, one who stands in the faction of worldlings.’[n.358] As atSN48.18.But, Nandiya, as to how a noble disciple is one who dwells negligently and one who dwells diligently, listen to that and attend closely, I will speak.\"sn.v.398",
    "sn55.40:3": "\"And how, Nandiya, is a noble disciple one who dwells negligently? Here, Nandiya, a noble disciple possesses confirmed confidence in the Buddha thus: ‘The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.’ Content with that confirmed confidence in the Buddha, he does not make further effort for solitude by day nor for seclusion at night. When he thus dwells negligently, there is no gladness.[n.59] From here on as atSN5.97, and conversely for the passage on dwelling diligently.When there is no gladness, there is no rapture. When there is no rapture, there is no tranquillity. When there is no tranquillity, he dwells in suffering. The mind of one who suffers does not become concentrated. When the mind is not concentrated, phenomena do not become manifest. Because phenomena do not become manifest, he is reckoned as ‘one who dwells negligently.’",
    "sn55.40:4": "\"Again, Nandiya, a noble disciple possesses confirmed confidence in the Dhamma … in the Saṅgha. … He possesses the virtues dear to the noble ones, unbroken … leading to concentration. Content with those virtues dear to the noble ones, he does not make further effort for solitude by day nor for seclusion at night. When he thus dwells negligently, there is no gladness. … Because phenomena do not become manifest, he is reckoned as ‘one who dwells negligently.’",
    "sn55.40:5": "\"And how, Nandiya, is a noble disciple one who dwells diligently? Here, Nandiya, a noble disciple possesses confirmed confidence in the Buddha thus: ‘The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.’ Not content with that confirmed confidence in the Buddha, he makes further effort for solitude by day and for seclusion at night. When he thus dwells diligently, gladness is born. When he is gladdened, rapture is born. When the mind is uplifted by rapture, the body becomes tranquil. One tranquil in body experiences happiness. The mind of one who is happy becomes concentrated. When the mind is concentrated, phenomena become manifest. Because phenomena become manifest, he is reckoned as ‘one who dwells diligently.’sn.v.399",
    "sn55.40:6": "\"Again, Nandiya, a noble disciple possesses confirmed confidence in the Dhamma … in the Saṅgha. … He possesses the virtues dear to the noble ones, unbroken … leading to concentration. Not content with those virtues dear to the noble ones, he makes further effort for solitude by day and for seclusion at night. When he thus dwells diligently, gladness is born. … Because phenomena become manifest, he is reckoned as ‘one who dwells diligently.’\"It is in this way, Nandiya, that a noble disciple is one who dwells diligently.\""
}