{
    "sn55.54:1": "On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in Nigrodha's Park. Now on that occasion a number of bhikkhus were making a robe for the Blessed One, thinking: \"After the three months, with his robe completed, the Blessed One will set out on tour.\"",
    "sn55.54:2": "\"A wise lay follower,[n.367]Sapañño upāsako.Spk: A stream-enterer is intended.Mahānāma, who is sick, afflicted, and gravely ill should be consoled by another wise lay follower with four consolations: ‘Let the venerable one[n.368]Āyasmā,usually an address for monks, but occasionally used for lay followers. In what follows I have translated using idiomatic English second-person constructions where the Pali uses indirect, third-person forms, e.g., \"The venerable one has confirmed confidence in the Buddha. … \"be consoled. You have confirmed confidence in the Buddha thus: \"The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.\" You have confirmed confidence in the Dhamma … in the Saṅgha. … You have the virtues dear to the noble ones, unbroken … leading to concentration.’sn.v.409",
    "sn55.54:3": "\"After a wise lay follower, who is sick, afflicted, and gravely ill has been consoled by a wise lay follower with these four consolations, he should be asked: ‘Are you anxious about your mother and father?’ If he says: ‘I am,’ he should be told: ‘But, good sir, you are subject to death. Whether you are anxious about your mother and father or not, you will die anyway. So please abandon your anxiety over your mother and father.’",
    "sn55.54:4": "\"If he says: ‘I have abandoned my anxiety over my mother and father,’ he should be asked: ‘Are you anxious about your wife and children?’ If he says: ‘I am,’ he should be told: ‘But, good sir, you are subject to death. Whether you are anxious about your wife and children or not, you will die anyway. So please abandon your anxiety over your wife and children.’",
    "sn55.54:5": "\"If he says: ‘I have abandoned my anxiety over my wife and children,’ he should be asked: ‘Are you anxious about the five cords of human sensual pleasure?’ If he says: ‘I am,’ he should be told: ‘Celestial sensual pleasures, friend, are more excellent and sublime than human sensual pleasures. So please withdraw your mind from human sensual pleasures and resolve on the devas of the realm of the Four Great Kings.’",
    "sn55.54:6": "\"If he says: ‘My mind has been withdrawn from human sensual pleasures and resolved on the devas of the realm of the Four Great Kings,’ he should be told:sn.v.410‘The Tāvatiṁsa devas, friend, are more excellent and sublime than the devas of the realm of the Four Great Kings. So please withdraw your mind from the devas of the realm of the Four Great Kings and resolve on the Tāvatiṁsa devas.’",
    "sn55.54:7": "\"If he says: ‘My mind has been withdrawn from the devas of the realm of the Four Great Kings and resolved on the Tāvatiṁsa devas,’ he should be told: ‘More excellent and sublime, friend, than the Tāvatiṁsa devas are the Yama devas … the Tusita devas … the Nimmanarati devas … the Paranimmitavāsavātti devas. … The brahma world, friend, is more excellent and sublime than the Paranimmitavāsavātti devas. So please withdraw your mind from the Paranimmitavāsavātti devas and resolve on the brahma world.’[n.369] AtMN9, Sāriputta guides a dying brahmin through a similar sequence of reflections, but stops after directing him to the brahma world. For stopping there he is later reproached by the Buddha.",
    "sn55.54:8": "\"If he says: ‘My mind has been withdrawn from the brahma world; I have directed my mind to the cessation of identity,’ then, Mahānāma, I say there is no difference between a lay follower who is thus liberated in mind and a bhikkhu who has been liberated in mind for a hundred years,[n.371] I read with Beevaṁvimuttacittassa,as against Seevaṁvimucittattassa(probably a typographical error) and Eeevaṁvuttassa.But with Se I readvassasatavimuttacittena,as against Be and Eeāsavā vimuttacittena.that is, between one liberation and the other.\"[n.372] I read with Se and Eevimuttiyā vimuttin ti,as against Bevimuttiyā vimuttan ti.The phrasevimuttiyā vimuttiṁis also atAN III 34,6–7, again referring to arahantship.Spk: When one liberation is compared to the other, there is no difference to be described. When the path or fruit is penetrated, there is no difference between lay followers and bhikkhus.The Buddha’s statement thus indicates that the lay follower has become an arahant. Apart from the few instances of lay people who attained arahantship just before renouncing the household life (like Yasa at Vin I 17,1–3), this may be the only mention of a lay arahant in the Nikāyas, and in his case the attainment occurs on the verge of death. Mil 264–66 lays down the thesis that a lay person who attains arahantship either goes forth that day (i.e., becomes a monk or nun) or passes away into final Nibbāna."
}