{
    "sn55.21:1": "Thus have I heard. On one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in Nigrodha's Park. Then Mahānāma the Sakyan approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "sn55.21:2": "\"Don’t be afraid, Mahānāma! Don’t be afraid, Mahānāma! Your death will not be a bad one, your demise will not be a bad one.[n.338] At the time Mahānāma was at least a stream-enterer, possibly a once-returner; hence he was assured of a good rebirth and had no reason to fear death.When a person's mind has been fortified over a long time by faith, virtue, learning, generosity, and wisdom, right here crows, vultures, hawks, dogs, jackals, or various creatures eat his body, consisting of form, composed of the four great elements,sn.v.370originating from mother and father, built up out of rice and gruel, subject to impermanence, to being worn and rubbed away away, to breaking apart and dispersal. But his mind, which has been fortified over a long time by faith, virtue, learning, generosity, and wisdom—that goes upwards, goes to distinction.[n.339]Taṁ uddhaṅgāmi hoti visesagāmi.The passage showscittaas the principle of personal continuity which survives the death of the body and reaps the fruits of kamma. In the case of a noble disciple it \"goes to distinction\" by way of a higher rebirth and by evolving onwards to Nibbāna. The following simile of the pot is atSN4.6, differently applied.",
    "sn55.21:3": "\"Suppose, Mahānāma, a man submerges a pot of ghee or a pot of oil in a deep pool of water and breaks it. All of its shards and fragments would sink downwards, but the ghee or oil there would rise upwards. So too, Mahānāma, when a person's mind has been fortified over a long time by faith, virtue, learning, generosity, and wisdom, right here crows … or various creatures eat his body. … But his mind, which has been fortified over a long time by faith, virtue, learning, generosity, and wisdom—that goes upwards, goes to distinction.sn.v.71"
}