{
    "sn55.53:1": "On one occasion the Blessed One was dwelling at Baraṇasi in the Deer Park at Isipatana.sn.v.407Then the lay follower Dhammadinna, together with five hundred lay followers, approached the Blessed One, paid homage to him, and sat down to one side.[n.365]Spk: He was one of the seven people in the Buddha’s time who had a retinue of five hundred; the others were the lay follower Visākha, the householder Ugga, the householder Citta, Hatthaka Āḷavaka, Anāthapiṇḍika the Lesser, and Anāthapiṇḍika the Great.Sitting to one side, the lay follower Dhammadinna then said to the Blessed One: \"Let the Blessed One, venerable sir, exhort us and instruct us in a way that may lead to our welfare and happiness for a long time.\"",
    "sn55.53:2": "\"Therefore, Dhammadinna, you should train yourselves thus: ‘From time to time we will enter and dwell upon those discourses spoken by the Tathāgata that are deep, deep in meaning, supramundane, dealing with emptiness.’ It is in such a way that you should train yourselves.\"[n.366] Cp.SN0.7. It is unusual for the Buddha to give such an injunction to householders, butSpkgives a bizarre explanation, which I reproduce just below. Dhammadinna's words of protest echoSN55.7(V 353,11–15). In addressing Dhammadinna, the Buddha consistently uses the plural, implying that his statements refer to the entire group.Spk: \"Deep(gambhīra), like the Salla Sutta (Sn III, 8); deep in meaning(gambhīrattha), like the Cetana Sutta (1:38–40?); supramundane(lokuttara), like the Asaṅkhatasaṁyutta (SN 43); dealing with emptiness(suññatapaṭisaṁyutta), that is, explaining the emptiness of beings, like the Khajjaniya Sutta (SN.79). It is in such a way that you should train yourselves: ‘You should train by fulfilling the practice of the moon simile (SN16.3), the practice of the relay of chariots (MN4), the practice of sagehood (moneyyapaṭipadā,Sn I, 1), the practice of the great noble lineage (mahā-ariyavaṁsa,AN II 7–9).’ (These all allude to suttas that advocate a strict ascetic life; the identity of some of the allusions is uncertain.) Thus the Teacher charged these lay followers with an unbearable task. Why? Because, it is said, they had asked for an exhortation without taking a stand on their own plane(na attano bhūmiyaṁ ṭhatvā), but had asked as if they could take up any task indiscriminately. Hence the Teacher charged them with an unbearable task. But when they asked for an exhortation after taking a stand on their own planewith the words ‘as we are established … ’, the Master complied by saying, ‘Therefore … .’\" It is difficult to reconcile this explanation with the principle that the Buddha always adjusts his teaching to the mental proclivities of his audience.Spkhad commented on the terms describing the deep suttas earlier, in relation toSN0.7.",
    "sn55.53:3": "\"Therefore, Dhammadinna, you should train yourselves thus: ‘We will possess confirmed confidence in the Buddha … in the Dhamma … in the Saṅgha. … We will possess the virtues dear to the noble ones, unbroken … leading to concentration.’ It is in such a way that you should train yourselves.\"",
    "sn55.53:4": "\"Venerable sir, as to these four factors of stream-entry taught by the Blessed One, these things exist in us, and we live in conformity with those things. For, venerable sir, we possess confirmed confidence in the Buddha,sn.v.08the Dhamma, and the Saṅgha. We possess the virtues dear to the noble ones, unbroken … leading to concentration.\""
}