{
    "sn55.13:1": "On one occasion the Venerable Ānanda and the Venerable Sariputta were dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the evening, the Venerable Sariputta emerged from seclusion, approached the Venerable Ānanda, and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side and said to the Venerable Ānanda:",
    "sn55.13:2": "What four?",
    "sn55.13:3": "\"One does not have, friend, that distrust regarding the Dhamma which the uninstructed worldling possesses, because of which the latter, with the breakup of the body, after death, is reborn in the plane of misery, in a bad destination, in the nether world, in hell. And one has that confirmed confidence in the Dhamma which the instructed noble disciple possesses, because of which the latter, with the breakup of the body, after death, is reborn in a good destination, in a heavenly world: ‘The Dhamma is well expounded by the Blessed One … to be personally experienced by the wise.’",
    "sn55.13:4": "\"One does not have, friend, that distrust regarding the Saṅgha which the uninstructed worldling possesses, because of which the latter, with the breakup of the body, after death, is reborn in the plane of misery, in a bad destination, in the nether world, in hell. And one has that confirmed confidence in the Saṅgha which the instructed noble disciple possesses, because of which the latter, with the breakup of the body, after death, is reborn in a good destination, in a heavenly world: ‘The Saṅgha of the Blessed One's disciples is practising the good way … the unsurpassed field of merit for the world.’",
    "sn55.13:5": "\"One does not have, friend, that immorality which the uninstructed worldling possesses, because of which the latter, with the breakup of the body, after death, is reborn in the plane of misery, in a bad destination, in the nether world, in hell. And one has those virtues dear to the noble ones which the instructed noble disciple possesses, because of which the latter, with the breakup of the body, after death, is reborn in a good destination, in a heavenly world: virtues dear to the noble ones … leading to concentration.sn.v.364"
}