{
    "sn55.8:1": "Thus have I heard.[n.330] Along withSN55.0(but notSN55.9), this text is included in the Mahaparinibbāna Sutta atDN6. The latter calls the town Nadika, but both Sv andSpkexplain the name in a way that supports Ñātika: \"There were two villages close by the same pond, inhabited by the sons of two brothers; thus one of these was called Ñātika (‘of the relatives’).\"On one occasion the Blessed One was dwelling at Ñātika in the Brick Hall. Then the Venerable Ānanda approached the Blessed One, paid homage to him, sat down to one side, and said to him:",
    "sn55.8:2": "\"Venerable sir, the bhikkhu named Saḷha has died. What is his destination, what is his future bourn? The bhikkhuni named Nanda has died. What is her destination, what is her future bourn? The male lay follower named Sudatta has died. What is his destination, what is his future bourn? The female lay follower named Sujata has died. What is her destination, what is her future bourn?\"",
    "sn55.8:3": "\"Ānanda, the bhikkhu Saḷha who has died, by the destruction of the taints, in this very life had entered and dwelt in the taintless liberation of mind, liberation by wisdom, realizing it for himself with direct knowledge. The bhikkhuni Nanda who has died had, with the utter destruction of the five lower fetters,sn.v.57become one of spontaneous birth, due to attain Nibbāna there without returning from that world. The male lay follower Sudatta who has died had, with the utter destruction of three fetters and with the diminishing of greed, hatred, and delusion, become a once-returner who, after coming back to this world only one more time, will make an end to suffering.[n.1]Spk: The diminishing (of lust, etc.) should be understood in two ways: as arising infrequently and as lacking obsessive force. For in once-returners lust, etc., do not arise often as they do in worldlings, but only occasionally; and when they do arise they are not thick, as in worldlings, but thin like a fly's wings. \"This world\"(imaṁ lokaṁ)is the sense-sphere world. If one who attains the fruit of once-returning as a human being is reborn among the devas and realizes arahantship, that is good. But if one cannot do so, having come back to the human world one definitely realizes it. Conversely, if one who attains the fruit of once-returning as a deva is reborn among human beings and realizes arahantship, that is good. But if one cannot do so, having come back to the deva world one definitely realizes it.The female lay follower Sujata who has died had, with the utter destruction of three fetters, become a stream-enterer, no longer bound to the nether world, fixed in destiny, with enlightenment as her destination.",
    "sn55.8:4": "\"It is not surprising, Ānanda, that a human being should die. But if each time someone has died you approach and question me about this matter, that would be troublesome for the Tathāgata. Therefore, Ānanda, I will teach you a Dhamma exposition called the mirror of the Dhamma, equipped with which a noble disciple, if he wishes, could by himself declare of himself: ‘I am one finished with hell, finished with the animal realm, finished with the domain of ghosts, finished with the plane of misery, the bad destinations, the nether world. I am a stream-enterer, no longer bound to the nether world, fixed in destiny, with enlightenment as my destination.’",
    "sn55.8:5": "\"And what, Ānanda, is that Dhamma exposition, the mirror of the Dhamma, equipped with which a noble disciple, if he wishes, could by himself declare thus of himself? Here, Ānanda, a noble disciple possesses confirmed confidence in the Buddha thus: ‘The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.’ He possesses confirmed confidence in the Dhamma … in the Saṅgha. … He possesses the virtues dear to the noble ones, unbroken … leading to concentration.",
    "sn55.8:6": "\"This, Ānanda, is that Dhamma exposition, the mirror of the Dhamma, equipped with which a noble disciple, if he wishes, could by himself declare of himself: ‘I am one finished with hell. … I am a stream-enterer, no longer bound to the nether world, fixed in destiny, with enlightenment as my destination.’\"sn.v.358"
}