{
    "sn55.26:1": "At Sāvatthī. Now on that occasion the householder Anāthapiṇḍika was sick, afflicted, gravely ill. Then the householder Anāthapiṇḍika addressed a man thus:",
    "sn55.26:2–3": "\"Yes, master,\" that man replied, and he approached the Venerable Sāriputta, paid homage to him, sat down to one side, and delivered his message. The Venerable Sāriputta consented by silence.",
    "sn55.26:4": "Then, in the morning, the Venerable Sāriputta dressed and, taking bowl and robe, went to the residence of the householder Anāthapiṇḍika with the Venerable Ānanda as his companion. He then sat down in the appointed seat and said to the householder Anāthapiṇḍika: \"I hope you are bearing up, householder, I hope you are getting better. I hope your painful feelings are subsiding and not increasing, and that their subsiding, not their increase, is to be discerned.\"",
    "sn55.26:5": "\"You, householder, do not have that distrust towards the Buddha which the uninstructed worldling possesses because of which the latter, with the breakup of the body, after death, is reborn in the plane of misery, in a bad destination, in the nether world, in hell. And you have confirmed confidence in the Buddha thus: ‘The Blessed One is … teacher of devas and humans, the Enlightened One, the Blessed One.’ As you consider within yourself that confirmed confidence in the Buddha, your pains may subside on the spot.",
    "sn55.26:6": "\"You, householder, do not have that distrust towards the Dhamma which the uninstructed worldling possesses because of which the lattersn.v.382… is reborn in the plane of misery … in hell. And you have confirmed confidence in the Dhamma thus: ‘The Dhamma is well expounded by the Blessed One … to be personally experienced by the wise.’ As you consider within yourself that confirmed confidence in the Dhamma, your pains may subside on the spot.",
    "sn55.26:7": "\"You, householder, do not have that distrust towards the Saṅgha which the uninstructed worldling possesses because of which the latter … is reborn in the plane of misery … in hell. And you have confirmed confidence in the Saṅgha thus: ‘The Saṅgha of the Blessed One's disciples is practising the good way … the unsurpassed field of merit for the world.’ As you consider within yourself that confirmed confidence in the Saṅgha, your pains may subside on the spot.",
    "sn55.26:8": "\"You, householder, do not have that immorality which the uninstructed worldling possesses because of which the latter … is reborn in the plane of misery … in hell. And you have those virtues dear to the noble ones, unbroken … leading to concentration. As you consider within yourself those virtues dear to the noble ones, your pains may subside on the spot.",
    "sn55.26:9": "\"You, householder, do not have that wrong view which the uninstructed worldling possesses because of which the latter … is reborn in the plane of misery … in hell. And you have right view. As you consider within yourself that right view, your pains may subside on the spot.",
    "sn55.26:10–18": "\"You, householder, do not have that wrong intention …sn.v.383… wrong speech … wrong action … wrong livelihood … wrong effort … wrong mindfulness … wrong concentration … wrong knowledge … wrong liberation which the uninstructed worldling possesses because of which the latter … is reborn in the plane of misery … in hell. And you have right intention … right speech … right action … right livelihood … right effort … right mindfulness … right concentration …sn.v.384… right knowledge … right liberation.[n.351] AtMN III 76,7–9, it is said that the trainee in the practice has eight factors, the arahant ten. Yet here, strangely, the last two factors,sammāñāṇaandsammāvimutti, which are supposed to be unique to the arahant, are ascribed to the stream-enterer Anāthapiṇḍika. The last line of the sutta confirms that this was not a mere editorial oversight. For another example of such anomalies, seeSN47.13(and n.160), where two factors of an arahant—liberation, and knowledge and vision of liberation—are ascribed to the trainee Ānanda.As you consider within yourself that right liberation, your pains may subside on the spot.\"Then the pains of the householder Anāthapiṇḍika subsided on the spot.",
    "sn55.26:19": "Then the householder Anāthapiṇḍika served the Venerable Sāriputta and the Venerable Ānanda from his own dish. When the Venerable Sāriputta had finished his meal and had put away his bowl, the householder Anāthapiṇḍika took a low seat and sat down to one side, and the Venerable Sāriputta thanked him with these verses:",
    "sn55.26:20": "\"When one has faith in the Tathāgata,Unshakable and well established,And good conduct built on virtue,Dear to the noble ones and praised;",
    "sn55.26:21": "\"When one has confidence in the SaṅghaAnd view that has been rectified,They say that one is not poor,That one's life is not vain.",
    "sn55.26:22": "\"Therefore the person of intelligence,Remembering the Buddha’s Teaching,Should be devoted to faith and virtue,To confidence and vision of the Dhamma.\"",
    "sn55.26:23": "Then the Venerable Sāriputta, having thanked the householder Anāthapiṇḍika with these verses, rose from his seat and departed.sn.v.385",
    "sn55.26:24": "Then the Venerable Ānanda approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him: \"Now, Ānanda, where are you coming from in the middle of the day?\""
}