{
    "sn56.32:1": "\"Bhikkhus, if anyone should speak thus: ‘Without having made the breakthrough to the noble truth of suffering as it really is, without having made the breakthrough to the noble truth of the origin of suffering as it really is, without having made the breakthrough to the noble truth of the cessation of suffering as it really is, without having made the breakthrough to the noble truth of the way leading to the cessation of suffering as it really is, I will completely make an end to suffering’—this is impossible.",
    "sn56.32:2": "\"Just as, bhikkhus, if someone should speak thus: ‘Having made a basket of acacia leaves or of pine needles or of myrobalan leaves,[n.391] All these leaves are small and delicate. I follow Be for the name of the second type of leaf,saralapatta,which Liyanaratne (\"South Asian Flora,\" §170) renders as the long-leaved Indian pine.sn.v.439I will bring water or a palm fruit,’[n.39] I read with Setālapakkaṁ.All the other texts, including SS, readtālapattaṁ,\"a palm leaf,\" which does not make good sense.Tālapakkaṁis also atIt 88.8this would be impossible; so too, if anyone should speak thus: ‘Without having made the breakthrough to the noble truth of suffering as it really is … I will completely make an end to suffering’—this is impossible.",
    "sn56.32:3": "\"But, bhikkhus, if anyone should speak thus: ‘Having made the breakthrough to the noble truth of suffering as it really is, having made the breakthrough to the noble truth of the origin of suffering as it really is, having made the breakthrough to the noble truth of the cessation of suffering as it really is, having made the breakthrough to the noble truth of the way leading to the cessation of suffering as it really is, I will completely make an end to suffering’—this is possible.",
    "sn56.32:4": "\"Just as, bhikkhus, if someone should speak thus: ‘Having made a basket of lotus leaves or of kino leaves or of maluva leaves,[n.393] Thoughpalāsausually means foliage, here it denotes a specific tree. Liyanaratne (§) identifies this as a kind ofkiṁsuka,but different, it seems, from thekiṁsukamentioned atSN35.25(listed by Liyanaratne at §3). The English name for the palasa is the Bengal kino tree or Dhak tree. Themāluvāis a broad-leaved creeper, mentioned also atAN3.69I will bring water or a palm fruit,’ this would be possible; so too, if anyone should speak thus: ‘Having made the breakthrough to the noble truth of suffering as it really is … I will completely make an end to suffering’—this is possible.",
    "sn56.32:5": "\"Therefore, bhikkhus, an exertion should be made to understand: ‘This is suffering.’ … An exertion should be made to understand: ‘This is the way leading to the cessation of suffering.’\""
}