{
    "sn56.45:1": "On one occasion the Blessed One was dwelling at Vesālī in the Great Wood in the Hall with the Peaked Roof. Then, in the morning, the Venerable Ānanda dressed and, taking bowl and robe, entered Vesālī for alms. The Venerable Ānanda saw a number of Licchavi youths practising archery in the training hall, shooting arrows from a distance through a very small keyhole, head through butt,[n.405]Ponkhānuponkhaṁ.Spk: He saw them shoot one arrow, then shoot another—called the \"afterbutt\"(anuponkhaṁ)—in such a way that the butt of the first arrow's shaft was split, then shoot still another through the butt of the second arrow.without missing. When he saw this, the thought occurred to him: \"These Licchavi youths are indeed trained! These Licchavi youths are indeed well trained, in that they shoot arrows from a distance through a very small keyhole, head through butt, without missing.\"",
    "sn56.45:2": "Then, when the Venerable Ānanda had walked for alms in Vesālī and had returned from his alms round, after his meal he approached the Blessed One, paid homage to him, sat down to one side, and reported what he had seen.sn.v.454",
    "sn56.45:3": "The Blessed One said:\"What do you think, Ānanda, which is more difficult and challenging: to shoot arrows from a distance through a very small keyhole, head through butt, without missing, or to pierce with the arrowhead the tip of a hair split into seven strands?\"[n.406]Spkglossesdurabhisambhavataraṁwithdukkarataraṁ.On the splitting of the hair, I follow Be, which reads sattadha, supported by Spk (both Be and Se). Se and Ee of text havesatadhā,\"a hundred strands.\"Spk: Having split one hair into seven strands, they fix one strand to an eggplant and another to the tip of the arrowhead; then, standing at a distance of an usabha (about 200 feet), they pierce the strand fixed to the arrowhead through the strand fixed to the eggplant.",
    "sn56.45:4": "\"Therefore, Ānanda, an exertion should be made to understand: ‘This is suffering.’ … An exertion should be made to understand: ‘This is the way leading to the cessation of suffering.’\""
}