{
    "sn56.41:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. There the Blessed One addressed the bhikkhus thus:",
    "sn56.41:2": "The man returned to the city and informed a great crowd of people: ‘I must be mad, sirs! I must be insane! I’ve seen something that doesn’t exist in the world.’",
    "sn56.41:3": "\"Nevertheless, bhikkhus, what that man saw was actually real, not unreal.[n.401]Spk: It is said that the asuras had applied the Sambari magic (seeSN11.2) and resolved that the man would see them mounted on their elephants and horses entering through slits in the lotus stalks. AtAN II 80,22–24it is said that speculating about the world leads to madness, yet here, strangely, it turns out that the man is not really mad after all.Once in the past the devas and the asuras were arrayed for battle. In that battle the devas won and the asuras were defeated. In their defeat,sn.v.448the asuras were frightened and entered the asura city through the lotus stalk, to the bewilderment of the devas.",
    "sn56.41:4": "\"Therefore, bhikkhus, do not reflect about the world, thinking: ‘The world is eternal’ or ‘The world is not eternal’; or ‘The world is finite’ or ‘The world is infinite’; or ‘The soul and the body are the same’ or ‘The soul is one thing, the body is another’; or ‘The Tathāgata exists after death,’ or ‘The Tathāgata does not exist after death,’ or ‘The Tathāgata both exists and does not exist after death,’ or ‘The Tathāgata neither exists nor does not exist after death.’ For what reason? Because, bhikkhus, this reflection is unbeneficial, irrelevant to the fundamentals of the holy life, and does not lead to revulsion, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbāna.",
    "sn56.41:5": "\"When you reflect, bhikkhus, you should reflect: ‘This is suffering’; you should reflect: ‘This is the origin of suffering’; you should reflect: ‘This is the cessation of suffering’; you should reflect: ‘This is the way leading to the cessation of suffering.’ For what reason? Because, bhikkhus, this reflection is beneficial, relevant to the fundamentals of the holy life, and leads to revulsion, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbāna.",
    "sn56.41:6": "\"Therefore, bhikkhus, an exertion should be made to understand: ‘This is suffering.’ … An exertion should be made to understand: ‘This is the way leading to the cessation of suffering.’\""
}