{
    "sn56.46:1": "\"Bhikkhus, there are world interstices, vacant and abysmal[n.407]Lokantarikā aghā asaṃvutā andhakārakā andhakāratiṁsā.The expression occurs atDN4,MN23andAN4.27.Spkdoes not comment, but Sv, Ps, and Mp to the above consistently explain: \"Between every three spiral world-spheres(cakkavāḷa)there is one world-interstice, like the space between three cart wheels set down so that they touch. That is a ‘world-interstice hell,’ measuring 8,000yojanas(= appx. 80,000 kilometres). It is ‘vacant’(agha), i.e., always open(niccavivaṭa); and ‘abysmal’(asaṁvuta), i.e., without an underlying support, and so dark even eye-consciousness cannot arise.\"regions of blinding darkness and gloom, where the light of the sun and moon, so powerful and mighty, does not reach.\"",
    "sn56.46:2": "When this was said, a certain bhikkhu said to the Blessed One: \"That darkness, venerable sir, is indeed great; that darkness is indeed very great. But is there, venerable sir, any other darkness greater and more frightful than that one?\"",
    "sn56.46:3": "\"But what, venerable sir, is that darkness greater and more frightful than that one?\"",
    "sn56.46:4": "\"But, bhikkhu, those ascetics and brahmins who understand as it really is: ‘This is suffering’ … ‘This is the way leading to the cessation of suffering’—they do not delight in volitional formations that lead to birth, nor in volitional formations that lead to aging, nor in volitional formations that lead to death, nor in volitional formations that lead to sorrow, lamentation, pain, displeasure, and despair. Not delighting in such volitional formations, they do not generate volitional formations that lead to birth, nor generate volitional formations that lead to aging, nor generate volitional formations that lead to death, nor generate volitional formations that lead to sorrow, lamentation, pain, displeasure, and despair. Not having generated such volitional formations, they do not tumble into the darkness of birth, nor tumble into the darkness of aging, nor tumble into the darkness of death, nor tumble into the darkness of sorrow, lamentation, pain, displeasure, and despair. They are freed from birth, aging, and death; freed from sorrow, lamentation, pain, displeasure, and despair; freed from suffering, I say.",
    "sn56.46:5": "\"Therefore, bhikkhus, an exertion should be made to understand: ‘This is suffering.’ … An exertion should be made to understand: ‘This is the way leading to the cessation of suffering.’\""
}