{
    "sn6.14:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī … . There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn6.14:2": "\"Bhikkhus, once in the past there was a king name Aruṇava whose capital was named Aruṇavati. The Blessed One Sikhi, the Arahant, the Perfectly Enlightened One, dwelt in dependence on the capital Aruṇavati.[n.418] Sikhī was the fifth Buddha of antiquity counting back from Gotama. He arose thirty-one aeons ago (seeDN14).The chief pair of disciples of the Blessed One Sikhi were named Abhibhū and Sambhava, an excellent pair. Then the Blessed One Sikhi addressed the bhikkhu Abhibhū: ‘Come, brahmin, let us go to a certain brahma world until it is time for our meal.’ - ‘Yes, venerable sir,’ the bhikkhu Abhibhū replied.",
    "sn6.14:3": "Then the Blessed One Sikhi addressed the bhikkhu Abhibhū thus: ‘Give a Dhamma talk, brahmin, to Brahma and to Brahma's retinue and to Brahma's assembly.’ - ‘Yes, venerable sir,’ the bhikkhu Abhibhū replied. Then, by means of a Dhamma talk, he instructed, exhorted, inspired, and gladdened Brahma and Brahma's retinue and Brahma's assembly. Thereupon Brahma and Brahma's retinue andsn.i.156Brahma's assembly found fault with this, grumbled, and complained about it, saying: ‘It is wonderful indeed, sir! It is amazing indeed, sir! How can a disciple teach the Dhamma in the very presence of the Teacher?’",
    "sn6.14:4": "\"Then, bhikkhus, the Blessed One Sikhi addressed the bhikkhu Abhibhū thus: ‘Brahmin, Brahma and Brahma's retinue and Brahma's assembly deplore this, saying, \"It is wonderful indeed, sir! It is amazing indeed, sir! How can a disciple teach the Dhamma in the very presence of the Teacher?\" Well then, brahmin, stir up an even greater sense of urgency in Brahma and in Brahma's retinue and in Brahma's assembly.’ - ‘Yes, venerable sir,’ the bhikkhu Abhibhū replied. Then he taught the Dhamma with his body visible, and with his body invisible, and with the lower half of his body visible and the upper half invisible, and with the upper half of his body visible and the lower half invisible.[n.19] For a more detailed account of Abhibhū's power of transformation(vikubbana-iddhi)see Paṭis II 210,1–30.Thereupon, bhikkhus, Brahma and Brahma's retinue and Brahma's assembly were struck with wonder and amazement, saying: ‘It is wonderful indeed, sir! It is amazing indeed, sir! How the ascetic has such great power and might!’",
    "sn6.14:5": "\"Then, bhikkhus, the bhikkhu Abhibhū said to the Blessed One Sikhi, the Arahant, the Perfectly Enlightened One: ‘I recall, venerable sir, having made such a statement as this in the midst of the Bhikkhu Saṅgha: \"Friends, while standing in the brahma world I can make my voice heard throughout the thousandfold world system.’\" - ‘Now is the time for that, brahmin! Now is the time for that, brahmin! While standing in the brahma world you should make your voice heard throughout the thousandfold world system.’ - ‘Yes, venerable sir,’ the bhikkhu Abhibhū replied. Then, while standing in the brahma world, he recited these verses:[n.420] This incident is referred to elsewhere by Ānanda, and in response the Buddha describes the structure of the world system (AN I 227-28). There the Buddha claims that he himself is capable of making his voice heard throughout a three-thousand great thousandfold world system.Spk: The elder first asked himself what kind of Dhamma discourse would be pleasing and agreeable to everyone, and he then realized that all devas and humans praise manly effort. Thus he taught a discourse concerning energy (viriya-paṭisamyutta). The two verses are ascribed to an Abhibhūta Thera atTh 26–7; perhaps the similarity of names has resulted from a garbled transmission. See Horner’s trans. of Mil,Milinda’s Questions,2:1, n. , for ascriptions of the first verse in Pāli and Skt Buddhist literature.",
    "sn6.14:6": "v.04\"‘Arouse your energy, strive on!Exert yourself in the Buddha’s Teaching.Sweep away the army of DeathAs an elephant does a hut of reeds.sn.i.157",
    "sn6.14:7": "v.605\"‘One who dwells diligentlyIn this Dhamma and Discipline,Having abandoned the wandering on in birth,Will make an end to suffering.’",
    "sn6.14:8": "\"Then, bhikkhus, having stirred up a sense of urgency in Brahma and in Brahma's retinue and in Brahma's assembly, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, the Blessed One Sikhi, the Arahant, the Perfectly Enlightened One, and the bhikkhu Abhibhū disappeared from that brahma world and reappeared in the capital Aruṇavati. Then the Blessed One Sikhi addressed the bhikkhus thus: ‘Bhikkhus, did you hear the verses that the bhikkhu Abhibhū recited while he was standing in the brahma world?’ — ‘We did, venerable sir.’ — ‘What were the verses that you heard, bhikkhus?’ - ‘We heard the verses of the bhikkhu Abhibhū thus:",
    "sn6.14:9": "v.606\"‘Arouse your energy, strive on!Exert yourself in the Buddha’s Teaching.Sweep away the army of DeathAs an elephant does a hut of reeds.sn.i.157",
    "sn6.14:10": "v.607\"‘One who dwells diligentlyIn this Dhamma and Discipline,Having abandoned the wandering on in birth,Will make an end to suffering.’",
    "sn6.14:11": "Such were the verses that we heard the bhikkhu Abhibhū recite while he was standing in the brahma world.’ - ‘Good, good, bhikkhus! It is good that you heard the verses that the bhikkhu Abhibhū recited while he was standing in the brahma world.’\"",
    "sn6.14:12": "This is what the Blessed One said. Elated, those bhikkhus delighted in the Blessed One's statement."
}