{
    "sn6.2:1": "Thus have I heard.[n.373]Spkassigns this sutta to the fifth week after the enlightenment. The sutta is also atAN4.2with an additional paragraph.On one occasion the Blessed One was dwelling at Uruvela on the bank of the river Nerañjara at the foot of the Goatherd's Banyan Tree just after he had become fully enlightened.sn.i.39Then, while the Blessed One was alone in seclusion, a reflection arose in his mind thus: \"One dwells in suffering if one is without reverence and deference. Now what ascetic or brahmin can I honour and respect and dwell in dependence on?\"",
    "sn6.2:2": "Then it occurred to the Blessed One: \"It would be for the sake of fulfilling an unfulfilled aggregate of virtue that I would honour, respect, and dwell in dependence on another ascetic or brahmin. However, in this world with its devas, Māra, and Brahma, in this generation with its ascetics and brahmins, its devas and humans, I do not see another ascetic or brahmin more perfect in virtue than myself, whom I could honour and respect and dwell in dependence on.",
    "sn6.2:3": "\"It would be for the sake of fulfilling an unfulfilled aggregate of concentration that I would honour, respect, and dwell in dependence on another ascetic or brahmin. However … I do not see another ascetic or brahmin more perfect in concentration than myself … .",
    "sn6.2:4": "\"It would be for the sake of fulfilling an unfulfilled aggregate of wisdom that I would honour, respect, and dwell in dependence on another ascetic or brahmin. However … I do not see another ascetic or brahmin more perfect in wisdom than myself … .",
    "sn6.2:5": "\"It would be for the sake of fulfilling an unfulfilled aggregate of liberation that I would honour, respect, and dwell in dependence on another ascetic or brahmin. However … I do not see another ascetic or brahmin more perfect in liberation than myself … .",
    "sn6.2:6": "\"It would be for the sake of fulfilling an unfulfilled aggregate of the knowledge and vision of liberation that I would honour, respect, and dwell in dependence on another ascetic or brahmin. However … I do not see another ascetic or brahmin more perfect in the knowledge and vision of liberation than myself, whom I could honour and respect, and on whom I could dwell in dependence.[n.374]Spk: The first four qualities—virtue, etc.—are both mundane and supramundane. The knowledge and vision of liberation is mundane only, for this is reviewing knowledge(paccavekkhaṇañāṇa).",
    "sn6.2:7": "Then, having known with his own mind the reflection in the Blessed One's mind, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, Brahma Sahampati disappeared from the brahma world and reappeared before the Blessed One. He arranged his upper robe over one shoulder, raised his joined hands in reverential salutation towards the Blessed One, and said to him:sn.i.140\"So it is, Blessed One! So it is, Fortunate One! Venerable sir, those who were the Arahants, the Perfectly Enlightened Ones in the past—those Blessed Ones too honoured, respected, and dwelt in dependence just on the Dhamma itself. Those who will be the Arahants, the Perfectly Enlightened Ones in the future—those Blessed Ones too will honour, respect, and dwell in dependence just on the Dhamma itself. Let the Blessed One too, who is at present the Arahant, the Perfectly Enlightened One, honour, respect, and dwell in dependence just on the Dhamma itself.\"",
    "sn6.2:8": "v.562\"The Buddhas of the past,The future Buddhas,And he who is the Buddha now,Removing the sorrow of many—",
    "sn6.2:9": "v.563\"All have dwelt, will dwell, and dwell,Deeply revering the true Dhamma:For the BuddhasThis is a natural law.",
    "sn6.2:10": "v.564\"Therefore one desiring his own good,Aspiring for spiritual greatness,Should deeply revere the true Dhamma,Recollecting the Buddhas’ Teaching.\"[n.375] in pāda a,Seand Ee1 readatthakamena,also atAN II 21,23, as against Be and Ee2attakamena,also atAN4.21. Spk glossesabhikaṅkhatain pāda c aspatthayamanena. Saramin pāda d is probably a truncated instrumental, glossed by Spk assarantena;Norman, however, suggests it could be aṇamulabsolutive."
}