{
    "sn6.15:1": "On one occasion the Blessed One was dwelling at Kusinārāā in Upavattana, the sal tree grove of the Mallans, between the twin sal trees, on the occasion of his final Nibbāna.[n.42] This sutta corresponds to the portion of the Mahaparinibbāna Sutta that reports the actual passing away of the Buddha (DN II 56,–57,9). A few discrepancies between the two versions are noticeable. The omission of the attainment of cessation of perception and feeling, noted by C.Rh.D, seems to be peculiar to Ee; the passage is in Be, Se, and Ee2 as well as in the lemma ofSpk. All four eds., however, omit Ānanda's assertion that the Blessed One (while still in cessation) has attained parinibbāna and Anuruddha's correction. The SN version also omits the earthquake and thundering, mentioned atDN II 56,35–37.Then the Blessed One addressed the bhikkhus thus: \"Nowsn.i.58I address you, bhikkhus: Formations are bound to vanish. Strive to attain the goal by diligence.\" This was the last utterance of the Tathāgata.",
    "sn6.15:2": "Then the Blessed One attained the first jhāna. Having emerged from the first jhāna, he attained the second jhāna. Having emerged from the second jhāna, he attained the third jhāna. Having emerged from the third jhāna, he attained the fourth jhāna. Having emerged from the fourth jhāna, he attained the base of the infinity of space. Having emerged from the base of the infinity of space, he attained the base of the infinity of consciousness. Having emerged from the base of the infinity of consciousness, he attained the base of nothingness. Having emerged from the base of nothingness, he attained the base of neither-perception-nor-nonperception. Having emerged from the base of neither-perception-nor-nonperception, he attained the cessation of perception and feeling.",
    "sn6.15:3": "Having emerged from the cessation of perception and feeling, he attained the base of neither-perception-nor-nonperception. Having emerged from the base of neither-perception-nor-nonperception, he attained the base of nothingness. Having emerged from the base of nothingness, he attained the base of the infinity of consciousness. Having emerged from the base of the infinity of consciousness, he attained the base of the infinity of space. Having emerged from the base of the infinity of space, he attained the fourth jhāna. Having emerged from the fourth jhāna, he attained the third jhāna. Having emerged from the third jhāna, he attained the second jhāna. Having emerged from the second jhāna, he attained the first jhāna.",
    "sn6.15:4": "v.608\"All beings in the worldWill finally lay the body down,Since such a one as the Teacher,The peerless person in the world,The Tathāgata endowed with the powers,The Buddha, has attained final Nibbāna.\"[n.23] On Brahma Sahampati, see n.367. The powers(bala)are the ten Tathāgata's powers, enumerated atMN I 69–71.",
    "sn6.15:5": "When the Blessed One attained final Nibbāna, simultaneously with his final Nibbāna Sakka, lord of the devas, recited this verse:",
    "sn6.15:6": "v.09\"Impermanent indeed are formations;Their nature is to arise and vanish.Having arisen, they cease:Their appeasement is blissful.\"[n.424] At v.21, we have the same verse with a readingsabbasaṅkhārāin place ofvata saṅkhārāin pāda a. See n.20.",
    "sn6.15:7": "When the Blessed One attained final Nibbāna, simultaneously with his final Nibbāna the Venerable Ānanda recited this verse:[n.425] In the DN version Anuruddha’s verses precede Ānanda’s.",
    "sn6.15:8": "v.610\"Then there was terror,Then there was trepidation,When the one perfect in all excellent qualities,The Buddha, attained final Nibbāna.\"sn.i.159",
    "sn6.15:9": "When the Blessed One attained final Nibbāna, simultaneously with his final Nibbāna the Venerable Anuruddha recited these verses:",
    "sn6.15:10": "v.611\"There was no more in-and-out breathingIn the Stable One of steady mindWhen unstirred, bent on peace,The One with Vision attained final Nibbāna.[n.426] VĀT remarks: \"The absence of in-and-out breathing (in pāda a) refers to the state in the fourth jhāna, where breathing ceases, from which the Buddha passed away. This is not the ordinary cessation of breathing that sets in when anyone dies. The verse states something remarkable: that already before ‘dying’ there was no breathing.\" On \"the Stable One\"(tadi), see below n.435. On the ceasing of the breath in the fourth jhāna, seeSN36.11(IV 217,8–9).Spk: Bent on peace(santim arabbha): bent upon, depending upon, leaning towards Nibbāna without residue. The One with Vision—he with the five eyes—attained final Nibbāna through the full quenching of the aggregates(khandhaparinibbāna). On the five eyes, see n.370; on the two kinds of parinibbāna, see General Introduction, p. 50. AtDN II 157,13this pāda reads:yaṁ kalam akari muni;\"when the Sage passed away.\"",
    "sn6.15:11": "v.612\"With unshrinking mindHe endured the pain;Like the quenching of a lampWas the deliverance of the mind.\"[n.427] Pādas cd read:Pajjotasseva nibbānaṁ/Vimokkho cetaso ahū.The word nibbana is used here in its literal sense but with doctrinal overtones that fit the context.Spk: His deliverance, not obstructed by anything, his approaching the completely indescribable state(sabbaso apaññattibhāvūpagamo), resembled the quenching of a lamp. Anuruddha's verses on the Buddha’s parinibbāna in Th include an additional verse,Th 907.sn.i.160"
}