{
    "sn6.10:1": "At Sāvatthī.[n.407] This sutta is also atSn III, 0 (pp. 23–3),with the name spelt Kokaliya. The prose portions are identical, butSn 66–78gives detailed descriptions of the torments in hell not included here.AN V 70–74combinesSN6.9andSN6.0. The background to Kokalika's animosity towards the two chief disciples is related in the prologue to Ja No. 480; see too Dhp-a IV 90–93; BL 3:247–49.Then the bhikkhu Kokalika approached the Blessed One,sn.i.50paid homage to him, sat down to one side, and said: \"Venerable sir, Sāriputta and Moggallana have evil wishes; they have come under the control of evil wishes.\"",
    "sn6.10:2": "Then the bhikkhu Kokalika rose from his seat, paid homage to the Blessed One, and departed, keeping him on his right. Not long after the bhikkhu Kokalika had left, his entire body became covered with boils the size of mustard seeds. These then grew to the size of mung beans; then to the size of chickpeas; then to the size of jujube stones; then to the size of jujube fruits; then to the size of myrobalans; then to the size of unripe beluva fruits; then to the size of ripe beluva fruits. When they had grown to the size of ripe beluva fruits, they burst open, exuding pus and blood. Then, on account of that illness, the bhikkhu Kokalika died,sn.i.151and because he had harboured animosity towards Sāriputta and Moggallana, after his death he was reborn in the Paduma hell.[n.408]Spk: The Paduma hell is not a separate hell realm but a particular place in the great Avīci hell where the duration of the torment is measured bypadumaunits. The same applies to the Abbuda hell, etc., mentioned below.",
    "sn6.10:3": "Then, when the night had advanced, Brahma Sahampati, of stunning beauty, illuminating the entire Jeta's Grove, approached the Blessed One, paid homage to him, stood to one side, and said to him: \"Venerable sir, the bhikkhu Kokalika has died, and because he harboured animosity towards Sāriputta and Moggallana, after his death he has been reborn in the Paduma hell.\" This is what Brahma Sahampati said. Having said this, he paid homage to the Blessed One and, keeping him on his right, he disappeared right there.",
    "sn6.10:4": "Then, when the night had passed, the Blessed One addressed the bhikkhus thus: \"Bhikkhus, last night, when the night had advanced, Brahma Sahampati approached me and said to me: …as above… Having said this, he paid homage to me and, keeping me on his right, he disappeared right there.\"",
    "sn6.10:5": "When this was said, a certain bhikkhu said to the Blessed One: \"Venerable sir, how long is the life span in the Paduma hell?\"",
    "sn6.10:6": "\"It is possible, bhikkhu. Suppose, bhikkhu, there was a Kosalan cartload of twenty measures of sesamum seed. At the end of every hundred years a man would remove one seed from there. That Kosalan cartload of twenty measures of sesamum seed might by this effort be depleted and eliminated more quickly than a single Abbuda hell would go by. Twenty Abbuda hells are the equivalent of one Nirabbuda hell; twenty Nirabbuda hells are the equivalent of one Ababa hell; twenty Ababa hells are the equivalent of one Aṭaṭa hell; twenty Aṭaṭa hells are the equivalent of one Ahaha hell; twenty Ahaha hells are the equivalent of one Kumuda hell; twenty Kumuda hells are the equivalent of one Sogandhika hell; twenty Sogandhika hells are the equivalent of one Uppala hell; twenty Uppala hells are the equivalent of one Puṇḍarika hell; and twenty Puṇḍarika hells are the equivalent of one Paduma hell. Now, bhikkhu, the bhikkhu Kokalika has been reborn in the Paduma hell because he harboured animosity towards Sāriputta and Moggallana.\"[n.409]Spkexplains the scale for measuring time as follows: onekoṭi= ten million years; akoṭiofkoṭis= onepakoṭi;a koṭi ofpakoṭis= onekoṭipakoṭi;a koṭi ofkoṭipakoṭis= onenahuta;a koṭi ofnahutas= oneninnahuta;a koṭi ofninnahutas= oneabbuda;twentyabbudas= onenirabbuda.",
    "sn6.10:7": "v.592\"When a person has taken birthAn axe is born inside his mouthWith which the fool cuts himselfUttering defamatory speech.",
    "sn6.10:8": "v.593\"He who praises one deserving blame,Or blames one deserving praise,Casts with his mouth an unlucky throwBy which he finds no happiness.[n.410a] In have translated the previous verse a little freely in order to make more apparent the connection with the next verse. Literally it should be rendered: \"The fool collects a disaster with his mouth.\" Kali means both the losing throw at dice and a disaster.",
    "sn6.10:9": "v.54\"Trifling is the unlucky throwThat brings the loss of wealth at dice,The lossof all, oneself included;Worse by far—this unlucky throwOf harbouring hate against the fortunate ones.[n.411a]Spkparaphrases pādas a-c: \"This misfortune is trifling, that is, the loss of wealth at dice along with all that one owns too, including oneself.\" Spk glosses sugatesu, \"fortunate ones,\" in pāda e as sammaggatesu puggalesu, \"persons who have rightly attained\"; thus here the term refers more widely to all arahants, not only to the Buddha. The verse is also at Uv 8:4, minus pāda c (which Norman considers a later addition), and atP-Dhp301, which includes pāda c but with saddhammam pi in place of SN's sabbassa pi. For a theory regarding the historical evolution of the verse, seeGD, p. 268, n. to 65.",
    "sn6.10:10": "v.595\"For a hundred thousand nirabbudasAnd thirty-six more, and five abbudas,The maligner of noble ones goes to hell,Having set evil speech and mind against them.\""
}