{
    "sn6.3:1": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion a certain brahmin lady had a son named Brahmadeva who had gone forth from the household life into homelessness under the Blessed One.",
    "sn6.3:2": "Then, dwelling alone, withdrawn, diligent, ardent, and resolute, the Venerable Brahmadeva, by realizing it for himself with direct knowledge, in this very life entered and dwelt in that unsurpassed goal of the holy life for the sake of which clansmen rightly go forth from the household life into homelessness. He directly knew: \"Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no more for this state of being.\" And the Venerable Brahmadeva became one of the arahants.[n.376] This is the stock canonical description of the attainment of arahantship. The sentence beginning \"He directly knew,\" according toSpk, shows \"the plane of reviewing\"(paccavekkhaṇabhūmi).The commentaries propose two ways of interpretingnaparam itthattaya,depending on whether the last word is taken as dative or ablative. Spk: \"Now there is no development of the path again done ‘for this state’ (itthabhavaya = itthattayaas dative), that is, for the state of the sixteen tasks or for the destruction of the defilements. (The ‘sixteen tasks’ are the four tasks of the path—full understanding, abandonment, realization, and development (as atSN56.11; V 4,3–30)—taken in conjunction with each of the four supramundane paths.) Or alternatively:itthattaya = itthabhavato(the ablative, ‘beyond thisness’). Now there is no further continuum of aggregates beyond this present continuum of aggregates. These five aggregates stand fully understood like a tree cut down at the root.\"I takeitthattayaas a dative meaning \"for this state of being,\" i.e., for existence in any state of being, so that the phrase conveys the same sense as the alternative \"roar of liberation,\"natthi dani punabbhavo,\"Now there is no renewed existence\" (seeSN.7— III 9,30, etc.). Elsewhere (e.g., atDN I 17,33;MN II 130,16 foll.;AN I 63,30–64,18)itthattasignifies the human state (or perhaps the entire sensory realm) as contrasted with higher states of being. As the stem formitthattais clearly neuter, it is difficult to accept the commentarial explanation ofitthattayaas an ablative.",
    "sn6.3:3": "Then, in the morning, the Venerable Brahmadeva dressed and, taking bowl and robe, entered Sāvatthī for alms. Walking on continuous alms round in Sāvatthī, he came to his own mother's residence.[n.77] Walking on continuous alms round(sapadanam piṇḍaya caramano)is the ascetic practice of going for alms to each house along the route, without discriminating between those who regularly give and those who do not; see Vism 60,19–24 (Ppn 2:6), 67–68 (Ppn 2:1).sn.i.141Now on that occasion the brahmin lady, the Venerable Brahmadeva's mother, had been offering a constant oblation to Brahma.[n.78] Ahutim niccam paggaṇhati. From the detailed description inSpk, this seems to have been an elaborate ceremony in which sweetened milk-rice was offered to Brahma with accompanying invocations.Then it occurred to Brahma Sahampati: \"This brahmin lady, the Venerable Brahmadeva's mother, has been offering a constant oblation to Brahma. Let me approach her and stir up a sense of urgency in her.\"",
    "sn6.3:4": "v.565\"Far from here, madam, is the brahma worldTo which you offer a constant oblation.Brahma does not eat such food, lady:So why mumble, not knowing the path to Brahma?[n.379]Spk: \"The path to Brahma(brahmapatha)is a name for the four wholesome jhānas; the resultant jhānas are called their path of living(jīvitapatha). Ignorant of this path, why do you mumble and mutter? For the brahmas subsist on the rapturous jhānas; they do not eat curdled milk flavoured with herbs and seeds.\" Usually the four brahmavihāras are called the path to the company of Brahma, as atDN I 250,32–251,21andMN II 207,1–208,8.",
    "sn6.3:5": "v.66\"This Brahmadeva, madam,Without acquisitions, has surpassed the devas.Owning nothing, nourishing no other,The bhikkhu has entered your house for alms.[n.380]Spkexplains nirūpadhika in pāda b as one devoid of the upadhi of defilements, volitional formations, and sensual pleasures. Spk-pṭ: The upadhi of the aggregates is not mentioned because the aggregates still exist. Has surpassed the devas(atidevapatto). Spk: He has attained the state of a deva beyond the devas, the state of a brahma beyond the brahmas. (There is an evident pun here on the bhikkhu's name.) Onakiñcana,\"owning nothing,\" see n.73. Nourishing no other(anaññaposi). Spk: This is said because he does not maintain a wife and children, or because he will not maintain another body after the present one.",
    "sn6.3:6": "v.57\"Gift-worthy, knowledge-master, inwardly developed,He deserves offerings from humans and devas.Having expelled all evil, unsullied,Cooled at heart, he comes seeking alms.",
    "sn6.3:7": "v.568\"For him there is nothing behind or in front—Peaceful, smokeless, untroubled, wishless;He has laid down the rod towards frail and firm:Let him eat your oblation, the choicest alms.[n.381]Spk: What is behind(paccha)is the past, what is in front(purattham)is the future. He has nothing behind or in front because he is devoid of desire and lust for past and future aggregates. He is smokeless(vidhūmo)with the vanishing of the smoke of anger. On the \"front-behind\" dichotomy, seeDhp 348,421;Sn 949;Th 53.",
    "sn6.3:8": "v.569\"Aloof from the crowd, with peaceful mind,Like a nāga he fares, tamed, unstirred.A bhikkhu of pure virtue, well liberated in mind:Let him eat your oblation, the choicest alms.[n.32]Spkexplains visenibhūto in pāda a as \"disarmed, without the army of defilements\"(kilesasenaya viseno jato). Here, however, I follow Norman's suggestion (at GD, pp. 307–, n. to 793) thatvisenicorresponds to BHS viśreṇi, meaning \"without association.\" At Uv 11:12, we findviseṇikṛtva(translated into Tibetan by an expression meaning \"free from the crowd\").",
    "sn6.3:9": "v.570\"With confidence in him, free from wavering,sn.i.142Present your offering to one who deserves it.Having seen a sage who has crossed the flood,O madam, make merit leading to future bliss.\"[n.383] Onoghatiṇṇamsee n.2.",
    "sn6.3:10": "v.571With confidence in him, free from wavering,She presented her offering to one who deserved it.Having seen a sage who has crossed the flood,The lady made merit leading to future bliss.[n.384]Spk: This verse was added by the redactors."
}