{
    "sn6.1:1": "Thus have I heard.[n.362] The incident is also recorded at Vin I 4–7 andMN I 67–69, and atDN II 36–40with the Buddha Vipassī and Mahābrahmā as the speakers.Spkassigns the incident to the eighth week after the enlightenment. A BHS parallel at Mvu III 34–9, considerably more ornate, records several variant traditions of the encounter, more or less corresponding with the Pali version; see Jones, 3:302–9.On one occasion the Blessed One was dwelling at Uruvela on the bank of the river Nerañjara at the foot of the Goatherd's Banyan Tree just after he had become fully enlightened. Then, while the Blessed One was alone in seclusion, a reflection arose in his mind thus: \"This Dhamma that I have discovered is deep, hard to see, hard to understand, peaceful and sublime, not within the sphere of reasoning, subtle, to be experienced by the wise. But this generation delights in adhesion, takes delight in adhesion, rejoices in adhesion.[n.363] Spk explainsalayaobjectively as the five cords of sensual pleasure, called \"adhesions\" because it is these to which beings adhere; and again, subjectively, as the 08 mental examinations driven by craving(taṇhavicaritani;seeAN II 22,8–23,2), since it is these that adhere to their objects.For such a generation this state is hard to see, that is, specific conditionality, dependent origination. And this state too is hard to see, that is, the stilling of all formations, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna.[n.364] Spk: All these terms are synonyms for Nibbāna. For contingent upon that(tam āgamma), all the vacillations of formations become still and calm down; all acquisitions are relinquished; all cravings are destroyed; all lustful defilements fade away; and all suffering ceases.Spk-pṭ:Contingent upon that: in dependence upon that, because it is the object condition for the noble path.If I were to teach the Dhamma and if others would not understand me, that would be wearisome for me, that would be troublesome.\"",
    "sn6.1:2": "v.556\"Enough now with trying to teachWhat I found with so much hardship;This Dhamma is not easily understoodBy those oppressed by lust and hate.",
    "sn6.1:3": "v.557\"Those fired by lust, obscured by darkness,Will never see this abstruse Dhamma,Deep, hard to see, subtle,Going against the stream.\"sn.i.17",
    "sn6.1:4": "As the Blessed One reflected thus, his mind inclined to living at ease, not to teaching the Dhamma.[n.366]Spk: Living at ease (appossukkata,lit. \"little zeal\") means lack of desire to teach. But why did his mind so incline after he had made the aspiration to Buddhahood, fulfilled the perfections, and attained omniscience? Because as he reflected, the density of the defilements of beings and the profundity of the Dhamma became manifest to him. Also, he knew that if he inclined to living at ease, Brahma would request him to teach, and since beings esteem Brahma, this would instill in them a desire to hear the Dhamma. Onussukka,see n.5.",
    "sn6.1:5": "Then Brahma Sahampati, having known with his own mind the reflection in the Blessed One's mind, thought: \"Alas, the world is lost! Alas, the world is to perish, in that the mind of the Tathāgata, the Arahant, the Perfectly Enlightened One, inclines to living at ease, not to teaching the Dhamma.\"[n.367] Brahma Sahampati appears in dramatic roles at key points in the Buddha’s ministry and also utters the first verse at his parinibbāna (v.608below). SeeSN48.7for his own account of how he become a prominent deity in the brahma world. His other appearances in SN are at:SN6.2,3,10,12,13;SN11.17;SN22.80;SN47.18,43. In the Mvu version the deity who arrives is referred to simply as Mahābrahmā, without a personal name. He comes accompanied by many other gods including Sakka.In this chapter(and elsewhere in this translation), I use \"Brahma\" when the word is part of a proper name and \"brahma\" when it refers more generally to a being or class of beings. Sometimes there is no hard and fast boundary between the two.Then, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, Brahma Sahampati disappeared from the brahma world and reappeared before the Blessed One. He arranged his upper robe over one shoulder, knelt down with his right knee on the ground, raised his joined hands in reverential salutation towards the Blessed One, and said to him: \"Venerable sir, let the Blessed One teach the Dhamma; let the Fortunate One teach the Dhamma. There are beings with little dust in their eyes who are falling away because they do not hear the Dhamma. There will be those who will understand the Dhamma.\"",
    "sn6.1:6": "v.558\"In the past there appeared among the MagadhansAn impure Dhamma devised by those still stained.Throw open this door to the Deathless! Let them hearThe Dhamma that the Stainless One discovered.[n.38]Spkidentifies the door to the Deathless(amatassa dvara)with the noble path, \"the door to the deathless Nibbāna.\" Although the text here uses the singulardvara,just below it has the pluraldvara.",
    "sn6.1:7": "v.559\"Just as one standing on a mountain peakMight see below the people all around,So, O wise one, universal eye,Ascend the palace made of the Dhamma.Being yourself free from sorrow, behold the peopleSubmerged in sorrow, oppressed by birth and decay.",
    "sn6.1:8": "v.560\"Rise up, O hero, victor in battle!O caravan leader, debt-free one, wander in the world.Teach the Dhamma, O Blessed One:There will be those who will understand.\"[n.369] I translate pāda c in accordance with the reading inBe,Se, and Ee2,desassu bhagava dhammam,found consistently in the Sinhalese texts. Ee1desetu(found also in the DN and Vin parallels)seems to be a normalization influenced by the preceding prose passage. The verse is recited again by Brahma Sahampati at v.919.The Buddha is called the \"unsurpassed caravan leader\" at v.736b; see n.517.sn.i.13",
    "sn6.1:9": "Then the Blessed One, having understood Brahma's request, out of compassion for beings surveyed the world with the eye of a Buddha.[n.370]Spk: The eye of a Buddha(buddhacakkhu)is a name for the knowledge of the degrees of maturity in the faculties of beings(indriyaparopariyattañāṇa)and the knowledge of the dispositions and underlying tendencies of beings(asayanusayañāṇa). The knowledge of omniscience is called the universal eye (samantacakkhu,at v.55d). The knowledge of the three lower paths is called the Dhamma eye (or \"vision of Dhamma,\"dhammacakkhu). Together with the divine eye (dibbacakkhu:seeSN6.5,12:70) and the fleshly eye(mamsacakkhu), these make up the \"five eyes\" of a Buddha.As he did so, the Blessed One saw beings with little dust in their eyes and with much dust in their eyes, with keen faculties and with dull faculties, with good qualities and with bad qualities, easy to teach and difficult to teach, and a few who dwelt seeing blame and fear in the other world.[n.371]Paralokavajjabhayadassavino.At MLDB, p. 261, the ambiguous compound is rendered \"seeing fear in blame and in the other world.\" This agrees well enough with the commentaries, which resolve it:paralokañ c’ eva vajjañ ca bhaya-to passanti.AtDhp 317–18, however,bhayaandvajjaare treated as parallel terms, which suggests that the compound should be resolved:paraloke vajjañ c’ eva bhayañ ca passanti.Just as in a pond of blue or red or white lotuses, some lotuses might be born in the water, grow up in the water, and thrive while submerged in the water, without rising up from the water; some lotuses might be born in the water, grow up in the water, and stand at an even level with the water; some lotuses might be born in the water and grow up in the water, but would rise up from the water and stand without being soiled by the water—so too, surveying the world with the eye of a Buddha, the Blessed One saw beings with little dust in their eyes and with much dust in their eyes, with keen faculties and with dull faculties, with good qualities and with bad qualities, easy to teach and hard to teach, and a few who dwelt seeing blame and fear in the other world.",
    "sn6.1:10": "v.561\"Open to them are the doors to the Deathless:Let those who have ears release faith.Foreseeing trouble, O Brahma, I did not speakThe refined, sublime Dhamma among human beings.\"",
    "sn6.1:11": "Then Brahma Sahampati, thinking, \"The Blessed One has given his consentto my requestregarding the teaching of the Dhamma,\" paid homage to the Blessed One and disappeared right there.[n.372]Katavakaso kho ’mhi bhagavata dhammadesanaya.Ee1bhagavatohere must be an error. At MLDB, p. 262, in accordance with prevalent practice this phrase was rendered, \"I have created the opportunity for the Blessed One to teach the Dhamma.\" CPD(s.v.katavakasa)remarks that this construal \"is both grammatically impossible and contextually unlikely.\" The rendering here, based on a suggestion of VĀT, uses the active voice in place of an awkward passive construction imitative of the Pali."
}