{
    "sn6.9:1": "At Sāvatthī. Now on that occasion the bhikkhu Kokalika was sick, afflicted, gravely ill Then, when the night had advanced, the independent brahma Tudu, of stunning beauty, advanced, the independent brahma Tudu, of stunning beauty, illuminating the entire Jeta's Grove, approached the bhikkhu Kokalika.[n.402] In Be the deity's name is Turu.Spkexplains that in his previous birth he had been Kokalika's preceptor; he passed away as a nonreturner and had been reborn in the brahma world. He heard about Kokalika's attempt to malign Sāriputta and Moggallana and came to advise him to abandon this misguided behaviour.Having approached, he stood in the air and said to the bhikkhu Kokalika : \"Place confidence in Sāriputta and Moggallana, Kokalika. Sāriputta and Moggallana are well behaved.\"",
    "sn6.9:2": "v.588\"When a person has taken birthAn axe is born inside his mouthWith which the fool cuts himselfUttering defamatory speech.",
    "sn6.9:3": "v.589\"He who praises one deserving blame,Or blames one deserving praise,Casts with his mouth an unlucky throwBy which he finds no happiness.[n.404] In v.589I have translated pāda c a little freely in order to make more apparent the connection with v. 590. Literally it should be rendered: \"The fool collects a disaster with his mouth.\" Kali means both the losing throw at dice and a disaster.",
    "sn6.9:4": "v.590\"Trifling is the unlucky throwThat brings the loss of wealth at dice,The lossof all, oneself included;Worse by far—this unlucky throwOf harbouring hate against the fortunate ones.[n.05]Spkparaphrases pādas a-c: \"This misfortune is trifling, that is, the loss of wealth at dice along with all that one owns too, including oneself.\" Spk glosses sugatesu, \"fortunate ones,\" in pāda e assammaggatesu puggalesu,\"persons who have rightly attained\"; thus here the term refers more widely to all arahants, not only to the Buddha. The verse is also at Uv 8:, minus pāda c (which Norman considers a later addition), and at P-Dhp 301, which includes pāda c but with saddhammam pi in place of SN's sabbassa pi. For a theory regarding the historical evolution of the verse, see GD, p. 268, n. to 659.",
    "sn6.9:5": "v.91\"For a hundred thousand nirabbudasAnd thirty-six more, and five abbudas,The maligner of noble ones goes to hell,Having set evil speech and mind against them.\""
}