{
    "sn6.6:1": "At Sāvatthī. Now on that occasion the Blessed One had gone for his day's abiding and was in seclusion. Then the independent brahmas Subrahma and suddhāvasā approached the Blessed One and stood one at each doorpost.[n.396]Spk-pṭ: Apaccekabrahmais a brahma who moves about alone, without a retinue. Spk: They stood outside the door like sentries.Then the independent brahma Subrahma said to the independent brahma suddhāvasā: \"It is not the right time, dear sir, to visit the Blessed One. The Blessed One has gone for his day's abiding and is in seclusion. Such and such a brahma world is rich and prosperous, and the brahma there is dwelling in negligence. Come, dear sir, let us go to that brahma world and stir up a sense of urgency in that brahma.\"sn.i.47",
    "sn6.6:2": "Then, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, the independent brahmas Subrahma and suddhāvasā disappeared in front of the Blessed One and reappeared in that brahma world. That brahma saw those brahmas coming in the distance and said to them: \"Now where are you coming from, dear sirs?\"",
    "sn6.6:3": "When this was said, that brahma refused to accept their advice. Having created a thousand transformations of himself, he said to the independent brahma Subrahma: \"Do you see, dear sir, how much power and might I have?\"",
    "sn6.6:4": "Then the independent brahma Subrahma, having created two thousand transformations of himself, said to that brahma: \"Do you see, dear sir, how much power and might I have?\"",
    "sn6.6:5": "v.84\"Threehundredsupaṇṇas, fourhundredgeese,And five hundred falcons:This palace, O Brahma, of the meditator shinesIlluminating the northern quarter.\"[n.397]Spksays thatsatain pāda b should also be connected withtayoandcaturoin pāda a; the numbers can be interpreted by way of either individual figures(rūpa)or rows(panti). The supaṇṇa is identical with the garuḍa, the giant eagle of Indian mythology; seeSN30.1. Spk explains byagghinisa as beasts similar to tigers(byagghasadisa), but the word occurs at Ja VI 38,9 in a list of birds; it is there glossed as sena, a hawk or falcon. It seems that all these figures are illusory creations of the brahma's meditative power. Spk: \"He shows, ‘This is the splendour of the palace belonging to me, the meditator.’\"",
    "sn6.6:6": "v.585\"Even though that palace of yours shinesIlluminating the northern quarter,Having seen form's flaw, its chronic trembling,The wise one takes no delight in form.\"[n.398] Pada c reads: rūpe raṇam disva sada pavedhitam.Spk: Having seen form's flaw—the fault(dosa)consisting in birth, aging, and dissolution; having seen its chronic trembling—that form is always trembling, shaken, stricken by cold, etc. The wise one is the Teacher (the Buddha). While the deity is proud of the forms—the figures that ornament his palace—Subrahma reproves him by taking up \"form\" in its technical sense, as the first of the five aggregates, and then exposing its dangers.",
    "sn6.6:7": "Then the independent brahmas Subrahma and suddhāvasā, having stirred up a sense of urgency in that brahma, disappeared right there. And on a later occasion that brahma went to attend upon the Blessed One, the Arahant, the Perfectly Enlightened One."
}