{
    "sn6.5:1": "At Sāvatthī. Now on that occasion the following evil speculative view had arisen in a certain brahma: \"There is no ascetic or brahmin who can come here.\" Then, having known with his own mind the reflection in that brahma's mind, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, the Blessed One disappeared from Jeta's Grove and reappeared in that brahma world. The Blessed One sat cross-legged in the air above that brahma, having entered into meditation on the fire element.[n.392]Spk: He did the preparatory work on the fire-kasiṇa, emerged from the basic jhāna, and made a determination: \"Let flames come forth from my body.\" By the power of his determination, flames came out from his entire body.",
    "sn6.5:2": "Then it occurred to the Venerable Mahāmoggallāna: \"Where now is the Blessed One dwelling at present?\" With the divine eye, which is purified and surpasses the human, the Venerable Mahāmoggallāna saw the Blessed One sitting cross-legged in the air above that brahma, having entered into meditation on the fire element. Having seen this, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, the Venerable Mahāmoggallāna disappeared from Jeta's Grove and reappeared in that brahma world. Then the Venerable Mahāmoggallāna stationed himself in the eastern quarter and sat cross-legged in the air above that brahma—though lower than the Blessed One—having entered into meditation on the fire element.",
    "sn6.5:3": "Then it occurred to the Venerable Mahākassapa: \"Where now is the Blessed One dwelling at present?\" With the divine eye … the Venerable Mahākassapa saw the Blessed One sitting cross-legged in the air above that brahma … . Having seen this, …sn.i.145the Venerable Mahākassapa disappeared from Jeta's Grove and reappeared in that brahma world. Then the Venerable Mahākassapa stationed himself in the southern quarter and sat cross-legged in the air above that brahma—though lower than the Blessed One—having entered into meditation on the fire element.",
    "sn6.5:4": "Then it occurred to the Venerable Mahakappina: \"Where now is the Blessed One dwelling at present?\" With the divine eye … the Venerable Mahakappina saw the Blessed One sitting cross-legged in the air above that brahma … . Having seen this, … the Venerable Mahakappina disappeared from Jeta's Grove and reappeared in that brahma world. Then the Venerable Mahakappina stationed himself in the western quarter and sat cross-legged in the air above that brahma—though lower than the Blessed One—having entered into meditation on the fire element.",
    "sn6.5:5": "Then it occurred to the Venerable Anuruddha: \"Where now is the Blessed One dwelling at present?\" With the divine eye … the Venerable Anuruddha saw the Blessed One sitting cross-legged in the air above that brahma … . Having seen this, … the Venerable Anuruddha disappeared from Jeta's Grove and reappeared in that brahma world. Then the Venerable Anuruddha stationed himself in the northern quarter and sat cross-legged in the air above that brahma—though lower than the Blessed One—having entered into meditation on the fire element.",
    "sn6.5:6": "Then the Venerable Mahāmoggallāna addressed that brahma in verse:",
    "sn6.5:7": "v.580\"Today, friend, do you still hold that view,The view that you formerly held?Do you see the radianceSurpassing that in the brahma world?\"[n.393] I translate pādas cd in accordance withSpk's paraphrase: \"Do you see the radiance, the aura, of the Buddha, the Blessed One, surpassing the other auras of the brahma's bodies, mansions, and ornaments in this brahma world?\"",
    "sn6.5:8": "v.51\"I no longer hold that view, dear sir,The view that I formerly held.Indeed I see the radianceSurpassing that in the brahma world.Today how could I maintain,‘I am permanent and eternal’?\"[n.394] According toSpk, this brahma had held two views: first, the view that no ascetics could come to his world; and second, an eternalist view. The first was abandoned when he saw the Buddha and his disciples arrive in his realm. Thereafter the Buddha gave him a discourse at the conclusion of which he was established in the fruit of stream-entry, and thus, through the path of stream-entry, he abandoned his eternalist view.",
    "sn6.5:9": "Then, having stirred up a sense of urgency in that brahma, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, the Blessed One disappeared from that brahma world and reappeared in Jeta's Grove.",
    "sn6.5:10": "v.582\"Many are the disciples of the BuddhaWho are arahants with taints destroyed,Triple-knowledge bearers with spiritual powers,Skilled in the course of others’ minds.\"[n.395] The three knowledges implied by \"triple-knowledge bearers\"(tevijja)are: the knowledge of the recollection of past abodes, the divine eye (also called the knowledge of the passing away and rebirth of beings), and the knowledge of the destruction of the taints. Together with spiritual powers(iddhi)and the capacity for reading others’ minds, these make five of the six abhiññās or direct knowledges.Spksays that the sixth, the divine ear, is also implied.",
    "sn6.5:11": "Then that member of Brahma's assembly, having delighted and rejoiced in the Venerable Mahāmoggallāna's statement, approached that brahma and told him: \"Dear sir, the Venerable Mahāmoggallāna speaks thus:",
    "sn6.5:12": "v.583\"‘Many are the disciples of the Buddha …Skilled in the course of others’ minds.’\""
}