{
    "sn6.4:1": "Thus have I heard.[n.385] The prose opening of this sutta is identical with that ofMN No. 49, except that the latter is set at Ukkaṭṭha. The episode and verses make up the Brahma Baka Jataka (Ja No. 405). This brahma's name means \"crane,\" in Indian tradition regarded as a bird of cunning and deceit.On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the following evil speculative view had arisen in Brahma Baka: \"This is permanent, this is stable, this is eternal, this is complete, this is imperishable. Indeed, this is where one is not born, does not age, does not die, does not pass away, and is not reborn; and there is no other escape superior to this.\"[n.386]Spkglosseskevalam as akaṇḍam sakalam,\"unbroken, whole,\" and explains the background thus: In an earlier human birth this brahma had developed the jhānas and was reborn in the Vehapphala brahma world, a fourth jhāna plane with a life span of five hundred aeons. Thereafter he was reborn in the Subhakiṇha brahma world, a third jhāna plane with a life span of sixty-four aeons. Next he was reborn in the Abhassara brahma world, a second jhāna plane with a life span of eight aeons. Then he was reborn in the first jhāna plane with a life span of one aeon. At first he knew his own past kamma and planes of rebirth, but as time passed he forgot both and adopted an eternalist view.",
    "sn6.4:2": "Then, having known with his own mind the reflection in Brahma Baka's mind, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, the Blessed One disappeared from Jeta's Grove and reappeared in that brahma world. Brahma Baka saw the Blessed One coming in the distance and said to him : \"Come, dear sir! Welcome, dear sir! It has been a long time, dear sir, since you took the opportunity of coming here. Indeed, dear sir, this is permanent, this is stable, this is eternal, this is complete, this is imperishable. Indeed, this is where one is not born, does not age, does not die, does not pass away, and is not reborn; and there is no other escape superior to this.\"",
    "sn6.4:3": "When this was said, the Blessed One said to Brahma Baka: \"Alas, sir, Brahma Baka is immersed in ignorance! Alas, sir, Brahma Baka is immersed in ignorance, in so far as he will say of what is actually impermanent that it is permanent; and will say of what is actually unstable that it is stable; and will say of what is actually noneternal that it is eternal;sn.i.14and will say of what is actually incomplete that it is complete; and will say of what is actually perishable that it is imperishable; and with reference toa realmwhere one is born, ages, dies, passes away, and is reborn, will say thus: ‘Indeed, this is where one is not born, does not age, does not die, does not pass away, and is not reborn’; and when there is another escape superior to this, will say, ‘There is no other escape superior to this.’\"",
    "sn6.4:4": "v.572\"We seventy-two, Gotama, were merit-makers;Now we wield power, beyond birth and aging.This, knowledge-master, is our final attainment of Brahma.Many are the people who yearn for us.\"[n.387] Pada a reads:Dvasattati Gotama puññakamma.I translate in accordance with the paraphrase ofSpk: \"Master Gotama, we seventy-two men of meritorious kamma (Spk-pṭ: i.e., doers of meritorious deeds have been reborn here through that meritorious kamma(bho Gotama mayam dvasattati jana puññakamma) —Spk-pṭ:puññakarino tena puññakammena idha nibbatta).\" Neither Spk nor Spk-pṭ offers any further clue as to what the seventy-two refers to. I read pāda c with Ee2 as havingbrahmapattirather thanbrahmuppattiorbrahmupapattias in the other eds. Spk glossesabhijappantiin pāda d withpatthenti pihenti,\"yearn for, desire.\" Ja III 359,25–29 employs three verbs: \"Many people, with their hands joined in reverence, worship us, yearn for us, desire us(namassanti patthenti pihayanti), saying, ‘He is the Lord Brahma, Mahābrahmā,’ and so forth. They wish, ‘Oh, that we too might become thus.’\"",
    "sn6.4:5": "v.73\"The life span here is short, not long,Though you, Baka, imagine it is long.I know, O Brahma, your life span to beA hundred thousand nirabbudas.\"[n.388] Fornirabbuda,see n.409.Spksays that this is the extent of the life span that remains.",
    "sn6.4:6": "v.574\"O Blessed One,you say:‘I am the one of infinite visionWho has overcome birth, aging, and sorrow.’What was my ancient practice of vow and virtue?Tell me this so I might understand.\"[n.389] I followSpkin ascribing the statement \"I am the one of infinite vision … \" to the Buddha. If the text is read without the commentary, the words would have to be attributed to Baka. The request that follows, however, seems to confirm Spk's interpretation. Spk glosses:Vatasīlavattan ti vuccati sīlam eva(\"It is virtue alone that is referred to as ‘practice of vow and virtue’\"). Spk-pṭ: \"It is a vow(vatabhūtam)because it is formally undertaken, and a practice of virtue(sīlavattam)because it is practised by way of virtuous conduct, but the two terms actually refer to one thing; thus the commentary says, ‘It is virtue alone.’\"",
    "sn6.4:7": "v.55\"You gave drink to many peopleWho were thirsty, afflicted by heat:That was your ancient practice of vow and virtue,Which I recollect as if just waking up.[n.390]Spkrelates detailed stories behind each of the incidents referred to in vv. 55–. See too DPPN,2:259–60. Malalasekera errs, however, in stating that all the incidents occurred during his incarnation as Kesava. It seems Spk ascribes v. 58 alone to the life as Kesava.",
    "sn6.4:8": "v.576\"When people were abducted at Antelope Bank,You released the captives being led away.That was your ancient practice of vow and virtue,Which I recollect as if just waking up.",
    "sn6.4:9": "v.577\"When a ship was seized on the river GangesBy a fierce nāga longing for human flesh,You freed it forcefully by a valiant act:That was your ancient practice of vow and virtue,Which I recollect as if just waking up.sn.i.144",
    "sn6.4:10": "v.578\"I was your apprentice named Kappa;You thought him intelligent and devout:That was your ancient practice of vow and virtue,Which I recollect as if just waking up.\"[n.391] This verse refers to the Kesava Jataka (Ja No. 346; see too Dhp-a I 342–44). In pāda a, baddhacara is glossed bySpkas antevasika; see n.268. I read the verb in pāda b with Be asamaññi(oramaññain Ee2) as againstamaññim= \"I thought\" in Se and Ee1. Though Spk takes the line to thought\" in Se and Ee1. Though Spk takes the line to mean that Kappa thought thus of his teacher, I follow the Jataka, in which the teacher Kesava esteems his pupil Kappa as intelligent and devout while Kesava himself appears almost maudlin.",
    "sn6.4:11": "v.579\"Surely you know this life span of mine;The others too you know, thus you’re the Buddha.Thus this blazing majesty of yoursIllumines even the brahma world.\""
}