{
    "sn7.9:1": "On one occasion the Blessed One was dwelling among the Kosalans on the bank of the river Sundarika. Now on that occasion the brahmin Sundarika Bharadvaja was offering a fire sacrifice and performing the fire oblation on the bank of the river Sundarika. Then the brahmin Sundarika Bharadvaja, having offered the fire sacrifice and performed the fire oblation, rose from his seat and surveyed the four quarters all around, wondering: \"Who now might eat this sacrificial cake?\"[n.447]Spk: This was his thought: \"The portion of milk-rice placed in the fire has been eaten by Mahābrahmā. If this remainder is given to a brahmin, one born from the mouth of Brahma, my father and son would be pleased and I will clear the path to the brahma world.\" See Deussen,Sixty Upaniṣads of the Veda,SN.48: \"The residue(ucchiṣṭaṁ)of the offering, i.e., what remains in the ladle, in the saucepan, or vessel, is to be eaten only by a brahmaṇa, not in his own house; no kṣatriya or vaiśya is to eat it.\" This explains why the brahmin, just below, is so concerned about the Buddha’s caste.",
    "sn7.9:2": "Then the brahmin Sundarika Bharadvaja approached the Blessed One and said to him: \"What is the worthy one's birth?\"",
    "sn7.9:3": "v.68\"Ask not of birth but ask of conduct:Fire is indeed produced from any wood.A resolute sage, though from low family,Is a thoroughbred restrained by a sense of shame.[n.448] Fire is indeed produced from any wood(kaṭṭhā have jāyati jātavedo).Spk: This is the purport: \"It is not the case that only fire produced from a pure type of wood, such as sal-tree logs, can perform the work of fire, but not fire produced from the wood of a dog's trough, etc. Rather, by reason of its flame, etc., fire produced from any kind of wood can do the work of fire. So you should not think that only one born in a brahmin family is worthy of offerings, but not one born in a caṇḍala family, etc. Whether from a low family or a high family, an arahant sage is a thoroughbred—resolute, restrained by a sense of shame.\" See in this connection the arguments atMN II 129–0,151–5.",
    "sn7.9:4": "v.639\"The sacrificer should invoke this one:One tamed by truth, perfect by taming,Who has reached the end of knowledge,A fulfiller of the holy life.Then he makes a timely oblationTo one worthy of offerings.\"[n.9]Spkexplains one who has reached the end of knowledge(vedantagū)in pāda b thus: \"one gone to the end of the four path knowledges, or one gone to the end of defilements by the four path knowledges\"(catunnaṁ maggavedanaṁ antaṁ, catūhi va maggavedehi kilesanaṁ antaṁ gato). Evidently, the Buddha is here deliberately using brahmanical terminology in order to adjust the Dhamma to the mental disposition of the brahmin.",
    "sn7.9:5": "v.640\"Surely my sacrifice is well performedAs I have seen such a knowledge-master.Because I had not seen those like yourselfOther people ate the sacrificial cake.",
    "sn7.9:6": "\"Let Master Gotama eat. The worthy is a brahmin.\"",
    "sn7.9:7": "v.641\"Food over which verses have been sungIs not fit to be eaten by me.This, brahmin, is not the principleObserved by those who see.The Enlightened Ones reject such foodOver which verses have been sung.As such a principle exists, O brahmin,This is their rule of conduct.",
    "sn7.9:8": "v.642\"Serve with other food and drinkThe consummate one, the great seerWith taints destroyed and remorse stilled,For he is the field for one seeking merit.\"\"",
    "sn7.9:9": "\"Then, Master Gotama, should I give this sacrificial cake to someone else?\"",
    "sn7.9:10": "Then the brahmin Sundarika Bharadvaja disposed of that sacrificial cake in water where there were no living beings. When it was disposed of in the water, that sacrificial cake sizzled and hissed and gave off steam and smoke.[n.451]Spk: This did not occur through the power of the food itself but through the Buddha’s power. The Buddha had made such a determination so that the brahmin would be favourably disposed to hear the Dhamma.Just as a ploughshare, heated all day, sizzles and hisses and gives off steam and smoke if placed in water, so too that sacrificial cake, when disposed of in the water, sizzled and hissed and gave off steam and smoke.",
    "sn7.9:11": "Then the brahmin Sundarika Bharadvaja, shocked and terrified, approached the Blessed One and stood to one side. The Blessed One then addressed him with verses:",
    "sn7.9:12": "v.643\"When kindling wood, brahmin, do not imagineThis external deed brings purity;For experts say no purity is gainedBy one who seeks it outwardly.",
    "sn7.9:13": "v.644\"Having given up the fire made from wood,I kindle, O brahmin, the inner light alone.Always ablaze, my mind always concentrated,I am an arahant living the holy life.",
    "sn7.9:14": "v.645\"Conceit, O brahmin, is your shoulder-load,Anger the smoke, false speech the ashes;The tongue is the ladle, the heart the altar,A well-tamed self is the light of a man.[n.452] Khāribhāra, \"shoulder-load,\" is a carrying device commonly used in South Asia, consisting of two trays at each end of a pole borne across the shoulder.Spk:\"Conceit, O brahmin, is your shoulder-load:When a shoulder-load is being carried, with each step the weight of the load brings the trays into contact with the ground; similarly, though conceit props one up on account of birth, clan, family, etc., it causes envy to arise and thereby pulls one down to the four realms of misery.Anger the smoke:because the fire of knowledge does not shine when defiled by the smoke of anger.False speech the ashes:because the fire of knowledge does not burn when covered by false speech.The tongue is the ladle:my (the Buddha’s) tongue is a ladle offering the Dhamma sacrifice.The heart the altar:the hearts of beings are the altar, the fireplace, for my offering of the Dhamma sacrifice. The self(atta)is the mind.\"",
    "sn7.9:15": "v.646\"The Dhamma is a lake with fords of virtue—Limpid, praised by the good to the good—Where the knowledge-masters go to bathe,And, dry-limbed, cross to the far shore.[n.453]Spk: \"Just as, after you have worshipped the fire, you enter the Sundarika River and wash the ashes, soot, and sweat from your body, so for me the Dhamma of the eightfold path is the lake where I bathe thousands of living beings. The lake is limpid(anāvila)because, unlike your river which becomes muddy when four or five bathe in it at the same time, the lake of the Dhamma remains limpid and clear even when hundreds of thousands enter it to bathe.\" On \"the bath without water,\" see v.198efand n.119.",
    "sn7.9:16": "v.647\"Truth, Dhamma, restraint, the holy life,Attainment of Brahma based on the middle:sn.i.170Pay homage, O brahmin, to the upright ones;I call that person one impelled by Dhamma.\"[n.454]Spksuggests several alternative schemes by which the three terms in pāda a—sacca, dhamma,andsaṁyama—can be correlated with the eightfold path: e.g.,sacca= right speech;saṁyama= right action and right livelihood;dhamma= the other five factors. Spk explainsbrahmacariyaas if it were equivalent to the entire eightfold path(magga-brahmacariya), but it seems more likely that here the term was originally intended in the specific sense of celibacy, to be understood as a fourth item alongside the preceding three and not as an umbrella term comprising them.In pāda b, the attainment of BrahmāS(brahmapatti): the attainment of the best(seṭṭhapatti). Based on the middle(majjhesita): avoiding the extremes of eternalism and annihilationism. (Spk-pṭ: That is, based on the development of the middle way by avoiding all extremes such as sluggishness and restlessness, of which the pair eternalism and annihilationism is merely one instance.)in pāda c, the upright ones(ujjubhūtesu): the arahants.Spkexplains that the sat here represents tvaṁ, the -t- being a mere conjunct consonant(padasandhi). Though not as common as its use to convey a first person meaning, the third person demonstrative pronoun is occasionally used with a second person sense.",
    "sn7.9:17": "When this was said, the brahmin Sundarika Bharadvaja said to the Blessed One: \"Magnificent, Master Gotama!\" … And the Venerable Sundarika Bharadvaja became one of the arahants."
}