{
    "sn7.8:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Now on that occasion milk-rice with ghee had been set out for the brahmin Aggika Bharadvaja, who had thought: \"I will offer a fire sacrifice, I will perform the fire oblation.\"[n.443] A brahmin of this name is encountered in the Vasala Sutta (Snp I, 7;), but he seems to be a different person. According toSpk, this brahmin was given the soubriquet \"Aggika\" because he tended the sacred fire.",
    "sn7.8:2": "Then, in the morning, the Blessed One dressed and, taking bowl and robe, entered Rājagaha for alms. Walking for alms on uninterrupted alms round in Rājagaha, the Blessed One approached the residence of the brahmin Aggika Bharadvaja and stood to one side. The brahmin Aggika Bharadvaja saw the Blessed One standing for alms and addressed him in verse:",
    "sn7.8:3": "v.62\"One endowed with the triple knowledge,Of proper birth, of ample learning,Accomplished in knowledge and conduct,Might partake of this milk-rice meal.\"[n.444]Spk: He speaks of one endowed \"with the triple knowledge\"(tīhi vijjāhi)with reference to the Three Vedas. By \"proper birth\"(jātima)he means one of pure birth through seven generations.",
    "sn7.8:4": "v.633\"Even though one mutters many chants,One does not become a brahmin by birthIf one is rotten within and defiled,With followers gained by fraudulent means.sn.i.167",
    "sn7.8:5": "v.634\"One who has known his past abodes,Who sees heaven and the plane of woe,Who has reached the destruction of birth,A sage consummate in direct knowledge:[n.44] The Buddha’s reply refers to the tevijja of his own system of training: pāda a, to knowledge of the recollection of past abodes; pāda b, to the divine eye, i.e., the knowledge of the passing away and rebirth of beings; and pāda c, to the knowledge of the destruction of the taints.",
    "sn7.8:6": "v.35\"By means of these three kinds of knowledgeOne is a triple-knowledge brahmin.This one accomplished in knowledge and conductMight partake of this milk-rice meal.\"",
    "sn7.8:8": "v.636\"Food over which verses have been sungIs not fit to be eaten by me.This, brahmin, is not the principleObserved by those who see.The Enlightened Ones reject such foodOver which verses have been sung.As such a principle exists, O brahmin,This is their rule of conduct.",
    "sn7.8:9": "v.637\"Serve with other food and drinkThe consummate one, the great seerWith taints destroyed and remorse stilled,For he is the field for one seeking merit.\"[n.446]Spkparaphrases the idea behind vv. 636–37 thus: \"Though I stood for such a long time waiting for alms, you would not give me even a spoonful; but now, after I have revealed all the Buddha-qualities to you as though spreading out sesamum seeds on a mat, (you wish to give). This food has been gained, as it were, by chanting a song; therefore, because it has been ‘chanted over with verses’(gāthābhigīta)it is not fit to be eaten by me. As such a principle exists(dhamme sati), out of regard for the Dhamma, established on the Dhamma, the Buddhas sustain their life. This is their rule of conduct; this is their way of livelihood(esa vutti ayaṁ ājīvo). Such food is to be discarded and only what is righteously gained is to be eaten.\"The Buddha’s practice is discussed at Mil 228–32. CPD (s.v.abhigīta) suggests that the reason the Buddha rejects such food is because it has been \"spoken over with mantras\"—by the brahmin while chanting the sacrificial hymns—but to me it is doubtful the Buddha would reject food for such a reason. Further, according to MW, gatha is not used with reference to the verses of the Vedas, and thus here the word more likely refers to the Buddha’s own verses.Spkdoes not comment onkevalinaṁ,\"the consummate one,\" in pāda a, but Pj II 153,–10 (toSn 82) says:Kevalinan ti sabbaguṇaparipuṇṇaṁ sabbayogavisaṁyuttaṁ vā;\"a consummate one is one complete in all excellent qualities or one detached from all bonds.\" Spk II 276, 32–277, 1 (toSN III 5,34) explains:Kevalino ti sakalino katasabbakiccā;\"the consummate ones are entire, they have completed all their tasks.\" For a further selection of relevant passages, see GD, p. 161, n. to 82. For reflections on the implications of the term, see ñāṇananda,SN-Anth2:100–1.Spkexplainskukkuccavūpasantaṁthus: hatthakukkuccādīnaṁ vasena vūpasantakukkuccaṁ; \"one in whom remorse has been stilled by the stilling of fidgety behaviour with the hands, etc.\" Here kukkucca is understood in the literal sense of \"bad activity\" or \"fidgety behaviour\" rather than in the extended sense of remorse or worry, one of the five hindrances.",
    "sn7.8:10": "When this was said, the brahmin Aggika Bharadvaja said to the Blessed One: \"Magnificent, Master Gotama!\" … And the Venerable Aggika Bharadvaja became one of the arahants."
}