{
    "sn7.18:1": "On one occasion the Blessed One was dwelling among the Kosalans in a certain woodland thicket. Now on that occasion a number of brahmin boys, students of a certain brahmin of the Bharadvaja clan, approached that woodland thicket while collecting firewood. Having approached, they saw the Blessed One sitting in that woodland thicket with his legs folded crosswise, holding his body erect, having set up mindfulness in front of him. Having seen him, they approached the brahmin of the Bharadvaja clan and said to him: \"See now, master, you should know that in such and such a woodland thicket an ascetic is sitting with his legs folded crosswise, holding his body erect, having set up mindfulness in front of him.\"",
    "sn7.18:2": "v.697\"Having entered the empty, desolate forest,Deep in the woods where many terrors lurk,sn.i.181With a motionless body, steady, lovely,How you meditate, bhikkhu, so beautifully![n.475] In the third line I supply \"body\" in deference toSpk, which explains the instrumentals as qualifying the body(kayavisesanani). Spk glosses sucarurūpaṁ with atisundaraṁ.",
    "sn7.18:3": "v.698\"In the forest where no song or music sounds,A solitary sage has resorted to the woods!This strikes me as a wonder—that you dwellWith joyful mind alone in the woods.",
    "sn7.18:4": "v.699\"I suppose you desire the supreme triple heaven,The company of the world's divine lord.Therefore you resort to the desolate forest:You practise penance here for attaining Brahma.ʺ[n.76]Spk: The world's divine lord(lokadhipati)is Mahābrahmā, the supreme triple heaven(tidivam anuttaraṁ)is said with reference to the brahma world. I translate pādas cd as an assertion based on the v.l. tasma found in some SS and adopted by Ee2 rather than as a question signalled bykasma,the reading in Be, Se, and Ee1.",
    "sn7.18:5": "v.700\"Whatever be the many desires and delightsThat are always attached to the manifold elements,The longings sprung from the root of unknowing:All I have demolished along with their root.[n.477]Spkexplains desires(kaṅkhā), delights(abhinandanā), and longings(pajappitā)as modes of craving(taṇhā). The root of unknowing(aññāṇamūla)is ignorance(avijjā). (A parallel to this verse is at Nett 24 and Peṭ 17, but with pāda a readingḍāsā piha ca abhinandanā ca.)",
    "sn7.18:6": "v.701\"I am desireless, unattached, disengaged;My vision of all things has been purified.Having attained the auspicious—supreme enlightenment—Self-confident, brahmin, I meditate alone.\"[n.478] in pāda a, I readasitowith Be, Se, and Ee2, as against Ee1apiho,\"without envy.\"Spktakes \"my purified vision of all things\" to be an allusion to the knowledge of omniscience. (In pāda c, it glossessivaṁwithseṭṭhaṁ,andsambodhim anuttaraṁwitharahatta.)",
    "sn7.18:7": "When this was said, the brahmin of the Bharadvaja clan said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! … Let Master Gotama remember me as a lay follower who from today has gone for refuge for life.\""
}