{
    "sn7.14:1": "At Sāvatthī.[n.468] A much more elaborate version of the same encounter is found at Dhp-a IV 7–5, where it forms the background story toDhp 324; see BL 3:20–5. The story is incorporated intoSpk.Then a certain affluent brahmin, shabby, clad in a shabby cloak,sn.i.76approached the Blessed One and exchanged greetings with him. When they had concluded their greetings and cordial talk, he sat down to one side, and the Blessed One then said to him: \"Why now, brahmin, are you so shabby, clad in a shabby cloak?\"",
    "sn7.14:2": "v.679\"Those at whose birth I took delightAnd whose success I much desired,Being instigated by their wives,Chase me out as dogs chase swine.",
    "sn7.14:3": "v.680\"These evil fellows are indeed mean,Although they call me, ‘Dad, dear Dad.’They’re demons in the guise of sonsTo abandon me when I’ve grown old.",
    "sn7.14:4": "v.681\"As an old horse of no more useIs led away from its fodder,So the old father of those boysBegs for alms at others’ homes.",
    "sn7.14:5": "v.682\"Better for me is the staff I useThan those disobedient sons;For the staff drives off the wild bullAnd drives away the wild dog.",
    "sn7.14:6": "v.83\"In the dark it goes before me,In the deep it gives me support.By the gracious power of the staff,If I stumble I still stand firm.\"",
    "sn7.14:7": "Then that affluent brahmin, having learned these verses in the presence of the Blessed One, recited them when the multitude had assembled in the meeting hall with his sons sitting together there:",
    "sn7.14:8": "v.64\"Those at whose birth I took delightAnd whose success I much desired,Being instigated by their wives,Chase me out as dogs chase swine.",
    "sn7.14:9": "v.685\"These evil fellows are indeed mean,Although they call me, ‘Dad, dear Dad.’They’re demons in the guise of sonsTo abandon me when I’ve grown old.",
    "sn7.14:10": "v.686\"As an old horse of no more useIs led away from its fodder,So the old father of those boysBegs for alms at others’ homes.",
    "sn7.14:11": "v.687\"Better for me is the staff I useThan those disobedient sons;For the staff drives off the wild bullAnd drives away the wild dog.",
    "sn7.14:12": "v.688\"In the dark it goes before me,In the deep it gives me support.By the gracious power of the staff,If I stumble I still stand firm.\"sn.i.177",
    "sn7.14:13": "Then the sons led that affluent brahmin to their house, bathed him, and each gave him a pair of clothes. Then that affluent brahmin, having taken one pair of clothes, approached the Blessed One and exchanged greetings with him. Then he sat down to one side and said to the Blessed One: \"Master Gotama, we brahmins seek a teacher's fee for our teacher. Let Master Gotama accept a teacher's fee from me.\" The Blessed One accepted out of compassion."
}