{
    "sn7.10:1": "On one occasion the Blessed One was dwelling among the Kosalans in a certain woodland thicket. Now on that occasion fourteen oxen belonging to a certain brahmin of the Bharadvaja clan had gotten lost. Then the brahmin of the Bharadvaja clan, while searching for those oxen, went to the woodland thicket where the Blessed One was staying. There he saw the Blessed One sitting with his legs folded crosswise, holding his body erect, having set up mindfulness in front of him. Having seen him, he approached the Blessed One and recited these verses in the presence of the Blessed One:",
    "sn7.10:2": "v.648\"Surely this ascetic does not haveFourteen oxenthat have gotten lost,Not seen now for the past six days:Hence this ascetic is happy.[n.455] In pāda c,ajjasaṭṭhiṁ na dissantiis glossed bySpk, \"they are not seen for six days from today,\" indicating thatsaṭṭhihere is an alternative form ofchaṭṭha,sixth. Spk-pṭ:Ajjasaṭṭhiṁis an accusative used to indicate a continuing passage of time(accantasaṁyoge c’etaṁ upayogavacanaṁ).",
    "sn7.10:3": "v.649\"Surely this ascetic does not haveA field of blighted sesamum plants,Some with one leaf, some with two:Hence this ascetic is happy.",
    "sn7.10:4": "v.650\"Surely this ascetic does not haveRats inside an empty barnDancing around merrily:Hence this ascetic is happy.",
    "sn7.10:5": "v.61\"Surely this ascetic does not haveA blanket that for seven monthsHas been covered with swarms of vermin:Hence this ascetic is happy.",
    "sn7.10:6": "v.52\"Surely this ascetic does not haveSeven daughters left for widows,Some with one son, some with two:Hence this ascetic is happy.[n.45]Spk: As long as the brahmin was affluent, even though his daughters were widows, their parents-in-law allowed them to stay in their husbands’ homes. But when he became poor their parents-in- law sent them to their father's home. Then, when he would take his meals, their children would put their hands in his plate and he would not find sufficient room for his own hand.",
    "sn7.10:7": "v.653\"Surely this ascetic does not haveA tawny wife with pockmarked faceWho wakes him up with a kick:Hence this ascetic is happy.",
    "sn7.10:8": "v.654\"Surely this ascetic does not haveCreditors who call at dawn,Chiding him, ‘Pay up! Pay up!’:Hence this ascetic is happy.\"",
    "sn7.10:9": "v.655\"Surely, brahmin, I do not haveFourteen oxenthat have gotten lost,Not seen now for the past six days:Hence, O brahmin, I am happy.sn.i.171",
    "sn7.10:10": "v.656\"Surely, brahmin, I do not haveA field of blighted sesamum plants,Some with one leaf, some with two:Hence, O brahmin, I am happy.",
    "sn7.10:11": "v.657\"Surely, brahmin, I do not haveRats inside an empty barnDancing around merrily:Hence, O brahmin, I am happy.",
    "sn7.10:12": "v.658\"Surely, brahmin, I do not haveA blanket that for seven monthsHas been covered with swarms of vermin:Hence, O brahmin, I am happy.",
    "sn7.10:13": "v.659\"Surely, brahmin, I do not haveSeven daughters left for widows,Some with one son, some with two:Hence, O brahmin, I am happy.",
    "sn7.10:14": "v.660\"Surely, brahmin, I do not haveA tawny wife with pockmarked faceWho wakes me up with a kick:Hence, O brahmin, I am happy.",
    "sn7.10:15": "v.661\"Surely, brahmin, I do not haveCreditors who call at dawn,Chiding me, ‘Pay up! Pay up!’:Hence, O brahmin, I am happy.\"",
    "sn7.10:16": "When this was said, the brahmin of the Bharadvaja clan said to the Blessed One: \"Magnificent, Master Gotama!\" … And the Venerable Bharadvaja became one of the arahants.[n.457]Spkappends a story which relates how the Buddha took the brahmin (after his novice ordination) to King Pasenadi. The king repaid his debts, provided for the welfare of his daughters, and placed his wife in the position of his own grandmother, thereby removing the obstacles to his higher ordination as a bhikkhu.sn.i.172"
}