{
    "sn7.13:1": "At Sāvatthī. Now on that occasion the Blessed One was afflicted by winds and the Venerable Upavaṇa was his attendant.[n.466] That is, he was afflicted by an illness arisen from the wind humour, one of the three bodily humours according to the ancient Indian system of ayurvedic medicine; on wind as one of the eight causes of illness, seeSN36.2.Spk: The Buddha was prone to occasional gastric ailments as a consequence of his six years of ascetic practices before his enlightenment.Then the Blessed One addressed the Venerable Upavaṇa thus: \"Come now, Upavaṇa, find some hot water for me.\"",
    "sn7.13:2": "v.673\"Silent, the worthy one stands,Shaven-headed, clad in a stitched robe.What do you want, what do you seek,What have you come here to beg?\"",
    "sn7.13:3": "v.674\"The Arahant, the Fortunate One in the world,The Sage, is afflicted with winds.If there is any hot water, brahmin,Please give it for the Sage.",
    "sn7.13:4": "v.675\"He is worshipped by those worthy of worship,Honoured by those worthy of honour,Respected by those worthy of respect:It is to him that I wish to take it.\"",
    "sn7.13:5": "Then the brahmin Devahita ordered a man to bring a carrying pole with hot water and presented a bag of molasses to the Venerable Upavaṇa. Then the Venerable Upavaṇa approached the Blessed One. He had the Blessed One bathed with the hot water, and he mixed the molasses with hot water and offered it to him. Then the Blessed One's ailment subsided.",
    "sn7.13:6": "Then the brahmin Devahita approached the Blessed One and exchanged greetings with him, after which he sat down to one side and addressed the Blessed One in verse:",
    "sn7.13:7": "v.66\"Where should one give a proper gift?Where does a gift bear great fruit?How, for one bestowing alms,Does an offering bring success—just how?\"[n.46] For a full analysis of the two questions, seeSN3.24and nn.253 and 254. I takekathaṁin pāda d here, andevaṁin v.68d, to be mere metrical fillers.",
    "sn7.13:8": "v.677\"One who has known his past abodes,Who sees heaven and the plane of woe,Who has reached the destruction of birth,A sage consummate in direct knowledge:",
    "sn7.13:9": "v.678Here one should give a proper gift,Here a gift bears great fruit.That's how, for one bestowing alms,An offering brings success—just so!\"",
    "sn7.13:10": "When this was said, the brahmin Devahita said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! … Let Master Gotama remember me as a lay follower who from today has gone for refuge for life.\""
}