{
    "sn7.17:1": "On one occasion the Blessed One was dwelling among the Kosalans in a certain woodland thicket. Now on that occasion the brahmin Navakammika Bharadvaja was getting some work done in that woodland thicket.[n.473]Spk: He was called Navakammika (\"New Works\") because he earned his living by felling timber in the forest, seasoning the wood for construction work, and selling it in the city.The brahmin Navakammika Bharadvaja saw the Blessed One sitting at the foot of a certain sal tree with his legs folded crosswise, holding his body erect, having set up mindfulness in front of him. Having seen him, he thought: \"I take delight in getting work done in this woodland thicket. What does this ascetic Gotama take delight in getting done?\"",
    "sn7.17:2": "v.685\"With what kind of work are you engagedHere in this sal woods, bhikkhu,By reason of which you find delightAlone in the forest, Gotama?\"",
    "sn7.17:3": "v.686\"There is nothing in the woods I need to do;Cut down at the root, my woods is dried up.Woodless and dartless, discontent cast off,I find delight alone in the woods.\"[n.474] in pāda b,ucchinnamūlaṁappears often in a stock formula describing the arahant's liberation from defilements (e.g.,SN12.5II 62,20–6,11);SN22.(III 10,27, );SN5.104(IV 85,9, 14);SN54.12(V 27,26–28,6); thus the allusion, already obvious, is made explicit bySpk: \"The woods of defilements is cut down at its root.\" in pāda b, I follow the SS readingvisukkhaṁ,\"dried up,\" also adopted by Ee2, over Be and Sevisūkaṁand Ee1visukaṁ.Spk glossesnibbanathoin pāda c withnikkilesavano.This involves a pun difficult to reproduce in translation. Literally,vanathameans a woods, but the word is often used to signify, metaphorically, \"the woods of defilements,\" particularly craving. Here I have translatednibbanathaas \"woodless\" to preserve the pun. At v.712, however, where the literal meaning has little bearing on the verse as a whole, I have renderednibbanathaby way of its metaphorical meaning. Analogous puns onvanaandvanathaare atSN14.16(see too II, n.245), and also atDhp 28–84and44(which, incidentally, answer Norman's puzzling observation at EV I, n. to 8, that the canon seems not to include any example of a pun on the double meaning ofvanathato match the puns uponvana). The Buddha is \"dartless\"(visallo)because he has extracted the dart of craving (see v.214c).",
    "sn7.17:4": "When this was said, the brahmin Navakammika Bharadvaja said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! … Let Master Gotama remember me as a lay follower who from today has gone for refuge for life.\""
}