{
    "sn7.11:1": "Thus have I heard.[n.458] This sutta is also found atSn.4, but the prose portion adds the wonder of the sizzling cake described inSN7.9. It also has the brahmin request ordination as a bhikkhu and attain arahantship. It must have been a common subject for sermons, as the commentary to it is long and elaborate. It is also included in theMaha Pirit Pota,\"The Great Book of Protection,\" the standard collection of protective suttas used in Sri Lanka.On one occasion the Blessed One was dwelling among the Magadhans at Dakkhiṇāgiri near the brahmin village of Ekanaḷa. Now on that occasion the brahmin Kasi Bharadvaja, Bharadvaja the Ploughman, had five hundred ploughs fastened to their yokes at the time of sowing.[n.459]Spk: He was called thus because he earned his living by ploughing. This occasion was not an ordinary work day but a special festival which marked the inception of the light-soil sowing(paṁsuvappa). Spk gives a detailed account of the preparations and the festival activities.Then, in the morning, the Blessed One dressed and, taking bowl and robe, went to the place where the brahmin Kasi Bharadvaja was at work.",
    "sn7.11:2": "Now on that occasion the brahmin Kasi Bharadvaja's food distribution was taking place.[n.460]Spk: At the food distribution(parivesana)five hundred ploughmen had taken silver vessels, etc., and were sitting while the food was being distributed to them. Then the Buddha arrived and stood in a high place within raṅge of the brahmin, close enough so that they could easily converse.Then the Blessed One approached the place of the food distribution and stood to one side. The brahmin Kasi Bharadvaja saw the Blessed One standing for alms and said to him:",
    "sn7.11:3": "v.662\"You claim to be a man who works the plough,But I do not see your ploughing.If you’re a ploughman, answer me:How should we understand your ploughing?\"",
    "sn7.11:4": "v.663\"Faith is the seed, austerity the rain,Wisdom my yoke and plough;Shame is the pole, mind the yoke-tie,Mindfulness my ploughshare and goad.[n.61]Spk: Why did the Blessed One begin with faith? Because this brahmin was reputed to be intelligent(paññava)but was deficient in faith. Thus a talk on faith would be helpful to him. Why is faith called the seed(saddhā bījaṁ)? Because it is the foundation of all wholesome qualities. When a seed is planted in the ground, it becomes established by its root and sends up a sprout. Through the root it absorbs the soil's nutrients and water, and it grows through the stalk in order to yield the grain. Coming to growth and maturity, it finally produces a head bearing many rice grains. So faith becomes established with the root of virtue and sends up the sprout of serenity and insight. Absorbing the nutrients of serenity and insight through the root of virtue, it grows through the stalk of the noble path to yield the crop of the noble fruits. Finally, after coming to growth through six stages of purification, and producing the sap of purification by knowledge and vision, it culminates in the fruit of arahantship bearing many discriminating knowledges and direct knowledges(anekapaṭisambhidabhiñña). Therefore it is said, \"Faith is the seed.\"On austerity(tapa),see n.119.Spk: Here sense restraint is intended. Wisdom(paññā)is insight together with path-wisdom. Just as the brahmin has a yoke and plough, so the Blessed One has the twofold insight and(path-)wisdom. Spk devotes several pages to the analogy between path factors and ploughing implements. I adopt the renderings of ploughing terms from GD, p. 9.",
    "sn7.11:5": "v.664\"Guarded in body, guarded in speech,Controlled in my appetite for food,I use truth as my weeding-hook,And gentleness as my unyoking.[n.462]Spk: In some places gentleness(soracca)denotes bodily and verbal nontransgression, but this is not intended here. Here the fruit of arahantship is intended, for that is called soracca (the abstract noun ofsu+rata) because it finds delight in the good Nibbāna(sundare nibbane ratatta). What he is saying is this: \"By attaining arahantship at the foot of the Bodhi Tree, I am released, and never again must I come under the yoke.\"sn.i.173",
    "sn7.11:6": "v.5\"Energy is my beast of burden,Carrying me to security from bondage.It goes ahead without stoppingTo where, having gone, one does not sorrow .[n.43]Spkexplainsyogakkhemaas Nibbāna \"because it is secure from the bonds\"(yogehi khematta). The four bonds are identical with the four floods, we see inSN1. For a discussion of the literary history ofyogakkhema,see EV I, n. to 32.To where, having gone, one does not sorrow(yattha gantva na socati). Spk: It goes to the unconditioned state known as Nibbāna, which is the extraction of all the darts of sorrow.",
    "sn7.11:7": "v.666\"In such a way this ploughing is doneWhich has the Deathless as its fruit.Having finished this work of ploughing,One is released from all suffering.\"",
    "sn7.11:8": "\"Let Master Gotama eat! The worthy is a ploughman, since Master Gotama does ploughing that has even the Deathless as its fruit.\"",
    "sn7.11:9": "v.667\"Food over which verses have been sungIs not fit to be eaten by me.This, brahmin, is not the principleObserved by those who see.The Enlightened Ones reject such foodOver which verses have been sung.As such a principle exists, O brahmin,This is their rule of conduct.",
    "sn7.11:10": "v.668\"Serve with other food and drinkThe consummate one, the great seerWith taints destroyed and remorse stilled,For he is the field for one seeking merit.\"\"",
    "sn7.11:11": "When this was said, the brahmin Kasi Bharadvaja said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! The Dhamma has been made clear in many ways by Master Gotama, as though he were turning upright what had been turned upside down, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go for refuge to Master Gotama, and to the Dhamma, and to the Bhikkhu Saṅgha. Let Master Gotama remember me as a lay follower who from today has gone for refuge for life.\""
}