{
    "sn7.2:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. The brahmin Akkosaka Bharadvaja, Bharadvaja the Abusive, heard:[n.433] I give the sobriquet both in Pali and in English.Spk, which identifies him as the younger brother of the first Bharadvaja brahmin, says that the epithet was added by the redactors of the canon because he came abusing(akkosanto)the Tathāgata with five hundred verses.\"It is said that the brahmin of the Bharadvaja clan has gone forth from the household life into homelessness under the ascetic Gotama.\" Angry and displeased, he approached the Blessed One andsn.i.62abused and reviled him with rude, harsh words.",
    "sn7.2:2": "When he had finished speaking, the Blessed One said to him: \"What do you think, brahmin? Do your friends and colleagues, kinsmen and relatives, as well as guests come to visit you?\"\"Sometimes they come to visit, Master Gotama.\"\"Do you then offer them some food or a meal or a snack?\"\"Sometimes I do, Master Gotama.\"\"But if they do not accept it from you, then to whom does the food belong?\"\"If they do not accept it from me, then the food still belongs to us.\"\"So too, brahmin, we who do not abuse anyone, who do not scold anyone, who do not rail against anyone—refuse to accept from you the abuse and scolding and tirade you let loose at us. It still belongs to you, brahmin! It still belongs to you, brahmin!",
    "sn7.2:3": "\"Brahmin, one who abuses his own abuser, who scolds the one who scolds him, who rails against the one who rails at him—he is said to partake of the meal, to enter upon an exchange. But we do not partake of your meal; we do not enter upon an exchange. It still belongs to you, brahmin! It still belongs to you, brahmin!\"",
    "sn7.2:4": "v.615\"How can anger arise in one who is angerless,In the tamed one of righteous living,In one liberated by perfect knowledge,In the Stable One who abides in peace?[n.35] I have translated tadi as \"the Stable One\" in accordance with the commentarial gloss, tadilakkhaṇaṁ pattassa, which alludes to the explanation of tadi at Nidd I 11–16: \"The arahant is tadi because he is ‘stable’(tadi)in the face of gain and loss, etc.; he is tadi because he has given up all defilements, etc.; he is tadi because he has crossed the four floods, etc.; he is tadi because his mind is free from all defilements; and he is tadi as a description of him in terms of his qualities\" (condensed). A similar but slightly different definition of tadi in relation to the Buddha occurs at Nidd I 59–61.",
    "sn7.2:5": "v.616\"One who repays an angry man with angerThereby makes things worse for himself.Not repaying an angry man with anger,One wins a battle hard to win.",
    "sn7.2:6": "v.17\"He practises for the welfare of both—His own and the other's—When, knowing that his foe is angry,He mindfully maintains his peace.",
    "sn7.2:7": "v.618\"When he achieves the cure of both—His own and the other's—The people who consider him a foolAre unskilled in the Dhamma.\"[n.436] Be and Ee1 & 2 read pāda a: ubhinnaṁ tikicchantanaṁ, whichSpk(Be) includes in the lemma and glosses ubhinnaṁ tikicchantaṁ, adding: \"Or the latter is itself the reading.\" In Se and Spk (Se) the readings are exactly the reverse. As the sense requires an accusative singular, the readingubhinnaṁ tikicchantaṁ taṁ,found atTh 444a, offends against neither grammar nor metre. Ee2 has adopted this reading for the exact parallel v.882below, but strangely reverts toubhinnaṁ tikicchantanaṁin the third parallel, v.891.sn.i.163",
    "sn7.2:8": "When this was said, the brahmin Akkosaka Bharadvaja said to the Blessed One: \"Magnificent, Master Gotama! … I go for refuge to Master Gotama, and to the Dhamma, and to the Bhikkhu Saṅgha. May I receive the going forth under Master Gotama, may I receive the higher ordination?\"",
    "sn7.2:9": "Then the brahmin of the Bharadvaja clan received the going forth under the Blessed One, he received the higher ordination. And soon, not long after his higher ordination, dwelling alone … … the Venerable Bharadvaja became one of the arahants."
}