{
    "sn7.20:1": "At Sāvatthī. Then a mendicant brahmin approached the Blessed One … and said to him: \"Master Gotama, I am a mendicant and you are a mendicant. What is the difference between us in this respect?\"[n.479] \"Mendicant\" is a rendering ofbhikkhaka,which is of course related tobhikkhu,a fully ordained Buddhist monk.",
    "sn7.20:2": "v.703\"It is not thus that one becomes a mendicant,Just because one begs others for alms.If one has taken up a domestic practice,One still has not become a bhikkhu.[n.480]Ee1bhikkhavoin pāda b should be amended tobhikkhate.Spk explainsvissaṁ dhammaṁin the next pāda asduggandhaṁ akusaladhammaṁ,\"a foul smelling unwholesome state,\" assuming thatvissa< Sktvisra, raw meat. Spk-pṭ adds: \"It produces a putrid smell, thus it isvissa,i.e., foul smelling\"(virūpaṁ gandhaṁ pāsavāti ti visso duggandho). Dhp-a III 393, (commenting on the verse atDhp 66) says: \"Vissais an uneven doctrine(visamaṁ dhammaṁ); or else, a putrid-smelling state of bodily action, etc.(vissagandhaṁ va kayakammadikaṁ dhammaṁ), having undertaken which one is not called a bhikkhu.\" As Brough points out, however, the original Pali term is probably derived from Vedicveśman,domestic (Gandhari Dharmapada, pp. 191–9, n. to 67).Vesmaoccurs in Pali at Ja V 84,17. Uv 3:18, the Skt parallel to the present verse, hasveśmaṁ dharmaṁ.In the next verse, in pāda b, I readbrahmacariyava,with Se and SS, as againstbrahmacariyaṁin the other eds. The latter does not seem to fit into the syntax, as it is neither subject nor object of the verb. Since the Buddha here defines a bhikkhu as one who has expelled both merit and evil(puññañ ca papañ ca bahitva), this means he is equating the real monk solely with the arahant.",
    "sn7.20:3": "v.704\"But one here who leads the holy life,Having expelled merit and evil,Who fares in the world with comprehension:He is truly called a bhikkhu.\"",
    "sn7.20:4": "When this was said, the mendicant brahmin said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! … Let Master Gotama remember me as a lay follower who from today has gone for refuge for life.\""
}