{
    "sn7.12:1": "At Sāvatthī. Then, in the morning, the Blessed One dressed and, taking bowl and robe, approached the residence of the brahmin Udaya. Then the brahmin Udaya filled the Blessed One's bowl with rice. A second time in the morning the Blessed One dressed and, taking bowl and robe, approached the residence of the brahmin Udaya … . A third time in the morning the Blessed One dressed and, taking bowl and robe, approached the residence of the brahmin Udaya.[n.464]Spkexplains that the phrases \"a second time\" and \"a third time\" mean the next day and the day after that. Although the text itself conveys the impression that the Buddha went to the same house for alms three times on the same morning, this would be contrary to proper monastic etiquette, so Spk must be reliable on this point.Then a third time the brahmin Udaya filled the Blessed One's bowl with rice,sn.i.74after which he said to the Blessed One: \"This pesky ascetic Gotama keeps coming again and again.\"[n.465] Pakaṭṭhaka < Skt prakarṣaka, \"harasser, disquieter,\" from prakṛṣ, to trouble, to disturb (SED). Spk glosses with rasagiddha, \"greedy for tastes.\" Spk-pṭ explains: \"He is dragged forward by craving for tastes\"(rasataṇhaya pakaṭṭho).",
    "sn7.12:2": "v.669\"Again and again, they sow the seed;Again and again, the sky-god sends down rain;Again and again, ploughmen plough the field;Again and again, grain comes to the realm.",
    "sn7.12:3": "v.670\"Again and again, the mendicants beg;Again and again, the donors give;When donors have given again and again,Again and again they go to heaven.",
    "sn7.12:4": "v.671\"Again and again, the dairy folk draw milk;Again and again, the calf goes to its mother;Again and again, one wearies and trembles;Again and again, the dolt enters the womb;",
    "sn7.12:5": "v.672Again and again, one is born and dies;Again and again, they take one to the cemetery.\"But when one has obtained the pathThat leads to no more renewed existence,Having become broad in wisdom,One is not born again and again!\"",
    "sn7.12:6": "When this was said, the brahmin Udaya said to the Blessed One : \"Magnificent, Master Gotama! Magnificent, Master Gotama! … Let Master Gotama remember me as a lay follower Gotama!… Let Master Gotama remember me as a lay follower who from today has gone for refuge for life.\""
}