{
    "sn7.15:1": "At Sāvatthī. Now on that occasion a brahmin named Manatthaddha, Stiff with Conceit, was residing at Sāvatthī.[n.469] Th-a II 79–80 relates exactly the same story about the elder Jenta (Th 423–28), the son of the king of Kosala's chaplain. In his youth he was stiff with conceit (manatthaddha,used as a description, not a name), but was humbled by the Buddha with exactly the same exchange of verses as is related here. He became a stream-enterer on hearing the Buddha’s verses, went forth as a bhikkhu, and attained arahantship.He did not pay homage to his mother or father, nor to his teacher or eldest brother. Now on that occasion the Blessed One was teaching the Dhamma surrounded by a large assembly. Then it occurred to the brahmin Manatthaddha: \"This ascetic Gotama is teaching the Dhamma surrounded by a large assembly. Let me approach him. If the ascetic Gotama addresses me, then I will address him in turn. But if he does not address me, neither will I address him.\"",
    "sn7.15:2": "v.689\"The fostering of conceit is never goodFor one keen on his welfare, brahmin.You should instead foster that purposeBecause of which you’ve come here.\"[n.471] in pāda a, it seems better to readmanabrūhaṇa,with Se and Ee, as againstmanaṁ brahmaṇain Be and Ee1. The version at Th-a readsbrahmaṇain all three eds. available to me.",
    "sn7.15:3": "Then the brahmin Manatthaddha, thinking, \"The ascetic Gotama knows my mind,\" prostrated himself right there with his head at the Blessed One's feet. He kissed the Blessed One's feet, stroked them with his hands, and announced his name thus: \"I am Manatthaddha, Master Gotama! I am Manatthaddha, Master Gotama!\"",
    "sn7.15:4": "v.690\"Towards whom should one avoid conceit?Towards whom should one show reverence?To whom should one be ever respectful?Whom is it proper to venerate deeply?\"",
    "sn7.15:5": "v.691\"First one's own mother and father,Then one's eldest family brother,Then one's teacher as the fourth:Towards these one should avoid conceit;Towards these one should be reverential;These should be well respected;These it is good to venerate deeply.",
    "sn7.15:6": "v.92\"Having struck down conceit, humble,One should pay homage to the arahants,Those cool of heart, their tasks done,The taintless ones, unsurpassed.\"",
    "sn7.15:7": "When this was said, the brahmin Manatthaddha said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! … Let Master Gotama remember me as a lay follower who from today has gone for refuge for life.\"sn.i.19"
}