{
    "sn7.3:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. The brahmin Asurindaka Bharadvaja heard:[n.437] He was the youngest of the Bharadvaja brothers.\"It is said that the brahmin of the Bharadvaja clan has gone forth from the household life into homelessness under the ascetic Gotama.\" Angry and displeased, he approached the Blessed One and abused and reviled him with rude, harsh words.",
    "sn7.3:2": "v.619\"The fool thinks victory is wonWhen, by speech, he bellows harshly;But for one who understands,Patient endurance is the true victory.[n.438]Spk: \"For one who understands the excellence of endurance, this victory—patient endurance—is his alone(yā titikkhā vijānato adhivāsanāya guṇaṁ vijānantassa titikkhā adhivāsanā, ayaṁ tassa vijaānato va jayo).\" Note that neuterjayaṁis here nominative.",
    "sn7.3:3": "v.620\"One who repays an angry man with angerThereby makes things worse for himself.Not repaying an angry man with anger,One wins a battle hard to win.",
    "sn7.3:4": "v.621\"He practises for the welfare of both—His own and the other's—When, knowing that his foe is angry,He mindfully maintains his peace.",
    "sn7.3:5": "v.622\"When he achieves the cure of both—His own and the other's—The people who consider him a foolAre unskilled in the Dhamma.\"[n.438a] Be and Ee1 & 2 read pāda a:ubhinnaṁ tikicchantanaṁ,whichSpk(Be) includes in the lemma and glossesubhinnaṁ tikicchantaṁ,adding: \"Or the latter is itself the reading.\" In Se and Spk (Se) the readings are exactly the reverse. As the sense requires an accusative singular, the reading ubhinnaṁ tikicchantaṁ taṁ, found atTh 444a, offends against neither grammar nor metre. Ee2 has adopted this reading for the exact parallel v.882below, but strangely reverts toubhinnaṁ tikicchantanaṁin the third parallel, v.891.sn.i.164",
    "sn7.3:6": "When this was said, the brahmin Asurindaka Bharadvaja said to the Blessed One: \"Magnificent, Master Gotama! … \" And the Venerable Bharadvaja became one of the arahants."
}