{
    "sn8.9:1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary. Then the Venerable aññā Koṇḍañña, after a very long absence, approached the Blessed One, prostrated himself with his head at the Blessed One's feet, kissed the Blessed One's feet,sn.i.94stroked them with his hands, and announced his name thus: \"I am Koṇḍañña, Blessed One! I am Koṇḍañña, Fortunate One!\"[n.524] The elder's first name is spelled Aññāsi in Be and Ee; here I follow Se and Ee2. He was one of the first five disciples and the very first to obtain comprehension of the Dhamma; it was for this reason that he was given the name \"aññā\" (or \"Aññasi\"), which means \"understanding\" (or \"understood\"). SeeSN56.(V 424,8–). According toSpk, the \"very long absence\" was twelve years, during which he dwelt on the bank of the Mandakini Lotus Pond in the Chaddanta Forest in the Himalayas, a dwelling place favoured by paccekabuddhas. He was fond of seclusion and thus rarely joined the community.",
    "sn8.9:2": "Then the Venerable Vangisa rose from his seat, arranged his upper robe over one shoulder, and, raising his joined hands in reverential salutation towards the Blessed One, said to him: \"An inspiration has come to me, Blessed One! An inspiration has come to me, Fortunate One!\"",
    "sn8.9:3": "v.746\"Enlightened in succession to the Buddha,The elder Koṇḍañña, of strong endeavour,Is one who gains pleasant dwellings,One who often gains the seclusions.[n.525] Enlightened in succession to the Buddha(buddhanubuddho).Spk: First the Teacher awakened to the Four Noble Truths and after him the Elder Koṇḍañña awakened to them. The pleasant dwellings(sukhavihāra)are the \"pleasant dwellings in this present life\"(diṭṭthadhammasukhavihāra), i.e., the jhānas and fruition attainment; the seclusions(viveka)are the three seclusions (of body through physical solitude, of mind through jhāna, and seclusion from the acquisitions by destruction of all defilements).Buddhanubuddhāsavākais used in a more general sense inSN16.5(II 20, 7) with reference to the old generation of enlightened monks.",
    "sn8.9:4": "v.77\"Whatever may be attained by a discipleWho practises the Master's Teaching,All that has been attained by him,One who trained diligently.",
    "sn8.9:5": "v.748\"Of great might, a triple-knowledge man,Skilled in the course of others’ minds—Koṇḍañña, a true heir of the Buddha,Pays homage at the Teacher's feet.\"[n.26] in pāda c we should readbuddhadayadowith Be, Se, and Ee2, as against Ee1buddhāsavāko.Spkstates that although only four abhiññās arementioned, the elder possessed all six. He had come to take leave of the Buddha as he realized the time for his parinibbāna was approaching. After this meeting he returned to the Himalayas and passed away in his hut. The elephants were the first to mourn his death and honoured him by escorting his body in procession across the Himalayas. Then the devas built a casket for the body and passed it up through the various celestial realms so the devas and brahmas could pay final homage to him, after which the casket was returned to earth for the cremation. The remains were brought to the Buddha, who placed them in a cetiya, \"and even today, it is said, that cetiya still stands.\""
}