{
    "sn8.8:1": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park, together with a great Saṅgha of bhikkhus, with ,250 bhikkhus. Now on that occasion the Blessed One was instructing, exhorting, inspiring, and gladdening the bhikkhus with a Dhamma talk concerning Nibbāna. And those bhikkhus were listening to the Dhamma with eager ears, attending to it as a matter of vital concern, directing their whole mind to it.",
    "sn8.8:2": "Then the Venerable Vangisa rose from his seat, arranged his upper robe over one shoulder, and, raising his joined hands in reverential salutation towards the Blessed One, said to him: \"An inspiration has come to me, Blessed One! An inspiration has come to me, Fortunate One!\"",
    "sn8.8:3": "v.78\"Over a thousand bhikkhus hereAttend upon the Fortunate OneAs he teaches the dust-free Dhamma,Nibbāna inaccessible to fear.[n.518]Spk: Nibbāna is called \"inaccessible to fear\" (akutobhayaṁ,lit. \"no fear from anywhere\") because there is no fear from any quarter in Nibbāna, or because there is no fear from any quarter for one who has attained Nibbāna. More typically,akutobhayais used as a personal epithet of the Buddha or an arahant, as atDhp 196,Th 289, andThī ; see EV I, n. to 289. Even in the present case we cannot be certain that the expression is not used in apposition to the Buddha rather than to Nibbāna, as both are accusative singulars, but I follow Spk.",
    "sn8.8:4": "v.739\"They listen to the stainless DhammaTaught by the Perfectly Enlightened One.The Enlightened One indeed shinesHonoured by the Bhikkhu Saṅgha.",
    "sn8.8:5": "v.740\"O Blessed One, your name is ‘nāga,’The best seer of the seers.Like a great cloud bearing rainYou pour down on the disciples.[n.19] On nāga see n. 84.Spkexplains the ambiguous expressionisinaṁ isisattamoas \"the seventh seer of the seers beginning with Vipassī,\" referring to the lineage of the seven Buddhas. Spk-pṭ offers, besides this explanation, an alternative based onsattamaas the superlative ofsant:\"He is the best, the highest, the supreme(sattamo uttaro(sic: readuttamo?)seṭṭho)of seers including paccekabuddhas, Buddhist disciples, and outside seers.\" I agree with Norman that this second alternative is more likely to be correct; see EV I, n. to 1240.sn.i.193",
    "sn8.8:6": "v.741\"Having emerged from his daytime abodeFrom a desire to behold the Teacher,Your disciple Vangisa, O great hero,Bows down in worship at your feet.\"",
    "sn8.8:7": "\"Had you already thought out these verses, Vangisa, or did they occur to you spontaneously?\"[n.520] The contrast is betweenpubbe parivitakkitaandṭhanaso paṭibhanti.Spkexplains that the Buddha asked this question because other bhikkhus had been criticizing Vangīsa, thinking that he neglected study and meditation and passed all his time composing verses. The Master wanted to make them recognize the excellence of his spontaneous ingenuity(paṭibhanasampatti).",
    "sn8.8:8": "v.742\"Having overcome the deviant course of Māra's path,You fare having demolished barrenness of mind.Behold him, the releaser from bondage,Unattached, dissecting into parts.[n.521]Spk: The deviant course of Māra's path(ummaggapathaṁ Mārassa)refers to the emergence of the hundreds of defilements, called a path because they are the path into the round of existence.On barrenness of mind(khila)see n. 500. Inpavibhajjaṁ,with Se and Ee1 & 2. Be readspavibhajaṁ.Spk glosses asvibhajantaṁ,an accusative present participle, but Norman suggestspavibhajjaṁmay be an absolutive with-ṁadded, and Spk mentions a v.l.pavibhajja,a clear absolutive. Spk paraphrases: \"who analyses the Dhamma by way of such groups as the establishments of mindfulness,\" etc. The explanation sounds contrived, but it is difficult to determine the original meaning.",
    "sn8.8:9": "v.743\"For the sake of leading us across the floodYou declared the path with its many aspects.The seers of Dhamma stand immovableIn that Deathless declared by you.[n.522] in pāda c, Be readstasmiṁ cein text, while Ee2 hastasmiṁ ca,whichSpk(Be) reads in the lemma (but not in the text); the latter is the reading atTheragatha 1252. Norman, on metrical grounds, suggests amending the latter totamhi caortasmi(ṁ)ca. Se and Ee1 havetasmiṁ te,which Spk (Se) has in the lemma. Spk glosses withtasmiṁ tena akkhate amate(Be and Se concur). Since here the aoristakkhasican be taken as either second person or third person, I translate on the supposition that the second person is intended, which is consistent withcarasiin the previous verse.Th1242hascarati,which justifies the translation of the parallel verse in that work as a third person. I also taketeto be the enclitic fortayarather thantena.I understand the clause to be a true locative rather than a locative absolute and take \"the Deathless\" here to be a contraction of \"the path to the Deathless,\" alluded to in pāda b. This has the support of Spk-pṭ, which says: amateakkhate ti amatavahe dhamme desite,\"‘In that Deathless declared’ means in that Dhamma taught (by you) which brings the Deathless.\"",
    "sn8.8:10": "v.744\"The light-maker, having pierced right through,Saw the transcendence of all stations;Having known and realized it himself,He taught the chief matter to the five.[n.523] (He) saw the transcendence of all stations(sabbaṭṭhitinam atikkamam addasa).Spk: \"He saw Nibbāna, the transcendence of all the standpoints of views and of all the stations of consciousness.\" Six standpoints of views ((diṭṭhiṭṭhāna)are mentioned atMN1; eight at Paṭis I 138,14–26). Four stations of consciousness(viññāṇaṭṭhiti)are atDN22, seven atDN33; see tooSN22.54.Spk: The chief matter(agga)is the supreme Dhamma; or if the v.l.aggeis adopted, the meaning is: at the beginning, first of all. The five (dasaddhanaṁ,lit. \"half of ten\") are the bhikkhus of the group of five (i.e., the first five disciples). Thus the meaning is: He taught the chief Dhamma to the five bhikkhus, or he taught the five bhikkhus at the beginning (of his ministry).",
    "sn8.8:11": "v.745\"When the Dhamma has been so well taught,What negligence is there for those who understand it?Therefore, living diligent in the Blessed One's Teaching,One should always reverently train in it.\""
}