{
    "sn8.1:1": "Thus have I heard.[n.484] His verses are atTh 209–79. Vv. 707–57 are parallel toTh 209–62, but with variant readings and major differences especially in the verses corresponding to vv.753–57. The verses are collected and translated in Ireland,Vaṅgīsa: An Early Buddhist Poet.For the resolution of philological problems posed by these verses I have relied largely upon Norman's notes in EV I.On one occasion the Venerable Vangisa was dwelling at Aḷavi at the Aggaḷava Shrine together with his preceptor, the Venerable Nigrodhakappa.[n.485]Cetiyasare memorial shrines, similar to stūpas, originally made from mounds of earth.Spk: Before the Buddhas arise the shrines such as Aggaḷava and Gotamaka are the haunts of yakkhas and nāgas, etc., but when Buddhas arise people drive the spirits away and build monasteries there.Now on that occasion the Venerable Vangisa, newly ordained, not long gone forth, had been left behind as a caretaker of the dwelling.",
    "sn8.1:2": "v.707\"Alas, though I am one who has renounced,Gone from home into homelessness,These thoughts still run over me,Impudent thoughts from the Dark One.[n.487] From the Dark One(kaṇhato).Spk: \"From the dark faction, the faction of Māra.\" Māra is addressed as Kaṇha in the refrain of the verses atMN I 337–38.",
    "sn8.1:3": "v.708\"Even if mighty youths, great archers,Trained men, masters of the bow,A thousand such men who do not fleeShould surround me on all sides,[n.488]Spkexplainsuggaputtain pāda a as the powerful and royal sons of aristocrats(uggatanaṁ putta mahesakkha rajaññabhūta). CPD, s.v. ugga, says they are members of the ugga caste, a mixed caste sprung from a kṣatriya father and a śūdra mother. Members of this caste, it seems, served as police, guards, and professional soldiers. Spk glossesdaḷhadhamminoas \"those of firm bows bearing a teacher's bow of the maximum size\"(daḷhadhanuno uttamapamaṇaṁ acariyadhanuṁ dharayamana); see n.181above, II, n. 65, and EV I, n. to 1210. With Spk, I takeapalayinaṁas a metrically shortened genitive plural used in apposition tosahassaṁ,not as an accusative singular. Spk paraphrases pāda d:te samanta sarehi parikireyyuṁ;\"they might surround (me) with arrows on all sides.\" Although Spk-pṭ glossesparikireyyuṁwithvijjheyyuṁ,\"they might shoot,\" the use of the expressionsamanta parikiriṁsuat Ja VI 592,11–15 clearly shows thatparikireyyuṁdoes not imply shooting. (The wrong spellingparikaraṁsuin Ee of Ja should be corrected toparikiriṁsuas in Be: Ja II 72, vv. 241–5.) The commentary (Ja VI 589,5) glosses the word withparivarayiṁsu,\"to accompany (as members of a retinue).\"",
    "sn8.1:4": "v.709And if women were to come hereStill more numerous than this,They would never make me trembleFor I stand firmly in the Dhamma.[n.89] I read pāda d with Ee1 asdhamme s’ amhi patiṭṭhitoand takes’ amhito be a conjunct ofso amhi,withsofunctioning as the first person pronoun, a common enough form in Pali. Ee2 supports this with its readingdhamme sv amhi patiṭṭhito.The whole expressiondhamme s’ amhi patiṭṭhitowould then be a nominative periphrastic construction, with the word order inverted in compliance with the metre.Th 1211can also support this interpretation if read, as Norman suggests, asdhamme svamhi.Be and Se, however, have the accusativepatiṭṭhitaṁ,apparently in apposition tomaṁin pāda c. Commenting on the basis of this reading,Spkexplainsdhamme samhias meaningsake sasanadhamme,\"in my own Dhamma teaching,\" withsamhiunderstood as the locative singular ofsa< Sktsva.While this interpretation at first sight seems strained, we do findsehi dhammehiatSn 298, glossed by Pj II 319,16 assakehi carittehi.This shows that the reading accepted by Spk is feasible, though less plausible than the alternative.Spk connects the simile with this verse thus: \"If a thousand archers were to shoot arrows all around, a trained person might take a staff and knock down all the arrows in flight before they strike him, bringing them to his feet. One archer cannot shoot more than one arrow at a time, but these women each shoot five arrows at a time, by way of form and the other sense objects. If more than a thousand of these were to shoot in such a way, still they would not be able to shake me.\"sn.i.186",
    "sn8.1:5": "v.710\"I have heard this as a witnessFrom the Buddha, Kinsman of the Sun:The path leading to Nibbāna—That is where my mind delights.[n.490]Spkexplainsmaggaṁin pāda c as a transformation of case(lingavipallasa). Spk: \"This statement refers to insight(vipassanā); for that is the preliminary phase of the path leading to Nibbāna. His mind delights in his own tender insight called the path leading to Nibbāna.\"",
    "sn8.1:6": "v.711\"If, while I am dwelling thus,You approach me, Evil One,I will act in such a way, O Death,That you won’t even see my path.\"[n.491]Spk: \"I will so act that you will not even see the path I have gone along among the realms of existence, modes of origin, etc.\" See vv.49(=105),479,494."
}