{
    "sn8.10:1": "On one occasion the Blessed One was dwelling at Rājagaha on the Black Rock on the Isigili Slope, together with a great Saṅgha of bhikkhus, with five hundred bhikkhus all of whom were arahants. Thereupon the Venerable Mahāmoggallāna searched their minds with his own mind (and saw that they were) released, without acquisitions.",
    "sn8.10:2": "Then the Venerable Vangisa rose from his seat, arranged his upper robe over one shoulder, and, raising his joined hands in reverential salutation towards the Blessed One, said to him: \"An inspiration has come to me, Blessed One! An inspiration has come to me, Fortunate One!\"",
    "sn8.10:3": "v.749\"While the sage is seated on the mountain slope,Gone to the far shore of suffering,His disciples sit in attendance on him,Triple-knowledge men who have left Death behind.",
    "sn8.10:4": "v.750\"Moggallana, great in spiritual power,Encompassed their minds with his own,And searching (he came to see) their minds:Fully released, without acquisitions!",
    "sn8.10:5": "v.71\"Thus those perfect in many qualitiesAttend upon Gotama,The sage perfect in all respects,Gone to the far shore of suffering.\"[n.27] In all eds. of SN andTh 121the text here readssabbaṅgasampannaṁin pāda a andanekakarasampannaṁin pāda c, both accusative singulars set in apposition to the Buddha. This reading is doubtlessly ancient, for it is commented on as such by bothSpkand Th-a. It is puzzling, however, that after having been described as \"perfect in all respects\" the Buddha should then be described as \"perfect in many qualities\"—almost as if his excellence is being diminished. I have accepted VĀT's ingenious solution to this problem: amending the compound in pāda c to a nominative plural,anekakarasampanna,which then becomes a description, altogether apt, of the triple-knowledge arahants attending on the Buddha. These are the subject ofpayirūpasanti,whileGotamaṁremains the object, still qualified assabbaṅgasampannaṁ.Note that atTh 118canekakarasampanneis used with reference to Sāriputta on the occasion of his parinibbāna; significantly, that verse mirrors v.610(SN I 18=DN II 17), recited at the Buddha’s parinibbāna, extolling the Master assabbakaravarūpete,\"perfect in all excellent qualities.\""
}