{
    "sn8.5:1": "At Sāvatthī.[n.507] The entire sutta is atSn III, 3 (pp. 78–79).There the Blessed One addressed the bhikkhus thus: \"Bhikkhus!\"",
    "sn8.5:2": "\"Bhikkhus, when speech possesses four factors, then it is well spoken, not badly spoken, and it is blameless, not blameworthy among the wise. What four? Here, bhikkhus, a bhikkhu speaks only what is well spoken, not what is badly spoken. He speaks only on the Dhamma, not on non-Dhamma.sn.i.189He speaks only what is pleasant, not what is unpleasant. He speaks only what is true, not what is false. When speech possesses these four factors, it is well spoken, not badly spoken, and it is blameless, not blameworthy among the wise.\"[n.508] The Buddha’s statement seems partly redundant by making well spoken(subhasita)one among four factors of well-spoken speech.Spkproposes a solution by first defining well-spoken speech in the wider sense as speech that brings benefit, and by then correlating the four factors of well-spoken speech with the four aspects of right speech—being truthful, conducive to harmony, gentle, and meaningful. Well-spoken speech in the narrower sense is identified with speech that promotes harmony. AtAN III 43,7–44,6well-spoken speech is defined by way of five different factors all external to itself: it is spoken at the proper time, is truthful, gently stated, beneficial, and spoken with a mind of lovingkindness.",
    "sn8.5:3": "v.726\"What is well spoken, the good say, is foremost;Second, speak Dhamma, not non-Dhamma;Third, speak what is pleasant, not unpleasant;Fourth, speak the truth, not falsehood.\"",
    "sn8.5:4": "Then the Venerable Vangisa rose from his seat, arranged his upper robe over one shoulder, and, raising his joined hands in reverential salutation towards the Blessed One, said to him: \"An inspiration has come to me, Blessed One! An inspiration has come to me, Fortunate One!\"[n.509] See n.227.",
    "sn8.5:5": "v.727\"One should utter only such speechBy which one does not afflict oneselfNor cause harm to others:Such speech is truly well spoken.",
    "sn8.5:6": "v.728\"One should utter only pleasant speech,Speech that is gladly welcomed.When it brings them nothing evilWhat one speaks is pleasant to others.",
    "sn8.5:7": "v.29\"Truth, indeed, is deathless speech:This is an ancient principle.The goal and the Dhamma, the good say,Are established upon truth.[n.510]Spk: \"‘Truth, indeed, is deathless speech’(saccaṁ ve amata vaca)means that the Buddha’s speech is similar to the Deathless because of its goodness (sadhubhavena, Be; or its sweetness, if we readsadubhavenawith Se and Ee); or it is deathless because it is a condition for attaining Nibbāna the Deathless.\" The former explanation indicates that the text is playing upon the two meanings of amata, \"deathless\"(= Nibbāna)and \"ambrosia,\" in Vedic mythology the drink of the immortal gods.Spk remarks on pādas cd: \"Being established in truth they were established in the goal (or the good) of oneself and others; being established in the goal (the good), they were established in the Dhamma. Or else, sacca is to be taken as an adjective (= true) qualifying the goal and the Dhamma.\"Spk's explanation presupposes that the threenouns—sacce, atthe,anddhamme—are proper locatives andahuan aorist ofhonti(= ahū). Based on the work of Lüders, Norman suggests (at EV I, n. to 1229) thatattheanddhammewere originally nominatives in an Eastern dialect that had the nominative singular in-e, and were then mistaken for locatives in the process of \"translation\" into Pali. I follow Norman in my rendering of the line. In the BHS version (Uv 8:14) the translation went in the opposite direction: intosatyaṁas a nominative andartheanddharmeas locatives.",
    "sn8.5:8": "v.730\"The secure speech which the Buddha uttersFor the attainment of Nibbāna,For making an end to sufferingIs truly the foremost speech.\"[n.511]Spk-pṭ: \"Since the Buddha speaks for the sake of security(khemaya), his speech is ‘secure,’ as it is the cause for the arising of security. Thus it is the foremost speech.\""
}