{
    "sn8.7:1": "On one occasion the Blessed One was dwelling at Sāvatthī in the Eastern Park in the Mansion of Migara's Mother together with a great Saṅgha of bhikkhus, with five hundred bhikkhus, all of them arahants. Now on that occasion—the Uposatha day of the fifteenth—the Blessed One was sitting in the open surrounded by the Bhikkhu Saṅgha in order to hold the Pavaraṇa.[n.53] The Uposatha is the Buddhist \"observance day,\" held in accordance with the phases of the moon. The major Uposathas occur on the full-moon and new-moon days, the fifteenth of the fortnight (except six times per year—two for each of the three seasons of the Indian calendar—when the Uposatha falls on the new-moon day of a shorter, fourteen-day fortnight). On these days the bhikkhus normally gather to recite the Pāṭimokkha, the code of monastic rules. At the end of the annual rains residence(vassavasa), however, the recital of the rules is replaced by a ceremony called the Pavaraṇa, the Invitation, at which each bhikkhu in order of seniority invites(pavareti)the other bhikkhus in his fraternity to point out any misconduct on his part.Then, having surveyed the silent Bhikkhu Saṅgha, the Blessed One addressed the bhikkhus thus: \"Come now, bhikkhus, let me invite you: Is there any deed of mine, either bodily or verbal, which you would censure?\"",
    "sn8.7:2": "When this was said, the Venerable Sāriputta rose from his seat, arranged his upper robe over one shoulder, and, raising his joined hands in reverential salutation towards the Blessed One, said to him: \"Venerable sir, there is no deed of the Blessed One, either bodily or verbal, that we censure.sn.i.191For, venerable sir, the Blessed One is the originator of the path unarisen before, the producer of the path unproduced before, the declarer of the path undeclared before. He is the knower of the path, the discoverer of the path, the one skilled in the path. And his disciples now dwell following that path and become possessed of it afterwards.[n.514] On the Buddha as the originator of the path, seeSN.58.And I, venerable sir, invite the Blessed One: Is there any deed of mine, either bodily or verbal, which the Blessed One would censure?\"",
    "sn8.7:3": "\"There is no deed of yours, Sāriputta, either bodily or verbal, that I censure. For you, Sāriputta, are wise, one of great wisdom, of wide wisdom, of joyous wisdom, of swift wisdom, of sharp wisdom, of penetrative wisdom. Just as the eldest son of a wheel-turning monarch properly keeps in motion the wheel (of sovereignty) set in motion by his father, so do you, Sāriputta, properly keep in motion the Wheel of Dhamma set in motion by me.\"[n.515] The eulogy of Sāriputta is atSN2.29; see too n.184. The wheel-turning monarch(raja cakkavatti)is the ideal world-ruler of Buddhist tradition; seeDN III 59–6andMN III 172–77.",
    "sn8.7:4": "\"If, venerable sir, the Blessed One does not censure any deed of mine, bodily or verbal, does he censure any deed, bodily or verbal, of these five hundred bhikkhus?\"",
    "sn8.7:5": "Then the Venerable Vangisa rose from his seat, arranged his upper robe over one shoulder, and, raising his joined hands in reverential salutation towards the Blessed One, said to him: \"An inspiration has come to me, Blessed One! An inspiration has come to me, Fortunate One!\"",
    "sn8.7:6": "v.734\"Five hundred bhikkhus have gathered today,The fifteenth day, for purification—Untroubled seers who have ended renewed existence,Who have cut off all fetters and bonds.sn.i.192",
    "sn8.7:7": "v.35\"Just as a king, a wheel-turning monarch,Accompanied by his ministers,Travels all over this mighty earthBounded by the deep dark ocean—",
    "sn8.7:8": "v.736So they attend on the victor in battle,The unsurpassed caravan leader—The disciples bearing the triple knowledge,Who have left Death far behind.[n.517] On the wheel-turning monarch see n.515.Spkexplains that the Buddha is the victor in battle(vijitasaṅgamaṁ)because he has won the battle against lust, hatred, and delusion, and because he has triumphed over the army of Māra. He is the caravan leader(satthavaha)because he leads beings across the desert of saṁsara on the chariot of the Noble Eightfold Path.",
    "sn8.7:9": "v.737\"All are true sons of the Blessed One,Here no worthless chaff is found.I worship the Kinsman of the Sun,Destroyer of the dart of craving.\""
}