{
    "sn8.12:1": "On one occasion the Venerable Vangīsa was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the Venerable Vangīsa had only recently attained arahantship and, while experiencing the happiness of liberation, on that occasion he recited these verses:[n.528] Vv. 753–57 are considerably more compressed than the partly parallel verses atTh 253–67. For a concise comparison of the two versions, see Ireland,Vaṅgīsa,pp. 7-8.",
    "sn8.12:2": "v.753\"Drunk on poetry, I used to wanderFrom village to village, town to town.Then I saw the Enlightened OneAnd faith arose within me.[n.59]Kaveyyamatta,\"drunk on poetry,\" occurs atSN4.13 verse 3.Spkrelates here the story of Vangīsa's first meeting with the Buddha, also found at Dhp-a IV 6–8. According to this story, Vangīsa had been a wandering brahmin who earned his living by tapping the skulls of dead men and declaring their place of rebirth. When he met the Buddha, the Master presented him with several skulls, including the skull of an arahant. Vangīsa could guess correctly the rebirth of the deceased owners of the other skulls, but when he came to the arahant he was baffled. He entered the Saṅgha for the purpose of learning how to determine an arahant's realm of rebirth, but soon thereafter discarded this aim when he realized the holy life was lived for a nobler purpose.",
    "sn8.12:3": "v.754\"He then taught me the Dhamma:Aggregates, sense bases, and elements.Having heard the Dhamma from him,I went forth into homelessness.",
    "sn8.12:4": "v.755\"Indeed, for the good of many,The sage attained enlightenment,For the bhikkhus and bhikkhunisWho have reached and seen the fixed course.[n.530] If this verse seems narrowly monastic in focus, its counterpartTh 1265–66corrects the imbalance by mentioning all four classes of disciples:Indeed, for the good of manyThe Tathāgatas arise,For the women and menWho practise their teaching.For their sake indeedThe sage attained enlightenment,For the bhikkhus and bhikkhunīsWho have reached and seen the fixed course.Pāda d reads:ye niyāmagataddasā.Spk glosses:ye niyāmagatā c’ eva niyāmadasā ca;“who have reached the fixed course and seen the fixed course.” Spk-pṭ: “The bhikkhus and bhikkhunīs who are noble disciples of the Buddha have ‘reached the fixed course’ by abiding in the fruit and have ‘seen the fixed course’ by abiding in the path.”Niyāmahere no doubt representssammattaniyāma,“the fixed course of rightness,” i.e., the supramundane path; see 25:1-10 and III, n. 268.",
    "sn8.12:5": "v.76\"Welcome indeed has it been for me,My coming into the Buddha’s presence.The three knowledges have been obtained,The Buddha’s Teaching has been done.",
    "sn8.12:6": "v.757\"I know now my past abodes,The divine eye is purified.A triple knowledge man, attained to spiritual powers,I am skilled in the course of others’ minds.\"[n.531]Spk: Although the divine ear is not mentioned it should be included. Thus he was a great disciple who had attained the sixabhiññās."
}