{
    "sn8.4:1": "On one occasion the Venerable Ānanda was dwelling at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the morning, the Venerable Ānanda dressed and, taking bowl and robe, entered Sāvatthī for alms with the Venerable Vangisa as his companion. Now on that occasion dissatisfaction had arisen in the Venerable Vangisa; lust had infested his mind.[n.50]Spk: Once, when the Venerable Ānanda was invited to the royal palace to teach the Dhamma to the womenfolk, he brought along Vangīsa, then newly ordained, as his companion. When Vangīsa saw the women, beautifully attired in their best ornaments, lust infested his mind, and at the first opportunity he revealed his distress to Ānanda. Vism 38 (Ppn :03), which cites the verses (though in a different sequence), relates that Vangīsa had become overpowered by lust when he caught sight of a woman on his alms round soon after going forth. A Skt version of the same story, with the verses, is cited in Enomoto, CSCS, pp. 44–45.Then the Venerable Vangisa addressed the Venerable Ānanda in verse:",
    "sn8.4:2": "v.71\"I am burning with sensual lust,My mind is engulfed by fire.Please tell me how to extinguish it,Out of compassion, O Gotama.\"[n.50] He addresses Ānanda as \"Gotama\" because Ānanda was a member of the Gotama clan. Here there is surely a word play onnibbapana(and onnibbapehiin v.73c) as meaning both the extinguishing of a fire and the attainment of Nibbāna.",
    "sn8.4:3": "v.722\"It is through an inversion of perceptionThat your mind is engulfed by fire.Turn away from the sign of beautyProvocative of sensual lust.[n.50] Vv . 722 and 724–25, though spoken by Ānanda, are included among Vangīsa's verses as1224–26.The \"inversion of perception\"(saññaya vipariyesa)is fourfold: perceiving permanence, happiness, selfhood, and beauty in what is actually impermanent, suffering, nonself, and foul; seeAN II 52,4–7.",
    "sn8.4:4": "v.723\"See formations as alien,As suffering, not as self.Extinguish the great fire of lust;Don’t burn up again and again.[n.50] The verse is not found in Th proper, but occurs in the text of Th cited in ThA, though without comment. The idea expressed in pādas ab is atTh 1160–61, ascribed to Mahāmoggallāna.",
    "sn8.4:5": "v.724\"Develop the mind on foulness,One-pointed, well concentrated;Apply your mindfulness to the body,Be engrossed in revulsion.[n.0] AtSn II, 11 (pp. 8–9)both this verse and the next are included in the Buddha’s advice to his son Rahula. The meditation on foulness(asubha)is the contemplation of the parts of the body, as atSN1.20(V 278,6–14), or the cemetery meditations, as at46:7–61.",
    "sn8.4:6": "v.725\"Develop meditation on the signless,And discard the tendency to conceit.Then, by breaking through conceit,You will be one who fares at peace.\"[n.50] The signless(animitta), according toSpk, is insight(vipassanā), so called because it strips away the \"signs\" of permanence, etc."
}