{
    "sn8.2:1": "On one occasion the Venerable Vangisa was dwelling at Aḷavi at the Aggaḷava Shrine together with his preceptor, the Venerable Nigrodhakappa. Now on that occasion, when the Venerable Nigrodhakappa returned from his alms round, after his meal he would enter the dwelling and would come out either in the evening or on the following day.",
    "sn8.2:2": "v.71\"Having abandoned discontent and delightAnd household thoughts entirely,One should not nurture lust towards anything;The lustless one, without delight—He is indeed a bhikkhu.[n.49]Spk: Discontent and delight(aratiñ ca ratiñ ca): discontent with the dispensation (Spk-pṭ: dissatisfaction with the fulfilment of virtue and the development of serenity and insight) and delight in the cords of sensual pleasure. Household thoughts(gehasitañ ca vitakkaṁ): having abandoned in all ways evil thoughts connected with \"the household,\" i.e., with the five cords of sensual pleasure.The next couplet plays upon the double meaning ofvanatha;see n.474. Spk glossesvanathaṁaskilesamahāvanaṁ,\"the great woods of defilements,\" andnibbanathoasnikkilesavano,\"without the woods of defilements.\" The last word in pāda d is readaratoin Be, Se, and Ee, but in Ee1 asanato,\"uninclined.\" Spk (both Be and Se) readsaratoin the lemma and glossestaṇhāratirahito,\"devoid of delight on account of craving,\" butanatoandnatiwould also fit the lemma and gloss respectively, asnatitoo is a synonym fortaṇhā.The reading atTh 114isavanatho,which expresses virtually the same idea asnibbanatho.",
    "sn8.2:3": "v.71\"Whatever exists here on earth and in space,Comprised by form, included in the world—Everything impermanent decays;The sages fare having pierced this truth.[n.49]Kiñcishould be brought into pāda b (as atTh 1215) and connected semantically withyamin pāda a.Spkexplainsjagatogadhaṁin pāda b as what existswithinthe earth, e.g., in the realm of the nāgas, but I take the expression in a wider sense, supported by Th-a III 190,4–5, which glosses: \"Whatever is mundane, conditioned, included in the three realms of existence.\" \"Everything impermanent decays(parijiyati sabbam aniccaṁ)\"—this, says Spk, was \"the elder's great insight\"(mahavipassanā).",
    "sn8.2:4": "v.71\"People are tied to their acquisitions,To what is seen, heard, sensed, and felt;Dispel desire for this, be unstirred:They call him a sageWho clings to nothing here.[n.9]Spkidentifies the upadhi in pāda a as the \"acquisitions\" of the aggregates, defilements, and volitional formations; see n.21. No explanation is given for the exclusion of \"acquisitions as sensual pleasures\"(kamūpadhi)which the context seems to allow, indeed even to require. In commenting on pāda b, Spk sayspaṭigha,\"the sensed,\" comprises odour and taste, whilemuta,\"the felt,\" denotes the tactile object. Th-a III 190,15–20 inverts the explanation:paṭighais glossed asphoṭṭhabba,andmutaasgandha-rasa.The familiar tetrad isdiṭṭha, suta, muta,andviññata(seeSN35.95; IV 73,–7); the commentaries explainmutaas comprising odour, taste, and the tactile object, andviññataas mental objects. Norman translatesmutaas thought (its original sense), implying that this tetrad corresponds to the more familiar one, withpaṭighaassuming the usual role ofmutaand the latter serving in place ofviññata.In deference to Spk and Th-a, I prefer to translate the present tetrad in a way that comprises only the five external sense bases and thus as signifying the five cords of sensual pleasure.sn.i.187",
    "sn8.2:5": "v.71\"Then those caught in the sixty,Led by their own thoughts—There are many such among the peopleWho have settled on wrong doctrine:One who would not join their faction anywhere,Nor utter corrupt speech—he is a bhikkhu.[n.49] The readings of pāda ab vary among the different eds. I prefer that of Ee2: Atha saṭṭhisita savitakka/Puthū janataya adhammaniviṭṭha. The metre is irregular Vegavati.The verse is obscure and evidently challenged the ingenuity of the commentators.Spkparaphrases: \"Then many unrighteous thoughts attached to the six sense objects have settled upon the people\"(atha cha ārammaṇanissitā puthū adhammavitakkā janataya niviṭṭhā). This explanation is flawed in two respects: (i) it construes the subject asvitakkā,thoughts, when the Pali readsā,abahubbihicompound denoting persons with thoughts; if we takesahere to represent Skt sva rather thansaha,savitakkāmeans those who are led by (or full of) theirownthoughts; (ii) it explainssaṭṭhiascha,six, when it properly means sixty. Th-a III 190,28–31 mentions the opinion held by some commentators thatsaṭṭhisitāis an allusion to the sixty-two views of the Brahmajala Sutta, and the verse does in fact echo the closing simile of that sutta (DN I 4,2–27): \"Just as all large sea creatures are caught in the fisherman's net, so all these speculative thinkers are trapped within this net of sixty-two cases; here they arecaughtwhenever they emerge\"(te imeh’ eva dvasaṭṭhiya vatthūhi antojalikata ettha sita va ummujjamana ummujjanti). In pāda c,vaggagatassashould be resolvedvaggagato assa.Spk takes the line to mean that one should not join the faction of defilements(kilesavagga), but I understand it literally. In fact, atSn 371bwe findvaggagatesu na vaggasari dhiro,\"Among those who are factious, the wise one does not follow a faction.\" Pj II 36,20–24 explains this by reference to the sixty-two speculative views, thus linking it to the present verse. See in this connection GD, p. 217, n. to 371.Pada d readsno pana duṭṭhullabhani sa bhikkhu,which Spk-pṭ explains as an injunction not to speak words connected with sensuality(kāmapaṭisaṁyuttakathā).1217reads hereduṭṭhullagāhi,\"one should not grasp what is corrupt,\" which Th-a explains as referring to the grasping of corrupt views.",
    "sn8.2:6": "v.71\"Proficient, long trained in concentration,Honest, discreet, without longing,The sage has attained the peaceful state,Depending on which he bides his timeFully quenched within himself.\"[n.49]Spkidentifies \"the peaceful state\" (of pāda c) with Nibbāna and paraphrases pāda d thus: \"Fully quenched by the full quenching of defilements in dependence on Nibbāna, he awaits the time of his parinibbāna (Spk-pṭ: the time of the Nibbāna element without residue)\"(nibbana paṭicca kilesaparinibbanena parinibbuto parinibbānakalaṁ anupadisesanibbanakalaṁ agameti)."
}