{
    "sn8.3:1": "On one occasion the Venerable Vangisa was living at Aḷavi at the Aggaḷava Shrine together with his preceptor, the Venerable Nigrodhakappa. Now on that occasion, the Venerable Vangisa, because of his own ingenuity, had been looking down at other well-behaved bhikkhus.[n.497]Spkstates that he prided himself on his learning; however,paṭibhānais used to mean skill in verbal expression and thus probably refers here specifically to Vangīsa's poetic talent.Then the thought occurred to the Venerable Vangisa: \"It is a loss for me indeed, it is no gain for me! It is a mishap for me indeed, it is not well gained by me, that because of my ingenuity I look down upon other well-behaved bhikkhus.\"",
    "sn8.3:2": "v.717\"Abandon conceit, O Gotama,And leave the pathway of conceit entirely.Infatuated with the pathway of conceit,For a long time you’ve been remorseful.[n.498]Asesaṁshould be moved from pāda c into pāda b.Spkexplains \"pathway of conceit\"(manapathaṁ)as the object of conceit and the states coexistent with conceit, but it may be just a metaphorical expression for conduct governed by conceit. Spk says he addressed himself as \"Gotama\" (the Buddha’s clan name) because he is a disciple of the Buddha Gotama, but this is hard to accept; see v.71just below where Ānanda is so addressed because he actually was a member of the Gotama clan. I do not know of any other instance of monks addressing themselves (or others) as \"Gotama\" simply on the ground that they are disciples of the Buddha Gotama.In the next verse we should twice readmānahatāin place of Ee1mānagatā.Th-a glossesmānena hataguṇā,\"with good qualities destroyed by conceit.\"",
    "sn8.3:3": "v.718\"People smeared by denigration,Slain by conceit, fall into hell.People sorrow for a long time,Slain by conceit, reborn in hell.",
    "sn8.3:4": "v.719\"But a bhikkhu never sorrows at all,A path-knower practising rightly.He experiences acclaim and happiness;Truly they call him a seer of Dhamma.[n.99]Spkexplainsmaggajinoin pāda b as a \"path-conqueror,\" i.e., \"one who has conquered defilements by the path,\" but I follow Norman's suggestion (at GD, p. 16, n. to 8) that the word is a variant ofmaggaññu(< Sktmārgajña), formed by resolution with an epenthetic(svarabhakti)vowel rather than by assimilation.sn.i.188",
    "sn8.3:5": "v.720\"Therefore be pliant here and strenuous;Having abandoned the hindrances, be pure.Having entirely abandoned conceit,Be an end-maker by knowledge, peaceful.\"[n.00] Th-a glossesakhiloin pāda a withpañcacetokhilarahito,\"devoid of the five kinds of mental barrenness,\" with reference toMN I 101,9–27. The five are doubt and perplexity about the Buddha, Dhamma, Saṅgha, and training, and anger towards one's co-religionists. This seems preferable to interpreting the word by way of the threekhila—greed, hatred, and delusion (see n.84)—as the fivecetokhilaare said to be obstacles to \"ardour, exertion, persistence, and striving\" and their elimination is thus a prerequisite for strenuous effort.In pāda d,vijjayantakarois a syntactical compound, here with the first member an instrumental or ablative; see n.68. The verse lacks a finite verb, but Th-a says that the verse was spoken by way of self-admonition, and I have therefore supplied imperatives to convey this effect. The verse can be seen as describing a progression: \"First be rid of the five obstacles to striving, then be strenuous. By effort abandon the five hindrances and attain purity of mind through concentration. On this basis, develop insight into nonself and abandon conceit. Thereby you will eradicate the taints by knowledge, make an end to suffering, and dwell in the peace of Nibbāna.\""
}