{
    "sn9.1:1": "Thus have I heard. On one occasion a certain bhikkhu was dwelling among the Kosalans in a certain woodland thicket. Now on that occasion, while that bhikkhu had gone for his day's abiding, he kept on thinking evil unwholesome thoughts connected with the household life.",
    "sn9.1:2": "v.758\"Desiring seclusion you entered the woods,Yet your mind gushes outwardly.Remove, man, the desire for people;Then you’ll be happy, devoid of lust.[n.53] in pāda c, sincevinayassuis a middle voice, second person imperative,jano,though nominative, may function as a vocative lengthened to fit the metre.Spkseems to support this with its gloss:tvaṁ jano aññasmiṁ jane chandarāgaṁ vinayassu;\"you, a person, remove desire and lust for other people.\" The sentiment of this verse is echoed byTh 149–50.",
    "sn9.1:3": "v.759\"You must abandon discontent, be mindful—Let us remindyouof thatwayof the good.Hard to cross, indeed, is the dusty abyss;Don’t let sensual dust drag you down.[n.5] I read pādas ab with Ee1:Aratiṁ pajahasi so sato/Bhavasi sataṁ taṁ sarayamase.Norman understands the metre as irregularVaitalīya(personal communication). Be has the same but without the so in pāda a. The so is probably a third person demonstrative used with a second person verb, a construction already encountered at v.647c. VĀT prefers a reading found among SS, Aratiṁ pajahasi sato bhavasi/Bhavataṁ sataṁ taṁ sarayamase, but sinceSpkand Spk-pṭ do not comment onbhavataṁit seems this word was not in the texts available to the commentators; Ee2 reads as above but omits bhavataṁ . The verbspajahasiandbhavasi,which Spk glosses with the imperativespajahaand bhava, conform to the criteria of the subjunctive, rare and archaic in Pali (see Geiger,Pali Grammar,§12). Se reads the last verb as sadayamase, but sarayamase in the other eds. makes better sense as the subjunctive causative of sarati, to remember > to remind (see Geiger, Pali Grammar, §126).Pāda b is particularly obscure and the commentators seem to have been unsure how to handle it. Spk offers two alternative interpretations ofsataṁ taṁ sarayamase:\"‘Let us also remind you, a mindful one, a wise one (Spk-pṭ: to dispel worldly thoughts whenever they arise)’; or, ‘Let us remind you of the Dhamma of the good ones (Spk-pṭ: of the Dhamma of the good persons for the removal of defilements)’(satimantaṁ paṇḍitaṁ taṁ mayam pi [yathāuppannaṁ vitakkaṁ vinodanaya] sārāyama, sataṁ va dhammaṁ [sappurisānaṁ ilesavigamanadhammaṁ] mayaṁ tam sarayama).\" I have bypassed both alternatives and adopted VĀT′s suggestion that \"you\" is implicit andtaṁis \"that,\" representing the way of the good. In pāda c we should readduttaroover Ee1duruttamo.",
    "sn9.1:4": "v.760\"Just as a bird littered with soilWith a shake flicks off the sticky dust,So a bhikkhu, strenuous and mindful,With a shake flicks off the sticky dust.\"",
    "sn9.1:5": "Then that bhikkhu, stirred up by that devata, acquired a sense of urgency."
}