{
    "sn9.6:1": "On one occasion the Venerable Anuruddha was dwelling among the Kosalans in a certain woodland thicket. Then a certain devata of the Tāvatiṁsa host named Jalini, a former consort of the Venerable Anuruddha, approached him and addressed him in verse:[n.543] Her name Jālinī: “Ensnarer,” is used as an epithet fortaṇhāat v.460a; see too n.278andAN II 2,3. According toSpk,she had been his chief consort in their immediately preceding existence in the Tāvatiṃsa heaven.",
    "sn9.6:2": "v.773\"Direct your mind thereto that realmWhere you dwelt in the pastAmong the Tāvatiṁsa devasFor whom all desires are fulfilled.You will shine forth highly honoured,Surrounded by celestial maidens.\"",
    "sn9.6:3": "v.774\"Miserable are celestial maidensEstablished in identity,And miserable too are those beingsAttached to celestial maidens.\"[n.544]Spk: They are notduggatain the sense that they live in a miserable realm(duggati), for they dwell in a fortunate realm enjoying their success. They are miserable because of their conduct, for when they expire they might be reborn even in hell. In pāda b,sakkāya,\"identity,\" is the compound of the five aggregates of clinging, which are all suffering(dukkha)because of their impermanence. Spk explains that the celestial maidens are \"established in identity\"(sakkāyasmiṁ patiṭṭhita)for eight reasons: because of lust, hatred, delusion, views, the underlying tendencies, conceit, doubt, and restlessness. These are the same as the eight ways beings are \"established in what can be expressed\". OnsakkāyaseeSN22.105, and on the devas being included in sakkāya,SN22.78(III 85,26–28).in pāda d, Be, Se, and Ee2 readdevakaññahi patthita,in pāda d, Be, Se, and Ee2 readdevakanndhi patthita,\"desired by celestial maidens,\" and Ee1devakaññabhipattika.Since p/s confusion is not uncommon in the texts (see EV I, n. to 49), we can infer that the original reading is the one found in SS,devakaññabhisattika,the reading also preferred by CPD.Abhisattikais an adjective formed from the past participle ofabhisajjati,\"to be attached to.\" I am thankful to VĀT for pointing this out to me.",
    "sn9.6:4": "v.775\"They do not know blissWho have not seen Nandana,The abode of the glorious male devasBelonging to the host of Thirty.\"",
    "sn9.6:5": "v.776\"Don’t you know, you fool,That maxim of the arahants?Impermanent are all formations;Their nature is to arise and vanish.Having arisen, they cease:Their appeasement is blissful.",
    "sn9.6:6": "v.777\"Now I will never again dwellAmong the deva host, Jalini!The wandering on in birth is ended:Now there is no more renewed existence.\""
}