{
    "sn9.14:1": "On one occasion a certain bhikkhu was dwelling among the Kosalans in a certain woodland thicket. Now on that occasion, when he had returned from his alms round, after his meal that bhikkhu used to descend into a pond and sniff a red lotus. Then the devata that inhabited that woodland thicket, having compassion for that bhikkhu, desiring his good, desiring to stir up a sense of urgency in him, approached him and addressed him in verse:[n.554] An identical story, including the verses, is at Ja No. 392 (III 307-0), with the Bodhisatta in the role of the bhikkhu.Spk:When she saw the bhikkhu sniff the lotus, the devatā thought: “Having received a meditation subject from the Buddha and entered the forest to meditate, this bhikkhu is instead meditating on the scent of flowers. If his craving for scent increases it will destroy his welfare. Let me draw near and reproach him.”",
    "sn9.14:2": "v.795\"When you sniff this lotus flower,An item that has not been given,This is one factor of theft:You, dear sir, are a thief of scent.\"",
    "sn9.14:3": "v.796\"I do not take, I do not damage,I sniff the lotus from afar;So for what reason do you sayThat I am a thief of scent?[n.555]Spk:Vaṇṇena(in pāda c):karaṇena.See PED, s.v.vaṇṇa(11), and v.SN10.2 p2below.",
    "sn9.14:4": "v.797\"One who digs up the lotus stalks,One who damages the flowers,One of such rough behaviour:Why is he not spoken to?\"[n.556] All four eds. read, in pāda c,akiṇṇakammanto,whichSpkglossesaparisuddhakammanto,\"of impure deed.\" But SS readakhiṇa-, akhiṇa-, and akkhiṇa-,which is acknowledged by Spk as a v.l. and glossedkakkhaḷakammanto,\"of rough deed.\" Spk (Be) readsakhiṇakammanto,Spk (Se)akkhiṇakammanto,which represents more correctly initiala + kh.That this reading is to be preferred toakiṇṇa-is confirmed by v.798a, whereakhiṇaluddowould certainly make much better sense than the given readingakiṇṇaluddho.See Norman, \"Two Pali Etymologies,\"Collected Papers,2:78–79.sn.i.205",
    "sn9.14:5": "v.798\"When a person is rough and fierce,Badly soiled like a nursing cloth,I have nothing to say to him;But it's to you that I ought to speak.",
    "sn9.14:6": "v.799\"For a person without blemish,Always in quest of purity,Even a mere hair's tip of evilAppears as big as a cloud.\"",
    "sn9.14:7": "v.800\"Surely, spirit, you understand me,And you have compassion for me.Please, O spirit, speak to me again,Whenever you see such a deed.\"",
    "sn9.14:8": "v.01\"We don’t live with your support,Nor are we your hired servant.You, bhikkhu, should know for yourselfThe way to a good destination.\"[n.557] in pāda b we should readbhatakamhase,as in Be, Se, and Ee2.Spk: The devata, it is said, thought: \"This bhikkhu might become negligent, thinking he has a deity looking after his welfare. I won’t accept his proposal.\"",
    "sn9.14:9": "Then that bhikkhu, stirred by that devata, acquired a sense of urgency."
}