{
    "sn9.7:1": "On one occasion the Venerable Nagadatta was dwelling among the Kosalans in a certain woodland thicket.[n.545] He is not identified inSpk, and DPPN records nothing about him except what is found in the present sutta.Now on that occasion the Venerable Nagadatta had been entering the village too early and returning too late in the day. Then the devata that inhabited that woodland thicket, having compassion for the Venerable Nagadatta, desiring his good, desiring to stir up a sense of urgency in him,sn.i.20approached him and addressed him in verses:",
    "sn9.7:2": "v.778\"Entering the village early,Returning late in the day,Nagadatta associates too closely with lay folk,Sharing their happiness and suffering.[n.546] I follow the reading of this verse and the next proposed by Alsdorf (inDie Arya-Strophen des Pali-Kanons, pp. 319–0), but with modifications suggested by VĀT (namely, changing Alsdorf's long vocative Nagadatta to the nominative, and the four long vocatives in the second verse to accusatives, as in the printed eds.):Kale pavissa gamaṁ/Nagadatto diva ca agantvaativelacārī saṁsaṭṭho/gahaṭṭhehi samānasukhadukkho.Bhāyāmi Nāgadattaṁ/suppagabbhaṁ kulesu vinibaddhaṁ,mā h’ eva maccurañño/ balavato antakassa vasam esi!“Entering the village too early and returning too late in the day” and “associating closely with lay people and monks in a worldly way” are two of five factors said to lead to a bhikkhu’s falling away from the higher training (AN III 116, 7-117,7). The meaning of the compoundsamānasukhadukkhais explained at :3 (III 11,5-6), though the compound itself does not occur there. The same compound is used atDN III 187,11-15in a positive sense as a characteristic of a true friend.",
    "sn9.7:3": "v.779\"I am afraid for Nagadatta,So impudent, bound to families.Do not come under the End-maker's control,In the gripof the powerful King of Death.\"",
    "sn9.7:4": "Then the Venerable Nagadatta, stirred up by that deity, acquired a sense of urgency."
}