{
    "sn9.5:1": "On one occasion the Venerable Ānanda was dwelling among the Kosalans in a certain woodland thicket. Now on that occasion the Venerable Ānanda was excessively involved instructing lay people.[n.54]Spk: This sutta takes place shortly after the Buddha’s parinibbāna. The Venerable Mahākassapa had enjoined Ānanda to attain arahantship before the first Buddhist council convened, scheduled to begin during the rains retreat. Ānanda had gone to the Kosala country and entered a forest abode to meditate, but when the people found out he was there they continually came to him lamenting over the demise of the Master. Thus Ānanda constantly had to instruct them in the law of impermanence. The devata, aware that the council could succeed only if Ānanda attended as an arahant, came to incite him to resume his meditation.Then the devata that inhabited that woodland thicket, having compassion for the Venerable Ānanda, desiring his good, desiring to stir up a sense of urgency in him, approached him and addressed him in verse:",
    "sn9.5:2": "v.77\"Having entered the thicket at the foot of a tree,Having placed Nibbāna in your heart,sn.i.00Meditate, Gotama, and don’t be negligent!What will this hullabaloo do for you?\"[n.54] AtTh 119the verse is ascribed to one Vajjiputtaka Thera but is not found among Ānanda's own verses in Th.All four eds. read pāda b:Nibbānaṁ hadayasmiṁ opiya.AtTh 119the last word is readosiya,and we should adopt this reading here. I take it as absolutive of the verbosetiproposed by Norman at EV I, n. to 119.Spksupports this with its glosspakkhipitva,\"having placed.\" Spk explains that one deposits Nibbāna in one's heart by way of function(kiccato)and by way of object(arammaṇato): by way of function when one arouses energy with the thought, \"I will attain Nibbāna\"; by way of object when one sits absorbed in a meditative attainment having Nibbāna as its object (i.e., inphalasamāpatti,the attainment of fruition).In pāda d,biḷibiḷikais explained by Spk-pṭ as purposeless activity(atthavirahita pavatta kiriya).The devata refers thus to Ānanda's talk with the lay people because it does not conduce to his attainment of the goal of the holy life.",
    "sn9.5:3": "Then the Venerable Ānanda, stirred up by that deity, acquired a sense of urgency."
}