{
    "sn9.2:1": "On one occasion a certain bhikkhu was dwelling among the Kosalans in a certain woodland thicket.sn.i.98Now on that occasion when that bhikkhu had gone for his day's abiding he fell asleep.[n.534]Spk: It is said that this bhikkhu was an arahant. After returning from a distant alms round he was fatigued and lay down to rest, but he did not actually fall asleep (even though the text says he did!). Thinking that he was lethargic and was neglecting his meditation practice, the devata came to reprove him.Then the devata that inhabited that woodland thicket, having compassion for that bhikkhu, desiring his good, desiring to stir up a sense of urgency in him, approached him and addressed him in verses:",
    "sn9.2:2": "v.761\"Get up, bhikkhu, why lie down?What need do you have for sleep?What slumbercan there befor one afflicted,Stricken, pierced by the dart?",
    "sn9.2:3": "v.762\"Nurture in yourself that faithWith which you left behind the home lifeAnd went forth into homelessness:Don’t come under sloth's control.\"",
    "sn9.2:4": "v.763\"Sensual pleasures are impermanent, unstable,Though the dullard is enthralled with them.When he's free, detached among those bound,Why trouble one gone forth?",
    "sn9.2:5": "v.764\"When, by the removal of desire and lustAnd the transcendence of ignorance,That knowledge has been cleansed,Why trouble one gone forth?[n.36]Spk: \"That knowledge\"(taṁ ñāṇaṁ)is the knowledge of the Four Noble Truths. In pāda a of the next verse I readbhetvawith Se and Ee1 & 2, as againstchetvain Be.",
    "sn9.2:6": "v.75\"When, by breaking ignorance with knowledgeAnd by destruction of the taints,He is sorrowless, beyond despair,Why trouble one gone forth?",
    "sn9.2:7": "v.66\"When he is energetic and resolute,Always firm in his exertion,Aspiring to attain Nibbāna,Why trouble one gone forth?\"[n.53] It seems that while the preceding two verses describe the arahant, this verse describes thesekha,the trainee, who is still striving to attain Nibbāna."
}