{
    "tha19:1094": "Oh, when will I stay in a mountain cave,Alone, with no companion,Discerning all states of existence as impermanent?This hope of mine, when will it be?",
    "tha19:1095": "Oh, when will I stay happily in the forest,A sage wearing a torn robe, dressed in ochre,Unselfish, without desire,With greed, hatred, and delusion destroyed?",
    "tha19:1096": "Oh, when will I stay alone in the wood,Fearless, discerning this body as impermanent,A nest of death and disease,Oppressed by death and old age;When will it be?",
    "tha19:1097": "Oh, when will I live, having grasped the sharp sword of wisdomAnd cut the creeper of craving that tangles around everything,The mother of fear, the bringer of suffering,When will it be?",
    "tha19:1098": "Oh, when will I, seated on the lion’s throne,Swiftly grasp the sword of the sages,Forged by wisdom, of fiery might,And swiftly break Māra and his army? When will it be?",
    "tha19:1099": "Oh, when will I be seen striving in the assembliesBy those who are virtuous, poised, respecting the Dhamma,Seeing things as they are, with faculties subdued?When will it be?",
    "tha19:1100": "Oh, when will I focus on my own goal on Giribbaja mountain,Free of oppression by laziness, hunger, thirst,Wind, heat, insects, and reptiles?When will it be?",
    "tha19:1101": "Oh, when will I havesamādhiand mindfulness,And with understanding attain the four truths,That were realized by the great sage,And are so very hard to see? When will it be?",
    "tha19:1102": "Oh, when will I, devoted to tranquillity,See with understanding the infinite sights,Sounds, smells, tastes, touches, and mental phenomenaAs burning? When will it be?",
    "tha19:1103": "Oh, when will I not be downcastBecause of criticism,Nor elated because of praise?When will it be?",
    "tha19:1104": "Oh when will I discern the aggregatesAnd the infinite varieties of phenomena,Both internal and external, as no more thanWood, grass, and creepers? When will it be?",
    "tha19:1105": "Oh, when will the winter cloud rain freshlyAs I wear my robe in the forest,Walking the path trodden by the sages?When will it be?",
    "tha19:1106": "Oh, when will I rise up, intent on attaining the deathless,Hearing in the mountain caveThe cry of the crested peacock in the forest?When will it be?",
    "tha19:1107": "Oh, when will I cross the Ganges, Yamunā,And Sarasvatī rivers, the Pātāla country,And the dangerous Baḷavāmukha sea,By psychic power, without hindrance? When will it be?",
    "tha19:1108": "Oh, when will I be devoted tojhāna,Rejecting entirely the signs of beauty,Splitting apart desire for sensual pleasures,Like an elephant that wanders without ties;When will it be?",
    "tha19:1109": "Oh, when will I realise the teaching of the great sageAnd be content, like a poor person in debt,Harassed by creditors, who finds a hidden treasure?When will it be?",
    "tha19:1110": "For many years you begged me,\"Enough of living in a house for you!\"Why do you not urge me on, mind,Now I’ve gone forth as an ascetic?",
    "tha19:1111": "Didn’t you beg me, mind,\"On Giribbaja, the birds with colourful wings,Greeting the thunder, Mahinda’s voice,Will delight you as you practicejhānain the forest\"?",
    "tha19:1112": "In my family circle, friends, loved ones, and relatives;And in the world, sports and play, and sensual pleasures;All these I have abandoned for the sake of this:And even then you’re not content with me, mind!",
    "tha19:1113": "This is mine alone, it doesn’t belong to others;When it is time to don your armour, why lament?Reflecting that all this is unstable,I went forth, longing for the deathless state.",
    "tha19:1114": "The methodical teacher, supreme among people,Great physician, charioteer of tractable people, said,\"The mind sways like a monkey,So it’s very hard to control if you are not free of lust.\"",
    "tha19:1115": "Sensual pleasures are diverse, sweet, delightful;Ignorant unenlightened people are attached to them.Seeking to be reborn in another state of existence, they wish for suffering;Led on by their mind, they’re relegated to hell.",
    "tha19:1116": "\"Staying in the grove resounding with criesOf peacocks and herons, and liked by leopards and tigers,Abandon concern for the body, without fail!\"So you used to urge me, mind.",
    "tha19:1117": "\"Develop thejhānas and spiritual faculties,The powers, factors of awakening, andsamādhimeditation;Realise the three knowledges in the teaching of the Buddha!\"So you used to urge me, mind.",
    "tha19:1118": "\"Develop the eight-fold path for realizing the deathless,Emancipating, plunging into the end of all suffering,And cleansing all defilements!\"So you used to urge me, mind.",
    "tha19:1119": "\"Properly reflect on the aggregates as suffering,And abandon that from which suffering arises;Make an end of suffering in this very life!\"So you used to urge me, mind.",
    "tha19:1120": "\"Properly discern that impermanence is suffering,That emptiness is non-self, and that misery is death.Uproot the wandering mind!\"So you used to urge me, mind.",
    "tha19:1121": "\"Bald, unsightly, accursed,Seek alms amongst families, bowl in hand.Devote yourself to the word of the teacher, the great sage!\"So you used to urge me, mind.",
    "tha19:1122": "\"Wander the streets well-restrained,With your mind unattached to families and sensual pleasures,Like the full moon when the night is clear!\"So you used to urge me, mind.",
    "tha19:1123": "\"Be a wilderness-dweller and an alms-eater,One who lives in charnel grounds, a rag-robe wearer,One who never lies down, always delighting in ascetic practices.\"So you used to urge me, mind.",
    "tha19:1124": "Mind, when you urge me towards the impermanent and unstable,You are acting just like a person who plants trees,Then, when they are about to fruit,Wishes to cut down the very same trees.",
    "tha19:1125": "You, incorporeal mind, far-traveller, lone-wanderer:I won’t do your bidding any more.Sensual pleasures are suffering, painful, and very dangerous;I’ll wander with my mind focussed only onnibbāna.",
    "tha19:1126": "I didn’t renounce due to bad luck or shamelessness,Nor because of a whim, nor banishment,Nor for the sake of a livelihood;It was because I agreed to the promise you made, mind.",
    "tha19:1127": "\"Having few wishes, abandoning disparagment,Stilling suffering: these are praised by good people.\"So you used to urge me, mind,But now you continue with your old habits!",
    "tha19:1128": "Craving, ignorance, the loved and unloved,Pretty sights, pleasant feelings,And the delightful kinds of sensual pleasure: I’ve vomited them all;And I can’t swallow back what I’ve vomited up.",
    "tha19:1129": "I’ve done your bidding everywhere, mind!For many births, I haven’t done anything to upset you,Yet you show your gratitude by producing craving inside yourself!For a long time I’ve transmigrated in the suffering you’ve created.",
    "tha19:1130": "Only you, mind, make us holy men;You make us lords or royal sages;Sometimes we become traders or workers;Life as a god is also on account of you.",
    "tha19:1131": "You alone make us titans;Because of you we are born in hell;Then sometimes we become animals,Life as an ghost is also on account of you.",
    "tha19:1132": "Come what may, you won’t betray me again,Dazzling me with your ever-changing display;You play with me like I’m mad —But how have I ever failed you, mind?",
    "tha19:1133": "In the past my mind wanderedHow it wished, where it liked, as it pleased.Now I’ll carefully guide it,As a rutting elephant is guided by a trainer with a hook.",
    "tha19:1134": "The teacher willed that this world appear to meAs impermanent, unstable, insubstantial.Mind, let me leap into the conqueror’s teaching,Carry me over the great flood, so very hard to cross.",
    "tha19:1135": "Things have changed, mind!Nothing could make me return to your control!I’ve gone forth in the teaching of the great sage,Those like me don’t come to ruin.",
    "tha19:1136": "Mountains, oceans, rivers, the earth;The four directions, the intermediate directions, below and in the sky;The three states of existence are all impermanent and troubled —Where can you go to find happiness, mind?",
    "tha19:1137": "Mind, what will you do to someoneWho has made the ultimate commitment?Nothing could make me a followerUnder your control, mind;There’s no way you’d touch a bellowsWith a mouth open at each end;Let alone the body flowing with its nine streams!",
    "tha19:1138": "You’ve ascended the mountain peak, full of nature’s beauty,Frequented by boars and antelopes,A grove sprinkled with fresh water in the rainy-season;And there you’ll be happy in your cave-home.",
    "tha19:1139": "Peacocks with beautiful necks and crests,Colourful tail-feathers and wings,Crying out at the sweet-sounding thunder:They’ll delight you as you practicejhānain the forest.",
    "tha19:1140": "When the sky has rained down,And the grass is four inches high,And the grove is full of flowers, like a cloud,In the mountain cleft, like the fork of a tree, I’ll lie;It will be as soft as cotton-buds.",
    "tha19:1141": "I’ll act as a master does:Let whatever I get be enough for me.I’ll make you as supple,As a good worker makes a cat-skin bag.",
    "tha19:1142": "I’ll act as a master does:Let whatever I get be enough for me.I’ll control you with my energy,As the trainer controls a rutting elephant with a hook.",
    "tha19:1143": "Now that you’re well-tamed and reliable,I can use you, like a trainer uses a straight-running horse,To practice the safe path,Cultivated by those who take care of their minds.",
    "tha19:1144": "I shall strongly fasten you to a meditation subject,As an elephant is tied to a post with firm rope.You’ll be well-guarded by me, well-developed by mindfulness,And unattached to rebirth in all states of existence.",
    "tha19:1145": "You’ll use understanding to cut the follower of the wrong path,Restrain them by practice, and settle them on the right path;And when you have seen the cause of suffering arise and pass away,You’ll be an heir to the greatest teacher.",
    "tha19:1146": "Under the sway of the four distortions, mind,You led me as if all around the world;And now you won’t associate with the great sage of compassion,The cutter of fetters and bonds?",
    "tha19:1147": "Like a deer roaming free in the colourful forest,I’ll ascend the lovely mountain wreathed in cloud,And rejoice to be on that hill, free of folk —There is no doubt you’ll perish, mind.",
    "tha19:1148": "The men and women who live under your will and command,Whatever pleasure they experience,They are ignorant and fall under Māra’s control;Loving life, they’re your disciples, mind."
}