{
    "tha2:121": "No life is permanent,And no conditions last forever.The aggregates are rebornAnd pass away, again and again.",
    "tha2:122": "Knowing this danger,I’m not interested in being reborn into any state of existence.I’ve escaped all sensual pleasures,And attained the end of defilements.",
    "tha2:123": "You can’t live by fasting,But food doesn’t lead to peace of heart.Seeing how the body is sustained by food,I wander, seeking.",
    "tha2:124": "They know it’s a swamp,This worship and homage from respectable families;A subtle dart, hard to pull out;It’s hard for a corrupt person to give up honour.",
    "tha2:125": "A monkey went up to the little hutWith five doors.He circles around, knockingOn each door, again and again.",
    "tha2:126": "Stand still monkey, don’t run!Things are different now;You’ve been caught by wisdom —You won’t go far.",
    "tha2:127": "My hut on the bank of the GangesIs made from three palm leaves.My alms-bowl is a funeral pot,My robe is castoff rags.",
    "tha2:128": "In my first two rainy seasonsI spoke only one word.In my third rainy season,The mass of darkness was torn apart.",
    "tha2:129": "Even someone with the three knowledges,Who has conquered death, and is without defilements,Is looked down on for being unknownBy fools without wisdom.",
    "tha2:130": "But a person who gets food and drinkIs honored by them,Even if they are of bad character.",
    "tha2:131": "When I heard the TeacherSpeaking Dhamma,I wasn’t aware of any doubtIn the all-knowing, unconquered one,",
    "tha2:132": "The caravan leader, the great heroThe most excellent of charioteers.I have no doubtIn the path or practice.",
    "tha2:133": "Just as rain seeps intoA poorly roofed house,Lust seeps intoAn undeveloped mind.",
    "tha2:134": "Just as rain doesn’t seep intoA well roofed house,Lust doesn’t seep intoA well-developed mind.",
    "tha2:135": "Rebirth is ended for me,The conqueror’s instruction is fulfilled,What they call a \"net\" is abandoned,The attachment to being reborn in any state of existence is undone.",
    "tha2:136": "I’ve arrived at the goalFor the sake of which I went forthFrom the home life into homelessness:The ending of all fetters.",
    "tha2:137": "Sages sleep happilyWhen they’re not attached to women;For the truth is hard to find among them,And one must always be guarded.",
    "tha2:138": "Sensual pleasure, you’ve been slain!We’re not in your debt any more.Now we go tonibbāna,Where there is no more sorrow.",
    "tha2:139": "First one kills oneself,Then one kills others.One kills oneself, really dead,Like one who kills birds using a dead bird as a decoy.",
    "tha2:140": "A holy man’s color is not on the outside;A holy man is colored on the inside.Whoever does bad deedsSuch a one is truly dark, Sujampati.",
    "tha2:141": "It is from wishing to learn that learning grows;When you are learned, understanding grows;Through understanding, you know the goal;Knowing the goal brings happiness.",
    "tha2:142": "Make use of secluded lodgings!Practice to be released from fetters!If you don’t find enjoyment there,Live in the Saṅgha, guarded and mindful.",
    "tha2:143": "People who act harshly —Attacking people,Tying them up,Hurting them in all kinds of ways —They’re treated in the same way;Their deeds don’t vanish.",
    "tha2:144": "Whatever deeds a person does,Whether for good or for bad,They are the heir to eachAnd every deed that they perform.",
    "tha2:145": "The days and nights rush by,And then life is cut short.The vitality of mortals wastes away,Like the water in tiny streams.",
    "tha2:146": "But while doing bad deedsThe fool doesn’t realize —It’ll be bitter later on;Yes, his ripening will be bad.",
    "tha2:147": "If someone lost in the middle of the ocean,Were to clamber up on a little log, they’d sink;In the same way, even a good person would sinkIf they rely on a lazy person.So avoid those who are lazy, lacking energy.",
    "tha2:148": "Instead, dwell with the wise —Secluded, noble,Resolute, practisingjhāna,And always energetic.",
    "tha2:149": "People are attached to people;People are dependent on people;People are hurt by people;And people hurt people.",
    "tha2:150": "What’s the point of people,Or the things people produce?Go, leave these people,Who’ve hurt so many people.",
    "tha2:151": "There’s a big black woman who looks like a crow.She broke off thigh-bones, first one then another;She broke off arm-bones, first one then another;She broke off a skull like a curd-bowl, and then —She assembled them all together, and sat down beside them.",
    "tha2:152": "When an ignorant person builds up attachments,That idiot returns to suffering, again and again.So let one who understands not build up attachments:May I never again lie with a broken skull!",
    "tha2:153": "When your head is shaven, and you’re wrapped in the outer robe,You’ll have many enemiesWhen you receive food and drink,Clothes and lodgings.",
    "tha2:154": "Knowing this danger,This great fear in honours,A monk should go forth mindfully,With few possessions, and not full of desire.",
    "tha2:155": "In Pācīnavaṁsa groveThe companions of the Sakyans,Having given up much wealth,Are satisfied with whatever is put in their bowls.",
    "tha2:156": "Energetic, resolute,Always strong in striving;Having given up mundane satisfaction,They delight in the satisfaction of Dhamma.",
    "tha2:157": "I used my mind unwisely,I was addicted to ornamentation.I was vain, fickle,Tormented by desire for sensual pleasures.",
    "tha2:158": "But with the help of the Buddha,The Kinsman of the Sun, so skilled in means,I practiced wisely,And extracted any attachment to being reborn from my mind.",
    "tha2:159": "If they praise someoneWho doesn’t havesamādhi,The praise is in vain,As they don’t havesamādhi.",
    "tha2:160": "If they rebuke someoneWho does havesamādhi,The rebuke is in vain,As they do havesamādhi.",
    "tha2:161": "I’ve fully understood the aggregates,I’ve undone craving;I’ve developed the factors of awakening,And I’ve realized the ending of defilements.",
    "tha2:162": "Having fully understood the aggregates,Having plucked out the weaver of the web,Having developed the factors of awakening,I’ll realizenibbāna, without defilements.",
    "tha2:163": "That king was named Panāda,Whose sacrificial post was golden.Its height was sixteen times its width,And the top was a thousand-fold.",
    "tha2:164": "With a thousand panels, and a hundred ball-caps,Adorned with banners, made of gold;There, the seven times six hundredGods of music danced.",
    "tha2:165": "As a monk, mindful and wise,Resolute in power and energy,I recollected five hundred aeonsIn one night.",
    "tha2:166": "Developing the four establishments of mindfulness,The sevenfactors of awakeningand the eightfold path,I recollected five hundred aeonsIn one night.",
    "tha2:167": "The duty of one whose energy is strong;The duty of one intent on awakening:That I’ll do, I won’t fail —See my energy and effort!",
    "tha2:168": "Teach me the path,The road that culminates in the deathless.I’ll know it with wisdom,As the Ganges knows the ocean.",
    "tha2:169": "The barber approachedTo shave my head.I picked up a mirrorAnd looked at my body.",
    "tha2:170": "My body looked vacant;I was blind, but the darkness left me.My fancy hairdo has been cut off:Now there is no more rebirth into any state of existence.",
    "tha2:171": "I abandoned the five hindrancesSo I could realise security from the yoke;And I picked up the Dhamma as a mirror,For knowing and seeing myself.",
    "tha2:172": "I checked over this bodyAll of it, inside and out.Internally and externally,My body looked vacant.",
    "tha2:173": "Though a fine thoroughbred stumblesIt soon stands firm again;It gains even more spirit,And draws its load undeterred.",
    "tha2:174": "Even so, I am one endowed with vision,A disciple of the Buddha!You should remember me as a thoroughbred,The Buddha’s rightful son.",
    "tha2:175": "Come Nandaka, let’s goTo visit our preceptor.We’ll roar the lion’s roarBefore of the best of Buddhas.",
    "tha2:176": "The sage gave us the going forthOut of compassion, so that we could realizeThe ending of all fetters —Now we have reached that goal.",
    "tha2:177": "This is how the wise roar:Like lions in mountain caves,Heroes, triumphant in battle,Having vanquished Māra and his army.",
    "tha2:178": "I’ve attended on the teacher;I’ve honoured the Dhamma and the Saṅgha;I’m happy and joyful,Because I’ve seen my son free of defilements.",
    "tha2:179": "I sat close by wise people,And learnt the Dhamma many times.What I learnt, I practiced,Entering the road that culminates in the deathless.",
    "tha2:180": "I’ve slain the desire to be reborn in any state of existence,Such desire won’t be found in me again.It was not, and it won’t be in me,And it isn’t found in me now.",
    "tha2:181": "When I became a monkIn the teaching of the Buddha,Letting go, I rose up;I escaped the realm of sensual pleasures.",
    "tha2:182": "Then, under the supervision of the supreme Buddha,My mind was freed.I know that my freedom is unshakeable,Because all fetters have ended.",
    "tha2:183": "All houses are impermanent;Again and again, in all kinds of realms,I’ve searched for the house-builder —Rebirth again and again is suffering.",
    "tha2:184": "I’ve seen you, house-builder!You won’t build a house again.All your rafters are broken,Your ridgepole is split.My mind is released from limits:It’ll fall apart in this very life.",
    "tha2:185": "The Worthy One, the world’s Holy OneThe sage is afflicted by winds.If there’s hot water,Give it to the sage, brahmin.",
    "tha2:186": "I wish to bring it to the oneWho is honoured by those worthy of honour,Revered by those worthy of reverence,And respected by those worthy of respect.",
    "tha2:187": "I’ve seen lay disciples who have memorized discourses,Saying \"Sensual pleasures are impermanent\";But they are passionately enamoured of jewelled earrings,Desiring children and wives.",
    "tha2:188": "To be honest, they don’t know Dhamma,Despite saying \"Sensual pleasures are impermanent\";They don’t have the power to cut their lust,So they’re attached to children, wives, and wealth.",
    "tha2:189": "The sky rains, the sky groans,I’m staying alone in a frightful hole.But while I’m staying alone in that frightful hole,I’ve no fear, no dread, no goosebumps.",
    "tha2:190": "This is my normal state,When I’m staying alone in a frightful hole:I’ve no fear, no dread, no goosebumps.",
    "tha2:191": "Whose mind is like rock,Steady, not trembling?Free of desire among desirable things,Not agitated among agitating things?For one whose mind is developed in this way,From where will suffering come?",
    "tha2:192": "Mymind is like rock,Steady, not trembling,Free of desire among desirable things,Not agitated among agitating things.For me, whose mind is developed in this way,From where will suffering come?",
    "tha2:193": "Night, with its garland of stars,Is not just for sleeping.Those who are conscious will knowThat night is also for waking.",
    "tha2:194": "If I were to fall from the back of an elephantAnd be trampled by the tuskers that follow,Better for me to die in battle,Than to live on in defeat.",
    "tha2:195": "One who has gone forth from the home life out of faith,Leaving behind the five kinds of sensual pleasures,So pleasant seeming, delighting the mind —Let them put an end to suffering.",
    "tha2:196": "I don’t long for death;I don’t long for life;I await my time,Aware and mindful.",
    "tha2:197": "I arranged a robe on my shoulder,The colour of young mango sprouts;Then I entered the village for alms,While sitting on an elephant’s neck!",
    "tha2:198": "But when I dismounted from the elephant,I was moved by inspiration —At first I was burning, but then I was peaceful;I realized the end of defilements.",
    "tha2:199": "This fellow, \"Rag-rice\", he sure is a rag.This place has been made for practisingjhāna,Like a crystal vase filled to the brimWith the nectar of the deathless,Into which enough Dhamma has been poured.",
    "tha2:200": "Don’t nod off, Rag —I’ll smack your ear!Nodding off in the middle of the Saṅgha?You haven’t learnt a thing.",
    "tha2:201": "Oh, the Buddhas! Oh, the Dhammas!Oh, the perfections of the Teacher!Where a disciple may seeSuch a Dhamma for themselves.",
    "tha2:202": "Through countless aeonsThey obtained an identity;This is the end,Their last body;Transmigrating through births and deaths,Now there is no more rebirth into any state of existence.",
    "tha2:203": "The young monkWho is devoted to the teaching of the Buddha,Wakeful among those who sleep —His life isn’t in vain.",
    "tha2:204": "So let the wise devote themselvesTo faith, virtuous behaviour,Confidence, and insight into Dhamma,Remembering the teachings of the Buddhas.",
    "tha2:205": "Whose faculties have become serene,Like horses tamed by a charioteer?Who has abandoned conceit and defilements,Becoming such that even the gods envy them?",
    "tha2:206": "Myfaculties have become serene,Like horses tamed by a charioteer?Ihave abandoned conceit and defilements,Becoming such that even the gods envy me.",
    "tha2:207": "\"Your skin is nasty but your heart is good,Mogharāja, you always havesamādhi.But in the nights of winter, so dark and cold,How will you get by, monk?\"",
    "tha2:208": "\"I’ve heard that all the MagadhansHave an abundance of grain.I’ll make my bed under a thatched roof,Just like those who live in comfort.\"",
    "tha2:209": "One should not suspend others from the Saṅgha,Nor raise objections against them;And neither disparage nor raise one’s voiceAgainst one who has crossed to the further shore.One should not praise oneself among the assemblies,But be without conceit, measured in speech, and of good conduct.",
    "tha2:210": "For one who sees the goal, so very subtle and fine,Who has wholesome thoughts and humbleness,And cultivates the Buddha’s ethical conduct,It’s not hard to gainnibbāna.",
    "tha2:211": "The peacocks cry outWith their fair crests and tails,Their lovely blue necks and fair faces,Their beautiful song and their call.This broad earth is lush with grass and dew,And the sky’s full of beautiful clouds.",
    "tha2:212": "A person who is practisingjhānais happy in mind,And their appearance is uplifting;Going forth in the teaching of the BuddhaIs easy for a good person.You should realise that supreme, unchanging state,So very pure, subtle, and hard to see.",
    "tha2:213": "The conceited mind, addicted to pleasure,Impales itself on its own stake.It goes only whereThere’s a stake, a chopping block.",
    "tha2:214": "I declare you the demon mind!I declare you the insidious mind!You’ve found the teacher so hard to find —Don’t lead me away from the goal.",
    "tha2:215": "Transmigrating for such a long time,I’ve evolved through various states of rebirth,Not seeing the noble truths,A blind, unenlightened person.",
    "tha2:216": "But when I became heedfulTransmigrating from birth to birth was disintegrated;All states of rebirth were cut off;Now there is no more rebirth into any state of existence.",
    "tha2:217": "Beneath the Bodhi Tree,Bright green and growing,Being mindful, my perceptionBecame one with the Buddha.",
    "tha2:218": "It was thirty one aeons agoThat I gained that perception;And it is due to that perceptionThat I’ve realized the ending of defilements."
}