{
    "tha4:267": "There’s a dancer along the highway,Dancing as the music plays;She’s adorned with jewellery and all dressed up,With a garland of flowers and perfume of sandalwood.",
    "tha4:268": "I entered for alms,And while going along I glanced at her,Adorned with jewellery and all dressed up,Like a snare of death laid down.",
    "tha4:269": "Then the realizationCame upon me —The danger became clear,And I was firmly repulsed.",
    "tha4:270": "Then my mind was liberated —See the excellence of the Dhamma!I’ve attained the three knowledges,And fulfilled the Buddha’s instructions.",
    "tha4:271": "Overwhelmed by drowsiness,I came out of my dwelling;Stepping up on to the walking meditation path,I fell to the ground right there.",
    "tha4:272": "I rubbed my limbs, and againI stepped up on to the walking meditation path.I walked meditation up and down the path,Serene inside myself.",
    "tha4:273": "Then the realizationCame upon me —The danger became clear,And I was firmly repulsed.",
    "tha4:274": "Then my mind was liberated —See the excellence of the Dhamma!I’ve attained the three knowledges,And fulfilled the Buddha’s instructions.",
    "tha4:275": "Others don’t understandThat here we come to our end.Those that do understand thisSettle their quarrels because of that.",
    "tha4:276": "And when those who don’t understandBehave as though they were immortal;Those who understand the DhammaAre like the healthy among the sick.",
    "tha4:277": "Any lax act,Or corrupt religious observance,Or a spiritual life arousing suspicion,Does not yield great fruit.",
    "tha4:278": "Whoever has no respectFor their companions in the spiritual lifeIs as far from true DhammaAs the sky is from the earth.",
    "tha4:279": "Damn these stinking bodies!They’re on Māra’s side, they ooze;And bodies have nine streamsThat are always flowing.",
    "tha4:280": "Don’t think much of bodies;Don’t disparage the Tathāgathas.They’re not even aroused by heaven,Let alone by humans.",
    "tha4:281": "But those dumb fools,With bad advisors, shrouded in delusion,That kind of person is aroused by bodies,When Māra has thrown the snare.",
    "tha4:282": "Those who have discardedLust, hatred, and ignorance:They’ve cut the strings, they’re no longer bound —Such people are not aroused by bodies.",
    "tha4:283": "For fifty-five yearsI wore mud and dirt;Eating one meal a month,I tore out my hair and beard.",
    "tha4:284": "I stood on one foot;I rejected seats;I ate dried-out dung;I didn’t accept food that had been set aside for me.",
    "tha4:285": "Having done many actions of this kind,Which lead to a bad destination,As I was being swept away by the great flood,I went to the Buddha for refuge.",
    "tha4:286": "See the going for refuge!See the excellence of the Dhamma!I’ve attained the three knowledges,And fulfilled the Buddha’s instructions.",
    "tha4:287": "During the spring festival at Gayā,It was so welcome for meTo see the Buddha,Teaching the supreme Dhamma.",
    "tha4:288": "He was glorious, the teacher of a community,Who had realised the highest, a leader,Conqueror of the world with its gods;His vision was unequalled.",
    "tha4:289": "A great being of power, a great hero,A great light, without defilements.With the utter ending of all defilements,The teacher has no fear from any direction.",
    "tha4:290": "For a long time, sadly, I was corrupted,Fettered by the bond of wrong view.That Blessed One, Senaka,Released me from all ties.",
    "tha4:291": "Hurrying when it’s time for going slowly;Going slowly when it’s time to hurry;That fool falls into sufferingBecause of these muddled arrangements.",
    "tha4:292": "Their good fortune wastes awayLike the moon in the waning fortnight;They become disgraced,And alienated from their friends.",
    "tha4:293": "Going slowly when it’s time for going slowly;Hurrying when it’s time to hurry;That wise person comes into happinessBecause of these proper arrangements.",
    "tha4:294": "Their good fortune flourishesLike the moon in the waxing fortnight;They become famous and respected,Not alienated from their friends.",
    "tha4:295": "I am known as \"Fortunate Rāhula\",Because I’m endowed in both ways:I am the son of the Buddha,And I have the vision of the Dhammas.",
    "tha4:296": "Since my defilements have ended,Since there is no more being reborn in any state of existence —I’m an Arahant, worthy of offerings,With the three knowledges and the vision of the deathless.",
    "tha4:297": "Blinded by sensual pleasures, trapped in a net,They are smothered over by craving,Bound by the Kinsman of the Negligent,Like a fish caught in a funnel-net trap.",
    "tha4:298": "Having thrown off those sensual pleasures,Having cut Māra’s bond,Having pulled out craving, roots and all:I’ve become cool, and realizednibbāna.",
    "tha4:299": "Covered with gold,Surrounded by all her maids,With my son upon her hip,My wife came up to me.",
    "tha4:300": "I saw her coming,The mother of my son,Adorned with jewellery and all dressed up,Like a snare of death laid down.",
    "tha4:301": "Then the realizationCame upon me —The danger became clear,And I was firmly repulsed.",
    "tha4:302": "Then my mind was liberated —See the excellence of the Dhamma!I’ve attained the three knowledges,And fulfilled the Buddha’s instructions.",
    "tha4:303": "\"Dhamma really protects you if you practice Dhamma;Dhamma well-practiced brings happiness.If you practice Dhamma, this is the benefit —You won’t go to a bad destination.",
    "tha4:304": "Dhamma and what is not DhammaDon’t both lead to the same results.What is not Dhamma leads to hell,While Dhamma takes you to a good destination.",
    "tha4:305": "So you should be enthusiastic to perform acts of Dhamma,Rejoicing in the Fortunate One, the poised.Disciples of the best of Fortunate Ones are firm in Dhamma;Those wise ones are led on, going to the very best of refuges.\"",
    "tha4:306": "\"The boil has been burst from its root,The net of craving is undone.He has ended transmigration, he has nothing,Just like the full moon in a clear night sky.\"",
    "tha4:307": "When the crane with its beautiful white wings,Startled by fear of the dark thundercloud,Flees, seeking shelter —Then the River Ajakaraṇī delights me.",
    "tha4:308": "When the crane, so pure and white,Startled by fear of the dark thundercloud,Seeks for a cave to shelter in, but can’t see one —Then the River Ajakaraṇī delights me.",
    "tha4:309": "Who wouldn’t be delightedBy the rose-apple treesThat adorn both banks of the river there,Behind my cave?",
    "tha4:310": "Rid of snakes, that death-mad swarm,The lazy frogs croak:\"Today isn’t the time to stray from mountain streams;Ajakaraṇī is safe, pleasant, and delightful.\"",
    "tha4:311": "I went forth to save my life;But I gained faithAfter receiving full ordination;And I strove, strong in effort.",
    "tha4:312": "With pleasure, let this body be broken!Let this lump of flesh be dissolved!Let both my legs fall offAt the knees!",
    "tha4:313": "I won’t eat, I won’t drink,I won’t leave my dwelling,Nor will I lie down on my side,Until the dart of craving is drawn out.",
    "tha4:314": "As I dwell like this,See my energy and striving!I’ve attained the three knowledges,And fulfilled the Buddha’s instructions."
}