{
    "mn100:1": "Thus have I heard. On one occasion the Blessed One was wandering in the Kosalan country with a large Saṅgha of bhikkhus.",
    "mn100:2": "\"Honour to the Blessed One, accomplished and fully enlightened!",
    "mn100:3": "Honour to the Blessed One, accomplished and fully enlightened!",
    "mn100:4": "Honour to the Blessed One, accomplished and fully enlightened!\"",
    "mn100:5": "At the time there was a brahmin student named Saṅgārava staying at Caṇḍalakappa. He was a master of the Three Vedas, with their vocabularies, liturgy, phonology, and etymology, and the histories as the fifth; skilled in philology and grammar, he was fully versed in natural philosophy and in the marks of a Great Man. Having heard the brahmin woman Dhānañjānī utter those words, he said to her: \"This brahmin woman Dhānañjānī must be disgraced and degraded, since when there are brahmins around she praises that bald-pated recluse.\"",
    "mn100:6": "Then, after wandering by stages in the Kosalan country, the Blessed One eventually arrived at Caṇḍalakappa. There in Cạ̣alakappa the Blessed One lived in the Mango Grove belonging to the brahmins of the Todeyya clan.",
    "mn100:7": "\"Yes, madam,\" he replied. Then he went to the Blessed One and exchanged greetings with him. When this courteous and amiable talk was finished, he sat down at one side and said:",
    "mn100:8": "\"Master Gotama, there are some recluses and brahmins who claimto teachthe fundamentals of the holy life after having reached the consummation and perfection of direct knowledge here and now.[n.91]Diṭṭadhammābhiññāvosānapāramippattā ādibrahmacariyaṁ paṭijānanti.MAglosses: They claim to be the originators, creators, producers of a holy life, saying: \"Having directly known here and now in this present existence and having reached the consummation, we have attained Nibbāna, called ‘perfection’ because it is the transcendence of everything.\"Where among these recluses and brahmins does Master Gotama stand?\"",
    "mn100:9": "\"Bhāradvāja, I say that there is a diversity among those recluses and brahmins who claimto teachthe fundamentals of the holy life after having reached the consummation and perfection of direct knowledge here and now. There are some recluses and brahmins who are traditionalists, who on the basis of oral tradition claimto teachthe fundamentals of the holy life after having reached the consummation and perfection of direct knowledge here and now; such are the brahmins of the Three Vedas. There are some recluses and brahmins who, entirely on the basis of mere faith, claimto teachthe fundamentals of the holy life after having reached the consummation and perfection of direct knowledge here and now; such are the reasoners and investigators.[n.1] It is puzzling that the reasoners and investigators(takkī, vīmaṁsī)are here said to rely on the basis of mere faith(saddhāmattakena). Elsewhere faith and reasoning are contrasted as two different grounds of conviction (MN 5.14), and \"mere faith\" seems more closely allied with reliance on oral tradition than with reasoning and investigation.There are some recluses and brahmins who, having directly known the Dhamma for themselves[n.20]Sāmaṁ yeva dhammaṁ abhiññāya.This phrase emphasises direct personal realisation as the foundation for promulgating a holy life.among things not heard before, claimto teachthe fundamentals of the holy life after having reached the consummation and perfection of direct knowledge here and now.",
    "mn100:10": "\"Here, Bhāradvāja, before my enlightenment, while I was still only an unenlightened Bodhisatta, I considered thus: ‘Household life is crowded and dusty; life gone forth is wide open. It is not easy while living in a home to lead the holy life utterly perfect and pure as a polished shell. Suppose I shave off my hair and beard, put on the yellow robe, and go forth from the home life into homelessness.’ Later, while still young, a black-haired young man endowed with the blessing of youth, in the prime of life, though my mother and father wished otherwise and wept with tearful faces, I shaved off my hair and beard, put on the yellow robe, and went forth from the home life into homelessness.",
    "mn100:11": "Then I went to Āḷāra Kālāma and asked him: ‘Friend Kālāma, in what way do you declare that by realising for yourself with direct knowledge you enter upon and abide in this Dhamma?’ In reply he declared the base of nothingness.MA: He taught him the seven attainments (of serenity meditation) ending in the base of nothingness, the third of the four immaterial attainments. Though these attainments are spiritually exalted, they are still mundane and not in themselves directly conducive to Nibbāna.",
    "mn100:12": "\"Still in search, Bhāradvāja, of what is wholesome, seeking the supreme state of sublime peace, I went to Uddaka Rāmaputta and said to him: ‘Friend, I want to lead the holy life in this Dhamma and Discipline.ʹ[n.923] Both Horner in MLS and Ñm in Ms err in their translations of the account of the Bodhisatta's meeting with Uddaka Rāmaputta by assuming that Uddaka is identical with Rāma. However, as his name indicates, Uddaka was the son(putta)of Rāma, who must have already passed away before the Bodhisatta arrived on the scene. It should be noted that all references to Rāma are in the past tense and the third person, and that Uddaka in the end places the Bodhisatta in the position of teacher. Though the text does not allow for definite conclusions, this suggests that he himself had not yet reached the fourth immaterial attainment.Uddaka Rāmaputta replied: ‘The venerable one may stay here. This Dhamma is such that a wise man can soon enter upon and abide in it, himself realising through direct knowledge his own teacher's doctrine.’ I soon quickly learned that Dhamma. As far as mere lip-reciting and rehearsal of his teaching went, I could speak with knowledge and assurance, and I claimed, ‘I know and see’ — and there were others who did likewise.\"I considered: ‘It was not through mere faith alone that Rāma declared: \"By realising for myself with direct knowledge, I enter upon and abide in this Dhamma.\" Certainly Rāma abided knowing and seeing this Dhamma.’",
    "mn100:13": "Then I went to Uddaka Rāmaputta and asked him: ‘Friend, was it in this way that Rāma declared that he entered upon and abided in this Dhamma by realising for himself with direct knowledge?’ —",
    "mn100:14": "\"Still in search, Bhāradvāja, of what is wholesome, seeking the supreme state of sublime peace, I wandered by stages through the Magadhan country until eventually I arrived at Uruvelā, at Senānigama. There I saw an agreeable piece of ground, a delightful grove with a clear-flowing river with pleasant, smooth banks and nearby a village for alms resort. I considered: ‘This is an agreeable piece of ground, this is a delightful grove with a clear-flowing river with pleasant, smooth banks and nearby a village for alms resort. This will serve for the striving of a clansman intent on striving.’ And I sat down there thinking: ‘This will serve for striving.ʹ",
    "mn100:15": "Suppose there were a wet sappy piece of wood lying in water, and a man came with an upper fire-stick, thinking: ‘I shall light a fire, I shall produce heat.’ What do you think, Bhāradvāja? Could the man light a fire and produce heat by taking the upper fire-stick and rubbing it against the wet sappy piece of wood lying in the water?\"",
    "mn100:16": "\"Again, Bhāradvāja, a second simile occurred to me spontaneously, never heard before. Suppose there were a wet sappy piece of wood lying on dry land far from water, and a man came with an upper fire-stick, thinking: ‘I shall light a fire, I shall produce heat.’ What do you think, Bhāradvāja? Could the man light a fire and produce heat by taking the upper fire-stick and rubbing it against the wet sappy piece of wood lying on dry land far from water?\"",
    "mn100:17": "\"Again, Bhāradvāja, a third simile occurred to me spontaneously, never heard before. Suppose there were a dry sapless piece of wood lying on dry land far from water, and a man came with an upper fire-stick, thinking: ‘I shall light a fire, I shall produce heat.’ What do you think, Bhāradvāja? Could the man light a fire and produce heat by rubbing it against the dry sapless piece of wood lying on dry land far from water?\"",
    "mn100:18": "\"I thought: ‘Suppose, with my teeth clenched and my tongue pressed against the roof of my mouth, I beat down, constrain, and crush mind with mind.’ So, with my teeth clenched and my tongue pressed against the roof of my mouth, I beat down, constrained, and crushed mind with mind. While I did so, sweat ran from my armpits. Just as a strong man might seize a weaker man by the head or shoulders and beat him down, constrain him, and crush him, so too, with my teeth clenched and my tongue pressed against the roof of my mouth, I beat down, constrained, and crushed mind with mind, and sweat ran from my armpits. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving.",
    "mn100:19": "\"I thought: ‘Suppose I practise the breathingless meditation. ’ So I stopped the in-breaths and out-breaths through my mouth and nose. While I did so, there was a loud sound of winds coming out from my earholes. Just as there is a loud sound when a smith's bellows are blown, so too, while I stopped the in-breaths and out-breaths through my nose and ears, there was a loud sound of winds coming out from my earholes. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving.",
    "mn100:20": "\"I thought: ‘Suppose I practise further the breathingless meditation.’ So I stopped the in-breaths and out-breaths through my mouth, nose, and ears. While I did so, violent winds cut through my head. Just as if a strong man were to crush my head with the tip of a sharp sword, so too, while I stopped the in-breaths and out-breaths through my mouth, nose, and ears, violent winds cut through my head. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving.",
    "mn100:21": "\"I thought: ‘Suppose I practise further the breathingless meditation.’ So I stopped the in-breaths and out-breaths through my mouth, nose, and ears. While I did so, there were violent pains in my head. Just as if a strong man were tightening a tough leather strap around my head as a headband, so too, while I stopped the in-breaths and out-breaths through my mouth, nose, and ears, there were violent pains in my head. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving.",
    "mn100:22": "\"I thought: ‘Suppose I practise further the breathingless meditation.’ So I stopped the in-breaths and out-breaths through my mouth, nose, and ears. While I did so, violent winds carved up my belly. Just as if a skilled butcher or his apprentice were to carve up an ox's belly with a sharp butcher's knife, so too, while I stopped the in-breaths and out-breaths through my mouth, nose, and ears, violent winds carved up my belly. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving.",
    "mn100:23": "\"I thought: ‘Suppose I practise further the breathingless meditation.’ So I stopped the in-breaths and out-breaths through my mouth, nose, and ears. While I did so, there was a violent burning in my body. Just as if two strong men were to seize a weaker man by both arms and roast him over a pit of hot coals, so too, while I stopped the in-breaths and out-breaths through my mouth, nose, and ears, there was a violent burning in my body. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving.",
    "mn100:24": "\"I thought: ‘Suppose I practise entirely cutting off food.’ Then deities came to me and said: ‘Good sir, do not practise entirely cutting off food. If you do so, we shall infuse heavenly food into the pores of your skin and you will live on that.’ I considered: ‘If I claim to be completely fasting while these deities infuse heavenly food into the pores of my skin and I live on that, then I shall be lying.’ So I dismissed those deities, saying: ‘There is no need.’",
    "mn100:25": "\"I thought: ‘Suppose I take very little food, a handful each time, whether of bean soup or lentil soup or vetch soup or pea soup.’ So I took very little food, a handful each time, whether of bean soup or lentil soup or vetch soup or pea soup. While I did so, my body reached a state of extreme emaciation. Because of eating so little my limbs became like the jointed segments of vine stems or bamboo stems. Because of eating so little my backside became like a camel's hoof. Because of eating so little the projections on my spine stood forth like corded beads. Because of eating so little my ribs jutted out as gaunt as the crazy rafters of an old roofless barn. Because of eating so little the gleam of my eyes sank far down in their sockets, looking like the gleam of water that has sunk far down in a deep well. Because of eating so little my scalp shrivelled and withered as a green bitter gourd shrivels and withers in the wind and sun. Because of eating so little my belly skin adhered to my backbone; thus if I touched my belly skin I encountered my backbone and if I touched my backbone I encountered my belly skin. Because of eating so little, if I defecated or urinated, I fell over on my face there. Because of eating so little, if I tried to ease my body by rubbing my limbs with my hands, the hair, rotted at its roots, fell from my body as I rubbed.",
    "mn100:26": "\"I thought: ‘Whatever recluses or brahmins in the past have experienced painful, racking, piercing feelings due to exertion, this is the utmost, there is none beyond this. And whatever recluses and brahmins in the future will experience painful, racking, piercing feelings due to exertion, this is the utmost, there is none beyond this. And whatever recluses and brahmins at present experience painful, racking, piercing feelings due to exertion, this is the utmost, there is none beyond this. But by this racking practice of austerities I have not attained any superhuman states, any distinction in knowledge and vision worthy of the noble ones. Could there be another path to enlightenment?’",
    "mn100:27": "\"I considered: ‘It is not easy to attain that pleasure with a body so excessively emaciated. Suppose I ate some solid food — some boiled rice and porridge.’ And I ate some solid food — some boiled rice and porridge. Now at that time five bhikkhus were waiting upon me, thinking: ‘If our recluse Gotama achieves some higher state, he will inform us.’ But when I ate the boiled rice and porridge, the five bhikkhus were disgusted and left me, thinking: ‘The recluse Gotama now lives luxuriously; he has given up his striving and reverted to luxury.’",
    "mn100:28": "\"Now when I had eaten solid food and regained my strength, then quite secluded from sensual pleasures, secluded from unwholesome states, I entered upon and abided in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. But such pleasant feeling that arose in me did not invade my mind and remain.",
    "mn100:29": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the recollection of past lives. I recollected my manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion: ‘There I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared elsewhere; and there too I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared here.’ Thus with their aspects and particulars I recollected my manifold past lives.",
    "mn100:30": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the passing away and reappearance of beings.Explained in detail at Vsm XIII, 72–101.With the divine eye, which is purified and surpasses the human, I saw beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate. I understood how beings pass on according to their actions thus: ‘These worthy beings who were ill conducted in body, speech, and mind, revilers of noble ones, wrong in their views, giving effect to wrong view in their actions, on the dissolution of the body, after death, have reappeared in a state of deprivation, in a bad destination, in perdition, even in hell; but these worthy beings who were well conducted in body, speech, and mind, not revilers of noble ones, right in their views, giving effect to rirght view in their actions, on the dissolution of the body, after death, have reappeared in a good destination, even in the heavenly world.’",
    "mn100:31": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the destruction of the taints. I directly knew as it actually is: ‘This is suffering’; … ‘This is the origin of suffering’; … ‘This is the cessation of suffering’; … ‘This is the way leading to the cessation of suffering’; … ‘These are the taints’; … ‘This is the origin of the taints’; … ‘This is the cessation of the taints’; … ‘This is the way leading to the cessation of the taints.’",
    "mn100:32": "When this was said, the brahmin student Saṅgārava said to the Blessed One: \"Master Gotama's striving was unfaltering, Master Gotama's striving was that of a true man, as it should be for an Accomplished One, a Fully Enlightened One. But how is it, Master Gotama, are there gods?\"",
    "mn100:33": "When this was said, the brahmin student Saṅgārava said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overturned, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. Let Master Gotama remember me as a lay follower who has gone to him for refuge for life.\""
}