{
    "mn101:1": "Thus have I heard. On one occasion the Blessed One was living in the Sakyan country where there was a town of the Sakyans named Devadaha. There the Blessed One addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn101:2": "\"I go to the Nigaṇṭhas who speak thus and I say: ‘Friend Nigaṇṭhas, is it true that you hold such a doctrine and view as this: \"Whatever this person feels … all suffering will be exhausted\"?’ If, when they are asked thus, the Nigaṇṭhas admit this and say ‘Yes,’ I say to them:",
    "mn101:3": "\"‘But, friends, do you know that you existed in the past, and that it is not the case that you did not exist?’",
    "mn101:4": "‘But, friends, do you know that you did evil actions in the past and did not abstain from them?’",
    "mn101:5": "‘But, friends, do you know that you did such and such evil actions?’",
    "mn101:6": "‘But, friends, do you know that so much suffering has already been exhausted, or that so much suffering has still to be exhausted, or that when so much suffering has been exhausted all suffering will have been exhausted?’",
    "mn101:7": "‘But, friends, do you know what the abandoning of unwholesome states is and what the cultivation of wholesome states is here and now?’",
    "mn101:8": "\"‘So, friends, it seems that you do not know that you existed in the past and that it is not the case that you did not exist; or that you did evil actions in the past and did not abstain from them; or that you did such and such evil actions; or that so much suffering has already been exhausted, or that so much suffering has still to be exhausted, or that when so much suffering has been exhausted all suffering will have been exhausted; or what the abandoning of unwholesome states is and what the cultivation of wholesome states is here and now. That being so, it is not fitting for the venerable Nigaṇṭhas to declare: \"Whatever this person feels, whether pleasure or pain or neither-pain-nor-pleasure, all that is caused by what was done in the past. So by annihilating with asceticism past actions and by doing no fresh actions, there will be no consequence in the future. With no consequence in the future … all suffering will be exhausted.\"",
    "mn101:9": "\"‘If, friend Nigaṇṭhas, you knew that you existed in the past and that it is not the case that you did not exist; or that you did evil actions in the past and did not abstain from them; or that you did such and such evil actions; or that so much suffering has already been exhausted, or that so much suffering has still to be exhausted, or that when so much suffering has been exhausted all suffering will have been exhausted; or what the abandoning of unwholesome states is and what the cultivation of wholesome states is here and now; that being so, it would be fitting for the venerable Nigaṇṭhas to declare: \"Whatever this person feels … … all suffering will be exhausted.\"",
    "mn101:10": "\"‘Friend Nigaṇṭhas, suppose a man were wounded by an arrow thickly smeared with poison, and because of this he felt painful, racking, piercing feelings. Then his friends and companions, kinsmen and relatives, brought a surgeon. The surgeon would cut around the opening of the wound with a knife, probe for the arrow with a probe, pull out the arrow, and apply a medicinal powder to the opening of the wound, and at each step the man would feel painful, racking, piercing feelings. Then on a later occasion, when the wound was healed and covered with skin, the man would be well and happy, independent, master of himself, able to go where he likes. He might think: \"Formerly I was pierced by an arrow thickly smeared with poison, and because of this I felt painful, racking, piercing feelings. Then my friends and companions, kinsmen and relatives, brought a surgeon. The surgeon cut around the opening of the wound with a knife, probed for the arrow with a probe, pulled out the arrow, and applied a medicinal powder to the opening of the wound, and at each step I felt painful, racking, piercing feelings. But now that the wound is healed and covered with skin, I am well and happy, independent, my own master, able to go where I like.\"",
    "mn101:11": "\"‘So too, friend Nigaṇṭhas, if you knew that you existed in the past and that it is not the case that you did not exist … or what the abandoning of unwholesome states is and what the cultivation of wholesome states is here and now; that being so, it would be fitting for the venerableNigaṇṭhas to declare: \"Whatever this person feels … all suffering will be exhausted.\"",
    "mn101:12": "\"‘But since, friend Nigaṇṭhas, you do not know that you existed in the past and that it is not the case that you did not exist … or what the abandoning of unwholesome states is and what the cultivation of wholesome states is here and now, it is not fitting for the venerable Nigaṇṭhas to declare: \"Whatever this person feels … all suffering will be exhausted.\"’",
    "mn101:13": "\"When this was said, the Nigaṇṭhas told me: ‘Friend, the Nigaṇṭha Nātaputta is omniscient and all-seeing and claims to have complete knowledge and vision thus: \"Whether I am walking or standing or asleep or awake, knowledge and vision are continuously and uninterruptedly present to me.\" He says thus: \"Nigaṇṭhas, you have done evil actions in the past; exhaust them with the performance of piercing austerities. And when you are here and now restrained in body, speech, and mind, that is doing no evil actions for the future. So by annihilating with asceticism past actions and by doing no fresh actions, there will be no consequence in the future. With no consequence in the future … all suffering will be exhausted.\" We approve of and accept this, and so we are satisfied.’",
    "mn101:14": "\"When this was said, I told the Nigaṇṭhas:[n.924] As atMN 95 ¶27.‘There are five things, friend Nigaṇṭhas, that may turn out in two different ways here and now. What five? They are: faith, approval, oral tradition, reasoned cogitation, and reflective acceptance of a view. These five things may turn out in two different ways here and now. Herein, what kind of faith do the venerable Nigaṇṭhas have in a teacher who speaks about the past? What kind of approval, what kind of oral tradition, what kind of reasoned cogitation, what kind of reflective acceptance of a view?’ Speaking thus, bhikkhus, I did not see any legitimate defence of their position by the Nigaṇṭhas.",
    "mn101:15": "\"Again, bhikkhus, I said to the Nigaṇṭhas: ‘What do you think, friend Nigaṇṭhas? When there is intense exertion, intense striving, do you then feel painful, racking, piercing feelings due to intense exertion? But when there is no intense exertion, no intense striving, do you then not feel any painful, racking, piercing feelings due to intense exertion?’ — ‘When there is intense exertion, friend Gotama, intense striving, then we feel painful, racking, piercing feelings due to intense exertion; but when there is no intense exertion, no intense striving, then we do not feel any painful, racking, piercing feelings due to intense exertion.’",
    "mn101:16": "\"‘So it seems, friend Nigaṇṭhas, that when there is intense exertion … you feel painful, racking, piercing feelings due to intense exertion; but when there is no intense exertion … you do not feel any painful, racking, piercing feelings due to intense exertion. That being so, it is not fitting for the venerable Nigaṇṭhas to declare:[n.925] It is not fitting for them to make that declaration because their \"intense exertion,\" i.e., their ascetic practice, is the cause for their painful feelings, as the Buddha states in ¶18.\"Whatever this person feels, whether pleasure or pain or neither-pain-nor-pleasure, all that is caused by what was done in the past. So by annihilating with asceticism past actions and by doing no fresh actions, there will be no consequence in the future. With no consequence … all suffering will be exhausted.\"",
    "mn101:17": "\"‘If, friend Nigaṇṭhas, when there was intense exertion, intense striving, then painful, racking, piercing feelings due to intense exertion were present, and when there was no intense exertion, no intense striving, then painful, racking, piercing feelings due to intense exertion were still present; that being so, it would be fitting for the venerable Nigaṇṭhas to declare: \"Whatever this person feels … all suffering will be exhausted.\"",
    "mn101:18": "\"‘But since, friend Nigaṇṭhas, when there is intense exertion, intense striving, then you feel painful, racking, piercing feelings due to intense exertion, but when there is no intense exertion, no intense striving, then you do not feel painful, racking, piercing feelings due to intense exertion, you are therefore feeling only the painful, racking, piercing feelings of your self-imposed exertion, and it is through ignorance, unknowing, and delusion that you mistakenly hold: \"Whatever this person feels … all suffering will be exhausted.\"’ Speaking thus, bhikkhus, I did not see any legitimate defence of their position by the Nigaṇṭhas.",
    "mn101:19": "\"Again, bhikkhus, I said to the Nigaṇṭhas: ‘What do you think, friend Nigaṇṭhas? Is it possible that an actionwhose resultis to be experienced here and now[n.926] This is a technical expression for an action that is to ripen in this present life.can, through exertion and striving, become onewhose resultis to be experienced in the next life?’",
    "mn101:20": "‘But is it possible that an actionwhose resultis to be experienced in the next life can, through exertion and striving, become onewhose resultis to be experienced here and now?’",
    "mn101:21": "\"‘What do you think, friend Nigaṇṭhas? Is it possible that an actionwhose resultis to be experienced as pleasant can, through exertion and striving, become onewhose resultis to be experienced as painful?’",
    "mn101:22": "‘But is it possible that an actionwhose resultis to be experienced as painful can, through exertion and striving, become onewhose resultis to be experienced as pleasant?’",
    "mn101:23": "\"‘What do you think, friend Nigaṇṭhas? Is it possible that an actionwhose resultis to be experienced in a maturedpersonalitycan, by exertion and striving, become onewhose resultis to be experienced in an unmaturedpersonality?’[n.927]MA: \"An action (whose result) is to be experienced in a matured (personality)\" is a synonym for an action (whose result) is to be experienced here and now. \"An action (whose result) is to be experienced in an unmatured personality\" is a synonym for action (whose result) is to be experienced in the next life. But a specification is made as follows: any action that yields its result in the same life is one to be experienced here and now, but only an action that produces its resultwithin seven daysis called one to be experienced in a matured personality.",
    "mn101:24": "‘But is it possible that an actionwhose resultis to be experienced in an unmaturedpersonalitycan, by exertion and striving, become onewhose resultis to be experienced in a matured personality?’",
    "mn101:25": "\"‘What do you think, friend Nigaṇṭhas? Is it possible that an actionwhose resultis to be much experienced can, through exertion and striving, become onewhose resultis to be little experienced?’",
    "mn101:26": "‘But is it possible that an actionwhose resultis to be little experienced can, through exertion and striving, become onewhose resultis to be much experienced?’",
    "mn101:27": "\"‘What do you think, friend Nigaṇṭhas? Is it possible that an actionwhose resultis to be experienced can, through exertion and striving, become onewhose resultis not to be experienced? ’[n.928] This is an action that does not gain the opportunity to yield its result and thereby becomes defunct.",
    "mn101:28": "‘But is it possible that an actionwhose resultis not to be experienced can, through exertion and striving, become onewhose resultis to be experienced?’",
    "mn101:29": "\"‘So it seems, friend Nigaṇṭhas, that it is impossible that an actionwhose resultis to be experienced here and now can, through exertion and striving, become onewhose resultis to be experienced in the next life, and impossible that an actionwhose resultis to be experienced in the next life can, through exertion and striving, become onewhose resultis to be experienced here and now; impossible that an actionwhose resultis to be experienced as pleasant can, through exertion and striving, become onewhose resultis to be experienced as painful, and impossible that an actionwhose resultis to be experienced as painful can, through exertion and striving, become onewhose resultis to be experienced as pleasant; impossible that an actionwhose resultis to be experienced in a maturedpersonalitycan, by exertion and striving, become onewhose resultis to be experienced in an unmaturedpersonality, and impossible that an actionwhose resultis to be experienced in an unmaturedpersonalitycan, through exertion and striving, become onewhose resultis to be experienced in a maturedpersonality; impossible that an actionwhose resultis to be much experienced can, through exertion and striving, become onewhose resultis to be little experienced, and impossible that an actionwhose resultis to be little experienced can, through exertion and striving, become onewhose resultis to be much experienced; impossible that an actionwhose resultis to be experienced can, through exertion and striving, become onewhose resultis not to be experienced, and impossible that an actionwhose resultis not to be experienced can, through exertion and striving, become onewhose resultis to be experienced. That being so, the venerable Nigaṇṭhas’ exertion is fruitless, their striving is fruitless.’",
    "mn101:30": "\"So speak the Nigaṇṭhas, bhikkhus. And because the Nigaṇṭhas speak thus, there are ten legitimate deductions from their assertions that provide ground for censuring them:",
    "mn101:31": "(1) \"If the pleasure and pain that beings feel are caused by what was done in the past, then the Nigaṇṭhas surely must have done bad deeds in the past, since they now feel such painful, racking, piercing feelings.",
    "mn101:32": "(6) \"If the pleasure and pain that beings feel are caused by what was done in the past, then the Nigaṇṭhas are to be censured; if not, then the Nigaṇṭhas are still to be censured.",
    "mn101:33": "\"And how is exertion fruitful, bhikkhus, how is striving fruitful? Here, bhikkhus, a bhikkhu who is not overwhelmed with suffering does not overwhelm himself with suffering; and he does not give up the pleasure that accords with Dhamma, yet he is not infatuated with that pleasure.[n.932] This is a formulation of the Buddha’s Middle Way, which avoids the extreme of self-mortification without falling into the other extreme of infatuation with sensual pleasure.He knows thus: ‘When I strive with determination, this particular source of suffering fades away in me because of that determined striving; and when I look on with equanimity, this particular source of suffering fades away in me while I develop equanimity.’[n.9]MAexplains the source of suffering to be craving, so called because it is the root of the suffering comprised in the five aggregates. The passage shows two alternative approaches toward overcoming craving — one employing energetic striving, the other detached equanimity. The \"fading away\" of the source is identified by MA with the supramundane path. The passage is said to illustrate the practice of one who progresses on a pleasant path with quick direct knowledge(sukhapaṭipadā khippābhiññā̄).He strives with determination in regard to that particular source of suffering which fades away in him because of that determined striving; and he develops equanimity in regard to that particular source of suffering which fades away in him while he is developing equanimity. When he strives with determination, such and such a source of suffering fades away in him because of that determined striving; thus that suffering is exhausted in him. When he looks on with equanimity, such and such a source of suffering fades away in him while he develops equanimity; thus that suffering is exhausted in him.",
    "mn101:34": "\"Suppose, bhikkhus, a man loved a woman with his mind bound to her by intense desire and passion. He might see that woman standing with another man, chatting, joking, and laughing. What do you think, bhikkhus? Would not sorrow, lamentation, pain, grief, and despair arise in that man when he sees that woman standing with another man, chatting, joking, and laughing?\"",
    "mn101:35": "\"So too, bhikkhus, when a bhikkhu who is not overwhelmed with suffering does not overwhelm himself with suffering; and he does not give up the pleasure that accords with Dhamma, yet he is not infatuated with that pleasure. He knows thus: ‘When I strive with determination, this particular source of suffering fades away in me because of that determined striving; and when I look on with equanimity, this particular source of suffering fades away in me while I develop equanimity.’ He strives with determination in regard to that particular source of suffering which fades away in him because of that determined striving; and he develops equanimity in regard to that particular source of suffering which fades away in him while he is developing equanimity. When he strives with determination, such and such a source of suffering fades away in him because of that determined striving; thus that suffering is exhausted in him. When he looks on with equanimity, such and such a source of suffering fades away in him while he develops equanimity; thus that suffering is exhausted in him. Thus, bhikkhus, the exertion is fruitful, the striving is fruitful.",
    "mn101:36": "\"Again, bhikkhus, a bhikkhu considers thus: ‘While I live according to my pleasure, unwholesome states increase in me and wholesome states diminish; but when I exert myself in what is painful, unwholesome states diminish in me and wholesome states increase. What if I exert myself in what is painful?’ He exerts himself in what is painful. When he does so, unwholesome states diminish in him and wholesome states increase.[n.934] This passage is brought forth to show the Buddha’s reason for permitting his monks to undertake the ascetic practices(dhutaṅga): the moderate use of austerities is conducive to overcoming the defilements; but they are not undertaken to wear away old kamma and to purify the soul, as the Jains and other ascetic sects believed. MA says that this passage illustrates the practice of one who progresses on a difficult path with sluggish direct knowledgedukkhapaṭipadā (dandhābhiññā).At a later time he does not exert himself in what is painful. Why is that? The purpose for which that bhikkhu exerted himself in what is painful has been achieved; that is why at a later time he does not exert himself in what is painful.",
    "mn101:37": "\"Suppose, bhikkhus, an arrowsmith were warming and heating an arrow shaft between two flames, making it straight and workable. When the arrow shaft had been warmed and heated between the two flames and had been made straight and workable, then at a later time he would not again warm and heat the arrow shaft and make it straight and workable. Why is that? The purpose for which that arrowsmith had warmed and heated the arrow and made it straight and workable has been achieved; that is why at a later time he would not again warm and heat the arrow shaft and make it straight and workable.",
    "mn101:38": "\"Again, bhikkhus, here a Tathāgata appears in the world, accomplished, fully enlightened, perfect in true knowledge and conduct, sublime, knower of worlds, incomparable leader of persons to be tamed, teacher of gods and humans, enlightened, blessed. He declares this world with its gods, its Māras, and its Brahmās, this generation with its recluses and brahmins, its princes and its people, which he has himself realised by direct knowledge. He teaches the Dhamma good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, and he reveals a holy life that is utterly perfect and pure.",
    "mn101:39": "\"Having thus gone forth and possessing the bhikkhus’ training and way of life, abandoning the killing of living beings, he abstains from killing living beings; with rod and weapon laid aside, conscientious, merciful, he abides compassionate to all living beings. Abandoning the taking of what is not given, he abstains from taking what is not given; taking only what is given, expecting only what is given, by not stealing he abides in purity. Abandoning incelibacy, he observes celibacy, living apart, abstaining from the vulgar practice of sexual intercourse.",
    "mn101:40": "\"He becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Just as a bird, wherever it goes, flies with its wings as its only burden, so too, the bhikkhu becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Possessing this aggregate of noble virtue, he experiences within himself a bliss that is blameless.",
    "mn101:41": "\"On seeing a form with the eye, he does not grasp at its signs and features. Since, if he left the eye faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the eye faculty, he undertakes the restraint of the eye faculty. On hearing a sound with the ear … On smelling an odour with the nose … On tasting a flavour with the tongue … On touching a tangible with the body … On cognizing a mind-object with the mind, he does not grasp at its signs and features. Since, if he left the mind faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the mind faculty, he undertakes the restraint of the mind faculty. Possessing this noble restraint of the faculties, he experiences within himself a bliss that is unsullied.",
    "mn101:42": "\"He becomes one who acts in full awareness when going forward and returning; who acts in full awareness when looking ahead and looking away; who acts in full awareness when flexing and extending his limbs; who acts in full awareness when wearing his robes and carrying his outer robe and bowl; who acts in full awareness when eating, drinking, consuming food, and tasting; who acts in full awareness when defecating and urinating; who acts in full awareness when walking, standing, sitting, falling asleep, waking up, talking, and keeping silent.",
    "mn101:43": "\"Possessing this aggregate of noble virtue, and this noble restraint of the faculties, and possessing this noble mindfulness and full awareness, he resorts to a secluded resting place: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw.",
    "mn101:44": "\"Having thus abandoned these five hindrances, imperfections of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. Thus too, bhikkhus, the exertion is fruitful, the striving is fruitful.",
    "mn101:45": "\"Again, bhikkhus, with the stilling of applied and sustained thought, a bhikkhu enters upon and abides in the second jhāna, which has self-confidence and singleness of mind without applied and sustained thought, with rapture and pleasure born of concentration. Thus too, bhikkhus, the exertion is fruitful, the striving is fruitful.",
    "mn101:46": "\"Again, bhikkhus, with the fading away as well of rapture, a bhikkhu abides in equanimity, and mindful and fully aware, still feeling pleasure with the body, he enters upon and abides in the third jhāna, on account of which noble ones announce: ‘He has a pleasant abiding who has equanimity and is mindful.’ Thus too, bhikkhus, the exertion is fruitful, the striving is fruitful.",
    "mn101:47": "\"Again, bhikkhus, with the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, a bhikkhu enters upon and abides in the fourth jhāna, which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity. Thus too, bhikkhus, the exertion is fruitful, the striving is fruitful.",
    "mn101:48": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the recollection of past lives. He recollects his manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion: ‘There I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared elsewhere; and there too I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared here.’ Thus with their aspects and particulars he recollects his manifold past lives. Thus too, bhikkhus, the exertion is fruitful, the striving is fruitful.",
    "mn101:49": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the passing away and reappearance of beings. With the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate. He understands how beings pass on according to their actions thus: ‘These worthy beings who were ill conducted in body, speech, and mind, revilers of noble ones, wrong in their views, giving effect to wrong view in their actions, on the dissolution of the body, after death, have reappeared in a state of deprivation, in a bad destination, in perdition, even in hell; but these worthy beings who were well conducted in body, speech, and mind, not revilers of noble ones, right in their views, giving effect to right view in their actions, on the dissolution of the body, after death, have reappeared in a good destination, even in the heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and he understands how beings pass on according to their actions. Thus too, bhikkhus, the exertion is fruitful, the striving is fruitful.",
    "mn101:50": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the destruction of the taints. He understands as it actually is: ‘This is suffering’; … ‘This is the origin of suffering’; … ‘This is the cessation of suffering’; … ‘This is the way leading to the cessation of suffering’; … ‘These are the taints’; … ‘This is the origin of the taints’; … ‘This is the cessation of the taints’; … ‘This is the way leading to the cessation of the taints.’",
    "mn101:51": "(1) \"If the pleasure and pain that beings feel are caused by what was done in the past, then the Tathāgata surely must have done good deeds in the past, since he now feels such taintless pleasant feelings.",
    "mn101:52": "(6) \"If the pleasure and pain that beings feel are caused by what was done in the past, then the Tathāgata is to be praised; if not, then the Tathāgata is still to be praised.",
    "mn101:53": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}