{
    "mn104:1": "Thus have I heard. On one occasion the Blessed One was living in the Sakyan country at Sāmagāma.",
    "mn104:2": "Then the novice Cunda,[n.978] The novice Cunda was the younger brother of Ven. Sāriputta.who had spent the Rains at Pāvā, went to the venerable Ānanda, and after paying homage to him, he sat down at one side and told him what was taking place.",
    "mn104:3": "Then the venerable Ānanda and the novice Cunda went together to the Blessed One. After paying homage to him, they sat down at one side, and the venerable Ānanda said to the Blessed One: \"This novice Cunda, venerable sir, says thus: ‘Venerable sir, the Nigaṇṭha Nātaputta has just died. On his death the Nigaṇṭhas divided, split into two … and is now with its shrine broken, left without a refuge.’ I thought, venerable sir: ‘Let no dispute arise in the Saṅgha when the Blessed One has gone. For such a dispute would be for the harm and unhappiness of many, for the loss, harm, and suffering of gods and humans.’\"",
    "mn104:4": "\"What do you think, Ānanda? These things that I have taught you after directly knowing them — that is, the four foundations of mindfulness, the four right kinds of striving, the four bases for spiritual power, the five faculties, the five powers, the seven enlightenment factors, the Noble Eightfold Path — do you see, Ānanda, even two bhikkhus who make differing assertions about these things?\"",
    "mn104:5": "\"A dispute about livelihood or about the Pāṭimokkha would be trifling, Ānanda. But should a dispute arise in the Saṅgha about the path or the way,[n.980] This would be a dispute about the Noble Eightfold Path or the other aids to enlightenment.such a dispute would be for the harm and unhappiness of many, for the loss, harm, and suffering of gods and humans.",
    "mn104:6": "\"There are, Ānanda, these six roots of disputes.[n.981] The first four pairs are included among the \"imperfections that defile the mind\" atMN 7.3.What six? Here, Ānanda, a bhikkhu is angry and resentful. Such a bhikkhu dwells disrespectful and undeferential towards the Teacher, towards the Dhamma, and towards the Saṅgha, and he does not fulfil the training. A bhikkhu who dwells disrespectful and undeferential towards the Teacher, towards the Dhamma, and towards the Saṅgha, and who does not fulfil the training, creates a dispute in the Saṅgha, which would be for the harm and unhappiness of many, for the loss, harm, and suffering of gods and humans. Now if you see any such root of dispute either in yourselves or externally, you should strive to abandon that same evil root of dispute. And if you do not see any such root of dispute either in yourselves or externally, you should practise in such a way that that same evil root of dispute does not erupt in the future. Thus there is the abandoning of that evil root of dispute; thus there is the non-eruption of that evil root of dispute in the future.",
    "mn104:7": "\"Again, a bhikkhu is contemptuous and insolent … envious and avaricious … fraudulent and deceitful … has evil wishes and wrong view … adheres to his own views, holds on to them tenaciously, and relinquishes them with difficulty. Such a bhikkhu dwells disrespectful and undeferential towards the Teacher, towards the Dhamma, and towards the Saṅgha, and he does not fulfil the training. A bhikkhu who dwells disrespectful and undeferential towards the Teacher, towards the Dhamma, and towards the Saṅgha, and who does not fulfil the training, creates a dispute in the Saṅgha, which would be for the harm and unhappiness of many, for the loss, harm, and suffering of gods and humans. Now if you see any such root of dispute either in yourselves or externally, you should strive to abandon that same evil root of dispute. And if you do not see any such root of dispute either in yourselves or externally, you should practise in such a way that that same evil root of dispute does not erupt in the future. Thus there is the abandoning of that evil root of dispute; thus there is the non-eruption of that evil root of dispute in the future. These are the six roots of dispute.",
    "mn104:8": "\"Ānanda, there are these four kinds of litigation. What four? Litigation because of a dispute, litigation because of an accusation, litigation because of an offence, and litigation concerning proceedings. These are the four kinds of litigation.[n.92]Adhikaraṇa.Horner translates \"legal questions.\" They are dealt with at length atVin Cv Kh 4/Vin ii.–93; see Horner,Book of the Discipline,5:117–25. Briefly, litigation because of a dispute(vivādādhikaraṇa)arises when bhikkhus dispute about the Dhamma and the Discipline; litigation because of an accusation(anuvādādhikaraṇa)when bhikkhus accuse a bhikkhu of committing a transgression of the monastic rules; litigation because of an offence(āpattādhikaraṇa)when a bhikkhu who has committed a transgression seeks to exonerate himself from it; and litigation concerning procedures(kiccādhikarana)deals with the enactment of the formal functions of the Saṅgha.",
    "mn104:9": "\"And how is there removal of litigation by confrontation?[n.84]Sammukhāvinaya.Horner translates \"verdict in the presence of.\" At Vin ii.3, this is explained as confrontation with (or presence of) the Saṅgha, the Dhamma, the Discipline, and the individuals who are parties to the dispute. This kind of settlement applies to all four kinds of litigation, with minor differences in formulation.Here bhikkhus are disputing: ‘It is Dhamma,’ or ‘It is not Dhamma,’ or ‘It is Discipline,’ or ‘It is not Discipline.’ Those bhikkhus should all meet together in concord. Then, having met together, the guideline of the Dhamma should be drawn out.[n.85]Dhammanetti samanumajjitabbā.MAgives as an example ofdhammanettithe ten courses of wholesome and unwholesome conduct, but says that here the Dhamma and Discipline themselves are meant.Once the guideline of the Dhamma has been drawn out, that litigation should be settled in a way that accords with it. Such is the removal of litigation by confrontation. And so there comes to be the settlement of some litigations here by removal of litigation by confrontation.",
    "mn104:10": "\"And how is there the opinion of a majority? If those bhikkhus cannot settle that litigation in that dwelling place, they should go to a dwelling place where there is a greater number of bhikkhus. There they should all meet together in concord. Then, having met together, the guideline of the Dhamma should be drawn out. Once the guideline of the Dhamma has been drawn out, that litigation should be settled in a way that accords with it. Such is the opinion of a majority. And so there comes to be the settlement of some litigations here by the opinion of a majority.",
    "mn104:11": "\"And how is there removal of litigation on account of memory?[n.986]Sativinaya.Horner renders \"verdict of innocence\". At Vin ii.80, it is said that this is given when a bhikkhu is pure and without offences and he is reproached with an offence; he must ask the Saṅgha to give him such a verdict by appeal to his full and accurate recollection of his behaviour.Here one bhikkhu reproves another bhikkhu for such and such a grave offence, one involving defeat or bordering on defeat:[n.987] An offence involving defeat, apārājikaoffence, requires expulsion from the Saṅgha. An offence bordering on defeat is either asaṅghādisesaoffence, which requires a formal meeting of the Saṅgha and a period of temporary penalisation, or the preliminary steps leading to apārājikaoffence. I follow BBS and SBJ, which have one bhikkhu as accuser, rather than PTS, which uses a plural form. So too below.‘Does the venerable one remember having committed such and such a grave offence, one involving defeat or bordering on defeat?’ He says: ‘I do not, friends, remember having committed such and such a grave offence, one involving defeat or bordering on defeat.’ In his case removal of litigation on account of memory should be pronounced. Such is the removal of litigation on account of memory. And so there comes to be the settlement of some litigations here by removal of litigation on account of memory.",
    "mn104:12": "\"And how is there removal of litigation on account of past insanity?[n.988]Amūḷhavinaya.A verdict of past insanity is given when a bhikkhu commits offences during a period of madness. The criterion for determining insanity is that he must have no recollection of his behaviour during the period for which the verdict is requested.Here one bhikkhu reproves another bhikkhu for such and such a grave offence, one involving defeat or bordering on defeat: ‘Does the venerable one remember having committed such and such a grave offence, one involving defeat or bordering on defeat?’ He says: ‘I do not, friends, remember having committed such and such a grave offence, one involving defeat or bordering on defeat.’ Despite the denial, the former presses the latter further: ‘Surely the venerable one must know quite well if he remembers having committed such and such a grave offence, one involving defeat or bordering on defeat?’ He says: ‘I had gone mad, friend, I was out of my mind, and when I was mad I said and did many things improper for a recluse. I do not remember, I was mad when I did that.’ In his case removal of litigation on account of past insanity should be pronounced. Such is the removal of litigation on account of past insanity. And so there comes to be the settlement of some litigations here by removal of litigation on account of past insanity.",
    "mn104:13": "\"And how is there the effecting of acknowledgement of an offence? Here a bhikkhu, whether reproved or unreproved, remembers an offence, reveals it, and discloses it. He should go to a senior bhikkhu, and after arranging his robe on one shoulder, he should pay homage at his feet. Then, sitting on his heels, he should raise his hands palms together and say: ‘Venerable sir, I have committed such and such an offence; I confess it.’ The other says: ‘Do you see?’ — ‘Yes, I see.’ — ‘Will you practise restraint in the future?’ — ‘I will practise restraint in the future.’ Such is the effecting of acknowledgement of an offence.[n.989] The procedure described is the established method by which a bhikkhu obtains exoneration for his transgression when he has fallen into any offence that can be cleared by confession.And so there comes to be the settlement of some litigations here by the effecting of acknowledgement of an offence.",
    "mn104:14": "\"And how is there the pronouncement of bad character against someone?[n.990]Pāpiyyāsikā.Horner renders \"decision for specific depravity.\" This verdict is pronounced against a bhikkhu who is a maker of strife and quarrels in the Saṅgha, who is ignorant and full of offences, or who lives in unbecoming association with householders.Here one bhikkhu reproves another for such and such a grave offence, one involving defeat or bordering on defeat: ‘Does the venerable one remember having committed such and such a grave offence, one involving defeat or bordering on defeat?’ He says: ‘I do not, friends, remember having committed such and such a grave offence, one involving defeat or bordering on defeat.’ Despite the denial, the former presses the latter further: ‘Surely the venerable one must know quite well if he remembers having committed such and such a grave offence, one involving defeat or bordering on defeat?’ He says: ‘I do not, friends, remember having committed such and such a grave offence, one involving defeat or bordering on defeat. But, friends, I remember having committed such and such a minor offence.’ Despite the denial, the former presses the latter further: ‘Surely the venerable one must know quite well if he remembers having committed such and such a grave offence, one involving defeat or bordering on defeat?’ He says: ‘Friends, when not asked I acknowledge having committed this minor offence; so when asked, why shouldn’t I acknowledge having committed such and such a grave offence, one involving defeat or bordering on defeat?’ The other says: ‘Friend, if you had not been asked, you would not have acknowledged committing this minor offence; so why, when asked, would you acknowledge having committed such and such a grave offence, one involving defeat or bordering on defeat? Surely the venerable one must know quite well if he remembers having committed such and such a grave offence, one involving defeat or bordering on defeat?’ He says: ‘I remember, friends, having committed such and such a grave offence, one involving defeat or bordering on defeat. I was joking, I was raving, when I said that I did not remember having committed such and such a grave offence, one involving defeat or bordering on defeat.’ Such is the pronouncement of bad character against someone. And so there comes to be the settlement of some litigations here by the pronouncement of bad character against someone.",
    "mn104:15": "\"And how is there covering over with grass?[n.991]Tiṇavatthāraka.This means of settlement is resorted to when the Saṅgha has been involved in a dispute in the course of which the bhikkhus committed many minor offences. Since to pursue charges for these offences might prolong the conflict, the offences are cleared by the means described in the sutta.MAexplains that this method is like throwing grass over excrement to remove the bad smell, hence the name \"covering over with grass.\"Here when bhikkhus have taken to quarreling and brawling and are deep in disputes, they may have said and done many things improper for a recluse. Those bhikkhus should all meet together in concord. When they have met together, a wise bhikkhu among the bhikkhus who side together on the one part should rise from his seat, and after arranging his robe on one shoulder, he should raise his hands, palms together, and call for an enactment of the Saṅgha thus:",
    "mn104:16": "‘Let the venerable Saṅgha hear me. When we took to quarreling and brawling and were deep in disputes, we said and did many things improper for a recluse. If it is approved by the Saṅgha, then for the good of these venerable ones and for my own good, in the midst of the Saṅgha I shall confess, by the method of covering over with grass, any offences of these venerable ones and any offences of my own, except for those which call for serious censure and those connected with the laity.’[n.992] Offences calling for serious censure are those of thepārājikaandsaṅghādisesaclasses. Those connected with the laity are cases where a bhikkhu reviles and disparages householders.",
    "mn104:17": "\"Then a wise bhikkhu among the bhikkhus who side together on the other part should rise from his seat, and after arranging his robe on one shoulder, he should raise his hands, palms together, and call for an enactment of the Saṅgha thus:",
    "mn104:18": "‘Let the venerable Saṅgha hear me. When we took to quarreling and brawling and were deep in disputes, we said and did many things improper for a recluse. If it is approved by the Saṅgha, then for the good of these venerable ones and for my own good, in the midst of the Saṅgha I shall confess, by the method of covering over with grass, any offences of these venerable ones and any offences of my own, except for those which call for serious censure and those connected with the laity.’",
    "mn104:19": "Such is the covering over with grass. And so there comes to be the settlement of some litigations here by the covering over with grass.",
    "mn104:20": "\"Ānanda, there are these six principles of cordiality that create love and respect, and conduce to cohesion, to non-dispute, to concord, and to unity.[n.993] As atMN 48.6.What are the six?",
    "mn104:21": "\"Again, a bhikkhu maintains verbal acts of loving-kindness both in public and in private towards his companions in the holy life. This too is a principle of cordiality that creates love and respect, and conduces to … unity.",
    "mn104:22": "\"Again, a bhikkhu maintains mental acts of loving-kindness both in public and in private towards his companions in the holy life. This too is a principle of cordiality that creates love and respect, and conduces to … unity.",
    "mn104:23": "\"Again, a bhikkhu enjoys things in common with his virtuous companions in the holy life; without making reservations, he shares with them any gain of a kind that accords with the Dhamma and has been obtained in a way that accords with the Dhamma, including even what is in his bowl. This too is a principle of cordiality that creates love and respect, and conduces to … unity.",
    "mn104:24": "\"Again, a bhikkhu dwells both in public and in private possessing in common with his companions in the holy life those virtues that are unbroken, untorn, unblotched, unmottled, liberating, commended by the wise, not misapprehended, and conducive to concentration. This too is a principle of cordiality that creates love and respect and conduces to … unity.",
    "mn104:25": "\"Again, a bhikkhu dwells both in public and in private possessing in common with his companions in the holy life that view that is noble and emancipating, and leads the one who practises in accordance with it to the complete destruction of suffering. This too is a principle of cordiality that creates love and respect, and conduces to cohesion, to non-dispute, to concord, and to unity.",
    "mn104:26": "\"These are the six principles of cordiality that create love and respect, and conduce to cohesion, to non-dispute, to concord, and to unity.",
    "mn104:27": "\"If, Ānanda, you undertake and maintain these six principles of cordiality, do you see any course of speech, trivial or gross, that you could not endure?\"[n.994] AtMN 21.21, this is said with reference to the simile of the saw.— \"No, venerable sir.\" — \"Therefore, Ānanda, undertake and maintain these six principles of cordiality. That will lead to your welfare and happiness for a long time.\"",
    "mn104:28": "That is what the Blessed One said. The venerable Ānanda was satisfied and delighted in the Blessed One's words."
}