{
    "mn109:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in the Eastern Park, in the Palace of Migāra's Mother.",
    "mn109:2": "\"Venerable sir, I would ask the Blessed One about a certain point, if the Blessed One would grant me an answer to my question.\" — \"Sit on your own seat, bhikkhu, and ask what you like.\"",
    "mn109:3": "So the bhikkhu sat on his own seat and said to the Blessed One:",
    "mn109:4": "Saying, \"Good, venerable sir,\" the bhikkhu delighted and rejoiced in the Blessed One's words. Then he asked him a further question:",
    "mn109:5": "\"But, venerable sir, can there be diversity in the desire and lust regarding these five aggregates affected by clinging?\"",
    "mn109:6": "\"But, venerable sir, in what way does the term ‘aggregates’ apply to the aggregates?\"",
    "mn109:7": "\"What is the cause and condition, venerable sir, for the manifestation of the material form aggregate? What is the cause and condition for the manifestation of the feeling aggregate … the perception aggregate … the formations aggregate … the consciousness aggregate?\"",
    "mn109:8": "\"The four great elements, bhikkhu, are the cause and condition for the manifestation of the material form aggregate. Contact is the cause and condition for the manifestation of the feeling aggregate. Contact is the cause and the condition for the manifestation of the perception aggregate. Contact is the cause and condition for the manifestation of the formations aggregate. Mentality-materiality is the cause and condition for the manifestation of the consciousness aggregate.\"[n.1040] In the material form aggregate each of the four great elements is a condition for the other three and for derived material form. Contact is a condition for each of the three middle aggregates, as it is said: \"Contacted one feels, bhikkhus; contacted one perceives; contacted one wills\" (SN 35:93/iv.6). MA explains that at the moment of conception, the material phenomena and the three mental aggregates that arise are the mentality-materiality that is a condition for the rebirth consciousness. During the course of life the physical sense faculties and the sense objects together with the three mental aggregates are the mentality-materiality that is a condition for sense consciousness.",
    "mn109:9": "\"Venerable sir, how does identity view come to be?\"[n.1041] As atMN 44.7–8.",
    "mn109:10": "\"But, venerable sir, how does identity view not come to be?\"",
    "mn109:11": "\"What, venerable sir, is the gratification, what is the danger, and what is the escape in the case of material form? What is the gratification, what is the danger, and what is the escape in the case of feeling … in the case of perception … in the case of formations … in the case of consciousness?\"",
    "mn109:12": "\"Venerable sir, how does one know, how does one see, so that in regard to this body with its consciousness and all external signs, there is no I-making, mine-making, and underlying tendency to conceit?\"",
    "mn109:13": "Then, in the mind of a certain bhikkhu this thought arose: \"So, it seems, material form is not self, feeling is not self, perception is not self, formations are not self, consciousness is not self. What self, then, will actions done by the not-self affect?\"[n.1023] It seems that this bhikkhu had difficulty in understanding how kamma can produce results without a self to receive them.",
    "mn109:14": "\"Bhikkhus, what do you think? Is material form permanent or impermanent?\" — \"Impermanent, venerable sir.\" — \"Is what is impermanent suffering or happiness?\" — \"Suffering, venerable sir.\" — \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" — \"No, venerable sir.\"",
    "mn109:15": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words. Now while this discourse was being spoken, through not clinging the minds of sixty bhikkhus were liberated from the taints.[n.1044]MA: The sixty bhikkhus discarded their original meditation subjects and investigated a new subject (based on the Buddha’s discourse, MṬ). Without breaking their posture, right in their seats they attained arahantship."
}