{
    "mn107:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in the Eastern Park, in the Palace of Migāra's Mother. Then the brahmin Gaṇaka Moggallāna went to the Blessed One and exchanged greetings with him. When this courteous and amiable talk was finished, he sat down at one side and said to the Blessed One:",
    "mn107:2": "\"Master Gotama, in this Palace of Migāra's Mother there can be seen gradual training, gradual practice, and gradual progress, that is, down to the last step of the staircase.[n.104]MA: It is not possible to construct a seven-storied mansion in a single day. Once the site is cleared, from the time the foundation is laid until the paint job is finished there is gradual progress.Among these brahmins too, there can be seen gradual training, gradual practice, and gradual progress, that is, in study. Among archers too, there can be seen gradual training … that is, in archery. And also among accountants[n.105]Gaṇaka.His name means \"Moggallāna the Accountant.\"like us, who earn our living by accountancy, there can be seen gradual training … that is, in computation. For when we get an apprentice first we make him count: one one, two twos, three threes, four fours, five fives, six sixes, seven sevens, eight eights, nine nines, ten tens; and we make him count a hundred too. Now is it also possible, Master Gotama, to describe gradual training, gradual practice, and gradual progress in this Dhamma and Discipline?\"",
    "mn107:3": "\"It is possible, brahmin, to describe gradual training, gradual practice, and gradual progress in this Dhamma and Discipline. Just as, brahmin, when a clever horse-trainer obtains a fine thoroughbred colt, he first makes him get used to wearing the bit, and afterwards trains him further,[n.1026] SeeMN 65..so when the Tathāgata obtains a person to be tamed he first disciplines him thus: ‘Come, bhikkhu, be virtuous, restrained with the restraint of the Pāṭimokkha, be perfect in conduct and resort, and seeing fear in the slightest fault, train by undertaking the training precepts.’",
    "mn107:4": "\"When, brahmin, the bhikkhu is virtuous … and seeing fear in the slightest fault, trains by undertaking the training precepts, then the Tathāgata disciplines him further: ‘Come, bhikkhu, guard the doors of your sense faculties. On seeing a form with the eye, do not grasp at its signs and features. Since, if you were to leave the eye faculty unguarded, evil unwholesome states of covetousness and grief might invade you, practise the way of its restraint, guard the eye faculty, undertake the restraint of the eye faculty. On hearing a sound with the ear … On smelling an odour with the nose … On tasting a flavour with the tongue … On touching a tangible with the body … On cognizing a mind-object with the mind, do not grasp at its signs and features. Since, if you were to leave the mind faculty unguarded, evil unwholesome states might invade you, practise the way of its restraint, guard the mind faculty, undertake the restraint of the mind faculty.’",
    "mn107:5": "\"When, brahmin, the bhikkhu guards the doors of his sense faculties, then the Tathāgata disciplines him further: ‘Come, bhikkhu, be moderate in eating. Reflecting wisely, you should take food neither for amusement nor for intoxication nor for the sake of physical beauty and attractiveness, but only for the endurance and continuance of this body, for ending discomfort, and for assisting the holy life, considering: \"Thus I shall terminate old feelings without arousing new feelings and I shall be healthy and blameless and shall live in comfort.\"’",
    "mn107:6": "\"When, brahmin, the bhikkhu is moderate in eating, then the Tathāgata disciplines him further: ‘Come, bhikkhu, be devoted to wakefulness. During the day, while walking back and forth and sitting, purify your mind of obstructive states. In the first watch of the night, while walking back and forth and sitting, purify your mind of obstructive states. In the middle watch of the night you should lie down on the right side in the lion's pose with one foot overlapping the other, mindful and fully aware, after noting in your mind the time for rising. After rising, in the third watch of the night, while walking back and forth and sitting, purify your mind of obstructive states.’",
    "mn107:7": "\"When, brahmin, the bhikkhu is devoted to wakefulness, then the Tathāgata disciplines him further: ‘Come, bhikkhu, be possessed of mindfulness and full awareness. Act in full awareness when going forward and returning; act in full awareness when looking ahead and looking away; act in full awareness when flexing and extending your limbs; act in full awareness when wearing your robes and carrying your outer robe and bowl; act in full awareness when eating, drinking, consuming food, and tasting; act in full awareness when defecating and urinating; act in full awareness when walking, standing, sitting, falling asleep, waking up, talking, and keeping silent.’",
    "mn107:8": "\"When, brahmin, the bhikkhu possesses mindfulness and full awareness, then the Tathāgata disciplines him further: ‘Come, bhikkhu, resort to a secluded resting place: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw.’",
    "mn107:9": "\"Having thus abandoned these five hindrances, imperfections of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. With the stilling of applied and sustained thought, he enters upon and abides in the second jhāna, which has self-confidence and singleness of mind without applied and sustained thought, with rapture and pleasure born of concentration. With the fading away as well of rapture, he abides in equanimity, and mindful and fully aware, still feeling pleasure with the body, he enters upon and abides in the third jhāna, on account of which noble ones announce: ‘He has a pleasant abiding who has equanimity and is mindful.’ With the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, he enters upon and abides in the fourth jhāna, which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity.",
    "mn107:10": "\"This is my instruction, brahmin, to those bhikkhus who are in the higher training, whose minds have not yet attained the goal, who abide aspiring to the supreme security from bondage. But these things conduce both to a pleasant abiding here and now and to mindfulness and full awareness for those bhikkhus who are arahants with taints destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached their own goal, destroyed the fetters of being, and are completely liberated through final knowledge.\"[n.27] While the preceding steps of practice are necessary measures for bhikkhus in training to attain arahantship, they are also beneficial to arahants in that they conduce to \"a pleasant abiding here and now.\"MAidentifies this \"abiding\" with the attainment of the fruit of arahantship, and explains that some arahants can enter fruition easily at any time while others must apply themselves diligently to the steps of practice to enter fruition.",
    "mn107:11": "When this was said, the brahmin Gaṇaka Moggallāna asked the Blessed One: \"When Master Gotama's disciples are thus advised and instructed by him, do they all attain Nibbāna, the ultimate goal, or do some not attain it?\"",
    "mn107:12": "\"Master Gotama, since Nibbāna exists and the path leading to Nibbāna exists and Master Gotama is present as the guide, what is the cause and reason why, when Master Gotama's disciples are thus advised and instructed by him, some of them attain Nibbāna, the ultimate goal, and some do not attain it?\"",
    "mn107:13": "\"As to that, brahmin, I will ask you a question in return. Answer it as you choose. What do you think, brahmin? Are you familiar with the road leading to Rājagaha?\"",
    "mn107:14": "\"So too, brahmin, Nibbāna exists and the path leading to Nibbāna exists and I am present as the guide. Yet when my disciples have been thus advised and instructed by me, some of them attain Nibbāna, the ultimate goal, and some do not attain it. What can I do about that, brahmin? The Tathāgata is one who shows the way.\"[n.1028]Maggakkhāyī Tathāgato.CompareDhp 276: \"You yourselves must strive; the Tathāgatas only point the way.\"",
    "mn107:15": "When this was said, the brahmin Gaṇaka Moggallāna said to the Blessed One:[n.1029] The following as atMN 5.32.\"There are persons who are faithless and have gone forth from the home life into homelessness not out of faith but seeking a livelihood, who are fraudulent, deceitful, treacherous, haughty, hollow, personally vain, rough-tongued, loose-spoken, unguarded in their sense faculties, immoderate in eating, undevoted to wakefulness, unconcerned with recluseship, not greatly respectful of training, luxurious, careless, leaders in backsliding, neglectful of seclusion, lazy, wanting in energy, unmindful, not fully aware, unconcentrated, with straying minds, devoid of wisdom, drivellers. Master Gotama does not dwell together with these.",
    "mn107:16": "\"But there are clansmen who have gone forth out of faith from the home life into homelessness, who are not fraudulent, deceitful, treacherous, haughty, hollow, personally vain, rough-tongued, and loose-spoken; who are guarded in their sense faculties, moderate in eating, devoted to wakefulness, concerned with recluseship, greatly respectful of training, not luxurious or careless, who are keen to avoid backsliding, leaders in seclusion, energetic, resolute, established in mindfulness, fully aware, concentrated, with unified minds, possessing wisdom, not drivellers. Master Gotama dwells together with these.",
    "mn107:17": "\"Just as black orris root is reckoned as the best of root perfumes and red sandalwood is reckoned as the best of wood perfumes and jasmine is reckoned as the best of flower perfumes, so too, Master Gotama's advice is supreme among the teachings of today.[n.1030]Paramajjadhammesu.MA: The doctrine of Gotama is supreme, the highest, among contemporary teachings — the teachings of the six outside teachers.",
    "mn107:18": "\"Magnificent, Master Gotama! Magnificent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overturned, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. Let Master Gotama remember me as a lay follower who has gone to him for refuge for life.\""
}