{
    "mn105:1": "Thus have I heard. On one occasion the Blessed One was living at Vesālī in the Great Wood in the Hall with the Peaked Roof.",
    "mn105:2": "Sunakkhatta,The Sunakkhatta SuttaMN105had been expounded to him by the Buddha, apparently before he joined the Saṅgha; the account of his defection is given in the Pāṭika SuttaDN4.He became dissatisfied and left the Order because the Buddha would not perform any miracles for him or explain to him the beginning of things.son of the Licchavis,[n.995] See the Mahāsīhanāda SuttaMN1, andn. 177heard: \"A number of bhikkhus, it seems, have declared final knowledge in the presence of the Blessed One thus: ‘We understand: Birth is destroyed … there is no more coming to any state of being.’\" Then Sunakkhatta, son of the Licchavis, went to the Blessed One, and after paying homage to him, he sat down at one side and said to the Blessed One:",
    "mn105:3": "\"When those bhikkhus, Sunakkhatta, declared final knowledge in my presence, there were some bhikkhus who declared final knowledge rightly and there were some who declared final knowledge because they overestimated themselves.[n.996]Adhimānena.MA:They declare this out of conceit, considering themselves to have attained what they have not attained.Therein, when bhikkhus declare final knowledge rightly, their declaration is true. But when bhikkhus declare final knowledge because they overestimate themselves, the Tathāgata thinks: ‘I should teach them the Dhamma.’[n.997]MA:To make clear to them their level of attainment.Thus it is in this case, Sunakkhatta, that the Tathāgata thinks: ‘I should teach them the Dhamma.’ But some misguided men here formulate a question, come to the Tathāgata, and ask it. In that case, Sunakkhatta, though the Tathāgata has thought: ‘I should teach them the Dhamma,’ he changes his mind.\"[n.998]MA:Because they are motivated by desire, the Tathāgata's thought of teaching the Dhamma, which arises towards true practitioners, changes (i.e., fades away).",
    "mn105:4": "\"There are, Sunakkhatta, these five cords of sensual pleasure. What are the five? Forms cognizable by the eye that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. Sounds cognizable by the ear … Odours cognizable by the nose … Flavours cognizable by the tongue … Tangibles cognizable by the body that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. These are the five cords of sensual pleasure.",
    "mn105:5": "\"It is possible, Sunakkhatta, that some person here may be intent on worldly material things.[n.999]Lokāmisa.These are the five cords of sensual pleasure.When a person is intent on worldly material things, only talk concerning that interests him, and his thinking and pondering are in line with that, and he associates with that kind of person, and he finds satisfaction in that. But when talk about the imperturbable is going on, he will not listen to it or give it ear or exert his mind to understand it. He does not associate with that kind of person, and he does not find satisfaction in that.",
    "mn105:6": "\"It is possible, Sunakkhatta, that some person here may be intent on the imperturbable.[n.1000]Āneñja(BBS);āṇañja(PTS). This is a technical term for the meditative attainments from the fourth jhāna through the four immaterial attainments. But since the highest two immaterial attainments are dealt with separately, it seems that in this sutta only the fourth jhāna and the lower two immaterial attainments are intended as \"the imperturbable.\"When a person is intent on the imperturbable, only talk concerning that inte100rests him, and his thinking and pondering are in line with that, and he associates with that kind of person, and he finds satisfaction in that. But when talk about worldly material things is going on, he will not listen to it or give it ear or exert his mind to understand it. He does not associate with that kind of person, and he does not find satisfaction in that.",
    "mn105:7": "\"It is possible, Sunakkhatta, that some person here may be intent on the base of nothingness. When a person is intent on the base of nothingness, only talk concerning that interests him, and his thinking and pondering are in line with that, and he associates with that kind of person, and he finds satisfaction in that. But1006 when talk about the imperturbable is going on, he will not listen to it or give it ear or exert his mind to understand it. He does not associate with that kind of person, and he does not find satisfaction in that.",
    "mn105:8": "\"It is possible, Sunakkhatta, that some person here may be intent on the base of neither-perception-nor-non-perception. When a person is intent on the base of neither-perception-nor-non-perception, only talk concerning that interests him, and his thinking and pondering are in line with that, and he associates with that kind of person, and he finds satisfaction in that. But when talk about the base of nothingness is going on, he will not listen to it or give it ear or exert his mind to understand it. He does not associate with that kind of person, and he does not find satisfaction in that.",
    "mn105:9": "\"It is possible, Sunakkhatta, that some person here may be completely intent on Nibbāna. When a person is completely intent on Nibbāna, only talk concerning that interests him, and his thinking and pondering are in line with that, and he associates with that kind of person, and he finds satisfaction in that. But when talk about the base of neither-perception-nor-non-perception is going on, he will not listen to it or give it ear or exert his mind to understand it. He does not associate with that kind of person, and he does not find satisfaction in that.",
    "mn105:10": "\"It is possible, Sunakkhatta, that some bhikkhu here might think thus: ‘Craving has been called an arrow by the Recluse;[n.01] The Buddha.the poisonous humour of ignorance is spread about by desire, lust, and ill will. That arrow of craving has been removed from me; the poisonous humour of ignorance has been expelled. I am one who is completely intent on Nibbāna.’ Since he conceives himself thus, though it is contrary to fact,[n.02] Reading withBBS,evaṁmāni assa atathaṁ samānaṁ.CPD suggestsatathaṁ samānaṁmay be an accusative absolute. This passage refers back to the problem of self-overestimation with which the discourse began.he might pursue those things that are unsuitable for one completely intent on Nibbāna. He might pursue the sight of unsuitable forms with the eye, he might pursue unsuitable sounds with the ear, unsuitable odours with the nose, unsuitable flavours with the tongue, unsuitable tangibles with the body, or unsuitable mind-objects with the mind. When he pursues the sight of unsuitable forms with the eye … unsuitable mind-objects with the mind, lust invades his mind. With his mind invaded by lust, he would incur death or deadly suffering.",
    "mn105:11": "\"Suppose, Sunakkhatta, a man were wounded by an arrow thickly smeared with poison, and his friends and companions, his kinsmen and relatives, brought a surgeon. The surgeon would cut around the open1006ing of the wound with a knife, then he would probe for the arrow with a probe, then he would pull out the arrow and would expel the poisonous humour, leaving a trace of it behind. Thinking that no trace was left behind,[n.1003] I follow PTS here, whose reading seems supported by all versions prior to BBS. Because the surgeon is later compared to the Tathāgata, and the text cannot ascribe an error in judgement to the Buddha, BBS insists on a strict application of the simile and has thus \"corrected\" the text to readsa-upādiseso ti jānamāno.I followed this reading in the first edition, but now believe it was a mistake on the part of BBS to alter the received text; strict parallelism in the applica1006tion of the simile need not be expected. SBJ follows BBS in readingsa-upādiseso,but retainsmaññamāno,which verges on incoherence. All eds. havejanamānoas the participle in the contrasting version of the simile found below. Where PTS hasalañjust below, we should readanalañwith BBS and SBJ, also supported by the gloss inMA.he would say: ‘Good man, the arrow has been pulled out from you; the poisonous humour has been expelled with no trace left behind, and it is incapable of harming you. Eat only suitable food; do not eat unsuitable food or else the wound may suppurate. From time to time wash the wound and from time to time anoint its opening, so that pus and blood do not cover the opening of the wound. Do not walk around in the wind and sun or else dust and dirt may infect the opening of the wound. Take care of your wound, good man, and see to it that the wound heals.’",
    "mn105:12": "\"So too, Sunakkhatta, it is possible that some bhikkhu here might think thus: ‘Craving has been called an arrow by the Recluse; the poisonous humour of ignorance is spread about by desire, lust, and ill will. That arrow of craving has been removed from me; the poisonous humour of ignorance has been expelled. I am one who is completely intent upon Nibbāna.’ Because he conceives himself thus, though it is contrary to fact, he might pursue those things that are unsuitable for one completely intent on Nibbāna …as above… With his mind invaded by lust, he would incur death or deadly suffering.",
    "mn105:13": "\"It is possible, Sunakkhatta, that some bhikkhu here might think thus: ‘Craving has been called an arrow by the Recluse; the poisonous humour of ignorance is spread about by desire, lust, and ill will. That arrow of craving has been removed from me; the poisonous humour of ignorance has been expelled. I am one who is completely intent on Nibbāna.’ Being one who really is completely intent on Nibbāna, he would not pursue those things that are unsuitable for one completely intent on Nibbāna. He would not pursue the sight of unsuitable forms with the eye, he would not pursue unsuitable sounds with the ear, unsuitable odours with the nose, unsuitable flavours with the tongue, unsuitable tangibles with the body, or unsuitable mind-objects with the mind. Because he does not pursue the sight of unsuitable forms with the eye … unsuitable mind-objects with the mind, lust does not invade his mind. Because his mind is not invaded by lust, he would not incur death or deadly suffering.",
    "mn105:14": "\"Suppose, Sunakkhatta, a man were wounded by an arrow thickly smeared with poison, and his friends and companions, his kinsmen and relatives, brought a surgeon. The surgeon would cut around the opening of the wound with a knife, then he would probe for the arrow with a probe, then he would pull out the arrow and would expel the poisonous humour without leaving a trace of it behind. Knowing that no trace was left behind, he would say: ‘Good man, the arrow has been pulled out from you; the poisonous humour has been expelled with no trace left behind, and it is incapable of harming you. Eat only suitable food; do not eat unsuitable food or else the wound may suppurate. From time to time wash the wound and from time to time anoint its opening, so that pus and blood do not cover the opening of the wound. Do not walk around in the wind and sun or else dust and dirt may infect the opening of the wound. Take care of your wound, good man, and see to it that the wound heals.’",
    "mn105:15": "\"So too, Sunakkhatta, it is possible that some bhikkhu here might think thus: ‘Craving has been called an arrow by the Recluse; the poisonous humour of ignorance is spread about by desire, lust, and ill will. That arrow of craving has been pulled out from me; the poisonous humour of ignorance has been expelled. I am one who is completely intent on Nibbāna.’ Being one who really is completely intent on Nibbāna, he would not pursue those things unsuitable for one completely intent on Nibbāna …as above… Because his mind is not invaded by lust, he would not incur death or deadly suffering.",
    "mn105:16": "\"Sunakkhatta, I have given this simile in order to convey a meaning. This is the meaning here: ‘Wound’ is a term for the six internal bases. ‘Poisonous humour’ is a term for ignorance. ‘Arrow’ is a term for craving. ‘Probe’ is a term for mindfulness. ‘Knife’ is a term for noble wisdom. ‘Surgeon’ is a term for the Tathāgata, the Accomplished One, the Fully Enlightened One.",
    "mn105:17": "\"That bhikkhu, Sunakkhatta, is one who practises restraint in the six bases of contact. Having understood that acquisition is the root of suffering,[n.1005] SeeMN 66..MA: The arahant, liberated in Nibbāna, the destruction of craving (by taking it) as object, would never divert his body or arouse his mind to indulge in the five cords of sensual pleasure.being acquisitionless, liberated in the destruction of the acquisitions, it is not possible that he would direct his body or arouse his mind towards any acquisition.",
    "mn105:18": "\"Suppose, Sunakkhatta, there were a deadly poisonous snake, and a man came who wanted to live, not to die, who wanted pleasure and recoiled from pain. What do you think, Sunakkhatta, would that man give that deadly poisonous snake his hand or his thumb, knowing: ‘If I am bitten by him I will incur death or deadly suffering’?\" — \"No, venerable sir.\" — \"So too, when a bhikkhu practises restraint in the six bases of contact, and having understood that attachment is the root of suffering, is without attachment, liberated by the destruction of attachment, it is not possible that he would direct his body or arouse his mind towards any object of attachment.\"",
    "mn105:19": "That is what the Blessed One said. Sunakkhatta, son of the Licchavis, was satisfied and delighted in the Blessed One's words."
}