{
    "mn116:1": "Thus have I heard.[n.093] In Sri Lanka this sutta is regularly recited as a protective discourse and is included in the medieval compilation,Mahā Pirit Pota,\"The Great Book of Protection.\"On one occasion the Blessed One was living at Rājagaha, at Isigili — the Gullet of the Seers. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn116:2": "\"You see, bhikkhus, do you not, that mountain Vebhāra?\"[n.1094] This and the following are mountains surrounding Rājagaha.— \"Yes, venerable sir.\"",
    "mn116:3": "You see, bhikkhus, do you not, that mountain Paṇḍava?\" — \"Yes, venerable sir.\"",
    "mn116:4": "You see, bhikkhus, do you not, that mountain Vepulla?\" — \"Yes, venerable sir.\"",
    "mn116:5": "You see, bhikkhus, do you not, that mountain Gijjhakuṭa — the Vulture Peak?\" — \"Yes, venerable sir.\"",
    "mn116:6": "You see, bhikkhus, do you not, that mountain Isigili — the Gullet of the Seers?\" — \"Yes, venerable sir.\"",
    "mn116:7": "For in former times five hundred paccekabuddhas[n.1095] Apaccekabuddhais one who attains enlightenment and liberation on his own, without relying on the Dhamma taught by the Buddha, but is not capable of teaching the Dhamma to others and establishing the Dispensation. Paccekabuddhas arise only at a time when no Dispensation of a Buddha exists in the world. For a fuller study of the subject see Ria Kloppenborg,The Paccekabuddha: A Buddhist Ascetic.dwelt long on this mountain, the Gullet of the Seers. They were seen entering into this hill; once gone in, they were no longer seen. People who saw this said: ‘This mountain swallows up these seers.’[n.1096]Ayaṁ pabbato ime isī gilati:a word play is involved here. Thegiliin Isigili is certainly a dialectical variant ofgiri,hill, but the text connects it to the verbgilati,to swallow, and togala,throat, gullet.And so it was that this came to be named ‘The Gullet of the Seers.’ I shall tell you, bhikkhus, the names of the paccekabuddhas, I shall relate to you the names of the paccekabuddhas, I shall teach you the names of the paccekabuddhas. Listen and attend closely to what I shall say.\" — \"Yes, venerable sir,\" the bhikkhus replied. The Blessed One said this:",
    "mn116:8": "\"Bhikkhus, the paccekabuddha Ariṭṭha dwelt long on this mountain Isigili. The paccekabuddha Upariṭṭha dwelt long on this mountain Isigili. The paccekabuddha Tagarasikkhī[n.1097] Tagarasikhin is referred to atUd 5:4/50andSN 3:20/i.92.… Yasassin … Sudassana … Piyadassin … Gandhāra … Piṇḍola … Upāsabha … Nītha … Tatha … Sutav̄ … Bhāvitatta dwelt long on this mountain Isigili.",
    "mn116:9": "\"These saintly beings, desireless, rid of suffering,Who each achieved awakening by himself —Hear me relate the names of these, the greatestOf men, who have plucked out the dartof pain.",
    "mn116:10": "Ariṭṭha, Upariṭṭha, Tagarasikhin, Yasassin,Sudassana, and Piyadassin the enlightened,Gandhāra, Piṇḍola, Upāsabha as well,Nītha, Tatha, Sutavā, Bhāvitatta.",
    "mn116:11": "\"Sumbha, Subha, Methula, and Aṭṭhama,[n.1098] Ñm remarks in Ms that without the aid of the commentary it is extremely difficult to distinguish the proper names of the paccekabuddhas from their descriptive epithets.Then Assumegha, Anīgha, Sudāṭha —And Hingū, and Hinga, the greatly powerful,Paccekabuddhas who have destroyed the conduit to being.",
    "mn116:12": "Two sages named Jāli, and Aṭṭhaka,Then Kosala the enlightened, then Subāhu,Upanemi, and Nemi, and SantacittaRight and true, immaculate and wise.",
    "mn116:13": "Kāḷa, Upakāḷa, Vijita, and Jita;Anga, and Panga, and Gutijjita too;Passin conquered acquisition, the root of suffering;Aparājita conquered Māra's power.",
    "mn116:14": "Satthar, Pavattar, Sarabhanga, Lomahaṁsa,Uccangamāya, Asita, Anāsava,Manomaya, and Bandhumant the free from pride,Tadādhimutta stainless and resplendent;",
    "mn116:15": "Ketumbarāga, Mātaṅga, and Ariya,Then Accuta, Accutagāma, Byāmaka,Sumaṅgala, Dabbila, Supatiṭṭhita,Asayha, Khemābhirata, and Sorata,",
    "mn116:16": "Durannaya, Saṅgha, and then Ujjaya;Another sage, Sayha, of noble endeavour.And twelve between — Ānandas, Nandas, and UpanandasAnd Bhāradvāja bearing his last body;",
    "mn116:17": "Then Bodhi, Mahānāma the supreme,Bhāradvāja with fair-crested mane;Tissa and Upatissa not bound to being;Upasīdarin, and Sīdarin, free from craving.",
    "mn116:18": "Enlightened was Mangala, free from lust;Usabha cut the net, the root of suffering.Upanīta attained the state of peace,Purified, excellent, truly named.",
    "mn116:19": "Jeta, Jayanta, Paduma, and Uppala,Padumuttara, Rakkhita, and Pabbata,Mānatthaddha glorious, VītarāgaAnd Kaṇha enlightened with mind released.",
    "mn116:20": "\"These and also other great and mightyPaccekabuddhas no more led to being —Honour these sages who, having gone beyond all ties,Have attained final Nibbāna, past all measure.\""
}