{
    "mn110:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in the Eastern Park, in the Palace of Migāra's Mother.",
    "mn110:2": "\"Good, bhikkhus. It is impossible, it cannot be, that an untrue man should know of an untrue man: ‘This person is an untrue man.’ But would an untrue man know of a true man: ‘This person is a true man’?\" — \"No, venerable sir.\"",
    "mn110:3": "\"Good, bhikkhus. It is impossible, it cannot be, that an untrue man should know of a true man: ‘This person is a true man.’",
    "mn110:4": "\"And how is an untrue man possessed of bad qualities? Here an untrue man has no faith, no shame, no fear of wrongdoing; he is unlearned, lazy, forgetful, and unwise. That is how an untrue man is possessed of bad qualities.",
    "mn110:5": "\"And how does an untrue man associate as an untrue man? Here an untrue man has for friends and companions those recluses and brahmins who have no faith, no shame, no fear of wrongdoing; who are unlearned, lazy, forgetful, and unwise. That is how an untrue man associates as an untrue man.",
    "mn110:6": "\"And how does an untrue man will as an untrue man? Here an untrue man wills for his own affliction, for the affliction of others, and for the affliction of both. That is how an untrue man wills as an untrue man.",
    "mn110:7": "\"And how does an untrue man counsel as an untrue man? Here an untrue man counsels for his own affliction, for the affliction of others, and for the affliction of both. That is how an untrue man counsels as an untrue man.",
    "mn110:8": "\"And how does an untrue man speak as an untrue man? Here an untrue man speaks false speech, malicious speech, harsh speech, and gossip. That is how an untrue man speaks as an untrue man.",
    "mn110:9": "\"And how does an untrue man act as an untrue man? Here an untrue man kills living beings, takes what is not given, and misconducts himself in sensual pleasures. That is how an untrue man acts as an untrue man.",
    "mn110:10": "\"And how does an untrue man hold views as an untrue man? Here an untrue man holds such a view as this: ‘There is nothing given, nothing offered, nothing sacrificed; no fruit or result of good and bad actions; no this world, no other world; no mother, no father; no beings who are reborn spontaneously; no good and virtuous recluses and brahmins in the world who have realised for themselves by direct knowledge and declare this world and the other world.’ That is how an untrue man holds views as an untrue man.",
    "mn110:11": "\"And how does an untrue man give gifts as an untrue man? Here an untrue man gives a gift carelessly, gives it not with his own hand, gives it without showing respect, gives what is to be discarded, gives it with the view that nothing will come of it. That is how an untrue man gives gifts as an untrue man.",
    "mn110:12": "\"That untrue man — thus possessed of bad qualities, who thus associates as an untrue man, wills as an untrue man, counsels as an untrue man, speaks as an untrue man, acts as an untrue man, holds views as an untrue man, and gives gifts as an untrue man — on the dissolution of the body, after death, reappears in the destination of untrue men. And what is the destination of untrue men? It is hell or the animal world.",
    "mn110:13": "\"Bhikkhus, would a true man know of a true man: ‘This person is a true man’?\" — \"Yes, venerable sir.\"",
    "mn110:14": "\"Good, bhikkhus. It is possible that a true man would know of a true man: ‘This person is a true man.’ But would a true man know of an untrue man: ‘This person is an untrue man’?\" — \"Yes, venerable sir.\" 13— \"Good, bhikkhus. It is possible that a true man would know of an untrue man: ‘This person is an untrue man.’",
    "mn110:15": "\"Bhikkhus, a true man is possessed of good qualities; he associates as a true man, he wills as a true man, he counsels as a true man, he speaks as a true man, he acts as a true man, he holds views as a true man, and he gives gifts as a true man.",
    "mn110:16": "\"And how is a true man possessed of good qualities? Here a true man has faith, shame, and fear of wrongdoing; he is learned, energetic, mindful, and wise. That is how a true man is possessed of good qualities.",
    "mn110:17": "\"And how does a true man associate as a true man? Here a true man has for his friends and companions those recluses and brahmins who have faith, shame, and fear of wrongdoing; who are learned, energetic, mindful, and wise. That is how a true man associates as a true man.",
    "mn110:18": "\"And how does a true man will as a true man? Here a true man does not will for his own affliction, for the affliction of others, or for the affliction of both. That is how a true man wills as a true man.",
    "mn110:19": "\"And how does a true man counsel as a true man? Here a true man does not counsel for his own affliction, for the affliction of others, or for the affliction of both. That is how a true man counsels as a true man.",
    "mn110:20": "\"And how does a true man speak as a true man? Here a true man abstains from false speech, from malicious speech, from harsh speech, and from gossip. That is how a true man speaks as a true man.",
    "mn110:21": "\"And how does a true man act as a true man? Here a true man abstains from killing living beings, from taking what is not given, and from misconduct in sensual pleasures. That is how a true man acts as a true man.",
    "mn110:22": "\"And how does a true man hold views as a true man? Here a true man holds such a view as this: ‘There is what is given and what is offered and what is sacrificed; there is fruit and result of good and bad actions; there is this world and the other world; there is mother and father; there are beings who are reborn spontaneously; there are good and virtuous recluses and brahmins in the world who have realised for themselves by direct knowledge and declare this world and the other world.’ That is how a true man holds views as a true man.",
    "mn110:23": "\"And how does a true man give gifts as a true man? Here a true man gives a gift carefully, gives it with his own hand, gives it showing respect, gives a valuable gift, gives it with the view that something will come of it. That is how a true man gives gifts as a true man.",
    "mn110:24": "\"That true man — thus possessed of good qualities, who thus associates as a true man, wills as a true man, counsels as a true man, speaks as a true man, acts as a true man, holds views as a true man, and gives gifts as a true man — on the dissolution of the body, after death, reappears in the destination of true men. And what is the destination of true men? It is greatness among the gods or greatness among human beings.\"",
    "mn110:25": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}