{
    "mn113:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn113:2": "\"Bhikkhus, what is the character of an untrue man? Here an untrue man who has gone forth from an aristocratic family considers thus: ‘I have gone forth from an aristocratic family; but these other bhikkhus have not gone forth from aristocratic families. ’ So he lauds himself and disparages others because of his aristocratic family. This is the character of an untrue man.",
    "mn113:3": "\"Moreover, an untrue man who has gone forth from a great family … from a wealthy family … from an influential family considers thus: ‘I have gone forth from an influential family; but these other bhikkhus have not gone forth from influential families. ’ So he lauds himself and disparages others because of his influential family. This too is the character of an untrue man.",
    "mn113:4": "\"Moreover, an untrue man who is well known and famous considers thus: ‘I am well known and famous; but these other bhikkhus are unknown and of no account.’ So he lauds himself and disparages others because of his renown. This too is the character of an untrue man.",
    "mn113:5": "\"Moreover, an untrue man who gains robes, almsfood, resting places, and requisites of medicine considers thus: ‘I gain robes, almsfood, resting places, and requisites of medicine; but these other bhikkhus do not gain these things.’ So he lauds himself and disparages others because of gain. This too is the character of an untrue man.",
    "mn113:6–12": "\"Moreover, an untrue man who is learned … who is expert in the Discipline …",
    "mn113:13": "… a charnel-ground dweller … an open-air dweller … a continual sitter … an any-bed dweller … an open-air dweller … a continual sitter … an any-bed user … a one-session eater considers thus: ‘I am a one-session eater; but these other bhikkhus are not one-session eaters.’[n.1065] These are nine of the thirteen ascetic practices discussed in Vsm II. The \"continual sitter\"(nesajjika)observes the practice of never lying down but of sleeping in the sitting posture.So he lauds himself and disparages others because of his being a one-session eater. This too is the character of an untrue man.",
    "mn113:14": "\"Moreover, quite secluded from sensual pleasures, secluded from unwholesome states, an untrue man enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. He considers thus: ‘I have gained the attainment of the first jhāna; but these other bhikkhus have not gained the attainment of the first jhāna.’ So he lauds himself and disparages others because of his attainment of the first jhāna. This too is the character of an untrue man.",
    "mn113:15": "\"Moreover, with the stilling of applied and sustained thought, an untrue man enters upon and abides in the second jhāna … With the fading away as well of rapture … he enters upon and abides in the third jhāna … With the abandoning of pleasure and pain … he enters upon and abides in the fourth jhāna …",
    "mn113:16": "\"Moreover, with the complete surmounting of perceptions of form, with the disappearance of perceptions of sensory impact, with non-attention to perceptions of diversity, aware that ‘space is infinite,’ an untrue man enters upon and abides in the base of infinite space …",
    "mn113:17": "\"Moreover, by completely surmounting the base of infinite space, aware that ‘consciousness is infinite,’ an untrue man enters upon and abides in the base of infinite consciousness … …",
    "mn113:18": "\"Moreover, by completely surmounting the base of infinite consciousness, aware that ‘there is nothing,’ an untrue man enters upon and abides in the base of nothingness …",
    "mn113:19": "\"Moreover, by completely surmounting the base of nothingness, an untrue man enters upon and abides in the base of neither-perception-nor-non-perception. He considers thus: ‘I have gained the attainment of the base of neither-perception-nor-non-perception; but these other bhikkhus have not gained the attainment of the base of neither-perception-nor-non-perception. ’ So he lauds himself and disparages others because of his attainment of the base of neither-perception-nor-non-perception. This too is the character of an untrue man.",
    "mn113:20": "\"Moreover, by completely surmounting the base of neither-perception-nor-non-perception, a true man enters upon and abides in the cessation of perception and feeling .[n.1067] It should be noted that there is no passage on the untrue man entering the cessation of perception and feeling. Unlike the jhānas and immaterial attainments, which can be attained by worldlings, cessation is the domain exclusively of non-returners and arahants.And his taints are destroyed by his seeing with wisdom. This bhikkhu does not conceive anything, he does not conceive in regard to anything, he does not conceive in any way.\"[n.1068]Na kiñci maññati, na kuhiñci maññati, na kenaci maññati.This is a brief statement of the same situation described in full atMN 1.51–146. On \"conceiving\" seen.6",
    "mn113:21": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}