{
    "mn119:1": "Thus have I heard. On one occasion the Blessed One was living at S̄āvattī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn119:2": "\"And how, bhikkhus, is mindfulness of the body developed and cultivated so that it is of great fruit and great benefit?",
    "mn119:3": "\"Again, bhikkhus, when walking, a bhikkhu understands: ‘I am walking’; when standing, he understands: ‘I am standing’; when sitting, he understands: ‘I am sitting’; when lying down, he understands: ‘I am lying down’; or he understands accordingly however his body is disposed. As he abides thus diligent, ardent, and resolute, his memories and intentions based on the household life are abandoned … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:4": "\"Again, bhikkhus, a bhikkhu is one who acts in full awareness when going forward and returning; who acts in full awareness when looking ahead and looking away; who acts in full awareness when flexing and extending his limbs; who acts in full awareness when wearing his robes and carrying his outer robe and bowl; who acts in full awareness when eating, drinking, consuming food, and tasting; who acts in full awareness when defecating or urinating; who acts in full awareness when walking, standing, sitting, falling asleep, waking up, talking, and keeping silent. As he abides thus diligent, ardent, and resolute, his memories and intentions based on the household life are abandoned … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:5": "\"Again, bhikkhus, a bhikkhu reviews this same body up from the soles of the feet and down from the top of the hair, bounded by skin, as full of many kinds of impurity thus: ‘In this body there are head-hairs, body-hairs, nails, teeth, skin, flesh, sinews, bones, bone-marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, mesentery, contents of the stomach, feces, bile, phlegm, pus, blood, sweat, fat, tears, grease, spittle, snot, oil of the joints, and urine.’",
    "mn119:6": "Just as though there were a bag with an opening at both ends full of many sorts of grain, such as hill rice, red rice, beans, peas, millet, and white rice, and a man with good eyes were to open it and review it thus: ‘This is hill rice, this is red rice, these are beans, these are peas, this is millet, this is white rice’; so too, a bhikkhu reviews this same body as full of many kinds of impurity thus: ‘In this body there are headhairs … and urine.’ As he abides thus diligent, ardent, and resolute, his memories and intentions based on the household life are abandoned … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:7": "\"Again, bhikkhus, a bhikkhu reviews this same body, however it is placed, however disposed, as consisting of elements thus: ‘In this body there are the earth element, the water element, the fire element, and the air element.’",
    "mn119:8": "Just as though a skilled butcher or his apprentice had killed a cow and were seated at the crossroads with it cut up into pieces; so too, a bhikkhu reviews this same body however it is placed, however disposed, as consisting of elements thus: ‘In this body there are the earth element, the water element, the fire element, and the air element.’ As he abides thus diligent, ardent, and resolute, his memories and intentions connected with the household life are abandoned … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:9": "\"Again, bhikkhus, as though he were to see a corpse thrown aside in a charnel ground, one, two, or three days dead, bloated, livid, and oozing matter, a bhikkhu compares this same body with it thus: ‘This body too is of the same nature, it will be like that, it is not exempt from that fate.’ As he abides thus diligent … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:10": "\"Again, as though he were to see a corpse thrown aside in a charnel ground, being devoured by crows, hawks, vultures, dogs, jackals, or various kinds of worms, a bhikkhu compares this same body with it thus: ‘This body too is of the same nature, it will be like that, it is not exempt from that fate.’ As he abides thus diligent … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:11": "\"Again, as though he were to see a corpse thrown aside in a charnel ground, a skeleton with flesh and blood, held together with sinews … a fleshless skeleton smeared with blood, held together with sinews … a skeleton without flesh and blood, held together with sinews … disconnected bones scattered in all directions — here a hand-bone, there a foot-bone, here a shin-bone, there a thigh-bone, here a hip-bone, there a back-bone, here a rib-bone, there a breast-bone, here an arm-bone, there a shoulder-bone, here a neck-bone, there a jaw-bone, here a tooth, there the skull — a bhikkhu compares this same body with it thus: ‘This body too is of the same nature, it will be like that, it is not exempt from that fate.’ As he abides thus diligent … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:12": "\"Again, as though he were to see a corpse thrown aside in a charnel ground, bones bleached white, the colour of shells … bones heaped up … bones more than a year old, rotted and crumbled to dust, a bhikkhu compares this same body with it thus: ‘This body too is of the same nature, it will be like that, it is not exempt from that fate.’ As he abides thus diligent … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:13": "\"Again, bhikkhus, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. He makes the rapture and pleasure born of seclusion drench, steep, fill, and pervade this body, so that there is no part of his whole body unpervaded by the rapture and pleasure born of seclusion. Just as a skilled bath man or a bath man's apprentice[n.10] The similes for the jhānas are also found atMN 39.15–18andMN 77.25–28.heaps bath powder in a metal basin and, sprinkling it gradually with water, kneads it till the moisture wets his ball of bath powder, soaks it and pervades it inside and out, yet the ball itself does not ooze; so too, a bhikkhu makes the rapture and pleasure born of seclusion drench, steep, fill, and pervade this body, so that there is no part of his whole body unpervaded by the rapture and pleasure born of seclusion. As he abides thus diligent … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:14": "\"Again, bhikkhus, with the stilling of applied and sustained thought, a bhikkhu enters upon and abides in the second jhāna, which has self-confidence and singleness of mind without applied and sustained thought, with rapture and pleasure born of concentration. He makes the rapture and pleasure born of concentration drench, steep, fill, and pervade this body, so that there is no part of his whole body unpervaded by the rapture and pleasure born of concentration. Just as though there were a lake whose waters welled up from below and it had no inflow from east, west, north, or south, and would not be replenished from time to time by showers of rain, then the cool fount of water welling up in the lake would make the cool water drench, steep, fill, and pervade the lake, so that there would be no part of the whole lake unpervaded by cool water; so too, a bhikkhu makes the rapture and pleasure born of concentration drench, steep, fill, and pervade this body, so that there is no part of his whole body unpervaded by the rapture and pleasure born of concentration. As he abides thus diligent … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:15": "\"Again, bhikkhus, with the fading away as well of rapture, a bhikkhu abides in equanimity, and mindful and fully aware, still feeling pleasure with the body, he enters upon and abides in the third jhāna, on account of which noble ones announce: ‘He has a pleasant abiding who has equanimity and is mindful.’ He makes the pleasure divested of rapture drench, steep, fill, and pervade this body, so that there is no part of his whole body unpervaded by the pleasure divested of rapture. Just as in a pond of blue or white or red lotuses, some lotuses that are born and grow in the water thrive immersed in the water without rising out of it, and cool water drenches, steeps, fills, and pervades them to their tips and their roots, so that there is no part of all those lotuses unpervaded by cool water; so too, a bhikkhu makes the pleasure divested of rapture drench, steep, fill, and pervade this body, so that there is no part of his whole body unpervaded by the pleasure divested of rapture. As he abides thus diligent … That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:16": "\"Again, bhikkhus, with the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, a bhikkhu enters upon and abides in the fourth jhāna, which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity. He sits pervading this body with a pure bright mind, so that there is no part of his whole body unpervaded by the pure bright mind. Just as though a man were sitting covered from head down with a white cloth, so that there would be no part of his whole body not covered by the white cloth; so too, a bhikkhu sits pervading this body with a pure bright mind, so that there is no part of his whole body unpervaded by the pure bright mind. As he abides thus diligent, ardent, and resolute, his memories and intentions based on the household life are abandoned; with their abandoning his mind becomes steadied internally, quieted, brought to singleness, and concentrated. That too is how a bhikkhu develops mindfulness of the body.",
    "mn119:17": "\"Bhikkhus, anyone who has developed and cultivated mindfulness of the body has included within himself whatever wholesome states there are that partake of true knowledge.[n.1131]Vijjābhāgiyā dhammā.MAexplains these states as the eight types of knowledge expounded atMN 77.29–36.Just as anyone who has extended his mind over the great ocean has included within it whatever streams there are that flow into the ocean; so too, anyone who has developed and cultivated mindfulness of the body has included within himself whatever wholesome states there are that partake of true knowledge.",
    "mn119:18": "\"Bhikkhus, when anyone has not developed and cultivated mindfulness of the body, Māra finds an opportunity and a support in him.",
    "mn119:19": "\"Bhikkhus, when anyone has developed and cultivated mindfulness of the body, Māra cannot find an opportunity or a support in him. Suppose a man were to throw a light ball of string at a door-panel made entirely of heartwood. What do you think, bhikkhus? Would that light ball of string find entry through that door-panel made entirely of heartwood?\" — \"No, venerable sir.\" — \"So too, bhikkhus, when anyone has developed and cultivated mindfulness of the body, Māra cannot find an opportunity or a support in him.",
    "mn119:20": "\"Bhikkhus, when anyone has developed and cultivated mindfulness of the body, then when he inclines his mind towards realising any state that may be realised by direct knowledge, he attains the ability to witness any aspect therein, there being a suitable basis. Suppose, set out on a stand, there were a water jug full of water right up to the brim so that crows could drink from it. Whenever a strong man tips it, would water come out?\" — \"Yes, venerable sir.\" — \"So too, bhikkhus, when anyone has developed and cultivated mindfulness of the body, then when he inclines his mind towards realising any state that may be realised by direct knowledge, he attains the ability to witness any aspect therein, there being a suitable basis.",
    "mn119:21": "\"Bhikkhus, when mindfulness of the body has been repeatedly practised, developed, cultivated, used as a vehicle, used as a basis, established, consolidated, and well undertaken, these ten benefits may be expected. What ten?",
    "mn119:22": "ii\"One becomes a conqueror of fear and dread, and fear and dread do not conquer oneself; one abides overcoming fear and dread whenever they arise.",
    "mn119:23": "iii\"One bears cold and heat, hunger and thirst, and contact with gadflies, mosquitoes, wind, the sun, and creeping things; one endures ill-spoken, unwelcome words and arisen bodily feelings that are painful, racking, sharp, piercing, disagreeable, distressing, and menacing to life.",
    "mn119:24": "iv\"One obtains at will, without trouble or difficulty, the four jhānas that constitute the higher mind and provide a pleasant abiding here and now.",
    "mn119:25": "v\"One wields the various kinds of supernormal power … one wields bodily mastery even as far as the Brahma-world.",
    "mn119:26": "vi\"With the divine ear element, which is purified and surpasses the human, one hears both kinds of sounds, the divine and the human, those that are far as well as near.",
    "mn119:27": "vii\"One understands the minds of other beings, of other persons, having encompassed them with one's own mind. One understands a mind affected by lust as affected by lust and a mind unaffected by lust as unaffected by lust; he understands a mind affected by hate as affected by hate and a mind unaffected by hate as unaffected by hate; he understands a mind affected by delusion as affected by delusion and a mind unaffected by delusion as unaffected by delusion; he understands a contracted mind as contracted and a distracted mind as distracted; he understands an exalted mind as exalted and an unexalted mind as unexalted; he understands a surpassed mind as surpassed and an unsurpassed mind as unsurpassed; he understands a concentrated mind as concentrated and an unconcentrated mind as unconcentrated; he understands a liberated mind as liberated and an unliberated mind as unliberated.",
    "mn119:28": "viii\"One recollects one's manifold past lives, that is, one birth, two births … Thus with their aspects and particulars one recollects one's manifold past lives.",
    "mn119:29": "ix\"With the divine eye, which is purified and surpasses the human, one sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and one understands how beings pass on according to their actions.",
    "mn119:30": "x\"By realising for oneself with direct knowledge, one here and now enters upon and abides in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints.",
    "mn119:31": "\"Bhikkhus, when mindfulness of the body has been repeatedly practised, developed, cultivated, used as a vehicle, used as a basis, established, consolidated, and well undertaken, these ten benefits may be expected.\"",
    "mn119:32": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}