{
    "mn111:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable, sir,\" they replied. The Blessed One said this:",
    "mn111:2": "\"Bhikkhus, Sāriputta is wise; Sāriputta has great wisdom; Sāriputta has wide wisdom; Sāriputta has joyous wisdom; Sāriputta has quick wisdom; Sāriputta has keen wisdom; Sāriputta has penetrative wisdom. During half a month, bhikkhus, Sāriputta gained insight into states one by one as they occurred.[n.1046]Anupadadhammavipassanā.MAexplains that he developed insight into states in successive order by way of the meditative attainments and the jhāna factors, as will be described. The two-week period referred to fell from the time of Ven. Sāriputta's ordination under the Buddha to his attainment of arahantship while listening to the Buddha explain the comprehension of feeling to Dīghanakha (seeMN74.14).Now Sāriputta's insight into states one by one as they occurred was this:",
    "mn111:3": "\"Here, bhikkhus, quite secluded from sensual pleasures, secluded from unwholesome states, Sāriputta entered upon and abided in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion.",
    "mn111:4": "\"Again, bhikkhus, with the stilling of applied and sustained thought, Sāriputta entered and abided in the second jhāna, which has self-confidence and singleness of mind without applied and sustained thought, with rapture and pleasure born of concentration.",
    "mn111:5": "\"Again, bhikkhus, with the fading away as well of rapture, Sāriputta abided in equanimity, and mindful and fully aware, still feeling pleasure with the body, he entered upon and abided in the third jhāna, on account of which noble ones announce: ‘He has a pleasant abiding who has equanimity and is mindful.’",
    "mn111:6": "\"Again, bhikkhus, with the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, Sāriputta entered upon and abided in the fourth jhāna, which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity.",
    "mn111:7": "\"Again, bhikkhus, with the complete surmounting of perceptions of form, with the disappearance of perceptions of sensory impact, with non-attention to perceptions of diversity, aware that ‘space is infinite,’ Sāriputta entered upon and abided in the base of infinite space.",
    "mn111:8": "\"Again, bhikkhus, by completely surmounting the base of infinite space, aware that ‘consciousness is infinite,’ Sāriputta entered upon and abided in the base of infinite consciousness.",
    "mn111:9": "\"Again, bhikkhus, by completely surmounting the base of infinite consciousness, aware that ‘there is nothing,’ Sāriputta entered upon and abided in the base of nothingness.",
    "mn111:10": "\"Again, bhikkhus, by completely surmounting the base of nothingness, Sāriputta entered upon and abided in the base of neither-perception-nor-non-perception.",
    "mn111:11": "\"Again, bhikkhus, by completely surmounting the base of neither-perception-nor-non-perception, Sāriputta entered upon and abided in the cessation of perception and feeling. And his taints were destroyed by his seeing with wisdom.[n.1052]MAoffers this explanation of the passage, transmitted by \"the elders of India\": \"The Elder Sāriputta cultivated serenity and insight in paired conjunction and realised the fruit of non-returning. Then he entered the attainment of cessation, and after emerging from it he attained arahantship.\"",
    "mn111:12": "\"Bhikkhus, rightly speaking, were it to be said of anyone: ‘He has attained mastery and perfection[n.1055]Abhiññāvosānapāramippatta.MAexplains as the attainment of arahantship. This may be the only sense that the word pāramī bears in the four Nikāyas. In the later Theravāda literature, beginning perhaps with such works as the Buddhavaṁsa, this word comes to signify the perfect virtues that a bodhisatta must fulfil over many lives in order to attain Buddhahood. In that context it corresponds to the pāramitā of the Mahāyāna literature, though the numerical lists of virtues overlap only in part.in noble virtue, attained mastery and perfection in noble concentration, attained mastery and perfection in noble wisdom, attained mastery and perfection in noble deliverance,’ it is of Sāriputta indeed that rightly speaking this should be said.",
    "mn111:13": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}