{
    "mn112:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn112:2": "\"Here, bhikkhus, a bhikkhu makes a declaration of final knowledge thus: ‘I understand: Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.’",
    "mn112:3": "\"Bhikkhus, when a bhikkhu is one with taints destroyed, who has lived the holy life, done what had to be done, laid down the burden, reached the true goal, destroyed the fetters of being, and is completely liberated through final knowledge, this is the natural way for him to answer.",
    "mn112:4": "\"‘Friend, there are these five aggregates affected by clinging, rightly proclaimed by the Blessed One who knows and sees, accomplished and fully enlightened. What five? They are the material form aggregate affected by clinging, the feeling aggregate affected by clinging, the perception aggregate affected by clinging, the formations aggregate affected by clinging, and the consciousness aggregate affected by clinging. These, friend, are the five aggregates affected by clinging, rightly proclaimed by the Blessed One who knows and sees, accomplished and fully enlightened. How does the venerable one know, how does he see, regarding these five aggregates affected by clinging, so that through not clinging his mind is liberated from the taints?’",
    "mn112:5": "\"Bhikkhus, when a bhikkhu is one with taints destroyed … and is completely liberated through final knowledge, this is the natural way for him to answer.\"Friends, having known material form to be feeble, fading away, and comfortless, with the destruction, fading away, cessation, giving up, and relinquishing of attraction and clinging regarding material form, of mental standpoints, adherences, and underlying tendencies regarding material form,[n.108]MA: All these terms signify craving and views.I have understood that my mind is liberated. Friends, having known feeling … Having known perception … Having known formations … Having known consciousness to be feeble, fading away, and comfortless, with the destruction, fading away, cessation, giving up, and relinquishing of attraction and clinging regarding consciousness, of mental standpoints, adherences, and underlying tendencies regarding consciousness, I have understood that my mind is liberated. It is by knowing thus, seeing thus, regarding these five aggregates affected by clinging, that through not clinging my mind is liberated from the taints.\"",
    "mn112:6": "\"‘Friend, there are these six elements rightly proclaimed by the Blessed One who knows and sees, accomplished and fully enlightened. What six? They are the earth element, the water element, the fire element, the air element, the space element, and the consciousness element. These, friend, are the six elements rightly proclaimed by the Blessed One who knows and sees, accomplished and fully enlightened. How does the venerable one know, how does he see, regarding these six elements, so that through not clinging his mind is liberated from the taints?’",
    "mn112:7": "\"Bhikkhus, when a bhikkhu is one with taints destroyed … and is completely liberated through final knowledge, this is the natural way for him to answer.",
    "mn112:8": "\"‘But, friend, there are these six internal and external bases rightly proclaimed by the Blessed One who knows and sees, accomplished and fully enlightened. What six? They are the eye and forms, the ear and sounds, the nose and odours, the tongue and flavours, the body and tangibles, the mind and mind-objects. These, friend, are the six internal and external bases rightly proclaimed by the Blessed One who knows and sees, accomplished and fully enlightened. How does the venerable one know, how does he see, regarding these six internal and external bases, so that through not clinging his mind is liberated from the taints?’",
    "mn112:9": "\"Bhikkhus, when a bhikkhu is one with taints destroyed … and is completely liberated through final knowledge, this is the natural way for him to answer.",
    "mn112:10": "\"‘But, friend, how does the venerable one know, how does he see, so that in regard to this body with its consciousness and all external signs, I-making, mine-making, and the underlying tendency to conceit have been eradicated in him?’[n.61]MAexplains \"I-making\"(ahankarā)as conceit and \"mine-making\"(mamankarā)as craving. \"All external signs\"(nimitta)are external objects.",
    "mn112:11": "\"Bhikkhus, when a bhikkhu is one with taints destroyed … and is completely liberated through final knowledge, this is the natural way for him to answer.",
    "mn112:12": "On a later occasion, abandoning a small or a large fortune, abandoning a small or a large circle of relations, I shaved off my hair and beard, put on the yellow robe, and went forth from the home life into homelessness.",
    "mn112:13": "\"He abstains from injuring seeds and plants. He practises eating one meal a day, abstaining from eating at night and outside the proper time. He abstains from dancing, singing, music, and theatrical shows. He abstains from wearing garlands, smartening himself with scent, and embellishing himself with unguents. He abstains from high and large couches. He abstains from accepting gold and silver. He abstains from accepting raw grain. He abstains from accepting raw meat. He abstains from accepting women and girls. He abstains from accepting men and women slaves. He abstains from accepting goats and sheep. He abstains from accepting fowl and pigs. He abstains from accepting elephants, cattle, horses, and mares. He abstains from accepting fields and land. He abstains from going on errands and running messages. He abstains from buying and selling. He abstains from false weights, false metals, and false measures. He abstains from accepting bribes, deceiving, defrauding, and trickery. He abstains from wounding, murdering, binding, brigandage, plunder, and violence.",
    "mn112:14": "\"He becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Just as a bird, wherever it goes, flies with its wings as its only burden, so too, the bhikkhu becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Possessing this aggregate of noble virtue, he experiences within himself a bliss that is blameless.",
    "mn112:15": "\"On seeing a form with the eye, he does not grasp at its signs and features. Since, if he left the eye faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the eye faculty, he undertakes the restraint of the eye faculty. On hearing a sound with the ear … On smelling an odour with the nose … On tasting a flavour with the tongue … On touching a tangible with the body … On cognizing a mind-object with the mind, he does not grasp at its signs and features. Since, if he left the mind faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the mind faculty, he undertakes the restraint of the mind faculty. Possessing this noble restraint of the faculties, he experiences within himself a bliss that is unsullied.",
    "mn112:16": "\"He becomes one who acts in full awareness when going forward and returning; who acts in full awareness when looking ahead and looking away; who acts in full awareness when flexing and extending his limbs; who acts in full awareness when wearing his robes and carrying his outer robe and bowl; who acts in full awareness when eating, drinking, consuming food, and tasting; who acts in full awareness when defecating and urinating; who acts in full awareness when walking, standing, sitting, falling asleep, waking up, talking, and keeping silent.",
    "mn112:17": "Possessing this aggregate of noble virtue, and this noble restraint of the faculties, and possessing this noble mindfulness and full awareness, he resorts to a secluded resting place: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw. On returning from his almsround, after his meal he sits down, folding his legs crosswise, setting his body erect, and establishing mindfulness before him.",
    "mn112:18": "Abandoning covetousness for the world, he abides with a mind free from covetousness; he purifies his mind from covetousness. Abandoning ill will and hatred, he abides with a mind free from ill will, compassionate for the welfare of all living beings; he purifies his mind from ill will and hatred. Abandoning sloth and torpor, he abides free from sloth and torpor, percipient of light, mindful and fully aware; he purifies his mind from sloth and torpor. Abandoning restlessness and remorse, he abides unagitated with a mind inwardly peaceful; he purifies his mind from restlessness and remorse. Abandoning doubt, he abides having gone beyond doubt, unperplexed about wholesome states; he purifies his mind from doubt.",
    "mn112:19": "\"‘Having thus abandoned these five hindrances, imperfections of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, I entered upon and abided in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. With the stilling of applied and sustained thought, I entered upon and abided in the second jhāna … With the fading away as well of rapture … I entered upon and abided in the third jhāna … With the abandoning of pleasure and pain … I entered upon and abided in the fourth jhāna, which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity.",
    "mn112:20": "\"‘When my concentrated mind was thus purified, bright, unblemished, rid of imperfections, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the destruction of the taints.[n.1062]MA: The recollection of past lives and the knowledge of the passing away and reappearance of beingsusually included in this type of expositionare here omitted because the original question at ¶9e concerned the attainment of arahantship, not mundane attainments.I directly knew as it actually is: \"This is suffering\" … \"This is the origin of suffering\" … \"This is the cessation of suffering\" … \"This is the way leading to the cessation of suffering.\" I directly knew as it actually is: \"These are the taints\" … \"This is the origin of the taints\" … \"This is the cessation of the taints\" … \"This is the way leading to the cessation of the taints.\"",
    "mn112:21": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}