{
    "mn115:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn115:2": "\"Bhikkhus, whatever fears arise, all arise because of the fool, not because of the wise man; whatever troubles arise, all arise because of the fool, not because of the wise man; whatever calamities arise, all arise because of the fool, not because of the wise man. Just as a fire that starts in a shed made of rushes or grass burns down even houses with peaked roofs, with walls plastered inside and outside, shut off, secured by bars, with shuttered windows; so too, bhikkhus, whatever fears arise … all arise because of the fool, not because of the wise man. Thus the fool brings fear, the wise man brings no fear; the fool brings trouble, the wise man brings no trouble; the fool brings calamity, the wise man brings no calamity. No fear comes from the wise man, no trouble comes from the wise man, no calamity comes from the wise man. Therefore, bhikkhus, you should train thus: ‘We shall be wise men, we shall be inquirers.’\"",
    "mn115:3": "When this was said, the venerable Ānanda asked the Blessed One: \"In what way, venerable sir, can a bhikkhu be called a wise man and an inquirer?\"",
    "mn115:4": "\"But, venerable sir, in what way can a bhikkhu be called skilled in the elements?\"",
    "mn115:5": "\"But, venerable sir, might there be another way in which a bhikkhu can be called skilled in the elements?\"",
    "mn115:6": "\"But, venerable sir, might there be another way in which a bhikkhu can be called skilled in the elements?\"",
    "mn115:7": "\"But, venerable sir, might there be another way in which a bhikkhu can be called skilled in the elements?\"",
    "mn115:8": "\"But, venerable sir, might there be another way in which a bhikkhu can be called skilled in the elements?\"",
    "mn115:9": "\"But, venerable sir, might there be another way in which a bhikkhu can be called skilled in the elements?\"",
    "mn115:10": "\"But, venerable sir, in what way can a bhikkhu be called skilled in the bases?\"",
    "mn115:11": "\"But, venerable sir, in what way can a bhikkhu be called skilled in dependent origination?\"",
    "mn115:12": "\"But, venerable sir, in what way can a bhikkhu be called skilled in what is possible and what is impossible?\"",
    "mn115:13": "\"He understands: ‘It is impossible, it cannot happen that a person possessing right view could deprive his mother of life — there is no such possibility.’[n.1087] This section distinguishes the ordinary person and noble disciple in terms of the five heinous crimes.MApoints out that a noble disciple is in fact incapable of intentionally depriving any living being of life, but the contrast is made here by way of matricide and patricide to stress the dangerous side of the ordinary person's condition and the strength of the noble disciple.And he understands: ‘It is possible that an ordinary person might deprive his mother of life — there is such a possibility.’ He understands: ‘It is impossible, it cannot happen that a person possessing right view could deprive his father of life … could deprive an arahant of life — there is no such possibility.’ And he understands: ‘It is possible that an ordinary person might deprive his father of life … might deprive an arahant of life — there is such a possibility.’ He understands: ‘It is impossible, it cannot happen that a person possessing right view could, with a mind of hate, shed a Tathāgata's blood — there is no such possibility.’ And he understands: ‘It is possible that an ordinary person might, with a mind of hate, shed a Tathāgata's blood — there is such a possibility.’ He understands: ‘It is impossible, it cannot happen that a person possessing right view could cause a schism in the Saṅgha … could acknowledge another teacher[n.1088] That is, could acknowledge anyone other than the Buddha as the supreme spiritual teacher.— there is no such possibility.’ And he understands: ‘It is possible that an ordinary person might cause a schism in the Saṅgha … might acknowledge another teacher — there is such a possibility.’",
    "mn115:14": "\"He understands: ‘It is impossible, it cannot happen that two Accomplished Ones, Fully Enlightened Ones, could arise contemporaneously in one world-system — there is no such possibility. ’[n.1089]MA: The arising of another Buddha is impossible from the time a bodhisatta takes his final conception in his mother's womb until his Dispensation has completely disappeared. The problem is discussed at Miln 236–39.And he understands: ‘It is possible that one Accomplished One, a Fully Enlightened One, might arise in one world-system — there is such a possibility.’ He understands: ‘It is impossible, it cannot happen that two Wheel-turning Monarchs could arise contemporaneously in one world-system … It is possible that one Wheel-turning Monarch might arise in one world-system — there is such a possibility.’",
    "mn115:15": "\"He understands: ‘It is impossible, it cannot happen that a woman could be an Accomplished One, a Fully Enlightened One — there is no such possibility.’[n.1090] This statement asserts only that a Fully Enlightened Buddha always has the male sex, but does not deny that a person who is now a woman may become a Fully Enlightened Buddha in the future. To do so, however, at an earlier point she will have had to be reborn as a man.And he understands: ‘It is possible that a man might be an Accomplished One, a Fully Enlightened One — there is such a possibility.’ He understands: ‘It is impossible, it cannot happen that a woman could be a Wheel-turning Monarch … that a woman could occupy the position of Sakka … that a woman could occupy the position of Māra … that a woman could occupy the position of Brahmā — there is no such possibility.’ And he understands: ‘It is possible that a man might be a Wheel-turning Monarch … that a man might occupy the position of Sakka … that a man might occupy the position of Māra … that a man might occupy the position of Brahmā — there is such a possibility.’",
    "mn115:16": "\"He understands: ’It is impossible, it cannot happen that a wished for, desired, agreeable result could be produced from bodily misconduct … from verbal misconduct … from mental misconduct — there is no such possibility.‘ And he understands: ’It is possible that an unwished for, undesired, disagreeable result might be produced from bodily misconduct … from verbal misconduct … from mental misconduct — there is such a possibility.‘",
    "mn115:17": "“He understands: ‘It is impossible, it cannot happen that an unwished for, undesired, disagreeable result could be produced from good bodily conduct … from good verbal conduct … from good mental conduct — there is no such possibility.’ And he understands: ‘It is possible that a wished for, desired, agreeable result might be produced from good bodily conduct … from good verbal conduct … from good mental conduct — there is such a possibility.’",
    "mn115:18": "When this was said, the venerable Ānanda said to the Blessed One: \"It is wonderful, venerable sir, it is marvellous! What is the name of this discourse on the Dhamma?\"",
    "mn115:19": "That is what the Blessed One said. The venerable Ānanda was satisfied and delighted in the Blessed One's words."
}