{
    "mn129:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn129:2": "\"Bhikkhus, there are these three characteristics of a fool, signs of a fool, attributes of a fool. What three? Here a fool is one who thinks bad thoughts, speaks bad words, and does bad deeds. If a fool were not so, how would the wise know him thus: ‘This person is a fool, an untrue man’? But because a fool is one who thinks bad thoughts, speaks bad words, and does bad deeds, the wise know him thus: ‘This person is a fool, an untrue man.’",
    "mn129:3": "If a fool is seated in an assembly or along a street or in a square and people there are discussing certain pertinent and relevant matters, then, if the fool is one who kills living beings, takes what is not given, misconducts himself in sensual pleasures, speaks falsehood, and indulges in wine, liquor, and intoxicants, which are the basis of negligence, he thinks: ‘These people are discussing certain pertinent and relevant matters; these things are found in me, and I am seen engaging in those things.’ This is the first kind of pain and grief that a fool feels here and now.",
    "mn129:4": "\"Again, when a robber culprit is caught, a fool sees kings having many kinds of torture inflicted on him:[n.1198] As atMN 13.11.having him flogged with whips, beaten with canes, beaten with clubs; having his hands cut off, his feet cut off, his hands and feet cut off; his ears cut off, his nose cut off, his ears and nose cut off; having him subjected to the ‘porridge pot,’ to the ‘polished-shell shave,’ to the ‘Rāhu's mouth,’ to the ‘fiery wreath,’ to the ‘flaming hand,’ to the ‘blades of grass,’ to the ‘bark dress,’ to the ‘antelope,’ to the ‘meat hooks,’ to the ‘coins,’ to the ‘lye pickling, ’ to the ‘pivoting pin,’ to the ‘rolled-up palliasse’; and having him splashed with boiling oil, and having him thrown to be devoured by dogs, and having him impaled alive on stakes, and having his head cut off with a sword. Then the fool thinks thus: ‘Because of such evil actions as those, when a robber culprit is caught, kings have many kinds of tortures inflicted on him: they have him flogged with whips … and have his head cut off with a sword. Those things are found in me, and I am seen engaging in those things.’ This is the second kind of pain and grief that a fool feels here and now.",
    "mn129:5": "\"Again, when a fool is on his chair or on his bed or resting on the ground, then the evil actions that he did in the past — his bodily, verbal, and mental misconduct — cover him, overspread him, and envelop him. Just as the shadow of a great mountain peak in the evening covers, overspreads, and envelops the earth, so too, when a fool is on his chair or on his bed or resting on the ground, then the evil actions that he did in the past — his bodily, verbal, and mental misconduct — cover him, overspread him, and envelop him. Then the fool thinks: ‘I have not done what is good, I have not done what is wholesome, I have not made myself a shelter from anguish. I have done what is evil, I have done what is cruel, I have done what is wicked. When I pass away, I shall go to the destination of those who have not done what is good … who have done what is wicked.’ He sorrows, grieves, and laments, he weeps beating his breast and becomes distraught. This is the third kind of pain and grief that a fool feels here and now.",
    "mn129:6": "\"A fool who has given himself over to misconduct of body, speech, and mind, on the dissolution of the body, after death, reappears in a state of deprivation, in an unhappy destination, even in hell.",
    "mn129:7": "When this was said, a bhikkhu asked the Blessed One: \"But, venerable sir, can a simile be given?\"",
    "mn129:8": "Then, taking a small stone the size of his hand, the Blessed One addressed the bhikkhus thus: \"What do you think, bhikkhus? Which is the greater, this small stone that I have taken, the size of my hand, or Himalaya, the king of mountains?\"",
    "mn129:9": "\"Now the wardens of hell torture him with the fivefold transfixing. They drive a red-hot iron stake through one hand, they drive a red-hot iron stake through the other hand, they drive a red-hot iron stake through one foot, they drive a red-hot iron stake through the other foot, they drive a red-hot iron stake in the middle through his breast. There he feels painful, racking, piercing feelings. Yet he does not die so long as that evil action has not exhausted its result.",
    "mn129:10": "It has four corners and is builtWith four doors, one set in each side,Walled up with iron and all aroundAnd shut in with an iron roof.",
    "mn129:11": "Its floor as well is made of ironAnd heated till it glows with fire.The raṅge is a full hundred leaguesWhich it covers all-pervasively.",
    "mn129:12": "\"Bhikkhus, I could tell you in many ways about hell.[n.00] And he will — atMN 130.17–27.So much so that it is hard to finish describing the suffering in hell.",
    "mn129:13": "\"Bhikkhus, there are animals that feed on grass. They eat by cropping fresh or dried grass with their teeth. And what animals feed on grass? Horses, cattle, donkeys, goats, and deer, and any other such animals. A fool who formerly delighted in tastes here and did evil actions here, on the dissolution of the body, after death, reappears in the company of animals that feed on grass.",
    "mn129:14": "\"There are animals that feed on dung. They smell dung from a distance and run to it, thinking: ‘We can eat, we can eat!’ Just as brahmins run to the smell of a sacrifice, thinking: ‘We can eat here, we can eat here!’ so too these animals that feed on dung smell dung from a distance and run to it, thinking: ‘We can eat here, we can eat here!’ And what animals feed on dung? Fowls, pigs, dogs, and jackals, and any other such animals. A fool who formerly delighted in tastes here and did evil actions here, on the dissolution of the body, after death, reappears in the company of animals that feed on dung.",
    "mn129:15": "\"There are animals that are born, age, and die in darkness. And what animals are born, age, and die in darkness? Moths, maggots, and earthworms, and any other such animals. A fool who formerly delighted in tastes here and did evil actions here, on the dissolution of the body, after death, reappears in the company of animals that are born, age, and die in darkness.",
    "mn129:16": "\"There are animals that are born, age, and die in water. And what animals are born, age, and die in water? Fish, turtles, and crocodiles, and any other such animals. A fool who formerly delighted in tastes here and did evil actions here, on the dissolution of the body, after death, reappears in the company of animals that are born, age, and die in water.",
    "mn129:17": "\"There are animals that are born, age, and die in filth. And what animals are born, age, and die in filth? Those animals that are born, age, and die in a rotten fish or in a rotten corpse or in rotten porridge or in a cesspit or in a sewer. A fool who formerly delighted in tastes here and did evil actions here, on the dissolution of the body, after death, reappears in the company of animals that are born, age, and die in filth.",
    "mn129:18": "\"Bhikkhus, I could tell you in many ways about the animal kingdom, so much so that it is hard to finish describing the suffering in the animal kingdom.",
    "mn129:19": "\"Suppose a man threw into the sea a yoke with one hole in it, and the east wind carried it to the west, and the west wind carried it to the east, and the north wind carried it to the south, and the south wind carried it to the north. Suppose there were a blind turtle that came up once at the end of each century. What do you think, bhikkhus? Would that blind turtle put his neck into that yoke with one hole in it?\"",
    "mn129:20": "\"If, sometime or other, at the end of a long period, that fool comes back to the human state, it is into a low family that he is reborn — into a family of outcasts or hunters or bamboo-workers or cartwrights or scavengers — one that is poor with little to eat and drink, surviving with difficulty, where he scarcely finds food and clothing; and he is ugly, unsightly, and misshapen, sickly, blind, cripple-handed, lame, or paralysed; he gets no food, drink, clothes, vehicles, garlands, scents and unguents, bed, lodging, and light; he misconducts himself in body, speech, and mind, and having done that, on the dissolution of the body, after death, he reappears in a state of deprivation, in an unhappy destination, in perdition, even in hell.",
    "mn129:21": "\"Bhikkhus, suppose a gambler at the very first unlucky throw loses his child and his wife and all his property and furthermore goes into bondage himself, yet an unlucky throw such as that is negligible; it is a far more unlucky throw when a fool who misconducts himself in body, speech, and mind, on the dissolution of the body, after death, reappears in a state of deprivation, in an unhappy destination, in perdition, even in hell. This is the complete perfection of the fool's grade.[n.1201]MA: That is, the fool engages in the three types of misconduct, because of which he is reborn in hell. By the residue of that kamma, when he comes back to the human state he is reborn in a low family. Having again engaged in the three types of misconduct, he is again reborn in hell.",
    "mn129:22": "\"Bhikkhus, there are these three characteristics of a wise man, signs of a wise man, attributes of a wise man. What three? Here a wise man is one who thinks good thoughts, speaks good words, and does good deeds. If a wise man were not so, how would the wise know him thus: ‘This person is a wise man, a true man’? But because a wise man is one who thinks good thoughts, speaks good words, and does good deeds, the wise know him thus: ‘This person is a wise man, a true man.’",
    "mn129:23": "\"Again, when a robber culprit is caught, a wise man sees kings having many kinds of torture inflicted on him …As atMN 13.11.having him flogged with whips, beaten with canes, beaten with clubs; having his hands cut off, his feet cut off, his hands and feet cut off; his ears cut off, his nose cut off, his ears and nose cut off; having him subjected to the ‘porridge pot,’ to the ‘polished-shell shave,’ to the ‘Rāhu's mouth,’ to the ‘fiery wreath,’ to the ‘flaming hand,’ to the ‘blades of grass,’ to the ‘bark dress,’ to the ‘antelope,’ to the ‘meat hooks,’ to the ‘coins,’ to the ‘lye pickling, ’ to the ‘pivoting pin,’ to the ‘rolled-up palliasse’; and having him splashed with boiling oil, and having him thrown to be devoured by dogs, and having him impaled alive on stakes, and having his head cut off with a sword. Then the fool thinks thus: ‘Because of such evil actions as those, when a robber culprit is caught, kings have many kinds of tortures inflicted on him: they have him flogged with whips … and have his head cut off with a sword. Then the wise man thinks thus: ‘Because of such evil actions as those, when a robber culprit is caught, kings have many kinds of tortures inflicted on him. Those things are not found in me, and I am not seen engaging in those things.’ This is the second kind of pleasure and joy that a wise man feels here and now.",
    "mn129:24": "\"Again, when a wise man is on his chair or on his bed or resting on the ground, then the good actions that he did in the past — his good bodily, verbal, and mental conduct — cover him, overspread him, and envelop him. Just as the shadow of a great mountain peak in the evening covers, overspreads, and envelops the earth, so too, when a wise man is on his chair or on his bed or resting on the ground, then the good actions that he did in the past — his good bodily, verbal, and mental conduct — cover him, overspread him, and envelop him. Then the wise man thinks: ‘I have not done what is evil, I have not done what is cruel, I have not done what is wicked. I have done what is good, I have done what is wholesome, I have made myself a shelter from anguish. When I pass away, I shall go to the destination of those who have not done what is evil … who have made themselves a shelter from anguish.’ He does not sorrow, grieve, and lament, he does not weep beating his breast and become distraught. This is the third kind of pleasure and joy that a wise man feels here and now.",
    "mn129:25": "\"A wise man who has given himself over to good conduct of body, speech, and mind, on the dissolution of the body, after death, reappears in a happy destination, even in heaven.",
    "mn129:26": "When this was said, a bhikkhu asked the Blessed One: \"But, venerable sir, can a simile be given?\"",
    "mn129:27": "\"Then the head-anointed noble king rises from his seat, and taking a water vessel in his left hand, he sprinkles the wheel-treasure with his right hand, saying: ‘Turn forward, good wheel-treasure; triumph, good wheel-treasure!’ Then the wheel-treasure turns forward rolling in the eastern direction and the Wheel-turning Monarch follows it with his four-constituent army. Now in whatever region the wheel-treasure pauses, there the Wheel-turning Monarch takes up his abode with his four-constituent army. And opposing kings in the eastern direction come to the Wheel-turning Monarch and speak thus: ‘Come, great king; welcome, great king; command, great king; advise, great king.’ The Wheel-turning Monarch speaks thus: ‘You should not kill living beings; you should not take what has not been given; you should not misconduct yourselves in sensual pleasures; you should not speak falsehood; you should not drink intoxicants; you should eat what you are accustomed to eat.’ And the opposing kings in the eastern direction submit to the Wheel-turning Monarch.",
    "mn129:28": "\"Then the wheel-treasure plunges into the eastern ocean and emerges again. And then it turns forward rolling in the southern direction … And the opposing kings in the southern direction submit to the Wheel-turning Monarch. Then the wheel-treasure plunges into the southern ocean and emerges again. And then it turns forward rolling in the western direction … And the opposing kings in the western direction submit to the Wheel-turning Monarch. Then the wheel-treasure plunges into the western ocean and emerges again. …",
    "mn129:29": "..And then it turns forward rolling in the northern direction … And the opposing kings in the northern direction submit to the Wheel-turning Monarch.",
    "mn129:30": "\"Now when the wheel-treasure has triumphed over the earth to the ocean's edge, it returns to the royal capital and remains as if fixed on its axle at the gate of the Wheel-turning Monarch's inner palace, as an adornment to the gate of his inner palace. Such is the wheel-treasure that appears to a Wheel-turning Monarch.",
    "mn129:31": "\"Again, the elephant-treasure appears to the Wheel-turning Monarch, all white, with sevenfold stance, with supernormal power, flying through the air, the king of elephants named ‘Uposatha.’ On seeing him, the Wheel-turning Monarch's mind has confidence in him thus: ‘It would be wonderful to ride the elephant, if he would undergo taming!’ Then the elephant-treasure undergoes taming just like a fine thoroughbred elephant well tamed for a long time. And it so happens that the Wheel-turning Monarch, when testing the elephant-treasure, mounts him in the morning, and after traversing the whole earth to the edge of the ocean, he returns to the royal capital to take his morning meal. Such is the elephant-treasure that appears to a Wheel-turning Monarch.",
    "mn129:32": "\"Again, the horse-treasure appears to the Wheel-turning Monarch, all white, with raven-black head, with mane like muñja grass, with supernormal power, flying through the air, the king of horses named ‘Valāhaka’‘Thundercloud’. On seeing him, the Wheel-turning Monarch's mind has confidence in him thus: ‘It would be wonderful to ride the horse, if he would undergo taming!’ Then the horse-treasure undergoes taming just like a fine thoroughbred horse well tamed for a long time. And it so happens that the Wheel-turning Monarch, when testing the horse-treasure, mounts him in the morning, and after traversing the whole earth to the edge of the ocean, he returns to the royal capital to take his morning meal. Such is the horse-treasure that appears to a Wheel-turning Monarch.",
    "mn129:33": "\"Again, the jewel-treasure appears to the Wheel-turning Monarch. The jewel is fine beryl of purest water, eight-faceted, and well cut. Now the radiance of the jewel-treasure spreads around for a whole league. And it so happens that when the Wheel-turning Monarch is testing the jewel-treasure, he draws up his four-constituent army in array, and mounting the jewel on top of his banner, he sets forth in the darkness and gloom of the night. Then all theinhabitants of thevillages nearby begin their work by its light, thinking that it is day. Such is the jewel-treasure that appears to a Wheel-turning Monarch.",
    "mn129:34": "\"Again, the woman-treasure appears to the Wheel-turning Monarch, beautiful, comely and graceful, possessing the supreme beauty of complexion, neither too tall nor too short, neither too slim nor too stout, neither too dark nor too fair, surpassing human beauty without reaching divine beauty. The touch of the woman-treasure is such that it is like a tuft of kapok or a tuft of cotton-wool. When it is cool, her limbs are warm; when it is warm, her limbs are cool. From her body the scent of sandalwood comes forth, and from her mouth the scent of lotuses. She rises before the Wheel-turning Monarch and retires after him. She is eager to serve, agreeable in conduct, and sweet in speech. Since she is never unfaithful to the Wheel-turning Monarch even in thought, how could she be so in body? Such is the woman-treasure that appears to a Wheel-turning Monarch.",
    "mn129:35": "\"Again, the steward-treasure appears to the Wheel-turning Monarch. The divine eye born of past action is manifested in him whereby he sees hidden stores of treasure both with owners and ownerless. He approaches the Wheel-turning Monarch and says: ‘Sire, you remain at ease. I shall take care of your monetary affairs.’ And it so happens that when the Wheel-turning Monarch is testing the steward-treasure, he boards a boat, and putting out into the river Ganges, in midstream he tells the steward-treasure: ‘I need gold and bullion, steward.’ — ‘Then, sire, let the boat be steered towards one bank.’ — ‘Steward, it is actually here that I need gold and bullion.’ Then the steward-treasure plunges both hands into the water and draws up a pot full of gold and bullion, and he tells the Wheel-turning Monarch: ‘Is this enough, sire? Is enough done, enough offered?’ — ‘This is enough, steward, enough is done, enough offered.’ Such is the steward-treasure that appears to a Wheel-turning Monarch.",
    "mn129:36": "\"Again, the counsellor-treasure appears to the Wheel-turning Monarch, wise, shrewd, and sagacious, capable of getting the Wheel-turning Monarch to promote that which is worthy of being promoted, to dismiss that which should be dismissed, and to establish that which should be established. He approaches the Wheel-turning Monarch and says: ‘Sire, you remain at ease. I shall govern.’ Such is the counsellor-treasure that appears to a Wheel-turning Monarch.",
    "mn129:37": "\"What are the four kinds of success? Here a Wheel-turning Monarch is handsome, comely, and graceful, possessing the supreme beauty of complexion, and he surpasses other human beings in that respect. This is the first kind of success that a Wheel-turning Monarch possesses.",
    "mn129:38": "\"Again, a Wheel-turning Monarch lives long and endures long, and he surpasses other human beings in that respect. This is the second kind of success that a Wheel-turning Monarch possesses.",
    "mn129:39": "\"Again, a Wheel-turning Monarch is free from illness and affliction, possessing a good digestion that is neither too cool nor too warm, and he surpasses other human beings in that respect. This is the third kind of success that a Wheel-turning Monarch possesses.",
    "mn129:40": "\"Again, a Wheel-turning Monarch is dear and agreeable to brahmins and householders. Just as a father is dear and agreeable to his children, so too a Wheel-turning Monarch is dear and agreeable to brahmins and householders. Brahmins and householders, too, are dear and agreeable to a Wheel-turning Monarch. Just as children are dear and agreeable to a father, so too brahmins and householders are dear and agreeable to a Wheel-turning Monarch.",
    "mn129:41": "Once a Wheel-turning Monarch was driving in a pleasure park with his four-constituent army. Then brahmins and householders went to him and spoke thus: ‘Sire, drive slowly that we may see you longer.’ And so he told his charioteer: ‘Charioteer, drive slowly that I may see the brahmins and householders longer.’ This is the fourth kind of success that a Wheel-turning Monarch possesses.",
    "mn129:42": "\"What do you think, bhikkhus? Would a Wheel-turning Monarch experience pleasure and joy because of possessing these seven treasures and these four kinds of success?\"",
    "mn129:43": "Then, taking a small stone the size of his hand, the Blessed One addressed the bhikkhus thus: \"What do you think, bhikkhus? Which is the greater, this small stone that I have taken, the size of my hand, or Himalaya, the king of mountains?\"",
    "mn129:44": "\"If, some time or other, at the end of a long period, the wise man comes back to the human state, it is into a high family that he is reborn — into a family of well-to-do nobles, or well-to-do brahmins, or well-to-do householders — one that is rich, of great wealth, of great possessions, with abundant gold and silver, with abundant assets and means, and with abundant money and grain. He is handsome, comely and graceful, possessing the supreme beauty of complexion. He obtains food and drink, clothes, vehicles, garlands, scents and unguents, bed, lodging, and light. He conducts himself well in body, speech, and mind, and having done so, on the dissolution of the body, after death, he reappears in a happy destination, even in the heavenly world.",
    "mn129:45": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}