{
    "mn122:1": "Thus have I heard.[n.45] This sutta together with its full commentary has been published in translation by Ñm asThe Greater Discourse on Voidness.On one occasion the Blessed One was living in the Sakyan country at Kapilavatthu in Nigrodha's Park.",
    "mn122:2": "Now on that occasion the venerable Ānanda, along with many bhikkhus, was busy making robes at Ghāṭā the Sakyan's dwelling. Then, when it was evening, the Blessed One rose from retreat and went to Ghāṭā the Sakyan's dwelling. There he sat down on a seat made ready and asked the venerable Ānanda:",
    "mn122:3": "\"Ānanda, a bhikkhu does not shine by delighting in company, by taking delight in company, by devoting himself to delight in company; by delighting in society, by taking delight in society, by rejoicing in society. Indeed, Ānanda, it is not possible that a bhikkhu who delights in company, takes delight in company, and devotes himself to delight in company, who delights in society, takes delight in society, and rejoices in society, will ever obtain at will, without trouble or difficulty, the bliss of renunciation, the bliss of seclusion, the bliss of peace, the bliss of enlightenment.[n.1149] SeeMN 66.20andn.678.But it can be expected that when a bhikkhu lives alone, withdrawn from society, he will obtain at will, without trouble or difficulty, the bliss of renunciation, the bliss of seclusion, the bliss of peace, the bliss of enlightenment.",
    "mn122:4": "\"Indeed, Ānanda, it is not possible that a bhikkhu who delights in company, takes delight in company, and devotes himself to delight in company, who delights in society, takes delight in society, and rejoices in society, will ever enter upon and abide in either the deliverance of mind that is temporary and delectable or inthe deliverance of mindthat is perpetual and unshakeable.[n.1150] The former is deliverance through the jhānas and the immaterial attainments, the latter deliverance through the supramundane paths and fruits. See alsoMN 29.6andn.38.But it can be expected that when a bhikkhu lives alone, withdrawn from society, he will enter upon and abide in the deliverance of mind that is temporary and delectable or inthe deliverance of mindthat is perpetual and unshakeable.",
    "mn122:5": "\"I do not see even a single kind of form, Ānanda, from the change and alteration of which there would not arise sorrow, lamentation, pain, grief, and despair in one who lusts for it and takes delight in it.",
    "mn122:6": "\"However, Ānanda, there is this abiding discovered by the Tathāgata: to enter and abide in voidness internally by giving no attention to all signs.[n.1151]MA: The Buddha begins the present passage in order to ward off the criticism that while he enjoins his disciples to live in solitude, he himself is often surrounded by a large retinue. \"Voidness\" here is the fruition attainment of voidness; see n.1137.If, while the Tathāgata is abiding thus, he is visited by bhikkhus or bhikkhunīs, by men or women lay followers, by kings or kings’ ministers, by other sectarians or their disciples, then with a mind leaning to seclusion, tending and inclining to seclusion, withdrawn, delighting in renunciation, and altogether done away with things that are the basis for taints, he invariably talks to them in a way concerned with dismissing them.",
    "mn122:7": "And how does he steady his mind internally, quiet it, bring it to singleness, and concentrate it?",
    "mn122:8": "\"Then that bhikkhu should steady his mind internally, quiet it, bring it to singleness, and concentrate it on that same sign of concentration as before.[n.1154]MA: This refers to the jhāna that was used as the basis for insight. If, after emerging from the basic jhāna, his mind does not enter into voidness through insight contemplation on his own aggregates or those of others, and he also cannot attain the imperturbable immaterial attainment, he should return to the same basic jhāna that he originally developed and attend to it again and again.Then he gives attention to voidness internally. While he is giving attention to voidness internally, his mind enters into voidness internally and acquires confidence, steadiness, and decision. When that is so, he understands thus: ‘While I am giving attention to voidness internally, my mind enters into voidness internally and acquires confidence, steadiness, and decision.’ In this way he has full awareness of that.",
    "mn122:9": "\"When a bhikkhu abides thus, if his mind inclines to walking, he walks, thinking: ‘While I am walking thus, no evil unwholesome states of covetousness and grief will beset me.’ In this way he has full awareness of that. And when a bhikkhu abides thus, if his mind inclines to standing, he stands … If his mind inclines to sitting, he sits … If his mind inclines to lying down, he lies down, thinking: ‘While I am lying down thus, no evil unwholesome states will beset me.’ In this way he has full awareness of that.",
    "mn122:10": "\"When a bhikkhu abides thus, if his mind inclines to talking, he resolves: ‘Such talk as is low, vulgar, coarse, ignoble, unbeneficial, and which does not lead to disenchantment, dispassion, cessation, peace, direct knowledge, enlightenment, and Nibbāna, that is, talk of kings, robbers, ministers, armies, dangers, battles, food, drink, clothing, beds, garlands, perfumes, relatives, vehicles, villages, towns, cities, countries, women, heroes, streets, wells, the dead, trivialities, the origin of the world, the origin of the sea, whether things are so or are not so: such talk I shall not utter.’ In this way he has full awareness of that.",
    "mn122:11": "\"When a bhikkhu abides thus, if his mind inclines to thinking, he resolves: ‘Such thoughts as are low, vulgar, coarse, ignoble, unbeneficial, and which do not lead to disenchantment, dispassion, cessation, peace, direct knowledge, enlightenment, and Nibbāna, that is, thoughts of sensual desire, thoughts of ill will, and thoughts of cruelty: such thoughts I shall not think.’ In this way he has full awareness of that.",
    "mn122:12": "\"Ānanda, there are these five cords of sensual pleasure.[n.1155] According toMA, up to this point the Buddha has shown the training for the attainment of the first two paths, those of stream-entry and once-returning. He now speaks the present passage (§) to point out the insight needed to attain the path of non-returning, which culminates in the abandoning of sensual desire.What five? Forms cognizable by the eye that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. Sounds cognizable by the ear … Odours cognizable by the nose … Flavours cognizable by the tongue … Tangibles cognizable by the body that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. These are the five cords of sensual pleasure.",
    "mn122:13": "\"Ānanda, there are these five aggregates affected by clinging,[n.1156] This passage (§) points out the insight needed to attain the path of arahantship, which culminates in the abandoning of the conceit \"I am.\"in regard to which a bhikkhu should abide contemplating rise and fall thus: ‘Such is material form, such its arising, such its disappearance; such is feeling, such its arising, such its disappearance; such is perception, such its arising, such its disappearance; such are formations, such their arising, such their disappearance; such is consciousness, such its arising, such its disappearance.’",
    "mn122:14": "\"Ānanda, a disciple should not seek the Teacher's company for the sake of discourses, stanzas, and expositions. Why is that? For a long time, Ānanda, you have learned the teachings, remembered them, recited them verbally, examined them with the mind, and penetrated them well by view. But such talk as deals with effacement, as favours the mind's release, and which leads to complete disenchantment, dispassion, cessation, peace, direct knowledge, enlightenment, and Nibbāna, that is, talk on wanting little, on contentment, seclusion, aloofness from society, arousing energy, virtue, concentration, wisdom, deliverance, knowledge and vision of deliverance: for the sake of such talk a disciple should seek the Teacher's company even if he is told to go away.",
    "mn122:15": "\"Since this is so, Ānanda, a teacher's undoing may come about, a pupil's undoing may come about, and the undoing of one who lives the holy life may come about.[n.17]Ācariyūpaddava, antevāsūpaddava, brahmacariyūpaddava. Upaddavamay also be rendered as disaster, calamity.MAexplains that the Buddha speaks the present passage to show the danger in solitude when one does not fulfil the proper purpose of solitary living. The \"teacher\" is a teacher outside the Buddha’s Dispensation.",
    "mn122:16": "\"And how does a teacher's undoing come about? Here some teacher resorts to a secluded resting place: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw. While he lives thus withdrawn, brahmins and householders from town and country visit him, and as a result he goes astray, becomes filled with desire, succumbs to craving, and reverts to luxury. This teacher is said to be undone by the teacher's undoing. He has been struck down by evil unwholesome states that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death. This is how the teacher's undoing comes about.",
    "mn122:17": "\"And how does a pupil's undoing come about? A pupil of that teacher, emulating the teacher's seclusion, resorts to a secluded resting place: the forest … a heap of straw. While he lives thus withdrawn, brahmins and householders from town and country visit him, and as a result he goes astray, becomes filled with desire, succumbs to craving, and reverts to luxury. This pupil is said to be undone by the pupil's undoing. He has been struck down by evil unwholesome states that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death. This is how the pupil's undoing comes about.",
    "mn122:18": "\"And how does the undoing of one who lives the holy life come about? Here a Tathāgata appears in the world, accomplished and fully enlightened, perfect in true knowledge and conduct, sublime, knower of worlds, incomparable leader of persons to be tamed, teacher of gods and humans, enlightened, blessed. He resorts to a secluded resting place: the forest … a heap of straw. While he lives thus withdrawn, brahmins and householders from town and country visit him, yet he does not go astray, or become filled with desire, succumb to craving, and revert to luxury. But a disciple of this teacher, emulating his teacher's seclusion, resorts to a secluded resting place: the forest … a heap of straw. While he lives thus withdrawn, brahmins and householders from town and country visit him, and as a result he goes astray, becomes filled with desire, succumbs to craving, and reverts to luxury. This one who lives the holy life is said to be undone by the undoing of one who lives the holy life. He has been struck down by evil unwholesome states that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death. Thus there comes to be the undoing of one who leads the holy life.",
    "mn122:19": "And herein, Ānanda, the undoing of one who leads the holy life has a more painful result, a more bitter result, than the teacher's undoing or the pupil's undoing, and it even leads to perdition.[n.1158]MA: The going forth into homelessness outside the Dispensation brings small gain, so one who falls away from that falls away only from mundane attainment; he meets with no great suffering, as one who falls from the back of a donkey merely becomes covered with dust. But the going forth in the Buddha’s Dispensation brings great gain — the paths, fruits, and Nibbāna. Thus one who falls away from this meets great suffering, like one who falls from the back of an elephant.",
    "mn122:20": "\"Therefore, Ānanda, behave towards me with friendliness, not with hostility. That will lead to your welfare and happiness for a long time.",
    "mn122:21": "And how do disciples behave towards the Teacher with hostility, not with friendliness? Here, Ānanda, compassionate and seeking their welfare, the Teacher teaches the Dhamma to the disciples out of compassion: ‘This is for your welfare, this is for your happiness.’ His disciples do not want to hear or give ear or exert their minds to understand; they err and turn aside from the Teacher's Dispensation. Thus do disciples behave towards the Teacher with hostility, not with friendliness.",
    "mn122:22": "\"And how do disciples behave towards the Teacher with friendliness, not with hostility? Here, Ānanda, compassionate and seeking their welfare, the Teacher teaches the Dhamma to the disciples out of compassion: ‘This is for your welfare, this is for your happiness.’ His disciples want to hear and give ear and exert their minds to understand; they do not err and turn aside from the Teacher's Dispensation. Thus do disciples behave towards the Teacher with friendliness, not with hostility.",
    "mn122:23": "Therefore, Ānanda, behave towards me with friendliness, not with hostility. That will lead to your welfare and happiness for a long time.",
    "mn122:24": "That is what the Blessed One said. The venerable Ānanda was satisfied and delighted in the Blessed One's words."
}