{
    "mn127:1": "Thus have I heard. On one occasion the Blessed One was living at S̄vatth in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn127:2": "Then, when the night had ended, it being morning, the venerable Anuruddha dressed, and taking his bowl and outer robe, he went to the carpenter Pañcakanga's house and sat down on a seat made ready. Then, with his own hands, the carpenter Pañcakanga served and satisfied the venerable Anuruddha with the various kinds of good food. Then, when the venerable Anuruddha had eaten and had put his bowl aside, the carpenter Pañcakanga took a low seat, sat down at one side, and said to the venerable Anuruddha:",
    "mn127:3": "\"Here, venerable sir, elder bhikkhus have come to me and said: ‘Householder, develop the immeasurable deliverance of mind’; and some elders have said: ‘Householder, develop the exalted deliverance of mind.’ Venerable sir, the immeasurable deliverance of mind and the exalted deliverance of mind[n.1180]Appamāṇā cetovimutti, mahaggatā cetovimutti.AtMN 4.1, as here, the immeasurable deliverance of mind is explained as the fourbrahmavihāras.Since the formula for eachbrahmavihāraincludes the word \"exalted,\" Pañcakanga was apparently misled into supposing that the two deliverances were the same in meaning.— are these states different in meaning and different in name, or are they one in meaning and different only in name?\"",
    "mn127:4": "\"What, householder, is the immeasurable deliverance of mind? Here a bhikkhu abides pervading one quarter with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to himself, he abides pervading the all-encompassing world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, without hostility and without ill will. He abides pervading one quarter with a mind imbued with compassion … He abides pervading one quarter with a mind imbued with altruistic joy … He abides pervading one quarter with a mind imbued with equanimity … abundant, exalted, immeasurable, without hostility and without ill will. This is called the immeasurable deliverance of mind.",
    "mn127:5": "\"And what, householder, is the exalted deliverance of mind? Here a bhikkhu abides resolved upon an area the size of the root of one tree, pervading it as exalted: this is called the exalted deliverance of mind.[n.1181]MA: He covers an area the size of one tree root with his kasiṇa sign, and he abides resolved upon that kasiṇa sign, pervading it with the exalted jhāna. The same method of explanation applies to the following cases.Here a bhikkhu abides resolved upon an area the size of the roots of two or three trees, pervading it as exalted: this too is called the exalted deliverance of mind. Here a bhikkhu abides resolved upon an area the size of one village, pervading it as exalted … … an area the size of two or three villages … an area the size of one major kingdom … an area the size of two or three major kingdoms … an area the size of the earth bounded by the ocean, pervading it as exalted: this too is called the exalted deliverance of mind. It is in this way, householder, that it can be understood how these states are different in meaning and different in name.",
    "mn127:6": "\"There are, householder, these four kinds of reappearancein a future state ofbeing.[n.1182]MA: This teaching is undertaken to show the kinds of rebirth that result from the attainment of the exalted deliverance.What four? Here someone abides resolved upon and pervading ‘limited radiance’; on the dissolution of the body, after death, he reappears in the company of the gods of Limited Radiance. Here someone abides resolved upon and pervading ‘immeasurable radiance’; on the dissolution of the body, after death, he reappears in the company of the gods of Immeasurable Radiance. Here someone abides resolved upon and pervading ‘defiled radiance’; on the dissolution of the body, after death, he reappears in the company of the gods of Defiled Radiance. Here someone abides resolved upon and pervading ‘pure radiance’; on the dissolution of the body, after death, he reappears in the company of the gods of Pure Radiance. These are the four kinds of reappearancein a future state ofbeing.[n.1183]MAexplains that there are no separate realms of gods called those of \"Defiled Radiance\" and those of \"Pure Radiance.\" Both are subdivisions within the two realms — the gods of Limited Radiance and the gods of Immeasurable Radiance. Rebirth among the gods of Limited Radiance is determined by the attainment of the (second) jhāna with a limited kasiṇasign, rebirth among the gods of Immeasurable Radiance by the attainment of the same jhāna with an extended kasiṇa sign. Rebirth with defiled radiance is for those who have not mastered the jhāna and purified it of obstructive states; rebirth with pure radiance is for those who have acquired this mastery and purification.",
    "mn127:7": "\"There is an occasion, householder, when those deities assemble in one place. When they have assembled in one place, a difference in their colour can be discerned but no difference in their radiance. Just as, if a man were to bring several oil-lamps into a house, a difference in the flames of the lamps might be discerned but no difference in their radiance; so too, there is an occasion when those deities assemble in one place … but no difference in their radiance.",
    "mn127:8": "\"There is an occasion, householder, when those deities disperse from there. When they have dispersed, a difference in their colours can be discerned and also a difference in their radiance. Just as, if the man were to remove those several oil-lamps from that house, a difference might be discerned in the flames of the lamps and also a difference in their radiance; so too, there is an occasion when those deities disperse from there … and also a difference in their radiance.",
    "mn127:9": "\"It does not occur to those deities: ‘Thislifeof ours is permanent, everlasting, and eternal,’ yet wherever those deities settle down, there they find delight. Just as, when flies are being carried along on a carrying-pole or on a basket, it does not occur to them: ‘Thislifeof ours is permanent, everlasting, or eternal,’ yet wherever those flies settle down, there they find delight; so too, it does not occur to those deities … yet wherever they settle down, there they find delight.\"",
    "mn127:10": "When this was said, the venerable Abhiya Kaccāna said to the venerable Anuruddha: \"Good, venerable Anuruddha, yet I have something further to ask: Are all those radiant ones deities of Limited Radiance, or are some of them deities of Immeasurable Radiance?\"",
    "mn127:11": "\"As to that, friend Kaccāna, I shall ask you a question in return. Answer it as you choose. What do you think, friend Kaccāna? When one bhikkhu abides resolved upon an area the size of the root of one tree, pervading it as exalted, and another bhikkhu abides resolved upon the area the size of the roots of two or three trees, pervading it as exalted — which of these types of mental development is more exalted?\" — \"The second, venerable sir.\"",
    "mn127:12": "\"What do you think, friend Kaccāna? When one bhikkhu abides resolved upon an area the size of the roots of two or three trees, pervading it as exalted, and another bhikkhu abides resolved upon an area the size of one village, pervading it as exalted …",
    "mn127:13": "… an area the size of one village and an area the size of two or three villages …",
    "mn127:14": "… an area the size of two or three villages and an area the size of one major kingdom …",
    "mn127:15": "… an area the size of one major kingdom and an area the size of two or three major kingdoms …",
    "mn127:16": "… an area the size of two or three major kingdoms and an area the size of the earth bounded by the ocean, pervading it as exalted — which of these two types of mental development is more exalted?\" — \"The second, venerable sir.\"",
    "mn127:17": "\"Good, venerable Anuruddha, yet I have something further to ask: Are all those radiant ones deities of Defiled Radiance, or are some of them deities of Pure Radiance?\"",
    "mn127:18": "\"As to that, friend Kaccāna, I shall give a simile, for some wise men here understand the meaning of a statement by means of a simile. Suppose an oil-lamp is burning with impure oil and an impure wick; because of the impurity of its oil and its wick it burns dimly. So too, here a bhikkhu abides resolved upon and pervadingan area witha defiled radiance. His bodily inertia has not fully subsided, his sloth and torpor have not been fully eliminated, his restlessness and remorse have not been fully removed; because of this he meditates, as it were, dimly.[n.14] A pun is involved here. In Pali the verbjhāyatimeans both to burn and to meditate, though the two meanings are derived from different Sanskrit verbs:kshāyatiis to burn,dhyāyatito meditate.On the dissolution of the body, after death, he reappears in the company of the gods of Defiled Radiance.",
    "mn127:19": "When this was said, the venerable Abhiya Kaccāna said to the venerable Anuruddha: \"Good, venerable Anuruddha. The venerable Anuruddha does not say: ‘Thus have I heard’ or ‘It should be thus.’ Rather, the venerable Anuruddha says: ‘These gods are thus and those gods are such.’ It occurs to me, venerable sir, that the venerable Anuruddha certainly has previously associated with those deities and talked with them and held conversations with them.\"",
    "mn127:20": "When this was said, the venerable Abhiya Kaccāna said to the carpenter Pañcakanga: \"It is a gain for you, householder, it is a great gain for you that you have abandoned your state of doubt and have had the opportunity to hear this discourse on the Dhamma.\""
}