{
    "mn126:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Bamboo Grove, the Squirrels’ Sanctuary.",
    "mn126:2": "Then, when the venerable Bhūmija had returned from his almsround after his meal, he went to the Blessed One. After paying homage to him, he sat down at one side and told the Blessed One what had occurred, adding: \"Venerable sir, I hope that when I was asked such a question and answered thus, I said what has been said by the Blessed One and did not misrepresent him with what is contrary to fact. I hope I explained in accordance with the Dhamma in such a way that nothing which provides a ground for censure can be legitimately deduced from my assertion.\"",
    "mn126:3": "\"Surely, Bhūmija, when you were asked such a question and answered thus, you said what has been said by me and did not misrepresent me with what is contrary to fact. You explained in accordance with the Dhamma in such a way that nothing which provides a ground for censure can be legitimately deduced from your assertion.",
    "mn126:4": "\"Suppose a man needing oil, seeking oil, wandering in search of oil, were to heap up gravel in a tub, sprinkle it all over with water, and press it. Then, if he made an aspiration and acted thus, he would be unable to procure any oil; if he made no aspiration and acted thus, he would still be unable to procure any oil; if he both made an aspiration and made no aspiration and acted thus, he would still be unable to procure any oil; if he neither made an aspiration nor made no aspiration and acted thus, he would still be unable to procure any oil. Why is that? Because thatway of actingis not a proper method for procuring oil. So too, whatever recluses and brahmins have wrong view … they are still unable to procure any fruit. Why is that? Because thatwrong pathis not a proper method for procuring fruit.",
    "mn126:5": "\"Suppose a man needing milk, seeking milk, wandering in search of milk, were to pull a recently-calved cow by her horn. Then, if he made an aspiration … if he made no aspiration … if he both made an aspiration and made no aspiration … if he neither made an aspiration nor made no aspiration and acted thus, he would still be unable to procure any milk. Why is that? Because thatway of actingis not a proper method for procuring milk. So too, whatever recluses and brahmins have wrong view … they are still unable to procure any fruit. Why is that? Because thatwrong pathis not a proper method for procuring fruit.",
    "mn126:6": "\"Suppose a man needing butter, seeking butter, wandering in search of butter, were to pour water into a churn and churn it with a churning-stick. Then, if he made an aspiration … if he made no aspiration … if he both made an aspiration and made no aspiration … if he neither made an aspiration nor made no aspiration and acted thus, he would still be unable to procure any butter. Why is that? Because thatway of actingis not a proper method for procuring butter. So too, whatever recluses and brahmins have wrong view … they are still unable to procure any fruit. Why is that? Because thatwrong pathis not a proper method for procuring fruit.",
    "mn126:7": "\"Suppose a man needing fire, seeking fire, wandering in search of fire, were to take an upper fire-stick and rub a wet sappy piece of wood with it. Then, if he made an aspiration … if he made no aspiration … if he both made an aspiration and made no aspiration … if he neither made an aspiration nor made no aspiration and acted thus, he would still be unable to procure any fire. Why is that? Because thatway of actingis not a proper method for procuring fire. So too, whatever recluses and brahmins have wrong view … they are still unable to procure any fruit. Why is that? Because thatwrong pathis not a proper method for procuring fruit.",
    "mn126:8": "\"Suppose a man needing oil, seeking oil, wandering in search of oil, were to heap up sesamum flour in a tub, sprinkle it all over with water, and press it. Then, if he made an aspiration and acted thus, he would be able to procure oil; if he made no aspiration and acted thus, he would still be able to procure oil; if he both made an aspiration and made no aspiration and acted thus, he would still be able to procure oil; if he neither made an aspiration nor made no aspiration and acted thus, he would still be able to procure oil. Why is that? Because thatway of actingis a proper method for procuring oil. So too, whatever recluses and brahmins have right view … they are still able to procure fruit. Why is that? Because thatright pathis a proper method for procuring fruit.",
    "mn126:9": "\"Suppose a man needing milk, seeking milk, wandering in search of milk, were to pull a recently-calved cow by her udder. Then, if he made an aspiration … if he made no aspiration … if he both made an aspiration and made no aspiration … if he neither made an aspiration nor made no aspiration and acted thus, he would still be able to procure milk. Why is that? Because thatway of actingis a proper method for procuring milk. So too, whatever recluses and brahmins have right view … they are still able to procure fruit. Why is that? Because thatright pathis a proper method for procuring fruit.",
    "mn126:10": "\"Suppose a man needing butter, seeking butter, wandering in search of butter, were to pour curd into a churn and churn it with a churning-stick. Then, if he made an aspiration … if he made no aspiration … if he both made an aspiration and made no aspiration … if he neither made an aspiration nor made no aspiration and acted thus, he would still be able to procure butter. Why is that? Because thatway of actingis a proper method for procuring butter. So too, whatever recluses and brahmins have right view … they are still able to procure fruit. Why is that? Because thatright pathis a proper method for procuring fruit.",
    "mn126:11": "\"Suppose a man needing fire, seeking fire, wandering in search of fire, were to take an upper fire-stick and rub a dry sapless piece of wood with it. Then, if he made an aspiration … if he made no aspiration … if he both made an aspiration and made no aspiration … if he neither made an aspiration nor made no aspiration and acted thus, he would still be able to procure fire. Why is that? Because thatway of actingis a proper method for procuring fire. So too, whatever recluses and brahmins have right view … they are still able to procure fruit. Why is that? Because thatright pathis a proper method for procuring fruit.",
    "mn126:12": "\"Bhūmija, if these four similes had occurred to youwith referenceto Prince Jayasena, he would have spontaneously acquired confidence in you, and being confident, would have shown his confidence to you.\"",
    "mn126:13": "That is what the Blessed One said. The venerable Bhūmija was satisfied and delighted in the Blessed One's words."
}