{
    "mn128:1": "Thus have I heard. On one occasion the Blessed One was living at Kosamb in Ghosita's Park.",
    "mn128:2": "When this was said, a certain bhikkhu said to the Blessed One: \"Wait, venerable sir! Let the Blessed One, the Lord of the Dhamma, live at ease devoted to a pleasant abiding here and now. We are the ones who will be responsible for this quarrelling, brawling, wrangling, and dispute.\"",
    "mn128:3": "Then, when it was morning, the Blessed One dressed, and taking his bowl and outer robe, entered Kosambī for alms. When he had wandered for alms in Kosambī and had returned from his almsround, after his meal he set his resting place in order, took his bowl and outer robe, and while standing uttered these stanzas:",
    "mn128:4": "\"When many voices shout at onceNone considers himself a fool;Though the Saṅgha is being splitNone thinks himself to be at fault.",
    "mn128:5": "They have forgotten thoughtful speech,They talk obsessed by words alone.Uncurbed their mouths, they bawl at will;None knows what leads him so to act.",
    "mn128:6": "‘He abused me, he struck me,[n.1187] Verses  to 8 are also found atDhammapada 2 to .(Verses 11 to 13 are also foundDhammapada 328 to 330).He defeated me, he robbed me’ —In those who harbour thoughts like theseHatred will never be allayed.",
    "mn128:7": "‘He abused me, he struck me,He defeated me, he robbed me.’In those who do not harbour thoughts like theseHatred will readily be allayed.",
    "mn128:8": "For in this world hatred is neverAllayed by further acts of hate.It is allayed by non-hatred:That is the fixed and ageless law.",
    "mn128:9": "Those others do not recogniseThat here we should restrain ourselves.But those wise ones who realise thisAt once end all their enmity.",
    "mn128:10": "Breakers of bones and murderers,Those who steal cattle, horses, wealth,Those who pillage the entire realm —When even these can act togetherWhy can you not do so too?",
    "mn128:11": "Verses  to 13 are also foundDhammapada 328 to 330. (Verses 6 to 8 are also found atDhammapada 2 to 6.)If one can find a worthy friend,A virtuous, steadfast companion,Then overcome all threats of dangerAnd walk with him content and mindful.",
    "mn128:12": "But if one finds no worthy friend,No virtuous, steadfast companion,Then as a king leaves his conquered realm,Walk like a tusker in the woods alone.",
    "mn128:13": "Better it is to walk alone,There is no companionship with fools.Walk alone and do no evil,At ease like a tusker in the woods.\"",
    "mn128:14": "Then, having uttered these stanzas while standing, the Blessed One went to the village of Bālakaloṇakāra. On that occasion the venerable Bhagu was living at the village of Bālakaloṇakāra. When the venerable Bhagu saw the Blessed One coming in the distance, he prepared a seat and set out water for washing the feet. The Blessed One sat down on the seat made ready and washed his feet. The venerable Bhagu paid homage to the Blessed One and sat down at one side, and the Blessed One said to him: \"I hope you are keeping well, bhikkhu, I hope you are comfortable, I hope you are not having any trouble getting almsfood.\"",
    "mn128:15": "Now on that occasion the venerable Anuruddha, the venerable Nandiya and the venerable Kimbila were living at the Eastern Bamboo Park.[n.1188] The passage at ¶¶–19 is nearly identical withMN 31.3–10.From the sequel, however, it is clear that the present sutta is set at an earlier time, for in MN 31 all three bhikkhus have reached arahantship while here they are still striving for the goal.The park keeper saw the Blessed One coming in the distance and told him: \"Do not enter this park, recluse. There are three clansmen here seeking their own good. Do not disturb them.\"",
    "mn128:16": "Then all three went to meet the Blessed One. One took his bowl and outer robe, one prepared a seat, and one set out water for washing the feet. The Blessed One sat down on the seat made ready and washed his feet. Then those three venerable ones paid homage to the Blessed One and sat down at one side, and the Blessed One said to them: \"I hope you are all keeping well, Anuruddha, I hope you are comfortable, I hope you are not having any trouble getting almsfood.\"",
    "mn128:17": "The venerable Nandiya and the venerable Kimbila each spoke likewise, adding: \"That is how, venerable sir, we are living in concord, with mutual appreciation, without disputing, blending like milk and water, viewing each other with kindly eyes.\"",
    "mn128:18": "\"Good, good, Anuruddha. I hope that you all abide diligent, ardent, and resolute.\"",
    "mn128:19": "\"Good, good, Anuruddha. But while you abide thus diligent, ardent, and resolute, have you attained any superhuman states, a distinction in knowledge and vision worthy of the noble ones, a comfortable abiding?\"",
    "mn128:20": "\"You should discover the cause for that,[n.1190]Nimittaṁ paṭivijjhitabbāṁLit. \"You should penetrate that sign.\"Anuruddha. Before my enlightenment, while I was still only an unenlightened Bodhisatta, I too perceived both light and a vision of forms. Soon afterwards the light and the vision of forms disappeared. I thought: ‘What is the cause and condition why the light and the vision of forms have disappeared?’ Then I considered thus: ‘Doubt arose in me, and because of the doubt my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared. I shall so act that doubt will not arise in me again.’",
    "mn128:21": "\"As, Anuruddha, I was abiding diligent, ardent, and resolute, I perceived both light and a vision of forms. Soon afterward the light and the vision of forms disappeared. I thought: ‘What is the cause and condition why the light and the vision of forms have disappeared?’ Then I considered thus: ‘Inattention arose in me, and because of inattention my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared. I shall so act that neither doubt nor inattention will arise in me again.’",
    "mn128:22": "\"As, Anuruddha, I was abiding diligent … I considered thus: ‘Sloth and torpor arose in me, and because of sloth and torpor my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared. I shall so act that neither doubt nor inattention nor sloth and torpor will arise in me again.’",
    "mn128:23": "\"As, Anuruddha, I was abiding diligent … I considered thus: ‘Fear arose in me, and because of fear my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared.’ Suppose a man set out on a journey and murderers leaped out on both sides of him; then fear would arise in him because of that. So too, fear arose in me … the light and the vision of forms disappeared.I considered thus:‘I shall so act that neither doubt nor inattention nor sloth and torpor nor fear will arise in me again.’",
    "mn128:24": "\"As, Anuruddha, I was abiding diligent … I considered thus: ‘Elation arose in me, and because of elation my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared.’ Suppose a man seeking one entrance to a hidden treasure came all at once upon five entrances to a hidden treasure;[n.1191] SeeMN 52.15.then elation would arise in him because of that. So too, elation arose in me … the light and the vision of forms disappeared.I considered thus:‘I shall so act that neither doubt nor inattention … nor fear nor elation will arise in me again.’",
    "mn128:25": "\"As, Anuruddha, I was abiding diligent … I considered thus: ‘Inertia arose in me, and because of inertia my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared. I shall so act that neither doubt nor inattention … nor elation nor inertia will arise in me again.’",
    "mn128:26": "\"As, Anuruddha, I was abiding diligent … I considered thus: ‘Excess of energy arose in me, and because of excess of energy my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared.’ Suppose a man were to grip a quail tightly with both hands; it would die then and there. So too, an excess of energy arose in me … the light and the vision of forms disappeared.I considered thus:‘I shall so act that neither doubt nor inattention … nor inertia nor excess of energy will arise in me again.’",
    "mn128:27": "\"As, Anuruddha, I was abiding diligent … I considered thus: ‘Deficiency of energy arose in me, and because of deficiency of energy my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared. ’ Suppose a man were to grip a quail loosely; it would fly out of his hands. So too, a deficiency of energy arose in me … the light and the vision of forms disappeared.I considered thus:‘I shall so act that neither doubt nor inattention … nor excess of energy nor deficiency of energy will arise in me again.’",
    "mn128:28": "\"As, Anuruddha, I was abiding diligent … I considered thus: ‘Longing arose in me, and because of that longing my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared. I shall so act that neither doubt nor inattention … nor deficiency of energy nor longing will arise in me again.’",
    "mn128:29": "\"As, Anuruddha, I was abiding diligent … I considered thus: ‘Perception of diversity arose in me,[n.1192]MAparaphrases: \"While I was attending to a single type of form, longing arose. Thinking ‘I will attend to different kinds of forms,’ sometimes I directed my attention towards the heavenly world, sometimes towards the human world. As I attended to different kinds of forms, perception of diversity arose in me.\"and because of perception of diversity my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared. I shall so act that neither doubt nor inattention … nor longing nor perception of diversity will arise in me again.’",
    "mn128:30": "\"As, Anuruddha, I was abiding diligent … I considered thus: ‘Excessive meditation upon forms arose in me,[n.1193]Atinijjhāyitattaṁ rūpānaṁ.MA: \"When perception of diversity arose, I thought I would attend to one type of form, whether agreeable or disagreeable. As I did so, excessive meditation upon forms arose in me.\"and because of excessive meditation upon forms my concentration fell away; when my concentration fell away, the light and the vision of forms disappeared. I shall so act that neither doubt nor inattention … nor perception of diversity nor excessive meditation upon forms will arise in me again.’",
    "mn128:31": "\"When, Anuruddha, I understood that doubt is an imperfection of the mind,[n.1194]Cittassa upakkileso.The same term is used atMN 7.3, though here it means imperfections in the development of concentration. Hence the expression has been rendered slightly differently in the two cases.I abandoned doubt, an imperfection of the mind. When I understood that inattention … sloth and torpor … fear … elation … inertia … excess of energy … deficiency of energy … longing … perception of diversity … excessive meditation upon forms is an imperfection of the mind, I abandoned excessive meditation upon forms, an imperfection of the mind.",
    "mn128:32": "\"As, Anuruddha, I was abiding diligent, ardent, and resolute, I perceived light but I did not see forms; I saw forms but I did not perceive light, even for a whole night or a whole day or a whole day and night. I thought: ‘What is the cause and condition for this?’ Then I considered thus: ‘On the occasion when I do not attend to the sign of forms but attend to the sign of light, I then perceive light but do not see forms. On the occasion when I do not attend to the sign of light but attend to the sign of forms, I then see forms but do not perceive light, even for a whole night or a whole day or a whole day and night.’",
    "mn128:33": "\"As, Anuruddha, I was abiding diligent, ardent, and resolute, I perceived limited light and saw limited forms; I perceived immeasurable light and saw immeasurable forms, even for a whole night or a whole day or a whole day and night. I thought: ‘What is the cause and condition for this?’ Then I considered thus: ‘On the occasion when concentration is limited, my vision is limited, and with limited vision I perceive limited light and limited forms. But on the occasion when concentration is immeasurable, my vision is immeasurable, and with immeasurable vision I perceive immeasurable light and see immeasurable forms, even for a whole night or a whole day or a whole day and night.’",
    "mn128:34": "\"When, Anuruddha, I understood that doubt is an imperfection of the mind and had abandoned doubt, an imperfection of the mind; when I understood that inattention is an imperfection of the mind and had abandoned inattention … abandoned sloth and torpor … abandoned fear … abandoned elation … abandoned inertia … abandoned excess of energy … abandoned deficiency of energy … abandoned longing … abandoned perception of diversity … abandoned excessive meditation upon forms, an imperfection of the mind; then I thought: ‘I have abandoned those imperfections of the mind. Let me now develop concentration in three ways.’[n.1195] The \"three ways\" seem to be the first three types of concentration mentioned in the next paragraph, also spoken of as a triad atDN 33.1.10/iii.219. Of these, the first is the first jhāna and the third covers the three higher jhānas of the usual fourfold scheme. The second type of concentration has no place in the fourfold scheme, but appears as the second jhāna in a fivefold division of jhānas expounded in the Abhidhamma Piṭaka. This second jhāna of the fivefold scheme is attained by those who cannot overcome applied thought and sustained thought simultaneously but must eliminate them successively.",
    "mn128:35": "\"Thereupon, Anuruddha, I developed concentration with applied thought and sustained thought; I developed concentration without applied thought but with sustained thought only; I developed concentration without applied thought and without sustained thought; I developed concentration with rapture; I developed concentration without rapture; I developed concentration accompanied by enjoyment; I developed concentration accompanied by equanimity.[n.1196]MA: The concentration with rapture is the two lower jhānas; without rapture, the two higher jhānas; accompanied by enjoyment(sāta), the three lower jhānas; accompanied by equanimity, the fourth jhāna. PTS omitssātasahagato pi samādhi bhāvito ahosi,found in the other eds.",
    "mn128:36": "That is what the Blessed One said. The venerable Anuruddha was satisfied and delighted in the Blessed One's words."
}