{
    "mn124:1": "Thus have I heard. On one occasion the venerable Bakkula was living at Rājagaha in the Bamboo Grove, the Squirrels’ Sanctuary.[n.67] According toMA, Ven. Bakkula became a monk in his eightieth year, which would make him 60 at the time this sutta takes place. He was declared by the Buddha to be the foremost disciple with respect to good health.",
    "mn124:2": "\"Friend Bakkula, how long is it since you went forth?\"",
    "mn124:3": "That in the eighty years since he went forth the venerable Bakkula did not recall any perception of sensual desire to have ever arisen in him — this we remember as a wonderful and marvellous quality of the venerable Bakkula.[n.1168]MAsays that the passages here enclosed in brackets were added by the elders who compiled the Dhamma.",
    "mn124:4": "\"Friend, in the eighty years since I went forth I do not recall any perception of ill will … any perception of cruelty to have ever arisen in me.\"",
    "mn124:5": "\"Friend, in the eighty years since I went forth I do not recall any thought of sensual desire to have ever arisen in me.\"",
    "mn124:6": "\"Friend, in the eighty years since I went forth I do not recall any thought of ill will … any thought of cruelty to have ever arisen in me.\"",
    "mn124:7": "\"Friend, in the eighty years since I went forth I do not recall ever having accepted a robe from a householder[n.1169] This passage and those to follow show Ven. Bakkula as an observer of the ascetic practices. Thekaṭhinatime is the period following the three-month rains residence when bhikkhus make new robes from the cloth they have received.… ever having worn a robe given by a householder.",
    "mn124:8": "\"Friend, in the eighty years since I went forth I do not recall ever having … ever having cut a robe with a cutter …",
    "mn124:9": "\"Friend, in the eighty years since I went forth I do not recall ever having sewn a robe with a needle … ever having coloured a robe with dye … ever having sewn a robe at the kaṭhina time … ever having worked on making robes for my companions in the holy life … ever having accepted an invitation to a meal … ever having given rise to the thought: ‘Oh, may someone invite me to a meal!’ … ever having sat down inside a house … ever having eaten inside a house … ever having grasped at the signs and features of a woman … ever having taught the Dhamma to a woman, even as much as a four-line stanza … ever having gone to the bhikkhunīs’ quarters … ever having taught the Dhamma to a bhikkhunī … ever having taught the Dhamma to a female probationer … ever having taught the Dhamma to a female novice … ever having given the going forth … ever having given the full admission … ever having given dependence … ever having had a novice wait on me … ever having bathed in a bath house … ever having bathed with bath powder … ever having undertaking the work of massaging the limbs of my companions in the holy life … ever having had an affliction arise in me even for as long as it takes to milk a cow … ever having carried medicine around, even as much as a piece of gallnut … ever having used a bolster … ever having made up a bed.",
    "mn124:10": "\"Friend, in the eighty years since I went forth I do not recall ever having entered upon residence for the Rains in a resting place inside a village.\"",
    "mn124:11": "\"Friend, for seven days after going forth I ate the country's almsfood as a debtor; on the eighth day final knowledge arose.\"[n.70]MAsays that after he went forth, he was an ordinary man for seven days, but on the eighth day he attained arahantship together with the analytical knowledges(paṭisambhidā).",
    "mn124:12": "Then Acela Kassapa said:\"I would receive the going forth in this Dhamma and Discipline, I would receive the full admission.\" And Acela Kassapa received the going forth in this Dhamma and Discipline, he received the full admission.[n.1171]MA: Ven. Bakkula himself did not give the ordination (which would have been a violation of his mode of practice) but arranged for other bhikkhus to give it.And soon, not long after his full admission, dwelling alone, withdrawn, diligent, ardent, and resolute, the venerable Kassapa, by realising for himself with direct knowledge, here and now entered upon and abided in that supreme goal of the holy life for the sake of which clansmen rightly go forth from the home life into homelessness. He knew directly: \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.\" And the venerable Kassapa became one of the arahants.",
    "mn124:13": "Then, on a later occasion, the venerable Bakkula took a key and went from dwelling to dwelling, saying: \"Come forth, venerable sirs; come forth, venerable sirs. Today I shall attain final Nibbāna.\"",
    "mn124:14": "Then, seated in the midst of the Saṅgha of bhikkhus, the venerable Bakkula attained final Nibbāna.[n.1172]MA: Ven. Bakkula had considered that all his life he had never made himself a burden to the other bhikkhus, and he did not want his body to be a burden after his death. Thus he entered into meditation on the heat element and attained final Nibbāna by causing his entire body to be consumed by the blaze. Only the relics remained."
}