{
    "mn120:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn120:2": "\"Here, bhikkhus, a bhikkhu possesses faith, virtue, learning, generosity, and wisdom. He thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of well-to-do nobles!’ He fixes his mind on that, resolves upon it, develops it. These aspirations and this abiding of his, thus developed and cultivated, lead to his reappearance there. This, bhikkhus, is the path, the way that leads to reappearance there.[n.1133]MA: \"The way\" is the five qualities beginning with faith, together with the aspiration. One who has either the five qualities without the aspiration, or the aspiration without the qualities, does not have a fixed destination. The destination can only be fixed when both factors are present.",
    "mn120:3": "\"Again, a bhikkhu possesses faith … and wisdom. He thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of well-to-do brahmins! … in the company of well-to-do householders!’ He fixes his mind on that … This, bhikkhus, is the path, the way that leads to reappearance there.",
    "mn120:4": "\"Again, a bhikkhu possesses faith … and wisdom. He hears that the gods of the heaven of the Four Great Kings are long-lived, beautiful, and enjoy great happiness. He thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of the gods of the heaven of the Four Great Kings!’ He fixes his mind on that … This, bhikkhus, is the path, the way that leads to reappearance there.",
    "mn120:5": "\"Again, a bhikkhu possesses faith … and wisdom. He hears that the gods of the heaven of the Thirty-three … the Yāma gods … the gods of the Tusita heaven … the gods who delight in creating … the gods who wield power over others’ creations are long-lived, beautiful, and enjoy great happiness. He thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of the gods who wield power over others’ creations! ’ He fixes his mind on that … This, bhikkhus, is the path, the way that leads to reappearance there.",
    "mn120:6": "\"Again, a bhikkhu possesses faith … and wisdom. He hears that the Brahmā of a Thousand is long-lived, beautiful, and enjoys great happiness. Now the Brahmā of a Thousand abides resolved on pervading a world-system of a thousand worlds, and he abides resolved on pervading the beings that have reappeared there.[n.1134]MAexplains that there are five kinds of pervasion: pervasion of mind, i.e., knowing the thoughts of the beings throughout a thousand worlds; pervasion of the kasiṇa, i.e., extending the kasiṇa image to a thousand worlds; pervasion of the divine eye, i.e., seeing a thousand worlds with the divine eye; pervasion of light, which is the same as the previous pervasion; and pervasion of body, i.e., extending one's bodily aura to a thousand worlds.Just as a man with good sight might take a gall-nut in his hand and review it, so the Brahmā of a Thousand abides resolved on pervading a world-system of a thousandworlds, and he abides resolved on pervading the beings that have reappeared there. The bhikkhu thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of the Brahmā of a Thousand!’ He fixes his mind on that … This, bhikkhus, is the path, the way that leads to reappearance there.",
    "mn120:7": "\"Again, a bhikkhu possesses faith … and wisdom. He hears that the Brahmā of Two Thousand … the Brahmā of Three Thousand … the Brahmā of Four Thousand … the Brahmā of Five Thousand is long-lived, beautiful, and enjoys great happiness. Now the Brahmā of Five Thousand abides resolved on pervading a world-system of five thousand worlds, and he abides resolved on pervading the beings that have reappeared there. Just as a man with good sight might take five gallnuts in his hand and review them, so the Brahmā of Five Thousand abides resolved on pervading a world-system of five thousand worlds, and he abides resolved on pervading the beings that have reappeared there. The bhikkhu thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of the Brahmā of Five Thousand!’ He fixes his mind on that … This, bhikkhus, is the path, the way that leads to reappearance there.",
    "mn120:8": "\"Again, a bhikkhu possesses faith … and wisdom. He hears that the Brahmā of Ten Thousand is long-lived, beautiful, and enjoys great happiness. Now the Brahmā of Ten Thousand abides resolved on pervading a world-system of ten thousand worlds, and he abides resolved on pervading the beings that have reappeared there. Just as a fine beryl gem of purest water, eight-faceted, well cut, lying on red brocade, glows, radiates, and shines, so the Brahmā of Ten Thousand abides resolved on pervading a world-system of ten thousand worlds, and he abides resolved on pervading the beings that have reappeared there. The bhikkhu thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of the Brahmā of Ten Thousand!’ He fixes his mind on that … This, bhikkhus, is the path, the way that leads to reappearance there.",
    "mn120:9": "\"Again, a bhikkhu possesses faith … and wisdom. He hears that the Brahmā of a Hundred Thousand is long-lived, beautiful, and enjoys great happiness. Now the Brahmā of a Hundred Thousand abides resolved on pervading a world-system of a hundred thousand worlds, and he abides resolved on pervading the beings that have reappeared there. Just as an ornament of finest gold, very skilfully wrought in the furnace by a clever goldsmith, lying on red brocade, glows, radiates, and shines, so the Brahmā of a Hundred Thousand abides resolved on pervading a world-system of a hundred thousand worlds, and he abides resolved on pervading the beings that have reappeared there. The bhikkhu thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of the Brahmā of a Hundred Thousand!’ He fixes his mind on that … This, bhikkhus, is the path, the way that leads to reappearance there.",
    "mn120:10–14": "\"Again, a bhikkhu possesses faith … and wisdom. He hears that the gods of Radiance[n.1135]MAexplains that “the gods of Radiance” is not a separate class of gods but a collective name for the three classes that follow; the same applies to “the gods of Glory.” This celestial hierarchy is explained inMLDB,Introduction, pp. 46–48.… the gods of Limited Radiance … the gods of Immeasurable Radiance … the gods of Streaming Radiance … the gods of Glory … the gods of Limited Glory … the gods of Immeasurable Glory … the gods of Refulgent Glory … … the gods of Great Fruit … the Aviha gods … the Atappa gods … the Sudassa gods … the Sudassī gods … the Akaniṭṭha gods are long-lived, beautiful, and enjoy great happiness. He thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of the Akaniṭṭha gods!’ He fixes his mind on that … This, bhikkhus, is the path, the way that leads to reappearance there.",
    "mn120:15": "\"Again, a bhikkhu possesses faith … and wisdom. He hears that the gods of the base of infinite space … the gods of the base of infinite consciousness … the gods of the base of nothingness … the gods of the base of neither-perception-nor-non-perception are long-lived, long-enduring, and enjoy great happiness. He thinks: ‘Oh, that on the dissolution of the body, after death, I might reappear in the company of the gods of the base of neither-perception-nor-non-perception!’ He fixes his mind on that, resolves on it, develops it. These aspirations and this abiding of his, thus developed and cultivated, lead to his reappearance there. This, bhikkhus, is the path, the way that leads to reappearance there.",
    "mn120:16": "\"Again, a bhikkhu possesses faith, virtue, learning, generosity, and wisdom. He thinks: ‘Oh, that by realising for myself with direct knowledge, I might here and now enter upon and abide in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints!’ And by realising for himself with direct knowledge, he here and now enters upon and abides in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints. Bhikkhus, this bhikkhu does not reappear anywhere at all.\"[n.1136]MA: The five qualities mentioned are sufficient for rebirth into the sense-sphere realm, but for the higher modes of rebirth and the destruction of the taints, more is required. Basing oneself on the five qualities, if one attains the jhānas, one is reborn in the Brahma-world; if one attains the immaterial attainments, one is reborn in the immaterial world; if one develops insight and attains the fruit of non-returning, one is reborn in the Pure Abodes; and if one reaches the path of arahantship, one attains the destruction of the taints.",
    "mn120:17": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}