{
    "mn131:1": "Thus have I heard.[n.209] This discourse with a lengthy introduction and notes is available separately in a translation by Bhikkhu Ñāṇananda under the titleIdeal Solitude.On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: “Bhikkhus.” — “Venerable sir,” they replied. The Blessed One said this:",
    "mn131:2": "“Let not a person revive the pastOr on the future build his hopes;[n.111] More literally the first two lines would be translated: “Let not a person run back to the past or live in expectation of the future.” The meaning will be elucidated in the expository passage of the sutta.For the past has been left behindAnd the future has not been reached.",
    "mn131:3": "“Instead with insight let him seeEach presently arisen state;[n.1212]MA: He should contemplate each presently arisen state, just where it has arisen, by way of the seven contemplations of insight (insight into impermanence, suffering, non-self, disenchantment, dispassion, cessation, relinquishment).Let him know that and be sure of it,Invincibly, unshakeably.[n.121]Asaṁhīraṁ asaṅkuppaṁ.MAexplains that this is said for the purpose of showing insight and counter-insight (seen.114); for insight is “invincible, unshakeable” because it is not vanquished or shaken by lust and other defilements. Elsewhere the expression “the invincible, the unshakeable” is used as a description of Nibbāna (e.g.,Sn v.1149) or of the liberated mind (e.g.,Thag v.649), but here it seems to refer to a stage in the development of insight. The recurrence of the verb formsaṁhīratiin ¶¶10–11 suggests that the intended meaning is contemplation of the present moment without being misled into the adoption of a view of self.Today the effort must be made;",
    "mn131:4": "“Tomorrow Death may come, who knows?No bargain with MortalityCan keep him and his hordes away,",
    "mn131:5": "“But one who dwells thus ardently,Relentlessly, by day, by night —It is he, the Peaceful Sage has said,[n.1214] The “Peaceful Sage”(santo muni)is the Buddha.Who has had a single excellent night.",
    "mn131:6": "“How, bhikkhus, does one revive the past? One nurtures delight there thinking, ‘I had such material form in the past.’[n.1215]MA: One \"finds delight\" by bringing to bear upon the past either craving or a view associated with craving. It should be noted that it is not the mere recollection of the past through memory that causes bondage, but the reliving of past experiences with thoughts of craving. In this respect the Buddha’s teaching differs significantly from that of Krishnamurti, who seems to regard memory itself as the villain behind the scene.One nurtures delight there thinking, ‘I had such feeling in the past,’ … ‘I had such perception in the past,’ … ‘I had such formations in the past,’ … ‘I had such consciousness in the past.’ That is how one revives the past.",
    "mn131:7": "“And how, bhikkhus, does one not revive the past? One does not nurture delight there thinking, ‘I had such material form in the past.’[n.1216] The syntax of the Pali allows this sentence to be inter-preted in two ways, as stating either that one thinks: “I had such form in the past,” yet does not find delight in that thought; or that one does not find delight in the past by thinking such a thought. Horner, Ñāṇananda (inIdeal Solitude), and Ñm (in Ms) construe the sentence in the former way; I had preserved Ñm's rendering in the first edition. On reconsideration, I now believe that the second interpretation is more true to the intention of the text. This also ties in better with the stanzas themselves, which enjoin the disciple not to dwell in the past and the future but to contemplate “each presently arisen state” just as it presents itself.One does not nurture delight there thinking, ‘I had such feeling in the past,’ … ‘I had such perception in the past,’ … ‘I had such formations in the past,’ … ‘I had such consciousness in the past.’ That is how one does not revive the past.",
    "mn131:8": "“And how, bhikkhus, does one build up hope upon the future? One nurtures delight there thinking, ‘May I have such material form in the future!’[n.1217] In the first edition, this sentence was rendered: “Thinking, ‘I may have such material form in the future,’ one finds delight in that.” In retrospect, it now seems to me more likely that the sentence expresses an exclamatory wish for the future.One nurtures delight there thinking, ‘May I have such feeling in the future!’ … ‘May I have such perception in the future!’ … ‘May I have such formations in the future!’ … ‘May I have such consciousness in the future!’ That is how one builds up hope upon the future.",
    "mn131:9": "“And how, bhikkhus, does one not build up hope upon the future? One does not nurture delight there thinking, ‘May I have such material form in the future!’ One does not nurture delight there thinking, ‘May I have such feeling in the future!’ … ‘May I have such perception in the future!’ … ‘May I have such formations in the future!’ … ‘May I have such consciousness in the future!’ That is how one does not build up hope upon the future.",
    "mn131:10": "“And how, bhikkhus, is one vanquished in regard to presently arisen states?[n.1218] The verb here and in the next paragraph,saṁhīrati, refers back to the line in the verse: “invincibly, unshakeably.”MAglosses: “One is dragged along by craving and views because of the lack of insight.”Here, bhikkhus, an untaught ordinary person, who has no regard for noble ones and is unskilled and undisciplined in their Dhamma, who has no regard for true men and is unskilled and undisciplined in their Dhamma, regards material form as self, or self as possessed of material form, or material form as in self, or self as in material form. He regards feeling as self … perception as self … formations as self … consciousness as self, or self as possessed of consciousness, or consciousness as in self, or self as in consciousness. That is how one is vanquished in regard to presently arisen states.",
    "mn131:11": "“And how, bhikkhus, is one invincible in regard to presently arisen states? Here, bhikkhus, a well-taught noble disciple, who has regard for noble ones and is skilled and disciplined in their Dhamma, who has regard for true men and is skilled and disciplined in their Dhamma, does not regard material form as self, or self as possessed of material form, or material form as in self, or self as in material form. He does not regard feeling as self … perception as self … formations as self … consciousness as self, or self as possessed of consciousness, or consciousness as in self, or self as in consciousness. That is how one is invincible in regard to presently arisen states.",
    "mn131:12": "“Let not a person revive the pastOr on the future build his hopes;For the past has been left behindAnd the future has not been reached.",
    "mn131:13": "“Instead with insight let him seeEach presently arisen state;Let him know that and be sure of it,Invincibly, unshakeably.Today the effort must be made;",
    "mn131:14": "“Tomorrow Death may come, who knows?No bargain with MortalityCan keep him and his hordes away,",
    "mn131:15": "“But one who dwells thus ardently,Relentlessly, by day, by nightIt is he, the Peaceful Sage has said,Who has had a single excellent night.",
    "mn131:16": "“So it was with reference to this that it was said: ‘Bhikkhus, I shall teach you the summary and exposition of “One Who Has Had a Single Excellent Night.’”",
    "mn131:17": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}