{
    "mn137:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn137:2": "\"The six internal bases should be understood. The six external bases should be understood. The six classes of consciousness should be understood. The six classes of contact should be understood. The eighteen kinds of mental exploration should be understood. The thirty-six positions of beings should be understood. Therein, by depending on this, abandon that. There are three foundations of mindfulness that the Noble One cultivates, cultivating which the Noble One is a teacher fit to instruct a group. Among the teachers of training it is he that is called the incomparable leader of persons to be tamed. This is the summary of the exposition of the sixfold base.",
    "mn137:3": "\"‘The six internal bases should be understood.’ So it was said. And with reference to what was this said? There are the eye-base, the ear-base, the nose-base, the tongue-base, the body-base, and the mind-base. So it was with reference to this that it was said: ‘The six internal bases should be understood.’",
    "mn137:4": "\"‘The six external bases should be understood.’ So it was said. And with reference to what was this said? There are the form-base, the sound-base, the odour-base, the flavour-base, the tangible-base, and the mind-object-base. So it was with reference to this that it was said: ‘The six external bases should be understood. ’",
    "mn137:5": "\"‘The six classes of consciousness should be understood.’ So it was said. And with reference to what was this said? There are eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, and mind-consciousness. So it was with reference to this that it was said: ‘The six classes of consciousness should be understood.’",
    "mn137:6": "\"‘The six classes of contact should be understood.’ So it was said. And with reference to what was this said? There are eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, and mind-contact. So it was with reference to this that it was said: ‘The six classes of contact should be understood.’",
    "mn137:7": "\"‘The eighteen kinds of mental exploration should be understood. ’[n.1235]MA: Mental exploration(manopavicāra)is applied thought and sustained thought. One explores(or examines,upavicarati)the object by the occurrence of sustained thought(vicāra), and applied thought is associated with the latter.So it was said. And with reference to what was this said?",
    "mn137:8": "\"‘The thirty-six positions of beings should be understood. ’[n.1237]MA: These are positions(pada)for beings who are intent on the round of existence and for those intent on the cessation of the round.So it was said. And with reference to what was this said? There are six kinds of joy based on the household life and six kinds of joy based on renunciation.[n.123]MA: \"Based on the household life\" means connected with the cords of sensual pleasure; \"based on renunciation\" means connected with insight.There are six kinds of grief based on the household life and six kinds of grief based on renunciation. There are six kinds of equanimity based on the household life and six kinds of equanimity based on renunciation.",
    "mn137:9": "\"Herein, what are the six kinds of joy based on renunciation? When, by knowing the impermanence, change, fading away, and cessation of forms, one sees as it actually is with proper wisdom that forms both formerly and now are all impermanent, suffering, and subject to change, joy arises. Such joy as this is called joy based on renunciation.[n.123]MA: This is the joy that arises when one has set up insight and is sitting watching the breakup of formations with a current of sharp and bright insight knowledge focused on formations.",
    "mn137:10": "\"Herein, what are the six kinds of grief based on the household life? When one regards as a non-gain the non-gain of forms cognizable by the eye that are wished for, desired, agreeable, gratifying, and associated with worldliness — or when one recalls what was formerly not obtained that has passed, ceased, and changed — grief arises. Such grief as this is called grief based on the household life.",
    "mn137:11": "\"Herein, what are the six kinds of grief based on renunciation? When, by knowing the impermanence, change, fading away, and cessation of forms, one sees as it actually is with proper wisdom that forms both formerly and now are all impermanent, suffering, and subject to change, one generates a longing for the supreme liberations thus: ‘When shall I enter upon and abide in that base that the noble ones now enter upon and abide in?’[n.1240]MAexplains \"the supreme liberations\" and \"that base\" as arahantship. SeeMN 44.28.In one who generates thus a longing for the supreme liberations, grief arises with that longing as condition. Such grief as this is called grief based on renunciation.",
    "mn137:12": "\"Herein, what are the six kinds of equanimity based on the household life? On seeing a form with the eye, equanimity arises in a foolish infatuated ordinary person, in an untaught ordinary person who has not conquered his limitations or conquered the resultsof actionand who is blind to danger. Such equanimity as this does not transcend the form; that is why it is called equanimity based on the household life.[n.41]MA: This is the equanimity of unknowing that arises in one who has not conquered the limitations imposed by the defilements or the future results (of action). It \"does not transcend the form\" because it is stuck, fastened to the object like flies to a ball of sugar.",
    "mn137:13": "\"Herein, what are the six kinds of equanimity based on renunciation? When, by knowing the impermanence, change, fading away, and cessation of forms, one sees as it actually is with proper wisdom that forms both formerly and now are all impermanent, suffering, and subject to change, equanimity arises. Such equanimity as this transcends the form; that is why it is called equanimity based on renunciation.[n.1242]MA: This is the equanimity associated with insight knowledge. It does not become lustful towards desirable objects that come into raṅge of the senses, nor does it become angry because of undesirable objects.",
    "mn137:14": "\"‘Therein, by depending on this, abandon that.’ So it was said. And with reference to what was this said?",
    "mn137:15": "By depending and relying on the six kinds of grief based on renunciation, abandon and surmount the six kinds of grief based on the household life. It is thus they are abandoned; it is thus they are surmounted.",
    "mn137:16": "By depending and relying on the six kinds of equanimity based on renunciation, abandon and surmount the six kinds of equanimity based on the household life. It is thus they are abandoned; it is thus they are surmounted.",
    "mn137:17": "\"By depending and relying on the six kinds of joy based on renunciation, abandon and surmount the six kinds of grief based on renunciation. It is thus they are abandoned; it is thus they are surmounted.",
    "mn137:18": "By depending and relying on the six kinds of equanimity based on renunciation, abandon and surmount the six kinds of joy based on renunciation. It is thus they are abandoned; it is thus they are surmounted.",
    "mn137:19": "\"There is, bhikkhus, equanimity that is diversified, based on diversity; and there is equanimity that is unified, based on unity.[n.1243]MAsays that previously worldly equanimity was discussed, but here the contrast is between the equanimity in differentiated sense experience and the equanimity of the meditative attainments.",
    "mn137:20": "\"Here, bhikkhus, by depending and relying on equanimity that is unified, based on unity, abandon and surmount equanimity that is diversified, based on diversity. It is thus this is abandoned; it is thus this is surmounted.[n.1244]MAparaphrases: \"By the equanimity of the immaterial attainments, abandon the equanimity of the fine-material attainments; by insight into the immaterial sphere, abandon insight into the fine-material sphere.\"",
    "mn137:21": "\"Bhikkhus, by depending and relying on non-identification,[n.1245]MAsays that non-identification (atammayatā— seen.1066) here refers to \"insight leading to emergence,\" i.e., the insight immediately preceding the arising of the supramundane path; for this effects the abandonment of the equanimity of the immaterial attainments and the equanimity of insight.abandon and surmount equanimity that is unified, based on unity. It is thus this is abandoned; it is thus this is surmounted.",
    "mn137:22": "\"‘There are three foundations of mindfulness that the Noble One cultivates, cultivating which the Noble One is a teacher fit to instruct a group.’[n.1246]Satipaṭṭhānahere obviously has a different meaning than usual, as the sequel will make clear. The \"Noble One\" is the Buddha.So it was said. And with reference to what was this said?",
    "mn137:23": "\"Furthermore, bhikkhus, compassionate and seeking their welfare, the Teacher teaches the Dhamma to the disciples out of compassion: ‘This is for your welfare; this is for your happiness.’ Some of his disciples will not hear or give ear or exert their minds to understand; they err and turn aside from the Teacher's Dispensation. Some of his disciples will hear and give ear and exert their minds to understand; they do not err and turn aside from the Teacher's Dispensation. With that the Tathāgata is not satisfied and feels no satisfaction, and he is not dissatisfied and feels no dissatisfaction; remaining free from both satisfaction and dissatisfaction, he dwells in equanimity, mindful, and fully aware. This, bhikkhus, is called the second foundation of mindfulness that the Noble One cultivates, cultivating which the Noble One is a teacher fit to instruct a group.",
    "mn137:24": "\"Furthermore, bhikkhus, compassionate and seeking their welfare, the Teacher teaches the Dhamma to the disciples out of compassion: ‘This is for your welfare; this is for your happiness.’ His disciples will hear and give ear and exert their minds to understand; they do not err and turn aside from the Teacher's Dispensation. With that the Tathāgata is satisfied and feels satisfaction; yet he dwells unmoved, mindful, and fully aware. This, bhikkhus, is called the third foundation of mindfulness that the Noble One cultivates, cultivating which the Noble One is a teacher fit to instruct a group.",
    "mn137:25": "\"‘Among the teachers of training it is he that is called the incomparable leader of persons to be tamed.’[n.1247] This is one of the nine epithets of the Buddha in the usual enumeration of the Buddha’s qualities.So it was said. And with reference to what was this said?",
    "mn137:26": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}