{
    "mn135:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn135:2": "\"Master Gotama, what is the cause and condition why human beings are seen to be inferior and superior? For people are seen to be short-lived and long-lived, sickly and healthy, ugly and beautiful, uninfluential and influential, poor and wealthy, low-born and high-born, stupid and wise. What is the cause and condition, Master Gotama, why human beings are seen to be inferior and superior?\"",
    "mn135:3": "\"Student, beings are owners of their actions, heirs of their actions; they originate from their actions, are bound to their actions, have their actions as their refuge. It is action that distinguishes beings as inferior and superior.\"",
    "mn135:4": "\"Then, student, listen and attend closely to what I shall say.\"",
    "mn135:5": "\"Here, student, some man or woman kills living beings and is murderous, bloody-handed, given to blows and violence, merciless to living beings. Because of performing and undertaking such action, on the dissolution of the body, after death, he reappears in a state of deprivation, in an unhappy destination, in perdition, even in hell. But if on the dissolution of the body, after death, he does not reappear in a state of deprivation, in an unhappy destination, in perdition, in hell, but instead comes back to the human state, then wherever he is reborn he is short-lived.[n.1224] If the kamma of killing directly determines the mode of rebirth, it will produce rebirth in one of the states of deprivation. But if a wholesome kamma brings about a human rebirth — and rebirth as a human being is always the result of wholesome kamma — the kamma of killing will operate in a manner contrary to that of the rebirth-generative kamma by causing various adversities that may eventuate in a premature death. The same principle holds for the subsequent cases in which unwholesome kamma comes to maturity in a human existence: in each case the unwholesome kamma counteracts the wholesome kamma responsible for the human rebirth by engendering a specific type of misfortune corresponding to its own distinctive quality.This is the way, student, that leads to short life, namely, one kills living beings and is murderous, bloody-handed, given to blows and violence, merciless to living beings.",
    "mn135:6": "\"But here, student, some man or woman, abandoning the killing of living beings, abstains from killing living beings; with rod and weapon laid aside, gentle and kindly, he abides compassionate to all living beings. Because of performing and undertaking such action, on the dissolution of the body, after death, he reappears in a happy destination, even in the heavenly world. But if on the dissolution of the body, after death, he does not reappear in a happy destination, in the heavenly world, but instead comes back to the human state, then wherever he is reborn he is long-lived.[n.1225] In this case the wholesome kamma of abstaining from killing may be directly responsible for either the heavenly rebirth or the longevity in a human existence. The same principle applies in all the passages on the maturation of wholesome kamma.This is the way, student, that leads to long life, namely, abandoning the killing of living beings, one abstains from killing living beings; with rod and weapon laid aside, gentle and kindly, one abides compassionate to all living beings.",
    "mn135:7": "\"Here, student, some man or woman is given to injuring beings with the hand, with a clod, with a stick, or with a knife. Because of performing and undertaking such action, on the dissolution of the body, after death, he reappears in a state of deprivation … But if instead he comes back to the human state, then wherever he is reborn he is sickly. This is the way, student, that leads to sickliness, namely, one is given to injuring beings with the hand, with a clod, with a stick, or with a knife.",
    "mn135:8": "\"But here, student, some man or woman is not given to injuring beings with the hand, with a clod, with a stick, or with a knife. Because of performing and undertaking such action, on the dissolution of the body, after death, he reappears in a happy destination … But if instead he comes back to the human state, then wherever he is reborn he is healthy. This is the way, student, that leads to health, namely, one is not given to injuring beings with the hand, with a clod, with a stick, or with a knife.",
    "mn135:9": "\"Here, student, some man or woman is of an angry and irritable character; even when criticised a little, he is offended, becomes angry, hostile, and resentful, and displays anger, hate, and bitterness. Because of performing and undertaking such action … he reappears in a state of deprivation … But if instead he comes back to the human state, then wherever he is reborn he is ugly. This is the way, student, that leads to ugliness, namely, one is of an angry and irritable character … and displays anger, hate, and bitterness.",
    "mn135:10": "\"But here, student, some man or woman is not of an angry and irritable character; even when criticised a lot, he is not offended, does not become angry, hostile, and resentful, and does not display anger, hate, and bitterness. Because of performing and undertaking such action … he reappears in a happy destination … But if instead he comes back to the human state, then wherever he is reborn he is beautiful. This is the way, student, that leads to being beautiful, namely, one is not of an angry and irritable character … and does not display anger, hate, and bitterness.",
    "mn135:11": "\"Here, student, some man or woman is envious, one who envies, resents, and begrudges the gains, honour, respect, reverence, salutations, and veneration received by others. Because of performing and undertaking such action … he reappears in a state of deprivation … But if instead he comes back to the human state, then wherever he is reborn he is uninfluential. This is the way, student, that leads to being uninfluential, namely, one is envious … towards the gains, honour, respect, reverence, salutations, and veneration received by others.",
    "mn135:12": "\"But here, student, some man or woman is not envious, one who does not envy, resent, and begrudge the gains, honour, respect, reverence, salutations, and veneration received by others. Because of performing and undertaking such action … he reappears in a happy destination … But if instead he comes back to the human state, then wherever he is reborn he is influential. This is the way, student, that leads to being influential, namely, one is not envious … towards the gains, honour, respect, reverence, salutations, and veneration received by others.",
    "mn135:13": "\"Here, student, some man or woman does not give food, drink, clothing, carriages, garlands, scents, unguents, beds, dwelling, and lamps to recluses or brahmins. Because of performing and undertaking such action … he reappears in a state of deprivation … But if instead he comes back to the human state, then wherever he is reborn he is poor. This is the way, student, that leads to poverty, namely, one does not give food … and lamps to recluses or brahmins.",
    "mn135:14": "\"But here, student, some man or woman gives food … and lamps to recluses or brahmins. Because of performing and undertaking such action … he reappears in a happy destination … But if instead he comes back to the human state, then wherever he is reborn he is wealthy. This is the way, student, that leads to wealth, namely, one gives food … and lamps to recluses or brahmins.",
    "mn135:15": "\"Here, student, some man or woman is obstinate and arrogant; he does not pay homage to one who should receive homage, does not rise up for one in whose presence he should rise up, does not offer a seat to one who deserves a seat, does not make way for one for whom he should make way, and does not honour, respect, revere, and venerate one who should be honoured, respected, revered, and venerated. Because of performing and undertaking such action … he reappears in a state of deprivation … But if instead he comes back to the human state, then wherever he is reborn he is low-born. This is the way, student, that leads to low birth, namely, one is obstinate and arrogant … and does not honour, respect, revere, and venerate one who should be honoured, respected, revered, and venerated.",
    "mn135:16": "\"But here, student, some man or woman is not obstinate and arrogant; he pays homage to one who should receive homage, rises up for one in whose presence he should rise up, offers a seat to one who deserves a seat, makes way for one for whom he should make way, and honours, respects, reveres, and venerates one who should be honoured, respected, revered, and venerated. Because of performing and undertaking such action … he reappears in a happy destination … But if instead he comes back to the human state, then wherever he is reborn he is high-born. This is the way, student, that leads to high birth, namely, one is not obstinate and arrogant … andhonours, respects, reveres, and venerates one who should be honoured, respected, revered, and venerated.",
    "mn135:17": "\"Here, student, some man or woman does not visit a recluse or a brahmin and ask: ‘Venerable sir, what is wholesome? What is unwholesome? What is blameable? What is blameless? What should be cultivated? What should not be cultivated? What kind of action will lead to my harm and suffering for a long time? What kind of action will lead to my welfare and happiness for a long time?’ Because of performing and undertaking such action … he reappears in a state of deprivation … But if instead he comes back to the human state, then wherever he is reborn he is stupid. This is the way, student, that leads to stupidity, namely, one does not visit a recluse or brahmin and ask such questions.",
    "mn135:18": "\"But here, student, some man or woman visits a recluse or a brahmin and asks: ‘Venerable sir, what is wholesome? … What kind of action will lead to my welfare and happiness for a long time?’ Because of performing and undertaking such action … he reappears in a happy destination … But if instead he comes back to the human state, then wherever he is reborn he is wise. This is the way, student, that leads to wisdom, namely, one visits a recluse or brahmin and asks such questions.",
    "mn135:19": "\"Thus, student, the way that leads to short life makes people short-lived, the way that leads to long life makes people long-lived; the way that leads to sickliness makes people sickly, the way that leads to health makes people healthy; the way that leads to ugliness makes people ugly, the way that leads to beauty makes people beautiful; the way that leads to being uninfluential makes people uninfluential, the way that leads to being influential makes people influential; the way that leads to poverty makes people poor, the way that leads to wealth makes people wealthy; the way that leads to low birth makes people low-born, the way that leads to high birth makes people high-born; the way that leads to stupidity makes people stupid, the way that leads to wisdom makes people wise.",
    "mn135:20": "When this was said, the brahmin student Subha, Todeyya's son, said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overturned, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. Let Master Gotama remember me as a lay follower who has gone to him for refuge for life.\""
}