{
    "mn134:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the venerable Lomasakangiya was living in the Sakyan country at Kapilavatthu in Nigrodha's Park.[n.22] According to the commentary to Thag, Ven. Lomasakangiya had been a bhikkhu in the time of the Buddha Kassapa. After the Buddha Kassapa had taught the Bhaddekaratta Sutta, a certain bhikkhu spoke about it to Lomasakangiya. Unable to understand it, he exclaimed: \"In the future, may I be able to teach you this sutta!\" The other answered: \"May I ask you about it!\" In the present age Lomasakangiya was born into a Sakyan family at Kapilavatthu, while the other bhikkhu became the god Candana.",
    "mn134:2": "‘Let not a person revive the pastOr on the future build his hopes;For the past has been left behindAnd the future has not been reached.",
    "mn134:3": "Instead with insight let him seeEach presently arisen state;Let him know that and be sure of it,Invincibly, unshakeably.",
    "mn134:4": "Today the effort must be made;Tomorrow Death may come, who knows?No bargain with MortalityCan keep him and his hordes away.",
    "mn134:5": "But one who dwells thus ardently,Relentlessly, by day, by night —It is he, the Peaceful Sage has said,Who has had a single excellent night.’",
    "mn134:6": "\"Bhikkhu, I remember the stanza of ‘One Who Has Had a Single Excellent Night’ thus. Bhikkhu, learn the summary and exposition of ‘One Who Has Had a Single Excellent Night.’ Bhikkhu, master the summary and exposition of ‘One Who Has Had A Single Excellent Night.’ Bhikkhu, remember the summary and exposition of ‘One Who Has Had a Single Excellent Night.’ Bhikkhu, the summary and exposition of ‘One Who Has Had a Single Excellent Night’ is beneficial, it belongs to the fundamentals of the holy life.\"",
    "mn134:7–10": "Then, when the night was over, the venerable Lomasakangiya set his resting place in order, and taking his bowl and outer robe, set out to wander by stages to Sāvatthī. He at length arrived at Sāvatthī, and went to the Blessed One in Jeta's Grove, Anāthapiṇḍika's Park. After paying homage to him, he sat down at one side, told the Blessed One all that had occurred, and said: \"It would be good, venerable sir, if the Blessed One would teach me the summary and exposition of ‘One Who Has Had a Single Excellent Night.’\"",
    "mn134:11": "\"Bhikkhu, do you know that young deity?\"",
    "mn134:12": "\"Let not a person revive the pastOr on the future build his hopes;More literally the first two lines would be translated: \"Let not a person run back to the past or live in expectation of the future.\" The meaning will be elucidated in the expository passage of the sutta.For the past has been left behindAnd the future has not been reached.",
    "mn134:13": "Instead with insight let him seeEach presently arisen state;MA: He should contemplate each presently arisen state, just where it has arisen, by way of the seven contemplations of insight (insight into impermanence, suffering, non-self, disenchantment, dispassion, cessation, relinquishment).Let him know that and be sure of it,Invincibly, unshakeably.Asaṁhīraṁ asaṅkuppaṁ.MA explains that this is said for the purpose of showing insight and counter-insight (seen.1143); for insight is \"invincible, unshakeable\" because it is not vanquished or shaken by lust and other defilements. Elsewhere the expression \"the invincible, the unshakeable\" is used as a description of Nibbāna (e.g., Sn v.1149) or of the liberated mind (e.g., Thag v.649), but here it seems to refer to a stage in the development of insight. The recurrence of the verb form saṁhīrati in verse 8 and verse 9 suggests that the intended meaning is contemplation of the present moment without being misled into the adoption of a view of self.",
    "mn134:14": "Today the effort must be made;Tomorrow Death may come, who knows?No bargain with MortalityCan keep him and his hordes away,",
    "mn134:15": "But one who dwells thus ardently,Relentlessly, by day, by nightIt is he, the Peaceful Sage has said,The \"Peaceful Sage\"(santo muni)is the Buddha.Who has had a single excellent night.",
    "mn134:16": "\"How, bhikkhus, does one revive the past … That is how one revives the past. \"And how, bhikkhus, does one not revive the past … That is how one does not revive the past. \"And how, bhikkhus, does one build up hope upon the future … That is how one builds up hope upon the future. \"And how, bhikkhus, does one not build up hope upon the future … That is how one does not build up hope upon the future.\"And how, bhikkhus, is one vanquished in regard to presently arisen states … That is how one is vanquished in regard to presently arisen states. \"And how, bhikkhus, is one invincible in regard to presently arisen states … That is how one is invincible in regard to presently arisen states.",
    "mn134:17–20": "\"Let not a person revive the past …",
    "mn134:21": "That is what the Blessed One said. The Venerable Lomasakangiya was satisfied and delighted in the Blessed One's words."
}