{
    "mn143:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn143:2": "\"Yes, sir,\" the man replied, and he went to the Blessed One, and after paying homage to the Blessed One, he sat down at one side and delivered his message. Then he went to the venerable Sāriputta, and after paying homage to the venerable Sāriputta, he delivered his message, saying: \"It would be good, venerable sir, if the venerable Sāriputta would come to the residence of the householder Anāthapiṇḍika, out of compassion.\" The venerable Sāriputta consented in silence.",
    "mn143:3": "Then the venerable Sāriputta dressed, and taking his bowl and outer robe, went to the residence of the householder Anāthapiṇḍika with the venerable Ānanda as his attendant. Having gone there, he sat down on a seat made ready and said to the householder Anāthapiṇḍika: \"I hope you are getting well, householder, I hope you are comfortable. I hope your painful feelings are subsiding and not increasing, and that their subsiding, not their increase, is apparent.\"",
    "mn143:4": "\"Venerable Sāriputta, I am not getting well, I am not comfortable. My painful feelings are increasing, not subsiding; their increase and not their subsiding is apparent. Just as if a strong man were splitting my head open with a sharp sword, so too, violent winds cut through my head. I am not getting well … Just as if a strong man were tightening a tough leather strap around my head as a headband, so too, there are violent pains in my head. I am not getting well … Just as if a skilled butcher or his apprentice were to carve up an ox's belly with a sharp butcher's knife, so too, violent winds are carving up my belly. I am not getting well … Just as if two strong men were to seize a weaker man by both arms and roast him over a pit of hot coals, so too, there is a violent burning in my body. I am not getting well, I am not comfortable. My painful feelings are increasing, not subsiding; their increase and not their subsiding is apparent.\"",
    "mn143:5": "\"Then, householder, you should train thus: ‘I will not cling to the eye, and my consciousness will not be dependent on the eye.’[n.130]MAsays that clinging to the eye takes place by way of desire and lust; consciousness is dependent on the eye by way of craving and views. However, since Anāthapiṇḍika was already a stream-enterer, dependence for him would have involved only craving, views having been eradicated by the path of stream-entry.Thus you should train. You should train thus: ‘I will not cling to the ear … I will not cling to the nose … I will not cling to the tongue … I will not cling to the body … I will not cling to the mind, and my consciousness will not be dependent on the mind.’ Thus you should train.",
    "mn143:6": "\"Householder, you should train thus: ‘I will not cling to forms … I will not cling to sounds … I will not cling to odours … I will not cling to flavours … I will not cling to tangibles … I will not cling to mind-objects, and my consciousness will not be dependent on mind-objects.’ Thus you should train.",
    "mn143:7": "\"Householder, you should train thus: ‘I will not cling to eye-consciousness … I will not cling to ear-consciousness … I will not cling to nose-consciousness … I will not cling to tongueconsciousness … I will not cling to body-consciousness … I will not cling to mind-consciousness, and my consciousness will not be dependent on mind-consciousness.’ Thus you should train.",
    "mn143:8": "\"Householder, you should train thus: ‘I will not cling to eye-contact … … I will not cling to ear-contact … I will not cling to nose-contact … I will not cling to tongue-contact … I will not cling to body-contact … I will not cling to mind-contact, and my consciousness will not be dependent on mind-contact.’ Thus you should train.",
    "mn143:9": "\"Householder, you should train thus: ‘I will not cling to feeling born of eye-contact … I will not cling to feeling born of ear-contact … I will not cling to feeling born of nose-contact … I will not cling to feeling born of tongue-contact … I will not cling to feeling born of body-contact … I will not cling to feeling born of mind-contact, and my consciousness will not be dependent on feeling born of mind-contact.’ Thus you should train.",
    "mn143:10": "\"Householder, you should train thus: ‘I will not cling to the earth element … I will not cling to the water element … I will not cling to the fire element … I will not cling to the air element … I will not cling to the space element … I will not cling to the consciousness element, and my consciousness will not be dependent on the consciousness element.’ Thus you should train.",
    "mn143:11": "\"Householder, you should train thus: ‘I will not cling to material form … I will not cling to feeling … I will not cling to perception … I will not cling to formations … I will not cling to consciousness, and my consciousness will not be dependent on consciousness.’ Thus you should train.",
    "mn143:12": "\"Householder, you should train thus: ‘I will not cling to the base of infinite space … I will not cling to the base of infinite consciousness … I will not cling to the base of nothingness … I will not cling to the base of neither-perception-nor-non-perception, and my consciousness will not be dependent on the base of neither-perception-nor-non-perception.’ Thus you should train.",
    "mn143:13": "\"Householder, you should train thus: ‘I will not cling to this world, and my consciousness will not be dependent on this world. I will not cling to the world beyond, and my consciousness will not be dependent on the world beyond.’ Thus you should train.",
    "mn143:14": "When this was said, the householder Anāthapiṇḍika wept and shed tears. Then the venerable Ānanda asked him: \"Are you foundering, householder, are you sinking?\"",
    "mn143:15": "Then, after giving the householder Anāthapiṇḍika this advice, the venerable Sāriputta and the venerable Ānanda rose from their seats and departed. Soon after they had left, the householder Anāthapiṇḍika died and reappeared in the Tusita heaven.",
    "mn143:16": "\"Oh blessed is this Jeta's Grove,Dwelt in by the sagely Saṅgha,Wherein resides the King of Dhamma,The fount of all my happiness.",
    "mn143:17": "By action, knowledge and Dhamma,By virtue and noble way of life —By these are mortals purified,Not by lineage or wealth.",
    "mn143:18": "Therefore a wise person who seesWhat truly leads to his own good,Should investigate the DhammaAnd purify himself with it.",
    "mn143:19": "Sāriputta has reached the peakIn virtue, peace, and wisdom's ways;Any bhikkhu who has gone beyondAt best can only equal him.\"",
    "mn143:20": "That is what the young god Anāthapiṇḍika said, and the Teacher approved. Then the young god Anāthapiṇḍika, thinking: \"The Teacher has approved of me,\" paid homage to the Blessed One, and keeping him on his right, he vanished at once.",
    "mn143:21": "When the night had ended, the Blessed One addressed the bhikkhus thus: \"Bhikkhus, last night when the night was well advanced, there came to me a certain young god of beautiful appearance who illuminated the whole of Jeta's Grove. After paying homage to me, he stood at one side and addressed me in stanzas thus:",
    "mn143:22": "‘Oh blessed is this Jeta's Grove …Dwelt in by the sagely Saṅgha,At best can only equal him.’Wherein resides the King of Dhamma,The fount of all my happiness.",
    "mn143:23": "By action, knowledge and Dhamma,By virtue and noble way of life —By these are mortals purified,Not by lineage or wealth.",
    "mn143:24": "Therefore a wise person who seesWhat truly leads to his own good,Should investigate the DhammaAnd purify himself with it.",
    "mn143:25": "Sāriputta has reached the peakIn virtue, peace, and wisdom's ways;Any bhikkhu who has gone beyondAt best can only equal him.\"",
    "mn143:26": "That is what the young god said. Then the young god, thinking: ‘The Teacher has approved of me,’ paid homage to me, and keeping me on his right, he vanished at once.\"",
    "mn143:27": "When this was said, the venerable Ānanda said to the Blessed One: \"Surely, venerable sir, that young god must have been Anāthapiṇḍika. For the householder Anāthapiṇḍika had perfect confidence in the venerable Sāriputta.\"",
    "mn143:28": "That is what the Blessed One said. The venerable Ānanda was satisfied and delighted in the Blessed One's words."
}