{
    "mn145:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Then, when it was evening, the venerable Puṇṇa rose from meditation and went to the Blessed One.[n.35] This Puṇṇa is a different person from Puṇṇa Mantāṇiputta ofMN 24. He was from a family of merchants residing in the port city of Suppāraka in the Sunāparanta country (present-day Māhārashtra). On a business trip to Sāvatthī he heard the Buddha give a discourse and renounced the home life to become a bhikkhu.After paying homage to the Blessed One, he sat down at one side and said to him:",
    "mn145:2": "\"Puṇṇa, there are forms cognizable by the eye that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. If a bhikkhu delights in them, welcomes them, and remains holding to them, delight arises in him. With the arising of delight, Puṇṇa, there is the arising of suffering, I say.[n.1316]MAexplains this instruction as a short teaching on the Four Noble Truths. Delight(nandī)is an aspect of craving. Through the arising of delight in regard to the eye and forms there arises the suffering of the five aggregates. Thus in this first part of the instruction the Buddha teaches the round of existence by way of the first two truths — suffering and its origin — as they occur through the six senses. In the second part (¶) he teaches the ending of the round by way of the second two truths — cessation and the path — expressed as the abandoning of delight in the six senses and their objects.",
    "mn145:3": "There are, Puṇṇa, sounds cognizable by the ear … odours cognizable by the nose … flavours cognizable by the tongue … tangibles cognizable by the body … mind-objects cognizable by the mind that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. If a bhikkhu delights in them, welcomes them, and remains holding to them, delight arises in him. With the arising of delight, Puṇṇa, there is the arising of suffering, I say.",
    "mn145:4–5": "\"Puṇṇa, there are forms cognizable by the eye … sounds cognizable by the ear … odours cognizable by the nose … flavours cognizable by the tongue … tangibles cognizable by the body … mind-objects cognizable by the mind that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. If a bhikkhu does not delight in them, welcome them, and remain holding to them, delight ceases in him. With the cessation of delight, Puṇṇa, there is the cessation of suffering, I say.",
    "mn145:6": "\"Now that I have given you this brief advice, Puṇṇa, in which country will you dwell?\"",
    "mn145:7": "\"Puṇṇa, the people of Sunāparanta are fierce and rough. If they abuse and threaten you, what will you think then?\"",
    "mn145:8": "\"But, Puṇṇa, if the people of Sunāparanta do give you a blow with the fist, what will you think then?\"",
    "mn145:9": "\"But, Puṇṇa, if the people of Sunāparanta do give you a blow with a clod, what will you think then?\"",
    "mn145:10": "\"But, Puṇṇa, if the people of Sunāparanta do give you a blow with a stick, what will you think then?\"",
    "mn145:11": "\"But, Puṇṇa, if the people of Sunāparanta do give you a blow with a knife, what will you think then?\"",
    "mn145:12": "\"But, Puṇṇa, if the people of Sunāparanta do take your life with a sharp knife, what will you think then?\"",
    "mn145:13": "Then, having delighted and rejoiced in the Blessed One's words, the venerable Puṇṇa rose from his seat, and after paying homage to the Blessed One, departed keeping him on his right. He then set his resting place in order, took his bowl and outer robe, and set out to wander towards the Sunāparanta country. Wandering by stages, he eventually arrived in the Sunāparanta country, and there he lived. Then, during that Rains, the venerable Puṇṇa established five hundred men lay followers and five hundred women lay followers in the practice, and he himself realised the three true knowledges. On a later occasion, the venerable Puṇṇa attained final Nibbāna.[n.17] That is, he expired. Since the Buddha still refers to Puṇṇa as a clansman(kulaputta), he must have died within a short time after returning to the Sunāparanta country. The texts leave no record of how he died. The version of this sutta atSN 35:88(iv.60–63) says that he expired during his first rains retreat there.",
    "mn145:14": "Then a number of bhikkhus went to the Blessed One, and after paying homage to him, they sat down at one side and told him: \"Venerable sir, the clansman Puṇṇa, who was given brief advice by the Blessed One, has died. What is his destination? What is his future course?\"",
    "mn145:15": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}