{
    "mn146:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn146:2": "Now on that occasion the elder bhikkhus were taking turns in advising the bhikkhunīs, but the venerable Nandaka did not want to advise them when his turn came.[n.1318] One of the eight important rules laid down by the Buddha when he established the Bhikkhunī Saṅgha stipulated that every fortnight the bhikkhunī should request the bhikkhus to send a bhikkhu for the purpose of giving them an exhortation. According toMA, in a previous life Ven. Nandaka had been a king and those bhikkhunīs had been his concubines. He wanted to avoid his turn in advising the bhikkhunīs because he thought that another bhikkhu possessing the knowledge of past lives, seeing him giving an exhortation surrounded by the bhikkhunīs, would think that he still could not separate himself from his former concubines. But the Buddha saw that Nandaka's discourse to the bhikkhunīs would benefit them and thus he requested him to instruct them.Then the Blessed One addressed the venerable Ānanda: \"Ānanda, whose turn is it today to advise the bhikkhunīs?\"",
    "mn146:3": "Then the Blessed One addressed the venerable Nandaka: \"Advise the bhikkhunīs, Nandaka. Instruct the bhikkhunīs, Nandaka. Give the bhikkhunīs a talk on the Dhamma, brahmin.\"",
    "mn146:4": "\"Sisters, what do you think? Is the eye permanent or impermanent?\" — \"Impermanent, venerable sir.\" — \"Is what is impermanent suffering or happiness?\" — \"Suffering, venerable sir.\" — \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" — \"No, venerable sir.\"",
    "mn146:5": "\"Sisters, what do you think? Are forms … sounds … odours … flavours … tangibles … mind-objects permanent or impermanent?\" — \"Impermanent, venerable sir.\" — \"Is what is impermanent suffering or happiness?\" — \"Suffering, venerable sir.\" — \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" — \"No, venerable sir. Why is that? Because, venerable sir, we have already seen this well as it actually is with proper wisdom thus: ‘These six external bases are impermanent.’\"",
    "mn146:6": "\"Sisters, what do you think? Is eye-consciousness … … ear-consciousness … nose-consciousness … tongue-consciousness … body-consciousness … mind-consciousness permanent or impermanent?\" — \"Impermanent, venerable sir.\" — \"Is what is impermanent suffering or happiness?\" — \"Suffering, venerable sir.\" — \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" — \"No, venerable sir. Why is that? Because, venerable sir, we have already seen this well as it actually is with proper wisdom thus: ‘These six classes of consciousness are impermanent.’\"",
    "mn146:7": "\"Sisters, suppose an oil-lamp is burning: its oil is impermanent and subject to change, its wick is impermanent and subject to change, its flame is impermanent and subject to change, and its radiance is impermanent and subject to change. Now would anyone be speaking rightly who spoke thus: ‘While this oil-lamp is burning, its oil, wick, and flame are impermanent and subject to change, but its radiance is permanent, everlasting, eternal, not subject to change’?\"",
    "mn146:8": "\"Sisters, suppose a great tree is standing possessed of heartwood: its root is impermanent and subject to change, its trunk is impermanent and subject to change, its branches and foliage are impermanent and subject to change, and its shadow is impermanent and subject to change. Now would anyone be speaking rightly who spoke thus: ‘The root, trunk, branches, and foliage of this great tree standing possessed of heartwood are impermanent and subject to change, but its shadow is permanent, everlasting, eternal, not subject to change’?\"",
    "mn146:9": "\"Sisters, suppose a skilled butcher or his apprentice were to kill a cow and carve it up with a sharp butcher's knife. Without damaging the inner mass of flesh and without damaging the outer hide, he would cut, sever, and carve away the inner tendons, sinews, and ligaments with the sharp butcher's knife. Then having cut, severed, and carved all this away, he would remove the outer hide and cover the cow again with that same hide. Would he be speaking rightly if he were to say: ‘This cow is joined to this hide just as it was before’?\"",
    "mn146:10": "\"Sisters, I have given this simile in order to convey a meaning. This is the meaning: ‘The inner mass of flesh’ is a term for the six internal bases. ‘The outer hide’ is a term for the six external bases. ‘The inner tendons, sinews, and ligaments’ is a term for delight and lust. ‘The sharp butcher's knife’ is a term for noble wisdom — the noble wisdom that cuts, severs, and carves away the inner defilements, fetters, and bonds.",
    "mn146:11": "\"Sisters, there are these seven enlightenment factors[n.1321]MA: He undertakes this teaching on the enlightenment factors because wisdom is not able to cut away the defilements by itself, but only when accompanied by the other six enlightenment factors (wisdom being equivalent to the investigation-of-states enlightenment factor).through the development and cultivation of which a bhikkhu, by realising for himself with direct knowledge, here and now enters upon and abides in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints. What are the seven? Here, sisters, a bhikkhu develops the mindfulness enlightenment factor, which is supported by seclusion, dispassion, and cessation, and ripens in relinquishment. He develops the investigation-of-states enlightenment factor … the energy enlightenment factor … the rapture enlightenment factor … the tranquillity enlightenment factor … the concentration enlightenment factor … the equanimity enlightenment factor, which is supported by seclusion, dispassion, and cessation, and ripens in relinquishment. These are the seven enlightenment factors through the development and cultivation of which a bhikkhu, by realising for himself with direct knowledge, here and now enters upon and abides in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints.\"",
    "mn146:12": "When the venerable Nandaka had advised the bhikkhunīs thus, he dismissed them, saying: \"Go, sisters, it is time.\" Then the bhikkhunīs, having delighted and rejoiced in the venerable Nandaka's words, rose from their seats, and after paying homage to the venerable Nandaka, departed keeping him on their right. They went to the Blessed One, and after paying homage to him, stood at one side. The Blessed One told them: \"Go, sisters, it is time.\" Then the bhikkhunīs paid homage to the Blessed One and departed keeping him on their right.",
    "mn146:13–22": "Then the Blessed One addressed the venerable Nandaka: \"Well then, Nandaka, tomorrow too you should advise those bhikkhunīs in exactly the same way.\"",
    "mn146:23": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}