{
    "mn144:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Bamboo Grove, the Squirrels’ Sanctuary.",
    "mn144:2": "Then the venerable Sāriputta and the venerable Mahā Cunda went to the venerable Channa and exchanged greetings with him. When this courteous and amiable talk was finished, they sat down at one side and the venerable Sāriputta said to the venerable Channa: \"I hope you are getting well, friend Channa, I hope you are comfortable. I hope your painful feelings are subsiding and not increasing, and that their subsiding, not their increase, is apparent.\"",
    "mn144:3": "\"Friend Sāriputta, I am not getting well, I am not comfortable. My painful feelings are increasing, not subsiding; their increase and not their subsiding is apparent. Just as if a strong man were splitting my head open with a sharp sword, so too, violent winds cut through my head. I am not getting well … Just as if a strong man were tightening a tough leather strap around my head as a headband, so too, there are violent pains in my head. I am not getting well … Just as if a skilled butcher or his apprentice were to carve up an ox's belly with a sharp butcher's knife, so too, violent winds are carving up my belly. I am not getting well … Just as if two strong men were to seize a weaker man by both arms and roast him over a pit of hot coals, so too, there is a violent burning in my body. I am not getting well, I am not comfortable. My painful feelings are increasing, not subsiding; their increase and not their subsiding is apparent. I shall use the knife,[n.107] This is an elliptical expression for committing suicide.friend Sāriputta; I have no desire to live.\"",
    "mn144:4": "\"Let the venerable Channa not use the knife. Let the venerable Channa live. We want the venerable Channa to live. If he lacks suitable food, I will go in search of suitable food for him. If he lacks suitable medicine, I will go in search of suitable medicine for him. If he lacks a proper attendant, I will attend on him. Let the venerable Channa not use the knife. Let the venerable Channa live. We want the venerable Channa to live.\"",
    "mn144:5": "\"Friend Sāriputta, it is not that I have no suitable food and medicine or no proper attendant. But rather, friend Sāriputta, the Teacher has long been worshipped by me with love, not without love; for it is proper for the disciple to worship the Teacher with love, not without love. Friend Sāriputta, remember this: the bhikkhu Channa will use the knife blamelessly.\"[n.1308] By making this statement he is implicitly claiming arahantship, as will be made clear at §11. Whether his claim at this point was valid or not is uncertain, the commentary regarding it as a case of self-overestimation.",
    "mn144:6": "\"Friend Channa, do you regard the eye, eye-consciousness, and things cognizableby the mindthrough eye-consciousness thus: ‘This is mine, this I am, this is my self’? Do you regard the ear … the nose … the tongue … the body … the mind, mind-consciousness, and things cognizableby the mindthrough mind-consciousness thus: ‘This is mine, this I am, this is my self’?\"",
    "mn144:7": "\"Friend Sāriputta, I regard the eye, eye-consciousness, and things cognizableby the mindthrough eye-consciousness thus: ‘This is not mine, this I am not, this is not my self.’ I regard the ear … the nose … the tongue … the body … the mind, mind-consciousness, and things cognizableby the mindthrough mind-consciousness thus: ‘This is not mine, this I am not, this is not my self.’\"",
    "mn144:8": "\"Friend Channa, what have you seen and directly known in the eye, in eye-consciousness, and in things cognizableby the mindthrough eye-consciousness, that you regard them thus: ‘This is not mine, this I am not, this is not my self’? What have you seen and directly known in the ear … in the nose … in the tongue … in the body … in the mind, in mind-consciousness, and in things cognizableby the mindthrough mind-consciousness, that you regard them thus: ‘This is not mine, this I am not, this is not my self’?\"",
    "mn144:9": "\"Friend Sāriputta, it is through seeing and directly knowing cessation in the eye, in eye-consciousness, and in things cognizableby the mindthrough eye-consciousness, that I regard them thus: ‘This is not mine, this I am not, this is not my self.’ It is through seeing and directly knowing cessation in the ear … in the nose … in the tongue … in the body … in the mind, in mind-consciousness, and in things cognizableby the mindthrough mind-consciousness, that I regard them thus: ‘This is not mine, this I am not, this is not my self.’\"",
    "mn144:10": "When this was said, the venerable Mahā Cunda said to the venerable Channa:[n.1309]MAsays that Ven. Mahā Cunda gave him this instruction thinking that he must still be an ordinary person, since he could not endure the deadly pains and wanted to commit suicide.\"Therefore, friend Channa, this instruction of the Blessed One's is to be constantly given attention: ‘There is wavering in one who is dependent, there is no wavering in one who is independent; when there is no wavering, there is tranquillity; when there is tranquillity, there is no bias; when there is no bias, there is no coming and going; when there is no coming and going, there is no passing away and reappearing; when there is no passing away and reappearing, there is no here nor beyond nor in between. This is the end of suffering.’\"[n.13] The sense of this instruction might be explained with the help ofMAthus: One is dependent because of craving and views and becomes independent by abandoning them with the attainment of arahantship. Bias (nati,lit. bending) comes about through craving, and its absence means there is no inclination or desire for existence. There is no coming and going by the ending of rebirth and death, no here nor beyond nor in between by the transcendence of this world, the world beyond, and the passage between one and the other. This is the end of the suffering of defilements and the suffering of the round.",
    "mn144:11": "Then when the venerable Sāriputta and the venerable Mahā Cunda had advised the venerable Channa thus, they rose from their seats and went away. Then, soon after they had gone, the venerable Channa used the knife.[n.13]MA: He cut his throat, and just at that moment the fear of death descended on him and the sign of future rebirth appeared. Recognising that he was still an ordinary person, he was aroused and developed insight. Comprehending the formations, he attained arahantship just before he expired.",
    "mn144:12": "That is what the Blessed One said. The venerable Sāriputta was satisfied and delighted in the Blessed One's words."
}