{
    "mn147:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.[n.323]MAsays that this discourse was spoken to Rāhula shortly after his higher ordination, presumably at the age of twenty. The sutta also occurs atSN 35:2/iv.05–7.",
    "mn147:2": "Now on that occasion many thousands of deities followed the Blessed One, thinking: \"Today the Blessed One will lead the venerable Rāhula further to the destruction of the taints.\"[n.135]MAsays that these deities, who came from various celestial realms, had been companions of Rāhula's during the previous life in which he first made the aspiration to attain arahantship as the son of a Buddha.Then the Blessed One went into the Blind Men's Grove and sat down at the root of a certain tree on a seat made ready. And the venerable Rāhula paid homage to the Blessed One and sat down at one side. The Blessed One then said to the venerable Rāhula:",
    "mn147:3": "\"Rāhula, what do you think? Is the eye permanent or impermanent?\" — \"Impermanent, venerable sir.\" — \"Is what is impermanent suffering or happiness?\" — \"Suffering, venerable sir.\" — \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" — \"No, venerable sir.\"",
    "mn147:4": "\"Rāhula, what do you think? Is the ear permanent or impermanent? … Is the nose permanent or impermanent? … Is the tongue permanent or impermanent? … Is the body permanent or impermanent? … Is the mind permanent or impermanent? … Are mind-objects … Is mind-consciousness … Is mind-contact … Is anything comprised within the feeling, perception, formations, and consciousness that arise with mind-contact as condition permanent or impermanent?\" — \"Impermanent, venerable sir.\" — \"Is what is impermanent suffering or happiness?\" — \"Suffering, venerable sir.\" — \"Is what is impermanent, suffering, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?\" — \"No, venerable sir.\"",
    "mn147:5": "\"Seeing thus, Rāhula, a well-taught noble disciple becomes disenchanted with the eye, disenchanted with forms, disenchanted with eye-consciousness, disenchanted with eye-contact, and disenchanted with anything comprised within the feeling, perception, formations, and consciousness that arise with eye-contact as condition.",
    "mn147:6": "That is what the Blessed One said. The venerable Rāhula was satisfied and delighted in the Blessed One's words. Now while this discourse was being spoken, through not clinging the venerable Rāhula's mind was liberated from the taints. And in those many thousands of deities there arose the spotless immaculate vision of the Dhamma: \"All that is subject to arising is subject to cessation.\"[n.1327] According toMA, stream-entry was the minimal attainment of those deities, but some attained the higher paths and fruits up to arahantship."
}