{
    "mn140:1": "Thus have I heard. On one occasion the Blessed One was wandering in the Magadhan country and eventually arrived at Rājagaha. There he went to the potter Bhaggava and said to him:",
    "mn140:2": "Now there was a clansman named Pukkusāti who had gone forth from the home life into homelessness out of faith in the Blessed One, and on that occasion he was already staying in the potter's workshop.[n.164] According toMA, Pukkusāti had been the king of Takkasilā and had entered into a friendship with King Bimbisāra of Magadha through merchants who travelled between the two countries for purposes of trade. In an exchange of gifts Bimbisāra sent Pukkusāti a golden plate on which he had inscribed descriptions of the Three Jewels and various aspects of the Dhamma. When Pukkusāti read the inscription, he was filled with joy and decided to renounce the world. Without taking formal ordination, he shaved his head, put on yellow robes, and left the palace. He went to Rājagaha intending to meet the Buddha, who was then in Sāvatthī, about 300 miles away. The Buddha saw Pukkusāti with his clairvoyant knowledge, and recognising his capacity to attain the paths and fruits, he journeyed alone on foot to Rājagaha to meet him. To avoid being recognised, by an act of will the Buddha caused his special physical attributes such as the marks of a Great Man to be concealed, and he appeared just like an ordinary wandering monk. He arrived at the potter's shed shortly after Pukkusāti had arrived there intending to leave for Sāvatthī the next day in order to meet the Buddha.Then the Blessed One went to the venerable Pukkusāti and said to him: \"If it is not inconvenient for you, bhikkhu, I will stay one night in the workshop.\"",
    "mn140:3": "Then the Blessed One entered the potter's workshop, prepared a spread of grass at one end, and sat down, folding his legs crosswise, setting his body erect, and establishing mindfulness in front of him. Then the Blessed One spent most of the night seatedin meditation, and the venerable Pukkusāti also spent most of the night seatedin meditation.",
    "mn140:4": "Then the Blessed One thought: \"This clansman conducts himself in a way that inspires confidence. Suppose I were to question him.\" So he asked the venerable Pukkusāti:",
    "mn140:5": "Then the Blessed One thought: \"This clansman has gone forth from the home life into homelessness under me. Suppose I were to teach him the Dhamma.\" So the Blessed One addressed the venerable Pukkusāti thus: \"Bhikkhu, I will teach you the Dhamma. Listen and attend closely to what I shall say.\" — \"Yes, friend,\" the venerable Pukkusāti replied. The Blessed One said this:",
    "mn140:6": "\"Bhikkhu, this person consists of six elements, six bases of contact, and eighteen kinds of mental exploration, and he has four foundations.[n.127]MA: Since Pukkusāti had already purified the preliminary practice of the path and was able to attain the fourth jhāna through mindfulness of breathing, the Buddha began directly with a talk on insight meditation, expounding the ultimate voidness that is the foundation for arahantship.The tides of conceiving do not sweep over one who stands upon thesefoundations, and when the tides of conceiving no longer sweep over him he is called a sage at peace. One should not neglect wisdom, should preserve truth, should cultivate relinquishment, and should train for peace. This is the summary of the exposition of the six elements.",
    "mn140:7": "\"‘Bhikkhu, this person consists of six elements.’[n.1268]MA: Here the Buddha expounds the non-truly existent by way of the truly existent; for the elements are truly existent but the person is not truly existent. This is meant: \"That which you perceive as a person consists of six elements. Ultimately there is no person here. ‘Person’ is a mere concept.\"So it was said. And with reference to what was this said? There are the earth element, the water element, the fire element, the air element, the space element, and the consciousness element. So it was with reference to this that it was said: ‘Bhikkhu, this person consists of six elements.’",
    "mn140:8": "\"‘Bhikkhu, this person consists of six bases of contact.’ So it was said. And with reference to what was this said? There are the base of eye-contact, the base of ear-contact, the base of nose-contact, the base of tongue-contact, the base of body-contact, and the base of mind-contact. So it was with reference to this that it was said: ‘Bhikkhu, this person consists of six bases of contact.’",
    "mn140:9": "\"‘Bhikkhu, this person consists of eighteen kinds of mental exploration.’[n.126] As atMN 137.8.So it was said. And with reference to what was this said? On seeing a form with the eye, one explores a form productive of joy, one explores a form productive of grief, one explores a form productive of equanimity. On hearing a sound with the ear … On smelling an odour with the nose … On tasting a flavour with the tongue … On touching a tangible with the body … On cognizing a mind-object with the mind, one explores a mind-object productive of joy, one explores a mind-object productive of grief, one explores a mind-object productive of equanimity. So it was with reference to this that it was said: ‘Bhikkhu, this person consists of eighteen kinds of mental exploration.’",
    "mn140:10": "\"‘Bhikkhu, this person has four foundations.’ So it was said. And with reference to what was this said? There are the foundation of wisdom, the foundation of truth, the foundation of relinquishment, and the foundation of peace.[n.1270]Paññạ̄dhiṭṭhāna, saccādhiṭṭhāna,cāgādhiṭṭāna, upasamādhiṭṭhāna.Ñm, in Ms, had first renderedadhiṭṭānaas \"resolve,\" and then replaced it with \"mode of expression,\" neither of which seems suitable for this context. MA glosses the word withpatiṭṭhā,which clearly means foundation, and explains the sense of the statement thus: \"This person who consists of the six elements, the six bases of contact, and the eighteen kinds of mental approach — when he turns away from these and attains arahantship, the supreme accomplishment, he does so established upon these four bases.\" The four foundations will be individually elucidated by the sequel, verses 12–29.So it was with reference to this that it was said: ‘Bhikkhu, this person has four foundations.’",
    "mn140:11": "\"‘One should not neglect wisdom, should preserve truth, should cultivate relinquishment, and should train for peace.’[n.1271] MA: From the start one should not neglect the wisdom born of concentration and insight in order to penetrate through to the wisdom of the fruit of arahantship. One should preserve truthful speech in order to realise Nibbāna, the ultimate truth. One should cultivate the relinquishment of defilements in order to relinquish all defilements by the path of arahantship. From the start one should train in the pacification of defilements in order to pacify all defilements by the path of arahantship. Thus the wisdom, etc., born of serenity and insight are spoken of as the preliminary foundations for achieving the foundations of wisdom, etc. (distinctive of arahantship).So it was said. And with reference to what was this said?",
    "mn140:12": "\"What, bhikkhu, is the earth element? The earth element may be either internal or external. What is the internal earth element? Whatever internally, belonging to oneself, is solid, solidified, and clung-to, that is, head-hairs, body-hairs, nails, teeth, skin, flesh, sinews, bones, bone-marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, mesentery, contents of the stomach, feces, or whatever else internally, belonging to oneself, is solid, solidified, and clung-to: this is called the internal earth element. Now both the internal earth element and the external earth element are simply earth element. And that should be seen as it actually is with proper wisdom thus: ‘This is not mine, this I am not, this is not my self.’ When one sees it thus as it actually is with proper wisdom, one becomes disenchanted with the earth element and makes the mind dispassionate towards the earth element.",
    "mn140:13": "\"What, bhikkhu, is the water element? The water element may be either internal or external. What is the internal water element? Whatever internally, belonging to oneself, is water, watery, and clung-to, that is, bile, phlegm, pus, blood, sweat, fat, tears, grease, spittle, snot, oil-of-the-joints, urine, or whatever else internally, belonging to oneself, is water, watery, and clung-to: this is called the internal water element. Now both the internal water element and the external water element are simply water element. And that should be seen as it actually is with proper wisdom thus: ‘This is not mine, this I am not, this is not my self.’ When one sees it thus as it actually is with proper wisdom, one becomes disenchanted with the water element and makes the mind dispassionate towards the water element.",
    "mn140:14": "\"What, bhikkhu, is the fire element? The fire element may be either internal or external. What is the internal fire element? Whatever internally, belonging to oneself, is fire, fiery, and clung-to, that is, that by which one is warmed, ages, and is consumed, and that by which what is eaten, drunk, consumed, and tasted gets completely digested, or whatever else internally, belonging to oneself, is fire, fiery, and clung-to: this is called the internal fire element. Now both the internal fire element and the external fire element are simply fire element. And that should be seen as it actually is with proper wisdom thus: ‘This is not mine, this I am not, this is not my self.’ When one sees it thus as it actually is with proper wisdom, one becomes disenchanted with the fire element and makes the mind dispassionate towards the fire element.",
    "mn140:15": "\"What, bhikkhu, is the air element? The air element may be either internal or external. What is the internal air element? Whatever internally, belonging to oneself, is air, airy, and clung-to, that is, up-going winds, down-going winds, winds in the belly, winds in the bowels, winds that course through the limbs, in-breath and out-breath, or whatever else internally, belonging to oneself, is air, airy, and clung-to: this is called the internal air element. Now both the internal air element and the external air element are simply air element. And that should be seen as it actually is with proper wisdom thus: ‘This is not mine, this I am not, this is not my self.’ When one sees it thus as it actually is with proper wisdom, one becomes disenchanted with the air element and makes the mind dispassionate towards the air element.",
    "mn140:16": "\"What, bhikkhu, is the space element? The space element may be either internal or external. What is the internal space element? Whatever internally, belonging to oneself, is space, spatial, and clung-to, that is, the holes of the ears, the nostrils, the door of the mouth, and thataperturewhereby what is eaten, drunk, consumed, and tasted gets swallowed, and where it collects, and whereby it is excreted from below, or whatever else internally, belonging to oneself, is space, spatial, and clung-to: this is called the internal space element. Now both the internal space element and the external space element are simply space element. And that should be seen as it actually is with proper wisdom thus: ‘This is not mine, this I am not, this is not my self.’ When one sees it thus as it actually is with proper wisdom, one becomes disenchanted with the space element and makes the mind dispassionate towards the space element.",
    "mn140:17": "\"Then there remains only consciousness, purified and bright.[n.1273] MA: This is the sixth element, which \"remains\" in that it has yet to be expounded by the Buddha and penetrated by Pukkusāti. Here it is explained as the consciousness that accomplishes the work of insight contemplation on the elements. Under the heading of consciousness, the contemplation of feeling is also introduced.What does one cognize with that consciousness? One cognizes: ‘This ispleasant’; one cognizes: ‘This ispainful’; one cognizes: ‘This isneither-painful-nor-pleasant.’ In dependence on a contact to be felt as pleasant there arises a pleasant feeling.[n.1274] This passage shows the conditionality of feeling and its impermanence through the cessation of its condition.When one feels a pleasant feeling, one understands: ‘I feel a pleasant feeling.’ One understands: ‘With the cessation of that same contact to be felt as pleasant, its corresponding feeling — the pleasant feeling that arose in dependence on that contact to be felt as pleasant — ceases and subsides.’",
    "mn140:18": "In dependence on a contact to be felt as painful there arises a painful feeling. When one feels a painful feeling, one understands: ‘I feel a painful feeling.’ One understands: ‘With the cessation of that same contact to be felt as painful, its corresponding feeling — the painful feeling that arose in dependence on that contact to be felt as painful — ceases and subsides.’",
    "mn140:19": "In dependence on a contact to be felt as neither-painful-nor-pleasant there arises a neither-painful-nor-pleasant feeling. When one feels a neither-painful-nor-pleasant feeling, one understands: ‘I feel a neither-painful-nor-pleasant feeling.’ One understands: ‘With the cessation of that same contact to be felt as neither-painful-nor-pleasant, its corresponding feeling — the neither-painful-nor-pleasant feeling that arose in dependence on that contact to be felt as neither-painful-nor-pleasant — ceases and subsides.’",
    "mn140:20–22": "Bhikkhu, just as from the contact and friction of two fire-sticks heat is generated and fire is produced, and with the separation and disjunction of those two fire-sticks the corresponding heat ceases and subsides; so too, in dependence on a contact to be felt as pleasant … to be felt as painful … to be felt as neither-painful-nor-pleasant there arises a neither-painful-nor-pleasant feeling … One understands: ‘With the cessation of that same contact to be felt as neither-painful-nor-pleasant, its corresponding feeling … ceases and subsides.’",
    "mn140:23": "\"Then there remains only equanimity, purified and bright, malleable, wieldy, and radiant.[n.1275] MA identifies this as the equanimity of the fourth jhāna. According to MA, Pukkusāti had already achieved the fourth jhāna and had a strong attachment to it. The Buddha first praises this equanimity to inspire Pukkusāti's confidence, then he gradually leads him to the immaterial jhānas and the attainment of the paths and fruits.Suppose, bhikkhu, a skilled goldsmith or his apprentice were to prepare a furnace, heat up the crucible, take some gold with tongs, and put it into the crucible. From time to time he would blow on it, from time to time he would sprinkle water over it, and from time to time he would just look on. That gold would become refined, well refined, completely refined, faultless, rid of dross, malleable, wieldy, and radiant. Then whatever kind of ornament he wished to make from it, whether a golden chain or earrings or a necklace or a golden garland, it would serve his purpose. So too, bhikkhu, then there remains only equanimity, purified and bright, malleable, wieldy, and radiant.",
    "mn140:24": "\"He understands thus: ‘If I were to direct this equanimity, so purified and bright, to the base of infinite space and to develop my mind accordingly, then this equanimity of mine, supported by that base, clinging to it, would remain for a very long time.[n.1276] The sense is: If he attains the base of infinite space and should pass away while still attached to it, he would be reborn in the plane of infinite space and would live there for the full lifespan of 20,000 aeons specified for that plane. In the higher three immaterial planes the lifespan is respectively 40,000 aeons, 60,000 aeons, and 84,000 aeons.If I were to direct this equanimity, so purified and bright, to the base of infinite consciousness … … to the base of nothingness … to the base of neither-perception-nor-non-perception and to develop my mind accordingly, then this equanimity of mine, supported by that base, clinging to it, would remain for a very long time.’",
    "mn140:25": "\"He understands thus: ‘If I were to direct this equanimity, so purified and bright, to the base of infinite space and to develop my mind accordingly, this would be conditioned.[n.1277] MA: This is said in order to show the danger in the immaterial jhānas. By the one phrase, \"This would be conditioned,\" he shows: \"Even though the lifespan there is 20,000 aeons, that is conditioned, fashioned, built up. It is thus impermanent, unstable, not lasting, transient. It is subject to perishing, breaking up, and dissolution; it is involved with birth, ageing, and death, grounded upon suffering. It is not a shelter, a place of safety, a refuge. Having passed away there as a worldling, one can still be reborn in the four states of deprivation.\"If I were to direct this equanimity, so purified and bright, to the base of infinite consciousness … to the base of nothingness … to the base of neither-perception-nor-non-perception and to develop my mind accordingly, this would be conditioned.’ He does not form any condition or generate any volition tending towards either being or non-being.[n.1278]So n’eva abhisaṅkharoti nābhisañcetayati bhavāya vā vibhavāya.The two verbs suggest the notion of volition as a constructive power that builds up the continuation of conditioned existence. Ceasing to will for either being or non-being shows the extinction of craving for eternal existence and annihilation, culminating in the attainment of arahantship.",
    "mn140:26": "Since he does not form any condition or generate any volition tending towards either being or non-being, he does not cling to anything in this world. When he does not cling, he is not agitated. When he is not agitated, he personally attains Nibbāna. He understands thus: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.’[n.1279] MA says that at this point Pukkusāti penetrated three paths and fruits, becoming a non-returner. He realised that his teacher was the Buddha himself, but he could not express his realisation since the Buddha still continued with his discourse.",
    "mn140:27": "\"If he feels a pleasant feeling,[n.1280] This passage shows the arahant's abiding in the Nibbāna element with a residue remaining (of the factors of conditioned existence,sa-upādisesa nibbānadhātu). Though he continues to experience feelings, he is free from lust towards pleasant feeling, from aversion towards painful feeling, and from ignorance about neutral feeling.he understands: ‘It is impermanent; there is no holding to it; there is no delight in it.’ If he feels a painful feeling, he understands: ‘It is impermanent; there is no holding to it; there is no delight in it.’ If he feels a neither-painful-nor-pleasant feeling, he understands: ‘It is impermanent; there is no holding to it; there is no delight in it.’",
    "mn140:28": "\"If he feels a pleasant feeling, he feels it detached; if he feels a painful feeling, he feels it detached; if he feels a neither-painful-nor-pleasant feeling, he feels it detached. When he feels a feeling terminating with the body, he understands: ‘I feel a feeling terminating with the body.’ When he feels a feeling terminating with life, he understands: ‘I feel a feeling terminating with life.’[n.11] That is, he continues to experience feeling only as long as the body with its life faculty continues, but not beyond that.He understands: ‘On the dissolution of the body, with the ending of life, all that is felt, not being delighted in, will become cool right here.’[n.12] This refers to his attainment of the Nibbāna-element with no residue remaining(anupādisesa nibbānadhātu)— the cessation of all conditioned existence with his final passing away.",
    "mn140:29": "Bhikkhu, just as an oil-lamp burns in dependence on oil and a wick, and when the oil and wick are used up, if it does not get any more fuel, it is extinguished from lack of fuel; so too when he feels a feeling terminating with the body … a feeling terminating with life, he understands: ‘I feel a feeling terminating with life.’ He understands: ‘On the dissolution of the body, with the ending of life, all that is felt, not being delighted in, will become cool right here.’",
    "mn140:30": "\"His deliverance, being founded upon truth, is unshakeable. For that is false, bhikkhu, which has a deceptive nature, and that is true which has an undeceptive nature — Nibbāna. Therefore a bhikkhu possessingthis truthpossesses the supreme foundation of truth. For this, bhikkhu, is the supreme noble truth, namely, Nibbāna, which has an undeceptive nature.",
    "mn140:31": "\"Formerly, when he was ignorant, he undertook and accepted acquisitions;[n.1284] MA mentions four kinds of acquisitions(upadhi)here: seen.674.now he has abandoned them, cut them off at the root, made them like a palm stump, done away with them so that they are no longer subject to future arising. Therefore a bhikkhu possessingthis relinquishmentpossesses the supreme foundation of relinquishment. For this, bhikkhu, is the supreme noble relinquishment, namely, the relinquishing of all acquisitions.",
    "mn140:32": "\"Formerly, when he was ignorant, he experienced covetousness, desire, and lust; now he has abandoned them, cut them off at the root, made them like a palm stump, done away with them so that they are no longer subject to future arising. Formerly, when he was ignorant, he experienced anger, ill will, and hate; now he has abandoned them, cut them off at the root, made them like a palm stump, done away with them so that they are no longer subject to future arising. Formerly, when he was ignorant, he experienced ignorance and delusion; now he has abandoned them, cut them off at the root, made them like a palm stump, done away with them so that they are no longer subject to future arising. Therefore a bhikkhu possessingthis peacepossesses the supreme foundation of peace. For this, bhikkhu, is the supreme noble peace, namely, the pacification of lust, hate, and delusion.",
    "mn140:33": "\"‘The tides of conceiving do not sweep over one who stands upon thesefoundations, and when the tides of conceiving no longer sweep over him he is called a sage at peace.’[n.1285] The \"tides of conceiving\"(maññussavā), as the following paragraph will show, are thoughts and notions originating from the three roots of conceiving — craving, conceit, and views. For a fuller explanation,see n.6.The \"sage at peace\"(muni santo)is the arahant.So it was said. And with reference to what was this said?",
    "mn140:34": "Thereupon the venerable Pukkusāti thought: \"Indeed, the Teacher has come to me! The Sublime One has come to me! The Fully Enlightened One has come to me!\" Then he rose from his seat, arranged his upper robe over one shoulder, and prostrating himself with his head at the Blessed One's feet, he said: \"Venerable sir, a transgression overcame me, in that like a fool, confused and blundering, I presumed to address the Blessed One as ‘friend.’ Venerable sir, may the Blessed One forgive my transgression seen as such for the sake of restraint in the future.\"",
    "mn140:35": "Then the venerable Pukkusāti, having delighted and rejoiced in the Blessed One's words, rose from his seat, and after paying homage to the Blessed One, keeping him on his right, he departed in order to search for a bowl and robes.",
    "mn140:36": "Then, while the venerable Pukkusāti was searching for a bowl and robes, a stray cow killed him.",
    "mn140:37": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}