{
    "mn152:1": "Thus have I heard. On one occasion the Blessed One was living at Kajaṅgalā in a grove of mukhelu trees.",
    "mn152:2": "Then, knowing this, the Blessed One addressed the venerable Ānanda: \"Ānanda, the brahmin Pārāsariya teaches his disciples the development of the faculties in one way, but in the Noble One's Discipline the supreme development of the faculties is otherwise.\"[n.135] The expression \"the development of the faculties\"(indriyabhāvanā)properly signifies the development of the mind in responding to the objects experienced through the sense faculties. The more rudimentary aspect of this practice, the restraint of the sense faculties(indriyasaṁvara), involves controlling the mind in such a way that one does not grasp at the \"signs and features\" of things, their distinctive attractive and repulsive attributes. The development of the faculties carries this process of control through to the point where, by an act of will, one can immediately set up insight even in the course of sense perception. At the highest level one acquires the ability to radically transform the subjective significance of perceptual objects themselves, making them appear in a mode that is the very opposite of the way they are normally apprehended.",
    "mn152:3": "\"Now, Ānanda, how is there the supreme development of the faculties in the Noble One's Discipline? Here, Ānanda, when a bhikkhu sees a form with the eye, there arises in him what is agreeable, there arises what is disagreeable, there arises what is both agreeable and disagreeable.[n.15]MAexplains that when a desirable form comes into raṅge of the eye, an agreeable state(manāpa)arises; when an undesirable form appears, a disagreeable state(amanāpa)arises; and when an indifferent form appears, a state that is both agreeable and disagreeable arises. It should be noted that though these three terms are ordinarily used to qualify the sense objects, here they also seem to signify subtle states of liking, aversion, and dull indifference that arise due to the influence of the underlying tendencies. MṬ identifies \"the agreeable\" with wholesome and unwholesome states of mind associated with joy, \"the disagreeable\" with unwholesome states of mind associated with grief (displeasure), and \"the agreeable and disagreeable\" with states of mind associated with equanimous feeling.He understands thus: ‘There has arisen in me what is agreeable, there has arisen what is disagreeable, there has arisen what is both agreeable and disagreeable. But that is conditioned, gross, dependently arisen; this is peaceful, this is sublime, that is, equanimity.’ The agreeable that arose, the disagreeable that arose, and the both agreeable and disagreeable that arose cease in him and equanimity is established.[n.154]MA: This equanimity is the equanimity of insight(vipassan’upekkhā). The bhikkhu does not allow his mind to be overcome by lust, hate, or delusion, but comprehends the object and sets up insight in the neutral state. MṬ explains this to mean that he enters into equanimity regarding formations(saṅkhār’upekkhā),a particular stage of insight knowledge (see Vsm XXI, 61–66).Just as a man with good sight, having opened his eyes might shut them or having shut his eyes might open them, so too concerning anything at all, the agreeable that arose, the disagreeable that arose, and the both agreeable and disagreeable that arose cease just as quickly, just as rapidly, just as easily, and equanimity is established. This is called in the Noble One's Discipline the supreme development of the faculties regarding forms cognizable by the eye.[n.155]MṬ: The noble development of the faculties is the suppression of lust, etc., arisen through the eye, and the establishment of the equanimity of insight.",
    "mn152:4": "\"Again, Ānanda, when a bhikkhu hears a sound with the ear, there arises in him what is agreeable, there arises what is disagreeable, there arises what is both agreeable and disagreeable. He understands thus: … and equanimity is established. Just as a strong man might easily snap his fingers, so too concerning anything at all, the agreeable that arose, the disagreeable that arose, and the both agreeable and disagreeable that arose cease just as quickly, just as rapidly, just as easily, and equanimity is established. This is called in the Noble One's Discipline the supreme development of the faculties regarding sounds cognizable by the ear.",
    "mn152:5": "\"Again, Ānanda, when a bhikkhu smells an odour with the nose, there arises in him what is agreeable, there arises what is disagreeable, there arises what is both agreeable and disagreeable. He understands thus: … and equanimity is established. Just as raindrops on a slightly sloping lotus leaf roll off and do not remain there, so too concerning anything at all, the agreeable that arose, the disagreeable that arose, and the both agreeable and disagreeable that arose cease just as quickly, just as rapidly, just as easily, and equanimity is established. This is called in the Noble One's Discipline the supreme development of the faculties regarding odours cognizable by the nose.",
    "mn152:6": "\"Again, Ānanda, when a bhikkhu tastes a flavour with the tongue, there arises in him what is agreeable, there arises what is disagreeable, there arises what is both agreeable and disagreeable. He understands thus: … and equanimity is established. Just as a strong man might easily spit out a ball of spittle collected on the tip of his tongue, so too concerning anything at all, the agreeable that arose, the disagreeable that arose, and the both agreeable and disagreeable that arose cease just as quickly, just as rapidly, just as easily, and equanimity is established. This is called in the Noble One's Discipline the supreme development of the faculties regarding flavours cognizable by the tongue.",
    "mn152:7": "\"Again, Ānanda, when a bhikkhu touches a tangible with the body, there arises in him what is agreeable, there arises what is disagreeable, there arises what is both agreeable and disagreeable. He understands thus: … and equanimity is established. Just as a strong man might extend his flexed arm or flex his extended arm, so too concerning anything at all, the agreeable that arose, the disagreeable that arose, and the both agreeable and disagreeable that arose cease just as quickly, just as rapidly, just as easily, and equanimity is established. This is called in the Noble One's Discipline the supreme development of the faculties regarding tangibles cognizable by the body.",
    "mn152:8": "\"Again, Ānanda, when a bhikkhu cognizes a mind-object with the mind, there arises in him what is agreeable, there arises what is disagreeable, there arises what is both agreeable and disagreeable. He understands thus: … and equanimity is established. Just as if a man were to let two or three drops of water fall onto an iron plate heated for a whole day, the falling of the drops might be slow but they would quickly vaporise and vanish,[n.1356] The same simile appears atMN 66.16.so too concerning anything at all, the agreeable that arose, the disagreeable that arose, and the both agreeable and disagreeable that arose cease just as quickly, just as rapidly, just as easily, and equanimity is established. This is called in the Noble One's Discipline the supreme development of the faculties regarding ideas cognizable by the mind.",
    "mn152:9": "\"And how, Ānanda, is one a disciple in higher training, one who has entered upon the way? Here, Ānanda, when a bhikkhu sees a form with the eye … hears a sound with the ear … smells an odour with the nose … tastes a flavour with the tongue … touches a tangible with the body … cognizes a mind-object with the mind, there arises in him what is agreeable, there arises what is disagreeable, there arises what is both agreeable and disagreeable; he is repelled, humiliated, and disgusted by the agreeable that arose, by the disagreeable that arose, and by the both agreeable and disagreeable that arose.[n.1357] Although thesekhahas already entered upon the way to final deliverance, he is still prone to subtle states of liking, aversion, and dull indifference in regard to sense objects. He experiences these, however, as impediments to his progress, and thus becomes repelled, humiliated, and disgusted by them.That is how one is a disciple in higher training, one who has entered upon the way.",
    "mn152:10–11": "\"And how, Ānanda, is one a noble one with developed faculties?[n.1358]Ariya bhāvitindriya:the arahant is meant.Here, Ānanda, when a bhikkhu sees a form with the eye … hears a sound with the ear … smells an odour with the nose … tastes a flavour with the tongue … touches a tangible with the body … cognizes a mind-object with the mind, there arises in him what is agreeable, there arises what is disagreeable, there arises what is both agreeable and disagreeable.[n.1359] Since the arahant has eradicated all the defilements along with their underlying tendencies, in this passage the three terms — the agreeable, etc. — must be understood simply as the feelings that arise through contact with sense objects, and not as the subtle traces of liking, aversion, and indifference relevant to the preceding passage.If he should wish: ‘May I abide perceiving the unrepulsive in the repulsive,’ he abides perceiving the unrepulsive in the repulsive. If he should wish: ‘May I abide perceiving the repulsive in the unrepulsive, ’ he abides perceiving the repulsive in the unrepulsive. If he should wish: ‘May I abide perceiving the unrepulsive in the repulsive and the unrepulsive,’ he abides perceiving the unrepulsive in that. If he should wish: ‘May I abide perceiving the repulsive in the unrepulsive and the repulsive,’ he abides perceiving the repulsive in that. If he should wish: ‘May I, avoiding both the repulsive and unrepulsive, abide in equanimity, mindful and fully aware,’ he abides in equanimity towards that, mindful and fully aware.[n.1360] The Paṭisambhidāmagga calls this practice \"the noble supernormal power\"(ariya iddhi)and explains it thus (ii.212): To abide perceiving the unrepulsive in the repulsive, one pervades a repulsive being with loving-kindness, or one attends to a repulsive object (either animate or inanimate) as a mere assemblage of impersonal elements. To abide perceiving the repulsive in the unrepulsive, one pervades a (sensually) attractive person with the idea of the foulness of the body, or one attends to an attractive object (either animate or inanimate) as impermanent. The third and fourth methods involve the application of the first and second contemplations to both repulsive and unrepulsive objects, without discrimination. The fifth method involves the avoidance of joy and sorrow in response to the six sense objects, thus enabling one to abide in equanimity, mindful and fully aware.Although this fivefold contemplation is ascribed to the arahant as a power perfectly under his control, elsewhere the Buddha teaches it to bhikkhus still in training as a way to overcome the three unwholesome roots. SeeAN 5:144/iii.169–70; and for a thoughtful commentary on that sutta, see Nyanaponika Thera,The Roots of Good and Evil,pp. 73–78.That is how one is a noble one with developed faculties.",
    "mn152:12": "\"So, Ānanda, the supreme development of the faculties in the Noble One's Discipline has been taught by me, the disciple in higher training who has entered upon the way has been taught by me, and the noble one with developed faculties has been taught by me.",
    "mn152:13": "That is what the Blessed One said. The venerable Ānanda was satisfied and delighted in the Blessed One's words."
}