{
    "mn19:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn19:2": "\"Bhikkhus, before my enlightenment, while I was still only an unenlightened Bodhisatta, it occurred to me: ‘Suppose that I divide my thoughts into two classes.[n.35] The Bodhisatta's twofold division of thought occurred during his six-year struggle for enlightenment.Then I set on one side thoughts of sensual desire, thoughts of ill will, and thoughts of cruelty, and I set on the other side thoughts of renunciation, thoughts of non-ill will, and thoughts of non-cruelty.[n.36] Thoughts of non-ill will and thoughts of non-cruelty may also be explained positively as thoughts of loving-kindness(mettā)and thoughts of compassion(karuṇā).",
    "mn19:3": "\"As I abided thus, diligent, ardent, and resolute, a thought of sensual desire arose in me. I understood thus: ‘This thought of sensual desire has arisen in me. This leads to my own affliction, to others’ affliction, and to the affliction of both; it obstructs wisdom, causes difficulties, and leads away from Nibbāna.’ When I considered: ‘This leads to my own affliction,’ it subsided in me; when I considered: ‘This leads to others’ affliction,’ it subsided in me; when I considered: ‘This leads to the affliction of both,’ it subsided in me; when I considered: ‘This obstructs wisdom, causes difficulties, and leads away from Nibbāna,’ it subsided in me. Whenever a thought of sensual desire arose in me, I abandoned it, removed it, did away with it.",
    "mn19:4": "\"As I abided thus, diligent, ardent, and resolute, a thought of ill will arose in me … a thought of cruelty arose in me. I understood thus: ‘This thought of cruelty has arisen in me. This leads to my own affliction, to others’ affliction, and to the affliction of both; it obstructs wisdom, causes difficulties, and leads away from Nibbāna.‘ When I considered thus … it subsided in me. Whenever a thought of cruelty arose in me, I abandoned it, removed it, did away with it.",
    "mn19:5": "\"Bhikkhus, whatever a bhikkhu frequently thinks and ponders upon, that will become the inclination of his mind. If he frequently thinks and ponders upon thoughts of sensual desire, he has abandoned the thought of renunciation to cultivate the thought of sensual desire, and then his mind inclines to thoughts of sensual desire. If he frequently thinks and ponders thoughts of sensual desire. If he frequently thinks and ponders upon thoughts of ill will … upon thoughts of cruelty, he has abandoned the thought of non-cruelty to cultivate the thought of cruelty, and then his mind inclines to thoughts of cruelty.",
    "mn19:6": "\"As I abided thus, diligent, ardent, and resolute, a thought of renunciation arose in me. I understood thus: ‘This thought of renunciation has arisen in me. This does not lead to my own affliction, or to others’ affliction, or to the affliction of both; it aids wisdom, does not cause difficulties, and leads to Nibbāna. If I think and ponder upon this thought even for a night, even for a day, even for a night and day, I see nothing to fear from it. But with excessive thinking and pondering I might tire my body, and when the body is tired, the mind becomes strained, and when the mind is strained, it is far from concentration.’ So I steadied my mind internally, quieted it, brought it to singleness, and concentrated it. Why is that? So that my mind should not be strained.[n.237]MA:Excessive thinking and pondering leads to agitation. To tame and soften the mind, the Bodhisatta would enter a meditative attainment, then he would emerge from it and develop insight.",
    "mn19:7": "\"As I abided thus, diligent, ardent, and resolute, a thought of non-ill will arose in me … a thought of non-cruelty arose in me. I understood thus: ‘This thought of non-cruelty has arisen in me. This does not lead to my own affliction, or to others’ affliction, or to the affliction of both; it aids wisdom, does not cause difficulties, and leads to Nibbāna. If I think and ponder upon this thought even for a night, even for a day, even for a night and day, I see nothing to fear from it. But with excessive thinking and pondering I might tire my body, and when the body is tired, the mind becomes strained, and when the mind is strained, it is far from concentration.’ So I steadied my mind internally, quieted it, brought it to singleness, and concentrated it. Why is that? So that my mind should not be strained.",
    "mn19:8": "\"Bhikkhus, whatever a bhikkhu frequently thinks and ponders upon, that will become the inclination of his mind. If he frequently thinks and ponders upon thoughts of renunciation, he has abandoned the thought of sensual desire to cultivate the thought of renunciation, and then his mind inclines to thoughts of renunciation. If he frequently thinks and ponders upon thoughts of non-ill will … upon thoughts of non-cruelty, he has abandoned the thought of cruelty to cultivate the thought of non-cruelty, and then his mind inclines to thoughts of non-cruelty.",
    "mn19:9": "\"Tireless energy was aroused in me and unremitting mindfulness was established, my body was tranquil and untroubled, my mind concentrated and unified.",
    "mn19:10": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the recollection of past lives.Explained in detail at Vsm XIII, 13–71.I recollected my manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion: ‘There I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared elsewhere; and there too I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared here.’ Thus with their aspects and particulars I recollected my manifold past lives.",
    "mn19:11": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the passing away and reappearance of beings.Explained in detail at Vsm XIII, 72–101.With the divine eye, which is purified and surpasses the human, I saw beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate. I understood how beings pass on according to their actions thus: ‘These worthy beings who were ill conducted in body, speech, and mind, revilers of noble ones, wrong in their views, giving effect to wrong view in their actions, on the dissolution of the body, after death, have reappeared in a state of deprivation, in a bad destination, in perdition, even in hell; but these worthy beings who were well conducted in body, speech, and mind, not revilers of noble ones, right in their views, giving effect to right view in their actions, on the dissolution of the body, after death, have reappeared in a good destination, even in the heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, I saw beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and I understood how beings pass on according to their actions.",
    "mn19:12": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the destruction of the taints. I directly knew as it actually is: ‘This is suffering’; I directly knew as it actually is: ‘This is the origin of suffering’; I directly knew as it actually is: ‘This is the cessation of suffering’; I directly knew as it actually is: ‘This is the way leading to the cessation of suffering.’ I directly knew as it actually is: ‘These are the taints’; I directly knew as it actually is: ‘This is the origin of the taints’; I directly knew as it actually is: ‘This is the cessation of the taints’; I directly knew as it actually is: ‘This is the way leading to the cessation of the taints.’MA: Having shown the Four Noble Truths in their own nature (that is, in terms of suffering), the passage on the taints is stated to show them indirectly by way of the defilements.",
    "mn19:13": "\"Suppose, bhikkhus, that in a wooded raṅge there was a great low-lying marsh near which a large herd of deer lived. Then a man appeared desiring their ruin, harm, and bondage, and he closed off the safe and good path to be traveled joyfully, and he opened up a false path, and he put out a decoy and set up a dummy so that the large herd of deer might later come upon calamity, disaster, and loss. But another man came desiring their good, welfare, and protection, and he reopened the safe and good path that led to their happiness, and he closed off the false path, and he removed the decoy and destroyed the dummy, so that the large herd of deer might later come to growth, increase, and fulfilment.",
    "mn19:14": "\"Bhikkhus, I have given this simile in order to convey a meaning. This is the meaning: ‘The great low-lying marsh’ is a term for sensual pleasures. ‘The large herd of deer’ is a term for beings. ‘The man desiring their ruin, harm, and bondage’ is a term for Māra the Evil One. ‘The false path’ is a term for the wrong eightfold path, that is: wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, and wrong concentration. ‘The decoy’ is a term for delight and lust. ‘The dummy’ is a term for ignorance. ‘The man desiring their good, welfare, and protection’ is a term for the Tathāgata, accomplished and fully enlightened. ‘The safe and good path to be traveled joyfully’ is a term for the Noble Eightfold Path, that is: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration.",
    "mn19:15": "\"So, bhikkhus, the safe and good path to be traveled joyfully has been reopened by me, the wrong path has been closed off, the decoy removed, the dummy destroyed.",
    "mn19:16": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}