{
    "mn22:1": "Thus have I heard.[n.248] This sutta with a fine introduction and detailed notes is available in a translation by Nyanaponika Thera,The Discourse on the Snake Simile.On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn22:2": "Several bhikkhus, having heard about this, went to the bhikkhu Ariṭṭha and asked him: \"Friend Ariṭṭha, is it true that such a pernicious view has arisen in you?\"",
    "mn22:3–7": "Then these bhikkhus, desiring to detach him from that pernicious view, pressed and questioned and cross-questioned him thus: \"Friend Ariṭṭha, do not say so. Do not misrepresent the Blessed One; it is not good to misrepresent the Blessed One. The Blessed One would not speak thus. For in many ways the Blessed One has stated how obstructive things are obstructions, and how they are able to obstruct one who engages in them. The Blessed One has stated that sensual pleasures provide little gratification, much suffering and despair, and that the danger in them is still more.[n.250] The first seven similes for sense pleasures are expanded upon atMN 54.14–35. With the simile of the skeleton … with the simile of the piece of meat … with the simile of the grass torch … with the simile of the pit of coals … with the simile of the dream … with the simile of the borrowed goods … with the simile of fruits on a tree … with the simile of the butcher's knife and block … with the simile of the sword stake … with the simile of the snake's head, the Blessed One has stated that sensual pleasures provide little gratification, much suffering and despair, and that the danger in them is still more.ʺ",
    "mn22:8": "Yet although pressed and questioned and cross-questioned by those bhikkhus in this way, the bhikkhu Ariṭṭha, formerly of the vulture killers, still obstinately adhered to that pernicious view and continued to insist upon it. Since the bhikkhus were unable to detach him from that pernicious view, they went to the Blessed One, and after paying homage to him, they sat down at one side and told him all that had occurred, adding: \"Venerable sir, since we could not detach the bhikkhu Ariṭṭha, formerly of the vulture killers, from this pernicious view, we have reported this matter to the Blessed One.\"",
    "mn22:9": "Then the Blessed One addressed a certain bhikkhu thus: \"Come, bhikkhu, tell the bhikkhu Ariṭṭha, formerly of the vulture killers, in my name that the Teacher calls him.\" — \"Yes, venerable sir,\" he replied, and he went to the bhikkhu Ariṭṭha and told him: \"The Teacher calls you, friend Ariṭṭha.\"",
    "mn22:10": "\"Misguided man, to whom have you ever known me to teach the Dhamma in that way? Misguided man, have I not stated in many ways how obstructive things are obstructions, and how they are able to obstruct one who engages in them? I have stated that sensual pleasures provide little gratification, much suffering and despair, and that the danger in them is still more. With the simile of the skeleton … with the simile of the piece of meat … with the simile of the grass torch … with the simile of the pit of coals … with the simile of the dream … with the simile of the borrowed goods … with the simile of fruits on a tree … with the simile of the butcher's knife and block … with the simile of the sword stake … with the simile of the snake's head, I have stated that sensual pleasures provide little gratification, much suffering and despair, and that the danger in them is still more. But you, misguided man, by your wrong grasp have misrepresented us, injured yourself, and stored up much demerit; for this will lead to your harm and suffering for a long time.ʺ[n.251] This first part of the Ariṭṭha episode occurs twice in the Vinaya Pịaka. AtVin ii.25it leads to the Saṅgha announcing an act of suspension(ukkhepaniyakamma)against Ariṭṭha for refusing to give up his wrong view. At Vin iv.133–34 his refusal to give up his wrong view after repeated admonitions is defined as a monastic offence of the Pācittiya class.",
    "mn22:11": "Then the Blessed One addressed the bhikkhus thus: \"Bhikkhus, what do you think? Has this bhikkhu Ariṭṭha, formerly of the vulture killers, kindled even a spark of wisdom in this Dhamma and Discipline?\"",
    "mn22:12": "Then the Blessed One addressed the bhikkhus thus: \"Bhikkhus, do you understand the Dhamma taught by me as this bhikkhu Ariṭṭha, formerly of the vulture killers, does when by his wrong grasp he misrepresents us, injures himself and stores up much demerit?\"",
    "mn22:13": "\" Good, bhikkhus. It is good that you understand the Dhamma taught by me thus. For in many ways I have stated how obstructive things are obstructions, and how they are able to obstruct one who engages in them.",
    "mn22:14": "I have stated that sensual pleasures provide little gratification, much suffering and despair, and that the danger in them is still more. With the simile of the skeleton … with the simile of the snake's head, I have stated … that the danger in them is still more. But this bhikkhu Ariṭṭha, formerly of the vulture killers, by his wrong grasp misrepresents us, injures himself, and stores up much demerit; for this will lead to this misguided man's harm and suffering for a long time.",
    "mn22:15": "\"Here, bhikkhus, some misguided men learn the Dhamma — discourses, stanzas, expositions, verses, exclamations, sayings, birth stories, marvels, and answers to questions — but having learned the Dhamma, they do not examine the meaning of those teachings with wisdom. Not examining the meaning of those teachings with wisdom, they do not gain a reflective acceptance of them. Instead they learn the Dhamma only for the sake of criticising others and for winning in debates, and they do not experience the good for the sake of which they learned the Dhamma. Those teachings, being wrongly grasped by them, conduce to their harm and suffering for a long time.[n.253]MAexplains that this passage is stated in order to show the fault in wrongly motivated acquisition of intellectual knowledge of the Dhamma — apparently the pitfall into which Ariṭṭha fell. The \"good(attha)for the sake of which they learned the Dhamma\" is the paths and fruits.Why is that? Because of the wrong grasp of those teachings.",
    "mn22:16": "\"Suppose a man needing a snake, seeking a snake, wandering in search of a snake, saw a large snake and grasped its coils or its tail. It would turn back on him and bite his hand or his arm or one of his limbs, and because of that he would come to death or deadly suffering. Why is that? Because of his wrong grasp of the snake. So too, here some misguided men learn the Dhamma … Why is that? Because of the wrong grasp of those teachings.",
    "mn22:17": "\"Here, bhikkhus, some clansmen learn the Dhamma — discourses … answers to questions — and having learned the Dhamma, they examine the meaning of those teachings with wisdom. Examining the meaning of those teachings with wisdom, they gain a reflective acceptance of them. They do not learn the Dhamma for the sake of criticising others and for winning in debates, and they experience the good for the sake of which they learned the Dhamma. Those teachings, being rightly grasped by them, conduce to their welfare and happiness for a long time. Why is that? Because of the right grasp of those teachings.",
    "mn22:18": "\"Suppose a man needing a snake, seeking a snake, wandering in search of a snake, saw a large snake and caught it rightly with a cleft stick, and having done so, grasped it rightly by the neck. Then although the snake might wrap its coils round his hand or his arm or his limbs, still he would not come to death or deadly suffering because of that. Why is that? Because of his right grasp of the snake. So too, here some clansmen learn the Dhamma … Why is that? Because of the right grasp of those teachings.",
    "mn22:19": "\"Bhikkhus, I shall show you how the Dhamma is similar to a raft, being for the purpose of crossing over, not for the purpose of grasping.[n.254] This famous \"simile of the raft\" continues the same argument against misuse of learning introduced by the simile of the snake. One who is preoccupied with using the Dhamma to stir up controversy and win debates carries the Dhamma around on his head instead of using it to cross the flood.Listen and attend closely to what I shall say.\" — \"Yes, venerable sir,\" the bhikkhus replied. The Blessed One said this:",
    "mn22:20": "\"Bhikkhus, suppose a man in the course of a journey saw a great expanse of water, whose near shore was dangerous and fearful and whose further shore was safe and free from fear, but there was no ferryboat or bridge for going to the far shore. Then he thought: ‘There is this great expanse of water, whose near shore is dangerous and fearful and whose further shore is safe and free from fear, but there is no ferryboat or bridge for going to the far shore. Suppose I collect grass, twigs, branches, and leaves and bind them together into a raft, and supported by the raft and making an effort with my hands and feet, I got safely across to the far shore.’ And then the man collected grass, twigs, branches, and leaves and bound them together into a raft, and supported by the raft and making an effort with his hands and feet, he got safely across to the far shore. Then, when he had got across and had arrived at the far shore, he might think thus: ‘This raft has been very helpful to me, since supported by it and making an effort with my hands and feet, I got safely across to the far shore. Suppose I were to hoist it on my head or load it on my shoulder, and then go wherever I want.’ Now, bhikkhus, what do you think? By doing so, would that man be doing what should be done with that raft?\"",
    "mn22:21": "\"No, venerable sir.\"",
    "mn22:22": "\"Bhikkhus, there are these six standpoints for views.[n.256] This section evidently has the purpose of forestalling another type of misconception and misrepresentation of the Dhamma, i.e., the introduction of a view of self into the teaching. According to MA, standpoints for views(diṭṭhiṭṭhāna)are wrong views themselves as grounds for other more elaborate wrong views; the objects of views, i.e., the five aggregates; and the conditions for views, i.e., such factors as ignorance, perverted perception, and false thoughts, etc.What are the six? Here, bhikkhus, an untaught ordinary person, who has no regard for noble ones and is unskilled and undisciplined in their Dhamma, who has no regard for true men and is unskilled and undisciplined in their Dhamma, regards material form thus: ‘This is mine, this I am, this is my self.ʹ[n.257]MAstates that the notion \"this is mine\" is induced by craving, the notion \"this I am\" by conceit, and the notion \"this is my self\" by wrong views. These three — craving, conceit, and views — are called the three obsessions(gāha). They are also the mainsprings behind conceiving (MN 1) and mental proliferation (MN 18).He regards feeling thus: ‘This is mine, this I am, this is my self.’ He regards perception thus: ‘This is mine, this I am, this is my self.’ He regards formations thus: ‘This is mine, this I am, this is my self.’ He regards what is seen, heard, sensed, cognized, encountered, sought, mentally pondered thus: ‘This is mine, this I am, this is my self.ʹ[n.258] This series of terms shows the aggregate of consciousness indirectly, by way of its object. The \"seen\" points to eye-consciousness, the \"heard\" to ear-consciousness, the \"sensed\" to the other three kinds of sense consciousness, and the remaining terms to mind-consciousness.And this standpoint for views, namely, ‘That which is the self is the world; after death I shall be permanent, everlasting, eternal, not subject to change; I shall endure as long as eternity’ — this too he regards thus: ‘This is mine, this I am, this is my self.ʹ[n.259] This is a full-fledged eternalist view arisen on the basis of one of the earlier, more rudimentary types of personality view; here it becomes itself an object of craving, conceit, and the false view of self. This view seems to reflect the philosophy of the Upanishads, which assert the identity of the individual self(ātman)with the universal spirit(brahman), though it is difficult to determine on the basis of the texts whether the Buddha was personally acquainted with the early Upanishads themselves.",
    "mn22:23": "\"Bhikkhus, a well-taught noble disciple who has regard for noble ones and is skilled and disciplined in their Dhamma, who has regard for true men and is skilled and disciplined in their Dhamma, regards material form thus: ‘This is not mine, this I am not, this is not my self.’ He regards feeling thus: ‘This is not mine, this I am not, this is not my self.’ He regards perception thus: ‘This is not mine, this I am not, this is not my self.’ He regards formations thus: ‘This is not mine, this I am not, this is not my self.’ He regards what is seen, heard, sensed, cognized, encountered, sought, mentally pondered thus: ‘This is not mine, this I am not, this is not my self.’ And this standpoint for views, namely, ‘That which is the self is the world; after death I shall be permanent, everlasting, eternal, not subject to change; I shall endure as long as eternity’ — this too he regards thus: ‘This is not mine, this I am not, this is not my self.’",
    "mn22:24": "When this was said, a certain bhikkhu asked the Blessed One: \"Venerable sir, can there be agitation about what is non-existent externally?\"",
    "mn22:25": "\"Venerable sir, can there be no agitation about what is non-existent externally?\"",
    "mn22:26": "\"Venerable sir, can there be agitation about what is non-existent internally?\"",
    "mn22:27": "\"Venerable sir, can there be no agitation about what is non-existent internally?\"",
    "mn22:28": "\"Bhikkhus, you may well acquire that possession that is permanent, everlasting, eternal, not subject to change, and that might endure as long as eternity.[n.261]Pariggahaṁ parigaṇheyyātha,lit. \"you may possess that possession.\" This links up with verse 18 on agitation about external possessions, see n.176. This passage links up with §20 on agitation arising from a view of self.But do you see any such possession, bhikkhus?\" — \"No, venerable sir.\" — \"Good, bhikkhus. I too do not see any possession that is permanent, everlasting, eternal, not subject to change, and that might endure as long as eternity.",
    "mn22:29": "\"Bhikkhus, you may well cling to that doctrine of self that would not arouse sorrow, lamentation, pain, grief, and despair in one who clings to it.[n.262]Attavādupādānaṁ upādiyetha,lit. \"you may cling to that clinging to a doctrine of self.\" On the problem this idiom involves for translation, seen.176.This passage links up with verse 20 on agitation arising from a view of self.But do you see any such doctrine of self, bhikkhus?\" — \"No, venerable sir.\" — \"Good, bhikkhus. I too do not see any doctrine of self that would not arouse sorrow, lamentation, pain, grief, and despair in one who clings to it.",
    "mn22:30": "\"Bhikkhus, you may well take as a support that view that would not arouse sorrow, lamentation, pain, grief, and despair in one who takes it as a support.[n.263] The support of views(diṭṭhinissaya), according toMA,is the sixty-two views mentioned in theBrahmajāla Sutta(DN 1), which emerge from personality view or \"doctrine of a self.\" It might also include the pernicious view adopted by Ariṭṭha at the beginning of the sutta.But do you see any such support of views, bhikkhus?\" — \"No, venerable sir.\" — \"Good, bhikkhus. I too do not see any support of views that would not arouse sorrow, lamentation, pain, grief, and despair in one who takes it as a support.",
    "mn22:31": "\"Bhikkhus, there being a self, would there be for me what belongs to a self?\"[n.264] The notion \"what belongs to self\" or \"self's property\"(attaniya)is ascribed to whichever among the five aggregates are not identified as self, as well as to all the individual's external possessions. This passage shows the mutual dependence, and thus the equal untenability, of the twin notions \"I\" and \"mine.\"",
    "mn22:32": "\"Yes, venerable sir.\"",
    "mn22:33": "\"Or, there being what belongs to a self, would there be for me a self?\" — \"Yes, venerable sir.\"",
    "mn22:34": "\"Bhikkhus, since a self and what belongs to a self are not apprehended as true and established, then this standpoint for views, namely, ‘That which is the self is the world; after death I shall be permanent, everlasting, eternal, not subject to change; I shall endure as long as eternity’ — would it not be an utterly and completely foolish teaching?\"",
    "mn22:35": "\"What else could it be, venerable sir, but an utterly and completely foolish teaching?\"",
    "mn22:36": "\"Bhikkhus, what do you think? Is material form permanent or impermanent?\"",
    "mn22:37": "\"Impermanent, venerable sir.\"",
    "mn22:38": "\"Is what is impermanent suffering or happiness?\"",
    "mn22:39": "\"Suffering, venerable sir.\"",
    "mn22:40": "\"Is what is impermanent, suffering, and subject to change, fit to be regarded thus: ‘This is mine, this I am, this is my self’?\"",
    "mn22:41": "\"No, venerable sir.\"",
    "mn22:42": "\"Bhikkhus, what do you think? Is feeling … Is perception … Are formations … Is consciousness permanent or impermanent?\"",
    "mn22:43": "\"Impermanent, venerable sir.\"",
    "mn22:44": "\"Is what is impermanent suffering or happiness?\"",
    "mn22:45": "\"Suffering, venerable sir.\"",
    "mn22:46": "\"Is what is impermanent, suffering, and subject to change, fit to be regarded thus: ‘This is mine, this I am, this is my self’?\"",
    "mn22:47": "\"No, venerable sir.\"",
    "mn22:48": "\"Therefore, bhikkhus, any kind of material form whatever, whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near, all material form should be seen as it actually is with proper wisdom thus: ‘This is not mine, this I am not, this is not my self.’ Any kind of feeling whatever … Any kind of perception whatever … Any kind of formations whatever … Any kind of consciousness whatever, whether past, future, or present, internal or external, gross or subtle, inferior or superior, far or near, all consciousness should be seen as it actually is with proper wisdom thus: ‘This is not mine, this I am not, this is not my self.’",
    "mn22:49": "\"Seeing thus, bhikkhus, a well-taught noble disciple becomes disenchanted with material form, disenchanted with feeling, disenchanted with perception, disenchanted with formations, disenchanted with consciousness.",
    "mn22:50": "\"And how is the bhikkhu one whose cross-bar has been lifted? Here the bhikkhu has abandoned ignorance, has cut it off at the root, made it like a palm stump, done away with it, so that it is no longer subject to future arising. That is how the bhikkhu is one whose cross-bar has been lifted.",
    "mn22:51": "\"And how is the bhikkhu one whose trench has been filled in? Here the bhikkhu has abandoned the round of births that brings renewed being, has cut it off at the root … so that it is no longer subject to future arising. That is how the bhikkhu is one whose trench has been filled in.",
    "mn22:52": "\"And how is the bhikkhu one whose pillar has been uprooted? Here the bhikkhu has abandoned craving, has cut it off at the root … so that it is no longer subject to future arising. That is how the bhikkhu is one whose pillar has been uprooted.",
    "mn22:53": "\"And how is the bhikkhu one who has no bolt? Here the bhikkhu has abandoned the five lower fetters, has cut them off at the root … so that they are no longer subject to future arising. That is how the bhikkhu is one who has no bolt.",
    "mn22:54": "\"And how is the bhikkhu a noble one whose banner is lowered, whose burden is lowered, who is unfettered? Here a bhikkhu has abandoned the conceit ‘I am,’ has cut it off at the root … so that it is no longer subject to future arising. That is how the bhikkhu is a noble one whose banner is lowered, whose burden is lowered, who is unfettered.",
    "mn22:55": "\"Bhikkhus, when the gods with Indra, with Brahmā and with Pajāpati seek a bhikkhu who is thus liberated in mind, they do not findanything of which they could say: ‘The consciousness of one thus gone is supported by this.’ Why is that? One thus gone, I say, is untraceable here and now.[n.266] \"Thus gone\" is, in Pali,tathāgata,the usual epithet of the Buddha, but here applied more broadly to the arahant.MAinterprets this passage in two alternative ways thus: (1) The arahant even while alive is here and now untraceable as a being or individual (in the sense of an abiding self) because in the ultimate sense there is no being (as self). (2) The arahant is untraceable here and now because it is impossible for the gods, etc., to find the support for his insight-mind, path-mind, or fruition-mind(vipassanācitta, maggacitta, phalacitta); that is, the object being Nibbāna, his mind cannot be known by the worldling.",
    "mn22:55a": "\"So saying, bhikkhus, so proclaiming, I have been baselessly, vainly, falsely, and wrongly misrepresented by some recluses and brahmins thus: ‘The recluse Gotama is one who leads astray; he teaches the annihilation, the destruction, the extermination of an existing being.’[n.267] This refers back to §20, where the eternalist misunderstands the Buddha’s teaching on Nibbāna, the cessation of being, to involve the annihilation of an existing being considered as self.As I am not, as I do not proclaim, so have I been baselessly, vainly, falsely, and wrongly misrepres ented by some recluses and brahmins thus: ‘The recluse Gotama is one who leads astray; he teaches the annihilation, the destruction, the extermination of an existing being.’",
    "mn22:56": "\"Bhikkhus, both formerly and now what I teach is suffering and the cessation of suffering.[n.268] The import of this statement is deeper than appears on the surface. In the context of the false accusations of §55a, the Buddha is stating that he teaches that a living being is not a self but a mere conglomeration of factors, material and mental events, linked together in a process that is inherentlydukkha,and that Nibbāna, the cessation of suffering, is not the annihilation of a being but the termination of that same unsatisfactory process. This statement should be read in conjunction withSN 12:15/ii.17, where the Buddha says that one with right view, who has discarded all doctrines of a self, sees that whatever arises is onlydukkhaarising, and whatever ceases is only dukkha ceasing.If others abuse, revile, scold, and harass the Tathāgata for that, the Tathāgata on that account feels no annoyance, bitterness, or dejection of the heart. And if others honour, respect, revere, and venerate the Tathāgata for that, the Tathāgata on that account feels no delight, joy, or elation of the heart. If others honour, respect, revere, and venerate the Tathāgata for that, the Tathāgata on that account thinks thus: ‘They perform such services as these for me in regard to this which earlier was fully understood.ʹ[n.269] \"What earlier was fully understood\"(pubbe pariññātaṁ)are the five aggregates. Since it is only these to which honour and abuse are shown, not an \"I\" or self, there is no reason for elation or dejection.",
    "mn22:57": "\"Therefore, bhikkhus, whatever is not yours, abandon it; when you have abandoned it, that will lead to your welfare and happiness for a long time. What is it that is not yours? Material form is not yours. Abandon it. When you have abandoned it, that will lead to your welfare and happiness for a long time. Feeling is not yours. Abandon it. When you have abandoned it, that will lead to your welfare and happiness for a long time. Perception is not yours. Abandon it. When you have abandoned it, that will lead to your welfare and happiness for a long time. Formations are not yours. Abandon them. When you have abandoned them, that will lead to your welfare and happiness for a long time. Consciousness is not yours. Abandon it. When you have abandoned it, that will lead to your welfare and happiness for a long time.[n.270]MApoints out that it is the attachment to the five aggregates that should be abandoned; the aggregates themselves cannot be torn apart or pulled out.",
    "mn22:58": "\"Bhikkhus, the Dhamma well proclaimed by me thus is clear, open, evident, and free of patchwork.[n.271]MA:\"Chinna-pilotika: pilotikāis a torn and worn-out rag stitched and knotted here and there; there is nothing (in the Dhamma) like this — torn, worn-out, stitched and knotted by way of hypocrisy and other deceptions.\"In the Dhamma well proclaimed by me thus, which is clear, open, evident, and free of patchwork, there is nofutureround for manifestation in the case of thosebhikkhus who are arahants with taints destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached their own goal, destroyed the fetters of being, and are completely liberated through final knowledge.[n.272] That is, as the arahants have achieved deliverance from the entire round of existence, it is impossible to point to any plane within the round where they might be reborn.",
    "mn22:59": "\"Bhikkhus, the Dhamma well proclaimed by me thus is clear … free of patchwork. In the Dhamma well proclaimed by me thus, which is clear … free of patchwork, those bhikkhus who have abandoned the five lower fetters are all due to reappear spontaneouslyin the Pure Abodesand there attain final Nibbāna, without ever returning from that world.",
    "mn22:60": "\"Bhikkhus, the Dhamma well proclaimed by me thus is clear … free of patchwork. In the Dhamma well proclaimed by me thus, which is clear … free of patchwork, those bhikkhus who have abandoned three fetters and attenuated lust, hate, and delusion are all once-returners, returning once to this world to make an end of suffering.",
    "mn22:61": "\"Bhikkhus, the Dhamma well proclaimed by me thus is clear … free of patchwork. In the Dhamma well proclaimed by me thus, which is clear … free of patchwork, those bhikkhus who have abandoned three fetters are all stream-enterers, no longer subject to perdition, boundfor deliveranceand headed for enlightenment.",
    "mn22:62": "\"Bhikkhus, the Dhamma well proclaimed by me thus is clear … free of patchwork. In the Dhamma well proclaimed by me thus, which is clear … free of patchwork, those bhikkhus who are Dhamma-followers or faith-followers are all headed for enlightenment.[n.273] These are two classes of individuals standing on the path of stream-entry. \"Dhamma-followers\"(dhammānusārin)are disciples in whom the faculty of wisdom(paññindriya)is predominant and who develop the noble path with wisdom in the lead; when they attain the fruit they are called \"attained-to-view\"(diṭṭi). \"Faith-followers\"(saddhānusārin)are disciples in whom the faculty of faith(saddhindriya)is predominant and who develop the noble path with faith in the lead; when they attain the fruit they are called \"liberated-by-faith\"(saddhāvimutta). SeeMN 70.20, 21; also Pug 1:35–36/15 and Vsm XXI, 75.",
    "mn22:63": "\"Bhikkhus, the Dhamma well proclaimed by me thus is clear, open, evident, and free of patchwork. In the Dhamma well proclaimed by me thus, which is clear, open, evident, and free of patchwork, those who have sufficient faith in me, sufficient love for me, are all headed for heaven.\"[n.274]MAsays that this refers to persons devoted to the practice of insight meditation who have not reached any supramundane attainment. Note that they are headed only for heaven, not for enlightenment, though if their practice matures they can attain the path of stream-entry and thus gain assurance of enlightenment. The expressionsaddhāmattaṁ pemamattaṁmight be rendered \"simply faith, simply love\" or \"mere faith, mere love\" (as it sometimes is), but this could not explain the guarantee of rebirth in heaven. It therefore seems obligatory to take the suffix matta here as implying a requisite amount of faith and love, not simple possession of these qualities.",
    "mn22:64": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}