{
    "mn23:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. Now on that occasion the venerable Kumāra Kassapa was living in the Blind Men's Grove.[n.275] Ven. Kumāra Kassapa was an adopted son of King Pasenadi of Kosala, born of a woman who, not knowing she was pregnant, had gone forth as a bhikkhunī after having conceived him. At the time this sutta was delivered he was still asekha;he attained arahantship using this sutta as his subject of meditation.",
    "mn23:2": "\"Bhikkhu, bhikkhu, this ant-hill fumes by night and flames by day.[n.77] The meaning of the deity's imagery will be explained later on in the sutta itself.",
    "mn23:3": "\"Bhikkhu, you should go to the Blessed One and ask him about this riddle. As the Blessed One tells you, so should you remember it. Bhikkhu, other than the Tathāgata or a disciple of the Tathāgata or one who has learned it from them, I see no one in this world with its gods, its Māras, and its Brahmās, in this generation with its recluses and brahmins, its princes and its people, whose explanation of this riddle might satisfy the mind.\"",
    "mn23:4": "Then, when the night was over, the venerable Kumāra Kassapa went to the Blessed One. After paying homage to him, he sat down at one side and told the Blessed One what had occurred. Then he asked: \"Venerable sir, what is the ant-hill, what the fuming by night, what the flaming by day? Who is the brahmin, who the wise one? What is the knife, what the delving, what the bar, what the toad, what the fork, what the sieve, what the tortoise, what the butcher's knife and block, what the piece of meat, what the Nāga serpent?\"",
    "mn23:5": "\"Bhikkhu, the ant-hill is a symbol for this body, made of material form, consisting of the four great elements, procreated by a mother and father, built up out of boiled rice and porridge,[n.278]Kummāsa:The Vinaya and commentaries explain it as something made of yava, barley. Ñm had translated the word as bread, but fromMN 82.18it is clear thatkummāsais viscous and spoils overnight.PEDdefines it as junket; Horner translates it as \"sour milk.\"and subject to impermanence, to being worn and rubbed away, to dissolution and disintegration.",
    "mn23:6": "\"What one thinks and ponders by night based upon one's actions during the day is the ‘fuming by night.’",
    "mn23:7": "\"The brahmin is a symbol for the Tathāgata, accomplished and fully enlightened. The wise one is a symbol for a bhikkhu in higher training.",
    "mn23:8": "The knife is a symbol for noble wisdom. The delving is a symbol for the arousing of energy.",
    "mn23:9": "\"The bar is a symbol for ignorance.[n.27]MA:Just as a bar across the entrance to a city prevents people from entering it, so ignorance prevents people from attaining Nibbāna.‘Throw out the bar: abandon ignorance. Delve with the knife, thou wise one.’ This is the meaning.",
    "mn23:10": "\"The toad is a symbol for anger and irritation. ‘Throw out the toad: abandon anger and irritation. Delve with the knife, thou wise one.’ This is the meaning.",
    "mn23:11": "\"The fork is a symbol for doubt.[n.280]Dvedhāpathamight also have been rendered \"a forked path,\" an obvious symbol for doubt.‘Throw out the fork: abandon doubt. Delve with the knife, thou wise one.’ This is the meaning.",
    "mn23:12": "\"The sieve is a symbol for the five hindrances, namely, the hindrance of sensual desire, the hindrance of ill will, the hindrance of sloth and torpor, the hindrance of restlessness and remorse, and the hindrance of doubt. ‘Throw out the sieve: abandon the five hindrances. Delve with the knife, thou wise one.’ This is the meaning.",
    "mn23:13": "\"The tortoise is a symbol for the five aggregates affected by clinging’[n.281]MAstates that the four feet and head of a tortoise are similar to the five aggregates.namely, the material form aggregate affected by clinging, the feeling aggregate affected by clinging, the perception aggregate affected by clinging, the formations aggregate affected by clinging, and the consciousness aggregate affected by clinging. ‘Throw out the tortoise: abandon the five aggregates affected by clinging. Delve with the knife, thou wise one.’ This is the meaning.",
    "mn23:14": "\"The butcher's knife and block is a symbol for the five cords of sensual pleasure[n.282]MA:Beings desiring sensual enjoyments are chopped up by the butcher's knife of sensual desires upon the block of sense objects.— forms cognizable by the eye that are wished for, desired, agreeable, and likeable, connected with sensual desire, and provocative of lust; sounds cognizable by the ear … odours cognizable by the nose … flavours cognizable by the tongue … tangibles cognizable by the body that are wished for, desired, agreeable, and likeable, connected with sensual desire, and provocative of lust. ‘Throw out the butcher's knife and block: abandon the five cords of sensual pleasure. Delve with the knife, thou wise one.’ This is the meaning.",
    "mn23:15": "\"The piece of meat is a symbol for delight and lust.[n.283] The symbolism is explicated atMN 54.16.‘Throw out the piece of meat: abandon delight and lust. Delve with the knife, thou wise one.’ This is the meaning.",
    "mn23:16": "\"The Nāga serpent is a symbol for a bhikkhu who has destroyed the taints .[n.284] This is an arahant. For the symbolism, seen.75.‘Leave the Nāga serpent; do not harm the Nāga serpent; honour the Nāga serpent.’ This is the meaning.\"",
    "mn23:17": "That is what the Blessed One said. The venerable Kumāra Kassapa was satisfied and delighted in the Blessed One's words."
}