{
    "mn31:1": "Thus have I heard. On one occasion the Blessed One was living at Nādikā in the Brick House.",
    "mn31:2": "The venerable Anuruddha heard the park keeper speaking to the Blessed One and told him: \"Friend park keeper, do not keep the Blessed One out. It is our Teacher, the Blessed One, who has come.\" Then the venerable Anuruddha went to the venerable Nandiya and the venerable Kimbila and said: \"Come out, venerable sirs, come out! Our Teacher, the Blessed One, has come.\"",
    "mn31:3": "\"I hope you are all keeping well, Anuruddha, I hope you are all comfortable, I hope you are not having any trouble getting almsfood.\"",
    "mn31:4–5": "The venerable Nandiya and the venerable Kimbila each spoke likewise, adding: \"That is how, venerable sir, we are living in concord, with mutual appreciation, without disputing, blending like milk and water, viewing each other with kindly eyes.\"",
    "mn31:6": "\"Good, good, Anuruddha. I hope that you all abide diligent, ardent, and resolute.\"",
    "mn31:7": "\"Good, good, Anuruddha. But while you abide thus diligent, ardent, and resolute, have you attained any superhuman state, a distinction in knowledge and vision worthy of the noble ones, a comfortable abiding?\"",
    "mn31:8": "\"Good, good, Anuruddha. But is there any other superhuman state, a distinction in knowledge and vision worthy of the noble ones, a comfortable abiding, which you have attained by surmounting that abiding, by making that abiding subside?\"",
    "mn31:9": "\"Good, good, Anuruddha. But is there any other superhuman state … which you have attained by surmounting that abiding, by making that abiding subside?\"",
    "mn31:10–12": "\"Good, good, Anuruddha. But is there any other superhuman state … which you have attained by surmounting that abiding, by making that abiding subside?\"",
    "mn31:13": "\"Good, good Anuruddha. But is there any other superhuman state, a distinction in knowledge and vision worthy of the noble ones, a comfortable abiding, which you have attained by surmounting that abiding, by making that abiding subside?\"",
    "mn31:14": "Then, when the Blessed One had instructed, urged, roused, and gladdened the venerable Anuruddha, the venerable Nandiya, and the venerable Kimbila with a talk on the Dhamma, he rose from his seat and departed.",
    "mn31:15": "Then the spirit Dīgha Parajana[n.356]MAidentifies thisyakkhaas a celestial king(devarāja)included among the twenty-eight commanders of the yakkhas mentioned at DN 32.13.went to the Blessed One. After paying homage to the Blessed One, he stood at one side and said: \"It is a gain for the Vajjians, venerable sir, a great gain for the Vajjian people that the Tathāgata, accomplished and fully enlightened, dwells among them and these three clansmen, the venerable Anuruddha, the venerable Nandiya, and the venerable Kimbila!\" On hearing the exclamation of the spirit Dīgha Parajana, the earth gods exclaimed: \"It is a gain for the Vajjians, a great gain for the Vajjian people that the Tathāgata, accomplished and fully enlightened, dwells among them and these three clansmen, the venerable Anuruddha, the venerable Nandiya, and the venerable Kimbila!\" On hearing the exclamation of the earth gods, the gods of the heaven of the Four Great Kings … the gods of the heaven of the Thirty-three … the Yāma gods … the gods of the Tusita heaven … the gods who delight in creating … the gods who wield power over others’ creations … the gods of Brahmā's retinue exclaimed: \"It is a gain for the Vajjians, a great gain for the Vajjian people that the Tathāgata, accomplished and fully enlightened, dwells among them and these three clansmen, the venerable Anuruddha, the venerable Nandiya, and the venerable Kimbila!\" Thus at that instant, at that moment, those venerable ones were known as far as the Brahma-world.",
    "mn31:16": "The Blessed One said:\"So it is, Dīgha, so it is! And if the clan from which those three clansmen went forth from the home life into homelessness should remember them with confident heart, that would lead to the welfare and happiness of that clan for a long time. And if the retinue of the clan from which those three clansmen went forth … the village from which they went forth … the town from which they went forth … the city from which they went forth … the country from which those three clansmen went forth from the home life into homelessness should remember them with confident heart, that would lead to the welfare and happiness of that country for a long time. If all nobles should remember those three clansmen with confident heart, that would lead to the welfare and happiness of the nobles for a long time. If all brahmins … all merchants … all workers should remember those three clansmen with confident heart, that would lead to the welfare and happiness of the workers for a long time. If the world with its gods, its Māras, and its Brahmās, this generation with its recluses and brahmins, its princes and its people, should remember those three clansmen with confident heart, that would lead to the welfare and happiness of the world for a long time. See, Dīgha, how those three clansmen are practising for the welfare and happiness of the many, out of compassion for the world, for the good, welfare and happiness of gods and humans.\"",
    "mn31:17": "That is what the Blessed One said. The spirit Dīgha Parajana was satisfied and delighted in the Blessed One's words."
}