{
    "mn36:1": "Thus have I heard. On one occasion the Blessed One was living at Vesālī in the Great Wood in the Hall with the Peaked Roof.",
    "mn36:2": "\"Master Gotama, there are some recluses and brahmins who abide pursuing development of body, but not development of mind.[n.38] It will become clear from ¶3 that Saccaka identifies \"development of body\"(kāyabhāvanā)with the practice of self-mortification. Because he does not see the Buddhist bhikkhus engaged in self-mortification, he maintains that they do not pursue development of the body. But the Buddha (according toMA) understands \"development of body\" as insight meditation, \"development of mind\"(cittabhāvanā )as serenity meditation.They are touched by bodily painful feeling. In the past, when one was touched by bodily painful feeling, one's thighs would become rigid, one's heart would burst, hot blood would gush from one's mouth, and one would go mad, go out of one's mind. So then the mind was subservient to the body, the body wielded mastery over it. Why is that? Because the mind was not developed. But there are some recluses and brahmins who abide pursuing development of mind, but not development of body. They are touched by mental painful feeling. In the past, when one was touched by mental painful feeling, one's thighs would become rigid, one's heart would burst, hot blood would gush from one's mouth, and one would go mad, go out of one's mind. So then the body was subservient to the mind, the mind wielded mastery over it. Why is that? Because the body was not developed. Master Gotama, it has occurred to me: ‘Surely Master Gotama's disciples abide pursuing development of mind, but not development of body.’\"",
    "mn36:3": "\"But, Aggivessana, what have you learned about development of body?\"",
    "mn36:4": "\"But do they subsist on so little, Aggivessana?\"",
    "mn36:5": "\"What they earlier abandoned, Aggivessana, they later gather together again. That is how there is increase and decrease of this body. But what have you learned about development of mind?\"",
    "mn36:6": "Then the Blessed One told him: \"What you have just spoken of as development of body, Aggivessana, is not development of body according to the Dhamma in the Noble One's Discipline. Since you do not know what development of body is, how could you know what development of mind is? Nevertheless, Aggivessana, as to how one is undeveloped in body and undeveloped in mind, and developed in body and developed in mind, listen and attend closely to what I shall say.\" — \"Yes, sir,\" Saccaka the Nigaṇṭha's son replied. The Blessed One said this:",
    "mn36:7": "\"How, Aggivessana, is one undeveloped in body and undeveloped in mind? Here, Aggivessana, pleasant feeling arises in an untaught ordinary person. Touched by that pleasant feeling, he lusts after pleasure and continues to lust after pleasure. That pleasant feeling of his ceases. With the cessation of the pleasant feeling, painful feeling arises. Touched by that painful feeling, he sorrows, grieves, and laments, he weeps beating his breast and becomes distraught. When that pleasant feeling has arisen in him, it invades his mind and remains because body is not developed. And when that painful feeling has arisen in him, it invades his mind and remains because mind is not developed. Anyone in whom, in this double manner, arisen pleasant feeling invades his mind and remains because body is not developed, and arisen painful feeling invades his mind and remains because mind is not developed, is thus undeveloped in body because mind is not developed, is thus undeveloped in body and undeveloped in mind.",
    "mn36:8": "\"And how, Aggivessana, is one developed in body and developed in mind? Here, Aggivessana, pleasant feeling arises in a well-taught noble disciple. Touched by that pleasant feeling, he does not lust after pleasure or continue to lust after pleasure. That pleasant feeling of his ceases. With the cessation of the pleasant feeling, painful feeling arises. Touched by that painful feeling, he does not sorrow, grieve, and lament, he does not weep beating his breast and become distraught. When that pleasant feeling has arisen in him, it does not invade his mind and remain because body is developed. And when that painful feeling has arisen in him, it does not invade his mind and remain because mind is developed. Anyone in whom, in this double manner, arisen pleasant feeling does not invade his mind and remain because body is developed, and arisen painful feeling does not invade his mind and remain because mind is developed, is thus developed in body and developed in mind.\"[n.34]MAexplains that \"development of body\" here is insight, and \"development of mind\" concentration. When the noble disciple experiences pleasant feeling, he does not become overwhelmed by it because, through his development of insight, he understands the feeling to be impermanent, unsatisfactory, and not self; and when he experiences painful feeling, he does not become overwhelmed by it because, through his development of concentration, he is able to escape from it by entering into one of the meditative absorptions.",
    "mn36:9": "\"I have confidence in Master Gotama thus: ‘Master Gotama is developed in body and developed in mind.’\"",
    "mn36:10": "\"Has there never arisen in Master Gotama a feeling so pleasant that it could invade his mind and remain? Has there never arisen in Master Gotama a feeling so painful that it could invade his mind and remain?\"",
    "mn36:11": "\"Why not, Aggivessana?[n.385] Now the Buddha will answer Saccaka's questions by showing first the extremely painful feelings he experienced during his course of ascetic practices, and thereafter the extremely pleasant feelings he experienced during his meditative attainments preceding his enlightenment.Here, Aggivessana, before my enlightenment, while I was still only an unenlightened Bodhisatta, I thought: ‘Household life is crowded and dusty; life gone forth is wide open. It is not easy, while living in a home, to lead the holy life utterly perfect and pure as a polished shell. Suppose I shave off my hair and beard, put on the yellow robe, and go forth from the home life into homelessness.’",
    "mn36:12": "Then I went to Āḷāra Kālāma and asked him: ‘Friend Kālāma, in what way do you declare that by realising for yourself with direct knowledge you enter upon and abide in this Dhamma?’ In reply he declared the base of nothingness.[n.a]MA:He taught him the seven attainments (of serenity meditation) ending in the base of nothingness, the third of the four immaterial attainments. Though these attainments are spiritually exalted, they are still mundane and not in themselves directly conducive to Nibbāna.",
    "mn36:13": "Then I went to Āḷāra Kālāma and asked him:",
    "mn36:14": "\"Still in search, Aggivessana, of what is wholesome, seeking the supreme state of sublime peace, I went to Uddaka Rāmaputta and said to him: ‘Friend, I want to lead the holy life in this Dhamma and Discipline.ʹ[n.c] Both Horner inMLSand Ñm in Ms err in their translations of the account of the Bodhisatta's meeting with Uddaka Rāmaputta by assuming that Uddaka is identical with Rāma. However, as his name indicates, Uddaka was the son(putta)of Rāma, who must have already passed away before the Bodhisatta arrived on the scene. It should be noted that all references to Rāma are in the past tense and the third person, and that Uddaka in the end places the Bodhisatta in the position of teacher. Though the text does not allow for definite conclusions, this suggests that he himself had not yet reached the fourth immaterial attainment.Uddaka Rāmaputta replied: ‘The venerable one may stay here. This Dhamma is such that a wise man can soon enter upon and abide in it, himself realising through direct knowledge his own teacher's doctrine.’ I soon quickly learned that Dhamma. As far as mere lip-reciting and rehearsal of his teaching went, I could speak with knowledge and assurance, and I claimed, ‘I know and see’ — and there were others who did likewise.\"I considered Aggivessana: ‘It was not through mere faith alone that Rāma declared: \"By realising for myself with direct knowledge, I enter upon and abide in this Dhamma.\" Certainly Rāma abided knowing and seeing this Dhamma.’",
    "mn36:15": "Then I went to Uddaka Rāmaputta and asked him: ‘Friend, was it in this way that Rāma declared that he entered upon and abided in this Dhamma by realising for himself with direct knowledge?’",
    "mn36:16": "\"Still in search, Aggivessana, of what is wholesome, seeking the supreme state of sublime peace, I wandered by stages through the Magadhan country until eventually I arrived at Uruvelā, at Senānigama. There I saw an agreeable piece of ground, a delightful grove with a clear-flowing river with pleasant, smooth banks and nearby a village for alms resort. I considered: ‘This is an agreeable piece of ground, this is a delightful grove with a clear-flowing river with pleasant, smooth banks and nearby a village for alms resort. This will serve for the striving of a clansman intent on striving.’ And I sat down there thinking: ‘This will serve for striving.ʹ[n.e]MN 36, which includes the account of the Bodhisatta's meetings with Āḷāra Kālāma and Uddaka Rāmaputta, continues from this point with the story of the extreme ascetic practices that brought him to the verge of death and his subsequent discovery of the middle way that led to enlightenment.",
    "mn36:17": "\"Now these three similes occurred to me spontaneously, never heard before. Suppose there were a wet sappy piece of wood lying in water, and a man came with an upper fire-stick, thinking: ‘I shall light a fire, I shall produce heat.’ What do you think, Aggivessana? Could the man light a fire and produce heat by taking the upper fire-stick and rubbing it against the wet sappy piece of wood lying in the water?\"",
    "mn36:18": "\"Again, Aggivessana, a second simile occurred to me spontaneously, never heard before. Suppose there were a wet sappy piece of wood lying on dry land far from water, and a man came with an upper fire-stick, thinking: ‘I shall light a fire, I shall produce heat.’ What do you think, Aggivessana? Could the man light a fire and produce heat by taking the upper fire-stick and rubbing it against the wet sappy piece of wood lying on dry land far from water?\"",
    "mn36:19": "\"Again, Aggivessana, a third simile occurred to me spontaneously, never heard before. Suppose there were a dry sapless piece of wood lying on dry land far from water, and a man came with an upper fire-stick, thinking: ‘I shall light a fire, I shall produce heat.’ What do you think, Aggivessana? Could the man light a fire and produce heat by rubbing it against the dry sapless piece of wood lying on dry land far from water?\"",
    "mn36:20": "\"I thought: ‘Suppose, with my teeth clenched and my tongue pressed against the roof of my mouth, I beat down, constrain, and crush mind with mind.’ So, with my teeth clenched and my tongue pressed against the roof of my mouth, I beat down, constrained, and crushed mind with mind. While I did so, sweat ran from my armpits. Just as a strong man might seize a weaker man by the head or shoulders and beat him down, constrain him, and crush him, so too, with my teeth clenched and my tongue pressed against the roof of my mouth, I beat down, constrained, and crushed mind with mind, and sweat ran from my armpits. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving. But such painful feeling that arose in me did not invade my mind and remain.[n.388] This sentence, repeated at the end of each of the following sections as well, answers the second of the two questions posed by Saccaka in ¶10.",
    "mn36:21": "\"I thought: ‘Suppose I practise the breathingless meditation. ’ So I stopped the in-breaths and out-breaths through my mouth and nose. While I did so, there was a loud sound of winds coming out from my earholes. Just as there is a loud sound when a smith's bellows are blown, so too, while I stopped the in-breaths and out-breaths through my nose and ears, there was a loud sound of winds coming out from my earholes. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving. But such painful feeling that arose in me did not invade my mind and remain.",
    "mn36:22": "\"I thought: ‘Suppose I practise further the breathingless meditation.’ So I stopped the in-breaths and out-breaths through my mouth, nose, and ears. While I did so, violent winds cut through my head. Just as if a strong man were to crush my head with the tip of a sharp sword, so too, while I stopped the in-breaths and out-breaths through my mouth, nose, and ears, violent winds cut through my head. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving. But such painful feeling that arose in me did not invade my mind and remain.",
    "mn36:23": "\"I thought: ‘Suppose I practise further the breathingless meditation.’ So I stopped the in-breaths and out-breaths through my mouth, nose, and ears. While I did so, there were violent pains in my head. Just as if a strong man were tightening a tough leather strap around my head as a headband, so too, while I stopped the in-breaths and out-breaths through my mouth, nose, and ears, there were violent pains in my head. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving. But such painful feeling that arose in me did not invade my mind and remain.",
    "mn36:24": "\"I thought: ‘Suppose I practise further the breathingless meditation.’ So I stopped the in-breaths and out-breaths through my mouth, nose, and ears. While I did so, violent winds carved up my belly. Just as if a skilled butcher or his apprentice were to carve up an ox's belly with a sharp butcher's knife, so too, while I stopped the in-breaths and out-breaths through my mouth, nose, and ears, violent winds carved up my belly. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving. But such painful feeling that arose in me did not invade my mind and remain.",
    "mn36:25": "\"I thought: ‘Suppose I practise further the breathingless meditation.’ So I stopped the in-breaths and out-breaths through my mouth, nose, and ears. While I did so, there was a violent burning in my body. Just as if two strong men were to seize a weaker man by both arms and roast him over a pit of hot coals, so too, while I stopped the in-breaths and out-breaths through my mouth, nose, and ears, there was a violent burning in my body. But although tireless energy was aroused in me and unremitting mindfulness was established, my body was overwrought and uncalm because I was exhausted by the painful striving. But such painful feeling that arose in me did not invade my mind and remain.",
    "mn36:26": "\"I thought: ‘Suppose I practise entirely cutting off food.’ Then deities came to me and said: ‘Good sir, do not practise entirely cutting off food. If you do so, we shall infuse heavenly food into the pores of your skin and you will live on that.’ I considered: ‘If I claim to be completely fasting while these deities infuse heavenly food into the pores of my skin and I live on that, then I shall be lying.’ So I dismissed those deities, saying: ‘There is no need.’",
    "mn36:27": "\"I thought: ‘Suppose I take very little food, a handful each time, whether of bean soup or lentil soup or vetch soup or pea soup.’ So I took very little food, a handful each time, whether of bean soup or lentil soup or vetch soup or pea soup. While I did so, my body reached a state of extreme emaciation. Because of eating so little my limbs became like the jointed segments of vine stems or bamboo stems. Because of eating so little my backside became like a camel's hoof. Because of eating so little the projections on my spine stood forth like corded beads. Because of eating so little my ribs jutted out as gaunt as the crazy rafters of an old roofless barn. Because of eating so little the gleam of my eyes sank far down in their sockets, looking like the gleam of water that has sunk far down in a deep well. Because of eating so little my scalp shrivelled and withered as a green bitter gourd shrivels and withers in the wind and sun.",
    "mn36:28": "Because of eating so little my belly skin adhered to my backbone; thus if I touched my belly skin I encountered my backbone and if I touched my backbone I encountered my belly skin. Because of eating so little, if I defecated or urinated, I fell over on my face there. Because of eating so little, if I tried to ease my body by rubbing my limbs with my hands, the hair, rotted at its roots, fell from my body as I rubbed.",
    "mn36:29": "\"I thought: ‘Whatever recluses or brahmins in the past have experienced painful, racking, piercing feelings due to exertion, this is the utmost, there is none beyond this. And whatever recluses and brahmins in the future will experience painful, racking, piercing feelings due to exertion, this is the utmost, there is none beyond this. And whatever recluses and brahmins at present experience painful, racking, piercing feelings due to exertion, this is the utmost, there is none beyond this. But by this racking practice of austerities I have not attained any superhuman states, any distinction in knowledge and vision worthy of the noble ones. Could there be another path to enlightenment?’",
    "mn36:30": "\"I considered: ‘It is not easy to attain that pleasure with a body so excessively emaciated. Suppose I ate some solid food — some boiled rice and porridge.’ And I ate some solid food — some boiled rice and porridge. Now at that time five bhikkhus were waiting upon me, thinking: ‘If our recluse Gotama achieves some higher state, he will inform us.’ But when I ate the boiled rice and porridge, the five bhikkhus were disgusted and left me, thinking: ‘The recluse Gotama now lives luxuriously; he has given up his striving and reverted to luxury.’",
    "mn36:31": "\"Now when I had eaten solid food and regained my strength, then quite secluded from sensual pleasures, secluded from unwholesome states, I entered upon and abided in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. But such pleasant feeling that arose in me did not invade my mind and remain.[n.391] This sentence answers the first of the two questions posed by Saccaka in ¶10.",
    "mn36:32": "\"With the stilling of applied and sustained thought, I entered upon and abided in the second jhāna … With the fading away as well of rapture … I entered upon and abided in the third jhāna … With the abandoning of pleasure and pain … I entered upon and abided in the fourth jhāna … But such pleasant feeling that arose in me did not invade my mind and remain.",
    "mn36:33": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the recollection of past lives. I recollected my manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion: ‘There I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared elsewhere; and there too I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared here.’ Thus with their aspects and particulars I recollected my manifold past lives.",
    "mn36:34": "\"This was the first true knowledge attained by me in the first watch of the night. Ignorance was banished and true knowledge arose, darkness was banished and light arose, as happens in one who abides diligent, ardent, and resolute. But such pleasant feeling that arose in me did not invade my mind and remain.",
    "mn36:35": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the passing away and reappearance of beings.[n.f] Explained in detail at Vsm XIII, 72–101.With the divine eye, which is purified and surpasses the human, I saw beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate. I understood how beings pass on according to their actions thus: ‘These worthy beings who were ill conducted in body, speech, and mind, revilers of noble ones, wrong in their views, giving effect to wrong view in their actions, on the dissolution of the body, after death, have reappeared in a state of deprivation, in a bad destination, in perdition, even in hell; but these worthy beings who were well conducted in body, speech, and mind, not revilers of noble ones, right in their views, giving effect to right view in their actions, on the dissolution of the body, after death, have reappeared in a good destination, even in the heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, I saw beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and I understood how beings pass on according to their actions.",
    "mn36:36": "\"This was the second true knowledge attained by me in the middle watch of the night. Ignorance was banished and true knowledge arose, darkness was banished and light arose, as happens in one who abides diligent, ardent, and resolute. But such pleasant feeling that arose in me did not invade my mind and remain.",
    "mn36:37": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the destruction of the taints. I directly knew as it actually is: ‘This is suffering’; … ‘This is the origin of suffering’; … ‘This is the cessation of suffering’; … ‘This is the way leading to the cessation of suffering’; … ‘These are the taints’; … ‘This is the origin of the taints’; … ‘This is the cessation of the taints’; … ‘This is the way leading to the cessation of the taints.’",
    "mn36:38": "\"When I knew and saw thus, my mind was liberated from the taint of sensual desire, from the taint of being, and from the taint of ignorance. When it was liberated there came the knowledge: ‘It is liberated.’ I directly knew: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.’",
    "mn36:39": "\"This was the third true knowledge attained by me in the last watch of the night. Ignorance was banished and true knowledge arose, darkness was banished and light arose, as happens in one who abides diligent, ardent, and resolute. But such pleasant feeling that arose in me did not invade my mind and remain.",
    "mn36:40": "\"Aggivessana, I recall teaching the Dhamma to an assembly of many hundreds, and even then each person thinks of me: ‘The recluse Gotama is teaching the Dhamma especially for me.’ But it should not be so regarded; the Tathāgata teaches the Dhamma to others only to give them knowledge. When the talk is finished, Aggivessana, then I steady my mind internally, quieten it, bring it to singleness, and concentrate it on that same sign of concentration as before, in which I constantly abide.\"[n.392]MAexplains the \"sign of concentration\"(samādhinimitta)here as the fruition attainment of emptiness(suññataphalasamāpatti). See alsoMN122.",
    "mn36:41": "\"I recall, Aggivessana, in the last month of the hot season, on returning from my almsround, after my meal I lay out my outer robe folded in four, and lying down on my right side, I fall asleep mindful and fully aware.\"",
    "mn36:42": "\"Him I call deluded, Aggivessana, who has not abandoned the taints that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death; for it is with the non-abandoning of the taints that one is deluded. Him I call undeluded who has abandoned the taints that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death; for it is with the abandoning of the taints that one is undeluded. The Tathāgata, Aggivessana, has abandoned the taints that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death; he has cut them off at the root, made them like a palm stump, done away with them so that they are no longer subject to future arising. Just as a palm tree whose crown is cut off is incapable of further growth, so too, the Tathāgata has abandoned the taints that defile … done away with them so that they are no longer subject to future arising.\"",
    "mn36:43": "When this was said, Saccaka the Nigaṇṭha's son said: \"It is wonderful, Master Gotama, it is marvellous how when Master Gotama is spoken to offensively again and again, assailed by discourteous courses of speech, the colour of his skin brightens and the colour of his face clears, as is to be expected of one who is accomplished and fully enlightened. I recall, Master Gotama, engaging Pūraṇa Kassapa in debate, and then he prevaricated, led the talk aside, and showed anger, hate, and bitterness. But when Master Gotama is spoken to offensively again and again, assaulted by discourteous courses of speech, the colour of his skin brightens and the colour of his face clears, as is to be expected of one who is accomplished and fully enlightened. I recall, Master Gotama, engaging Makkhali Gosāla … Ajita Kesakambalin … Pakudha Kaccāyana … Sañjaya Belaṭṭhiputta … the Nigaṇṭha Nātaputta in debate, and then he prevaricated, led the talk aside, and showed anger, hate, and bitterness. But when Master Gotama is spoken to offensively again and again, assailed by discourteous courses of speech, the colour of his skin brightens and the colour of his face clears, as is to be expected of one who is accomplished and fully enlightened. And now, Master Gotama, we depart. We are busy and have much to do.\" \"Now is the time, Aggivessana, to do as you think fit.\"",
    "mn36:44": "Then Saccaka the Nigaṇṭha's son, having delighted and rejoiced in the Blessed One's words, got up from his seat and departed.[n.394]MAexplains that even though Saccaka did not reach any attainment or even become established in the Three Refuges, the Buddha taught him two long suttas in order to deposit in him a mental impression(vāsānā)that would come to maturity in the future. For he foresaw that at a later time, after the Dispensation became established in Sri Lanka, Saccaka would be reborn there and would attain arahantship as the great arahant, Kāḷa Buddharakkhita Thera."
}