{
    "mn37:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in the Eastern Park, in the Palace of Migāra's Mother.",
    "mn37:2": "\"Here, ruler of gods, a bhikkhu has heard that nothing is worth adhering to. When a bhikkhu has heard that nothing is worth adhering to, he directly knows everything; having directly known everything, he fully understands everything; having fully understood everything, whatever feeling he feels, whether pleasant or painful or neither-painful-nor-pleasant, he abides contemplating impermanence in those feelings, contemplating fading away, contemplating cessation, contemplating relinquishment. Contemplating thus, he does not cling to anything in the world. When he does not cling, he is not agitated. When he is not agitated, he personally attains Nibbāna.[n.396]MAexplains this passage as follows: \"Everything\"(sabbe dhammā)is the five aggregates, the twelve bases, the eighteen elements. These are \"not worth adhering to\" by way of craving and views because they turn out in actuality to be different from the way they are grasped: grasped as permanent, pleasurable, and self, they turn out to be impermanent, suffering, and not self. He \"directly knows\" them as impermanent, suffering, and not self, and \"fully understands\" them by scrutinising them in the same way. \"Contemplating impermanence,\" etc., is accomplished by the insight knowledges of rise and fall and of destruction and disappearance. \"He does not cling\" to any formation by way of craving and views, does not become agitated because of craving, and personally attains Nibbāna by the extinguishing of all defilements.He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.’ Briefly, it is in this way, ruler of gods, that a bhikkhu is liberated in the destruction of craving, one who has reached the ultimate end, the ultimate security from bondage, the ultimate holy life, the ultimate goal, one who is foremost among gods and humans.\"",
    "mn37:3": "Then Sakka, ruler of gods, delighting and rejoicing in the Blessed One's words, paid homage to the Blessed One, and keeping him on his right, he vanished at once.",
    "mn37:4": "Now on that occasion the venerable Mahā Moggallāna was sitting not far from the Blessed One. Then he considered: \"Did that spirit penetrate to the meaning of the Blessed One's words when he rejoiced, or did he not? Suppose I found out whether he did or not.\"",
    "mn37:5": "\"Good sir Moggallāna, we are so busy, we have so much to do, not only with our own business, but also with the business of the gods of the Thirty-three. Besides, good sir Moggallāna, what is well heard, well learned,well attended to, well remembered, suddenly vanishes from us. Good sir Moggallāna, it once happened that war broke out between the gods and the titans.[n.398] The gods and titans(asura)are depicted in the Pali Canon as being perpetually in a state of war with each other. See especially theSakkasaṁyutta (SN 11).In that war the gods won and the titans were defeated. When I had won that war and returned from it as a conqueror, I had the Vejayanta Palace built. Good sir Moggallāna, the Vejayanta Palace has a hundred towers, and each tower has seven hundred upper chambers, and each upper chamber has seven nymphs, and each nymph has seven maids. Would you like to see the loveliness of the Vejayanta Palace, good sir Moggallāna?\" The venerable Mahā Moggallāna consented in silence.",
    "mn37:6": "Then Sakka, ruler of gods, and the divine King Vessavaṇa[n.399] One of the Four Great Kings, the ruler of the yakkhas, his kingdom being in the north.went to the Vejayanta Palace, giving precedence to the venerable Mahā Moggallāna. When the maids of Sakka saw the venerable Mahā Moggallāna coming in the distance, they were embarrassed and ashamed and they went each into their own rooms. Just as a daughter-in-law is embarrassed and ashamed on seeing her father-in-law, so too, when the maids of Sakka saw the venerable Mahā Moggallāna coming, they were embarrassed and ashamed and they went each into their own rooms.",
    "mn37:7": "\"Good sir Moggallāna, I went to the Blessed One, and after paying homage to him, I stood at one side and said: \"Venerable sir, how in brief is a bhikkhu liberated in the destruction of craving, one who has reached the ultimate end, the ultimate security from bondage, the ultimate holy life, the ultimate goal, one who is foremost among gods and humans?\"",
    "mn37:8": "When this was said, good sir Moggallāna, the Blessed One told me: ‘Here, ruler of gods, a bhikkhu has heard that nothing is worth adhering to. When a bhikkhu has heard that nothing is worth adhering to, he directly knows everything; having directly known everything, he fully understands everything; having fully understood everything, whatever feeling he feels, whether pleasant or painful or neither-painful-nor-pleasant, he abides contemplating impermanence in those feelings, contemplating fading away, contemplating cessation, contemplating relinquishment. Contemplating thus, he does not cling to anything in the world. When he does not cling, he is not agitated. When he is not agitated, he personally attains Nibbāna.[n.400] MA explains this passage as follows: \"Everything\"(sabbe dhammā)is the five aggregates, the twelve bases, the eighteen elements. These are \"not worth adhering to\" by way of craving and views because they turn out in actuality to be different from the way they are grasped: grasped as permanent, pleasurable, and self, they turn out to be impermanent, suffering, and not self. He \"directly knows\" them as impermanent, suffering, and not self, and \"fully understands\" them by scrutinising them in the same way. \"Contemplating impermanence,\" etc., is accomplished by the insight knowledges of rise and fall and of destruction and disappearance. \"He does not cling\" to any formation by way of craving and views, does not become agitated because of craving, and personally attains Nibbāna by the extinguishing of all defilements.He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.’ Briefly, it is in this way, ruler of gods, that a bhikkhu is liberated in the destruction of craving, one who has reached the ultimate end, the ultimate security from bondage, the ultimate holy life, the ultimate goal, one who is foremost among gods and humans.\" That is how the Blessed One stated to me in brief deliverance in the destruction of craving, good sir Moggallāna.\"",
    "mn37:9": "Then the venerable Mahā Moggallāna delighted and rejoiced in the words of Sakka, ruler of gods. Then, just as quickly as a strong man might extend his flexed arm or flex his extended arm, he vanished from among the gods of the Thirty-three and appeared in the Eastern Park in the Palace of Migāra's Mother.",
    "mn37:10": "Then the venerable Mahā Moggallāna went to the Blessed One, and after paying homage to him, he sat down at one side and asked him: \"Venerable sir, does the Blessed One recall stating in brief — to a certain one of the renowned spirits with a great following — deliverance in the destruction of craving?\"",
    "mn37:11": "When this was said, I told him: ‘Here, ruler of gods, a bhikkhu has heard that nothing is worth adhering to. When a bhikkhu has heard that nothing is worth adhering to, he directly knows everything; having directly known everything, he fully understands everything; having fully understood everything, whatever feeling he feels, whether pleasant or painful or neither-painful-nor-pleasant, he abides contemplating impermanence in those feelings, contemplating fading away, contemplating cessation, contemplating relinquishment. Contemplating thus, he does not cling to anything in the world. When he does not cling, he is not agitated. When he is not agitated, he personally attains Nibbāna. He understands: \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.\" Briefly, it is in this way, ruler of gods, that a bhikkhu is liberated in the destruction of craving … one who is foremost among gods and humans.’ That is how I recall stating in brief to Sakka, ruler of gods, deliverance in the destruction of craving.\"",
    "mn37:12": "That is what the Blessed One said. The venerable Mahā Moggallāna was satisfied and delighted in the Blessed One's words."
}