{
    "mn38:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn38:2": "Since the bhikkhus were unable to detach him from that pernicious view, they went to the Blessed One, and after paying homage to him, they sat down at one side and told him all that had occurred, adding: \"Venerable sir, since we could not detach the bhikkhu Sāti, son of a fisherman, from this pernicious view, we have reported this matter to the Blessed One.\"",
    "mn38:3": "Then the Blessed One addressed a certain bhikkhu thus: \"Come, bhikkhu, tell the bhikkhu Sāti, son of a fisherman, in my name that the Teacher calls him.\" — \"Yes, venerable sir,\" he replied, and he went to the bhikkhu Sāti and told him: \"The Teacher calls you, friend Sāti.\"",
    "mn38:4": "Then the Blessed One addressed the bhikkhus thus: \"Bhikkhus, what do you think? Has this bhikkhu Sāti, son of a fisherman, kindled even a spark of wisdom in this Dhamma and Discipline?\"",
    "mn38:5": "\"Bhikkhus, consciousness is reckoned by the particular condition dependent upon which it arises. When consciousness arises dependent on the eye and forms, it is reckoned as eye-consciousness; when consciousness arises dependent on the ear and sounds, it is reckoned as ear-consciousness; when consciousness arises dependent on the nose and odours, it is reckoned as nose-consciousness; when consciousness arises dependent on the tongue and flavours, it is reckoned as tongue-consciousness; when consciousness arises dependent on the body and tangibles, it is reckoned as body-consciousness; when consciousness arises dependent on the mind and mind-objects, it is reckoned as mind-consciousness.",
    "mn38:6": "Just as fire is reckoned by the particular condition dependent on which it burns — when fire burns dependent on logs, it is reckoned as a log fire; when fire burns dependent on faggots, it is reckoned as a faggot fire; when fire burns dependent on grass, it is reckoned as a grass fire; when fire burns dependent on cowdung, it is reckoned as a cowdung fire; when fire burns dependent on chaff, it is reckoned as a chaff fire; when fire burns dependent on rubbish, it is reckoned as a rubbish fire — so too, consciousness is reckoned by the particular condition dependent on which it arises.[n.404]MA:The purpose of the simile is to show that there is no transmigration of consciousness across the sense doors. Just as a log fire burns in dependence on logs and ceases when its fuel is finished, without transmigrating to faggots and becoming reckoned as a faggot fire, so too, consciousness arisen in the eye door dependent on the eye and forms ceases when its conditions are removed, without transmigrating to the ear, etc., and becoming reckoned as ear-consciousness, etc. Thus the Buddha says in effect: \"In the occurrence of consciousness there is not even the mere transmigration from door to door, so how can this misguided Sāti speak of transmigration from existence to existence?\"When consciousness arises dependent on the eye and forms, it is reckoned as eye-consciousness … when consciousness arises dependent on the mind and mind-objects, it is reckoned as mind-consciousness.",
    "mn38:7": "\"Bhikkhus, do you see: ‘This has come to be’?\"[n.405]Bhūtam idan ti.MA:\"This\" refers to the five aggregates. Having shown the conditionality of consciousness, the Buddha states this passage to show the conditionality of all the five aggregates, which come into being through conditions, their \"nutriment,\" and pass out of being with the ceasing of those conditions. In the followingtadāhārasambhavaṁ,MA takes the tad as a nominative representing the subject(= taṁ khandhapañcakaṁ), but it seems more likely that it qualifies āhāra and that both should be taken as ablatives, the subject īdaṁ being understood. This interpretation seems confirmed by the third statement,tadāhāranirodhā yaṁ bhūtaṁ taṁ nirodhadhammaṁ.Horner's \"This is the origination of nutriment\" is clearly wrong.",
    "mn38:8": "\"Yes, venerable sir.\"",
    "mn38:9": "\"Bhikkhus, do you see: ‘Its origination occurs with that as nutriment’?\"",
    "mn38:10": "\"Yes, venerable sir.\"",
    "mn38:11": "\"Bhikkhus, do you see: ‘With the cessation of that nutriment, what has come to be is subject to cessation’?\"",
    "mn38:12": "\"Yes, venerable sir.\"",
    "mn38:13": "\"Bhikkhus, does doubt arise when one is uncertain thus: ‘Has this come to be’?\"",
    "mn38:14": "\"Yes, venerable sir.\"",
    "mn38:15": "\"Bhikkhus, does doubt arise when one is uncertain thus: ‘Does its origination occur with that as nutriment’?\"",
    "mn38:16": "\"Yes, venerable sir.\"",
    "mn38:17": "\"Bhikkhus, does doubt arise when one is uncertain thus: ‘With the cessation of that nutriment, is what has come to be subject to cessation’?\"",
    "mn38:18": "\"Yes, venerable sir.\"",
    "mn38:19": "\"Bhikkhus, is doubt abandoned in one who sees as it actually is with proper wisdom thus: ‘This has come to be’?\"",
    "mn38:20": "\"Yes, venerable sir.\"",
    "mn38:21": "\"Bhikkhus, is doubt abandoned in one who sees as it actually is with proper wisdom thus: ‘Its origination occurs with that as nutriment’?\"",
    "mn38:22": "\"Yes, venerable sir.\"",
    "mn38:23": "\"Bhikkhus, is doubt abandoned in one who sees as it actually is with proper wisdom thus: ‘With the cessation of that nutriment, what has come to be is subject to cessation’?\"",
    "mn38:24": "\"Yes, venerable sir.\"",
    "mn38:25": "\"Bhikkhus, are you thus free from doubt here: ‘This has come to be’?\"",
    "mn38:26": "\"Yes, venerable sir.\"",
    "mn38:27": "\"Bhikkhus, are you thus free from doubt here: ‘Its origination occurs with that as nutriment’?\"",
    "mn38:28": "\"Yes, venerable sir.\"",
    "mn38:29": "\"Bhikkhus, are you thus free from doubt here: ‘With the cessation of that nutriment, what has come to be is subject to cessation’?\"",
    "mn38:30": "\"Yes, venerable sir.\"",
    "mn38:31": "\"Bhikkhus, has it been seen well by you as it actually is with proper wisdom thus: ‘This has come to be’?\"",
    "mn38:32": "\"Yes, venerable sir.\"",
    "mn38:33": "\"Bhikkhus, has it been seen well by you as it actually is with proper wisdom thus: ‘Its origination occurs with that as nutriment’?\"",
    "mn38:34": "\"Yes, venerable sir.\"",
    "mn38:35": "\"Bhikkhus, has it been seen well by you as it actually is with proper wisdom thus: ‘With the cessation of that nutriment, what has come to be is subject to cessation’?\"",
    "mn38:36": "\"Yes, venerable sir.\"",
    "mn38:37": "\"Bhikkhus, purified and bright as this view is, if you adhere to it, cherish it, treasure it, and treat it as a possession, would you then understand that the Dhamma has been taught as similar to a raft, being for the purpose of crossing over, not for the purpose of grasping?\"[n.406] This is said to show the bhikkhus that they should not cling even to the right view of insight meditation. The simile of the raft refers toMN 22.13.",
    "mn38:38": "\"No, venerable sir.\"",
    "mn38:39": "\"Bhikkhus, purified and bright as this view is, if you do not adhere to it, cherish it, treasure it, and treat it as a possession, would you then understand that the Dhamma has been taught as similar to a raft, being for the purpose of crossing over, not for the purpose of grasping?\"",
    "mn38:40": "\"Yes, venerable sir.\"",
    "mn38:41": "\"Bhikkhus, there are these four kinds of nutriment for the maintenance of beings that already have come to be and for the support of those about to come to be. What four? They are: physical food as nutriment, gross or subtle; contact as the second; mental volition as the third; and consciousness as the fourth.[n.407] On the four nutriments, seen.120. MA: The Buddha states this passage and the following one linking up the nutriments with dependent origination in order to show that he knows not merely the five aggregates but the entire chain of conditions responsible for their being.",
    "mn38:42": "\"Now, bhikkhus, these four kinds of nutriment have what as their source, what as their origin, from what are they born and produced? These four kinds of nutriment have craving as their source, craving as their origin; they are born and produced from craving.",
    "mn38:43": "And this craving has what as its source … ? Craving has feeling as its source …",
    "mn38:44": "And this feeling has what as its source … ? Feeling has contact as its source …",
    "mn38:45": "And this contact has what as its source … ? Contact has the sixfold base as its source …",
    "mn38:46": "And this sixfold base has what as its source … ? The sixfold base has mentality-materiality as its source …",
    "mn38:47": "And this mentality-materiality has what as its source … ? Mentality-materiality has consciousness as its source …",
    "mn38:48": "And this consciousness has what as its source … ? Consciousness has formations as its source …",
    "mn38:49": "And these formations have what as their source, what as their origin, from what are they born and produced? Formations have ignorance as their source, ignorance as their origin; they are born and produced from ignorance.",
    "mn38:50": "\"So, bhikkhus, with ignorance as condition, formationscome to be; with formations as condition, consciousness; with consciousness as condition, mentality-materiality; with mentality-materiality as condition, the sixfold base; with the sixfold base as condition, contact; with contact as condition, feeling; with feeling as condition, craving; with craving as condition, clinging; with clinging as condition, being; with being as condition, birth; with birth as condition, ageing and death, sorrow, lamentation, pain, grief, and despair come to be. Such is the origin of this whole mass of suffering.",
    "mn38:51": "\"‘With birth as condition, ageing and death’: so it was said. Now, bhikkhus, do ageing and death have birth as condition or not, or how do you take it in this case?\"",
    "mn38:52": "\"‘With being as condition, birth’: so it was said. Now, bhikkhus, does birth have being as condition or not, or how do you take it in this case?\"",
    "mn38:53": "\"‘With clinging as condition, being’: so it was said. Now, bhikkhus, does being have clinging as condition or not, or how do you take it in this case?\"",
    "mn38:54": "\"‘With craving as condition, clinging’: so it was said. Now, bhikkhus, does clinging have craving as condition or not, or how do you take it in this case?\"",
    "mn38:55": "\"‘With feeling as condition, craving’: so it was said. Now, bhikkhus, does craving have feeling as condition or not, or how do you take it in this case?\"",
    "mn38:56": "\"‘With contact as condition, feeling’: so it was said. Now, bhikkhus, does feeling have contact as condition or not, or how do you take it in this case?\"",
    "mn38:57": "\"‘With the sixfold base as condition, contact’: so it was said. Now, bhikkhus, does contact have the sixfold base as condition or not, or how do you take it in this case?\"",
    "mn38:58": "\"‘With mentality-materiality as condition, the sixfold base’: so it was said. Now, bhikkhus, does the sixfold base have mentality-materiality as condition or not, or how do you take it in this case?\"",
    "mn38:59": "\"‘With consciousness as condition, mentality-materiality’: so it was said. Now, bhikkhus, does mentality-materiality have consciousness as condition or not, or how do you take it in this case?\"",
    "mn38:60": "\"‘With formations as condition, consciousness’: so it was said. Now, bhikkhus, does consciousness have formations as condition or not, or how do you take it in this case?\"",
    "mn38:61": "\"‘With ignorance as condition, formations’: so it was said. Now, bhikkhus, do formations have ignorance as condition or not, or how do you take it in this case?\"",
    "mn38:62": "\"Good, bhikkhus. So you say thus, and I also say thus: ‘When this exists, that comes to be; with the arising of this, that arises.’[n.408] This is a statement of the abstract principle of dependent origination exemplified by the twelvefold formula. The abstract principle on cessation is stated atverse 74. Ñm had rendered the principle of arising thus: \"That is when this is; that arises with the arising of this.\" And the principle of cessation: \"That is not when this is not; that ceases with the cessation of this.\"That is, with ignorance as condition, formationscome to be; with formations as condition, consciousness; with consciousness as condition, mentality-materiality; with mentality-materiality as condition, the sixfold base; with the sixfold base as condition, contact; with contact as condition, feeling; with feeling as condition, craving; with craving as condition, clinging; with clinging as condition, being; with being as condition, birth; with birth as condition, ageing and death, sorrow, lamentation, pain, grief, and despair come to be. Such is the origin of this whole mass of suffering.",
    "mn38:63": "\"But with the remainderless fading away and cessation of ignorance comes cessation of formations; with the cessation of formations, cessation of consciousness; with the cessation of consciousness, cessation of mentality-materiality; with the cessation of mentality-materiality, cessation of the sixfold base; with the cessation of the sixfold base, cessation of contact; with the cessation of contact, cessation of feeling; with the cessation of feeling, cessation of craving; with the cessation of craving, cessation of clinging; with the cessation of clinging, cessation of being; with the cessation of being, cessation of birth; with the cessation of birth, ageing and death, sorrow, lamentation, pain, grief, and despair cease. Such is the cessation of this whole mass of suffering.",
    "mn38:64": "\"‘With the cessation of birth, cessation of ageing and death’: so it was said. Now, bhikkhus, do ageing and death cease with the cessation of birth or not, or how do you take it in this case?\"",
    "mn38:65": "\"‘With the cessation of being, cessation of birth’ …",
    "mn38:66": "‘With the cessation of clinging, cessation of being’ …",
    "mn38:67": "‘With the cessation of craving, cessation of clinging’ …",
    "mn38:68": "‘With the cessation of feeling, cessation of craving’ …",
    "mn38:69": "‘With the cessation of contact, cessation of feeling’ … ’With the cessation of the sixfold base, cessation of contact’ …",
    "mn38:70": "‘With the cessation of mentality-materiality, cessation of the sixfold base’ …",
    "mn38:71": "‘With the cessation of consciousness, cessation of mentality-materiality’ …",
    "mn38:72": "‘With the cessation of formations, cessation of consciousness’ …",
    "mn38:73": "‘With the cessation of ignorance, cessation of formations’: so it was said. Now, bhikkhus, do formations cease with the cessation of ignorance or not, or how do you take it in this case?\"",
    "mn38:74": "\"Good, bhikkhus. So you say thus, and I also say thus: ‘When this does not exist, that does not come to be; with the cessation of this, that ceases.’ That is, with the cessation of ignorance comes cessation of formations; with the cessation of formations, cessation of consciousness; with the cessation of consciousness, cessation of mentality-materiality; with the cessation of mentality-materiality, cessation of the sixfold base; with the cessation of the sixfold base, cessation of contact; with the cessation of contact, cessation of feeling; with the cessation of feeling, cessation of craving; with the cessation of craving, cessation of clinging; with the cessation of clinging, cessation of being; with the cessation of being, cessation of birth; with the cessation of birth, ageing and death, sorrow, lamentation, pain, grief, and despair cease. Such is the cessation of this whole mass of suffering.",
    "mn38:75": "\"Bhikkhus, knowing and seeing in this way, would you run back to the past thus: ‘Were we in the past? Were we not in the past? What were we in the past? How were we in the past? Having been what, what did we become in the past?’?\"",
    "mn38:76": "\"No, venerable sir.\"",
    "mn38:77": "\"Knowing and seeing in this way, would you run forward to the future thus: ‘Shall we be in the future? Shall we not be in the future? What shall we be in the future? How shall we be in the future? Having been what, what shall we become in the future?’?\"",
    "mn38:78": "\"No, venerable sir.\"",
    "mn38:79": "\"Knowing and seeing in this way, would you now be inwardly perplexed about the present thus: ‘Am I? Am I not? What am I? How am I? Where has this being come from? Where will it go?’?\"",
    "mn38:80": "\"No, venerable sir.\"",
    "mn38:81": "\"Bhikkhus, knowing and seeing in this way, would you speak thus: ‘The Teacher is respected by us. We speak as we do out of respect for the Teacher’?\"",
    "mn38:82": "\"No, venerable sir.\"",
    "mn38:83": "\"Knowing and seeing in this way, would you speak thus: ‘The Recluse says this, and we speak thus at the bidding of the Recluse’?\"[n.409] The best reading is SBJ:samaṇavacanena ca mayaṁ.Ñm apparently translated from PTSsamaṇā ca na ca mayaṁand thus rendered it, \"and so doothermonks, but we do not speak thus.\" \"The Recluse\" is the Buddha.",
    "mn38:84": "\"No, venerable sir.\"",
    "mn38:85": "\"Knowing and seeing in this way, would you acknowledge another teacher?\"",
    "mn38:86": "\"No, venerable sir.\"",
    "mn38:87": "\"Knowing and seeing in this way, would you return to the observances, tumultuous debates, and auspicious signs of ordinary recluses and brahmins, taking them as the coreof the holy life?\"",
    "mn38:88": "\"No, venerable sir.\"",
    "mn38:89": "\"Do you speak only of what you have known, seen, and understood for yourselves?\"",
    "mn38:90": "\"Yes, venerable sir.\"",
    "mn38:91": "\"Good, bhikkhus. So you have been guided by me with this Dhamma, which is visible here and now, immediately effective, inviting inspection, onward leading, to be experienced by the wise for themselves. For it was with reference to this that it has been said: ‘Bhikkhus, this Dhamma is visible here and now, immediately effective, inviting inspection, onward leading, to be experienced by the wise for themselves.’",
    "mn38:92": "\"Bhikkhus, the descent of the embryo takes place through the union of three things.[n.410] The following portion of the discourse may be understood as a concrete application of dependent origination — so far expressed only as a doctrinal formula — to the course of individual existence. The passage ¶¶–93 may be taken to show the factors from consciousness through feeling that result from past ignorance and formations, ¶109 the causal factors of craving and clinging as they build up a continuation of the saṁsāric round. The following section, connecting dependent origination to the appearance of the Buddha and his teaching of the Dhamma, shows the practice of the Dhamma to be the means of bringing the round to an end.Here, there is the union of the mother and father, but the mother is not in season, and the gandhabba[n.411]MA:Thegandhabbais the being arriving there. It is not someone (i.e., a disembodied spirit) standing nearby watching the future parents having intercourse, but a being driven on by the mechanism of kamma, due to be reborn on that occasion.The exact import of the wordgandhabbain relation to the rebirth process is not explained in the Nikāyas, and the word in this sense occurs only here and at93.18.DN 15/ii.63 speaks of consciousness as \"descending into the mother's womb,\" this being a condition for rebirth to take place. Thus we might identify the gandhabba here as the stream of consciousness, conceived more animistically as coming over from the previous existence and bringing along its total accumulation of kammic tendencies and personality traits. The fullest study of the concept of the gandhabba is Wijesekera, \"Vedic Gandharva and Pali Gandhabba,\" inBuddhist and Vedic Studies,pp. 191–202.is not present — in this case no descent of an embryo takes place. Here, there is the union of the mother and father, and the mother is in season, but the gandhabba is not present — in this case too no descent of the embryo takes place. But when there is the union of the mother and father, and the mother is in season, and the gandhabba is present, through the union of these three things the descent of the embryo takes place.",
    "mn38:93": "\"When he grows up and his faculties maturestill further, the youth enjoys himself provided and endowed with the five cords of sensual pleasure, with forms cognizable by the eye … sounds cognizable by the ear … odours cognizable by the nose … flavours cognizable by the tongue … tangibles cognizable by the body that are wished for, desired, agreeable and likeable, connected with sensual desire, and provocative of lust.",
    "mn38:94": "\"On seeing a form with the eye, he lusts after it if it is pleasing; he dislikes it if it is unpleasing. He abides with mindfulness of the body unestablished, with a limited mind, and he does not understand as it actually is the deliverance of mind and deliverance by wisdom wherein those evil unwholesome states cease without remainder. Engaged as he is in favouring and opposing, whatever feeling he feels — whether pleasant or painful or neither-painful-nor-pleasant — he delights in that feeling, welcomes it, and remains holding to it.[n.412] MA explains that he delights in the painful feeling by clinging to it with thoughts of \"I\" and \"mine.\" In confirmation of the statement that a worldling may delight in painful feelings, one thinks not only of full-fledged masochism but also of the common tendency of people to put themselves into distressing situations in order to reinforce their sense of ego.As he does so, delight arises in him. Now delight in feelings is clinging. With his clinging as condition, beingcomes to be; with being as condition, birth; with birth as condition, ageing and death, sorrow, lamentation, pain, grief, and despair come to be. Such is the origin of this whole mass of suffering.",
    "mn38:95": "\"Here, bhikkhus, a Tathāgata appears in the world, accomplished, fully enlightened, perfect in true knowledge and conduct, sublime, knower of worlds, incomparable leader of persons to be tamed, teacher of gods and humans, enlightened, blessed. He declares this world with its gods, its Māras, and its Brahmās, this generation with its recluses and brahmins, its princes and its people, which he has himself realised with direct knowledge. He teaches the Dhamma good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, and he reveals a holy life that is utterly perfect and pure.",
    "mn38:96": "\"Having thus gone forth and possessing the bhikkhu's training and way of life, abandoning the killing of living beings, he abstains from killing living beings; with rod and weapon laid aside, conscientious, merciful, he abides compassionate to all living beings.",
    "mn38:97": "Abandoning the taking of what is not given, he abstains from taking what is not given; taking only what is given, expecting only what is given, by not stealing he abides in purity.",
    "mn38:98": "Abandoning incelibacy, he observes celibacy, living apart, abstaining from the vulgar practice of sexual intercourse.",
    "mn38:99": "\"Abandoning false speech, he abstains from false speech; he speaks truth, adheres to truth, is trustworthy and reliable, one who is no deceiver of the world.",
    "mn38:100": "Abandoning malicious speech, he abstains from malicious speech; he does not repeat elsewhere what he has heard here in order to dividethose peoplefrom these, nor does he repeat to these people what he has heard elsewhere in order to dividethese peoplefrom those; thus he is one who reunites those who are divided, a promoter of friendships, who enjoys concord, rejoices in concord, delights in concord, a speaker of words that promote concord.",
    "mn38:101": "Abandoning harsh speech, he abstains from harsh speech; he speaks such words as are gentle, pleasing to the ear, and loveable, as go to the heart, are courteous, desired by many and agreeable to many.",
    "mn38:102": "Abandoning gossip, he abstains from gossip; he speaks at the right time, speaks what is fact, speaks on what is good, speaks on the Dhamma and the Discipline; at the right time he speaks such words as are worth recording, reasonable, moderate, and beneficial.",
    "mn38:103": "\"He abstains from injuring seeds and plants. He practises eating only one meal a day, abstaining from eating at night and outside the proper time.Ñm had translatedekabhattikaas \"eating only in one part of the day,\" following the commentary. According to the Vinaya the proper time for bhikkhus to eat is between dawn and noon. From noon until the next dawn only liquids are allowed.He abstains from dancing, singing, music, and theatrical shows. He abstains from wearing garlands, smartening himself with scent, and embellishing himself with unguents. He abstains from high and large couches. He abstains from accepting gold and silver. He abstains from accepting raw grain. He abstains from accepting raw meat. He abstains from accepting women and girls. He abstains from accepting men and women slaves. He abstains from accepting goats and sheep. He abstains from accepting fowl and pigs. He abstains from accepting elephants, cattle, horses, and mares. He abstains from accepting fields and land. He abstains from going on errands and running messages. He abstains from buying and selling. He abstains from false weights, false metals, and false measures. He abstains from accepting bribes, deceiving, defrauding, and trickery. He abstains from wounding, murdering, binding, brigandage, plunder, and violence.",
    "mn38:104": "\"He becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes, he sets out taking only these with him. Just as a bird, wherever it goes, flies with its wings as its only burden, so too the bhikkhu becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes, he sets out taking only these with him. Possessing this aggregate of noble virtue, he experiences within himself a bliss that is blameless.",
    "mn38:105": "\"On seeing a form with the eye, he does not grasp at its signs and features. Since, if he left the eye faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the eye faculty, he undertakes the restraint of the eye faculty.This formula is analysed at Vsm I, 53–59. Briefly, the signs(nimitta)are the most distinctive qualities of the object which, when grasped at unmindfully, can kindle defiled thoughts; the features(anubyañjana)are the details that may subsequently catch the attention when the first perceptual contact has not been followed up by restraint. \"States of covetousness and grief\" signifies the alternative reactions of desire and aversion, attraction and repulsion, towards sense objects.On hearing a sound with the ear … On smelling an odour with the nose … On tasting a flavour with the tongue … On touching a tangible with the body … On cognizing a mind-object with the mind, he does not grasp at its signs and features. Since, if he left the mind faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the mind faculty, he undertakes the restraint of the mind faculty. Possessing this noble restraint of the faculties, he experiences within himself a bliss that is unsullied.",
    "mn38:106": "\"He becomes one who acts in full awareness when going forward and returning; who acts in full awareness when looking ahead and looking away; who acts in full awareness when flexing and extending his limbs; who acts in full awareness when wearing his robes and carrying his outer robe and bowl; who acts in full awareness when eating, drinking, consuming food, and tasting; who acts in full awareness when defecating and urinating; who acts in full awareness when walking, standing, sitting, falling asleep, waking up, talking, and keeping silent.",
    "mn38:107": "\"Possessing this aggregate of noble virtue, and this noble restraint of the faculties, and possessing this noble mindfulness and full awareness, he resorts to a secluded resting place: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw.",
    "mn38:108": "\"Having thus abandoned these five hindrances, imperfections of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters upon and abides in the first jhāna … With the stilling of applied and sustained thought, he enters upon and abides in the second jhāna … With the fading away as well of rapture … he enters upon and abides in the third jhāna … With the abandoning of pleasure and pain … he enters upon and abides in the fourth jhāna … which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity.",
    "mn38:109": "\"On seeing a form with the eye, he does not lust after it if it is pleasing; he does not dislike it if it is unpleasing. He abides with mindfulness of the body established, with an immeasurable mind, and he understands as it actually is the deliverance of mind and deliverance by wisdom wherein those evil unwholesome states cease without remainder.[n.413]MA:An immeasurable mind(appamāṇacetaso)is a supramundane mind; this means that he possesses the path.Having thus abandoned favouring and opposing, whatever feeling he feels, whether pleasant or painful or neither-painful-nor-pleasant, he does not delight in that feeling, welcome it, or remain holding to it.[n.414] This statement reveals that the chain of dependent origination is broken at the link between feeling and craving. Feeling arises necessarily because the body acquired through past craving is subject to the maturation of past kamma. However, if one does not delight in feeling, craving will not have the opportunity to arise and set off reactions of like and dislike that provide further fuel for the round, and thus the round will come to an end.As he does not do so, delight in feelings ceases in him. With the cessation of his delight comes cessation of clinging; with the cessation of clinging, cessation of being; with the cessation of being, cessation of birth; with the cessation of birth, ageing and death, sorrow, lamentation, pain, grief, and despair cease. Such is the cessation of this whole mass of suffering.",
    "mn38:110": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}