{
    "mn43:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn43:2": "\"‘One who is unwise, one who is unwise’ is said, friend. With reference to what is this said, ‘one who is unwise’?\"",
    "mn43:3": "\" ‘One does not wisely understand, one does not wisely understand,’ friend; that is why it is said, ‘one who is unwise.’ And what doesn’t one wisely understand? One does not wisely understand: ‘This is suffering’; one does not wisely understand: ‘This is the origin of suffering’; one does not wisely understand: ‘This is the cessation of suffering’; one does not wisely understand: ‘This is the way leading to the cessation of suffering.’ ‘One does not wisely understand, one does not wisely understand,’ friend; that is why it is said, ‘one who is unwise.’ \"",
    "mn43:4": "Saying, \"Good, friend,\" the venerable Mahā Koṭṭhita delighted and rejoiced in the venerable Sāriputta′s words. Then he asked him a further question:",
    "mn43:5": "\"‘One who is wise, one who is wise,’ is said, friend. With reference to what is this said, ‘one who is wise’?\"",
    "mn43:6": "\"‘One wisely understands, one wisely understands,’ friend; that is why it is said, ‘one who is wise.’ What does one wisely understand? One wisely understands: ‘This is suffering’; one wisely understands: ‘This is the origin of suffering’; one wisely understands: ‘This is the cessation of suffering’; one wisely understands: ‘This is the way leading to the cessation of suffering. ’ ‘One wisely understands, one wisely understands,’ friend; that is why it is said, ‘one who is wise.′\"[n.429] According toMA, the understanding of the Four Noble Truths being discussed here is penetration by the supramundane path. Thus the lowest type of person to be described as \"one who is wise\"(paññavā)is the person on the path of stream-entry. The rendering ofpaññāas \"wisdom\" (which I substituted for Ñm's \"understanding\") has the disadvantage of severing the tie, evident in the Pali, with the verbpajānāti.To preserve the connection, here and in the preceding paragraph, the verb has been rendered \"wisely understand.\"",
    "mn43:7": "\" ‘Consciousness, consciousness’ is said, friend. With reference to what is ‘consciousness’ said?\"",
    "mn43:8": "\" ‘It cognizes, it cognizes,’ friend; that is why ‘consciousness’ is said.[n.430] The Pali phrase defining consciousness uses only the verb,vijānāti vijānāti,and this could as well be understood to mean \"One cognizes, one cognizes.\" Although Ñm had translated this phrase without any pronoun, the pronoun has been inserted for greater intelligibility. The renderings of the verb definitions of feeling and perception at ¶11 and ¶13 have been similarly augmented by the addition of the pronoun.What does it cognize? It cognizes: ‘This ispleasant’; it cognizes: ‘This ispainful’; it cognizes: ‘This isneither-painful-nor-pleasant.’ ‘It cognizes, it cognizes,’ friend; that is why ‘consciousness’ is said.\"[n.431]MA:The question concerns the consciousness with which the person described as \"one who is wise\" examines formations; that is, the consciousness of insight by which that person arrivedat his attainment, the mind which does the work of meditation. Ven. Sāriputta answers by explaining the meditation subject of feeling, in the way it has come down in the Discourse on the Foundations of Mindfulness (MN10.32). The Pali construction,sukhan ti pi vijānāti,indicates that the feeling is being treated as a direct object of consciousness rather than as an affective tone of the experience; to show this the words \"this is\" have been supplied in brackets and the entire phrase set in quotation marks.",
    "mn43:9": "\"Wisdom and consciousness, friend — are these states conjoined or disjoined? And is it possible to separate each of these states from the other in order to describe the difference between them?\"",
    "mn43:10": "\"What is the difference, friend, between wisdom and consciousness, these states that are conjoined, not disjoined?\"",
    "mn43:11": "\"‘Feeling, feeling’ is said, friend. With reference to what is ‘feeling’ said?\"",
    "mn43:12": "\"‘It feels, it feels,’ friend; that is why ‘feeling’ is said. What does it feel? It feels pleasure, it feels pain, it feels neither-pain-nor-pleasure. ‘It feels, it feels,’ friend, that is why ‘feeling’ is said.\"[n.434]MAsays that the question and reply refer to mundane feelings that are the objective raṅge of insight. The Pali construction here,sukham pi vedeti,etc., shows feeling as simultaneously a quality of the object and an affective tone of the experience by which it is apprehended. MA points out that feeling itself feels; there is no other (separate) feeler.",
    "mn43:13": "\"‘Perception, perception,’ is said, friend. With reference to what is ‘perception’ said?\"",
    "mn43:14": "\"‘It perceives, it perceives,’ friend; that is why ‘perception’ is said. What does it perceive? It perceives blue, it perceives yellow, it perceives red, and it perceives white. ‘It perceives, it perceives, ’ friend; that is why ‘perception’ is said.\"[n.435]MA:The question and reply refer to mundane perceptions that are the objective raṅge of insight.",
    "mn43:15": "\"Feeling, perception, and consciousness, friend — these states are conjoined, not disjoined, and it is impossible to separate each of these states from the others in order to describe the difference between them. For what one feels, that one perceives; and what one perceives, that one cognizes. That is why these states are conjoined, not disjoined, and it is impossible to separate each of these states from the others in order to describe the difference between them.\"[n.436]MA:Wisdom has been excluded from this exchange because the intention is to show only the states that are conjoined on every occasion of consciousness.",
    "mn43:16": "\"Friend, what can be known by purified mind-consciousness released from the five faculties?\"",
    "mn43:17": "\"Friend, by purified mind-consciousness released from the five faculties the base of infinite space can be known thus: ‘Space is infinite’; the base of infinite consciousness can be known thus: ‘Consciousness is infinite’; and the base of nothingness can be known thus: ‘There is nothing.′\"[n.437]MA:Purified mind-consciousness(parisuddha manoviññāṇa )is the consciousness of the fourth jhāna. It can know the immaterial attainments insofar as one established in the fourth jhāna is capable of reaching them. The base of neither-perception-nor-non-perception is excluded here because, owing to its subtlety, it does not come into the direct raṅge of contemplation for the attainment of insight.",
    "mn43:18": "\"Friend, with what does one understand a state that can be known?\"",
    "mn43:19": "\"Friend, one understands a state that can be known with the eye of wisdom.\"[n.438] MA: The eye of wisdom(paññ̄ācakkhu)is wisdom itself, called an eye in the sense that it is an organ of spiritual vision.",
    "mn43:20": "\"Friend, what is the purpose of wisdom?\"",
    "mn43:21": "\"The purpose of wisdom, friend, is direct knowledge, its purpose is full understanding, its purpose is abandoning.\"[n.439] For the distinction between direct knowledge(abhiññā)and full understanding(pariññā), seen.23.",
    "mn43:22": "\"Friend, how many conditions are there for the arising of right view?\"",
    "mn43:23": "\"Friend, there are two conditions for the arising of right view: the voice of another and wise attention. These are the two conditions for the arising of right view.\"[n.440]MA:\"The voice of another\"(parato ghosa)is the teaching of beneficial Dhamma. These two conditions are necessary for disciples to arrive at the right view of insight and the right view of the supramundane path. But paccekabuddhas arrive at their enlightenment and fully enlightened Buddhas at omniscience solely in dependence on wise attention without \"the voice of another.\"",
    "mn43:24": "\"Friend, by how many factors is right view assisted when it has deliverance of mind for its fruit, deliverance of mind for its fruit and benefit, when it has deliverance by wisdom for its fruit, deliverance by wisdom for its fruit and benefit?\"",
    "mn43:25": "\"Friend, right view is assisted by five factors when it has deliverance of mind for its fruit, deliverance of mind for its fruit and benefit, when it has deliverance by wisdom for its fruit, deliverance by wisdom for its fruit and benefit. Here, friend, right view is assisted by virtue, learning, discussion, serenity, and insight. Right view assisted by these five factors has deliverance of mind for its fruit, deliverance of mind for its fruit and benefit; it has deliverance by wisdom for its fruit, deliverance by wisdom for its fruit and benefit.\"[n.441]MA:Right view here is the right view pertaining to the path of arahantship. \"Deliverance of mind\" and \"deliverance by wisdom\" both refer to the fruit of arahantship; seen.83.When one fulfils these five factors, the path of arahantship arises and yields its fruit.",
    "mn43:26": "\"Friend, how many kinds of being are there?\"",
    "mn43:27": "\"There are these three kinds of being, friend: sense-sphere being, fine-material being, and immaterial being.\"",
    "mn43:28": "\"Friend, how is renewal of being in the future generated?\"",
    "mn43:29": "\"Friend, renewal of being in the future is generated through the delighting in this and that on the part of beings who are hindered by ignorance and fettered by craving.\"[n.442] \"Renewal of being in the future\"(āyatiṁ punabbhavābhinibbatti )is rebirth, the continuation of the round. This question and the next may be regarded as synoptic approaches to the entire twelvefold formula of dependent origination laid out inMN 38.17and 20.",
    "mn43:30": "\"Friend, how is renewal of being in the future not generated?\"",
    "mn43:31": "\"Friend, with the fading away of ignorance, with the arising of true knowledge, and with the cessation of craving, renewal of being in the future is not generated.\"",
    "mn43:32": "\"Friend, what is the first jhāna?\"",
    "mn43:33": "\"Here, friend, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. This is called the first jhāna.\"",
    "mn43:34": "\"Friend, how many factors does the first jhāna have?\"",
    "mn43:35": "\"Friend, the first jhāna has five factors. Here, when a bhikkhu has entered upon the first jhāna, there occur applied thought, sustained thought, rapture, pleasure, and unification of mind. That is how the first jhāna has five factors.\"",
    "mn43:36": "\"Friend, how many factors are abandoned in the first jhāna and how many factors are possessed?\"",
    "mn43:37": "\"Friend, in the first jhāna five factors are abandoned and five factors are possessed. Here, when a bhikkhu has entered upon the first jhāna, sensual desire is abandoned, ill will is abandoned, sloth and torpor are abandoned, restlessness and remorse are abandoned, and doubt is abandoned; and there occur applied thought, sustained thought, rapture, pleasure, and unification of mind. That is how in the first jhāna five factors are abandoned and five factors are possessed.\"",
    "mn43:38": "\"Friend, these five faculties each have a separate field, a separate domain, and do not experience each other's field and domain, that is, the eye faculty, the ear faculty, the nose faculty, the tongue faculty, and the body faculty. Now of these five faculties, each having a separate field, a separate domain, not experiencing each other's field and domain, what is their resort, what experiences their fields and domains?\"[n.443] The five outer sense faculties each have their own unique object — forms for the eye, sounds for the ear, etc. — but the mind faculty is able to experience the objects of all five sense faculties as well as the mental objects exclusive to itself. Hence the other five faculties have mind as their resort(manopaṭisaraṇaṁ).",
    "mn43:39": "\"Friend, these five faculties each have a separate field, a separate domain, and do not experience each other's field and domain, that is, the eye faculty, the ear faculty, the nose faculty, the tongue faculty, and the body faculty. Now these five faculties, each having a separate field, a separate domain, not experiencing each other's field and domain, have mind as their resort, and mind experiences their fields and domains.\"",
    "mn43:40": "\"Friend, as to these five faculties — that is, the eye faculty, the ear faculty, the nose faculty, the tongue faculty, and the body faculty — what do these five faculties stand in dependence on?\"",
    "mn43:41": "\"Friend, as to these five faculties — that is, the eye faculty, the ear faculty, the nose faculty, the tongue faculty, and the body faculty — these five faculties stand in dependence on vitality.\"[n.444]MAidentifies vitality(āyu)with the life faculty(jıvitindriya), which has the function of maintaining and vitalising the other material phenomena of the living body.",
    "mn43:42": "\"Friend, what does vitality stand in dependence on?\"",
    "mn43:43": "\"Vitality stands in dependence on heat.\"[n.445] Heat(usmā)is the kamma-born heat intrinsic to the living body.",
    "mn43:44": "\"Friend, what does heat stand in dependence on?\"",
    "mn43:45": "\"Heat stands in dependence on vitality.\"",
    "mn43:46": "\"Just now, friend, we understood the venerable Sāriputta to have said: ‘Vitality stands in dependence on heat’; and now we understand him to say: ‘Heat stands in dependence on vitality.’ How should the meaning of these statements be regarded?\"",
    "mn43:47": "\"In that case, friend, I shall give you a simile, for some wise men here understand the meaning of a statement by means of a simile. Just as when an oil-lamp is burning, its radiance is seen in dependence on its flame and its flame is seen in dependence on its radiance; so too, vitality stands in dependence on heat and heat stands in dependence on vitality.\"",
    "mn43:48": "\"Friend, are vital formations things that can be felt or are vital formations one thing and things that can be felt another?\"",
    "mn43:49": "\"Vital formations, friend, are not things that can be felt.[n.446] \"Vital formations\"(āyusaṅkhārā), according toMA,denotes vitality itself. They cannot be states of feeling because they are required to keep the body of a bhikkhu alive when he has attained to the cessation of perception and feeling. This special meditative attainment, in which all mental activity ceases, is accessible only to non-returners and arahants who also have mastery over the eight attainments on the side of serenity. For a brief discussion see the Introduction, p. 41, and for the full scholastic account, Vsm XXIII, 16–52. The cessation of perception and feeling will be taken up again inMN 44.If vital formations were things that can be felt, then a bhikkhu who has entered upon the cessation of perception and feeling would not be seen to emerge from it. Because vital formations are one thing and things that can be felt another, a bhikkhu who has entered upon the cessation of perception and feeling can be seen to emerge from it.\"",
    "mn43:50": "\"Friend, when this body is bereft of how many states is it then discarded and forsaken, left lying senseless like a log?\"[n.447] That is, dead. The departure of consciousness from the body is not sufficient to constitute death; vitality and the vital heat must also perish.",
    "mn43:51": "\"Friend, when this body is bereft of three states — vitality, heat, and consciousness — it is then discarded and forsaken, left lying senseless like a log.\"",
    "mn43:52": "\"Friend, what is the difference between one who is dead, who has completed his time, and a bhikkhu who has entered upon the cessation of perception and feeling?\"",
    "mn43:53": "\"Friend, in the case of one who is dead, who has completed his time, his bodily formations have ceased and subsided, his verbal formations have ceased and subsided, his mental formations have ceased and subsided, his vitality is exhausted, his heat has been dissipated, and his faculties are fully broken up. In the case of a bhikkhu who has entered upon the cessation of perception and feeling, his bodily formations have ceased and subsided, his verbal formations have ceased and subsided, his mental formations have ceased and subsided, but his vitality is not exhausted, his heat has not been dissipated, and his faculties become exceptionally clear.[n.448] The bodily formations are in-and-out breathing, the verbal formations are applied thought and sustained thought, the mental formations are perception and feeling — seeMN 44.14–15. MA says that the faculties during the ordinary course of life, being impinged upon by sense objects, are afflicted and soiled like a mirror set up at a crossroads; but the faculties of one in cessation become exceptionally clear like a mirror placed in a case and deposited in a box.This is the difference between one who is dead, who has completed his time, and a bhikkhu who has entered upon the cessation of perception and feeling.\"",
    "mn43:54": "\"Friend, how many conditions are there for the attainment of the neither-painful-nor-pleasant deliverance of mind?\"",
    "mn43:55": "\"Friend, there are four conditions for the attainment of the neither-painful-nor-pleasant deliverance of mind: here, with the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, a bhikkhu enters upon and abides in the fourth jhāna, which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity. These are the four conditions for the attainment of the neither-painful-nor-pleasant deliverance of mind.\"",
    "mn43:56": "\"Friend, how many conditions are there for the attainment of the signless deliverance of mind?\"",
    "mn43:57": "\"Friend, there are two conditions for the attainment of the signless deliverance of mind: non-attention to all signs and attention to the signless element. These are the two conditions for the attainment of the signless deliverance of mind.\"[n.449]MA:The \"signless deliverance of mind\"(animittā cetovimutti)is the attainment of fruition; the \"signs\" are objects such as forms, etc.; the \"signless element\" is Nibbāna, in which all signs of conditioned things are absent.",
    "mn43:58": "\"Friend, how many conditions are there for the persistence of the signless deliverance of mind?\"",
    "mn43:59": "\"Friend, there are three conditions for the persistence of the signless deliverance of mind: non-attention to all signs, attention to the signless element, and the prior determinationof its duration. These are the three conditions for the persistence of the signless deliverance of mind.\"",
    "mn43:60": "\"Friend, how many conditions are there for emergence from the signless deliverance of mind?\"",
    "mn43:61": "\"Friend, there are two conditions for emergence from the signless deliverance of mind: attention to all signs and non-attention to the signless element. These are the two conditions for emergence from the signless deliverance of mind.\"",
    "mn43:62": "\"Friend, the immeasurable deliverance of mind, the deliverance of mind through nothingness, the deliverance of mind through voidness, and the signless deliverance of mind: are these states different in meaning and different in name, or are they one in meaning and different only in name?\"",
    "mn43:63": "\"Friend, the immeasurable deliverance of mind, the deliverance of mind through nothingness, the deliverance of mind through voidness, and the signless deliverance of mind: there is a way in which these states are different in meaning and different in name, and there is a way in which they are one in meaning and different only in name.",
    "mn43:64": "\"What, friend, is the way in which these states are different in meaning and different in name?",
    "mn43:65": "Here a bhikkhu abides pervading one quarter with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to himself, he abides pervading the all-encompassing world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, without hostility and without ill will. He abides pervading one quarter with a mind imbued with compassion … He abides pervading one quarter with a mind imbued with altruistic joy … He abides pervading one quarter with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to himself, he abides pervading the all-encompassing world with a mind imbued with equanimity, abundant, exalted, immeasurable, without hostility and without ill will. This is called the immeasurable deliverance of mind.",
    "mn43:66": "\"And what, friend, is the deliverance of mind through nothingness?",
    "mn43:67": "Here, with the complete surmounting of the base of infinite consciousness, aware that ‘there is nothing,’ a bhikkhu enters upon and abides in the base of nothingness. This is called the deliverance of mind through nothingness.",
    "mn43:68": "\"And what, friend, is the deliverance of mind through voidness?",
    "mn43:69": "Here a bhikkhu, gone to the forest or to the root of a tree or to an empty hut, reflects thus: ‘This is void of a self or of what belongs to a self.’ This is called the deliverance of mind through voidness.[n.450]MAidentifies thissuññatā cetovimuttiwith insight into the voidness of selfhood in persons and things.",
    "mn43:70": "\"And what, friend, is the signless deliverance of mind?",
    "mn43:71": "Here, with non-attention to all signs, a bhikkhu enters upon and abides in the signless concentration of mind. This is called the signless deliverance of mind.[n.451] As above, the signless deliverance of mind is identified by MA with the attainment of fruition. Of the four deliverances of mind mentioned in verse 30, this one alone is supramundane. The first three — thebrahmavihāras,the third immaterial attainment, and insight into the voidness of formations — all pertain to the mundane level.This is the way in which these states are different in meaning and different in name.",
    "mn43:72": "\"And what, friend, is the way in which these states are one in meaning and different only in name?",
    "mn43:73": "Lust is a maker of measurement, hate is a maker of measurement, delusion is a maker of measurement.[n.452] Lust, hate, and delusion may be understood as \"makers of measurement\"(pamāṇakaraṇa)in that they impose limitations upon the raṅge and depths of the mind; MA, however, explains this phrase to mean that the defilements enable one to measure a person as a worldling, a stream-enterer, a once-returner, or a non-returner.In a bhikkhu whose taints are destroyed, these are abandoned, cut off at the root, made like a palm stump, done away with so that they are no longer subject to future arising. Of all the kinds of immeasurable deliverance of mind, the unshakeable deliverance of mind is pronounced the best. Now that unshakeable deliverance of mind is void of lust, void of hate, void of delusion.[n.453] MA: There are twelve immeasurable deliverances of mind: the fourbrahmavihāras,the four paths, and the four fruits. The unshakeable deliverance of mind is the fruit of arahantship. The statement that this unshakeable deliverance is void of lust, hate, and delusion — repeated at the end of [the next two paragraphs] — also identifies it as the supramundane deliverance of mind through voidness.",
    "mn43:74": "That is what the venerable Sāriputta said. The venerable Mahā Koṭṭhita was satisfied and delighted in the venerable Sāriputta's words."
}