{
    "mn44:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Bamboo Grove, the Squirrels’ Sanctuary. Then the lay follower Visākha went to the bhikkhunī Dhammadinnā,[n.459] Visākha was a wealthy merchant of Rājagaha and a non-returner. Dhammadinnā, his former wife in lay life, had attained arahantship soon after her ordination as a bhikkhunī. She was declared by the Buddha the foremost bhikkhunī disciple in expounding the Dhamma.and after paying homage to her, he sat down at one side and asked her:",
    "mn44:2": "Saying, \"Good, lady,\" the lay follower Visākha delighted and rejoiced in the bhikkhunī Dhammadinnā's words. Then he asked her a further question:",
    "mn44:3": "\"Lady, ‘cessation of identity, cessation of identity’ is said. What is called the cessation of identity by the Blessed One?\"",
    "mn44:4": "\"Friend Visākha, it is the remainderless fading away and ceasing, the giving up, relinquishing, letting go, and rejecting of that same craving. This is called the cessation of identity by the Blessed One.\"",
    "mn44:5": "\"Lady, ‘the way leading to the cessation of identity, the way leading to the cessation of identity’ is said. What is called the way leading to the cessation of identity by the Blessed One?\"",
    "mn44:6": "\"Friend Visākha, it is just this Noble Eightfold Path; that is, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration.\"",
    "mn44:7": "\"Lady, is that clinging the same as these five aggregates affected by clinging, or is the clinging something apart from the five aggregates affected by clinging?\"",
    "mn44:8": "\"Lady, how does identity view come to be?\"",
    "mn44:9": "\"Lady, how does identity view not come to be?\"",
    "mn44:10": "\"Here, friend Visākha, a well-taught noble disciple, who has regard for noble ones and is skilled and disciplined in their Dhamma, who has regard for true men and is skilled and disciplined in their Dhamma, does not regard material form as self, or self as possessed of material form, or material form as in self, or self as in material form. He does not regard feeling as self, or self as possessed of feeling, or feeling as in self, or self as in feeling. He does not regard perception as self, or self as possessed of perception, or perception as in self, or self as in perception. He does not regard formations as self, or self as possessed of formations, or formations as in self, or self as in formations. He does not regard consciousness as self, or self as possessed of consciousness, or consciousness as in self, or self as in consciousness. That is how identity view does not come to be.\"",
    "mn44:11": "\"Lady, what is the Noble Eightfold Path?\"",
    "mn44:12": "\"Friend Visākha, it is just this Noble Eightfold Path; that is, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration.\"",
    "mn44:13": "\"Lady, is the Noble Eightfold Path conditioned or unconditioned?\"",
    "mn44:14": "\"Friend Visākha, the Noble Eightfold Path is conditioned.\"",
    "mn44:15": "\"Lady, are the three aggregates included by the Noble Eightfold Path, or is the Noble Eightfold Path included by the three aggregates?\"[n.463] The wordkhandhahere has a different meaning than in the more common context of the five aggregates affected by clinging. It here refers to a body of training principles, the three divisions of the Noble Eightfold Path into virtue(sīla), concentration(samādhi), and wisdom(paññā).",
    "mn44:16": "\"The three aggregates are not included by the Noble Eightfold Path, friend Visākha, but the Noble Eightfold Path is included by the three aggregates. Right speech, right action, and right livelihood — these states are included in the aggregate of virtue. Right effort, right mindfulness, and right concentration — these states are included in the aggregate of concentration. Right view and right intention — these states are included in the aggregate of wisdom.\"",
    "mn44:17": "\"Lady, what is concentration? What is the basis of concentration? What is the equipment of concentration? What is the development of concentration?\"",
    "mn44:18": "\"Unification of mind, friend Visākha, is concentration; the four foundations of mindfulness are the basis of concentration; the four right kinds of striving are the equipment of concentration; the repetition, development, and cultivation of these same states is the development of concentration therein.\"[n.464] The four foundations of mindfulness are the basis of concentration(samādhinimitta)in the sense of being its condition (MA). Here it would seem incorrect to translatenimittaas \"sign,\" in the sense of either distinctive mark or object. The four right kinds of striving are explained atMN 77.16.",
    "mn44:19": "\"Lady, how many formations are there?\"",
    "mn44:20": "\"There are these three formations, friend Visākha: the bodily formation, the verbal formation, and the mental formation.\"",
    "mn44:21": "\"But, lady, what is the bodily formation? What is the verbal formation? What is the mental formation?\"",
    "mn44:22": "\"In-breathing and out-breathing, friend Visākha, are the bodily formation; applied thought and sustained thought are the verbal formation; perception and feeling are the mental formation.\"[n.465]MA:Dhammadinnā anticipated Visākha's intention to ask about the formations that cease when one enters the attainment of cessation. Thus she explained the three formations in this way rather than as wholesome and unwholesome volitions of body, speech, and mind, the meaning relevant within the context of dependent origination.",
    "mn44:23": "\"But, lady, why are in-breathing and out-breathing the bodily formation? Why are applied thought and sustained thought the verbal formation? Why are perception and feeling the mental formation?\"",
    "mn44:24": "\"Friend Visākha, in-breathing and out-breathing are bodily, these are states bound up with the body; that is why in-breathing and out-breathing are the bodily formation. First one applies thought and sustains thought, and subsequently one breaks out into speech; that is why applied thought and sustained thought are the verbal formation. Perception and feeling are mental, these are states bound up with the mind; that is why perception and feeling are the mental formation.\"[n.466] MA explains further that the bodily formation and the mental formation are said to be formations \"bound up\" with the body and the mind in the sense that they are formed by the body and by the mind, while the verbal formation is a formation in the sense that it forms speech. The verb formvitakketvā vicāretvāhas been rendered in a way that maintains consistency with the rendering of the nounsvitakkaandvicāraas \"applied thought\" and \"sustained thought.\"",
    "mn44:25": "\"Lady, how does the attainment of the cessation of perception and feeling come to be?\"",
    "mn44:26": "\"Friend Visākha, when a bhikkhu is attaining the cessation of perception and feeling, it does not occur to him: ‘I shall attain the cessation of perception and feeling,’ or ‘I am attaining the cessation of perception and feeling,’ or ‘I have attained the cessation of perception and feeling’; but rather his mind has previously been developed in such a way that it leads him to that state.\"[n.467] Cessation can be attained only by a non-returner or an arahant with mastery over the eight jhānic attainments. The meditator enters each attainment in turn, emerges from it, and contemplates it with insight as impermanent, suffering, and not self. After completing this procedure through the base of nothingness, he attends to certain preliminary duties, and then determines to be without mind for a particular length of time. He then briefly enters the base of neither-perception-nor-non-perception, after which mind and mental functions utterly cease. Thus his determination, backed by his previous accomplishments and preparations, leads him into the attainment of cessation. See Vsm XXIII, 32–43.",
    "mn44:27": "\"Lady, when a bhikkhu is attaining the cessation of perception and feeling, which states cease first in him: the bodily formation, the verbal formation, or the mental formation?\"",
    "mn44:28": "\"Friend Visākha, when a bhikkhu is attaining the cessation of perception and feeling, first the verbal formation ceases, then the bodily formation, then the mental formation.\"[n.468] Applied and sustained thought cease first in the second jhāna; in-and-out breathing cease next in the fourth jhāna; and perception and feeling cease last in the attainment of cessation itself.",
    "mn44:29": "\"Lady, how does emergence from the attainment of the cessation of perception and feeling come to be?\"",
    "mn44:30": "\"Friend Visākha, when a bhikkhu is emerging from the attainment of the cessation of perception and feeling, it does not occur to him: ‘I shall emerge from the attainment of the cessation of perception and feeling,’ or ‘I am emerging from the attainment of the cessation of perception and feeling,’ or ‘I have emerged from the attainment of the cessation of perception and feeling’; but rather his mind has previously been developed in such a way that it leads him to that state.\"[n.469] When the time decided upon by the determination for the attainment has lapsed, by reason of that prior determination the meditator spontaneously emerges from the attainment of cessation and the mind-process resumes.",
    "mn44:31": "\"Lady, when a bhikkhu is emerging from the attainment of the cessation of perception and feeling, which states arise first in him: the bodily formation, the verbal formation, or the mental formation?\"",
    "mn44:32": "\"Friend Visākha, when a bhikkhu is emerging from the attainment of the cessation of perception and feeling, first the mental formation arises, then the bodily formation, then the verbal formation.\"[n.470]MA: When one emerges from cessation, the consciousness of fruition attainment arises first, and the perception and feeling associated with that are the mental formation that arises first. Then, with the subsequent descent into the life continuum, the bodily formation, i.e., breathing, recommences. And subsequently, when the meditator resumes his ordinary activity, the verbal formation arises.",
    "mn44:33": "\"Lady, when a bhikkhu has emerged from the attainment of the cessation of perception and feeling, how many kinds of contact touch him?\"",
    "mn44:34": "\"Friend Visākha, when a bhikkhu has emerged from the attainment of the cessation of perception and feeling, three kinds of contact touch him: voidness contact, signless contact, desireless contact.\"[n.471] The first state of consciousness to arise on emerging from cessation is that of fruition attainment, which is called voidness, the signless, and the desireless because of its own inherent quality and because of its object, Nibbāna. Here these three names for fruition are assigned to the contact associated with fruition.",
    "mn44:35": "\"Lady, when a bhikkhu has emerged from the attainment of the cessation of perception and feeling, to what does his mind incline, to what does it lean, to what does it tend?\"",
    "mn44:36": "\"Friend Visākha, when a bhikkhu has emerged from the attainment of the cessation of perception and feeling, his mind inclines to seclusion, leans to seclusion, tends to seclusion.\"[n.472]MṬ:Nibbāna, the object of the fruition consciousness that arises on emerging from cessation, is called seclusion(viveka)because it is secluded from all conditioned things.",
    "mn44:37": "\"Lady, how many kinds of feeling are there?\"",
    "mn44:38": "\"Friend Visākha, there are three kinds of feeling: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling.\"",
    "mn44:39": "\"But, lady, what is pleasant feeling? What is painful feeling? What is neither painful-nor-pleasant feeling?\"",
    "mn44:40": "\"Friend Visākha, whatever is felt bodily or mentally as pleasant and soothing is pleasant feeling. Whatever is felt bodily or mentally as painful and hurting is painful feeling. Whatever is felt bodily or mentally as neither soothing nor hurting is neither-painful-nor-pleasant feeling.\"",
    "mn44:41": "\"Lady, what is pleasant and what is painful in regard to pleasant feeling? What is painful and what is pleasant in regard to painful feeling? What is pleasant and what is painful in regard to neither-painful-nor-pleasant feeling?\"",
    "mn44:42": "\"Friend Visākha, pleasant feeling is pleasant when it persists and painful when it changes. Painful feeling is painful when it persists and pleasant when it changes. Neither-painful-nor-pleasant feeling is pleasant when there is knowledgeof itand painful when there is no knowledgeof it.\"",
    "mn44:43": "\"Lady, what underlying tendency underlies pleasant feeling? What underlying tendency underlies painful feeling? What underlying tendency underlies neither-painful-nor-pleasant feeling?\"",
    "mn44:44": "\"Friend Visākha, the underlying tendency to lust underlies pleasant feeling. The underlying tendency to aversion underlies painful feeling. The underlying tendency to ignorance underlies neither-painful-nor-pleasant feeling.\"[n.473]MṬ:The three defilements are calledanusaya, underlying tendencies, in the sense that they have not been abandoned in the mental continuum to which they belong and because they are capable of arising when a suitable cause presents itself.",
    "mn44:45": "\"Lady, does the underlying tendency to lust underlie all pleasant feeling? Does the underlying tendency to aversion underlie all painful feeling? Does the underlying tendency to ignorance underlie all neither-painful-nor-pleasant feeling?\"",
    "mn44:46": "\"Friend Visākha, the underlying tendency to lust does not underlie all pleasant feeling. The underlying tendency to aversion does not underlie all painful feeling. The underlying tendency to ignorance does not underlie all neither-painful-nor-pleasant feeling.\"",
    "mn44:47": "\"Lady, what should be abandoned in regard to pleasant feeling? What should be abandoned in regard to painful feeling? What should be abandoned in regard to neither-painful-nor-pleasant feeling?\"",
    "mn44:48": "\"Friend Visākha, the underlying tendency to lust should be abandoned in regard to pleasant feeling. The underlying tendency to aversion should be abandoned in regard to painful feeling. The underlying tendency to ignorance should be abandoned in regard to neither-painful-nor-pleasant feeling.\"",
    "mn44:49": "\"Lady, does the underlying tendency to lust have to be abandoned in regard to all pleasant feeling? Does the underlying tendency to aversion have to be abandoned in regard to all painful feeling? Does the underlying tendency to ignorance have to be abandoned in regard to all neither-painful-nor-pleasant feeling?\"",
    "mn44:50": "\"Friend Visākha, the underlying tendency to lust does not have to be abandoned in regard to all pleasant feeling. The underlying tendency to aversion does not have to be abandoned in regard to all painful feeling. The underlying tendency to ignorance does not have to be abandoned in regard to all neither-painful-nor-pleasant feeling.",
    "mn44:51": "\"Lady, what is the counterpart of pleasant feeling?\"[n.477] The word \"counterpart\"(paṭibhāga)is used to express the relationships of both opposition and supplementation.",
    "mn44:52": "\"Friend Visākha, painful feeling is the counterpart of pleasant feeling.\"",
    "mn44:53": "\"What is the counterpart of painful feeling?\"",
    "mn44:54": "\"Pleasant feeling is the counterpart of painful feeling.\"",
    "mn44:55": "\"What is the counterpart of neither-painful-nor-pleasant feeling?\"",
    "mn44:56": "\"Ignorance is the counterpart of neither-painful-nor pleasant feeling.\"[n.478] Ignorance is its counterpart because neither-painful-nor-pleasant feeling is subtle and difficult to recognise.",
    "mn44:57": "\"What is the counterpart of ignorance?\"",
    "mn44:58": "\"True knowledge is the counterpart of ignorance.\"",
    "mn44:59": "\"What is the counterpart of true knowledge?\"",
    "mn44:60": "\"Deliverance is the counterpart of true knowledge.\"",
    "mn44:61": "\"What is the counterpart of deliverance?\"",
    "mn44:62": "\"Nibbāna is the counterpart of deliverance.\"",
    "mn44:63": "\"Lady, what is the counterpart of Nibbāna?\"",
    "mn44:64": "Then the lay follower Visākha, having delighted and rejoiced in the bhikkhunī Dhammadinnā's words, rose from his seat, and after paying homage to her, keeping her on his right, he went to the Blessed One. After paying homage to him, he sat down at one side and told the Blessed One his entire conversation with the bhikkhunī Dhammadinnā. When he finished speaking, the Blessed One told him:",
    "mn44:65": "That is what the Blessed One said. The lay follower Visākha was satisfied and delighted in the Blessed One's words."
}