{
    "mn45:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn45:2": "\"What, bhikkhus, is the way of undertaking things that is pleasant now and ripens in the future as pain? Bhikkhus, there are certain recluses and brahmins whose doctrine and view is this: ‘There is no harm in sensual pleasures.’ They take to gulping down sensual pleasures and divert themselves with women wanderers who wear their hair bound in a topknot. They say thus: ‘What future fear do these good recluses and brahmins see in sensual pleasures when they speak of abandoning sensual pleasures and describe the full understanding of sensual pleasures? Pleasant is the touch of this woman wanderer's tender soft downy arm!’ Thus they take to gulping down sensual pleasures, and having done so, on the dissolution of the body, after death, they reappear in a state of deprivation, in an unhappy destination, in perdition, even in hell. There they feel painful, racking, piercing feelings. They say thus: ‘This is the future fear those good recluses and brahmins saw in sensual pleasures when they spoke of abandoning sensual pleasures and described the full understanding of sensual pleasures. For it is by reason of sensual pleasures, owing to sensual pleasures, that we are now feeling painful, racking, piercing feelings.’",
    "mn45:3": "\"Bhikkhus, suppose that in the last month of the hot season a māluva-creeper pod burst open and a māluva-creeper seed fell at the foot of a sāla tree. Then a deity living in that tree became fearful, perturbed, and frightened; but the deity's friends and companions, kinsmen and relatives — garden deities, park deities, tree deities, and deities inhabiting medicinal herbs, grass, and forest-monarch trees — gathered together and reassured that deity thus: ‘Have no fear, sir, have no fear. Perhaps a peacock will swallow the māluva-creeper seed or a wild animal will eat it or a forest fire will burn it or woodsmen will carry it off or white ants will devour it or it may not even be fertile.’ But no peacock swallowed that seed, no wild animal ate it, no forest fire burned it, no woodsmen carried it off, no white ants devoured it, and it was in fact fertile. Then, being moistened by rain from a rain-bearing cloud, the seed in due course sprouted and the māluva creeper's tender soft downy tendril wound itself around that sāla tree. Then the deity living in the sāla tree thought: ‘What future fear did my friends and companions, kinsmen and relatives … see in that māluva-creeper seed when they gathered together and reassured me as they did? Pleasant is the touch of this māluva creeper's tender soft downy tendril!’ Then the creeper enfolded the sāla tree, made a canopy over it, draped a curtain all around it, and split the main branches of the tree. The deity who lived in the tree then realised: ‘This is the future fear they saw in that māluva-creeper seed. Because of that māluva-creeper seed I am now feeling painful, racking, piercing feelings.’",
    "mn45:4": "\"So too, bhikkhus, there are certain recluses and brahmins whose doctrine and view is this: ‘There is no harm in sensual pleasures. ’ … They say thus: ‘This is the future fear those good recluses and brahmins saw in sensual pleasures … that we are now feeling painful, racking, piercing feelings.’ This is called the way of undertaking things that is pleasant now and ripens in the future as pain.",
    "mn45:5": "\"And what, bhikkhus, is the way of undertaking things that is painful now and ripens in the future as pain? Here, bhikkhus, someone goes naked, rejecting conventions, licking his hands, not coming when asked, not stopping when asked; He does not accept food brought or food specially made or an invitation to a meal; He receives nothing from a pot, from a bowl, across a threshold, across a stick, across a pestle, from two eating together, from a pregnant woman, from a woman giving suck, from a woman in the midst of men, from where food was advertised to be distributed, from where a dog was waiting, from where flies were buzzing; He accepts no fish or meat, drink no liquor, wine, or fermented brew. He keeps to one house, to one morsel; He keeps to two houses, to two morsels; … He keeps to seven houses, to seven morsels. He lives on one saucerful a day, on two saucerfuls a day … on seven saucerfuls a day; He takes food once a day, once every two days … once every seven days; thus even up to once every fortnight, He dwells pursuing the practice of taking food at stated intervals.",
    "mn45:6": "He eats greens or millet or wild rice or hide-parings or moss or ricebran or rice-scum or sesamum flour or grass or cowdung. He lives on forest roots and fruits; He feeds on fallen fruits.",
    "mn45:7": "He clothes himself in hemp, in hemp-mixed cloth, in shrouds, in refuse rags, in tree bark, in antelope hide, in strips of antelope hide, in kusagrass fabric, in bark fabric, in wood-shavings fabric, in head-hair wool, in animal wool, in owls’ wings. He pulls out hair and beard, pursuing the practice of pulling out hair and beard. He stands continuously, rejecting seats. He squats continuously, devoted to maintaining the squatting position. He uses a mattress of spikes; He makes a mattress of spikes his bed. He dwells pursuing the practice of bathing in water three times daily including the evening. Thus in such a variety of ways he dwells pursuing the practice of tormenting and mortifying the body. On the dissolution of the body, after death, he reappears in a state of deprivation, in an unhappy destination, in perdition, even in hell. This is called the way of undertaking things that is painful now and ripens in the future as pain.",
    "mn45:8": "\"And what, bhikkhus, is the way of undertaking things that is painful now and ripens in the future as pleasure? Here, bhikkhus, someone by nature has strong lust, and he constantly experiences pain and grief born of lust; by nature he has strong hate, and he constantly experiences pain and grief born of hate; by nature he has strong delusion, and he constantly experiences pain and grief born of delusion. Yet in pain and grief, weeping with tearful face, he leads the perfect and pure holy life. On the dissolution of the body, after death, he reappears in a happy destination, even in the heavenly world. This is called the way of undertaking things that is painful now and ripens in the future as pleasure.",
    "mn45:9": "\"And what, bhikkhus, is the way of undertaking things that is pleasant now and ripens in the future as pleasure? Here, bhikkhus, someone by nature does not have strong lust, and he does not constantly experience pain and grief born of lust; by nature he does not have strong hate, and he does not constantly experience pain and grief born of hate; by nature he does not have strong delusion, and he does not constantly experience pain and grief born of delusion. Quite secluded from sensual pleasures, secluded from unwholesome states, he enters upon and abides in the first jhāna … With the stilling of applied and sustained thought, he enters upon and abides in the second jhāna … With the fading away as well of rapture … he enters upon and abides in the third jhāna … With the abandoning of pleasure and pain … he enters upon and abides in the fourth jhāna … On the dissolution of the body, after death, he reappears in a happy destination, even in the heavenly world. This is called the way of undertaking things that is pleasant now and ripens in the future as pleasure. These, bhikkhus, are the four ways of undertaking things.\"",
    "mn45:10": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}