{
    "mn48:1": "Thus have I heard. On one occasion the Blessed One was living at Kosambī in Ghosita's Park.",
    "mn48:2": "Then the Blessed One addressed a certain bhikkhu thus: \"Come, bhikkhu, tell those bhikkhus in my name that the Teacher calls them.\" — \"Yes, venerable sir,\" he replied, and he went to those bhikkhus and told them: \"The Teacher calls the venerable ones.\"",
    "mn48:3": "Then the Blessed One addressed the bhikkhus thus: \"Bhikkhus, there are these six principles of cordiality[n.492]Cha dhammā sārāṇīyā.Ñm had rendered this expression \"six memorable qualities,\" which was adopted in the first edition. In this he follows the commentaries, which gloss the phrase, \"fit to be remembered; not to be forgotten even with the passage of time\"(saritabbayutt̄ addhāne atikkante pi na pamusitabbā). The correct derivation, however, as PED notes, is from Sktsaṁranājanīya,\"causing delight.\"that create love and respect and conduce to cohesion, to non-dispute, to concord, and to unity. What are the six?",
    "mn48:4": "\"Again, a bhikkhu maintains verbal acts of loving-kindness both in public and in private towards his companions in the holy life. This too is a principle of cordiality that creates love and respect, and conduces to … unity.",
    "mn48:5": "\"Again, a bhikkhu maintains mental acts of loving-kindness both in public and in private towards his companions in the holy life. This too is a principle of cordiality that creates love and respect, and conduces to … unity.",
    "mn48:6": "\"Again, a bhikkhu uses things in common with his virtuous companions in the holy life; without making reservations, he shares with them any gain of a kind that accords with the Dhamma and has been obtained in a way that accords with the Dhamma, including even the mere contents of his bowl. This too is a principle of cordiality that creates love and respect, and conduces to … unity.",
    "mn48:7": "\"Again, a bhikkhu dwells both in public and in private possessing in common with his companions in the holy life those virtues that are unbroken, untorn, unblotched, unmottled, liberating, commended by the wise, not misapprehended, and conducive to concentration. This too is a principle of cordiality that creates love and respect, and conduces to … unity.",
    "mn48:8": "\"Again, a bhikkhu dwells both in public and in private possessing in common with his companions in the holy life that view that is noble and emancipating, and leads one who practises in accordance with it to the complete destruction of suffering.[n.493]MA: This is the right view belonging to the noble path.This too is a principle of cordiality that creates love and respect, and conduces to cohesion, to non-dispute, to concord, and to unity.",
    "mn48:9": "\"These are the six principles of cordiality that create love and respect, and conduce to cohesion, to non-dispute, to concord, and to unity.",
    "mn48:10": "\"And how does this view that is noble and emancipating lead the one who practises in accordance with it to the complete destruction of suffering?",
    "mn48:11": "\"Again, a noble disciple considers thus: ‘When I pursue, develop, and cultivate this view, do I personally obtain serenity, do I personally obtain quenching?’",
    "mn48:12": "\"Again, a noble disciple considers thus: ‘Is there any other recluse or brahmin outsidethe Buddha’s Dispensationpossessed of a view such as I possess?’",
    "mn48:13": "\"Again, a noble disciple considers thus: ‘Do I possess the character[n.495]Dhammatā.of a person who possesses right view?’ What is the character of a person who possesses right view? This is the character of a person who possesses right view: although he may commit some kind of offence for which a means of rehabilitation has been laid down,[n.496] This is a breach of the code of monastic discipline from which a bhikkhu can be rehabilitated either by a formal act of the Saṅgha or by confession to another bhikkhu. Even though a noble disciple may commit such an offence unintentionally or through lack of knowledge, he makes no attempt to conceal it but immediately discloses it and seeks the means of rehabilitation.still he at once confesses, reveals, and discloses it to the Teacher or to wise companions in the holy life, and having done that, he enters upon restraint for the future. Just as a young, tender infant lying prone at once draws back when he puts his hand or his foot on a live coal, so too, that is the character of a person who possesses right view.",
    "mn48:14": "\"Again, a noble disciple considers thus: ‘Do I possess the character of a person who possesses right view?’ What is the character of a person who possesses right view? This is the character of a person who possesses right view: although he may be active in various matters for his companions in the holy life, yet he has a keen regard for training in the higher virtue, training in the higher mind, and training in the higher wisdom. Just as a cow with a new calf, while she grazes watches her calf, so too, that is the character of a person who possesses right view.",
    "mn48:15": "\"Again, a noble disciple considers thus: ‘Do I possess the strength of a person who possesses right view?’ What is the strength of a person who possesses right view? This is the strength of a person who possesses right view: when the Dhamma and Discipline proclaimed by the Tathāgata is being taught, he heeds it, gives it attention, engages it with all his mind, hears the Dhamma as with eager ears.",
    "mn48:16": "\"Again, a noble disciple considers thus: ‘Do I possess the strength of a person who possesses right view?’ What is the strength of a person who possesses right view? This is the strength of a person who possesses right view: when the Dhamma and Discipline proclaimed by the Tathāgata is being taught, he gains inspiration in the meaning, gains inspiration in the Dhamma, gains gladness connected with the Dhamma.[n.497]Labhati atthavedaṁ labhati dhammavedaṁ.Ven. Nyanaponika renders: “He gains enthusiasm for the goal, gains enthusiasm for the Dhamma.” MA explains veda as meaning joy and the knowledge connected with that joy, and says: “Atthavedais the inspiration arisen in one who reviews his unwavering confidence; dhammaveda is the inspiration arisen in one who reviews the abandonment of the defilements in part, the cause of that unwavering confidence.”",
    "mn48:17": "\"When a noble disciple is thus possessed of seven factors, he has well sought the character for realisation of the fruit of stream-entry. When a noble disciple is thus possessed of seven factors, he possesses the fruit of stream-entry.\"[n.498]MAcalls those seven factors the \"great reviewing knowledges\"(mahāpaccavekkaṇāṇa)of a stream-enterer. On the reviewing knowledges see Vsm XXII, 19–21.",
    "mn48:18": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}