{
    "mn49:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn49:2": "\"Bhikkhus, on one occasion I was living at Ukkaṭṭhā in the Subhaga Grove at the root of a royal sāla tree.[n.499] The Mūlapariyāya Sutta (MN 1) was also delivered by the Buddha while he was living in the Subhaga Grove at Ukkaṭṭhā, and the similarity in formulation and theme between these two suttas — perhaps the only two recorded as originating at Ukkaṭṭhā — is striking. It is even possible to see the present sutta as a dramatic representation of the same ideas set forth by the Mūlapariyāya in abstract philosophical terms. Thus Baka the Brahmā may be taken to represent being(bhava)or personality(sakkāya)in its most eminent form, blindly engaged in the activity of conceiving(maññanā), sustaining itself with its delusions of permanence, pleasure, and selfhood. Underlying being is craving, symbolised by Māra — seemingly inconspicuous in the assembly, yet the real author of all the outpourings of conceiving, the one who holds the entire universe in his grip. The alliance of Brahmā and Māra, God and Satan, an incomprehensible union from the perspective of Western theism, points to the thirst for continued being as the hidden root of all world affirmation, whether theistic or non-theistic. In the sutta the superficial theoretical contest between Baka and the Buddha soon gives way to a gripping deep-level confrontation between Māra and the Buddha — M̄ra as craving demanding the affirmation of being, the Enlightened One pointing to the cessation of being through the uprooting of delight.Now on that occasion a pernicious view had arisen in Baka the Brahmā thus: ‘This is permanent, this is everlasting, this is eternal, this is total, this is not subject to pass away; for this is where one is neither born nor ages nor dies nor passes away nor reappears, and beyond this there is no other escape.’[n.500] A similar encounter between the Buddha and Baka is recorded atSN 6:4/i.14–44, though without the dramatic trappings of this meeting and with an extended exchange in verse. According to MA and MṬ, he held this eternalist view with regard to both his own individual personality and the world over which he presided. His denial of an \"escape beyond\" is a rejection of the higher jhāna planes, the paths and fruits, and Nibbāna, none of which he even knows exist.",
    "mn49:3": "\"When this was said, I told Baka the Brahmā: ‘The worthy Baka the Brahmā has lapsed into ignorance; he has lapsed into ignorance in that he says of the impermanent that it is permanent, of the transient that it is everlasting, of the non-eternal that it is eternal, of the incomplete that it is total, of what is subject to pass away that it is not subject to pass away, of where one is born, ages, dies, passes away, and reappears, that here one is neither born nor ages nor dies nor passes away nor reappears; and when there is another escape beyond this, he says there is no other escape beyond this.’",
    "mn49:4": "\"Then Māra the Evil One took possession of a member of the Brahmā's Assembly,[n.501]MA:When Māra discovered that the Buddha had gone to the Brahma-world, he became anxious that the Brahmās might be won over to the Dhamma and escape from his control; thus he went there to discourage the Buddha from teaching the Dhamma.and he told me: ‘Bhikkhu, bhikkhu, do not disparage him, do not disparage him; for this Brahmā is the Great Brahmā, the Overlord, the Untranscended, of Infallible Vision, Wielder of Mastery, Lord Maker and Creator, Most High Providence, Master and Father of those that are and ever can be. Before your time, bhikkhu, there were recluses and brahmins in the world who condemned earth and were disgusted with earth,[n.502]MA:Because they considered it to be impermanent, suffering, and not self.who condemned water and were disgusted with water, who condemned fire and were disgusted with fire, who condemned air and were disgusted with air, who condemned beings and were disgusted with beings, who condemned gods and were disgusted with gods, who condemned Pajāpati and were disgusted with Pajāpati, who condemned Brahmā and were disgusted with Brahmā; and on the dissolution of the body, when their life was cut off, they became established in an inferior body.[n.503]MA:In the four states of deprivation. Here, and at verse 10 and verse 29, the word \"body\"(kāya)is used to mean plane of existence.Before your time, bhikkhu, there were also recluses and brahmins in the world who lauded earth and delighted in earth,[n.50] MA: They lauded it by speaking praise of it as permanent, everlasting, eternal, etc., and delighted in it by way of craving and views.who lauded water and delighted in water, who lauded fire and delighted in fire, who lauded air and delighted in air, who lauded beings and delighted in beings, who lauded gods and delighted in gods, who lauded Pajāpati and delighted in Pajāpati, who lauded Brahmā and delighted in Brahmā; and on the dissolution of the body, when their life was cut off, they became established in a superior body.[n.505] MA: In the Brahma-world.So, bhikkhu, I tell you this: Be sure, good sir, to do only as the Brahmā says; never overstep the word of the Brahmā. If you overstep the word of the Brahmā, bhikkhu, then, like a man using a stick to chase away the goddess of luck when she approaches, or like a man missing the earth with his hands and feet as he slips into a deep chasm, so it will befall you, bhikkhu. Be sure, good sir, to do only as the Brahmā says; never overstep the word of the Brahmā. Do you not see the Brahmā's Assembly seated here, bhikkhu?’ And Māra the Evil One thus called to witness the Brahmā's Assembly.[n.506] MA: Māra's intention is to show: \"If you do as Brahmā says without overstepping his word, you too will shine with the same splendour and glory as that with which the Brahmā's Assembly shines.\"",
    "mn49:5": "\"When this was said, I told Māra the Evil One: ‘I know you, Evil One. Do not think: \"He does not know me.\" You are Māra, Evil One, and the Brahmā and the Brahmā's Assembly and the members of the Brahmā's Assembly have all fallen into your hands, they have all fallen into your power. You, Evil One, think: \"This one too has fallen into my hands, he too has fallen into my power\"; but I have not fallen into your hands, Evil One, I have not fallen into your power.’",
    "mn49:6": "\"When this was said, Baka the Brahmā told me: ‘Good sir, I say of the permanent that it is permanent, of the everlasting that it is everlasting, of the eternal that it is eternal, of the total that it is total, of what is not subject to pass away that it is not subject to pass away, of where one is neither born nor ages nor dies nor passes away nor reappears that here one is neither born nor ages nor dies nor passes away nor reappears; and when there is no escape beyond this, I say that there is no escape beyond this. Before your time, bhikkhu, there were recluses and brahmins in the world whose asceticism lasted as long as your whole life. They knew, when there is another escape beyond, that there is another escape beyond, and when there is no other escape beyond, that there is no other escape beyond. So, bhikkhu, I tell you this: You will find no other escape beyond, and eventually you will reap only weariness and disappointment. If you will hold to earth, you will be close to me, within my domain, for me to work my will upon and punish.[n.507]MAsays that by the first two terms he tries to cajole the Buddha, by the remaining two terms he threatens him. To \"hold to earth\" is to grasp it by way of craving, conceit, and views. The list of categories here, though condensed, is reminiscent ofMN 1.If you hold to water … to fire … to air … to beings … to gods … to Pajāpati … to Brahmā, you will be close to me, within my domain, for me to work my will upon and punish.’",
    "mn49:7": "\"‘I know that too, Brahmā. If I will hold to earth, I shall be close to you, within your domain, for you to work your will upon and punish. If I will hold to water … to fire … to air … to beings … to gods … to Pajāpati … to Brahmā, I shall be close to you, within your domain, for you to work your will upon and punish. Further, I understand your reach and your sway to extend thus: Baka the Brahmā has this much power, this much might, this much influence.’",
    "mn49:8": "\"‘Now, good sir, how far do you understand my reach and my sway to extend?’",
    "mn49:9": "\"‘As far as moon and sun revolveShining and lighting up the quarters,Over a thousandfold such worldDoes your sovereignty extend.",
    "mn49:10": "And there you know the high and low,And those with lust and free from lust,The state that is thus and otherwise,The coming and going of beings.",
    "mn49:11": "Brahmā, I understand your reach and your sway to extend thus: Baka the Brahmā has this much power, this much might, this much influence.[n.508] MA: Baka Brahmā was a Brahmā exercising sovereignty over a thousand world-systems, but above him there are Brahmās exercising sovereignty over two, three, four, five, ten thousand, and a hundred thousand world-systems.",
    "mn49:12": "\"‘But, Brahmā, there are three other bodies, which you neither know nor see, and which I know and see. There is the body calledthe gods ofStreaming Radiance, from which you passed away and reappeared here.[n.509] The body of Streaming Radiance is a realm of rebirth pertaining to the second jhāna, while Baka Brahmā's realm pertains only to the first jhāna. The body of Refulgent Glory and the body of Great Fruit in the next paragraph pertain to the third and fourth jhānas.Because you have dwelt here long, your memory of that has lapsed, and hence you do not know or see it, but I know and see it. Thus, Brahmā, in regard to direct knowledge I do not stand merely at the same level as you, how then could I know less? Rather, I know more than you.[n.510] In the Brahmajāla Sutta (DN 1.2.2–6/ii.17–19) the Buddha shows how Mahā Brahmā gives rise to the delusion that he is the supreme creator God. When the world begins to form again after a period of dissolution, a being of great merit is the first to be reborn in the newly formed Brahma-world. Subsequently, other beings take rebirth in the Brahma-world and this causes Mahā Brahmā to imagine that he is their creator and master. See Bodhi, TheDiscourse on the All-Embracing Net of Views,pp. 69–70, 159–166.",
    "mn49:13": "\"‘Good sir, if that is not partaken of by the allness of all, may it not turn out to be vacuous and empty for you!’[n.512] PTS is surely mistaken in omitting here thetiending a direct quotation; this misleads Horner into ascribing the following passage to Baka rather than to the Buddha (MLS 1:392). BBS and SBJ supply ti. Baka seems to be suggesting that since the object of the Buddha’s knowledge \"is not partaken of by the allness of all,\" it might be merely an empty concept.",
    "mn49:14": "\"‘Consciousness non-manifesting, Boundless, luminous all-round:[n.513] In the first edition, I retained Ñm’s own translation of these lines, which read.The consciousness that makes no showing,Nor has to do with finiteness,Not claiming being with respect to all.In retrospect, I find this rendering far from satisfactory and thus here offer my own. These lines (which also appear as part of a full verse atDN 11.85/i.223) have been a perennial challenge to Buddhist scholarship, and even Ācariya Buddhaghosa seems to founder over them.MAtakes the subject of the sentence to be Nibbāna, called \"consciousness\"(viññāṇṁ)in the sense that \"it can be cognized\"(vijānitabbaṁ). This derivation is hardly credible, since nowhere in the Nikāyas is Nibbāna described as consciousness, nor is it possible to derive an active noun from the gerundive. MA explainsanidassanaṁas meaning invisible, \"because it(Nibbāna)does not come within raṅge of eye-consciousness,\" but again this is a trite explanation. The wordanidassanaoccurs atMN 21.in the description of empty space as an unsuitable medium for painting pictures; thus the idea seems to be that of not making manifest.MA offers three explanations ofsabbato pabhaṁ:(1) completely possessed of luminosity(pabhā); (2) possessing being(pabhū̇taṁ)everywhere; and (3) a ford(pabhaṁ)accessible from all sides, i.e., through any of the thirty-eight meditation objects. Only the first of these seems to have any linguistic legitimacy. Ñm, in Ms, explains that he takespabhaṁto be a negative present participle ofpabhavati—apabhaṁ— the negative-prefix a dropping off in conjunction withsabbato:\"The sense can be paraphrased freely by ‘not predicating being in relation to \"all,\"’ or ‘not assuming of \"all\" that it is or is not in an absolute sense.’\" But if we takepabhaṁas \"luminous,\" which seems better justified, the verse links up with the idea of the mind as intrinsically luminous(pabhassaram idaṁ cittaṁ,AN i.10and also suggests the light of wisdom(pa), called the best of lightsAN ii.139). I understand this consciousness to be, not Nibbāna itself, but the arahant's consciousness during the meditative experience of Nibbāna. See in this connectionAN v.7–10(AN 10:6–AN 10:8),318–26(AN 11.7–AN 11.10). Note that this meditative experience does not make manifest any conditioned phenomena of the world, and thus may be truly described as \"non-manifesting.\"that is not partaken of by the earthness of earth, that is not partaken of by the waterness of water … … that is not partaken of by the allness of all.’",
    "mn49:15": "\"‘Good sir, I shall vanish from you.’",
    "mn49:16": "\"Then Baka the Brahmā, saying: ‘I shall vanish from the recluse Gotama, I shall vanish from the recluse Gotama,’ was unable to vanish. Thereupon I said: ‘Brahmā, I shall vanish from you.’",
    "mn49:17": "\"‘Having seen fear in beingAndhaving seenthat being will cease to be,I did not welcome any kind of being,Nor did I cling to delight.’[n.514] The Buddha’s disappearance seems to be a \"visible\" demonstration of his verse. Having extirpated delight in being, he is able to vanish from the sight of Baka, the supreme representative of being and world affirmation. But Baka, bound to being by clinging, cannot transcend the raṅge of the Buddha’s knowledge, which encompasses both being and non-being at the same time that it transcends them.",
    "mn49:18": "\"At that the Brahmā and the Brahmā's Assembly and the members of the Brahmā's Assembly were struck with wonder and amazement, saying: ‘It is wonderful, sirs, it is marvellous, the great power and great might of the recluse Gotama! We have never before seen or heard of any other recluse or brahmin who had such great power and such great might as has this recluse Gotama, who went forth from a Sakyan clan. Sirs, though living in a generation that delights in being, that takes delight in being, that rejoices in being, he has extirpated being together with its root.’",
    "mn49:19": "\"Then Māra the Evil One took possession of a member of the Brahmā's Assembly, and he said to me: ‘Good sir, if that is what you know, if that is what you have discovered, do not guide yourlaydisciples or those gone forth, do not teach the Dhamma to yourlaydisciples or to those gone forth, have no yearning forlaydisciples or for those gone forth. Before your time, bhikkhu, there were recluses and brahmins in the world claiming to be accomplished and fully enlightened, and they guided theirlaydisciples and those gone forth; they taught the Dhamma to theirlaydisciples and to those gone forth; they had a yearning forlaydisciples and for those gone forth; and on the dissolution of the body, when their life was cut off, they became established in an inferior body. Before your time, bhikkhu, there were also recluses and brahmins in the world claiming to be accomplished and fully enlightened, and they did not guide theirlaydisciples or those gone forth; they did not teach the Dhamma to theirlaydisciples or to those gone forth; they had no yearning forlaydisciples or for those gone forth; and on the dissolution of the body, when their life was cut off, they became established in a superior body. So, bhikkhu, I tell you this: Be sure, good sir, to abide inactive, devoted to a pleasant abiding here and now; this is better left undeclared, and so, good sir, do not advise anyone else.’[n.515] This is the same inclination that arose in the Buddha’s mind in the period immediately after his enlightenment — seeMN 26.. Compare also DN 16.3.34/ii.112 where Māra attempts to persuade the newly enlightened Buddha to pass away peacefully at once.",
    "mn49:20": "\"When this was said, I told Māra the Evil One: ‘I know you, Evil One. Do not think: \"He does not know me.\" You are Māra, Evil One. It is not out of compassion for their welfare that you speak thus, it is without compassion for their welfare that you speak thus. You think thus, Evil One: \"Those to whom the recluse Gotama teaches the Dhamma will escape from my sphere.\" Those recluses and brahmins of yours, Evil One, who claimed to be fully enlightened, were not fully enlightened. But I, who claim to be fully enlightened, am fully enlightened. If the Tathāgata teaches the Dhamma to disciples he is such, Evil One, and if the Tathāgata does not teach the Dhamma to disciples he is such.[n.516]Tādiso:that is, whether he teaches or not he remains the Tathāgata.If the Tathāgata guides disciples he is such, Evil One, and if the Tathāgata does not guide disciples he is such. Why is that? Because the Tathāgata has abandoned the taints that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death; he has cut them off at the root, made them like a palm stump, done away with them so that they are no longer subject to future arising. Just as a palm tree whose crown is cut off is incapable of further growth, so too, the Tathāgata has abandoned the taints that defilethem off at the root, made them like a palm stump, done away with them so that they are no longer subject to future arising.’\"",
    "mn49:21": "Thus, because Māra was unable to reply, and becauseit beganwith the Brahmā's invitation, this discourse is entitled \"On the Invitation of a Brahmā.\""
}