{
    "mn4:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn4:2": "\"Before my enlightenment, while I was still only an unenlightened Bodhisatta, I too considered thus: ‘Remote jungle-thicket resting places in the forest are hard to endure … the jungles must rob a bhikkhu of his mind, if he has no concentration.’",
    "mn4:3": "\"I considered thus: ‘Whenever recluses or brahmins unpurified in verbal conduct … unpurified in mental conduct … unpurified in livelihood resort to remote jungle-thicket resting places in the forest … they evoke unwholesome fear and dread. But … I am purified in livelihood. I resort to remote jungle-thicket resting places in the forest as one of the noble ones with livelihood purified.’ Seeing in myself this purity of livelihood, I found great solace in dwelling in the forest.",
    "mn4:4": "\"I considered thus: ‘Whenever recluses or brahmins who are covetous and full of lust … I am uncovetous … ’",
    "mn4:5": "\"‘ … with a mind of ill will and intentions of hate … I have a mind of loving-kindness … ’",
    "mn4:6": "\"‘ … overcome by sloth and torpor … I am without sloth and torpor … ’",
    "mn4:7": "\"‘ … overcome with restlessness and unpeaceful in mind … I have a peaceful mind … ’",
    "mn4:8": "\"‘ … uncertain and doubting … I have gone beyond doubt … ’",
    "mn4:9": "\"‘ … given to self-praise and disparagement of others … I am not given to self-praise and disparagement of others … ’",
    "mn4:10": "\"‘ … subject to alarm and terror … I am free from trepidation … ’",
    "mn4:11": "\"‘ … desirous of gain, honour, and renown … I have few wishes … ’",
    "mn4:12": "\"‘ … lazy and wanting in energy … I am energetic … ’",
    "mn4:13": "\"‘ … unmindful and not fully aware … I am established in mindfulness … ’",
    "mn4:14": "\"‘ … unconcentrated and with straying minds … I am possessed of concentration … ’",
    "mn4:15": "\" I considered thus: ‘Whenever recluses or brahmins devoid of wisdom, drivellers, resort to remote jungle-thicket resting places in the forest, then owing to the defect of their being devoid of wisdom and drivellers these good recluses and brahmins evoke unwholesome fear and dread. But I do not resort to remote jungle-thicket resting places in the forest devoid of wisdom, a driveller. I am possessed of wisdom.[n.58] Ñm originally had rendered this phrase as \"perfect in understanding,\" and the corresponding phrase in the preceding section as \"perfect in concentration.\" However, since it seems inappropriate to ascribe perfection in samādhi and paññā to the Bodhisatta prior to his enlightenment, I have chosen to render the suffix sampanna throughout as \"possessed of.\" MA explains that this is neither the wisdom of insight nor of the path, but the wisdom that defines the nature of its object(ārammaṇavavatthānapañña).I resort to remote jungle-thicket resting places in the forest as one of the noble ones possessed of wisdom.’ Seeing in myself this possession of wisdom, I found great solace in dwelling in the forest.",
    "mn4:16": "\"I considered thus: ‘There are the specially auspicious nights of the fourteenth, the fifteenth, and the eighth of the fortnight.[n.59] The Indian year, according to the ancient system inherited by Buddhism, is divided into three seasons — the cold season, the hot season, and the rainy season — each lasting for four months. The four months are subdivided into eight fortnights(pakkha), the third and the seventh containing fourteen days and the others fifteen days. Within each fortnight, the nights of the full moon and the new moon (either the fourteenth or fifteenth) and the night of the half-moon (the eighth) are regarded as especially auspicious. Within Buddhism these days become the Uposatha, the days of religious observance. On the full moon and new moon days the bhikkhus recite their code of precepts and lay people visit the monasteries to listen to sermons and to practise meditation.Now what if, on such nights as these, I were to dwell in such awe-inspiring, horrifying abodes as orchard shrines, woodland shrines, and tree shrines? Perhaps I might encounter that fear and dread.’ And later, on such specially auspicious nights as the fourteenth, the fifteenth, and the eighth of the fortnight, I dwelt in such awe-inspiring, horrifying abodes as orchard shrines, woodland shrines, and tree shrines. And while I dwelt there, a wild animal would come up to me, or a peacock would knock off a branch, or the wind would rustle the leaves. I thought: ‘What now if this is the fear and dread coming?’ I thought: ‘Why do I dwell always expecting fear and dread? What if I subdue that fear and dread while keeping the same posture that I am in when it comes upon me?’[n.60] The four postures(iriyāpatha)often mentioned in the Buddhist texts are walking, standing, sitting, and lying down.",
    "mn4:17": "\"There are, brahmin, some recluses and brahmins who perceive day when it is night and night when it is day. I say that on their part this is an abiding in delusion. But I perceive night when it is night and day when it is day. Rightly speaking, were it to be said of anyone: ‘A being not subject to delusion has appeared in the world for the welfare and happiness of many, out of compassion for the world, for the good, welfare, and happiness of gods and humans,’ it is of me indeed that rightly speaking this should be said.",
    "mn4:18": "\"Tireless energy was aroused in me and unremitting mindfulness was established, my body was tranquil and untroubled, my mind concentrated and unified.[n.61] Beginning with this section, the Buddha shows the course of practice that led him to the peak of non-delusion.",
    "mn4:19": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the recollection of past lives.[n.63] Explained in detail at Vsm XIII, 13–71.I recollected my manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion: ‘There I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared elsewhere; and there too I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared here.’ Thus with their aspects and particulars I recollected my manifold past lives.",
    "mn4:20": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the passing away and reappearance of beings.[n.64] Explained in detail at Vsm XIII, 72–101.With the divine eye, which is purified and surpasses the human, I saw beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate. I understood how beings pass on according to their actions thus: ‘These worthy beings who were ill conducted in body, speech, and mind, revilers of noble ones, wrong in their views, giving effect to wrong view in their actions, on the dissolution of the body, after death, have reappeared in a state of deprivation, in a bad destination, in perdition, even in hell; but these worthy beings who were well conducted in body, speech, and mind, not revilers of noble ones, right in their views, giving effect to right view in their actions, on the dissolution of the body, after death, have reappeared in a good destination, even in the heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, I saw beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and I understood how beings pass on according to their actions.",
    "mn4:21": "\"When my concentrated mind was thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, I directed it to knowledge of the destruction of the taints. I directly knew as it actually is: ‘This is suffering’; I directly knew as it actually is: ‘This is the origin of suffering’; I directly knew as it actually is: ‘This is the cessation of suffering’; I directly knew as it actually is: ‘This is the way leading to the cessation of suffering.’ I directly knew as it actually is: ‘These are the taints’; I directly knew as it actually is: ‘This is the origin of the taints’; I directly knew as it actually is: ‘This is the cessation of the taints’; I directly knew as it actually is: ‘This is the way leading to the cessation of the taints.’[n.65]MA:Having shown the Four Noble Truths in their own nature (that is, in terms of suffering), the passage on the taints is stated to show them indirectly by way of the defilements.",
    "mn4:22": "\"Now, brahmin, it might be that you think: ‘Perhaps the recluse Gotama is not free from lust, hate, and delusion even today, which is why he still resorts to remote jungle-thicket resting places in the forest.’ But you should not think thus. It is because I see two benefits that I still resort to remote jungle-thicket resting places in the forest: I see a pleasant abiding for myself here and now, and I have compassion for future generations.\"[n.68]MA:He has \"compassion for future generations\" insofar as later generations of monks, seeing that the Buddha resorted to forest dwellings, will follow his example and thus hasten their progress towards making an end of suffering.",
    "mn4:23": "\"Indeed, it is because Master Gotama is an Accomplished One, a Fully Enlightened One, that he has compassion for future generations. Magnificent, Master Gotama! Magnificent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. From today let Master Gotama remember me as a lay follower who has gone to him for refuge for life.\""
}