{
    "mn50:1": "Thus have I heard. On one occasion the venerable Mahā Moggallāna was living in the Bhagga country at Suṁsumāragira in the Bhesakaḷā Grove, the Deer Park.",
    "mn50:2": "He saw that Māra the Evil One had gone into his belly and had entered his bowels. When he saw this, he said: \"Come out, Evil One! Come out, Evil One! Do not harass the Tathāgata, do not harass the Tathāgata's disciple, or it will lead to your harm and suffering for a long time.\"",
    "mn50:3": "Then Māra the Evil One thought: \"This recluse does not know me, he does not see me when he says that. Even his teacher would not know me so soon, so how can this disciple know me?\"",
    "mn50:4": "Then the venerable Mahā Moggallāna said: \"Even thus I know you, Evil One. Do not think: ‘He does not know me.’ You are Māra, Evil One. You were thinking thus, Evil One: ‘This recluse does not know me, he does not see me when he says that. Even his teacher would not know me so soon, so how can this disciple know me?’\"",
    "mn50:5": "Then Māra the Evil One thought: \"The recluse knew me, he saw me when he said that,\" whereupon he came up from the venerable Mahā Moggallāna's mouth and stood against the door bar.",
    "mn50:6": "The venerable Mahā Moggallāna saw him standing there and said: \"I see you there too, Evil One. Do not think: ‘He does not see me.’ You are standing against the door bar, Evil One.",
    "mn50:7": "\"It happened once, Evil One, that the venerable Sañjīva had seated himself at the root of a certain tree and entered upon the cessation of perception and feeling. Some cowherds, shepherds, ploughmen, and travellers saw the venerable Sañjīva sitting at the root of the tree having entered upon the cessation of perception and feeling, and they thought: ‘It is wonderful, sirs, it is marvellous! This recluse died while sitting. Let us cremate him.’ Then the cowherds, shepherds, ploughmen, and travellers collected grass, wood, and cowdung, and having piled it up against the venerable Sañjīva's body, they set fire to it and went on their way.",
    "mn50:8": "\"Then, Evil One, the Māra Dūsī considered thus: ‘There are these virtuous bhikkhus of good character, but I do not know their coming or their going. Let me now take possession of the brahmin householders, telling them: \"Come now, abuse, revile, scold, and harass the virtuous bhikkhus of good character; then perhaps, when they are abused, reviled, scolded, and harassed by you, some change will come about in their minds whereby the Māra Dūsī may find an opportunity.\"’[n.522] That is, by causing defilements to arise in their minds, he will prevent them from escaping from saṁsāra.",
    "mn50:9": "\"Then, Evil One, the Māra Dūsī took possession of those brahmin householders, telling them: ‘Come now, abuse, revile, scold, and harass the virtuous bhikkhus of good character; then perhaps, when they are abused, reviled, scolded, and harassed by you, some change will come about in their minds whereby the Māra Dūsī may find an opportunity.’ Then, when the Māra Dūsī had taken possession of the brahmin householders, they abused, reviled, scolded, and harassed the virtuous bhikkhus of good character thus:[n.523]MAtakes pains to point out that Māra did not exercise control over their actions, in which case he alone would have been responsible and the brahmins could not have generated bad kamma by their deeds. Rather, Māra caused the brahmins to imagine scenes of the bhikkhus engaged in improper conduct, and this aroused their antagonism and induced them to harass the bhikkhus. Māra's intent in doing so was to make the bhikkhus give rise to anger and dejection.‘These bald-pated recluses, these swarthy menial offspring of the Kinsman's feet,[n.524] \"The Kinsman\"(bandhu)is Brahmā, who was called thus by the brahmins because they regarded him as their primal ancestor. MA explains that it was a belief among the brahmins that they themselves were the offspring of Brahmā's mouth, thekhattiyasof his breast, thevessasof his belly, thesuddasof his legs, andsamaṇasof the soles of his feet.claim: \"We are meditators, we are meditators!\" and with shoulders drooping, heads down and all limp, they meditate, premeditate, out-meditate, and mismeditate.[n.525]Jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti.Though the verbs individually do not have an established pejorative sense, the string is obviously intended as a denigration. AtMN108the four verbs are used to describe the meditation of one whose mind is obsessed by the five hindrances.Just as an owl on a branch waiting meditate, and mismeditate.[n.526a]Jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti.Though the verbs individually do not have an established pejorative sense, the string is obviously intended as a denigration. AtMN108the four verbs are used to describe the meditation of one whose mind is obsessed by the five hindrances.Just as an owl on a branch waiting for a mouse meditates, premeditates, out-meditates, and mismeditates, or just as a jackal on a river-bank waiting for fish meditates, premeditates, out-meditates, and mismeditates, or just as a cat, waiting for a mouse by an alley or drain or rubbish bin, meditates, premeditates, out-meditates, and mismeditates, or just as a donkey unladen, standing by a door-post or a dustbin or a drain, meditates, premeditates, out-meditates, and mismeditates, so too, these bald-pated recluses, these swarthy menial offspring of the Kinsman's feet, claim: \"We are meditators, we are meditators!\" and with shoulders drooping, heads down and all limp, they meditate, premeditate, out-meditate, and mismeditate.’",
    "mn50:10": "Now, Evil One, on that occasion most of those human beings, when they died, reappeared on the dissolution of the body, after death, in a state of deprivation, in an unhappy destination, in perdition, even in hell.",
    "mn50:11": "\"Then the Blessed One Kakusandha, accomplished and fully enlightened, addressed the bhikkhus thus: ‘Bhikkhus, the Māra Dūsī has taken possession of the brahmin householders, telling them: \"Come now, abuse, revile, scold, and harass the virtuous bhikkhus of good character; then perhaps, when they are abused, reviled, scolded, and harassed by you, some change will come about in their mind whereby the Māra Dūsī may find an opportunity.\" Come, bhikkhus, abide pervading one quarter with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to yourselves, abide pervading the all-encompassing world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, without hostility and without ill will. Abide pervading one quarter with a mind imbued with compassion … with a mind imbued with altruistic joy … with a mind imbued with equanimity … abundant, exalted, immeasurable, without hostility and without ill will.’[n.526] The fourbrahmavihārasare the appropriate antidote for the hostility of others, as well as for the tendencies to anger and dejection in one's own mind.",
    "mn50:12": "\"So, Evil One, when those bhikkhus had been thus advised and instructed by the Blessed One Kakusandha, accomplished and fully enlightened, then, gone to the forest or to the root of a tree or to an empty hut, they abided pervading one quarter with a mind imbued with loving-kindness … with a mind imbued with compassion … with a mind imbued with appreciative joy … with a mind imbued with equanimity … without hostility and without ill will.",
    "mn50:13": "\"Then, Evil One, the Māra Dūsī considered thus: ‘Though I do as I am doing, still I do not know the coming or the going of these virtuous bhikkhus of good character. Let me now take possession of the brahmin householders, telling them: \"Come now, honour, respect, revere, and venerate the virtuous bhikkhus of good character; then perhaps, when they are honoured, respected, revered, and venerated by you, some change will come about in their minds whereby the Māra Dūsī may find an opportunity.\"’[n.527] This time Māra's intent was to cause the bhikkhus to fall victim to pride, complacency, and negligence.",
    "mn50:14": "\"Then, Evil One, the Māra Dūsī took possession of those brahmin householders, telling them: ‘Come now, honour, respect, revere, and venerate the virtuous bhikkhus of good character; then perhaps, when they are honoured, respected, revered, and venerated by you, some change will come about in their minds whereby the Māra Dūsī may find an opportunity.’ Then, when the Māra Dūsī had taken possession of the brahmin householders, they honoured, respected, revered, and venerated the virtuous bhikkhus of good character.",
    "mn50:15": "Now, Evil One, on that occasion most of those human beings, when they died, reappeared on the dissolution of the body, after death, in a happy destination, even the heavenly world.",
    "mn50:16": "\"Then, Evil One, the Blessed One Kakusandha, accomplished and fully enlightened, addressed the bhikkhus thus: ‘Bhikkhus, the Māra Dūsī has taken possession of those brahmin householders, telling them: \"Come now, honour, respect, revere, and venerate the virtuous bhikkhus of good character; then perhaps, when they are honoured, respected, revered, and venerated by you, some change will come about in their minds whereby the Māra Dūsī may find an opportunity.\" Come, bhikkhus, abide contemplating foulness in the body, perceiving repulsiveness in nutriment, perceiving disenchantment with all the world, contemplating impermanence in all formations.’[n.528]MAquotes a sutta (AN 7:46/iv.46–53) stating that these four meditations are the antidotes, respectively, for sexual desire, craving for tastes, attraction to the world, and infatuation with gain, honour, and praise.",
    "mn50:17": "\"So, Evil One, when those bhikkhus had been thus advised and instructed by the Blessed One Kakusandha, accomplished and fully enlightened, then, gone to the forest or to the root of a tree or to an empty hut, they abided contemplating foulness in the body, perceiving repulsiveness in nutriment, perceiving disenchantment with all the world, contemplating impermanence in all formations.",
    "mn50:18": "\"Then, when it was morning, the Blessed One Kakusandha, accomplished and fully enlightened, dressed, and taking his bowl and outer robe, he went into the village for alms with the venerable Vidhura as his attendant.",
    "mn50:19": "\"Now, Evil One, there are three names for the Great Hell: the hell of the six bases for contact, the hell of the impalement with stakes, and the hell to be felt for oneself.[n.530] The Great Hell, also called Avīci, is described in greater detail inMN 130.16–.Then, Evil One, the wardens of hell came up to me and said: ‘Good sir, when stake meets stake in your heart, then you will know: \"I have been roasting in hell for a thousand years.\"’",
    "mn50:20": "\"For many a year, Evil One, for many a century, for many a millennium, I roasted in that Great Hell. For ten millennia I roasted in the auxiliary of that Great Hell, experiencing the feeling called that of emergence from ripening.[n.531]MA:This feeling, experienced in the auxiliary(ussada)of the Great Hell, is said to be more painful than the feelings experienced in the Great Hell itself.My body had the same form as a human body, Evil One, but my head had the form of a fish's head.",
    "mn50:21": "\"What can hell be well compared toWherein Dūsī roasted, assailantOf Vidhura the discipleAnd the brahmin Kakusandha?[n.532] The Buddha Kakusandha is called a brahmin in the sense ofMN 39.24.",
    "mn50:22": "Stakes of steel, even a hundred,Each one suffered separately;These can hell be well compared toWherein Dūsī roasted, assailantOf Vidhura the discipleAnd the brahmin Kakusandha.",
    "mn50:23": "Dark One, you have much to sufferBy assaulting such a bhikkhu,An Enlightened One's discipleWho directly knows this fact.",
    "mn50:24": "\"In the middle of the oceanThere are mansions aeon-lasting,Sapphire-shining, fiery-gleamingWith a clear translucent lustre,Where iridescent sea-nymphs danceIn complex, intricate rhythms.",
    "mn50:25": "Dark One, you have much to sufferBy assaulting such a bhikkhu,An Enlightened One's discipleWho directly knows this fact.",
    "mn50:26": "\"I am one who, when exhortedBy the Enlightened One in person,Shook Migāra's Mother's PalaceWith his toe, the Order watching.[n.533] The reference is toSN 51:14/v.9–70.",
    "mn50:27": "Dark One, you have much to sufferBy assaulting such a bhikkhu,An Enlightened One's discipleWho directly knows this fact.",
    "mn50:28": "\"I am one who, wielding firmlyStrength of supernormal powers,Shook all Vejayanta PalaceWith his toe to incite the gods:[n.534] SeeMN 37.11.",
    "mn50:29": "Dark One, you have much to sufferBy assaulting such a bhikkhu,An Enlightened One's discipleWho directly knows this fact.",
    "mn50:30": "\"I am one who, in that palace,Posed to Sakka this question:‘Do you know then, friend, deliveranceIn craving's utter destruction?’Whereupon Sakka then answeredTruly to the question asked him:[n.535] SeeMN 37.12.",
    "mn50:31": "Dark One, you have much to sufferBy assaulting such a bhikkhu,An Enlightened One's discipleWho directly knows this fact.",
    "mn50:32": "\"I am one who thought of posingBrahmā this questionIn Sudhamma Hall in heaven:‘Is there still found in you, friend,The wrong view you once accepted?Do you see the radianceSurpassing that in the Brahmā-world?’",
    "mn50:33": "Brahmā then answered my questionTruthfully and in due sequence:‘There is found in me no longer,Sir, the wrong view that once I held;",
    "mn50:34": "Indeed I see the radianceSurpassing that in the Brahmā-world.Today how could I maintainThat I am permanent and eternal?’:[n.536] The reference is toSN 6:5/i.145.",
    "mn50:35": "Dark One, you have much to sufferBy assaulting such a bhikkhu,An Enlightened One's discipleWho directly knows this fact.",
    "mn50:36": "\"I am one who, by liberation,Has touched the peak of Mount Sineru,Visited the Pubbavidehans’ groveAnd whatever humans dwell on earth.[n.537] This verse refers to Ven. Moggallāna's mastery over the supernormal power of travelling in space like a bird.",
    "mn50:37": "Dark One, you have much to sufferBy assaulting such a bhikkhu,An Enlightened One's discipleWho directly knows this fact.",
    "mn50:38": "\"There has never been found a fireWhich intends, ‘Let me burn the fool,’But a fool who assaults a fireBurns himself by his own doing.",
    "mn50:39": "So it is with you, O Māra:By assaulting the Tathāgata,Like a fool who plays with fireYou only burn yourself alone.",
    "mn50:40": "By assaulting the Tathāgata,You generate much demerit.Evil One, do you imagineThat your evil will not ripen?",
    "mn50:41": "Doing thus, you store up evilWhich will last long, O End-maker!Māra, shun the Enlightened One,Play no more your tricks on bhikkhus.\"",
    "mn50:42": "So the bhikkhu chastened MāraIn the Bhesakaḷā thicketWhereupon the sombre spiritDisappeared right then and there."
}