{
    "mn51:1": "Thus have I heard. On one occasion the Blessed One was living at Campā on the banks of the Gaggarā Lake with a large Saṅgha of bhikkhus. Then Pessa, the elephant driver's son, and Kandaraka the wanderer went to the Blessed One. Pessa, after paying homage to the Blessed One, sat down at one side, while Kandaraka exchanged greetings with the Blessed One, and when this courteous and amiable talk was finished, he stood at one side.[n.538] From this difference in their manner of greeting the Buddha it is evident that Pessa is a follower of the Buddha, whereas Kandaraka — despite his respect and admiration — belongs to a different religious community.Standing there, he surveyed the Saṅgha of bhikkhus sitting in complete silence,[n.539]MA:Out of respect for the Buddha and because of their training, the bhikkhus did not converse with one another, nor did they even clear their throats. Unmoving in body, undistracted in mind, they sat surrounding the Blessed One like ruddy clouds surrounding the peak of Mount Sineru. Kandaraka must have been privately comparing this assembly of the bhikkhus with the assemblies of wanderers as described inMN 76.4.and then he said to the Blessed One:",
    "mn51:2": "\"So it is, Kandaraka, so it is! Those who were Blessed Ones, accomplished and fully enlightened in the past, at most only led the Saṅgha of bhikkhus to practise the right way as is done by me now. And those who will be Blessed Ones, accomplished and fully enlightened in the future, at most will only lead the Saṅgha of bhikkhus to practise the right way as is done by me now.",
    "mn51:3": "\"For, Kandaraka, in this Saṅgha of bhikkhus there are bhikkhus who are arahants with taints destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached the true goal, destroyed the fetters of being, and who are completely liberated through final knowledge. And in this Saṅgha of bhikkhus there are bhikkhus in higher training, of constant virtue, living a life of constant virtue, sagacious, living a life of constant sagacity. They abide with their minds well established in the four foundations of mindfulness.[n.541] MA: The four foundations of mindfulness are brought in to show the cause for the calm and tranquil deportment of the Saṅgha. On the foundations of mindfulness, seeMN 10.What four? Here, Kandaraka, a bhikkhu abides contemplating the body as a body, ardent, fully aware, and mindful, having put away covetousness and grief for the world. He abides contemplating feelings as feelings, ardent, fully aware, and mindful, having put away covetousness and grief for the world. He abides contemplating mind as mind, ardent, fully aware, and mindful, having put away covetousness and grief for the world. He abides contemplating mind-objects as mind-objects, ardent, fully aware, and mindful, having put away covetousness and grief for the world.\"",
    "mn51:4": "When this was said, Pessa, the elephant driver's son, said: \"It is wonderful, venerable sir, it is marvellous how well the four foundations of mindfulness have been made known by the Blessed One: for the purification of beings, for the surmounting of sorrow and lamentation, for the disappearance of pain and grief, for the attainment of the true way, for the realisation of Nibbāna. For, venerable sir, we white-clothed lay people also from time to time abide with our minds well established in these four foundations of mindfulness.[n.52] MA glosses: \"We too, when we get an opportunity, from time to time attend to this; we are also practitioners; we do not completely neglect meditation.\"Here, venerable sir, we abide contemplating the body as a body … feelings as feelings … mind as mind … mind-objects as mind-objects, ardent, fully aware, and mindful, having put away covetousness and grief for the world. It is wonderful, venerable sir, it is marvellous how amid man's tangle, corruption, and deceptions, the Blessed One knows the welfare and harm of beings. For humankind is a tangle but the animal is open enough. Venerable sir, I can drive an elephant to be tamed, and in the time it takes to make a trip back and forth in Campā, that elephant will show every kind of deception, duplicity, crookedness, and fraudhe is capable of.[n.53] The point of this statement is that an animal's guile and trickery is very limited, while that of human beings is inexhaustible.But those who are called our slaves, messengers, and servants behave in one way with the body, in another way by speech, while their minds work in still another way. It is wonderful, venerable sir, it is marvellous how amid man's tangle, corruption, and deceptions, the Blessed One knows the welfare and harm of beings. For humankind is a tangle but the animal is open enough.For humankind is a tangle but the animal is open enough.\"",
    "mn51:5": "\"So it is, Pessa, so it is! Humankind is a tangle but the animal is open enough. Pessa, there are four kinds of persons to be found existing in the world.[n.44] MA explains that this passage is introduced as a sequel to Pessa's statement that the Blessed One knows the welfare and harm of beings; for the Buddha shows that the first three kinds of persons are practising in harmful ways, while the fourth is practising in a beneficial way. The passage can also be connected with Kandaraka's praise of the Saṅgha; for the Buddha will show three ways in which he does not train the Saṅgha and the one way in which all the Buddhas of the past, present, and future train their Saṅghas.What four? Here a certain kind of person torments himself and pursues the practice of torturing himself. Here a certain kind of person torments others and pursues the practice of torturing others. Here a certain kind of person torments himself and pursues the practice of torturing himself, and he also torments others and pursues the practice of torturing others. Here a certain kind of person does not torment himself or pursue the practice of torturing himself, and he does not torment others or pursue the practice of torturing others. Since he torments neither himself nor others, he is here and now hungerless, extinguished, and cooled, and he abides experiencing bliss, having himself become holy.[n.4]Sukhapaṭisaṁvedī brahmabhūtena attanā.MA:He experiences the bliss of thejhānas,paths, fruits, and Nibbāna. \"Brahma\" here should be understood in the sense of holy or excellent(sẹ̣ha). There may be an allusion here to the main theme of the Upanishads, the identity of theātmanwithbrahman.Which of these four kinds of persons satisfies your mind, Pessa?\"",
    "mn51:6": "\"The first three do not satisfy my mind, venerable sir, but the last one satisfies my mind.\"",
    "mn51:7": "\"But, Pessa, why don’t the first three kinds of persons satisfy your mind?\"",
    "mn51:8": "Soon after he had left, the Blessed One addressed the bhikkhus thus: \"Bhikkhus, Pessa, the elephant driver's son, is wise, he has great wisdom. If he had sat a while longer until I had expounded for him in detail these four kinds of persons, he would have greatly benefited. Still he has already greatly benefited even as it is.\"[n.546] MA: Pessa would have attained the fruit of stream-entry, but he rose from his seat and left before the Buddha had completed his discourse. The benefits he did receive are two: he gained greater confidence in the Saṅgha, and he gave rise to a new method for comprehending the foundations of mindfulness.",
    "mn51:9": "\"Bhikkhus, what kind of person torments himself and pursues the practice of torturing himself?[n.547] This passage details the austerities undertaken by many of the Buddha’s ascetic contemporaries, as well as by the Bodhisatta himself during his period of striving for enlightenment. SeeMN 12.45.Here a certain person goes naked, rejecting conventions, licking his hands, not coming when asked, not stopping when asked; he does not accept food brought or food specially made or an invitation to a meal; he receives nothing from a pot, from a bowl, across a threshold, across a stick, across a pestle, from two eating together, from a pregnant woman, from a woman giving suck, from a woman in the midst of men, from where food is advertised to be distributed, from where a dog is waiting, from where flies are buzzing; he accepts no fish or meat, he drinks no liquor, wine, or fermented brew. He keeps to one house, to one morsel; he keeps to two houses to two morsels; … he keeps to seven houses, to seven morsels. He lives on one saucerful a day, on two saucerfuls a day … on seven saucerfuls a day. He takes food once a day, once every two days … once every seven days; thus even up to once every fortnight, he dwells pursuing the practice of taking food at stated intervals.",
    "mn51:10": "He is an eater of greens or millet or wild rice or hide-parings or moss or ricebran or rice-scum or sesamum flour or grass or cowdung. He lives on forest roots and fruits, he feeds on fallen fruits.",
    "mn51:11": "He clothes himself in hemp, in hemp-mixed cloth, in shrouds, in refuse rags, in tree bark, in antelope hide, in strips of antelope hide, in kusa-grass fabric, in bark fabric, in wood-shavings fabric, in head-hair wool, in animal wool, in owls’ wings. He is one who pulls out hair and beard, pursuing the practice of pulling out hair and beard. He is one who stands continuously, rejecting seats. He is one who squats continuously, devoted to maintaining the squatting position. He is one who uses a mattress of spikes; he makes a mattress of spikes his bed. He dwells pursuing the practice of bathing in water three times daily including the evening. Thus in such a variety of ways he dwells pursuing the practice of tormenting and mortifying the body. This is called the kind of person who torments himself and pursues the practice of torturing himself.",
    "mn51:12": "\"What kind of person, bhikkhus, torments others and pursues the practice of torturing others? Here a certain person is a butcher of sheep, a butcher of pigs, a fowler, a trapper of wild beasts, a hunter, a fisherman, a thief, an executioner, a prison warden, or one who follows any other such bloody occupation. This is called the kind of person who torments others and pursues the practice of torturing others.",
    "mn51:13": "\"What kind of person, bhikkhus, torments himself and pursues the practice of torturing himself and also torments others and pursues the practice of torturing others? Here some person is a head-anointed noble king or a well-to-do brahmin.[n.548] This passage shows the practice of one who torments himself in the hope of gaining merit and then offers sacrifices that involve the slaughter of many animals and the oppression of his workers.Having had a new sacrificial temple built to the east of the city, and having shaved off his hair and beard, dressed himself in rough hide, and greased his body with ghee and oil, scratching his back with a deer's horn, he enters the sacrificial temple together with his chief queen and his brahmin high priest. There he lies down on the bare ground strewn with grass. The king lives on the milk in the first teat of a cow with a calf of the same colour while the chief queen lives on the milk in the second teat and the brahmin high priest lives on the milk in the third teat; the milk in the fourth teat they pour onto the fire, and the calf lives on what is left. He says thus: ‘Let so many bulls be slaughtered for sacrifice, let so many bullocks be slaughtered for sacrifice, let so many heifers be slaughtered for sacrifice, let so many goats be slaughtered for sacrifice, let so many sheep be slaughtered for sacrifice, let so many trees be felled for the sacrificial posts, let so much grass be cut for the sacrificial grass.’ And then his slaves, messengers, and servants make preparations, weeping with tearful faces, being spurred on by threats of punishment and by fear. This is called the kind of person who torments himself and pursues the practice of torturing himself and who torments others and pursues the practice of torturing others.",
    "mn51:14": "\"What kind of person, bhikkhus, does not torment himself or pursue the practice of torturing himself and does not torment others or pursue the practice of tormenting others — the one who, since he torments neither himself nor others, is here and now hungerless, extinguished, and cooled, and abides experiencing bliss, having himself become holy?[n.549] This is the arahant. To show clearly that he torments neither himself nor others, the Buddha next undertakes to describe the path of practice by which he arrived at arahantship.",
    "mn51:15": "\"Having thus gone forth and possessing the bhikkhus’ training and way of life, abandoning the killing of living beings, he abstains from killing living beings; with rod and weapon laid aside, conscientious, merciful, he abides compassionate to all living beings.",
    "mn51:16": "\"He becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Just as a bird, wherever it goes, flies with its wings as its only burden, so too, the bhikkhu becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Possessing this aggregate of noble virtue, he experiences within himself a bliss that is blameless.",
    "mn51:17": "\"On seeing a form with the eye, he does not grasp at its signs and features. Since, if he left the eye faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the eye faculty, he undertakes the restraint of the eye faculty. On hearing a sound with the ear … On smelling an odour with the nose … On tasting a flavour with the tongue … On touching a tangible with the body … On cognizing a mind-object with the mind, he does not grasp at its signs and features. Since, if he left the mind faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the mind faculty, he undertakes the restraint of the mind faculty. Possessing this noble restraint of the faculties, he experiences within himself a bliss that is unsullied.",
    "mn51:18": "\"He becomes one who acts in full awareness when going forward and returning; who acts in full awareness when looking ahead and looking away; who acts in full awareness when flexing and extending his limbs; who acts in full awareness when wearing his robes and carrying his outer robe and bowl; who acts in full awareness when eating, drinking, consuming food, and tasting; who acts in full awareness when defecating and urinating; who acts in full awareness when walking, standing, sitting, falling asleep, waking up, talking, and keeping silent.",
    "mn51:19": "\"Possessing this aggregate of noble virtue, and this noble restraint of the faculties, and possessing this noble mindfulness and full awareness, he resorts to a secluded resting place: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw.",
    "mn51:20": "\"Having thus abandoned these five hindrances, imperfections of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion.",
    "mn51:21": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the recollection of past lives. He recollects his manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion: ‘There I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared elsewhere; and there too I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared here.’ Thus with their aspects and particulars he recollects his manifold past lives.",
    "mn51:22": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the passing away and reappearance of beings. With the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate. He understands how beings pass on according to their actions thus: ‘These worthy beings who were ill conducted in body, speech, and mind, revilers of noble ones, wrong in their views, giving effect to wrong view in their actions, on the dissolution of the body, after death, have reappeared in a state of deprivation, in a bad destination, in perdition, even in hell; but these worthy beings who were well conducted in body, speech, and mind, not revilers of noble ones, right in their views, giving effect to right view in their actions, on the dissolution of the body, after death, have reappeared in a good destination, even in the heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and he understands how beings pass on according to their actions.",
    "mn51:23": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the destruction of the taints. He understands as it actually is: ‘This is suffering’; he understands as it actually is: ‘This is the origin of suffering’; he understands as it actually is: ‘This is the cessation of suffering’; he understands as it actually is: ‘This is the way leading to the cessation of suffering.’ He understands as it actually is: ‘These are the taints’; he understands as it actually is: ‘This is the origin of the taints’; he understands as it actually is: ‘This is the cessation of the taints’; he understands as it actually is: ‘This is the way leading to the cessation of the taints.’",
    "mn51:24": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}