{
    "mn52:1": "Thus have I heard. On one occasion the Venerable Ānanda was living at Beluvagāmaka near Vesālī. Now on that occasion the householder Dasama of Aṭṭhakanāgara had arrived at Pāṭaliputta for some business or other.",
    "mn52:2": "Then he went to a certain bhikkhu in Kukkuṭa's Park, and after paying homage to him, he sat down at one side and asked him: \"Where does the venerable Ānanda live now, venerable sir? I wish to see the venerable Ānanda.\" \"The venerable Ānanda is living at Beluvagāmaka near Vesālī, householder.\"",
    "mn52:3": "When the householder Dasama had completed his business at Pāṭaliputta, he went to the venerable Ānanda at Beluvagāmaka near Vesālī. After paying homage to him, he sat down at one side and asked him:",
    "mn52:4": "\"Venerable Ānanda, has any one thing been proclaimed by the Blessed One who knows and sees, accomplished and fully enlightened, wherein if a bhikkhu abides diligent, ardent, and resolute, his unliberated mind comes to be liberated, his undestroyed taints come to be destroyed, and he attains the supreme security from bondage that he had not attained before?\"[n.550] All these expressions are descriptive of arahantship.",
    "mn52:5": "\"There is, householder, indeed one such thing proclaimed by the Blessed One.\"",
    "mn52:6": "\"What is that one thing, venerable Ānanda?\"",
    "mn52:7": "\"Here, householder, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. He considers this and understands it thus: ‘This first jhāna is conditioned and volitionally produced.[n.551]Abhisaṅkhataṁ abhisañcetayitaṁ.The two terms are frequently used in conjunction to indicate a conditioned state in which volition(cetanā)is the most prominent conditioning factor.But whatever is conditioned and volitionally produced is impermanent, subject to cessation.’ If he is steady in that, he attains the destruction of the taints.[n.552] This passage explains a method for developing \"insight preceded by serenity\" (samathapubbaṅgamā vipassanā;seeAN 4:10/ ii.15). Having first attained a jhāna, the meditator emerges from it and contemplates that state as brought into being by conditions, particularly volition. On the basis of this, he ascertains its impermanence, and then contemplates the jhāna with insight into the three marks of impermanence, suffering, and non-self. See alsoMN 64.9–15for a somewhat different approach to developing insight on the basis of the jhānas.But if he does not attain the destruction of the taints because of that desire for the Dhamma, that delight in the Dhamma,[n.553]Dhammarāgena dhammanandiyā.MA:These two terms signify desire and attachment(chandarāga)with respect to serenity and insight. If one is able to discard all desire and attachment concerning serenity and insight, one becomes an arahant; if one cannot discard them, one becomes a non-returner and is reborn in the Pure Abodes.then with the destruction of the five lower fetters he becomes one due to reappear spontaneously.",
    "mn52:8": "“Again, with the stilling of applied and sustained thought, a bhikkhu enters and abides in the second jhāna … He considers this and understands it thus: ‘This second jhāna is conditioned and volitionally produced. But whatever is conditioned and volitionally produced is impermanent, subject to cessation.’ If he is steady in that, he attains the destruction of the taints. But if he does not attain the destruction of the taints…without ever returning from that world.\"This too is one thing proclaimed by the Blessed One … wherein if a bhikkhu abides diligent, ardent, and resolute … he attains the supreme security from bondage that he had not attained before.",
    "mn52:9": "\"Again, with the fading away as well of rapture, a bhikkhu … enters upon and abides in the third jhāna … He considers this and understands it thus: ‘This third jhāna is conditioned and volitionally produced. But whatever is conditioned and volitionally produced is impermanent, subject to cessation.’ If he is steady in that, he attains the destruction of the taints. But if he does not attain the destruction of the taints … without ever returning from that world.\"This too is one thing proclaimed by the Blessed One … wherein if a bhikkhu abides diligent, ardent, and resolute … he attains the supreme security from bondage that he had not attained before.",
    "mn52:10": "\"Again, with the abandoning of pleasure and pain … a bhikkhu enters upon and abides in the fourth jhāna … He considers this and understands it thus: ‘This fourth jhāna is conditioned and volitionally produced. But whatever is conditioned and volitionally produced is impermanent, subject to cessation.’ If he is steady in that, he attains the destruction of the taints. But if he does not attain the destruction of the taints … without ever returning from that world.\"This too is one thing proclaimed by the Blessed One … wherein if a bhikkhu abides diligent, ardent, and resolute … he attains the supreme security from bondage that he had not attained before.",
    "mn52:11": "\"Again, a bhikkhu abides pervading one quarter with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to himself, he abides pervading the all-encompassing world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, without hostility and without ill will. He considers this and understands it thus: ‘This deliverance of mind through loving-kindness is conditioned and volitionally produced. But whatever is conditioned and volitionally produced is impermanent, subject to cessation.’ If he is steady in that, he attains the destruction of the taints. But if he does not attain the destruction of the taints … without ever returning from that world.\"This too is one thing proclaimed by the Blessed One … wherein if a bhikkhu abides diligent, ardent, and resolute … he attains the supreme security from bondage that he had not attained before.",
    "mn52:12": "\"Again, a bhikkhu abides pervading one quarter with a mind imbued with compassion … without ill will. He considers this and understands it thus: ‘This deliverance of mind through compassion is conditioned and volitionally produced. But whatever is conditioned and volitionally produced is impermanent, subject to cessation.’ If he is steady in that, he attains the destruction of the taints. But if he does not attain the destruction of the taints … without ever returning from that world.\"This too is one thing proclaimed by the Blessed One … wherein if a bhikkhu abides diligent, ardent, and resolute … he attains the supreme security from bondage that he had not attained before.",
    "mn52:13": "\"Again, with the complete surmounting of perceptions of form, with the disappearance of perceptions of sensory impact, with non-attention to perceptions of diversity, aware that ‘space is infinite,’ a bhikkhu enters upon and abides in the base of infinite space. He considers this and understands it thus: ‘This attainment of the base of infinite space is conditioned and volitionally produced. But whatever is conditioned and volitionally produced is impermanent, subject to cessation.’ If he is steady in that, he attains the destruction of the taints. But if he does not attain the destruction of the taints … without ever returning from that world.",
    "mn52:14": "\"Again, by completely surmounting the base of infinite space, aware that ‘consciousness is infinite,’ a bhikkhu enters upon and abides in the base of infinite consciousness. He considers this and understands it thus: ‘This attainment of the base of infinite consciousness is conditioned and volitionally produced. But whatever is conditioned and volitionally produced is impermanent, subject to cessation.’ If he is steady in that, he attains the destruction of the taints. But if he does not attain the destruction of the taints … without ever returning from that world.\"This too is one thing proclaimed by the Blessed One … wherein if a bhikkhu abides diligent, ardent, and resolute … he attains the supreme security from bondage that he had not attained before.",
    "mn52:15": "\"Again, by completely surmounting the base of infinite consciousness, aware that ‘there is nothing,’ a bhikkhu enters upon and abides in the base of nothingness. He considers this and understands it thus: ‘This attainment of the base of nothingness is conditioned and volitionally produced. But whatever is conditioned and volitionally produced is impermanent, subject to cessation.’ If he is steady in that, he attains the destruction of the taints. But if he does not attain the destruction of the taints because of that desire for the Dhamma, that delight in the Dhamma, then with the destruction of the five lower fetters he becomes one due to reappear spontaneouslyin the Pure Bodesand there attain final Nibbāna without ever returning from that world.",
    "mn52:16": "When venerable Ānanda had spoken, the householder Dasama of Aṭṭhakanāgara said to him: \"Venerable Ānanda, just as if a man seeking one entrance to a hidden treasure came all at once upon eleven entrances to a hidden treasure, so too, while I was seeking one door to the Deathless, I have come all at once to hear of eleven doors to the Deathless.[n.555] The eleven \"doors to the Deathless\" are the four jhānas, the fourbrahmavihāras,and the first three immaterial attainments used as bases for the development of insight and attainment of arahantship.Just as if a man had a house with eleven doors and when that house caught on fire, he could flee to safety by any one of these eleven doors, so I can flee to safety by any one of these eleven doors to the Deathless. Venerable sir, these sectarians will even seek a teacher's fee for their teacher; why shouldn’t I make an offering to the venerable Ānanda?\"",
    "mn52:17": "Then the householder Dasama of Aṭṭhakanāgara assembled the Saṅgha of bhikkhus from Pāṭaliputta and Vesālī, and with his own hands he served and satisfied them with various kinds of good food. He presented a pair of cloths to each bhikkhu, and he presented a triple robe to the venerable Ānanda, and he had a dwelling worth five hundred[n.556] This would be five hundredkahāpaṇas,the latter being the standard monetary unit of the time.built for the venerable Ānanda."
}