{
    "mn53:1": "Thus have I heard. On one occasion the Blessed One was living in the Sakyan country at Kapilavatthu in Nigrodha's Park.",
    "mn53:2": "Then the venerable Ānanda addressed Mahānāma the Sakyan thus:",
    "mn53:3": "\"And how is a noble disciple possessed of virtue? Here a noble disciple is virtuous, he dwells restrained with the restraint of the Pāṭimokkha, he is perfect in conduct and resort, and seeing fear in the slightest fault, he trains by undertaking the training precepts. This is how a noble disciple is possessed of virtue.",
    "mn53:4": "\"And how does a noble disciple guard the doors of his sense faculties? On seeing a form with the eye, a noble disciple does not grasp at its signs and features. Since, if he left the eye faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the eye faculty, he undertakes the restraint of the eye faculty. On hearing a sound with the ear … On smelling an odour with the nose … On tasting a flavour with the tongue … On touching a tangible with the body … on cognizing a mind-object with the mind, a noble disciple does not grasp at its signs and features. Since, if he left the mind faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the mind faculty, he undertakes the restraint of the mind faculty. That is how a noble disciple guards the doors of his sense faculties.",
    "mn53:5": "\"And how is a noble disciple moderate in eating? Here, reflecting wisely, a noble disciple takes food neither for amusement nor for intoxication nor for the sake of physical beauty and attractiveness, but only for the endurance and continuance of this body, for ending discomfort, and for assisting the holy life, considering: ‘Thus I shall terminate old feelings without arousing new feelings and I shall be healthy and blameless and shall live in comfort.’ That is how a noble disciple is moderate in eating.",
    "mn53:6": "\"And how is a noble disciple devoted to wakefulness? Here, during the day, while walking back and forth and sitting, a noble disciple purifies his mind of obstructive states. In the first watch of the night, while walking back and forth and sitting, he purifies his mind of obstructive states. In the middle watch of the night he lies down on the right side in the lion's pose with one foot overlapping the other, mindful and fully aware, after noting in his mind the time for rising. After rising, in the third watch of the night, while walking back and forth and sitting, he purifies his mind of obstructive states. That is how a noble disciple is devoted to wakefulness.",
    "mn53:7": "\"And how does a noble disciple possess seven good qualities? Here a noble disciple has faith; he places his faith in the Tathāgata's enlightenment thus: ‘The Blessed One is accomplished, fully enlightened, perfect in true knowledge and conduct, sublime, knower of worlds, incomparable leader of persons to be tamed, teacher of gods and humans, enlightened, blessed.’",
    "mn53:8": "\"And how is a noble disciple one who obtains at will, without trouble or difficulty, the four jhānas that constitute the higher mind and provide a pleasant abiding here and now? Here, quite secluded from sensual pleasures, secluded from unwholesome states, a noble disciple enters upon and abides in the first jhāna … With the stilling of applied and sustained thought, he enters upon and abides in the second jhāna … With the fading away as well of rapture … he enters upon and abides in the third jhāna … With the abandoning of pleasure and pain … he enters upon and abides in the fourth jhāna, which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity. That is how a noble disciple is one who obtains at will, without trouble or difficulty, the four jhānas that constitute the higher mind and provide a pleasant abiding here and now.",
    "mn53:9": "\"When a noble disciple has thus become one who is possessed of virtue, who guards the doors of his sense faculties, who is moderate in eating, who is devoted to wakefulness, who possesses seven good qualities, who obtains at will, without trouble or difficulty, the four jhānas that constitute the higher mind and provide a pleasant abiding here and now, he is called one in higher training who has entered upon the way. His eggs are unspoiled; he is capable of breaking out, capable of enlightenment, capable of attaining the supreme security from bondage.",
    "mn53:10": "\"Based upon that same supreme mindfulness whose purity is due to equanimity,[n.563] This refers to the fourth jhāna, which is the foundation for the three knowledges to follow.this noble disciple recollects his manifold past lives … Thus with their aspects and particulars he recollects his manifold past lives. This is his first breaking out like that of the hen's chicks from their shells.",
    "mn53:11": "\"Based upon that same supreme mindfulness whose purity is due to equanimity, with the divine eye, which is purified and surpasses the human, this noble disciple sees beings passing away and reappearing … he understands how beings pass on according to their actions. This is his second breaking out like that of the hen's chicks from their shells.",
    "mn53:12": "\"Based upon that same supreme mindfulness whose purity is due to equanimity, by realising for himself with direct knowledge, this noble disciple here and now enters upon and abides in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints. This is his third breaking out like that of the hen's chicks from their shells.[n.564] At this point he ceases to be asekhāand becomes an arahant.",
    "mn53:13": "\"When a noble disciple is possessed of virtue, that pertains to his conduct. When he guards the doors of his sense faculties, that pertains to his conduct. When he is moderate in eating, that pertains to his conduct. When he is devoted to wakefulness, that pertains to his conduct. When he possesses seven good qualities, that pertains to his conduct. When he is one who obtains at will, without trouble or difficulty, the four jhānas that constitute the higher mind and provide a pleasant abiding here and now, that pertains to his conduct.[n.565] These constitute the traditional list of fifteen factors making up conduct(caraṇa), which are often conjoined with the three following types of knowledge in the complete course of training. The two together enter into the common epithet of the Buddha and the arahants,vijjācaraṇasampanna,\"perfect in true knowledge and conduct.\" See Vsm VII, 30–31.",
    "mn53:14": "\"When he recollects his manifold past lives … with their aspects and particulars, that pertains to his true knowledge. When, with the divine eye … he sees beings passing away and reappearing and understands how beings pass on according to their actions, that pertains to his true knowledge. When, by realising for himself with direct knowledge, he here and now enters upon and abides in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints, that pertains to his true knowledge.",
    "mn53:15": "\"This noble disciple is thus said to be perfect in true knowledge, perfect in conduct, perfect in true knowledge and conduct.",
    "mn53:16": "And this stanza was uttered by the Brahmā Sanankumāra:",
    "mn53:17": "‘The noble clan is held to beThe best of people as to lineage;But best of gods and humans is onePerfect in true knowledge and conduct.’",
    "mn53:18": "\"Now that stanza was well sung by the Brahmā Sanankumāra, not ill sung; it was well spoken, not ill spoken; it has a meaning, and is not meaningless; and it was approved by the Blessed One.\"[n.566] The verse was approved by the Buddha atDN 3.1.28/i.99. The Brahmā Sanankumāra, \"Forever Young,\" according toMAwas a youth who attained jhāna, passed away, and was reborn in the Brahma-world, retaining the same handsome form he possessed in his existence in the human world. SeeDN .17–29/ii.210–2.",
    "mn53:19": "Then the Blessed One rose and addressed the venerable Ānanda thus: \"Good, good, Ānanda! It is good that you have spoken to the Sakyans of Kapilavatthu about the disciple in higher training who has entered upon the way.\"",
    "mn53:20": "That is what the venerable Ānanda said. The Teacher approved. The Sakyans of Kapilavatthu were satisfied and delighted in the venerable Ānanda's words."
}