{
    "mn54:1": "Thus have I heard. On one occasion the Blessed One was living in the country of the Anguttarāpans where there was a town of theirs named Āpaṇa.",
    "mn54:2": "A second time the Blessed One said to him: \"There are seats, householder, sit down if you like.\" And a second time the householder Potaliya thought: \"The recluse Gotama addresses me as ‘householder,’\" and angry and displeased, he remained silent.",
    "mn54:3": "\"Householder, there are these eight things in the Noble One's Discipline that lead to the cutting off of affairs. What are the eight? With the support of the non-killing of living beings, the killing of living beings is to be abandoned. With the support of taking only what is given, the taking of what is not given is to be abandoned. With the support of truthful speech, false speech is to be abandoned. With the support of unmalicious speech, malicious speech is to be abandoned. With the support of no rapacity and greed,[n.567] Each of the two terms joined in this copulative compound, and in the two that follow, are roughly synonymous.rapacity and greed are to be abandoned. With the support of no spite and scolding, spite and scolding are to be abandoned. With the support of no anger and irritation, anger and irritation are to be abandoned. With the support of non-arrogance, arrogance is to be abandoned. These are the eight things, stated in brief without being expounded in detail, that lead to the cutting off of affairs in the Noble One's Discipline.\"",
    "mn54:4": "\"‘With the support of the non-killing of living beings, the killing of living beings is to be abandoned.’ So it was said. And with reference to what was this said? Here a noble disciple considers thus: ‘I am practising the way to the abandoning and cutting off of those fetters because of which I might kill living beings. If I were to kill living beings, I would blame myself for doing so; the wise, having investigated, would censure me for doing so; and on the dissolution of the body, after death, because of killing living beings an unhappy destination would be expected. But this killing of living beings is itself a fetter and a hindrance.[n.568]MA: Although the killing of living beings is not included among the ten fetters and five hindrances, it may be called a fetter in the sense of binding one to the round of rebirths and a hindrance in the sense of obstructing one's true welfare.And while taints, vexation, and fever might arise through the killing of living beings, there are no taints, vexation, and fever for one who abstains from killing living beings.’ So it is with reference to this that it was said: ‘With the support of the non-killing of living beings, the killing of living beings is to be abandoned.’",
    "mn54:5": "\"‘With the support of taking only what is given, the taking of what is not given is to be abandoned.’ So it was said …",
    "mn54:6": "\"‘With the support of truthful speech, false speech is to be abandoned.’ So it was said …",
    "mn54:7": "\"‘With the support of unmalicious speech, malicious speech is to be abandoned.’ So it was said …",
    "mn54:8": "\"‘With the support of no rapacity and greed, rapacity and greed are to be abandoned.’ So it was said …",
    "mn54:9": "\"‘With the support of no spite and scolding, spite and scolding are to be abandoned.’ So it was said …",
    "mn54:10": "\"‘With the support of no anger and irritation, anger and irritation are to be abandoned.’ So it was said …",
    "mn54:11": "\"‘With the support of non-arrogance, arrogance is to be abandoned.’ So it was said. And with reference to what was this said? Here a noble disciple considers thus: ‘I am practising the way to the abandoning and cutting off of those fetters because of which I might be arrogant. If I were to be arrogant, I would blame myself for this; the wise, having investigated, would censure me for this; and on the dissolution of the body, after death, because of being arrogant an unhappy destination would be expected. But this arrogance is itself a fetter and a hindrance. And while taints, vexation, and fever might arise through arrogance, there are no taints, vexation, and fever for one who is not arrogant.’ So it is with reference to this that it was said: ‘With the support of non-arrogance, arrogance is to be abandoned.’[n.569]MA: Killing and taking what is not given are to be abandoned by bodily virtue; false speech and malicious speech, by verbal virtue; rapacious greed, angry despair, and arrogance, by mental virtue. Spiteful scolding (which can include violent reprisals) is to be abandoned by both bodily and verbal virtue.",
    "mn54:12": "\"These eight things that lead to the cutting off of affairs in the Noble One's Discipline have now been expounded in detail. But the cutting off of affairs in the Noble One's Discipline has not yet been achieved entirely and in all ways.\"",
    "mn54:13": "\"Venerable sir, how is the cutting off of affairs in the Noble One's Discipline achieved entirely and in all ways? It would be good, venerable sir, if the Blessed One would teach me the Dhamma, showing me how the cutting off of affairs in the Noble One's Discipline is achieved entirely and in all ways.\"",
    "mn54:14": "\"Householder, suppose a dog, overcome by hunger and weakness, was waiting by a butcher's shop.[n.570] These similes for the dangers in sensual pleasures are alluded to atMN 22.3, though this sutta does not elaborate on the last three similes mentioned there.Then a skilled butcher or his apprentice would toss the dog a well hacked, clean hacked skeleton of meatless bones smeared with blood. What do you think, householder? Would that dog get rid of his hunger and weakness by gnawing such a well hacked, clean hacked skeleton of meatless bones smeared with blood?\"",
    "mn54:15": "\"No, venerable sir.",
    "mn54:16": "Why is that?",
    "mn54:17": "Because that was a skeleton of well hacked, clean hacked meatless bones smeared with blood. Eventually that dog would reap weariness and disappointment.\" \"So too, householder, a noble disciple considers thus: ‘Sensual pleasures have been compared to a skeleton by the Blessed One; they provide much suffering and much despair, while the danger in them is great.’ Having seen this thus as it actually is with proper wisdom, he avoids the equanimity that is diversified, based on diversity, and develops the equanimity that is unified, based on unity,[n.571] According toMA, the \"equanimity that is based on diversity\" is equanimity (i.e., apathy, indifference) related to the five cords of sensual pleasure; the \"equanimity that is based on unity\" is the equanimity of the fourth jhāna.where clinging to the material things of the world utterly ceases without remainder.",
    "mn54:18": "\"Householder, suppose a vulture, a heron, or a hawk seized a piece of meat and flew away, and then vultures, herons, and hawks pursued it and pecked and clawed it. What do you think, householder? If that vulture, heron, or hawk does not quickly let go of that piece of meat, wouldn’t it incur death or deadly suffering because of that?\"",
    "mn54:19": "\"Yes, venerable sir.\"",
    "mn54:20": "\"So too, householder, a noble disciple considers thus: ‘Sensual pleasures have been compared to a piece of meat by the Blessed One; they provide much suffering and much despair, while the danger in them is great.’ Having seen this thus as it actually is with proper wisdom … clinging to the material things of the world utterly ceases without remainder.",
    "mn54:21": "\"Householder, suppose a man took a blazing grass torch and went against the wind. What do you think, householder? If that man does not quickly let go of that blazing grass torch, wouldn’t that blazing grass torch burn his hand or his arm or some other part of his body, so that he might incur death or deadly suffering because of that?\"",
    "mn54:22": "\"Yes, venerable sir.\"",
    "mn54:23": "\"So too, householder, a noble disciple considers thus: ‘Sensual pleasures have been compared to a grass torch by the Blessed One; they provide much suffering and much despair, while the danger in them is great.’ Having seen this thus as it actually is with proper wisdom … clinging to the material things of the world utterly ceases without remainder.",
    "mn54:24": "\"Householder, suppose there were a charcoal pit deeper than a man's height full of glowing coals without flame or smoke. Then a man came who wanted to live and not to die, who wanted pleasure and recoiled from pain, and two strong men seized him by both arms and dragged him towards that charcoal pit. What do you think, householder? Would that man twist his body this way and that?\"",
    "mn54:25": "\"Yes, venerable sir.",
    "mn54:26": "Why is that?",
    "mn54:27": "Because that man knows that if he falls into that charcoal pit, he will incur death or deadly suffering because of that. So too, householder, a noble disciple considers thus: ‘Sensual pleasures have been compared to a charcoal pit by the Blessed One; they provide much suffering and much despair, while the danger in them is great.’ Having seen this thus as it actually is with proper wisdom … clinging to the material things of the world utterly ceases without remainder.",
    "mn54:28": "\"Householder, suppose a man dreamt about lovely parks, lovely groves, lovely meadows, and lovely lakes, and on waking he saw nothing of it. So too, householder, a noble disciple considers thus: ‘Sensual pleasures have been compared to a dream by the Blessed One; they provide much suffering and much despair, while the danger in them is great.’ Having seen this thus as it actually is with proper wisdom … clinging to the material things of the world utterly ceases without remainder.",
    "mn54:29": "\"Householder, suppose a man borrowed goods on loan — a fancy carriage and fine-jewelled earrings — and preceded and surrounded by those borrowed goods he went to the marketplace. Then people, seeing him, would say: ‘Sirs, that is a rich man! That is how the rich enjoy their wealth!’ Then the owners, whenever they saw him, would take back their things. What do you think, householder? Would that be enough for that man to become dejected?\"",
    "mn54:30": "\"Yes, venerable sir.",
    "mn54:31": "Why is that?",
    "mn54:32": "Because the owners took back their things.\" So too, householder, a noble disciple considers thus: ‘Sensual pleasures have been compared to borrowed goods by the Blessed One; they provide much suffering and much despair, while the danger in them is great.’ Having seen this thus as it actually is with proper wisdom … clinging to material things of the world utterly ceases without remainder.",
    "mn54:33": "\"Householder, suppose there were a dense grove not far from some village or town, within which there was a tree laden with fruit but none of its fruit had fallen to the ground. Then a man came needing fruit, seeking fruit, wandering in search of fruit, and he entered the grove and saw the tree laden with fruit. Thereupon he thought: ‘This tree is laden with fruit but none of its fruit has fallen to the ground. I know how to climb a tree, so let me climb this tree, eat as much fruit as I want, and fill my bag.’ And he did so. Then a second man came needing fruit, seeking fruit, wandering in search of fruit, and taking a sharp axe, he too entered the grove and saw that tree laden with fruit. Thereupon he thought: ‘This tree is laden with fruit but none of its fruit has fallen to the ground. I do not know how to climb a tree, so let me cut this tree down at its root, eat as much fruit as I want, and fill my bag.’ And he did so. What do you think, householder? If that first man who had climbed the tree doesn’t come down quickly, when the tree falls, wouldn’t he break his hand or his foot or some other part of his body, so that he might incur death or deadly suffering because of that?\"",
    "mn54:34": "\"Yes, venerable sir.\"",
    "mn54:35": "\"So too, householder, a noble disciple considers thus: ‘Sensual pleasures have been compared to fruits on a tree by the Blessed One; they provide much suffering and much despair, while the danger in them is great.’ Having seen this thus as it actually is with proper wisdom, he avoids the equanimity that is diversified, based on diversity, and develops the equanimity that is unified, based on unity, where clinging to the material things of the world utterly ceases without remainder.",
    "mn54:36": "\"Based upon that same supreme mindfulness whose purity is due to equanimity, this noble disciple recollects his manifold past lives, that is, one birth, two births … Thus with their aspects and particulars he recollects his manifold past lives.",
    "mn54:37": "\"Based upon that same supreme mindfulness whose purity is due to equanimity, with the divine eye, which is purified and surpasses the human, this noble disciple sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate … and he understands how beings pass on according to their actions.",
    "mn54:38": "\"Based upon that same supreme mindfulness whose purity is due to equanimity, by realising for himself with direct knowledge, this noble disciple here and now enters upon and abides in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints.",
    "mn54:39": "What do you think, householder? Do you see in yourself any cutting off of affairs like this cutting off of affairs in the Noble One's Discipline when it is achieved entirely and in all ways?\""
}