{
    "mn55:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Mango Grove of Jīvaka Komārabhacca.[n.573] Jīvaka was the abandoned child of a courtesan. Discovered and raised by Prince Abhaya, he studied medicine at Takkasilā and was later appointed the personal physician of the Buddha. He became a stream-enterer after hearing the Buddha teach the Dhamma.",
    "mn55:2": "\"Jīvaka, those who speak thus do not say what has been said by me, but misrepresent me with what is untrue and contrary to fact.",
    "mn55:3": "\"Here, Jīvaka, some bhikkhu lives in dependence upon a certain village or town. He abides pervading one quarter with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to himself, he abides pervading the all-encompassing world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, without hostility and without ill will. Then a householder or a householder's son comes to him and invites him for the next day's meal. The bhikkhu accepts, if he likes. When the night is ended, in the morning he dresses, and taking his bowl and outer robe, goes to the house of that householder or householder's son and sits down on a seat made ready. Then the householder or householder's son serves him with good almsfood. He does not think: ‘How good that the householder or householder's son serves me with good almsfood! If only a householder or householder's son might serve me with such good almsfood in the future!’ He does not think thus. He eats that almsfood without being tied to it, infatuated with it, and utterly committed to it, seeing the danger in it and understanding the escape from it. What do you think, Jīvaka? Would that bhikkhu on such an occasion choose for his own affliction, or for another's affliction, or for the affliction of both?\"",
    "mn55:4": "\"No, venerable sir.\"",
    "mn55:5": "\"Does not that bhikkhu sustain himself with blameless food on that occasion?\"",
    "mn55:6": "\"Yes, venerable sir. I have heard this, venerable sir: ‘Brahmā abides in loving-kindness.’ Venerable sir, the Blessed One is my visible witness to that; for the Blessed One abides in loving-kindness.\"",
    "mn55:7": "\"Here, Jīvaka, a bhikkhu lives in dependence upon a certain village or town. He abides pervading one quarter with a mind imbued with compassion … with a mind imbued with altruistic joy … with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to himself, he abides pervading the all-encompassing world with a mind imbued with equanimity, abundant, exalted, immeasurable, without hostility and without ill will. Then a householder or a householder's son comes to him and invites him for the next day's meal. The bhikkhu accepts, if he likes … What do you think, Jīvaka? Would that bhikkhu on such an occasion choose for his own affliction, or for another's affliction, or for the affliction of both?\"",
    "mn55:8": "\"No, venerable sir.\"",
    "mn55:9": "\"Does not that bhikkhu sustain himself with blameless food on that occasion?\"",
    "mn55:10": "\"Yes, venerable sir. I have heard this, venerable sir: ‘Brahmā abides in equanimity.’ Venerable sir, the Blessed One is my visible witness to that; for the Blessed One abides in equanimity.\"",
    "mn55:11": "\"If anyone slaughters a living being for the Tathāgata or his disciple, he lays up much demerit in five instances. When he says: ‘Go and fetch that living being,’ this is the first instance in which he lays up much demerit. When that living being experiences pain and grief on being led along with a neck-halter, this is the second instance in which he lays up much demerit. When he says: ‘Go and slaughter that living being,’ this is the third instance in which he lays up much demerit. When that living being experiences pain and grief on being slaughtered, this is the fourth instance in which he lays up much demerit. When he provides the Tathāgata or his disciple with food that is not permissible, this is the fifth instance in which he lays up much demerit. Anyone who slaughters a living being for the Tathāgata or his disciple lays up much demerit in these five instances.\"",
    "mn55:12": "When this was said, Jīvaka Komārabhacca said to the Blessed One: \"It is wonderful, venerable sir, it is marvellous! The bhikkhus sustain themselves with permissible food. The bhikkhus sustain themselves with blameless food. Magnificent, venerable sir! Magnificent, venerable sir! … From today let the Blessed One remember me as a lay follower who has gone to him for refuge for life.\"[n.577] It is puzzling that Jīvaka here declares himself a lay follower as if for the first time when he had already been established in stream-entry. Perhaps this formula was used as a means of reaffirming one's dedication to the Triple Gem and was not restricted to an initial profession of going for refuge."
}