{
    "mn56:1": "Thus have I heard. On one occasion the Blessed One was living at Nāḷandā in Pāvārika's Mango Grove.",
    "mn56:2": "\"Friend Gotama, the Nigaṇṭha Nātaputta is not accustomed to use the description ‘action, action’; the Nigaṇṭha Nātaputta is accustomed to use the description ‘rod, rod.’\"[n.579]Daṇḍa,originally a stick or staff, acquires the meaning of rod as an instrument of punishment, and subsequently comes to mean punishment or infliction itself, even without reference to an instrument. Its use here suggests that the Jains regarded bodily, verbal, and mental activity as instruments by which the individual torments himself by prolonging his bondage in saṁsāra and torments others by causing them harm.",
    "mn56:3": "\"Then, Tapassī, how many kinds of rod does the Nigaṇṭha Nātaputta describe for the performance of evil action, for the perpetration of evil action?\"",
    "mn56:4": "\"Friend Gotama, the Nigaṇṭha Nātaputta describes three kinds of rod for the performance of evil action, for the perpetration of evil action; that is, the bodily rod, the verbal rod, and the mental rod.\"[n.580]MA:The Nigaṇṭhas held that the first two “rods” create kamma independently of the involvement of the mind(acittaka)just as, when the wind blows, the branches sway and the leaves rustle without any initiative of mind.",
    "mn56:5": "\"How then, Tapassī, is the bodily rod one, the verbal rod another, and the mental rod still another?\"",
    "mn56:6": "\"The bodily rod is one, friend Gotama, the verbal rod is another, and the mental rod is still another.\"",
    "mn56:7": "\"Of these three kinds of rod, Tapassī, thus analysed and distinguished, which kind of rod does the Nigaṇṭha Nātaputta describe as the most reprehensible for the performance of evil action, for the perpetration of evil action: the bodily rod or the verbal rod or the mental rod?\"",
    "mn56:8": "\"Of these three kinds of rod, friend Gotama, thus analysed and distinguished, the Nigaṇṭha Nātaputta describes the bodily rod as the most reprehensible for the performance of evil action, for the perpetration of evil action, and not so much the verbal rod and the mental rod.\"",
    "mn56:9": "\"Do you say the bodily rod, Tapassī?\"",
    "mn56:10": "\"I say the bodily rod, friend Gotama.\"",
    "mn56:11": "\"Do you say the bodily rod, Tapassī?\"",
    "mn56:12": "\"I say the bodily rod, friend Gotama.\"",
    "mn56:13": "\"Do you say the bodily rod, Tapassī?\"",
    "mn56:14": "\"I say the bodily rod, friend Gotama.\"",
    "mn56:15": "Thus the Blessed One made the Nigaṇṭha Dīgha Tapassī maintain his statement up to the third time.",
    "mn56:16": "Then the Nigaṇṭha Dīgha Tapassī asked the Blessed One: \"And you, friend Gotama, how many kinds of rod do you describe for the performance of evil action, for the perpetration of evil action?\"",
    "mn56:17": "\"Tapassī, the Tathāgata is not accustomed to use the description ‘rod, rod’; the Tathāgata is accustomed to use the description ‘action, action.’\"",
    "mn56:18": "\"But, friend Gotama, how many kinds of action do you describe for the performance of evil action, for the perpetration of evil action?\"",
    "mn56:19": "\"Tapassī, I describe three kinds of action for the performance of evil action, for the perpetration of evil action: that is, bodily action, verbal action, and mental action.\"",
    "mn56:20": "\"How then, friend Gotama, is bodily action one, verbal action another, and mental action still another?\"",
    "mn56:21": "\"Bodily action is one, Tapassī, verbal action is another, and mental action is still another.\"",
    "mn56:22": "\"Of these three kinds of action, friend Gotama, thus analysed and distinguished, which kind of action do you describe as the most reprehensible for the performance of evil action, for the perpetration of evil action: bodily action or verbal action or mental action?\"",
    "mn56:23": "\"Of these three kinds of action, Tapassī, thus analysed and distinguished, I describe mental action as the most reprehensible for the performance of evil action, for the perpetration of evil action, and not so much bodily action and verbal action.\"[n.581] The Buddha may have said this because in his teaching volition(cetanā),a mental factor, is the essential ingredient of kamma, and in its absence—that is, in the case of unintentional bodily or verbal activity—no kamma is created.MA,however, maintains that the Buddha said this referring to wrong view with fixed consequences(niyatā micchā diṭṭhi),and it quotes in supportAN 1:18.3/i.33: “Bhikkhus, I see nothing so blameworthy as wrong view. Wrong view is the most blameworthy of all things.” These types of wrong view are described atMN 60.5, 13 and 21.",
    "mn56:24": "\"Do you say mental action, friend Gotama?\"",
    "mn56:25": "\"I say mental action, Tapassī.\"",
    "mn56:26": "\"Do you say mental action, friend Gotama?\"",
    "mn56:27": "\"I say mental action, Tapassī.\"",
    "mn56:28": "\"Do you say mental action, friend Gotama?\"",
    "mn56:29": "\"I say mental action, Tapassī.\"",
    "mn56:30": "Thus the Nigaṇṭha Dīgha Tapassī made the Blessed One maintain his statement up to the third time, after which he rose from his seat and went to the Nigaṇṭha Nātaputta.",
    "mn56:31": "Now on that occasion the Nigaṇṭha Nātaputta was seated together with a large assembly of laymen from Bālaka headed by Upāli. The Nigaṇṭha Nātaputta saw the Nigaṇṭha Dīgha Tapassī coming in the distance and asked him: \"Now where are you coming from in the middle of the day, Tapassī?\"",
    "mn56:32": "When this was said, the householder Upāli said to the Nigaṇṭha Nātaputta: \"Good, good, venerable sir,on the part ofDīgha Tapassī! The venerable Tapassī has answered the recluse Gotama like a well-taught disciple who understands his teacher's dispensation rightly. What does the trivial mental rod count for in comparison with the gross bodily rod? On the contrary, the bodily rod is the most reprehensible for the performance of evil action, for the perpetration of evil action, and not so much the verbal rod and the mental rod. Now, venerable sir, I shall go and refute the recluse Gotama's doctrine on the basis of this statement. If the recluse Gotama maintains before me what the venerable Dīgha Tapassī made him maintain, then just as a strong man[n.582] As atMN 35.5.might seize a long-haired ram by the hair and drag him to and drag him fro and drag him round about, so in debate I will drag the recluse Gotama to and drag him fro and drag him round about. Just as a strong brewer's workman might throw a big brewer's sieve into a deep water tank, and taking it by the corners, might drag it to and drag it fro and drag it round about, so in debate I will drag the recluse Gotama to and drag him fro and drag him round about. Just as a strong brewer's mixer might take a strainer by the corners and shake it down and shake it up and thump it about, so in debate I will shake the recluse Gotama down and shake him up and thump him about. And just as a sixty-year-old elephant might plunge into a deep pond and enjoy playing the game of hemp-washing, so I shall enjoy playing the game of hemp-washing with the recluse Gotama . Venerable sir, I shall go and refute the recluse Gotama's doctrine on the basis of this statement.\"",
    "mn56:33": "When this was said, the Nigaṇṭha Dīgha Tapassī said to the Nigaṇṭha Nātaputta: \"Venerable sir, I do not agree that the householder Upāli shouldtry torefute the recluse Gotama's doctrine. For the recluse Gotama is a magician and knows a converting magic by which he converts disciples of other sectarians.\"",
    "mn56:34": "\"The Nigaṇṭha Dīgha Tapassī came here, householder.\"",
    "mn56:35": "\"Venerable sir, did you have some conversation with him?\"",
    "mn56:36": "\"I had some conversation with him, householder.\"",
    "mn56:37": "\"What was your conversation with him like, venerable sir?\"",
    "mn56:38": "Then the Blessed One related to the householder Upāli his entire conversation with the Nigaṇṭha Dīgha Tapassī.",
    "mn56:39": "When this was said, the householder Upāli said to the Blessed One: \"Good, good, venerable sir, on the part of Tapassī! The Nigaṇṭha Dīgha Tapassī has answered the Blessed One like a well-taught disciple who understands his teacher's dispensation rightly. What does the trivial mental rod count for in comparison with the gross bodily rod? On the contrary, the bodily rod is the most reprehensible for the performance of evil action, for the perpetration of evil action, and not so much the verbal rod and the mental rod.\"",
    "mn56:40": "\"What do you think, householder? Here some Nigaṇṭha might be afflicted, suffering, and gravely illwith an illness needing treatment by cold water, which his vows prohibitand he might refuse cold waterthough mentally longing for itand use onlythe permissiblehot waterthus keeping his vows bodily and verbally. Because he does not get cold water he might die. Now, householder, where would the Nigaṇṭha Nātaputta describe his rebirthas taking place?\"",
    "mn56:41": "\"Venerable sir, there are gods called ‘mind-bound’; he would be reborn there.",
    "mn56:42": "Why is that?",
    "mn56:43": "Because when he died he was still boundby attachmentin the mind.\"[n.583] The parenthetical additions in the previous paragraph, inserted by Ñm, are supplied fromMA.Ñm, in Ms, sums up the argument thus: The Nigaṇ̣ṭhas are not allowed to use cold water (because they regard it as containing living beings). By his bodily and verbal refusal of cold water he has kept his bodily and verbal conduct pure, but if he longs in his mind for cold water his mental conduct is impure, and thus he is reborn among the “mind-bound gods”(manosattā devā).",
    "mn56:44": "\"Householder, householder, pay attention how you reply! What you said afterwards does not agree with what you said before, nor does what you said before agree with what you said afterwards. Yet you made this statement: ‘I will debate on the basis of truth, venerable sir, so let us have some conversation about this.’\"",
    "mn56:45": "\"What do you think, householder? Here some Nigaṇṭha might be restrained with four checks — curbed by all curbs, clamped by all curbs, cleansed by all curbs, and claimed by all curbs[n.585] This statement, at DN 2.29/i.57, is ascribed to the Nigaṇṭha Nātaputta himself as a formulation of the Jain doctrine. Ñm points out in Ms that it may involve a pun on the word vāri, which can mean both \"water\" and \"curb\" (fromvāreti,to ward off). In my translation of the Sāmaññaphala Sutta,The Discourse on the Fruits of Recluseship,p. 24, I render it based on the Dīgha commentary as follows: \"A Nigaṇṭha is restrained with regard to all water; he is endowed with the avoidance of all evil; he is cleansed by the avoidance of all evil; he is suffused with the avoidance of all evil.\" Though the statement conveys a concern for moral purity, the tone is decidedly different from that of the Buddha’s teachings.— and yet when going forward and returning he brings about the destruction of many small living beings. What result does the Nigaṇṭha Nātaputta describe for him?\"",
    "mn56:46": "\"Venerable sir, the Nigaṇṭha Nātaputta does not describe what is unintended as greatly reprehensible.\"",
    "mn56:47": "\"But if one intends it, householder?\"",
    "mn56:48": "\"Then it is greatly reprehensible, venerable sir.\"",
    "mn56:49": "\"But under whichof the three rodsdoes the Nigaṇṭha Nātaputta describe volition, householder?\"",
    "mn56:50": "\"Under the mental rod, venerable sir.\"[n.586] The Buddha points to a contradiction between the Jain thesis that, even in the absence of volition, the \"bodily rod\" is the most reprehensible of all, and their assertion that the presence of volition significantly alters the moral character of an action.",
    "mn56:51": "\"Householder, householder, pay attention how you reply! What you said afterwards does not agree with what you said before, nor does what you said before agree with what you said afterwards. Yet you made this statement: ‘I will debate on the basis of truth, venerable sir, so let us have some conversation about this.’\"",
    "mn56:52": "\"What do you think, householder? Is this town of Nāḷandā successful and prosperous, is it populous and crowded with people?\"",
    "mn56:53": "\"Yes, venerable sir, it is.\"",
    "mn56:54": "\"What do you think, householder? Suppose a man came here brandishing a sword and spoke thus: ‘In one moment, in one instant, I will make all the living beings in this town of Nāḷandā into one mass of flesh, into one heap of flesh.’ What do you think, householder, would that man be able to do that?\"",
    "mn56:55": "\"Venerable sir, ten, twenty, thirty, forty, or even fifty men would not be able to make all the living beings in this town of Nāḷandā into one mass of flesh, into one heap of flesh in one moment or instant, so what does a single trivial man count for?\"",
    "mn56:56": "\"What do you think, householder? Suppose some recluse or brahmin came here possessed of supernormal power and attained to mastery of mind, and he spoke thus: ‘I will reduce this town of Nāḷandā to ashes with one mental act of hate.’ What do you think, householder, would such a recluse or brahmin be able to do that?\"",
    "mn56:57": "\"Venerable sir, such a recluse or brahmin possessed of supernormal power and attained to mastery of mind would be able to reduce ten, twenty, thirty, forty, or even fifty Nāḷandās to ashes with one mental act of hate, so what does a single trivial Nāḷandā count for?\"",
    "mn56:58": "\"Householder, householder, pay attention how you reply! What you said afterwards does not agree with what you said before, nor does what you said before agree with what you said afterwards. Yet you made this statement: ‘I will debate on the basis of truth, venerable sir, so let us have some conversation about this.’\"",
    "mn56:59": "\"Venerable sir, although the Blessed One has spoken thus, yet the bodily rod is the most reprehensible for the performance of evil action, for the perpetration of evil action, and not so much the verbal rod and the mental rod.\"",
    "mn56:60": "\"What do you think, householder? Have you heard how the Daṇḍaka, Kālinga, Mejjha, and Mātaṅga forests became forests?\"[n.587] See Jāt iii.463, v.133ff., 267; v.144; vi.389, v.267; v.114, 267; Miln 130.",
    "mn56:61": "\"Yes, venerable sir.\"",
    "mn56:62": "\"As you heard it, how did they become forests?\"",
    "mn56:63": "\"Venerable sir, I heard that they became forests by means of a mental act of hate on the part of the seers.\"",
    "mn56:64": "\"Householder, householder, pay attention how you reply! What you said before does not agree with what you said afterwards, nor does what you said afterwards agree with what you said before. Yet you made this statement: ‘I will debate on the basis of truth, venerable sir, so let us have some conversation about this.’\"",
    "mn56:65": "\"Venerable sir, I was satisfied and pleased by the Blessed One's very first simile. Nevertheless, I thought I would oppose the Blessed One thus since I desired to hear the Blessed One's varied solutions to the problem. Magnificent, venerable sir! Magnificent, venerable sir! The Blessed One has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. Venerable sir, I go to the Blessed One for refuge and to the Dhamma and to the Saṅgha of bhikkhus. Let the Blessed One remember me as a lay follower who has gone to him for refuge for life.\"",
    "mn56:66": "\"Investigate thoroughly, householder. It is good for such well-known people like you to investigate thoroughly.\"",
    "mn56:67": "\"Householder, your family has long supported the Nigaṇṭhas and you should consider that alms should be given to them when they come.\"",
    "mn56:68": "Then the Blessed One gave the householder Upāli progressive instruction, that is, talk on giving, talk on virtue, talk on the heavens; he explained the danger, degradation, and defilement in sensual pleasures and the blessing of renunciation. When he knew that the householder Upāli's mind was ready, receptive, free from hindrances, elated, and confident, he expounded to him the teaching special to the Buddhas: suffering, its origin, its cessation, and the path. Just as a clean cloth with all marks removed would take dye evenly, so too, while the householder Upāli sat there, the spotless immaculate vision of the Dhamma arose in him: \"All that is subject to arising is subject to cessation.\"[n.588]MA:Vision of the Dhamma(dhammacakkhu)is the path of stream-entry. The phrase \"All that is subject to arising is subject to cessation\" shows the mode in which the path arises. The path takes cessation (Nibbāna) as its object, but its function is to penetrate all conditioned states as subject to arising and cessation.Then the householder Upāli saw the Dhamma, attained the Dhamma, understood the Dhamma, fathomed the Dhamma; he crossed beyond doubt, did away with perplexity, gained intrepidity, and became independent of others in the Teacher's Dispensation.[n.589] The \"Dhamma\" referred to here is the Four Noble Truths. Having seen these truths for himself, he has cut off the fetter of doubt and now possesses the \"view that is noble and emancipating and (which) leads the one who practises in accordance with it to the complete destruction of suffering\" (MN 48.7).Then he said to the Blessed One: \"Now, venerable sir, we must go. We are busy and have much to do.\"",
    "mn56:69": "Then the householder Upāli, having delighted and rejoiced in the Blessed One's words, rose from his seat, and after paying homage to the Blessed One, keeping him on his right, he left to return to his own house. There he addressed the doorkeeper thus: \"Good doorkeeper, from today on I close my door to the Nigaṇṭhas and the Nigaṇṭhīs, and I open my door to the Blessed One's bhikkhus, bhikkhunīs, men lay followers, and women lay followers. If any Nigaṇṭha comes, then tell him thus: ‘Wait, venerable sir, do not enter. From today on the householder Upāli has gone over to discipleship under the recluse Gotama. He has closed his door to the Nigaṇṭhas and Nigaṇṭhīs, and he has opened it to the Blessed One's bhikkhus, bhikkhunīs, men lay followers, and women lay followers. Venerable sir, if you need alms, wait here; they will bring it to you here.’\" — \"Yes, venerable sir,\" the doorkeeper replied.",
    "mn56:70": "The Nigaṇṭha Dīgha Tapassī heard: \"The householder Upāli has gone over to discipleship under the recluse Gotama.\" Then he went to the Nigaṇṭha Nātaputta and told him: \"Venerable sir, I have heard thus: ‘The householder Upāli has gone over to discipleship under the recluse Gotama.’\"",
    "mn56:71": "Then the Nigaṇṭha Dīgha Tapassī went to the householder Upāli's house. The doorkeeper saw him coming in the distance and told him: \"Wait, venerable sir, do not enter. From today on the householder Upāli has gone over to discipleship under the recluse Gotama. He has closed his door to the Nigaṇṭhas and Nigaṇṭhīs, and he has opened it to the Blessed One's bhikkhus, bhikkhunīs, men lay followers, and women lay followers. Venerable sir, if you need alms, wait here; they will bring it to you here.\"",
    "mn56:72": "Then the Nigaṇṭha Nātaputta went with a large assembly of Nigaṇṭhas to the householder Upāli's house. The doorkeeper saw him coming in the distance and told him: \"Wait, venerable sir, do not enter. From today on the householder Upāli has gone over to discipleship under the recluse Gotama. He has closed his door to the Nigaṇṭhas and Nigaṇṭhīs, and he has opened his door to the Blessed One's bhikkhus, bhikkhunīs, men lay followers, and women lay followers. Venerable sir, if you need alms, wait here; they will bring it to you here.\"",
    "mn56:73": "Then the householder Upāli went to the hall of the central door and sat down on the highest, best, chief, most excellent seat there. Then he told the doorkeeper: \"Now, good doorkeeper, go to the Nigaṇṭha Nātaputta and tell him: ‘Venerable sir, the householder Upāli says: \"Enter, venerable sir, if you wish.\"’\"",
    "mn56:74": "\"Auspicious is that converting magic, venerable sir, good is that converting magic![n.590]MA:Upāli says this referring to the path of stream-entry he had penetrated earlier.Venerable sir, if my beloved kinsmen and relatives were to be converted by this conversion, it would lead to the welfare and happiness of my beloved kinsmen and relatives for a long time. If all nobles were to be converted by this conversion, it would lead to the welfare and happiness of the nobles for a long time. If all brahmins … all merchants … all workers were to be converted by this conversion, it would lead to the welfare and happiness of the workers for a long time. If the world with its gods, its Māras, and its Brahmās, this generation with its recluses and brahmins, its princes and its people, were to be converted by this conversion, it would lead to the welfare and happiness of the world for a long time. As to this, venerable sir, I shall give you a simile; for some wise men here understand the meaning of a statement by a simile.",
    "mn56:75": "\"Venerable sir, there was once a brahmin who was old, aged, and burdened with years, and he had as a wife a young brahmin girl who was pregnant and near her confinement. Then she told him: ‘Go, brahmin, buy a young monkey in the market and bring it back to me as a playmate for my child.’ He replied: ‘Wait, madam, till you have borne the child. If you bear a boy, then I will go to the market and buy a young male monkey and bring it back to you as a playmate for your little boy; but if you bear a girl, then I will go to the market and buy a young female monkey and bring it back to you as a playmate for your little girl.’ For the second time she made the same request and received the same answer. For the third time she made the same request.",
    "mn56:76": "Then, since his mind was bound to her with love, he went to the market, bought a young male monkey, brought it back, and told her: ‘I have bought this young male monkey in the market and brought it back to you as a playmate for your child.’ Then she told him: ‘Go, brahmin, take this young male monkey to Rattapāṇi the dyer's son and tell him: \"Good Rattapāṇi, I want this young male monkey dyed the colour called yellow-unguent, pounded and re-pounded, and smoothened out on both sides.\"’",
    "mn56:77": "Then, since his mind was bound to her with love, he took the young male monkey to Rattapāṇi the dyer's son and told him: ‘Good Rattapāṇi, I want this young male monkey dyed the colour called yellow-unguent, pounded and re-pounded, and smoothened out on both sides.’ Rattapāṇi the dyer's son told him: ‘Venerable sir, this young male monkey will take a dyeing but not a pounding or a smoothening out.’ So too, venerable sir, the doctrine of the foolish Nigaṇṭhas will give delight to fools but not to the wise, and it will not withstand testing or being smoothened out.",
    "mn56:78": "\"Then, venerable sir, on another occasion that brahmin took a pair of new garments to Rattapāṇi the dyer's son and told him: ‘Good Rattapāṇi, I want this pair of new garments dyed the colour called yellow-unguent, pounded and re-pounded, and smoothened out on both sides.’ Rattapāṇi the dyer's son told him:",
    "mn56:79": "\"Householder, the assembly and the king know you thus: ‘The householder Upāli is a disciple of the Nigaṇṭha Nātaputta.’ Whose disciple should we consider you to be?\"",
    "mn56:80": "He is the Wise One who has cast off delusion,abandoned the heart's wilderness,[n.591] SeeMN 16.3–7.victor in battle;He knows no anguish, is perfectly even-minded,mature in virtue, of excellent wisdom;Beyond all temptations,[n.592] PTS and SBJ readvessantarassa;the BBS ed. of text and MA readvesamantarassa;MṬ supports the former reading. MA explains: \"He has transcended the unrighteous state(visama)of lust, etc.\"he is without stain:The Blessed One is he, and I am his disciple.",
    "mn56:81": "Free from perplexity, he abides contented,spurning worldly gains, a vessel of gladness;A human being who has done the recluse's duty,a man who bears his final body;He is utterly peerless and utterly spotless:The Blessed One is he, and I am his disciple.",
    "mn56:82": "He is free from doubt and skilful,the discipliner and excellent leader.None can surpass his resplendent qualities;without hesitation, he is the illuminator;Having severed conceit, he is the hero:The Blessed One is he, and I am his disciple.",
    "mn56:83": "The leader of the herd, he cannot be measured,his depths are unfathomed, he attained to the silence;[n.593]Monapattassa.The \"silence\" is wisdom, related tomuni,silent sage.Provider of safety, possessor of knowledge,he stands in the Dhamma, inwardly restrained;Having overcome all bondage, he is liberated:The Blessed One is he, and I am his disciple.",
    "mn56:84": "The immaculate tusker, living in remoteness,with fetters all shattered, fully freed;Skilled in discussion, imbued with wisdom,his banner lowered,[n.594] The \"banner\" is the conceit \"I am.\" SeeMN 22.35he no longer lusts;Having tamed himself, he no more proliferates:[n.595]Nippapañcassa.Seen.229.The Blessed One is he, and I am his disciple.",
    "mn56:85": "The best of seers,[n.596]Isisattamassa.MA interprets this to mean \"the seventh seer\" — in line with the brahmanic conception of the seven rishis — and takes it as referring to Gotama's status as the seventh Buddha since Vipassī (seeDN 14.1.4/ii.2). It is more probable, however, thatsattamahere is the superlative ofsad,and thus that the compound means \"the best of seers.\" The expression isisattama occurs atSn 356, and the commentary to that verse allows both interpretations, offeringuttamaas a gloss onsattama.with no deceptive schemes,gained the triple knowledge, attained to holiness;His heart cleansed, a master of discourse,he lives ever tranquil, the finder of knowledge;The first of all givers, he is ever capable:The Blessed One is he, and I am his disciple.",
    "mn56:86": "He is the Noble One, developed in mind,who has gained the goal and expounds the truth;Endowed with mindfulness and penetrative insight,he leans neither forwards nor back;[n.597] This refers to the absence of attachment and repulsion.Free from perturbation, attained to mastery:The Blessed One is he, and I am his disciple.",
    "mn56:87": "He has fared rightly and abides in meditation,inwardly undefiled, in purity perfect;He is independent and altogether fearless,[n.598] Ñm translates from a Siamese v.l.appabhītassa,pointing out that PTS'sappahīnassadoes not make good sense here.living secluded, attained to the summit;Having crossed over himself, he leads us across:The Blessed One is he, and I am his disciple.",
    "mn56:88": "Of supreme serenity, with extensive wisdom,a man of great wisdom, devoid of all greed;He is the Tathāgata, he is the Sublime One,the person unrivalled, the one without equal;He is intrepid, proficient in all:The Blessed One is he, and I am his disciple.",
    "mn56:89": "He has severed craving and become the Enlightened One,cleared of all fumes, completely untainted;Most worthy of gifts, most mighty of spirits,most perfect of persons, beyond estimation;The greatest in grandeur, attained the peak of glory:The Blessed One is he, and I am his disciple.\"",
    "mn56:90": "\"When did you concoct that hymn of praise to the recluse Gotama, householder?\""
}