{
    "mn57:1": "Thus have I heard. On one occasion the Blessed One was living in the Koliyan country where there was a town of the Koliyans named Haliddavasana.",
    "mn57:2": "\"Well, Puṇṇa, since I certainly cannot persuade you when I say: ‘Enough, Puṇṇa, let that be. Do not ask me that,’ I shall therefore answer you.",
    "mn57:3": "Then the Blessed One told Puṇṇa, son of the Koliyans, the ox-duty ascetic: \"Puṇṇa, I could not persuade you when I said: ‘Enough, Puṇṇa, let that be. Do not ask me that.’\"Then Seniya the naked dog-duty ascetic said:\"Venerable sir, I am not crying because the Blessed One has said this about me, but because I have long taken up and practised this dog-duty. Venerable sir, this Puṇṇa, son of the Koliyans, is an ox-duty ascetic. He has long taken up and practised that ox-duty. What will be his destination? What will be his future course?\"",
    "mn57:4": "\"Well, Seniya, since I certainly cannot persuade you when I say: ‘Enough, Seniya, let that be. Do not ask me that,’ I shall therefore answer you.",
    "mn57:5": "Then the Blessed One told Seniya the naked dog-duty ascetic: \"Seniya, I could not persuade you when I said: ‘Enough, Seniya, let that be. Do not ask me that.’\"",
    "mn57:6": "\"Puṇṇa, there are four kinds of action proclaimed by me after realising them for myself with direct knowledge. What are the four? There is dark action with dark result; there is bright action with bright result; there is dark-and-bright action with dark-and-bright result; and there is action that is neither dark nor bright with neither-dark-nor-bright result, action that leads to the destruction of action.",
    "mn57:7": "\"And what, Puṇṇa, is dark action with dark result? Here someone generates an afflictive bodily formation, an afflictive verbal formation, an afflictive mental formation.[n.602]Sabyābajjhaṁ kāyasaṅkhāraṁ (vacīsaṅkhārȧ, manosaṅkhāraṁ) abhisaṅkharoti.Here an \"afflictive bodily formation\" may be understood as the volition responsible for the three courses of unwholesome bodily action; an \"afflictive verbal formation\" as the volition responsible for the four courses of unwholesome verbal action; and an \"afflictive mental formation\" as the volition responsible for the three courses of unwholesome mental action. SeeMN 9.4.Having generated an afflictive bodily formation, an afflictive verbal formation, an afflictive mental formation, he reappears in an afflictive world.[n.603] He is reborn in one of the states of deprivation — hell, the animal kingdom, or the realm of ghosts.When he has reappeared in an afflictive world, afflictive contacts touch him. Being touched by afflictive contacts, he feels afflictive feelings, exclusively painful, as in the case of the beings in hell. Thus a being's reappearance is due to a being:[n.604]Bhūtā bhūtassa upapatti hoti.MA:Beings are reborn through the actions they perform and in ways conforming to those actions. The implications of this thesis are explored more fully inMN 135andMN 136.one reappears through the actions one has performed. When one has reappeared, contacts touch one. Thus I say beings are the heirs of their actions. This is called dark action with dark result.",
    "mn57:8": "\"And what, Puṇṇa, is bright action with bright result? Here someone generates an unafflictive bodily formation, an unafflictive verbal formation, an unafflictive mental formation.[n.605] Here the volitions responsible for the ten courses of wholesome action, together with the volitions of the jhānas, are intended.Having generated an unafflictive bodily formation, an unafflictive verbal formation, an unafflictive mental formation, he reappears in an unafflictive world.[n.606] He is reborn in a heavenly world.When he has reappeared in an unafflictive world, unafflictive contacts touch him. Being touched by unafflictive contacts, he feels unafflictive feelings, exclusively pleasant, as in the case of the gods of Refulgent Glory. Thus a being's reappearance is due to a being; one reappears through the actions one has performed. When one has reappeared, contacts touch one. Thus I say beings are the heirs of their actions. This is called bright action with bright result.",
    "mn57:9": "\"And what, Puṇṇa, is dark-and-bright action with dark-and-bright result? Here someone generates a bodily formation that is both afflictive and unafflictive, a verbal formation that is both afflictive and unafflictive, a mental formation that is both afflictive and unafflictive.[n.607] Strictly speaking, no volitional action can be simultaneously both wholesome and unwholesome, for the volition responsible for the action must be either one or the other. Thus here we should understand that the being engages in a medley of wholesome and unwholesome actions, none of which is particularly dominant.Having generated a bodily formation, a verbal formation, a mental formation that is both afflictive and unafflictive, he reappears in a world that is both afflictive and unafflictive. When he has reappeared in a world that is both afflictive and unafflictive, both afflictive and unafflictive contacts touch him. Being touched by both afflictive and unafflictive contacts, he feels both afflictive and unafflictive feelings, mingled pleasure and pain, as in the case of human beings and some gods and some beings in the lower worlds. Thus a being's reappearance is due to a being: one reappears through the actions one has performed. When one has reappeared, contacts touch one. Thus I say beings are the heirs to their actions. This is called dark-and-bright action with dark-and-bright result.",
    "mn57:10": "\"And what, Puṇṇa, is action that is neither dark nor bright with neither-dark-nor-bright result, action that leads to the destruction of action? Therein, the volition for abandoning the kind of action that is dark with dark result, and the volition for abandoning the kind of action that is bright with bright result, and the volition for abandoning the kind of action that is dark and bright with dark-and-bright result: this is called action that is neither dark nor bright with neither-dark-nor-bright result, action that leads to the destruction of action.[n.608]MA: This is the volition of the four supramundane paths culminating in arahantship. Although the arahant performs deeds, his deeds no longer have any kammic potency to generate new existence or to bring forth results even in the present existence.These are the four kinds of action proclaimed by me after realising them for myself with direct knowledge.\"",
    "mn57:11": "When this was said, Puṇṇa, son of the Koliyans, the ox-duty ascetic said to the Blessed One: \"Magnificent, venerable sir! Magnificent, venerable sir! The Blessed One has made the Dhamma clear in many ways … From today let the Blessed One remember me as a lay follower who has gone to him for refuge for life.\"",
    "mn57:12": "\"Venerable sir, if those who formerly belonged to another sect and desire the going forth and the full admission in this Dhamma and Discipline live on probation for four months, and if at the end of the four months the bhikkhus being satisfied with them give them the going forth and the full admission to the bhikkhus’ state, then I will live on probation for four years. At the end of the four years if the bhikkhus are satisfied with me, let them give me the going forth and the full admission to the bhikkhus’ state.\"",
    "mn57:13": "Then Seniya the naked dog-duty ascetic received the going forth under the Blessed One, and he received the full admission. And soon, not long after his full admission, dwelling alone, withdrawn, diligent, ardent, and resolute, the venerable Seniya, by realising for himself with direct knowledge, here and now entered upon and abided in that supreme goal of the holy life for the sake of which clansmen rightly go forth from the home life into homelessness. He directly knew:",
    "mn57:14": "\"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.\" And the venerable Seniya became one of the arahants."
}