{
    "mn58:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Bamboo Grove, the Squirrels’ Sanctuary.",
    "mn58:2": "After paying homage to the Blessed One, he sat down at one side, looked at the sun, and thought: \"It is too late today to refute the Blessed One's doctrine. I shall refute the Blessed One's doctrine in my own house tomorrow.\" Then he said to the Blessed One: \"Venerable sir, let the Blessed One with three others consent to accept tomorrow's meal from me.\" The Blessed One consented in silence.",
    "mn58:3": "\"Venerable sir, would a Tathāgata utter such speech as would be unwelcome and disagreeable to others?\"",
    "mn58:4": "Now on that occasion a young tender infant was lying prone on Prince Abhaya's lap. Then the Blessed One said to Prince Abhaya: \"What do you think, prince? If, while you or your nurse were not attending to him, this child were to put a stick or a pebble in his mouth, what would you do to him?\"",
    "mn58:5": "\"Venerable sir, when learned nobles, learned brahmins, learned householders, and learned recluses, after formulating a question, then go to the Blessed One and pose it, has there already been in the Blessed One's mind the thought: ‘If they come to me and ask me thus, I shall answer thus’? Or does that answer occur to the Tathāgata on the spot?\"",
    "mn58:6": "\"As to that, prince, I shall ask you a question in return. Answer it as you choose. What do you think, prince? Are you skilled in the parts of a chariot?\"",
    "mn58:7": "\"Yes, venerable sir, I am.\"",
    "mn58:8": "\"What do you think, prince? When people come to you and ask: ‘What is the name of this part of the chariot?’ has there already been in your mind the thought: ‘If they come to me and ask me thus, I shall answer them thus’? Or does that answer occur to you on the spot?\"",
    "mn58:9": "\"Venerable sir, I am well known as a charioteer skilled in the parts of a chariot. All the parts of a chariot are well known to me. That answer would occur to me on the spot.\"",
    "mn58:10": "\"So too, prince, when learned nobles, learned brahmins, learned householders, and learned recluses, after formulating a question, then come to the Tathāgata and pose it, the answer occurs to the Tathāgata on the spot. Why is that? That element of things has been fully penetrated by the Tathāgata, through the full penetration of which the answer occurs to the Tathāgata on the spot.\"[n.614]MAsays thatdhammadhātu(\"element of things\") refers to the Buddha’s knowledge of omniscience.Dhammadhātuhere should not be confused with the same term used to signify the element of mind-objects among the eighteen elements, nor does it bear the meaning of an all-embracing cosmic principle that the term acquires in Mahāyāna Buddhism.",
    "mn58:11": "When this was said, Prince Abhaya said: \"Magnificent, venerable sir! Magnificent, venerable sir! The Blessed One has made the Dhamma clear in many ways … From today let the Blessed One remember me as a lay follower who has gone to him for refuge for life.\""
}