{
    "mn59:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn59:2–3": "A second time and a third time the venerable Udāyin stated his position, and a second time and a third time the carpenter Pañcakanga stated his. But the venerable Udāyin could not convince the carpenter Pañcakanga nor could the carpenter Pañcakanga convince the venerable Udāyin.",
    "mn59:4": "The venerable Ānanda heard their conversation. Then he went to the Blessed One, and after paying homage to him, he sat down at one side and reported to the Blessed One the entire conversation between the venerable Udāyin and the carpenter Pañcakanga. When he had finished, the Blessed One told the venerable Ānanda:",
    "mn59:5": "\"Ānanda, there are these five cords of sensual pleasure. What are the five? Forms cognizable by the eye that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. Sounds cognizable by the ear … Odours cognizable by the nose … Flavours cognizable by the tongue … Tangibles cognizable by the body that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. These are the five cords of sensual pleasure. Now the pleasure and joy that arise dependent on these five cords of sensual pleasure are called sensual pleasure.",
    "mn59:6": "\"Should anyone say: ‘That is the utmost pleasure and joy that beings experience,’ I would not concede that to him. Why is that? Because there is another kind of pleasure loftier and more sublime than that pleasure. And what is that other kind of pleasure? Here, Ānanda, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. This is that other kind of pleasure loftier and more sublime than the previous pleasure.",
    "mn59:7": "\"Should anyone say: ‘That is the utmost pleasure and joy that beings experience,’ I would not concede that to him. Why is that? Because there is another kind of pleasure loftier and more sublime than that pleasure. And what is that other kind of pleasure? Here, Ānanda, with the stilling of applied and sustained thought, a bhikkhu enters upon and abides in the second jhāna, which has self-confidence and singleness of mind without applied and sustained thought, with rapture and pleasure born of concentration. This is that other kind of pleasure loftier and more sublime than the previous pleasure.",
    "mn59:8": "\"Should anyone say … And what is that other kind of pleasure? Here, Ānanda, with the fading away as well of rapture, a bhikkhu abides in equanimity, mindful and fully aware, and still feeling pleasure with the body, he enters upon and abides in the third jhāna, on account of which noble ones announce: ‘He has a pleasant abiding who has equanimity and is mindful.’ This is that other kind of pleasure loftier and more sublime than the previous pleasure.",
    "mn59:9": "\"Should anyone say … And what is that other kind of pleasure? Here, Ānanda, with the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, a bhikkhu enters upon and abides in the fourth jhāna, which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity. This is that other kind of pleasure loftier and more sublime than the previous pleasure.[n.617]MApoints out that by speaking of the neither-painful-nor-pleasant feeling of the fourth jhāna as a kind of pleasure, the Buddha is implicitly endorsing the view put forth by Pañcakanga.",
    "mn59:10": "\"Should anyone say … And what is that other kind of pleasure? Here, Ānanda, with the complete surmounting of perceptions of form, with the disappearance of perceptions of sensory impact, with non-attention to perceptions of diversity, aware that ‘space is infinite,’ a bhikkhu enters upon and abides in the base of infinite space. This is that other kind of pleasure loftier and more sublime than the previous pleasure.",
    "mn59:11": "\"Should anyone say … And what is that other kind of pleasure? Here, Ānanda, by completely surmounting the base of infinite space, aware that ‘consciousness is infinite,’ a bhikkhu enters upon and abides in the base of infinite consciousness. This is that other kind of pleasure loftier and more sublime than the previous pleasure.",
    "mn59:12": "\"Should anyone say … And what is that other kind of pleasure? Here, Ānanda, by completely surmounting the base of infinite consciousness, aware that ‘there is nothing,’ a bhikkhu enters upon and abides in the base of nothingness. This is that other kind of pleasure loftier and more sublime than the previous pleasure.",
    "mn59:13": "\"Should anyone say … And what is that other kind of pleasure? Here, Ānanda, by completely surmounting the base of nothingness, a bhikkhu enters upon and abides in the base of neither-perception-nor-non-perception. This is that other kind of pleasure loftier and more sublime than the previous pleasure.",
    "mn59:14": "\"Should anyone say: ‘That is the utmost pleasure and joy that beings experience,’ I would not concede that to him. Why is that? Because there is another kind of pleasure loftier and more sublime than that pleasure. And what is that other kind of pleasure? Here, Ānanda, by completely surmounting the base of neither-perception-nor-non-perception, a bhikkhu enters upon and abides in the cessation of perception and feeling. This is that other kind of pleasure loftier and more sublime than the previous pleasure.",
    "mn59:15": "\"It is possible, Ānanda, that wanderers of other sects might speak thus: ‘The recluse Gotama speaks of the cessation of perception and feeling and he describes that as pleasure. What is this, and how is this?’ Wanderers of other sects who speak thus should be told: ‘Friends, the Blessed One describes pleasure not only with reference to pleasant feeling; rather, friends, the Tathāgata describes as pleasure any kind of pleasure wherever and in whatever way it is found.’\"[n.618] MA: Both felt pleasure and unfelt pleasure are found (the latter being the pleasure pertaining to the attainment of cessation). The Tathāgata describes both as pleasure in the sense that they are without suffering(niddukkhabhāva).",
    "mn59:16": "That is what the Blessed One said. The venerable Ānanda was satisfied and delighted in the Blessed One's words."
}