{
    "mn61:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Bamboo Grove, the Squirrels’ Sanctuary.",
    "mn61:2": "Then the Blessed One left a little water in the water vessel and asked the venerable Rāhula: \"Rāhula, do you see this little water left in the water vessel?\" — \"Yes, venerable sir.\" — \"Even so little, Rāhula, is the recluseship of those who are not ashamed to tell a deliberate lie.\"",
    "mn61:3": "\"What do you think, Rāhula? What is the purpose of a mirror?\"",
    "mn61:4": "\"For the purpose of reflection, venerable sir.\"",
    "mn61:5": "\"So too, Rāhula, an action with the body should be done after repeated reflection; an action by speech should be done after repeated reflection; an action by mind should be done after repeated reflection.",
    "mn61:6": "\"Also, Rāhula, while you are doing an action with the body, you should reflect upon that same bodily action thus: ‘Does this action that I am doing with the body lead to my own affliction, or to the affliction of others, or to the affliction of both? Is it an unwholesome bodily action with painful consequences, with painful results?’ When you reflect, if you know: ‘This action that I am doing with the body leads to my own affliction, or to the affliction of others, or to the affliction of both; it is an unwholesome bodily action with painful consequences, with painful results,’ then you should suspend such a bodily action. But when you reflect, if you know: ‘This action that I am doing with the body does not lead to my own affliction, or to the affliction of others, or to the affliction of both; it is a wholesome bodily action with pleasant consequences, with pleasant results,’ then you may continue in such a bodily action.",
    "mn61:7": "\"Also, Rāhula, after you have done an action with the body, you should reflect upon that same bodily action thus: ‘Did this action that I did with the body lead to my own affliction, or to the affliction of others, or to the affliction of both? Was it an unwholesome bodily action with painful consequences, with painful results?’ When you reflect, if you know: ‘This action that I did with the body led to my own affliction, or to the affliction of others, or to the affliction of both; it was an unwholesome bodily action with painful consequences, with painful results,’ then you should confess such a bodily action, reveal it, and lay it open to the Teacher or to your wise companions in the holy life. Having confessed it, revealed it, and laid it open, you should undertake restraint for the future.[n.638] To acknowledge a wrong deed as such, confess it, and undertake restraint for the future leads to growth in the discipline of the Noble One. SeeMN63.But when you reflect, if you know: ‘This action that I did with the body did not lead to my own affliction, or to the affliction of others, or to the affliction of both; it was a wholesome bodily action with pleasant consequences, pleasant results,’ you can abide happy and glad, training day and night in wholesome states.",
    "mn61:8": "\"Rāhula, when you wish to do an action by speech, you should reflect upon that same action by speech thus: ‘Would this action that I wish to do by speech lead to my own affliction, or to the affliction of others, or to the affliction of both? Is it an unwholesome action by speech with painful consequences, with painful results?’ When you reflect, if you know: ‘This action by speech that I wish to do would lead to my own affliction, or to the affliction of others, or to the affliction of both; it is an unwholesome action by speech with painful consequences, with painful results,’ then you definitely should not do such an action by speech. But when you reflect, if you know: ‘This action by speech that I wish to do would not lead to my own affliction, or to the affliction of others, or to the affliction of both; it is a wholesome action by speech with pleasant consequences, with pleasant results,’ then you may do such an action by speech.",
    "mn61:9": "\"Also, Rāhula, while you are doing an action by speech, you should reflect upon that same action by speech thus: ‘Does this action that I am doing by speech lead to my own affliction, or to the affliction of others, or to the affliction of both? Is it an unwholesome action by speech with painful consequences, with painful results?’ When you reflect, if you know: ‘This action that I am doing by speech leads to my own affliction, or to the affliction of others, or to the affliction of both; it is an unwholesome action by speech with painful consequences, with painful results,’ then you should suspend such a action by speech. But when you reflect, if you know: ‘This action that I am doing with the body does not lead to my own affliction, or to the affliction of others, or to the affliction of both; it is a wholesome action by speech with pleasant consequences, with pleasant results,’ then you may continue in such a action by speech.",
    "mn61:10": "\"Also, Rāhula, after you have done an action by speech, you should reflect upon that same action by speech thus: ‘Did this action that I did with the body lead to my own affliction, or to the affliction of others, or to the affliction of both? Was it an unwholesome action by speech with painful consequences, with painful results?’ When you reflect, if you know: ‘This action that I did with the body led to my own affliction, or to the affliction of others, or to the affliction of both; it was an unwholesome action by speech with painful consequences, with painful results,’ then you should confess such a action by speech, reveal it, and lay it open to the Teacher or to your wise companions in the holy life. Having confessed it, revealed it, and laid it open, you should undertake restraint for the future. But when you reflect, if you know: ‘This action that I did by speech did not lead to my own affliction, or to the affliction of others, or to the affliction of both; it was a wholesome action by speech with pleasant consequences, pleasant results,’ you can abide happy and glad, training day and night in wholesome states.",
    "mn61:11": "\"Rāhula, when you wish to do an action by mind, you should reflect upon that same action by mind thus: ‘Would this action that I wish to do by mind lead to my own affliction, or to the affliction of others, or to the affliction of both? Is it an unwholesome action by mind with painful consequences, with painful results?’ When you reflect, if you know: ‘This action by mind that I wish to do would lead to my own affliction, or to the affliction of others, or to the affliction of both; it is an unwholesome action by mind with painful consequences, with painful results,’ then you definitely should not do such an action by mind. But when you reflect, if you know: ‘This action by mind that I wish to do would not lead to my own affliction, or to the affliction of others, or to the affliction of both; it is a wholesome action by mind with pleasant consequences, with pleasant results,’ then you may do such an action by mind.",
    "mn61:12": "\"Also, Rāhula, while you are doing an action by mind, you should reflect upon that same mental action thus: ‘Does this mental action that I am doing lead to my own affliction, or to the affliction of others, or to the affliction of both? Is it an unwholesome mental action with painful consequences, with painful results?’ When you reflect, if you know: ‘This mental action that I am doing with the body leads to my own affliction, or to the affliction of others, or to the affliction of both; it is an unwholesome mental action with painful consequences, with painful results,’ then you should suspend such a mental action. But when you reflect, if you know: ‘This mental action that I am doing does not lead to my own affliction, or to the affliction of others, or to the affliction of both; it is a wholesome mental action with pleasant consequences, with pleasant results,’ then you may continue in such a mental action.",
    "mn61:13": "\"Also, Rāhula, after you have done a mental action, you should reflect upon that same mental action: ‘Did this mental action that I did lead to my own affliction, or to the affliction of others, or to the affliction of both? Was it an unwholesome mental action with painful consequences, with painful results?’ When you reflect, if you know: ‘This mental action that I did led to my own affliction, or to the affliction of others, or to the affliction of both; it was an unwholesome mental action with painful consequences, with painful results,’ then you should be repelled,humiliated, and disgusted by that mental action. Having become repelled, humiliated, and disgusted by that action. Having confessed it, revealed it, and laid it open, you should undertake restraint for the future. But when you reflect, if you know: ‘This mental action did not lead to my own affliction, or to the affliction of others, or to the affliction of both; it was a wholesome mental action with pleasant consequences, pleasant results,’ you can abide happy and glad, training day and night in wholesome states.[n.639] Unwholesome thoughts, unlike bodily and verbal transgressions, do not require confession as a means of exoneration. Both Horner inMLSand Ñm in Ms missed this variation.",
    "mn61:14": "\"Rāhula, whatever recluses and brahmins in the past purified their bodily action, their verbal action, and their mental action, all did so by repeatedly reflecting thus. Whatever recluses and brahmins in the future will purify their bodily action, their verbal action, and their mental action, all will do so by repeatedly reflecting thus. Whatever recluses and brahmins in the present are purifying their bodily action, their verbal action, and their mental action, all are doing so by repeatedly reflecting thus. Therefore, Rāhula, you should train thus: ‘We will purify our bodily action, our verbal action, and our mental action by repeatedly reflecting upon them.’\"",
    "mn61:15": "That is what the Blessed One said. The venerable Rāhula was satisfied and delighted in the Blessed One's words."
}