{
    "mn64:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn64:2": "When this was said, the venerable Mālunkyāputta replied: \"Venerable sir, I remember the five lower fetters as taught by the Blessed One.\"[n.649] The five lower fetters(orambhāgiyāni saṁyojanāni)are so called because they lead to rebirth in the sense-sphere planes. They are eradicated in their entirety only by the non-returner.",
    "mn64:3": "\"Mālunkyāputta, to whom do you remember my having taught these five lower fetters in that way?[n.650]MA:The question may be raised: \"When the Buddha had asked about the fetters and the Elder replied in terms of the fetters, why does the Buddha criticise his reply?\" The reason is that Mālunkyāputta held the view that a person is fettered by the defilements only at times when they assail him, while at other times he is not fettered by them. The Buddha spoke as he did to show the error in this view.Would not the wanderers of other sects confute you with the simile of the infant? For a young tender infant lying prone does not even have the notion ‘identity,’ so how could identity view arise in him? Yet the underlying tendency to identity view lies within him.[n.651]Anuseti tvev’assa sakkāyadiṭṭ̣hānusayo.On theanusayasor underlying tendencies, seen.47.In the commentaries the defilements are distinguished as occurring at three levels: theanusayalevel, where they remain as mere latent dispositions in the mind; thepariyuṭṭ̣hānalevel, where they rise up to obsess and enslave the mind (referred to in ¶5 of this discourse); and thevītikkamalevel, where they motivate unwholesome bodily and verbal action. The point of the Buddha’s criticism is that the fetters, even when they do not come to active manifestation, continue to exist at theanusayalevel so long as they have not been eradicated by the supramundane path.A young tender infant lying prone does not even have the notion ‘teachings,’[n.652]Dhammā.This could also have been rendered \"things.\"so how could doubt about the teachings arise in him? Yet the underlying tendency to doubt lies within him. A young tender infant lying prone does not even have the notion ‘rules,’ so how could adherence to rules and observances arise in him? Yet the underlying tendency to adhere to rules and observances lies within him. A young tender infant lying prone does not even have the notion ‘sensual pleasures,’ so how could sensual desire arise in him? Yet the underlying tendency to sensual lust lies within him. A young tender infant lying prone does not even have the notion ‘beings,’ so how could ill will towards beings arise in him? Yet the underlying tendency to ill will lies within him. Would not the wanderers of other sects confute you with this simile of the infant?\"",
    "mn64:4": "Thereupon, the venerable Ānanda said: \"It is the time, Blessed One, it is the time, Sublime One, for the Blessed One to teach the five lower fetters. Having heard it from the Blessed One, the bhikkhus will remember it.\"",
    "mn64:5–9": "\"Here, Ānanda, an untaught ordinary person who has no regard for noble ones and is unskilled and undisciplined in their Dhamma, who has no regard for true men and is unskilled and undisciplined in their Dhamma, abides with a mind obsessed and enslaved by identity view, and he does not understand as it actually is the escape from the arisen identity view; and when that identity view has become habitual and is uneradicated in him, it is a lower fetter. He abides with a mind obsessed and enslaved by doubt … by adherence to rules and observances … by sensual lust … by ill will, and he does not understand as it actually is the escape from arisen ill will; and when that ill will has become habitual and is uneradicated in him, it is a lower fetter.",
    "mn64:10–14": "\"A well-taught noble disciple who has regard for noble ones and is skilled and disciplined in their Dhamma, who has regard for true men and is skilled and disciplined in their Dhamma, does not abide with a mind obsessed and enslaved by identity view; he understands as it actually is the escape from the arisen identity view, and identity view together with the underlying tendency to it is abandoned in him.[n.653]MA:The fetter and the underlying tendency are in principle not distinct things; rather, it is the same defilement that is called a fetter in the sense of binding, and an underlying tendency in the sense of being unabandoned.He does not abide with a mind obsessed and enslaved by doubt … by adherence to rules and observances … by sensual lust … by ill will; he understands as it actually is the escape from the arisen ill will, and ill will together with the underlying tendency to it is abandoned in him.",
    "mn64:15": "\"There is a path, Ānanda, a way to the abandoning of the five lower fetters; that anyone, without relying on that path, on that way, shall know or see or abandon the five lower fetters — this is not possible. Just as when there is a great tree standing possessed of heartwood, it is not possible that anyone shall cut out its heartwood without cutting through its bark and sapwood, so too, there is a path … this is not possible.",
    "mn64:16": "\"There is a path, Ānanda, a way to the abandoning of the five lower fetters; that someone, by relying on that path, on that way, shall know and see and abandon the five lower fetters — this is possible. Just as, when there is a great tree standing possessed of heartwood, it is possible that someone shall cut out its heartwood by cutting through its bark and sapwood, so too, there is a path … this is possible.",
    "mn64:17": "\"And what, Ānanda, is the path, the way to the abandoning of the five lower fetters? Here, with seclusion from the acquisitions,[n.654]Upadhivivekā.MAglossesupadhihere as the five cords of sensual pleasure. Though the first three clauses of this statement seem to express the same ideas as the two more usual clauses that follow, MṬ indicates that they are intended to show themeansfor becoming \"quite secluded from sensual pleasures, secluded from unwholesome states.\"with the abandoning of unwholesome states, with the complete tranquillization of bodily inertia, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion.",
    "mn64:18": "\"Again, with the stilling of applied and sustained thought, a bhikkhu enters upon and abides in the second jhāna … Again, with the fading away as well of rapture, a bhikkhu … enters upon and abides in the third jhāna … Again,a with the abandoning of pleasure and pain … a bhikkhu enters upon and abides in the fourth jhāna, which has neither-pain-nor-pleasure and purity of mindfulness due to equanimity.",
    "mn64:19": "\"Again, with the complete surmounting of perceptions of form, with the disappearance of perceptions of sensory impact, with non-attention to perceptions of diversity, aware that ‘space is infinite,’ a bhikkhu enters upon and abides in the base of infinite space.",
    "mn64:20": "\"Again, by completely surmounting the base of infinite space, aware that ‘consciousness is infinite,’ a bhikkhu enters upon and abides in the base of infinite consciousness.",
    "mn64:21": "\"Again, by completely surmounting the base of infinite consciousness, aware that ‘there is nothing,’ a bhikkhu enters upon and abides in the base of nothingness.",
    "mn64:22": "\"Venerable sir, if this is the path, the way to the abandoning of the five lower fetters, then how is it that some bhikkhus hereare said togain deliverance of mind and someare said togain deliverance by wisdom?\"",
    "mn64:23": "That is what the Blessed One said. The venerable Ānanda was satisfied and delighted in the Blessed One's words."
}