{
    "mn65:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park. There he addressed the bhikkhus thus: \"Bhikkhus.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
    "mn65:2": "\"Bhikkhus, I eat at a single session. By so doing, I am free from illness and affliction, and I enjoy lightness, strength, and a comfortable abiding.[n.660] This refers to the Buddha’s practice of eating a single meal in the forenoon only. According to the Pāṭimokkha, the bhikkhus are prohibited from eating from noon until the following dawn, though the single-session practice is only recommended but not required.Come, bhikkhus, eat at a single session. By so doing, you too will be free from illness and affliction, and you will enjoy lightness, strength, and a comfortable abiding.\"",
    "mn65:3": "When this was said, the venerable Bhaddāli told the Blessed One: \"Venerable sir, I am not willing to eat at a single session; for if I were to do so, I might have worry and anxiety about it.\"[n.661]MA:He would be worried and anxious whether he could live the holy life for his entire life.",
    "mn65:4": "Now on that occasion a number of bhikkhus were engaged in making up a robe for the Blessed One, thinking: \"With his robe completed, at the end of the three monthsof the Rains, the Blessed One will set out wandering.\"",
    "mn65:5": "\"Surely, Bhaddāli, a transgression overcame you, in that like a fool, confused and blundering, when a training precept was being made known by me, when the Saṅgha of bhikkhus was undertaking the training, you declared your refusalto comply.",
    "mn65:6": "\"Venerable sir, a transgression overcame me, in that like a fool, confused and blundering, when a training precept was being made known by the Blessed One, when the Saṅgha of bhikkhus was undertaking the training, I declared my refusalto comply. Venerable sir, may the Blessed One forgive my transgression seen as such for the sake of restraint in the future.\"",
    "mn65:7": "\"Surely, Bhaddāli, a transgression overcame you, in that like a fool, confused and blundering, when a training precept was being made known by me, when the Saṅgha of bhikkhus was undertaking the training, you declared your refusal to comply.",
    "mn65:8": "\"What do you think, Bhaddāli? Suppose a bhikkhu here were one liberated-in-both-ways,[n.664] The seven terms used in this section represent a sevenfold classification of noble individuals. They are explicated atMN 70.14–21.and I told him: ‘Come, bhikkhu, be a plank for me across the mud.’ Would he walk across himself,[n.665] Both Ñm and Horner takesaṅkameyyahere to mean that the bhikkhu makes himself a plank, i.e., lies down across the mud. This, however, is contradicted by Bhaddāli's negative answer. Thus it would seem more correct to take this verb to mean that he crosses over himself (as the verb literally does mean), in disregard of the Buddha’s injunction.MApoints out that the Buddha would never give such a command to his disciples, but only says this to emphasise the recalcitrant behaviour of Bhaddāli.or would he dispose his body otherwise, or would he say ‘No’?\"",
    "mn65:9": "\"No, venerable sir.\"",
    "mn65:10": "\"What do you think, Bhaddāli? Suppose a bhikkhu here were one liberated-by-wisdom … a body-witness … one attained-toview … one liberated-by-faith … a Dhamma-follower … a faith-follower, and I told him: ‘Come, bhikkhu, be a plank for me across the mud.’ Would he walk across himself, or would he dispose his body otherwise, or would he say ‘No’?\"",
    "mn65:11": "\"No, venerable sir.\"",
    "mn65:12": "\"What do you think, Bhaddāli? Were you on that occasion one liberated-in-both-ways or one liberated-by-wisdom or a body-witness or one attained-to-view or one liberated-by-faith or a Dhamma-follower or a faith-follower?\"",
    "mn65:13": "\"No, venerable sir.\"",
    "mn65:14": "\"Bhaddāli, on that occasion were you not empty, hollow, and mistaken?\"",
    "mn65:15": "\"Yes, venerable sir. Venerable sir, a transgression overcame me, in that like a fool, confused and blundering, when a training precept was being made known by the Blessed One, when the Saṅgha of bhikkhus was undertaking the training, I declared my refusal to comply. Venerable sir, may the Blessed One forgive my transgression seen as such for the sake of restraint in the future.\"",
    "mn65:16": "\"Surely, Bhaddāli, a transgression overcame you, in that like a fool, confused and blundering, when a training precept was being made known by me, when the Saṅgha of bhikkhus was undertaking the training, you declared your refusal to comply. But since you see your transgression as such and make amends in accordance with the Dhamma, we forgive you; for it is growth in the Noble One's Discipline when one sees one's transgression as such and makes amends in accordance with the Dhamma by undertaking restraint for the future.",
    "mn65:17": "\"Here, Bhaddāli, some bhikkhu does not fulfil the training in the Teacher's Dispensation. He considers thus: ‘Suppose I were to resort to a secluded resting place: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw — perhaps I might realise a superhuman state, a distinction in knowledge and vision worthy of the noble ones.’ He resorts to some such secluded resting place. While he lives thus withdrawn, the Teacher censures him, wise companions in the holy life who have made investigation censure him, gods censure him, and he censures himself. Being censured in this way by the Teacher, by wise companions in the holy life, by gods, and by himself, he realises no superhuman state, no distinction in knowledge and vision worthy of the noble ones. Why is that? That is how it is with one who does not fulfil the training in the Teacher's Dispensation.",
    "mn65:18": "\"Here, Bhaddāli, some bhikkhu does fulfil the training in the Teacher's Dispensation. He considers thus: ‘Suppose I were to resort to a secluded resting place: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw — perhaps I might realise a superhuman state, a distinction in knowledge and vision worthy of the noble ones.’ He resorts to some such secluded resting place. While he lives thus withdrawn, the Teacher does not censure him, wise companions in the holy life who have made investigation do not censure him, gods do not censure him, and he does not censure himself. Being uncensured in this way by the Teacher, by wise companions in the holy life, by gods, and by himself, he realises a superhuman state, a distinction in knowledge and vision worthy of the noble ones.",
    "mn65:19–21": "\"With the stilling of applied and sustained thought, he enters upon and abides in the second jhāna … With the fading away as well of rapture … he enters upon and abides in the third jhāna … With the abandoning of pleasure and pain … he enters upon and abides in the fourth jhāna … Why is that? That is how it is with one who fulfils the training in the Teacher's Dispensation.",
    "mn65:22": "\"When his concentrated mind is thus purified and bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the recollection of past lives. He recollects his manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion: ‘There I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared elsewhere; and there too I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared here.’ Thus with their aspects and particulars he recollects his manifold past lives. Why is that? That is how it is with one who fulfils the training in the Teacher's Dispensation.",
    "mn65:23": "\"When his concentrated mind is thus purified and bright … attained to imperturbability, he directs it to knowledge of the passing away and reappearance of beings. With the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate. He understands how beings pass on according to their actions thus: ‘These worthy beings who were ill conducted in body, speech, and mind, revilers of noble ones, wrong in their views, giving effect to wrong view in their actions, on the dissolution of the body, after death, have reappeared in a state of deprivation, in a bad destination, in perdition, even in hell; but these worthy beings who were well conducted in body, speech, and mind, not revilers of noble ones, right in their views, giving effect to right view in their actions, on the dissolution of the body, after death, have reappeared in a good destination, even in the heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and he understands how beings pass on according to their actions. Why is that? That is how it is with one who fulfils the training in the Teacher's Dispensation.",
    "mn65:24": "\"When his concentrated mind is thus purified and bright … attained to imperturbability, he directs it to knowledge of the destruction of the taints. He understands as it actually is: ‘This is suffering’; he understands as it actually is: ‘This is the origin of suffering’; he understands as it actually is: ‘This is the cessation of suffering’; he understands as it actually is: ‘This is the way leading to the cessation of suffering.’ He understands as it actually is: ‘These are the taints’; he understands as it actually is: ‘This is the origin of the taints’; he understands as it actually is: ‘This is the cessation of the taints’; He understands as it actually is: ‘This is the way leading to the cessation of the taints.’",
    "mn65:25": "Thereupon the venerable Bhaddāli asked: \"Venerable sir, what is the cause, what is the reason, why they take action against some bhikkhu here by repeatedly admonishing him? What is the cause, what is the reason, why they do not take such action against some bhikkhu here by repeatedly admonishing him?\"",
    "mn65:26": "\"Here, Bhaddāli, some bhikkhu is a constant offender with many offences. When he is corrected by the bhikkhus, he prevaricates, leads the talk aside, shows disturbance, hate, and bitterness; he does not proceed rightly, he does not comply, he does not clear himself, he does not say: ‘Let me so act that the Saṅgha will be satisfied.’ Bhikkhus, taking account of this matter, think: ‘It would be good if the venerable ones examine this bhikkhu in such a way that this litigation against him is not settled too quickly.’ And the bhikkhus examine that bhikkhu in such a way that the litigation against him is not settled too quickly.",
    "mn65:27": "\"But here some bhikkhu is a constant offender with many offences. When he is corrected by the bhikkhus, he does not prevaricate, lead the talk aside, or show disturbance, hate, and bitterness; he proceeds rightly, he complies, he clears himself, he says: ‘Let me so act that the Saṅgha will be satisfied.’ Bhikkhus, taking account of this matter, think: ‘It would be good if the venerable ones examine this bhikkhu in such a way that this litigation against him is settled quickly.’ And the bhikkhus examine that bhikkhu in such a way that the litigation against him is settled quickly.",
    "mn65:28": "\"Here some bhikkhu is a chance offender without many offences. When he is corrected by the bhikkhus, he prevaricates,leads the talk aside, shows disturbance, hate, and bitterness; he does not proceed rightly, he does not comply, he does not clear himself, he does not say: ‘Let me so act that the Saṅgha will be satisfied.’ Bhikkhus, taking account of this matter, think: ‘It would be good if the venerable ones examine this bhikkhu in such a way that this litigation against him is not settled too quickly.’ And the bhikkhus examine that bhikkhu in such a way that the litigation against him is not settled too quickly.",
    "mn65:29": "\"But here some bhikkhu is a chance offender without many offences. When he is corrected by the bhikkhus, he does not prevaricate, lead the talk aside, or show disturbance, hate, and bitterness; he proceeds rightly, he complies, he clears himself, he says: ‘Let me so act that the Saṅgha will be satisfied.’ Bhikkhus, taking account of this matter, think: ‘It would be good if the venerable ones examine this bhikkhu in such a way that this litigation against him is settled quickly.’ And the bhikkhus examine that bhikkhu in such a way that the litigation against him is settled quickly.",
    "mn65:30": "\"Here some bhikkhu progresses by a measure of faith and love.[n.666]MA: He maintains himself by a measure of worldly faith and worldly love towards his preceptor and teacher. Because the other bhikkhus help him, he remains in the homeless life and may eventually become a great monk who has attained to the direct knowledges.In this case bhikkhus consider thus: ‘Friends, this bhikkhu progresses by a measure of faith and love. Let him not lose that measure of faith and love, as he may if we take action against him by repeatedly admonishing him.’ Suppose a man had only one eye; then his friends and companions, his kinsmen and relatives, would guard his eye, thinking: ‘Let him not lose his one eye.’ So too, some bhikkhu progresses by a measure of faith and love … ‘Let him not lose that measure of faith and love, as he may if we take action against him by repeatedly admonishing him.’",
    "mn65:31": "\"Venerable sir, what is the cause, what is the reason, why there were previously fewer training rules and more bhikkhus became established in final knowledge? What is the cause, what is the reason, why there are now more training rules and fewer bhikkhus become established in final knowledge?\"",
    "mn65:32": "\"That is how it is, Bhaddāli. When beings are deteriorating and the true Dhamma is disappearing, then there are more training rules and fewer bhikkhus become established in final knowledge. The Teacher does not make known the training rule for disciples until certain things that are the basis for taints become manifest here in the Saṅgha;[n.667] This passage refers to the fixed principle that the Buddha does not lay down a training rule until a case arises that requires the promulgation of an appropriate training rule. See VinPār 1/iii.9–10.but when certain things that are the basis for taints become manifest here in the Saṅgha, then the Teacher makes known the training rule for disciples in order to ward off those things that are the basis for taints.",
    "mn65:33": "\"There were few of you, Bhaddāli, when I taught an exposition of the Dhamma through the simile of the young thoroughbred colt. Do you remember that, Bhaddāli?\"",
    "mn65:34": "\"No, venerable sir.\"",
    "mn65:35": "\"To what reason do you attribute that?\"",
    "mn65:36": "\"Venerable sir, I have long been one who did not fulfil the training in the Teacher's Dispensation.\"",
    "mn65:37": "\"That is not the only cause or the only reason. But rather, by encompassing your mind with my mind, I have long known you thus: ‘When I am teaching the Dhamma, this misguided man does not heed it, does not give it attention, does not engage it with all his mind, does not hear the Dhamma with eager ears.’ Still, Bhaddāli, I will teach you an exposition of the Dhamma through the simile of the young thoroughbred colt. Listen and attend closely to what I shall say.\"",
    "mn65:38": "\"Bhaddāli, suppose a clever horse-trainer obtains a fine thoroughbred colt. He first makes him get used to wearing the bit. While the colt is being made to get used to wearing the bit, because he is doing something that he has never done before, he displays some contortion, writhing, and vacillation, but through constant repetition and gradual practice, he becomes peaceful in that action.[n.668]Tasmiṁ ṭhāne parinibbāyati.The verb used here is the verbal form of parinibbāna, and could be literally, though erroneously, translated, \"He attains final Nibbāna in that action.\"",
    "mn65:39": "\"So too, Bhaddāli, when a bhikkhu possesses ten qualities, he is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world. What are the ten? Here, Bhaddāli, a bhikkhu possesses the right view of one beyond training,[n.669] \"One beyond training\"(asekha)is an arahant.MAexplains these ten factors as constituents of the fruit of arahantship.the right intention of one beyond training, the right speech of one beyond training, the right action of one beyond training, the right livelihood of one beyond training, the right effort of one beyond training, the right mindfulness of one beyond training, the right concentration of one beyond training, the right knowledge of one beyond training, and the right deliverance of one beyond training.[n.670] Right knowledge(sammā ñāṇa)is the knowledge pertaining to the fruit of arahantship, right deliverance(sammā vimutti)the arahant's liberation from all defilements.When a bhikkhu possesses these ten qualities, he is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.\"",
    "mn65:40": "That is what the Blessed One said. The venerable Bhaddāli was satisfied and delighted in the Blessed One's words."
}