{
    "mn66:1": "Thus have I heard. On one occasion the Blessed One was living in the country of the Anguttarāpans where there was a town of theirs named Āpaṇa.",
    "mn66:2": "\"Here, venerable sir, while I was alone in meditation, the following thought arose in my mind: ‘How many painful states has the Blessed One rid us of! … How many wholesome states has the Blessed One brought us!’ Venerable sir, formerly we used to eat in the evening, in the morning, and during the day outside the proper time. Then there was an occasion when the Blessed One addressed the bhikkhus thus: ‘Bhikkhus, please abandon that daytime meal, which is outside the proper time.’[n.671] From this passage and that to follow, it appears that the Buddha restricted the allowable time for bhikkhus’ meals in two successive stages, first prohibiting only the afternoon meal and allowing a night meal. However, in the Vinaya account of the origin ofPācittiya 37no mention is made of this successive prohibition. To the contrary, the text seems to assume it to be an item of common knowledge that monks should not consume food past noon, and it shows the Buddha laying down the rule against untimely eating with one categorical pronouncement valid for all meals past noon.Venerable sir, I was upset and sad, thinking: ‘Faithful householders give us good food of various kinds during the day outside the proper time, yet the Blessed One tells us to abandon it, the Sublime One tells us to relinquish it.’ Out of our love and respect for the Blessed One, and out of shame and fear of wrongdoing, we abandoned that daytime meal, which was outside the proper time.",
    "mn66:3": "\"So too, Udāyin, there are certain misguided men here who, when told by me ‘Abandon this,’ say: ‘What, such a mere trifle, such a little thing as this? This recluse is much too exacting!’ And they do not abandon that and they show discourtesy towards me as well as towards those bhikkhus desirous of training. For them that thing becomes a strong, stout, tough, unrotting tether and a thick yoke.",
    "mn66:4": "\"No, venerable sir. For that quail the rotting creeper by which she is tethered and thereby expects injury, captivity, or death, is a strong, stout, tough, unrotting tether and a thick yoke.\"",
    "mn66:5": "\"So too, Udāyin there are certain misguided men here who, when told by me ‘Abandon this’ … do not abandon that and they show discourtesy towards me as well as towards those bhikkhus desirous of training. For them that thing becomes a strong, stout, tough, unrotting tether and a thick yoke.",
    "mn66:6": "\"Udāyin, there are certain clansmen here who, when told by me ‘Abandon this,’ say: ‘What, such a mere trifle, such a little thing to be abandoned as this, the Blessed One tells us to abandon, the Sublime One tells us to relinquish.’ Yet they abandon that and do not show discourtesy towards me or towards those bhikkhus desirous of training. Having abandoned it, they live at ease, unruffled, subsisting on others’ gifts, with mindas aloofas a wild deer's. For them that thing becomes a feeble, weak, rotting, coreless tether.",
    "mn66:7": "\"No, venerable sir. The stout leather thongs by which that royal tusker elephant is tethered, which by simply twisting his body a little he could break and burst and then go where he likes, are for him a feeble, weak, rotting, coreless tether.\"",
    "mn66:8": "\"So too, Udāyin, there are certain clansmen here who, when told by me ‘Abandon this’ … abandon that and do not show discourtesy towards me or towards those bhikkhus desirous of training. Having abandoned it, they live at ease, unruffled, subsisting on others’ gifts, with mindas aloofas a wild deer's. For them that thing becomes a feeble, weak, rotting, coreless tether.",
    "mn66:9": "\"Suppose, Udāyin, there were a poor, penniless, destitute man, and he had one dilapidated hovel open to the crows, not the best kind, and one dilapidated wicker bedstead, not the best kind, and some grain and pumpkin seeds in a pot, not the best kind, and one hag of a wife, not the best kind. He might see a bhikkhu in a monastery park sitting in the shade of a tree, his hands and feet well washed after he had eaten a delicious meal, devoting himself to the higher mind. He might think: ‘How pleasant the recluse's state is! How healthy the recluse's state is! If only I could shave off my hair and beard, put on the yellow robe, and go forth from the home life into homelessness!’ But being unable to abandon his one dilapidated hovel open to the crows, not the best kind, and his one dilapidated wicker bedstead, not the best kind, and his grain and pumpkin seeds in a pot, not the best kind, and his hag of a wife, not the best kind, he is unable to shave off his hair and beard, put on the yellow robe, and go forth from the home life into homelessness. Now suppose someone said: ‘The tethers by which that man is tethered so that he cannot abandon his one dilapidated hovel … and his hag of a wife, not the best kind, and shave off his hair and beard, put on the yellow robe, and go forth from the home life into homelessness — for him those are a feeble, weak, rotting, coreless tether.’ Would he be speaking rightly?\"",
    "mn66:10": "\"No, venerable sir. The tethers by which that man is tethered so that he cannot abandon his one dilapidated hovel … and his hag of a wife, not the best kind, and shave off his hair and beard, put on the yellow robe, and go forth from the home life into homelessness — for him those are a strong, stout, tough, unrotting tether and a thick yoke.\"",
    "mn66:11": "\"So too, Udāyin, there are certain misguided men here who, when told by me ‘Abandon this’ … do not abandon that and they show discourtesy towards me as well as towards those bhikkhus desirous of training. For them that thing becomes a strong, stout, tough, unrotting tether and a thick yoke.",
    "mn66:12": "\"Suppose, Udāyin, there were a rich householder or a householder's son, with great wealth and property, with a vast number of gold ingots, a vast number of granaries, a vast number of fields, a vast amount of land, a vast number of wives, and a vast number of men and women slaves. He might see a bhikkhu in a monastery park sitting in the shade of a tree, his hands and feet well washed after he had eaten a delicious meal, devoting himself to the higher mind. He might think: ‘How pleasant the recluse's state is! How healthy the recluse's state is! If only I could shave off my hair and beard, put on the yellow robe, and go forth from the home life into homelessness!’ And being able to abandon his vast number of gold ingots, his vast number of granaries, his vast number of fields, his vast amount of land, his vast number of wives, and his vast number of men and women slaves, he is able to shave off his hair and beard, put on the yellow robe, and go forth from the home life into homelessness. Now suppose someone said: ‘The tethers by which that householder or householder's son is tethered so that he can abandon his vast number of gold ingots … his vast number of men and women slaves, and shave off his hair and beard, put on the yellow robe, and go forth from the home life into homelessness — for him those are a strong, stout, tough, unrotting tether and a thick yoke.’ Would he be speaking rightly?\"",
    "mn66:13": "\"No, venerable sir. The tethers by which that householder or householder's son is tethered so that he can abandon his vast number of gold ingots … his vast number of men and women slaves, and shave off his hair and beard, put on the yellow robe, and go forth from the home life into homelessness — for him those are a feeble, weak, rotting, coreless tether.\"",
    "mn66:14": "\"Udāyin, there are four kinds of persons to be found existing in the world. What are the four?[n.673]MA: The Buddha undertakes this teaching in order to analyse the person who abandons what he is told to abandon(¶ 6)into four distinct types of individuals.",
    "mn66:15": "\"Here, Udāyin, some person practises the way to the abandoning of the acquisitions, to the relinquishing of the acquisitions. When he is practising the way, memories and intentions associated with the acquisitions beset him. He does not tolerate them; he abandons them, removes them, does away with them, and annihilates them. Such a person too I call fettered, not unfettered. Why is that? Because I have known the particular diversity of faculties in this person.[n.675]MA: The ordinary man, the stream-enterer, the once-returner, and the non-returner can all be included under the first category (verse 14), the non-returner because the craving for being still exists in him and thus at times he can delight in thoughts of worldly enjoyment. The same four can be included in the second category (verse ), the ordinary man because he may suppress arisen defilements, arouse energy, develop insight, and eradicate defilements by attaining the supramundane path.",
    "mn66:16": "\"Here, Udāyin, some person practises the way to the abandoning of the acquisitions, to the relinquishing of the acquisitions. When he is practising the way, memories and intentions associated with the acquisitions beset him now and then through lapses of mindfulness. His mindfulness may be slow in arising, but he quickly abandons them, removes them, does away with them, and annihilates them.[n.676] This type is distinguished from the previous type only by his sluggishness in arousing mindfulness to abandon arisen defilements.Just as if a man were to let two or three drops of water fall onto an iron plate heated for a whole day, the falling of the water drops might be slow but they would quickly vaporise and vanish.",
    "mn66:17": "So too, here some person practises the way … His mindfulness may be slow in arising, but he quickly abandons them, removes them, does away with them, and annihilates them. Such a person too I call fettered, not unfettered. Why is that? Because I have known the particular diversity of faculties in this person.",
    "mn66:18": "\"Here, Udāyin, some person, having understood that acquisition is the root of suffering, divests himself of the acquisitions and is liberated in the destruction of the acquisitions. Such a person I call unfettered, not fettered.[n.677] This is the arahant, who alone has eradicated all the fetters.Why is that? Because I have known the particular diversity of faculties in this person.",
    "mn66:19": "\"There are, Udāyin, five cords of sensual pleasure. What are the five? Forms cognizable by the eye that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. Sounds cognizable by the ear … Odours cognizable by the nose … Flavours cognizable by the tongue … Tangibles cognizable by the body that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. These are the five cords of sensual pleasure.",
    "mn66:20": "\"Here, Udāyin, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters upon and abides in the first jhāna … With the stilling of applied and sustained thought, he enters upon and abides in the second jhāna … With the fading away as well of rapture … he enters upon and abides in the third jhāna … With the abandoning of pleasure and pain … he enters upon and abides in the fourth jhāna …",
    "mn66:21": "\"Here, Udāyin, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters upon and abides in the first jhāna … Now this, I say, belongs to the perturbable.[n.679] All states of mind below the fourth jhāna are classified as \"the perturbable\"(iñjita). The fourth jhāna and all higher states are called \"the imperturbable\"(aniñjita). This is a technical term for the meditative attainments from the fourth jhāna through the four immaterial attainments. But since the highest two immaterial attainments are dealt with separately, it seems that in this sutta only the fourth jhāna and the lower two immaterial attainments are intended as \"the imperturbable.\"And what therein belongs to the perturbable? The applied thought and sustained thought that have not ceased therein, that is what belongs to the perturbable.",
    "mn66:22": "\"Here, Udāyin, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters upon and abides in the first jhāna … That, I say, is not enough.[n.680]MA: It is not fitting to become attached to it with craving, and one should not come to a standstill at this point.Abandon it, I say; surmount it, I say. And what surmounts it?",
    "mn66:23": "That is what the Blessed One said. The venerable Udāyin was satisfied and delighted in the Blessed One's words."
}