{
    "mn67:1": "Thus have I heard. On one occasion the Blessed One was living at Cātumā in a myrobalan grove.",
    "mn67:2": "Now on that occasion the Sakyans of Cātumā had met together in their assembly hall for some business or other. Seeing the bhikkhus coming in the distance, they went to them and asked: \"Where are you going, venerable sirs?\"",
    "mn67:3": "Then the Brahmā Sahampati[n.68] It was the Brahmā Sahampati who entreated the newly enlightened Buddha to teach the Dhamma to the world. SeeMN 26.7.knew with his mind the thought in the Blessed One's mind, so just as quickly as a strong man might extend his flexed arm or flex his extended arm, he vanished in the Brahma-world and appeared before the Blessed One. Then he arranged his upper robe on one shoulder, and extending his hands in reverential salutation towards the Blessed One, he said:",
    "mn67:4": "The Sakyans of Cātumā and the Brahmā Sahampati were able to restore the Blessed One's confidence with the similes of the seedlings and the young calf.",
    "mn67:5": "Then the Blessed One addressed the bhikkhus thus:",
    "mn67:6": "\"What, bhikkhus, is fear of waves? Here some clansman goes forth out of faith from the home life into homelessness, considering: ‘I am a victim of birth, ageing, and death, of sorrow, lamentation, pain, grief, and despair; I am a victim of suffering, a prey to suffering. Surely an ending of this whole mass of suffering can be known.’ Then, after he has gone forth thus, his companions in the holy life advise and instruct him thus: ‘You should move to and fro thus; you should look ahead and look away thus; you should flex and extend the limbs thus; you should wear the patched cloak, bowl, and robes thus.’ Then he thinks: ‘Formerly, when we were in the home life, we advised and instructed others, and now thesebhikkhus, who seem like they might be our sons or our grandsons, think that they can advise and instruct us.’ And so he forsakes the training and reverts to the low life. He is called one who has forsaken the training and reverted to the low life because he was frightened by the fear of waves. Now ‘fear of waves’ is a designation for anger and irritation.",
    "mn67:7": "\"What, bhikkhus, is fear of crocodiles? Here some clansman goes forth out of faith from the home life into homelessness, considering: ‘I am a victim of birth, ageing, and death, of sorrow, lamentation, pain, grief, and despair; I am a victim of suffering, a prey to suffering. Surely an ending of this whole mass of suffering can be known.’ Then, after he has gone forth thus, his companions in the holy life advise and instruct him thus: ‘This can be consumed by you, this cannot be consumed by you; this can be eaten by you, this cannot be eaten by you; this can be tasted by you, this cannot be tasted by you; this can be drunk by you, this cannot be drunk by you.[n.686] Pali uses two distinct words signifying different types of food:khādaniya,\"food to be consumed,\" includes all varieties of vegetables, nuts, fruits, yams, etc.;bhojanīya,\"food to be eaten,\" includes food made of grain, meat, and fish. Things to be tasted(ssāyitabba)would include light refreshments.You can consume what is allowable, you cannot consume what is not allowable; you can eat what is allowable, you cannot eat what is not allowable; you can taste what is allowable, you cannot taste what is not allowable; you can drink what is allowable, you cannot drink what is not allowable. You can consume food within the proper time, you cannot consume food outside the proper time; you can eat within the proper time, you cannot eat outside the proper time; you can taste food within the proper time, you cannot taste food outside the proper time; you can drink within the proper time, you cannot drink outside the proper time.’[n.68] The proper time is from dawn to noon, beyond which only liquids may be drunk.",
    "mn67:8": "\"What, bhikkhus, is fear of whirlpools? Here some clansman goes forth out of faith from the home life into homelessness, considering: ‘I am a victim of birth, ageing, and death, of sorrow, lamentation, pain, grief, and despair; I am a victim of suffering, a prey to suffering. Surely an ending of this whole mass of suffering can be known.’ Then, after he has gone forth thus, when it is morning he dresses, and taking his bowl and outer robe, he goes into a village or town for alms with his body unguarded, with his speech unguarded, with mindfulness unestablished, and with sense faculties unrestrained. He sees some householder there or householder's son furnished and endowed with the five cords of sensual pleasure enjoying himself with them. He considers thus: ‘Formerly, when we were in the home life, we were furnished and endowed with the five cords of sensual pleasure and we enjoyed ourselves with them. My family has wealth; I can both enjoy wealth and make merit.’ And so he forsakes the training and reverts to the low life. He is called one who has forsaken the training and reverted to the low life because he was frightened by the fear of whirlpools. Now ‘fear of whirlpools’ is a designation for the five cords of sensual pleasure.",
    "mn67:9": "\"What, bhikkhus, is fear of sharks? Here some clansman goes forth out of faith from the home life into homelessness, considering: ‘I am a victim of birth, ageing, and death, of sorrow, lamentation, pain, grief, and despair; I am a victim of suffering, a prey to suffering. Surely an ending of this whole mass of suffering can be known.’ Then, after he has gone forth thus, when it is morning he dresses, and taking his bowl and outer robe, he goes into a village or town for alms with his body unguarded, with his speech unguarded, with mindfulness unestablished, and with sense faculties unrestrained. He sees a woman there lightly clothed, lightly dressed. When he sees such a woman, lust infects his mind. Because his mind has been infected by lust, he forsakes the training and reverts to the low life. He is called one who has forsaken the training and reverted to the low life because he was frightened by the fear of sharks. Now ‘fear of sharks’ is a designation for women.",
    "mn67:10": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}