{
    "mn68:1": "Thus have I heard. On one occasion the Blessed One was living in the Kosalan country at Naḷakapāna in the Palāsa Grove.",
    "mn68:2–3": "A second and a third time, referring to those clansmen, he addressed the bhikkhus thus: \"Bhikkhus, those clansmen who have gone forth out of faith from the home life into homelessness under me — do they delight in the holy life?\"",
    "mn68:4": "Then the Blessed One considered thus: \"Suppose I question those clansmen?\"",
    "mn68:5": "\"Yes, venerable sir.\"",
    "mn68:6": "\"What should be done, Anuruddha, by a clansman who has gone forth thus? While he still does not attain to the rapture and pleasure that are secluded from sensual pleasures and secluded from unwholesome states, or to something more peaceful than that,[n.88] The \"rapture and pleasure secluded from sensual pleasures\" signifies the first and second jhānas, \"something more peaceful than that\" the higher jhānas and the four paths.covetousness invades his mind and remains, ill will invades his mind and remains, sloth and torpor invade his mind and remain, restlessness and remorse invade his mind and remain, doubt invades his mind and remains, discontent invades his mind and remains, weariness invades his mind and remains. That is so while he still does not attain to the rapture and pleasure that are secluded from sensual pleasures and secluded from unwholesome states, or to something more peaceful than that.",
    "mn68:7": "When he attains to the rapture and pleasure that are secluded from sensual pleasures and secluded from unwholesome states, or to something more peaceful than that, covetousness does not invade his mind and remain, ill will … sloth and torpor … restlessness and remorse … doubt … discontent … weariness does not invade his mind and remain. That is so when he attains to the rapture and pleasure that are secluded from sensual pleasures and secluded from unwholesome states, or to something more peaceful than that.",
    "mn68:8": "\"How then, Anuruddha, do you all think of me in this way: ‘The Tathāgata has not abandoned the taints that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death. That is why the Tathāgata uses one thing after reflecting, endures another thing after reflecting, avoids another thing after reflecting, and removes another thing after reflecting’?\"[n.69] SeeMN2. These are practices undertaken by one in training to prevent the arising of latent taints that have not yet been abandoned.",
    "mn68:9": "\"No, venerable sir, we do not think of the Blessed One in that way. We think of the Blessed One in this way: ‘The Tathāgata has abandoned the taints that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death. That is why the Tathāgata uses one thing after reflecting, endures another thing after reflecting, avoids another thing after reflecting, and removes another thing after reflecting.\"",
    "mn68:10": "\"Good, good, Anuruddha! The Tathāgata has abandoned the taints that defile, bring renewal of being, give trouble, ripen in suffering, and lead to future birth, ageing, and death; he has cut them off at the root, made them like a palm stump, done away with them so that they are no longer subject to future arising. Just as a palm tree whose crown is cut off is incapable of further growth, so too, the Tathāgata has abandoned the taints that defile … cut them off at the root, made them like a palm stump, done away with them so that they are no longer subject to future arising.",
    "mn68:11": "\"What do you think, Anuruddha? What purpose does the Tathāgata see that when a disciple has died, he declares his reappearance thus: ‘So-and-so has reappeared in such-and-such a place; so-and-so has reappeared in such-and-such a place ’?\"[n.690] This refers to the Buddha’s ability to discover by clairvoyance the states in which his disciples have taken rebirth.",
    "mn68:12": "\"Venerable sir, our teachings are rooted in the Blessed One, guided by the Blessed One, have the Blessed One as their resort. It would be good if the Blessed One would explain the meaning of these words. Having heard it from the Blessed One, the bhikkhus will remember it.\"",
    "mn68:13": "\"Anuruddha, it is not for the purpose of scheming to deceive people or for the purpose of flattering people or for the purpose of gain, honour, or renown, or with the thought, ‘Let people know me to be thus,’ that when a disciple has died, the Tathāgata declares his reappearance thus: ‘So-and-so has reappeared in such-and-such a place; so-and-so has reappeared in such-and-such a place.’ Rather, it is because there are faithful clansmen inspired and gladdened by what is lofty, who when they hear that, direct their minds to such a state, and that leads to their welfare and happiness for a long time.",
    "mn68:14": "\"Here a bhikkhu hears thus: ‘The bhikkhu named so-and-so has died; the Blessed One has declared of him: \"He was established in final knowledge.\"’[n.691]Aññā:the knowledge attained by the arahant. It should be noted that whereas the declarations of attainment made by monks and nuns begin with arahantship, those for men and women lay followers begin with non-returning (in ¶28). Though early Buddhism recognises the possibility of lay persons attaining arahantship, in all such cases attested to in the Nikāyas, they do so either when on the verge of death or just before requesting admission into the Saṅgha.And he has either seen that venerable one for himself or heard it said of him: ‘That venerable one's virtue was thus, his stateof concentrationwas thus, his wisdom was thus, his abidingin attainmentswas thus, his deliverance was thus.’ Recollecting his faith, virtue, learning, generosity, and wisdom, he directs his mind to such a state. In this way a bhikkhu has a comfortable abiding.",
    "mn68:15": "\"Here a bhikkhu hears thus: ‘The bhikkhu named so-and-so has died; the Blessed One has declared of him: \"With the destruction of the five lower fetters he has reappeared spontaneouslyin the Pure Abodesand there will attain final Nibbāna without ever returning from that world.\"’ And he has either seen that venerable one for himself … he directs his mind to such a state. In this way too a bhikkhu has a comfortable abiding.",
    "mn68:16": "\"Here a bhikkhu hears thus: ‘The bhikkhu named so-and-so has died; the Blessed One has declared of him: \"With the destruction of three fetters and with the attenuation of lust, hate, and delusion, he has become a once-returner, returning once to this world to make an end of suffering.\"’ And he has either seen that venerable one for himself … he directs his mind to such a state. In this way too a bhikkhu has a comfortable abiding.",
    "mn68:17": "\"Here a bhikkhu hears thus: ‘The bhikkhu named so-and-so has died; the Blessed One has declared of him: \"With the destruction of three fetters he has become a stream-enterer, no longer subject to perdition, boundfor deliverance, headed for enlightenment.\"’ And he has either seen that venerable one for himself … he directs his mind to such a state. In this way too a bhikkhu has a comfortable abiding.",
    "mn68:18": "\"Here a bhikkhunī hears thus: ‘The bhikkhunī named so-and-so has died; the Blessed One has declared of her: \"She was established in final knowledge.\"’ And she has either seen that sister for herself or heard it said of her: ‘That sister's virtue was thus, her stateof concentrationwas thus, her wisdom was thus, her abidingin attainmentswas thus, her deliverance was thus.’ Recollecting her faith, virtue, learning, generosity, and wisdom, she directs her mind to such a state. In this way a bhikkhunī has a comfortable abiding.",
    "mn68:19": "\"Here a bhikkhunī hears thus: ‘The bhikkhunī named so-and-so has died; the Blessed One has declared of her: \"With the destruction of the five lower fetters she has reappeared spontaneouslyin the Pure Abodesand will there attain final Nibbāna without ever returning from that world.\" …",
    "mn68:20": "\"‘He has declared of her: \"With the destruction of three fetters and with the attenuation of lust, hate, and delusion, she has become a once-returner, returning once to this world to make an end of suffering.\" …",
    "mn68:21": "\"‘He has declared of her: \"With the destruction of three fetters she has become a stream-enterer, no longer subject to perdition, boundfor deliverance, headed for enlightenment.\"’ And she has either seen that sister for herself … she directs her mind to such a state. In this way too a bhikkhunī has a comfortable abiding.",
    "mn68:22": "\"Here a man lay follower hears thus: ‘The man lay follower named so-and-so has died; the Blessed One has declared of him: \"With the destruction of the five lower fetters he has reappeared spontaneouslyin the Pure Abodesand will there attain final Nibbāna without ever returning from that world.\" …",
    "mn68:23": "\"‘He has declared of him: \"With the destruction of three fetters and with the attenuation of lust, hate, and delusion, he has become a once-returner, returning once to this world to make an end of suffering.\" …",
    "mn68:24": "\"‘He has declared of him: \"With the destruction of three fetters he has become a stream-enterer, no longer subject to perdition, boundfor deliverance, headed for enlightenment.\"’ And he has either seen that venerable one for himself or heard it said of him: ‘That venerable one's virtue was thus, his stateof concentrationwas thus, his wisdom was thus, his abidingin attainmentswas thus, his deliverance was thus.’ Recollecting his faith, virtue, learning, generosity, and wisdom, he directs his mind to such a state. In this way too a man lay follower has a comfortable abiding.",
    "mn68:25": "\"Here a woman lay follower hears thus: ‘The woman lay follower named so-and-so has died; the Blessed One has declared of her: \"With the destruction of the five lower fetters she has reappeared spontaneouslyin the Pure Abodesand will there attain final Nibbāna without ever returning from that world.\" …",
    "mn68:26": "\"‘He has declared of her: \"With the destruction of three fetters and with the attenuation of lust, hate, and delusion, she has become a once-returner, returning once to this world to make an end of suffering.\" …",
    "mn68:27": "\"‘He has declared of her: \"With the destruction of three fetters she has become a stream-enterer, no longer subject to perdition, boundfor deliverance, headed for enlightenment.\"’ And she has either seen that sister for herself or heard it said of her: ‘That sister's virtue was thus, her stateof concentrationwas thus, her wisdom was thus, her abidingin attainmentswas thus, her deliverance was thus.’ Recollecting her faith, virtue, learning, generosity, and wisdom, she directs her mind to such a state. In this way too a woman lay follower has a comfortable abiding.",
    "mn68:28": "\"So, Anuruddha, it is not for the purpose of scheming to deceive people or for the purpose of flattering people or for the purpose of gain, honour, and renown, or with the thought, ‘Let people know me to be thus,’ that when a disciple has died, the Tathāgata declares his reappearance thus: ‘So-and-so has reappeared in such-and-such a place; so-and-so has reappeared in such-and-such a place.’ Rather, it is because there are faithful clansmen inspired and gladdened by what is lofty, who when they hear that, direct their minds to such a state, and that leads to their welfare and happiness for a long time.\"",
    "mn68:29": "That is what the Blessed One said. The venerable Anuruddha was satisfied and delighted in the Blessed One's words."
}