{
    "mn69:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Bamboo Grove, the Squirrels’ Sanctuary.",
    "mn69:2": "\"Friends, when a forest-dwelling bhikkhu comes to the Saṅgha and is living in the Saṅgha, he should be respectful and deferential towards his companions in the holy life. If he is disrespectful and undeferential towards his companions in the holy life, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he is disrespectful and undeferential towards his companions in the holy life?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu who has come to the Saṅgha and is living in the Saṅgha should be respectful and deferential towards his companions in the holy life.",
    "mn69:3–4": "\"When a forest-dwelling bhikkhu comes to the Saṅgha and is living in the Saṅgha, he should be skilled in good behaviour regarding seats thus: ‘I shall sit down in such a way that I do not encroach upon elder bhikkhus and do not deny new bhikkhus a seat.’ If he is not skilled in good behaviour regarding seats, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he does not even know what pertains to good behaviour?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu who has come to the Saṅgha and is living in the Saṅgha should be skilled in good behaviour regarding seats.",
    "mn69:5": "\"When a forest-dwelling bhikkhu comes to the Saṅgha and is living in the Saṅgha, he should not enter the village too early or return late in the day. If he enters the village too early and returns late in the day, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he enters the village too early and returns late in the day?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu who has come to the Saṅgha and is living in the Saṅgha should not enter the village too early or return late in the day.",
    "mn69:6": "\"When a forest-dwelling bhikkhu comes to the Saṅgha and is living in the Saṅgha, he should not go before the meal or after the meal to visit families.[n.92] This is prohibited byPāc 4(Vin iv.98–101). A bhikkhu may visit families at these times only if he has informed another bhikkhu in the monastery of his intentions, except during the season for making and giving robes.If he goes before the meal or after the meal to visit families, there will be those who would say of him: ‘Surely this venerable forest-dweller, while dwelling alone in the forest, doing as he likes, must be used to making untimely visits, since he behaves thus when he has come to the Saṅgha.’ Since there would be those who would say this of him, a forest-dwelling bhikkhu who has come to the Saṅgha and is living in the Saṅgha should not go before the meal or after the meal to visit families.",
    "mn69:7": "\"When a forest-dwelling bhikkhu comes to the Saṅgha and is living in the Saṅgha, he should not be haughty and personally vain. If he is haughty and personally vain, there will be those who would say of him: ‘Surely this venerable forest-dweller, while dwelling alone in the forest, doing as he likes, must generally be haughty and personally vain, since he behaves thus when he has come to the Saṅgha.’ Since there would be those who would say this of him, a forest-dwelling bhikkhu who has come to the Saṅgha and is living in the Saṅgha should not be haughty and personally vain.",
    "mn69:8": "\"When a forest-dwelling bhikkhu comes to the Saṅgha and is living in the Saṅgha, he should not be rough-tongued and loose-spoken. If he is rough-tongued and loose-spoken, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he is rough-tongued and loose-spoken?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu who has come to the Saṅgha and is living in the Saṅgha should not be rough-tongued and loose-spoken.",
    "mn69:9": "\"When a forest-dwelling bhikkhu comes to the Saṅgha and is living in the Saṅgha, he should be easy to correct and should associate with good friends. If he is difficult to correct and associates with bad friends, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he is difficult to correct and associates with bad friends?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu who has come to the Saṅgha and is living in the Saṅgha should be easy to correct and should associate with good friends.",
    "mn69:10": "\"A forest-dwelling bhikkhu should guard the doors of his sense faculties. If he does not guard the doors of his sense faculties, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he does not guard the doors of his sense faculties?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu should guard the doors of his sense faculties.",
    "mn69:11": "\"A forest-dwelling bhikkhu should be moderate in eating. If he is not moderate in eating, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he is not moderate in eating?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu should be moderate in eating.",
    "mn69:12": "\"A forest-dwelling bhikkhu should be devoted to wakefulness. If he is not devoted to wakefulness, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he is not devoted to wakefulness?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu should be devoted to wakefulness.",
    "mn69:13": "\"A forest-dwelling bhikkhu should be energetic. If he is not energetic, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he is lazy?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu should be energetic.",
    "mn69:14": "\"A forest-dwelling bhikkhu should be established in mindfulness. If he is unmindful, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he is unmindful? ’ Since there would be those who would say this of him, a forest-dwelling bhikkhu should be established in mindfulness.",
    "mn69:15": "\"A forest-dwelling bhikkhu should be concentrated. If he is not concentrated, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he is not concentrated?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu should be concentrated.",
    "mn69:16": "\"A forest-dwelling bhikkhu should be wise. If he is not wise, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he is not wise?’ Since there would be those who would say this of him, a forest-dwelling bhikkhu should be wise.",
    "mn69:17": "\"A forest-dwelling bhikkhu should apply himself to the higher Dhamma and the higher Discipline.[n.693]Abhidhamma abhivinaya.MAsays that he should apply himself to learning the text and commentary to the Abhidhamma Piṭaka and the Vinaya Piṭaka. This is clearly anachronistic. On Abhidhamma in the context of the suttas, seen.362.Although there is no corresponding body of literature called \"Abhivinaya,\" it seems probable the word refers to a systematic and analytical approach to the study of the Vinaya, perhaps that embedded in the Suttavibhaṅga of the Vinaya Piṭaka.There are those who ask a forest-dwelling bhikkhu a question about the higher Dhamma and the higher Discipline. If, when so asked, he fails to reply, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since when he is asked a question about the higher Dhamma and the higher Discipline he fails to reply?’ Since there will be those who would say this of him, a forest-dwelling bhikkhu should apply himself to the higher Dhamma and the higher Discipline.",
    "mn69:18": "\"A forest-dwelling bhikkhu should apply himself to those liberations that are peaceful and immaterial, transcending forms.[n.694]MA: This refers to the eight meditative attainments. As a minimum he should become proficient in the preliminary work of one meditation subject, such as akasiṇa.There are those who ask a forest-dwelling bhikkhu a question on the liberations that are peaceful and immaterial, transcending forms. If, when so asked, he fails to reply, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since when he is asked a question about those liberations that are peaceful and immaterial, transcending forms, he fails to reply?’ Since there will be those who would say this of him, a forest-dwelling bhikkhu should apply himself to those liberations that are peaceful and immaterial, transcending forms.",
    "mn69:19": "\"A forest-dwelling bhikkhu should apply himself to the superhuman state. There are those who ask a forest-dwelling bhikkhu a question on the superhuman state.[n.695]MA: This refers to all the supramundane states. As a minimum he should become proficient in one approach to developing insight up to arahantship.If, when so asked, he fails to reply, there will be those who would say of him: ‘What has this venerable forest-dweller gained by his dwelling alone in the forest, doing as he likes, since he does not even know the purpose for the sake of which he went forth?’ Since there will be those who would say this of him, a forest-dwelling bhikkhu should apply himself to the superhuman state.\"",
    "mn69:20": "When this was said, the venerable Mahā Moggallāna asked the venerable Sāriputta: \"Friend Sāriputta, should these things be undertaken and practised only by a forest-dwelling bhikkhu or by one who dwells near a village as well?\""
}