{
    "mn70:1": "Thus have I heard. On one occasion the Blessed One was wandering in the Kāsi country together with a large Saṅgha of bhikkhus. There he addressed the bhikkhus thus:",
    "mn70:2": "Now on that occasion the bhikkhus led by Assaji and Punabbasuka were residing at Kīṭāgiri.[n.697] In the Vinaya Piṭaka, the bhikkhus led by Assaji and Punabbasuka are described as \"unscrupulous and depraved\" monks and are shown indulging in various kinds of bad conduct that corrupt the laity. At Kiṭāgiri an act of banishment was pronounced against them, and their refusal to obey led to the promulgation ofSaṅghādisesa 13(Vin iii.179–84).Then a number of bhikkhus went and told them: \"Friends, the Blessed One and the Saṅgha of bhikkhus now abstain from eating at night. By so doing, they are free from illness and affliction, and they enjoy health, strength, and a comfortable abiding. Come, friends, abstain from eating at night. By so doing, you too will be free from illness and affliction, and you will enjoy lightness, strength, and a comfortable abiding.\" When this was said, the bhikkhus led by Assaji and Punabbasuka told those bhikkhus: \"Friends, we eat in the evening, in the morning, and in the day outside the proper time. By so doing, we are free from illness and affliction, and we enjoy lightness, strength, and a comfortable abiding. Why should we abandona benefitvisible here and now to pursuea benefit to be achievedat a future time? We shall eat in the evening, in the morning, and in the day outside the proper time.\"",
    "mn70:3": "Since the bhikkhus were unable to convince the bhikkhus led by Assaji and Punabbasuka, they went to the Blessed One. After paying homage to him, they sat down at one side and told him all that had occurred, adding: \"Venerable sir, since we were unable to convince the bhikkhus led by Assaji and Punabbasuka, we have reported this matter to the Blessed One.\"",
    "mn70:4": "Then the Blessed One addressed a certain bhikkhu thus: \"Come, bhikkhu, tell the bhikkhus led by Assaji and Punabbasuka in my name that the Teacher calls them.\"",
    "mn70:5": "\"Bhikkhus, have you known me to teach the Dhamma in such a way as this: ‘Whatever this person experiences, whether pleasant or painful or neither-painful-nor-pleasant, unwholesome states diminish in him and wholesome states increase’?\"[n.698]MA: This statement is made with pointed reference to pleasure experienced in eating a night meal, which does not conduce to the practice of a monk's duties.— \"No, venerable sir.\"",
    "mn70:6": "\"Good, bhikkhus.[n.700] ¶¶4–15 serve to provide, by appeal to the Buddha’s perfect understanding, the grounds for his injunction to abandon all feelings based on the household life and to develop the feelings based on renunciation.And if it were unknown by me, unseen, unfound, unrealised, uncontacted by wisdom thus: ‘Here, when someone feels a certain kind of pleasant feeling, unwholesome states increase in him and wholesome states diminish,’ would it be fitting for me, not knowing that, to say: ‘Abandon such a kind of pleasant feeling’?\" — \"No, venerable sir.\"",
    "mn70:7": "\"But because it is known by me, seen, found, realised, contacted by wisdom thus: ‘Here, when someone feels a certain kind of pleasant feeling, unwholesome states increase in him and wholesome states diminish,’ that I therefore say: ‘Abandon such a kind of pleasant feeling.’",
    "mn70:8": "\"If it were unknown by me, unseen, unfound, unrealised, uncontacted by wisdom thus: ‘Here, when someone feels another kind of pleasant feeling, unwholesome states diminish in him and wholesome states increase,’ would it be fitting for me, not knowing that, to say: ‘Enter upon and abide in such a kind of pleasant feeling’?\" — \"No, venerable sir.\"",
    "mn70:9": "\"But because it is known by me, seen, found, realised, contacted by wisdom thus: ‘Here, when someone feels another kind of pleasant feeling, unwholesome states diminish in him and wholesome states increase,’ that I therefore say: ‘Enter upon and abide in such a kind of pleasant feeling.’",
    "mn70:10": "\"If it were unknown by me … But because it is known by me … contacted by wisdom thus: ‘Here, when someone feels a certain kind of painful feeling, unwholesome states increase in him and wholesome states diminish,’ that I therefore say: ‘Abandon such a kind of painful feeling.’",
    "mn70:11": "\"If it were unknown by me … But because it is known by me … contacted by wisdom thus: ‘Here, when someone feels another kind of painful feeling, unwholesome states diminish in him and wholesome states increase,’ that I therefore say: ‘Enter upon and abide in such a kind of painful feeling.’",
    "mn70:12": "\"If it were unknown by me … But because it is known by me … contacted by wisdom thus: ‘Here, when someone feels a certain kind of neither-painful-nor-pleasant feeling, unwholesome states increase in him and wholesome states diminish,’ that I therefore say: ‘Abandon such a kind of neither-painful-nor-pleasant feeling.’",
    "mn70:13": "\"If it were unknown by me … But because it is known by me … contacted by wisdom thus: ‘Here, when someone feels another kind of neither-painful-nor-pleasant feeling, unwholesome states diminish in him and wholesome states increase,’ that I therefore say: ‘Enter upon and abide in such a kind of neither-painful-nor-pleasant feeling.’",
    "mn70:14": "\"Bhikkhus, I do not say of all bhikkhus that they still have work to do with diligence; nor do I say of all bhikkhus that they have no more work to do with diligence.",
    "mn70:15": "\"I do not say of those bhikkhus who are arahants with taints destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached the true goal, destroyed the fetters of being, and are completely liberated through final knowledge, that they still have work to do with diligence. Why is that? They have done their work with diligence; they are no more capable of being negligent.",
    "mn70:16": "\"Bhikkhus, there are seven kinds of persons to be found existing in the world.[n.701] Here follows a sevenfold classification of noble individuals which categorises them not merely on the basis of their path and fruit attainment — as the more familiar eightfold scheme does — but according to their dominant faculty. Alternative definitions of these seven are offered by Pug 1:30–36/14–15.What seven? They are: one liberated-in-both ways, one liberated-by-wisdom, a body-witness, one attained-to-view, one liberated-by-faith, a Dhamma-follower, and a faith-follower.",
    "mn70:17": "\"What kind of person is one liberated-in-both-ways? Here some person contacts with the body and abides in those liberations that are peaceful and immaterial, transcending forms, and his taints are destroyed by his seeing with wisdom. This kind of person is called one liberated-in-both-ways.[n.702]Ubhatobhāgavimutta.MA:He is \"liberated-in-both-ways\" because he is liberated from the physical body by the immaterial attainments and from the mental body by the path (of arahantship). The Pug definition reads: \"He contacts with the body and abides in the eight liberations, and his taints are destroyed by his seeing with wisdom.\" MA says that theubhatobhāgavimuttaincludes those who attain arahantship after emerging from one or another of the four immaterial attainments and the one who attains it after emerging from the attainment of cessation.I do not say of such a bhikkhu that he still has work to do with diligence. Why is that? He has done his work with diligence; he is no more capable of being negligent.",
    "mn70:18": "\"What kind of person is one liberated-by-wisdom? Here some person does not contact with the body and abide in those liberations that are peaceful and immaterial, transcending forms, but his taints are destroyed by his seeing with wisdom. This kind of person is called one liberated-by-wisdom.[n.703]Paññāvimutta.MA: This includes those who attain arahantship either as dry-insight meditators(sukkha-vipassaka)or after emerging from one or another of the four jhānas. The Pug definition merely substitutes the eight liberations for \"those liberations … transcending forms.\"I do not say of such a bhikkhu that he still has work to do with diligence. Why is that? He has done his work with diligence; he is no more capable of being negligent.",
    "mn70:19": "\"What kind of person is a body-witness? Here some person contacts with the body and abides in those liberations that are peaceful and immaterial, transcending forms, and some of his taints are destroyed by his seeing with wisdom. This kind of person is called a body-witness.[n.704]Kāyasakkhin.MA: This type includes the six individuals — from the one established in the fruit of stream-entry up to the one on the path of arahantship — who first contact the (immaterial) jhānas and subsequently realise Nibbāna. MṬ stresses that one or another of the immaterial attainments including cessation is needed to qualify askāyasakkhin.The Pug definition merely substitutes the eight liberations.I say of such a bhikkhu that he still has work to do with diligence. Why is that? Because when that venerable one makes use of suitable resting places and associates with good friends and nurtures his spiritual faculties, he may by realising for himself with direct knowledge here and now enter upon and abide in that supreme goal of the holy life for the sake of which clansmen rightly go forth from the home life into homelessness. Seeing this fruit of diligence for such a bhikkhu, I say that he still has work to do with diligence.",
    "mn70:20": "\"What kind of person is one attained-to-view? Here some person does not contact with the body and abide in those liberations that are peaceful and immaterial, transcending forms, but some of his taints are destroyed by his seeing with wisdom, and he has reviewed and examined with wisdom the teachings proclaimed by the Tathāgata. This kind of person is called one attained-to-view.[n.705]Ḍiṭṭhipatta.MAsays that this type includes the same six individuals included underkāyasakkhin— from the stream-enterer to the one on the path of arahantship — but without possession of the Pug defines him as one who has understood the Four Noble Truths and who has reviewed and examined with wisdom the teachings proclaimed by the Tathāgata.I say of such a bhikkhu that he still has work to do with diligence. Why is that? Because when that venerable one … into homelessness. Seeing this fruit of diligence for such a bhikkhu, I say that he still has work to do with diligence.",
    "mn70:21": "\"What kind of person is one liberated-by-faith? Here some person does not contact with the body and abide in those liberations that are peaceful and immaterial, transcending forms, but some of his taints are destroyed by his seeing with wisdom, and his faith is planted, rooted, and established in the Tathāgata.[n.706]Saddhāvimutta.MAsays that this type too includes the same six. Pug defines him in the same way as it defines thediṭṭhipatta,but adds that he has not reviewed and examined the teachings with wisdom to the same extent that thediṭṭhipattahas.This kind of person is called one liberated-by-faith. I say of such a bhikkhu that he still has work to do with diligence. Why is that? Because when that venerable one … into homelessness. Seeing this fruit of diligence for such a bhikkhu, I say that he still has work to do with diligence.",
    "mn70:22": "\"What kind of person is a Dhamma-follower? Here some person does not contact with the body and abide in those liberations that are peaceful and immaterial, transcending forms, and his taints are not yet destroyed by his seeing with wisdom, but those teachings proclaimed by the Tathāgata are accepted by him after reflecting on them sufficiently with wisdom. Furthermore, he has these qualities: the faith faculty, the energy faculty, the mindfulness faculty, the concentration faculty, and the wisdom faculty. This kind of person is called a Dhamma-follower.[n.707]MAsays that this type, thedhammānusārin,and the next, thesaddhānusārin,are individuals on the path of stream-entry, the former with predominance of wisdom, the latter with predominance of faith.I say of such a bhikkhu that he still has work to do with diligence. Why is that? Because when that venerable one … into homelessness. Seeing this fruit of diligence for such a bhikkhu, I say that he still has work to do with diligence.",
    "mn70:23": "\"What kind of person is a faith-follower? Here some person does not contact with the body and abide in those liberations that are peaceful and immaterial, transcending forms, and his taints are not yet destroyed by his seeing with wisdom, yet he has sufficient faith in and love for the Tathāgata. Furthermore, he has these qualities: the faith faculty, the energy faculty, the mindfulness faculty, the concentration faculty, and the wisdom faculty. This kind of person is called a faith-follower. I say of such a bhikkhu that he still has work to do with diligence. Why is that? Because when that venerable one makes use of suitable resting places and associates with good friends and nurtures his spiritual faculties, he may by realising for himself with direct knowledge here and now enter upon and abide in that supreme goal of the holy life for the sake of which clansmen rightly go forth from the home life into homelessness. Seeing this fruit of diligence for such a bhikkhu, I say that he still has work to do with diligence.",
    "mn70:24": "\"Bhikkhus, I do not say that final knowledge is achieved all at once. On the contrary, final knowledge is achieved by gradual training, by gradual practice, by gradual progress.",
    "mn70:25": "\"Bhikkhus, there is a four-phrased statement, and when it is recited a wise man would quickly understand it.[n.710]MAsays that the \"four-phrased statement\"(catuppadaṁ veyyākaraṇaṁ)is the teaching of the Four Noble Truths. However, no mention is made here of the four truths. Possibly, the four-phrased statement is the resolution on effort just below, with each clause counting as a phrase (the conditional clause being taken as two phrases).I shall recite it to you, bhikkhus. Try to understand it.\"",
    "mn70:26": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}