{
    "mn71:1": "Thus have I heard. On one occasion the Blessed One was living at Vesālī in the Great Wood in the Hall with the Peaked Roof.",
    "mn71:2": "\"Let the Blessed One come, venerable sir! Welcome to the Blessed One! It is long since the Blessed One found an opportunity to come here. Let the Blessed One be seated; this seat is ready.\" The Blessed One sat down on the seat made ready, and the wanderer Vacchagotta took a low seat, sat down at one side, and said to the Blessed One:",
    "mn71:3": "\"Vaccha, those who say thus do not say what has been said by me, but misrepresent me with what is untrue and contrary to fact.\"[n.714]MAexplains that even though part of the statement is valid, the Buddha rejects the entire statement because of the portion that is invalid. The part of the statement that is valid is the assertion that the Buddha is omniscient and all-seeing; the part that is excessive is the assertion that knowledge and vision are continuously present to him. According to the Theravāda exegetical tradition the Buddha is omniscient in the sense that all knowable things are potentially accessible to him. He cannot, however, know everything simultaneously and must advert to whatever he wishes to know. AtMN 90.8the Buddha says that it is possible to know and see all, though not simultaneously, and atAN 4:24/ii.24 he claims to know all that can be seen, heard, sensed, and cognized. This is understood by the Theravāda commentators as an assertion of omniscience in the qualified sense. See too in this connection Miln 102–7.",
    "mn71:4": "\"Venerable sir, how should I answer that I may say what has been said by the Blessed One and not misrepresent him with what is contrary to fact? How may I explain in accordance with the Dhamma in such a way that nothing which provides a ground for censure can be legitimately deduced from my assertion?\"",
    "mn71:5": "\"Vaccha, if you answer thus: ‘The recluse Gotama has the threefold true knowledge,’ you will be saying what has been said by me and will not misrepresent me with what is contrary to fact. You will explain in accordance with the Dhamma in such a way that nothing which provides a ground for censure can be legitimately deduced from your assertion.",
    "mn71:6": "\"If you answer thus: ‘The recluse Gotama has the threefold true knowledge,’ you will be saying what has been said by me and will not misrepresent me with what is contrary to fact. You will explain in accordance with the Dhamma in such a way that nothing which provides a ground for censure can be legitimately deduced from your assertion.\"",
    "mn71:7": "When this was said, the wanderer Vacchagotta asked the Blessed One: \"Master Gotama, is there any householder who, without abandoning the fetter of householdership, on the dissolution of the body has made an end of suffering?\"[n.15]MAexplains \"the fetter of householdership\"(gihisāyojana)as attachment to the requisites of a householder, which MṬ details as land, ornaments, wealth, grain, etc. MA says that even though the texts mention some individuals who attained arahantship as laymen, by the path of arahantship they destroyed all attachment to worldly things and thus either went forth as monks or passed away immediately after their attainment. The question of lay arahants is discussed at Miln 264.",
    "mn71:8": "\"Master Gotama, is there any householder who, without abandoning the fetter of householdership, on the dissolution of the body has gone to heaven?\"",
    "mn71:9": "\"Master Gotama, is there any Ājīvaka who, on the dissolution of the body, has made an end of suffering?\"[n.716] On the Ājīvakas seen.73.\"Vaccha, there is no Ājīvaka who, on the dissolution of the body, has made an end of suffering.\"",
    "mn71:10": "\"Master Gotama, is there any Ājīvaka who, on the dissolution of the body, has gone to heaven?\"",
    "mn71:11": "That is what the Blessed One said. The wanderer Vacchagotta was satisfied and delighted in the Blessed One's words."
}