{
    "mn72:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn72:2": "\"How is it, Master Gotama, does Master Gotama hold the view: ‘The world is eternal: only this is true, anything else is wrong’?\" \"Vaccha, I do not hold the view: ‘The world is eternal: only this is true, anything else is wrong.’\"",
    "mn72:3": "\"How then, does Master Gotama hold the view: ‘The world is not eternal: only this is true, anything else is wrong’?\" \"Vaccha, I do not hold the view: ‘The world is not eternal: only this is true, anything else is wrong.’\"",
    "mn72:4": "\"How is it, Master Gotama, does Master Gotama hold the view: ‘The world is finite: only this is true, anything else is wrong’?\" \"Vaccha, I do not hold the view: ‘The world is finite: only this is true, anything else is wrong.’\"",
    "mn72:5": "\"How then, does Master Gotama hold the view: ‘The world is infinite: only this is true, anything else is wrong’?\" \"Vaccha, I do not hold the view: ‘The world is infinite: only this is true, anything else is wrong.’\"",
    "mn72:6": "\"How is it, Master Gotama, does Master Gotama hold the view: ‘The soul and the body are the same: only this is true, anything else is wrong’?\"[n.718] The view that the soul(jīva)and the body are the same is materialism, which reduces the soul to the body. The following view that the soul and the body are different is an eternalist view, which regards the soul as a persisting spiritual principle that can exist independently of the body.\"Vaccha, I do not hold the view: ‘The soul and the body are the same: only this is true, anything else is wrong.’\"",
    "mn72:7": "\"How then, does Master Gotama hold the view: ‘The soul is one thing and the body another: only this is true, anything else is wrong’?\" \"Vaccha, I do not hold the view: ‘The soul is one thing and the body another: only this is true, anything else is wrong.’\"",
    "mn72:8": "\"How is it, Master Gotama, does Master Gotama hold the view: ‘After death a Tathāgata exists: only this is true, anything else is wrong’?\"[n.719] The view that a Tathāgata exists after death is a form of eternalism that regards the Tathāgata, or spiritually perfect individual, as possessing a self that attains eternal deliverance after the death of the body. The view that a Tathāgata does not exist after death also identifies the Tathāgata as self, but holds that this self is annihilated upon the death of the body. The third view attempts a synthesis of these two, which the Buddha rejects because both components involve a wrong view. The fourth view seems to be a sceptical attempt to reject both alternatives or to avoid taking a definite stand.\"Vaccha, I do not hold the view: ‘After death a Tathāgata exists: only this is true, anything else is wrong.’\"",
    "mn72:9": "\"How then, does Master Gotama hold the view: ‘After death a Tathāgata does not exist: only this is true, anything else is wrong’?\" \"Vaccha, I do not hold the view: ‘After death a Tathāgata does not exist: only this is true, anything else is wrong.’\"",
    "mn72:10": "\"How is it, Master Gotama, does Master Gotama hold the view: ‘After death a Tathāgata both exists and does not exist: only this is true, anything else is wrong.’?\" \"Vaccha, I do not hold the view: ‘After death a Tathāgata both exists and does not exist: only this is true, anything else is wrong.’\"",
    "mn72:11": "\"How then, does Master Gotama hold the view: ‘After death a Tathāgata neither exists nor does not exist: only this is true, anything else is wrong’?\" \"Vaccha, I do not hold the view: ‘After death a Tathāgata neither exists nor does not exist: only this is true, anything else is wrong.’\"",
    "mn72:12–13": "\"How is it then, Master Gotama? When Master Gotama is asked each of these ten questions, he replies: ‘I do not hold that view.’",
    "mn72:14": "What danger does Master Gotama see that he does not take up any of these speculative views?\"",
    "mn72:15": "\"Vaccha, the speculative view that the world is eternal is a thicket of views, a wilderness of views, a contortion of views, a vacillation of views, a fetter of views. It is beset by suffering, by vexation, by despair, and by fever, and it does not lead to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbāna.",
    "mn72:16": "\"Then does Master Gotama hold any speculative view at all?\"",
    "mn72:17": "\"When a bhikkhu's mind is liberated thus, Master Gotama, where does he reappearafter death?\"",
    "mn72:18": "\"When Master Gotama is asked these four questions, he replies: ‘The term \"reappears\" does not apply, Vaccha; the term \"does not reappear\" does not apply, Vaccha; the term \"both reappears and does not reappear\" does not apply, Vaccha; the term \"neither reappears nor does not reappear\" does not apply, Vaccha.’ Here I have fallen into bewilderment, Master Gotama, here I have fallen into confusion, and the measure of confidence I had gained through previous conversation with Master Gotama has now disappeared.\"",
    "mn72:19": "\"It is enough to cause you bewilderment, Vaccha, enough to cause you confusion. For this Dhamma, Vaccha, is profound, hard to see and hard to understand, peaceful and sublime, unattainable by mere reasoning, subtle, to be experienced by the wise. It is hard for you to understand it when you hold another view, accept another teaching, approve of another teaching, pursue a different training, and follow a different teacher.",
    "mn72:20": "So I shall question you about this in return, Vaccha. Answer as you choose.",
    "mn72:21": "\"If someone were to ask you, Vaccha: ‘What does this fire burning before you burn in dependence on?’ — being asked thus, what would you answer?\"\"Being asked thus, Master Gotama, I would answer: ‘This fire burns in dependence on fuel of grass and sticks.’\"",
    "mn72:22": "\"If that fire before you were to be extinguished, would you know: ‘This fire before me has been extinguished’?\"\"I would, Master Gotama.\"",
    "mn72:23": "\"If someone were to ask you, Vaccha: ‘When that fire before you was extinguished, to which direction did it go: to the east, the west, the north, or the south?’ — being asked thus, what would you answer?\"",
    "mn72:24": "\"So too, Vaccha, the Tathāgata has abandoned that material form by which one describing the Tathāgata might describe him;[n.722]MAsays this is the material form by which one would describe the Tathāgata as a being (or self) possessing material form. MṬ adds that the material form has been abandoned by the abandonment of the fetters connected with it, and it has thus become incapable of arising again in the future.he has cut it off at the root, made it like a palm stump, done away with it so that it is no longer subject to future arising. The Tathāgata is liberated from reckoning in terms of material form, Vaccha, he is profound, immeasurable, hard to fathom like the ocean. ‘He reappears’ does not apply; ‘he does not reappear’ does not apply; ‘he both reappears and does not reappear’ does not apply; ‘he neither reappears nor does not reappear’ does not apply.[n.723] This passage should be connected with the simile of the extinguished fire. Just as the extinguished fire cannot be described as having gone to any direction, so the Tathāgata who has attained to final Nibbāna cannot be described in terms of the four alternatives. The simile concerns solely the legitimacy of conceptual and linguistic usage and is not intended to suggest, as some scholars have held, that the Tathāgata attains to some mystical absorption in the Absolute. The words \"profound, immeasurable, hard to fathom\" point to the transcendental dimension of the liberation attained by the Accomplished One, its inaccessibility to discursive thought.It seems that at this point in the dialogue, the Buddha resorts to imagery to suggest what concepts cannot convey. The two images — of the extinguished fire and the deep ocean — establish between themselves a dialectical tension, and thus both must be taken into account to avoid falling into one-sided views. The image of the extinguished fire, taken alone, veers in the direction of total extinction, and thus must be balanced by the image of the ocean; the image of the ocean, taken alone, suggests some eternal mode of being, and thus must be balanced by the image of the extinguished fire. Again, the truth lies in the middle that transcends untenable extremes.",
    "mn72:25": "The Tathāgata has abandoned that feeling by which one describing the Tathāgata might describe him;",
    "mn72:26": "… has abandoned that perception by which one describing the Tathāgata might describe him;",
    "mn72:27": "… has abandoned those formations by which one describing the Tathāgata might describe him;",
    "mn72:28": "… has abandoned that consciousness by which one describing the Tathāgata might describe him; he has cut it off at the root, made it like a palm stump, done away with it so that it is no longer subject to future arising. The Tathāgata is liberated from reckoning in terms of consciousness, Vaccha; he is profound, immeasurable, hard to fathom like the ocean. ‘He reappears’ does not apply; ‘he does not reappear’ does not apply; ‘he both reappears and does not reappear’ does not apply; ‘he neither reappears nor does not reappear’ does not apply.\"",
    "mn72:29": "When this was said, the wanderer Vacchagotta said to the Blessed One: \"Master Gotama, suppose there were a great sāla tree not far from a village or town, and impermanence wore away its branches and foliage, its bark and sapwood, so that on a later occasion, being divested of branches and foliage, divested of bark and sapwood, it became pure, consisting entirely of heartwood; so too, this discourse of Master Gotama's is divested of branches and foliage, divested of bark and sapwood, and is pure, consisting entirely of heartwood."
}