{
    "mn73:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Bamboo Grove, the Squirrels’ Sanctuary.",
    "mn73:2": "\"Vaccha, greed is unwholesome, non-greed is wholesome; hate is unwholesome, non-hate is wholesome; delusion is unwholesome, non-delusion is wholesome. In this way three things are unwholesome and the other three things are wholesome.",
    "mn73:3": "\"Killing living beings is unwholesome, abstention from killing living beings is wholesome; taking what is not given is unwholesome, abstention from taking what is not given is wholesome; misconduct in sensual pleasures is unwholesome, abstention from misconduct in sensual pleasures is wholesome; false speech is unwholesome, abstention from false speech is wholesome; malicious speech is unwholesome, abstention from malicious speech is wholesome; harsh speech is unwholesome, abstention from harsh speech is wholesome; gossip is unwholesome, abstention from gossip is wholesome; covetousness is unwholesome, uncovetousness is wholesome; ill will is unwholesome, non-ill will is wholesome; wrong view is unwholesome, right view is wholesome. In this way ten thingsis are unwholesome and the other ten things are wholesome.",
    "mn73:4": "\"When a bhikkhu has abandoned craving, cut it off at the root, made it like a palm stump, done away with it so that it is no longer subject to future arising, then that bhikkhu is an arahant with taints destroyed, one who has lived the holy life, done what had to be done, laid down the burden, reached the true goal, destroyed the fetters of being, and is completely liberated through final knowledge.\"",
    "mn73:5": "\"Apart from Master Gotama, is there any one bhikkhu, Master Gotama's disciple, who by realising for himself with direct knowledge here and now enters upon and abides in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints?\"[n.724] This question and the next refer to arahantship, which (according toMA) Vacchagotta thought may have been an exclusive prerogative of the Buddha.",
    "mn73:6": "\"Apart from Master Gotama and the bhikkhus, is there any one bhikkhunī, Master Gotama's disciple, who by realising for herself with direct knowledge here and now enters upon and abides in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints?\"",
    "mn73:7": "\"Apart from Master Gotama and the bhikkhus and bhikkhunīs, is there any one man lay follower, Master Gotama's disciple, clothed in white leading a life of celibacy who, with the destruction of the five lower fetters, will reappear spontaneouslyin the Pure Abodesand there attain final Nibbāna without ever returning from that world?\"[n.25] This question refers to the non-returner. Even though a non-returner may remain in the lay life, he necessarily observes celibacy because he has cut off the fetter of sensual desire.",
    "mn73:8": "\"Apart from Master Gotama, the bhikkhus and bhikkhunīs, and the men lay followers clothed in white leading lives of celibacy, is there any one man lay follower, Master Gotama's disciple, clothed in white enjoying sensual pleasures, who carries out his instruction, responds to his advice, has gone beyond doubt, become free from perplexity, gained intrepidity, and become independent of others in the Teacher's Dispensation?\"[n.726] This question refers to the stream-enterer and the once-returner, who may still indulge in sensual pleasures if they remain in the lay life.",
    "mn73:9": "\"Apart from Master Gotama, the bhikkhus and bhikkhunīs, and the men lay followers clothed in white, both those leading lives of celibacy and those enjoying sensual pleasures, is there any one woman lay follower, Master Gotama's disciple, clothed in white leading a life of celibacy who, with the destruction of the five lower fetters, will reappear spontaneouslyin the Pure Abodesand there attain final Nibbāna without ever returning from that world?\"",
    "mn73:10": "\"Apart from Master Gotama, the bhikkhus and bhikkhunīs, and the men lay followers clothed in white, both those leading lives of celibacy and those enjoying sensual pleasures, and the women lay followers clothed in white leading lives of celibacy, is there any one woman lay follower, Master Gotama's disciple, clothed in white enjoying sensual pleasures, who carries out his instruction, responds to his advice, has gone beyond doubt, become free from perplexity, gained intrepidity, and become independent of others in the Teacher's Dispensation?\"",
    "mn73:11": "\"Master Gotama, if only Master Gotama were accomplished in this Dhamma, but no bhikkhus were accomplished, then this holy life would be deficient in that respect; but because Master Gotama and bhikkhus are accomplished in this Dhamma, this holy life is thus complete in that respect.",
    "mn73:12": "If only Master Gotama and bhikkhus were accomplished in this Dhamma, but no bhikkhunīs were accomplished, then this holy life would be deficient in that respect; but because Master Gotama, bhikkhus, and bhikkhunīs are accomplished in this Dhamma, this holy life is thus complete in that respect.",
    "mn73:13": "If only Master Gotama, bhikkhus, and bhikkhunīs were accomplished in this Dhamma, but no men lay followers clothed in white leading lives of celibacy were accomplished, then this holy life would be deficient in that respect; but because Master Gotama, bhikkhus and bhikkhunīs, and men lay followers clothed in white leading lives of celibacy are accomplished in this Dhamma, this holy life is thus complete in that respect.",
    "mn73:14": "If only Master Gotama, bhikkhus and bhikkhunīs, and men lay followers clothed in white leading lives of celibacy were accomplished in this Dhamma, but no men lay followers clothed in white enjoying sensual pleasures were accomplished, then this holy life would be deficient in that respect; but because Master Gotama, bhikkhus and bhikkhunīs, and men lay followers clothed in white, both those leading lives of celibacy and those enjoying sensual pleasures, are accomplished in this Dhamma, this holy life is thus complete in that respect.",
    "mn73:15": "If only Master Gotama, bhikkhus and bhikkhunīs, and men lay followers clothed in white … were accomplished in this Dhamma, but no women lay followers clothed in white leading lives of celibacy were accomplished, then this holy life would be deficient in that respect; but because Master Gotama, bhikkhus and bhikkhunīs, men lay followers clothed in white … and women lay followers clothed in white leading lives of celibacy are accomplished in this Dhamma, this holy life is thus complete in that respect.",
    "mn73:16": "If only Master Gotama, bhikkhus and bhikkhunīs, men lay followers clothed in white … and women lay followers clothed in white leading lives of celibacy were accomplished in this Dhamma, but no women lay followers clothed in white enjoying sensual pleasures were accomplished, then this holy life would be deficient in that respect; but because Master Gotama, bhikkhus and bhikkhunīs, men lay followers clothed in white, both those leading lives of celibacy and those enjoying sensual pleasures, and women lay followers clothed in white, both those leading lives of celibacy and those enjoying sensual pleasures, are accomplished in this Dhamma, this holy life is thus complete in that respect.",
    "mn73:17": "\"Just as the river Ganges inclines towards the sea, slopes towards the sea, flows towards the sea, and reaches the sea, so too Master Gotama's assembly with its homeless ones and its householders inclines towards Nibbāna, slopes towards Nibbāna, flows towards Nibbāna, and reaches Nibbāna.",
    "mn73:18": "Not long after his full admission, a half-month after his full admission, the venerable Vacchagotta went to the Blessed One, and after paying homage to him, he sat down at one side and told the Blessed One: \"Venerable sir, I have attained whatever can be attained by the knowledge of a disciple in higher training, by the true knowledge of a disciple in higher training. Let the Blessed One teach me the Dhamma further.\"[n.727]MA: He had attained the fruit of the non-returner and came to ask the Buddha about the practice of insight for attaining the path of arahantship. However, the Buddha saw that he had the supporting conditions for the six direct knowledges. Thus he taught him serenity for producing the five mundane direct knowledges and insight for reaching arahantship.",
    "mn73:19": "\"In that case, Vaccha, develop further two things: serenity and insight. When these two things — serenity and insight — are developed further, they will lead to the penetration of many elements.",
    "mn73:20": "\"To the extent that you may wish: ‘May I wield the various kinds of supernormal power: having been one, may I become many; having been many, may I become one; may I appear and vanish; may I go unhindered through a wall, through an enclosure, through a mountain, as though through space; may I dive in and out of the earth as though it were water; may I walk on water without sinking as though it were earth; seated cross-legged, may I travel in space like a bird; with my hand may I touch and stroke the moon and sun so powerful and mighty; may I wield bodily mastery even as far as the Brahma-world’ — you will attain the ability to witness any aspect therein, there being a suitable basis.[n.728] The suitable basis(āyatana)is the fourth jhāna for the five direct knowledges and insight for arahantship.",
    "mn73:21": "\"To the extent that you may wish: ‘May I, with the divine ear element, which is purified and surpasses the human, hear both kinds of sounds, the divine and the human, those that are far as well as near’ — you will attain the ability to witness any aspect therein, there being a suitable basis.",
    "mn73:22": "\"To the extent that you may wish: ‘May I understand the minds of other beings, of other persons, having encompassed them with my own mind. May I understand a mind affected by lust as affected by lust and a mind unaffected by lust as unaffected by lust; may I understand a mind affected by hate as affected by hate and a mind unaffected by hate as unaffected by hate; may I understand a mind affected by delusion as affected by delusion and a mind unaffected by delusion as unaffected by delusion; may I understand a contracted mind as contracted and a distracted mind as distracted; may I understand an exalted mind as exalted and an unexalted mind as unexalted; may I understand a surpassed mind as surpassed and an unsurpassed mind as unsurpassed; may I understand a concentrated mind as concentrated and an unconcentrated mind as unconcentrated; may I understand a liberated mind as liberated and an unliberated mind as unliberated’ — you will attain the ability to witness any aspect therein, there being a suitable basis.",
    "mn73:23": "\"To the extent that you may wish: ‘May I recollect my manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion: ‘There I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared elsewhere; and there too I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared here.’ Thus with their aspects and particulars may I recollect my manifold past lives’ — you will attain the ability to witness any aspect therein, there being a suitable basis.",
    "mn73:24": "\"To the extent that you may wish: ‘May I, with the divine eye, which is purified and surpasses the human, see beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate. He understands how beings pass on according to their actions thus: ‘These worthy beings who were ill conducted in body, speech, and mind, revilers of noble ones, wrong in their views, giving effect to wrong view in their actions, on the dissolution of the body, after death, have reappeared in a state of deprivation, in a bad destination, in perdition, even in hell; but these worthy beings who were well conducted in body, speech, and mind, not revilers of noble ones, right in their views, giving effect to right view in their actions, on the dissolution of the body, after death, have reappeared in a good destination, even in the heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and may I understand how beings pass on according to their actions’ — you will attain the ability to witness any aspect therein, there being a suitable basis.",
    "mn73:25": "\"To the extent that you may wish: ‘May I, by realising for myself with direct knowledge, here and now enter upon and abide in the deliverance of mind and deliverance by wisdom that are taintless with the destruction of the taints’ — you will attain the ability to witness any aspect therein, there being a suitable basis.\"",
    "mn73:26": "Then the venerable Vacchagotta, having delighted and rejoiced in the Blessed One's words, rose from his seat, and after paying homage to the Blessed One, keeping him on his right, he departed.",
    "mn73:27": "Now on that occasion a number of bhikkhus were going to see the Blessed One. The venerable Vacchagotta saw them coming in the distance. Seeing them, he went to them and asked them: \"Where are the venerable ones going?\" \"We are going to see the Blessed One, friend.\"",
    "mn73:28": "That is what the Blessed One said. Those bhikkhus were satisfied and delighted in the Blessed One's words."
}