{
    "mn74:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Boar's Cave on the mountain Vulture Peak.",
    "mn74:2": "When this was said, the wanderer Dīghanakha remarked: \"Master Gotama commends my point of view, Master Gotama recommends my point of view.\"",
    "mn74:3": "\"Aggivessana, as to those recluses and brahmins who hold the doctrine and view ‘Something is acceptable to me, something is not acceptable to me’ — the view of theirs as to what is acceptable is close to lust, close to bondage, close to delighting, close to holding, close to clinging, while the view of theirs as to what is not acceptable is close to non-lust, close to non-bondage, close to non-delighting, close to non-holding, close to non-clinging.",
    "mn74:4": "\"A wise man among those recluses and brahmins who hold the doctrine and view ‘Nothing is acceptable to me’ considers thus: ‘If I obstinately adhere to my view \"Nothing is acceptable to me\" and declare: \"Only this is true, anything else is wrong,\" then I may clash with the two others: with a recluse or brahmin who holds the doctrine and view \"Everything is acceptable to me\" and with a recluse or brahmin who holds the doctrine and view \"Something is acceptable to me, something is not acceptable to me.\" I may clash with these two, and when there is a clash, there are disputes; when there are disputes, there are quarrels; when there are quarrels, there is vexation.’ Thus, foreseeing for himself clashes, disputes, quarrels, and vexation, he abandons that view and does not take up some other view. This is how there comes to be the abandoning of these views; this is how there comes to be the relinquishing of these views.",
    "mn74:5": "\"A wise man among those recluses and brahmins who hold the doctrine and view ‘Something is acceptable to me, something is not acceptable to me’ considers thus: ‘If I obstinately adhere to my view \"Something is acceptable to me, something is not acceptable to me\" and declare: \"Only this is true, anything else is wrong,\" then I may clash with the two others: with a recluse or brahmin who holds the doctrine and view \"Everything is acceptable to me\" and with a recluse or brahmin who holds the doctrine and view \"Nothing is acceptable to me.\" I may clash with these two, and when there is a clash, there are disputes; when there are disputes, there are quarrels; when there are quarrels, there is vexation.’ Thus, foreseeing for himself clashes, disputes, quarrels, and vexation, he abandons that view and does not take up some other view. This is how there comes to be the abandoning of these views; this is how there comes to be the relinquishing of these views.",
    "mn74:6": "\"Now, Aggivessana,[n.73]MA: At this point Dīghanakha has discarded his annihilationist view. Thus the Buddha now undertakes to teach him insight meditation, first by way of the impermanence of the body and then by way of the impermanence of the mental factors under the heading of feeling.this body made of material form, consisting of the four great elements, procreated by a mother and father, and built up out of boiled rice and porridge, is subject to impermanence, to being worn and rubbed away, to dissolution and disintegration. It should be regarded as impermanent, as suffering, as a disease, as a tumour, as a dart, as a calamity, as an affliction, as alien, as disintegrating, as void, as not self. When one regards this body thus, one abandons desire for the body, affection for the body, subservience to the body.",
    "mn74:7": "\"There are, Aggivessana, three kinds of feeling: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. On the occasion when one feels pleasant feeling, one does not feel painful feeling or neither-painful-nor-pleasant feeling; on that occasion one feels only pleasant feeling. On the occasion when one feels painful feeling, one does not feel pleasant feeling or neither-painful-nor-pleasant feeling; on that occasion one feels only painful feeling. On the occasion when one feels neither-painful-nor-pleasant feeling, one does not feel pleasant feeling or painful feeling; on that occasion one feels only neither-painful-nor-pleasant feeling.",
    "mn74:8": "Now on that occasion the venerable Sāriputta was standing behind the Blessed One, fanning him. Then he thought: \"The Blessed One, indeed, speaks to us of the abandoning of these things through direct knowledge; the Sublime One, indeed, speaks to us of the relinquishing of these things through direct knowledge.\" As the venerable Sāriputta considered this, through not clinging his mind was liberated from the taints.[n.73]MA: Having reflected on the discourse spoken to his nephew, Ven. Sāriputta developed insight and attained arahantship. Dīghanakha attained the fruit of stream-entry."
}