{
    "mn76:1": "Thus have I heard. On one occasion the Blessed One was living at Kosambī in Ghosita's Park.",
    "mn76:2": "Now on that occasion the wanderer Sandaka was seated with a large assembly of wanderers who were making an uproar, loudly and noisily talking many kinds of pointless talk,[n.748]Tiracchānakathā.Many translators render this expression as \"animal talk.\" However, tiracchāna means literally \"going horizontally,\" and though this term is used as a designation for animals, MA explains that in the present context it means talk that goes \"horizontally\" or \"perpendicularly\" to the path leading to heaven and liberation.such as talk of kings, robbers, ministers, armies, dangers, battles, food, drink, clothing, beds, garlands, perfumes, relatives, vehicles, villages, towns, cities, countries, women, heroes, streets, wells, the dead, trifles, the origin of the world, the origin of the sea, whether things are so or are not so.",
    "mn76:3": "Then the wanderer Sandaka saw the venerable Ānanda coming in the distance. Seeing him, he quieted his own assembly thus: \"Sirs, be quiet; sirs, make no noise. Here comes the recluse Ānanda, a disciple of the recluse Gotama, one of the recluse Gotama's disciples staying in Kosambī. These venerable ones like quiet; they are disciplined in quiet; they commend quiet. Perhaps if he finds our assembly a quiet one, he will think to join us.\" Then the wanderers became silent.",
    "mn76:4": "The venerable Ānanda went to the wanderer Sandaka who said to him: \"Let Master Ānanda come! Welcome to Master Ānanda! It is long since Master Ānanda found an opportunity to come here. Let Master Ānanda be seated; this seat is ready.\"",
    "mn76:5": "\"Master Ānanda, let be the discussion for which we are now sitting together here. Master Ānanda can well hear about it later. It would be good if Master Ānanda would give a talk on his own teacher's Dhamma.\"",
    "mn76:6": "\"Here, Sandaka, some teacher holds such a doctrine and view as this: ‘There is nothing given, nothing offered, nothing sacrificed; no fruit or result of good and bad actions; no this world, no other world; no mother, no father; no beings who are reborn spontaneously; no good and virtuous recluses and brahmins in the world who have themselves realised by direct knowledge and declare this world and the other world. A person consists of the four great elements.[n.750] The following passage makes explicit the materialist premises of the nihilistic view already set forth atMN 0.7. The Sāmaññaphala Sutta ascribes this view to Ajita Kesakambalin (DN 2.23/i.55).When he dies, earth returns and goes back to the body of earth, water returns and goes back to the body of water, fire returns and goes back to the body of fire, air returns and goes back to the body of air; the faculties pass over to space.Fourmen with the bier as fifth carry away the corpse. The funeral orations last as far as the charnel ground; the bones whiten; burnt offerings end with ashes. Giving is a doctrine of fools. When anyone asserts the doctrine that there isgiving and the like, it is empty, false prattle. Fools and the wise are alike cut off and annihilated with the dissolution of the body; after death they do not exist.’",
    "mn76:7": "\"About this a wise man considers thus: ‘This good teacher holds this doctrine and view: \"There is nothing given … after death they do not exist.\" If this good teacher's words are true, then both of us are exactly equal here, we stand on the same level: I who have not practisedthis teachinghere and he who has practised it; I who have not livedthe holy lifehere and he who has lived it.[n.51] The point seems to be that even if one does not live the holy life, one ultimately reaps the same rewards as one who does, as the rest of the passage will make clear.Yet I do not say that both of us are cut off and annihilated with the dissolution of the body, that after death we shall not exist. But it is superfluous for this good teacher to go about naked, to be shaven, to exert himself in the squatting posture, and to pull out his hair and beard, since I, who live in a house crowded with children, who use Benares sandalwood, who wear garlands, scents, and unguents, and accept gold and silver, shall reap exactly the same destination, the same future course, as this good teacher. What do I know and see that I should lead the holy life under this teacher?’ So when he finds that this way negates the living of the holy life, he turns away from it and leaves it.",
    "mn76:8": "\"Again, Sandaka, here some teacher holds such a doctrine and view as this: ‘When one acts or makes others act, when one mutilates or makes others mutilate, when one tortures or makes others inflict torture, when one inflicts sorrow or makes others inflict sorrow, when one oppresses or makes others inflict oppression, when one intimidates or makes others inflict intimidation, when one kills living beings, takes what is not given, breaks into houses, plunders wealth, commits burglary, ambushes highways, seduces another's wife, utters falsehood — no evil is done by the doer. If, with a razor-rimmed wheel, one were to make the living beings on this earth into one mass of flesh, into one heap of flesh, because of this there would be no evil and no outcome of evil. If one were to go along the south bank of the Ganges killing and slaughtering, mutilating and making others mutilate, torturing and making others inflict torture, because of this there would be no evil and no outcome of evil. If one were to go along the north bank of the Ganges giving gifts and making others give gifts, making offerings and making others make offerings, because of this there would be no merit and no outcome of merit. By giving, by taming oneself, by restraint, by speaking truth, there is no merit and no outcome of merit.’",
    "mn76:9": "\"About this a wise man considers thus: ‘This good teacher holds this doctrine and view: \"When one acts … there is no merit and no outcome of merit.\" If this good teacher's words are true, then both of us are exactly equal here, we stand on the same level: I who have not practisedthis teachinghere and he who has practised it; I who have not livedthe holy lifehere and he who has lived it. Yet I do not say that whatever bothof usdo, no evil is done. But it is superfluous for this good teacher … What do I know and see that I should lead the holy life under thiWs teacher?’ So when he finds that this way negates the living of the holy life, he turns away from it and leaves it.",
    "mn76:10": "\"Again, Sandaka, here some teacher holds such a doctrine and view as this: ‘There is no cause or condition for the defilement of beings; beings are defiled without cause or condition. There is no cause or condition for the purification of beings; beings are purified without cause or condition. There is no power, no energy, no manly strength, no manly endurance. All beings, all living things, all creatures, all souls are without mastery, power, and energy; moulded by destiny, circumstance, and nature, they experience pleasure and pain in the six classes.’",
    "mn76:11": "\"About this a wise man considers thus: ‘This good teacher holds this doctrine and view: \"There is no cause … in the six classes.\" If this good teacher's words are true, then both of us are exactly equal here, we stand on the same level: I who have not practisedthis teachinghere and he who has practised it; I who have not livedthe holy lifehere and he who has lived it. Yet I do not say that bothof uswill be purified without cause or condition. But it is superfluous for this good teacher … What do I know and see that I should lead the holy life under this teacher?’ So when he finds that this way negates the living of the holy life, he turns away from it and leaves it.",
    "mn76:12": "\"Again, Sandaka, here some teacher holds such a doctrine and view as this:[n.752] In the Sāmaññaphala Sutta the view that follows, as far as \"the space between the seven bodies,\" is ascribed to Pakudha Kaccāyana (DN 2.26/i.56). However, in that sutta the following passage on the elaborate system of classifications, down to \"fools and the wise both will make an end of suffering,\" is connected with the view of non-causality and follows immediately upon the statement of the doctrine of non-causality set forth in this sutta at ¶8. The entire view is there assigned to Makkhali Gosāla. Since there are evident connections between the non-causality doctrine and items in the system of classifications (e.g., the reference to the \"six classes\"), and since both are known to have been typical of the Ājīvaka movement headed by Makkhali Gosāla, it seems that the inclusion of this system of classifications here under the doctrine of the seven bodies came about through an error of oral transmission. The correct version would thus be the one preserved by the Dīgha Nikāya. For the commentary on the system of classification, see Bodhi,The Discourse on the Fruits of Recluseship,pp. 72–77.‘There are these seven bodies that are unmade, not brought forth, uncreated, without a creator, barren, standing like mountain peaks, standing like pillars. They do not move or change or obstruct each other. None is ableto arousepleasure or pain or pleasure-and-pain in another. What are the seven? They are the earth-body, the water-body, the fire-body, the air-body, pleasure, pain, and the soul as the seventh. These seven bodies are unmade … Herein, there is no killer, no slaughterer, no hearer, no speaker, no cognizer, no intimater. Even those who cut off someone's head with a sharp sword do not deprive anyone of life; the sword merely passes through the space between the seven bodies. There are these fourteen hundred thousand principal kinds of generation, and sixty hundred kinds, and six hundred kinds; there are five hundred kinds of action, and five kinds of action, and three kinds of action, and action and half-action; there are sixty-two ways, sixty-two sub-aeons, six classes, eight planes of man, forty-nine hundred kinds of livelihood, forty-nine hundred kinds of wanderers, forty-nine hundred abodes of serpents, twenty hundred faculties, thirty hundred hells, thirty-six elements of dust, seven percipient breeds, seven non-percipient breeds, seven sheathless breeds, seven kinds of gods, seven kinds of men, seven kinds of demons, seven lakes, seven knots, seven kinds of chasms, seven hundred kinds of chasms, seven kinds of dreams, seven hundred kinds of dreams; and there are eighty-four hundred thousand great aeons wherein, by running and wandering through the round of rebirths, fools and the wise both will make an end of suffering. There is none of this: \"By this virtue or observance or asceticism or holy life I shall make unripened action ripen or annihilate ripened action as it comes.\" Pleasure and pain are meted out. The round of rebirths is limited, there is no shortening or extending it, no increasing or decreasing it. Just as a ball of string when thrown goes as far as the string unwinds, so too, by running and wandering through the round of rebirths, fools and the wise both will make an end of suffering.’",
    "mn76:13": "\"About this a wise man considers thus: ‘This good teacher holds this doctrine and view: \"There are these seven bodies … fools and the wise both will make an end of suffering.\" If this good teacher's words are true, then both of us are exactly equal here, we stand on the same level: I who have not practisedthis teachinghere and he who has practised it; I who have not livedthe holy lifehere and he who has lived it. Yet I do not say that both of us will make an end of suffering by running and wandering through the round of rebirths. But it is superfluous for this good teacher to go about naked, to be shaven, to exert himself in the squatting position, and to pull out his hair and beard, since I, who live in a house crowded with children, who use Benares sandalwood, who wear garlands, scents, and unguents, and accept gold and silver, shall reap exactly the same destination, the same future course, as this good teacher. What do I know and see that I should lead the holy life under this teacher?’ So when he finds that this way negates the living of the holy life, he turns away from it and leaves it.",
    "mn76:14": "\"These, Sandaka, are the four ways that negate the living of the holy life that have been declared by the Blessed One who knows and sees, accomplished and fully enlightened, wherein a wise man certainly would not live the holy life, or if he should live it, would not attain the true way, the Dhamma that is wholesome.\"",
    "mn76:15": "\"It is wonderful, Master Ānanda, it is marvellous, how the four ways that negate the living of the holy life have been declared by the Blessed One who knows and sees, accomplished and fully enlightened … But, Master Ānanda, what are those four kinds of holy life without consolation that have been declared by the Blessed One who knows and sees, accomplished and fully enlightened, wherein a wise man certainly would not live the holy life, or if he should live it, would not attain the true way, the Dhamma that is wholesome?\"",
    "mn76:16": "\"Here, Sandaka, some teacher claims to be omniscient and all-seeing, to have complete knowledge and vision thus: ‘Whether I am walking or standing or sleeping or awake, knowledge and vision are continuously and uninterruptedly present to me.’[n.753] This is the claim made by the Jain teacher the Nigaṇṭha Nātaputta atMN 14.17, and both the latter and Pūraṇa Kassapa atAN 9:38/iv.428–29. The fact that he makes bad judgements and must ask questions belies his claim to omniscience.He enters an empty house, he gets no almsfood, a dog bites him, he meets with a wild elephant, a wild horse, a wild bull, he asks the name and clan of a woman or a man, he asks the name of a village or a town, and the way to go there. When he is questioned: ‘How is this?’ he replies: ‘I had to enter an empty house, that is why I entered it. I had to get no almsfood, that is why I did not get any. I had to be bitten by a dog, that is why I was bitten. I had to meet with a wild elephant, a wild horse, a wild bull, that is why I met with them. I had to ask the name and clan of a woman or a man, that is why I asked. I had to ask the name of a village or a town and the way to go there, that is why I asked.’",
    "mn76:17": "\"Again, Sandaka, here some teacher is a traditionalist, one who regards oral tradition as truth; he teaches a Dhamma by oral tradition, by legends handed down, by the authority of the collections. But when a teacher is a traditionalist, one who regards oral tradition as truth, some is well transmitted and some badly transmitted,[n.754] With BBS and SBJ we should readsussutaṁanddussutaṁ.PTSsussataṁanddussataṁare clearly mistaken.some is true and some is otherwise.",
    "mn76:18": "\"Again, Sandaka, here a certain teacher is a reasoner, an inquirer. He teaches a Dhamma hammered out by reasoning, following a line of inquiry as it occurs to him. But when a teacher is a reasoner, an inquirer, some is well reasoned and some is wrongly reasoned, some is true and some is otherwise.",
    "mn76:19": "\"Again, Sandaka, here a certain teacher is dull and confused. Because he is dull and confused, when he is asked such and such a question, he engages in verbal wriggling, in eel-wriggling: ‘I don’t say it is like this. And I don’t say it is like that. And I don’t say it is otherwise. And I don’t say it is not so. And I don’t say it is not not so.’[n.755]MA: This position is called eel-wriggling(amarāvikkhepa)because the doctrine roams about here and there, like an eel diving in and out of the water, and thus it is impossible to catch hold of it. In the Sāmaññaphala Sutta this position is ascribed to Sañjaya Belaṭṭhiputta (DN 2.32/1.58–59). It is quite possible that the \"eel-wrigglers\" were a class of radical sceptics who questioned the entire prospect of apodictic knowledge about ultimate issues.",
    "mn76:20": "\"These, Sandaka, are the four kinds of holy life without consolation that have been declared by the Blessed One who knows and sees, accomplished and fully enlightened, wherein a wise man certainly would not live the holy life, or if he should live it, would not attain the true way, the Dhamma that is wholesome.\"",
    "mn76:21": "\"It is wonderful, Master Ānanda, it is marvellous, how the four kinds of holy life without consolation have been declared by the Blessed One who knows and sees, accomplished and fully enlightened … But, Master Ānanda, what does that teacher assert, what does he declare, wherein a wise man certainly would live the holy life, and while living it would attain the true way, the Dhamma that is wholesome?’\"",
    "mn76:22": "\"Here, Sandaka, a Tathāgata appears in the world, accomplished, fully enlightened … \"Having thus abandoned these five hindrances, imperfections of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. A wise man certainly would live the holy life with a teacher under whom a disciple attains such a lofty distinction, and while living it he would attain the true way, the Dhamma that is wholesome.",
    "mn76:23–25": "\"Again, with the stilling of applied and sustained thought, he enters upon and abides in the second jhāna … With the fading away as well of rapture … he enters upon and abides in the third jhāna … With the abandoning of pleasure and pain … he enters upon and abides in the fourth jhāna. A wise man certainly would live the holy life with a teacher under whom a disciple attains such a lofty distinction …",
    "mn76:26": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the recollection of past lives. He recollects his manifold past lives, that is, one birth, two births … Thus with their aspects and particulars he recollects his manifold past lives. A wise man certainly would live the holy life with a teacher under whom a disciple attains such a lofty distinction …",
    "mn76:27": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the passing away and reappearance of beings … Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and he understands how beings pass on according to their actions. A wise man certainly would live the holy life with a teacher under whom a disciple attains such a lofty distinction …",
    "mn76:28": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the destruction of the taints. He understands as it actually is: ‘This is suffering’ … He understands as it actually is: ‘This is the way leading to the cessation of the taints.’",
    "mn76:29": "\"But, Master Ānanda, when a bhikkhu is an arahant with taints destroyed, one who has lived the holy life, done what had to be done, laid down the burden, reached his own goal, destroyed the fetters of being, and is completely liberated through final knowledge, could he enjoy sensual pleasures?\"",
    "mn76:30": "\"But, Master Ānanda, when a bhikkhu is an arahant with taints destroyed … is his knowledge and vision that his taints are destroyed continuously and uninterruptedly present to him whether he is walking or standing or sleeping or awake?\"",
    "mn76:31": "\"How many emancipators[n.759]Niyyātāro:Ñm had rendered this as \"guides,\" Horner as \"great leaders.\" Evidently both followed PED, which takesniyyātarto be an agent noun related toniyyāma(ka), pilot or helmsman. Butniyyātarmust be an agent noun of the verbniyyāti,\"to go out (to final emancipation),\" and thus it has been rendered here as \"emancipator.\" This may be the only place in the Nikāyas where this word occurs.are there in this Dhamma and Discipline, Master Ānanda?\""
}