{
    "mn80:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn80:2": "\"But, Kaccāna, why do you say: ‘This is the perfect splendour, this is the perfect splendour!’? What is that perfect splendour?\"",
    "mn80:3": "\"Master Gotama, that splendour is the perfect splendour which is unsurpassed by any other splendour higher or more sublime.\"",
    "mn80:4": "\"But, Kaccāna, what is that splendour that is unsurpassed by any other splendour higher or more sublime?\"",
    "mn80:5": "\"Master Gotama, that splendour is the perfect splendour that is unsurpassed by any other splendour higher or more sublime.\"",
    "mn80:6": "\"Kaccāna, you might continue for a long time in this way. You say: ‘Venerable sir, that splendour is the perfect splendour which is unsurpassed by any other splendour higher or more sublime,’ yet you do not indicate what that splendour is. Suppose a man were to say: ‘I am in love with the most beautiful girl in this country.’ Then they would ask him: ‘Good man, that most beautiful girl in this country with whom you are in love — do you know whether she is from the noble class or the brahmin class or the merchant class or the worker class?’ and he would reply: ‘No.’ Then they would ask him: ‘Good man, that most beautiful girl in this country with whom you are in love — do you know her name and clan? … Whether she is tall or short or of middle height? … Whether she is dark or brown or golden-skinned? … What village or town or city she lives in?’ and he would reply: ‘No.’ And then they would ask him: ‘Good man, do you then love a girl you have never known or seen?’ and he would reply: ‘Yes.’",
    "mn80:7": "What do you think, Kaccāna, that being so, would not that man's talk amount to nonsense?\"",
    "mn80:8": "\"What do you think, Kaccāna? This beautiful beryl gem of purest water, eight-faceted, well cut, lying on red brocade, which glows, radiates, and shines, or a glowworm in the thick darkness of the night — of these two, which gives off the splendour that is more excellent and sublime?\" — \"The glowworm in the thick darkness of the night, venerable sir.\"",
    "mn80:9": "\"What do you think, Kaccāna? This glowworm in the thick darkness of the night or an oil-lamp in the thick darkness of the night — of these two, which gives off the splendour that is more excellent and sublime?\" — \"The oil-lamp, venerable sir.\"",
    "mn80:10": "\"What do you think, Kaccāna? This oil-lamp in the thick darkness of the night or a great bonfire in the thick darkness of the night — of these two, which gives off the splendour that is more excellent and sublime?\" — \"The great bonfire, venerable sir.\"",
    "mn80:11": "\"What do you think, Kaccāna? This great bonfire in the thick darkness of the night or the morning star towards dawn in a clear cloudless sky — of these two, which gives off the splendour that is more excellent and sublime?\" — \"The morning star towards dawn in a clear cloudless sky, venerable sir.\"",
    "mn80:12": "\"What do you think, Kaccāna? The morning star towards dawn in a clear cloudless sky or the full moon at midnight in a clear cloudless sky on the Uposatha day of the fifteenth — of these two, which gives off the splendour that is more excellent and sublime?\" — \"The full moon at midnight in a clear cloudless sky on the Uposatha day of the fifteenth, venerable sir.\"13\"What do you think, Kaccāna? The full moon at midnight in a clear cloudless sky on the Uposatha day of the fifteenth, or the full disk of the sun at midday in a clear cloudless sky in autumn in the last month of the rainy season — of these two, which gives off the splendour that is more excellent and sublime?\" — \"The full disk of the sun at midday in a clear cloudless sky in autumn in the last month of the rainy season, venerable sir.\"14\"Beyond this, Kaccāna, I know of very many godswhose splendourthe radiance of the sun and moon does not match, yet I do not say that there is no other splendour higher or more sublime than that splendour. But you, Kaccāna, say of that splendour which is lower and meaner than a glowworm's: ‘This is the perfect splendour,’ yet you do not indicate what that splendour is.\"15\"Kaccāna, there are these five cords of sensual pleasure.[n.788] MA: Even though he was a wanderer, he was keenly intent on sensual pleasures. The Buddha undertook this teaching in order to make him recognise his strong concern with sensual pleasures, and thus the discourse would be beneficial to him.What five? Forms cognizable by the eye that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. Sounds cognizable by the ear … Odours cognizable by the nose … Flavours cognizable by the tongue … Tangibles cognizable by the body that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. These are the five cords of sensual pleasure.\"Now, Kaccāna, the pleasure and joy that arise dependent on these five cords of sensual pleasure are called sensual pleasure. Thus sensual pleasurearisesthrough sensual pleasures, but beyond sensual pleasure there is a pleasure at the peak of the sensual, and that is declared to be the highest among them.\"[n.789] In the Pali this sentence takes the form of a riddle, and the translation here is conjectural.MAexplains that the \"pleasure at the peak of the sensual\" (or \"the highest sensual pleasure,\"kāmaggasukhaṁ) is Nibbāna.16When this was said, the wanderer Vekhanassa said: \"It is wonderful, Master Gotama, it is marvellous, how well that has been expressed by Master Gotama: ‘Thus sensual pleasurearisesthrough sensual pleasures, but beyond sensual pleasure there is a pleasure at the peak of the sensual, and that is declared to be the highest among them.’\"\"Kaccāna, for you who are of another view, who accept another teaching, who approve of another teaching, who pursue a different training, who follow a different teacher, it is hard to know what sensuality is, or what sensual pleasure is, or what the pleasure at the peak of the sensual is. But those bhikkhus who are arahants with taints destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached the true goal, destroyed the fetters of being, and are completely liberated through final knowledge — it is they who would know what sensuality is, what sensual pleasure is, or what the pleasure at the peak of the sensual is.\"17When this was said, the wanderer Vekhanassa was angry and displeased, and he reviled, disparaged, and censured the Blessed One, saying: \"The recluse Gotama will be worsted.\" He then said to the Blessed One: \"So then there are some recluses and brahmins here who, without knowing the past and without seeing the future, yet claim: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.’ What they say turns out to be ridiculous; it turns out to be mere words, empty and hollow.\"\"If any recluses and brahmins, without knowing the past and without seeing the future, yet claim: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being,’ they can be reasonably confuted. Rather, let the past be, Kaccāna, and let the future be. Let a wise man come, one who is honest and sincere, a man of rectitude. I instruct him, I teach him the Dhamma in such a way that by practising as instructed he will soon know and see for himself: ‘Thus, indeed, there rightly comes to be liberation from the bond, that is, from the bond of ignorance.’ Suppose, Kaccāna, there were a young tender infant lying prone, bound by stout bondsat the four limbswith the fifth at the neck; and later on, as a result of his growth and the maturing of his faculties, those bonds loosened, then he would know ‘I am free’ and there would be no more bondage. So too, let a wise man come … ‘Thus, indeed, there rightly comes to be liberation from the bond, that is, from the bond of ignorance.’\"18When this was said, the wanderer Vekhanassa said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. From today let the Blessed One remember me as a lay follower who has gone to him for refuge for life.\"",
    "mn80:13": "\"What do you think, Kaccāna? The full moon at midnight in a clear cloudless sky on the Uposatha day of the fifteenth, or the full disk of the sun at midday in a clear cloudless sky in autumn in the last month of the rainy season — of these two, which gives off the splendour that is more excellent and sublime?\" — \"The full disk of the sun at midday in a clear cloudless sky in autumn in the last month of the rainy season, venerable sir.\"",
    "mn80:14": "\"Beyond this, Kaccāna, I know of very many godswhose splendourthe radiance of the sun and moon does not match, yet I do not say that there is no other splendour higher or more sublime than that splendour. But you, Kaccāna, say of that splendour which is lower and meaner than a glowworm's: ‘This is the perfect splendour,’ yet you do not indicate what that splendour is.\"",
    "mn80:15": "\"Kaccāna, there are these five cords of sensual pleasure.[n.788] MA: Even though he was a wanderer, he was keenly intent on sensual pleasures. The Buddha undertook this teaching in order to make him recognise his strong concern with sensual pleasures, and thus the discourse would be beneficial to him.What five? Forms cognizable by the eye that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. Sounds cognizable by the ear … Odours cognizable by the nose … Flavours cognizable by the tongue … Tangibles cognizable by the body that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. These are the five cords of sensual pleasure.",
    "mn80:16": "When this was said, the wanderer Vekhanassa said: \"It is wonderful, Master Gotama, it is marvellous, how well that has been expressed by Master Gotama: ‘Thus sensual pleasurearisesthrough sensual pleasures, but beyond sensual pleasure there is a pleasure at the peak of the sensual, and that is declared to be the highest among them.’\"",
    "mn80:17": "When this was said, the wanderer Vekhanassa was angry and displeased, and he reviled, disparaged, and censured the Blessed One, saying: \"The recluse Gotama will be worsted.\" He then said to the Blessed One: \"So then there are some recluses and brahmins here who, without knowing the past and without seeing the future, yet claim: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.’ What they say turns out to be ridiculous; it turns out to be mere words, empty and hollow.\"",
    "mn80:18": "When this was said, the wanderer Vekhanassa said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. From today let the Blessed One remember me as a lay follower who has gone to him for refuge for life.\""
}