{
    "mn81:1": "Thus have I heard. On one occasion the Blessed One was wandering among the Kosalans together with a large Saṅgha of bhikkhus.",
    "mn81:2": "\"Once, Ānanda, in this place there was a prosperous and busy market town called Vebhalinga, with many inhabitants and crowded with people. Now the Blessed One Kassapa, accomplished and fully enlightened, lived near the market town Vebhalinga. It was here, in fact, that the Blessed One Kassapa, accomplished and fully enlightened, had his monastery; it was here, in fact, that the Blessed One Kassapa, accomplished and fully enlightened, sat and advised the Saṅgha of bhikkhus.",
    "mn81:3": "\"In Vebhalinga the Blessed One Kassapa, accomplished and fully enlightened, had as a supporter, as his chief supporter, a potter named Ghaṭīkāra. Ghaṭīkāra the potter had as a friend, as his close friend, a brahmin student named Jotipāla.[n.790] At the end of this sutta the Buddha will state that at that time he himself was Jotipāla. AtSN 1:50/i,5–6 the deity Ghaṭīkāra visits the Buddha Gotama and recalls their ancient friendship.",
    "mn81:4": "Then Ghaṭīkāra said to Jotipāla: ‘My dear Jotipāla, there is the monastery of the Blessed One Kassapa, accomplished and fully enlightened, quite nearby. Let us go and see the Blessed One Kassapa, accomplished and fully enlightened. I hold that it is good to see that Blessed One, accomplished and fully enlightened. ’ Jotipāla replied: ‘Enough, my dear Ghaṭīkāra, what is the use of seeing that bald-pated recluse?’",
    "mn81:5": "\"So Ghaṭīkāra the potter and Jotipāla the brahmin student went to the Blessed One Kassapa, accomplished and fully enlightened. Ghaṭīkāra, after paying homage to him, sat down at one side, while Jotipāla exchanged greetings with him, and when this courteous and amiable talk was finished, he too sat down at one side. Ghaṭīkāra then said to the Blessed One Kassapa, accomplished and fully enlightened: ‘Venerable sir, this is the brahmin student Jotipāla, my friend, my close friend. Let the Blessed One teach him the Dhamma.’",
    "mn81:6": "\"Then Jotipāla asked Ghaṭīkāra: ‘Now that you have heard this Dhamma, my dear Ghaṭīkāra, why don’t you go forth from the home life into homelessness?’ — ‘My dear Jotipāla, don’t you know that I support my blind and aged parents?’ — ‘Then, my dear Ghaṭīkāra, I shall go forth from the home life into homelessness.’",
    "mn81:7": "\"Then not long after Jotipāla the brahmin student had received the full admission, a half-month after he had received the full admission, the Blessed One Kassapa, accomplished and fully enlightened, having stayed at Vebhalinga as long as he chose, set out to wander towards Benares. Wandering by stages, he eventually arrived at Benares, and there he went to live in the Deer Park at Isipatana.",
    "mn81:8": "\"Then, it being morning, the Blessed One Kassapa, accomplished and fully enlightened, dressed, and taking his bowl and outer robe, he went with the Saṅgha of bhikkhus to the dwelling of King Kikī of Kāsi and sat down on the seat made ready. Then, with his own hands, King Kikī of Kāsi served and satisfied the Saṅgha of bhikkhus headed by the Buddha with the various kinds of good food. When the Blessed One Kassapa, accomplished and fully enlightened, had eaten and had put his bowl aside, King Kikī of Kāsi took a low seat, sat down at one side and said: ‘Venerable sir, let the Blessed One accept from me a residence for the Rains in Benares; there will be such service to the Saṅgha.’ — ‘Enough, king, my residence for the Rains has already been provided for.’",
    "mn81:9": "‘I have, great king. There is a market town called Vebhalinga where a potter named Ghaṭīkāra lives. He is my supporter, my chief supporter. Now you, great king, thought: \"The Blessed One Kassapa, accomplished and fully enlightened, does not accept from me a residence for the Rains in Benares,\" and you were very disappointed and sad; but the potter Ghaṭīkāra is not and will not be so. The potter Ghaṭīkāra has gone for refuge to the Buddha, the Dhamma, and the Saṅgha. He abstains from killing living beings, from taking what is not given, from misconduct in sensual pleasures, from false speech, and from wine, liquor, and intoxicants, which are the basis of negligence. He has unwavering confidence in the Buddha, the Dhamma, and the Saṅgha, and he possesses the virtues loved by noble ones. He is free from doubt about suffering, about the origin of suffering, about the cessation of suffering, and about the way leading to the cessation of suffering. He eats only one meal a day, he observes celibacy, he is virtuous, of good character. He has laid aside gems and gold, he has given up gold and silver. He does not dig the ground for clay with a pick or with his own hands; what has broken off riverbanks or is thrown up by rats, he brings home in a carrier; when he has made a pot he says: \"Let anyone who likes set down some selected rice or selected beans or selected lentils, and let him take away whatever he likes.\"[n.74] His conduct approximates as closely to that of a monk as is possible for one still leading the household life.MAexplains that he does not trade in the pottery he makes but merely engages in a free exchange of services with his neighbours.He supports his blind and aged parents. Having destroyed the five lower fetters, he is one who will reappear spontaneouslyin the Pure Abodesand there attain final Nibbāna without ever returning from that world.",
    "mn81:10": "\"‘On one occasion when I was living at Vebhalinga, it being morning, I dressed, and taking my bowl and outer robe, I went to the potter Ghaṭīkāra's parents and asked them: \"Where has the potter gone, please?\" — \"Venerable sir, your supporter has gone out; but take rice from the cauldron and sauce from the saucepan and eat.\"",
    "mn81:11": "\"‘On another occasion when I was living at Vebhalinga, it being morning, I dressed, and taking my bowl and outer robe, I went to the potter Ghaṭīkāra's parents and asked them: \"Where has the potter gone, please?\" — \"Venerable sir, your supporter has gone out; but take some porridge from the vessel and sauce from the saucepan and eat.\"",
    "mn81:12": "\"‘On another occasion when I was living at Vebhalinga my hut leaked. Then I addressed the bhikkhus thus: \"Go, bhikkhus, and find out if there is any grass at the potter Ghaṭīkāra's house.\" — \"Venerable sir, there is no grass at the potter Ghaṭīkāra's house; there is the grass thatch over his workshop.\" — \"Go, bhikkhus, and remove the grass from the potter Ghaṭīkāra's workshop.\"",
    "mn81:13": "\"Then King Kikī of Kāsi dispatched to the potter Ghaṭīkāra five hundred cartloads of red rice stored in the sheaf, and also sauce materials to go with it. Then the king's men went to the potter Ghaṭīkāra and told him: ‘Venerable sir, there are five hundred cartloads of red rice stored in the sheaf, and also sauce materials to go with it, dispatched to you by King Kikī of Kāsi; please accept them.’ — ‘The king is very busy and has much to do. I have enough. Let this be for the king himself.’[n.795]MAexplains that he refused because of his fewness of wishes(appicchatā). He realised that the king had sent the foodstuffs because he had heard the Buddha’s report about his own virtues, but he thought: \"I have no need of this. With what I acquire through my work I can support my parents and make offerings to the Buddha.\"",
    "mn81:14": "That is what the Blessed One said. The venerable Ānanda was satisfied and delighted in the Blessed One's words."
}