{
    "mn82:1": "Thus have I heard. On one occasion the Blessed One was wandering in the Kuru country with a large Saṅgha of bhikkhus, and eventually he arrived at a Kuru town named Thullakoṭṭhita.",
    "mn82:2": "Then the brahmin householders of Thullakoṭṭhita went to the Blessed One. Some paid homage to the Blessed One and sat down at one side; some exchanged greetings with him, and when this courteous and amiable talk was finished, sat down at one side; some extended their hands in reverential salutation towards the Blessed One and sat down at one side; some pronounced their name and clan in the Blessed One's presence and sat down at one side; some kept silent and sat down at one side. When they were seated, the Blessed One instructed, urged, roused, and gladdened them with talk on the Dhamma.",
    "mn82:3": "Now at that time a clansman named Raṭṭhapāla, the son of the leading clan in that same Thullakoṭṭhita, was sitting in the assembly.[n.796] Because of his readiness to risk death in order to obtain his parents’ permission to go forth, he was later declared by the Buddha the foremost of those gone forth in faith. His verses are atThag 769–9.Then it occurred to him: \"As I understand the Dhamma taught by the Blessed One, it is not easy while living in a home to lead the holy life, utterly perfect and pure as a polished shell. Suppose I shave off my hair and beard, put on the yellow robe, and go forth from the home life into homelessness.\"",
    "mn82:4": "Then the clansman Raṭṭhapāla rose from his seat, and after paying homage to the Blessed One, he departed, keeping him on his right. He went to his parents and told them: \"Mother and father, as I understand the Dhamma taught by the Blessed One, it is not easy while living in a home to lead the holy life, utterly perfect and pure as a polished shell. I wish to shave off my hair and beard, put on the yellow robe, and go forth from the home life into homelessness. Give me permission to go forth from the home life into homelessness.\"",
    "mn82:5": "For the second time … For the third time the clansman Raṭṭhapāla said to his parents: \"Mother and father … give me permission to go forth from the home life into homelessness.\"",
    "mn82:6": "For the third time his parents replied: \"Dear Raṭṭhapāla … how could we give you our permission to go forth from the home life into homelessness while you are still living?\"",
    "mn82:7": "Then, not receiving his parents’ permission to go forth, the clansman Raṭṭhapāla lay down there on the bare floor, saying: \"Right here I shall either die or receive the going forth.\"",
    "mn82:8": "For the third time his parents said to him: \"Dear Raṭṭhapāla … how could we give you our permission to go forth from the home life into homelessness while you are still living?\" For the third time the clansman Raṭṭhapāla was silent.",
    "mn82:9": "Then the clansman Raṭṭhapāla's friends went to him and said: \"Friend Raṭṭhapāla, you are your parents’ only son, dear and beloved. You have been raised in comfort, brought up in comfort; you know nothing of suffering, friend Raṭṭhapāla. Get up, friend Raṭṭhapāla, eat, drink, and amuse yourself. While eating, drinking, and amusing yourself, you can be happy enjoying sensual pleasures and making merit. Your parents do not permit you to go forth from the home life into homelessness. Even in case of your death they would lose you unwillingly, so how could they give you their permission to go forth from the home life into homelessness while you are still living?\" When this was said, the clansman Raṭṭhapāla was silent.",
    "mn82:10": "For the second time … For the third time his friends said to him: \"Friend Raṭṭhapāla … how could they give you their permission to go forth from the home life into homelessness while you are still living?\" For the third time the clansman Raṭṭhapāla was silent.",
    "mn82:11": "Then the clansman Raṭṭhapāla's friends went to his parents and said to them: \"Mother and father, the clansman Raṭṭhapāla is lying down there on the bare floor, having said: ‘Right here I shall either die or receive the going forth.’ Now if you do not give him your permission to go forth from the home life into homelessness, he will die there. But if you give him your permission, you will see him after he has gone forth. And if he does not enjoy the going forth, what else can he do then but return here? So give him your permission to go forth from the home life into homelessness.\"",
    "mn82:12": "The clansman Raṭṭhapāla then got up, and when he had regained his strength, he went to the Blessed One, and after paying homage to him, he sat down at one side and told him: \"Venerable sir, I have my parents’ permission to go forth from the home life into homelessness. Let the Blessed One give me the going forth.\" Then the clansman Raṭṭhapāla received the going forth under the Blessed One, and he received the full admission.",
    "mn82:13": "Then the venerable Raṭṭhapāla went to the Blessed One, and after paying homage to him, he sat down at one side and told him: \"Venerable sir, I wish to visit my parents, if I have the Blessed One's permission.\"",
    "mn82:14": "Then she went to his mother and said: \"Please know, my lady, that my lord's son Raṭṭhapāla has arrived.\"",
    "mn82:15": "When night had ended, the venerable Raṭṭhapāla's father had good food of various kinds prepared in his own house and had the time announced to the venerable Raṭṭhapāla: \"It is time, dear Raṭṭhapāla, the meal is ready.\"",
    "mn82:16": "When the venerable Raṭṭhapāla had eaten and had put his bowl aside, he stood up and uttered these stanzas:",
    "mn82:17": "\"Behold a puppet here pranked out,[n.800] The verses obviously refer to his former wives, adorned in order to entice him back to the lay life. Strangely, no mention is made of the wives in the portion of the sutta conceived in his pre-ordination days.A body built up out of sores,Sick, an object for concern,Where no stability abides.",
    "mn82:18": "Behold a figure here pranked outWith jewellery and earrings too,A skeleton wrapped up in skin,Made attractive by its clothes.",
    "mn82:19": "Its feet adorned with henna dyeAnd powder smeared upon its face:It may beguile a fool, but notA seeker of the further shore.",
    "mn82:20": "Its hair is dressed in eightfold plaitsAnd unguent smeared upon its eyes:It may beguile a fool, but notA seeker of the further shore.",
    "mn82:21": "A filthy body well adornedLike a new-painted unguent pot:It may beguile a fool, but notA seeker of the further shore.",
    "mn82:22": "The deer-hunter set out the snareBut the deer did not spring the trap;We ate the bait and now departLeaving the hunters to lament.\"",
    "mn82:23": "After the venerable Raṭṭhapāla had stood up and uttered these stanzas, he went to King Koravya's Migācīra garden and sat down at the root of a tree for the day's abiding.",
    "mn82:24": "Then King Koravya addressed his gamekeeper thus: \"Good gamekeeper, tidy up the Migācīra Garden so that we may go to the pleasure garden to see a pleasing spot.\" — \"Yes, sire,\" he replied. Now while he was tidying up the Migācīra Garden, the gamekeeper saw the venerable Raṭṭhapāla seated at the root of a tree for the day's abiding. When he saw him, he went to King Koravya and told him: \"Sire, the Migācīra Garden has been tidied up. The clansman Raṭṭhapāla is there, the son of the leading clan in this same Thullakoṭṭhita, of whom you have always spoken highly;[n.801]MA: Recalling the Elder, the king would speak praise of him in the midst of his army or his harem: \"That young man has done a difficult thing — having abandoned great wealth, he went forth without turning back or looking aside.\"he is seated at the root of a tree for the day's abiding.\"",
    "mn82:25": "\"Master Raṭṭhapāla, there are four kinds of loss. Because they have undergone these four kinds of loss, some people here shave off their hair and beard, put on the yellow robe, and go forth from the home life into homelessness. What are the four? They are loss through ageing, loss through sickness, loss of wealth, and loss of relatives.",
    "mn82:26": "\"And what is loss through sickness? Here, Master Raṭṭhapāla, someone is afflicted, suffering, and gravely ill. He considers thus: ‘I am afflicted, suffering, and gravely ill. It is no longer easy for me to acquire unacquired wealth … … into homelessness.’ Because he has undergone that loss through sickness … he goes forth from the home life into homelessness. This is called loss through sickness. But Master Raṭṭhapāla now is free from illness and affliction; he possesses a good digestion that is neither too cool nor too warm but medium. Master Raṭṭhapāla has not undergone any loss through sickness. What has he known or seen or heard that he has gone forth from the home life into homelessness?",
    "mn82:27": "\"And what is loss of wealth? Here, Master Raṭṭhapāla, someone is rich, of great wealth, of great possessions. Gradually his wealth dwindles away. He considers thus: ‘Formerly I was rich, of great wealth, of great possessions. Gradually my wealth has dwindled away. It is no longer easy for me to acquire unacquired wealth … into homelessness.’ Because he has undergone that loss of wealth … he goes forth from the home life into homelessness. This is called loss of wealth. But Master Raṭṭhapāla is the son of the leading clan in this same Thullakoṭṭhita. Master Raṭṭhapāla has not undergone any loss of wealth. What has he known or seen or heard that he has gone forth from the home life into homelessness?",
    "mn82:28": "\"And what is loss of relatives? Here, Master Raṭṭhapāla, someone has many friends and companions, kinsmen and relatives. Gradually those relatives of his dwindle away. He considers thus: ‘Formerly I had many friends and companions, kinsmen and relatives. Gradually those relatives of mine have dwindled away. It is no longer easy for me to acquire unacquired wealth … … into homelessness.’ Because he has undergone that loss of relatives … he goes forth from the home life into homelessness. This is called loss of relatives. But Master Raṭṭhapāla has many friends and companions, kinsmen and relatives, in this same Thullakoṭṭhita. Master Raṭṭhapāla has not undergone any loss of relatives. What has he known or seen or heard that he has gone forth from the home life into homelessness?",
    "mn82:29": "\"Master Raṭṭhapāla, these are the four kinds of loss. Because they have undergone these four kinds of loss, some people here shave off their hair and beard, put on the yellow robe, and go forth from the home life into homelessness. Master Raṭṭhapāla has not undergone any of these. What has he known or seen or heard that he has gone forth from the home life into homelessness?\"",
    "mn82:30": "\"Great king, there are four summaries of the Dhamma that have been taught by the Blessed One who knows and sees, accomplished and fully enlightened. Knowing and seeing and hearing them, I went forth from the home life into homelessness. What are the four?",
    "mn82:31": "\"Master Raṭṭhapāla said: ‘Life inany world is unstable, it is swept away.’ How should the meaning of that statement be understood?\"",
    "mn82:32": "\"Master Raṭṭhapāla, there exist in this court elephant troops and cavalry and chariot troops and infantry, which will serve to subdue any threats to us. Now Master Raṭṭhapāla said: ‘Life inany world has no shelter and no protector.’ How should the meaning of that statement be understood?\"",
    "mn82:33": "\"Master Raṭṭhapāla, there exist in this court abundant gold coins and bullion stored away in vaults and lofts. Now Master Raṭṭhapāla said: ‘Life inany world has nothing of its own; one has to leave all and pass on.’ How should the meaning of that statement be understood?\"",
    "mn82:34": "\"Now Master Raṭṭhapāla said: ‘Life inany world is incomplete, insatiate, the slave of craving.’ How should the meaning of that statement be understood?\"",
    "mn82:35": "\"What do you think, great king? Suppose a trustworthy and reliable man came to you from the west … from the north … from the south … from across the sea and said: ‘Please know, great king, that I have come from across the sea, and there I saw a large country, powerful and rich … Conquer it then, great king.’ What would you do?\"",
    "mn82:36": "That is what the venerable Raṭṭhapāla said. And having said that he said further:",
    "mn82:37": "\"I see men wealthy in the world, who yetFrom ignorance give not their gathered wealth.Greedily they hoard away their richesLonging still for further sensual pleasures.",
    "mn82:38": "A king who has conquered the earth by forceAnd rules over the land the ocean boundsIs yet unsated with the sea's near shoreAnd hungers for its further shore as well.",
    "mn82:39": "Most other people too, not just a king,Encounter death with craving unabated;With plansstill incomplete they leave the corpse;Desires remain unsated in the world.",
    "mn82:40": "His relatives lament and rend their hair,Crying, ‘Ah me! Alas! Our love is dead!’They bear away the body wrapped in shroudsTo place it on a pyre and burn it there.",
    "mn82:41": "Clad in a shroud, he leaves his wealth behind,Prodded with stakes he burnsupon the pyre.And as he dies, no relatives or friendsCan offer him shelter and refuge here.",
    "mn82:42": "While his heirs take over his wealth, this beingMust pass on according to his actions;And as he dies nothing can follow him;Not child nor wife nor wealth nor royal estate.",
    "mn82:43": "Longevity is not acquired with wealthNor can prosperity banish old age;Short is this life, as all the sages say,Eternity it knows not, only change.",
    "mn82:44": "The rich and poor alike shall feelDeath'stouch,The fool and sage as well shall feel it too;But while the fool lies stricken by his folly,No sage will ever tremble at the touch.",
    "mn82:45": "Better is wisdom here than any wealth,Since by wisdom one gains the final goal.For people through ignorance do evil deedsWhile failing to reach the goal from life to life.",
    "mn82:46": "As one goes to the womb and the next world,Renewing the successive round of births,Another of little wisdom, trusting him,Goes also to the womb and the next world.",
    "mn82:47": "Just as a robber caught in burglaryIs made to suffer for his evil deed,So people after death, in the next world,Are made to suffer for their evil deeds.",
    "mn82:48": "Sensual pleasures, varied, sweet, delightful,In many different ways disturb the mind:Seeing the danger in these sensual tiesI chose to lead the homeless life, O King.",
    "mn82:49": "As fruits fall from the tree, so people too,Both young and old, fall when this body breaks.Seeing this too, O King, I have gone forth:Better is the recluse's life assured.\""
}