{
    "mn83:1": "Thus have I heard.[n.806] See Makhādeva Jātaka (No. 9) and Nimi Jātaka (No. 54). King Makhādeva and King Nimi were earlier births of the Buddha Gotama.On one occasion, the Blessed One was living at Mithilā in the Makhādeva Mango Grove.[n.807] The grove was originally planted by Makhādeva and thus was still named after him.",
    "mn83:2": "\"Once, Ānanda, in this same Mithilā there was a king named Makhādeva. He was a righteous king who ruled by the Dhamma, a great king who was established in the Dhamma.[n.808]MA: He was established in the ten wholesome courses of action.He conducted himself by the Dhamma among brahmins and householders, among town-dwellers and countryfolk, and he observed the Uposatha days on the fourteenth, fifteenth, and eighth of the fortnight.[n.809] The Uposatha is the religious observance day of ancient India, also absorbed as such into Buddhism. Seen.59.",
    "mn83:3": "\"Then King Makhādeva gave the boon of a village to his barber, and calling the prince, his eldest son, he said: ‘Dear prince, the divine messengers have appeared;[n.811] On the \"divine messengers\" — the foretokens of old age, illness, and death — seeMN 10.grey hairs are seen growing on my head. I have enjoyed human sensual pleasures; now it is time to seek divine sensual pleasures. Come, dear prince, take over the kingship. I shall shave off my hair and beard, put on the yellow robe, and go forth from the home life into homelessness. And now, dear prince, when you too see grey hairs growing on your head, then after giving the boon of a village to your barber, and after carefully instructing the prince, your eldest son, in kingship, shave off your hair and beard, put on the yellow robe, and go forth from the home life into homelessness. Continue this good practice instituted by me and do not be the last man. Dear prince, when there are two men living, he under whom there occurs a breach of this good practice — he is the last man among them. Therefore, dear prince, I say to you: Continue this good practice instituted by me and do not be the last man.’",
    "mn83:4": "\"Then, after giving the boon of a village to his barber and after carefully instructing the prince, his eldest son, in kingship, in the Makhādeva Mango Grove he shaved off his hair and beard, put on the yellow robe, and went forth from the home life into homelessness.",
    "mn83:5": "\"For eighty-four thousand years King Makhādeva played childish games; for eighty-four thousand years he acted as viceregent; for eighty-four thousand years he governed the kingdom; for eighty-four thousand years he led the holy life in this Makhādeva Mango Grove after shaving off his hair and beard, putting on the yellow robe, and going forth from the home life into homelessness. By developing the four divine abodes, on the dissolution of the body, after death, he passed on to the Brahma-world.",
    "mn83:6–8": "\"Now at the end of many years, many hundred years, many thousand years, King Makhādeva's son addressed his barber thus:…as above, reading \"King Makhādeva's son\" throughout… By developing the four divine abodes, on the dissolution of the body, after death, he passed on to the Brahma-world.",
    "mn83:9": "\"The descendants of King Makhādeva's son to the number of eighty-four thousand kings in succession, after shaving off their hair and beard and putting on the yellow robe, went forth from the home life into homelessness in this Makhādeva Mango Grove. They abided pervading one quarter with a mind imbued with loving-kindness … with compassion … with altruistic joy … with equanimity … without ill will.",
    "mn83:10": "\"Once, Ānanda, when the gods of the Thirty-three had met together and were seated in the Sudhamma Assembly, this discussion arose among them: ‘It is a gain, sirs, for the people of Videha, it is a great gain for the people of Videha that their King Nimi is a righteous king who rules by the Dhamma, a great king who is established in the Dhamma. He conducts himself by the Dhamma among brahmins and householders, among town-dwellers and countryfolk, and he observes the Uposatha days on the fourteenth, fifteenth, and eighth of the fortnight.’",
    "mn83:11": "Then, just as quickly as a strong man might extend his flexed arm or flex his extended arm, Sakka, ruler of gods, vanished in the presence of King Nimi and appeared among the gods of the Thirty-three.",
    "mn83:12–13": "\"Then Sakka, ruler of gods, told the charioteer Mātali: ‘Come, good Mātali, prepare the chariot harnessed to a thousand thoroughbreds and drive King Nimi back to Mithilā.’",
    "mn83:14": "\"Now, Ānanda, it may be that you think thus: ‘Certainly, on that occasion someone else was King Makhādeva, who instituted that good practice.’ But it should not be regarded thus. I was King Makhādeva on that occasion. I instituted that good practice and later generations continued that good practice instituted by me. But that kind of good practice does not lead to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbāna, but only to reappearance in the Brahma-world. But there is this kind of good practice that has been instituted by me now, which leads to complete disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbāna. And what is that good practice? It is this Noble Eightfold Path; that is, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. This is the good practice instituted by me now, which leads to complete disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbāna.",
    "mn83:15": "That is what the Blessed One said. The venerable Ānanda was satisfied and delighted in the Blessed One's words."
}