{
    "mn87:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn87:2": "Now on that occasion some gamblers were playing with dice not far from the Blessed One. Then the householder went to those gamblers and said: \"Just now, sirs, I went to the recluse Gotama, and after paying homage to him, I sat down at one side. When I had done so, the recluse Gotama said to me: ‘Householder, your faculties are not those of one in control of his own mind.’ …repeat the entire conversation as above… ‘Venerable sir, happiness and joy are born from those who are dear, arise from those who are dear.’ Then, displeased with the recluse Gotama's words, disapproving of them, I rose from my seat and left.\"",
    "mn87:3": "Then King Pasenadi of Kosala told Queen Mallikā: \"This is what has been said by the recluse Gotama, Mallikā: ‘Sorrow, lamentation, pain, grief, and despair are born from those who are dear, arise from those who are dear.’\"",
    "mn87:4": "Then Queen Mallikā addressed the brahmin Nāḷijaṅgha: \"Come, brahmin, go to the Blessed One and pay homage in my name with your head at his feet, and ask whether he is free from illness and affliction and is healthy, strong, and abiding in comfort, saying: ‘Venerable sir, Queen Mallikā pays homage with her head at the Blessed One's feet and asks whether the Blessed One is free from illness … and abiding in comfort.’ Then say this: ‘Venerable sir, have these words been uttered by the Blessed One: \"Sorrow, lamentation, pain, grief, and despair are born from those who are dear, arise from those who are dear\"?’ Learn well what the Blessed One replies and report it to me; for Tathāgatas do not speak untruth.\"",
    "mn87:5": "\"So it is, brahmin, so it is! Sorrow, lamentation, pain, grief, and despair are born from those who are dear, arise from those who are dear.",
    "mn87:6": "Once in this same Sāvatthī there was a certain woman whose father died … whose brother died … whose sister died … whose son died … whose daughter died … whose husband died. Owing to her husband's death, she went mad, lost her mind, and wandered from street to street and from crossroad to crossroad, saying: ‘Have you seen my husband? Have you seen my husband?’",
    "mn87:7": "Once in this same Sāvatthī there was a certain man whose mother died …",
    "mn87:8": "… whose father died … whose brother died … whose sister died … whose son died … whose daughter died … whose wife died. Owing to his wife's death, he went mad, lost his mind, and wandered from street to street and from crossroad to crossroad, saying: ‘Have you seen my wife? Have you seen my wife?’",
    "mn87:9": "Once in this same Sāvatthī there was a certain woman who went to live with her relatives’ family. Her relatives wanted to divorce her from her husband and give her to another whom she did not want. Then the woman said to her husband: ‘Lord, these relatives of mine want to divorce me from you and give me to another whom I do not want.’ Then the man cut the woman in two and disemboweled himself, thinking: ‘We shall be together in the after-life. ’ It can also be understood from this how sorrow, lamentation, pain, grief, and despair are born from those who are dear, arise from those who are dear.\"",
    "mn87:10": "Then, delighting and rejoicing in the Blessed One's words, the brahmin Nāḷijaṅgha rose from his seat, went to Queen Mallikā, and reported to her his entire conversation with the Blessed One. Then Queen Mallikā went to King Pasenadi of Kosala and asked him:",
    "mn87:11": "\"What do you think, sire? Is Princess Vajīrī dear to you?\"",
    "mn87:12–14": "\"What do you think, sire? Is the noble Queen Vāsabhā dear to you? … Is General Viḍūḍabha dear to you? … … Am I dear to you? …",
    "mn87:15": "… Are Kāsi and Kosala dear to you?\"[n.829] Viḍūḍabha was the king's son, who eventually overthrew him. Kāsi and Kosala are lands over which the king ruled.",
    "mn87:16": "\"It is wonderful, Mallikā, it is marvellous how far the Blessed One penetrates with wisdom and sees with wisdom! Come, Mallikā, give me the ablution water.\"[n.830]MA: He used this to wash his hands and feet and clean his mouth before saluting the Buddha.",
    "mn87:17": "\"Honour to the Blessed One, accomplished and fully enlightened!",
    "mn87:18": "Honour to the Blessed One, accomplished and fully enlightened!",
    "mn87:19": "Honour to the Blessed One, accomplished and fully enlightened!\""
}