{
    "mn88:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn88:2": "Then King Pasenadi of Kosala told a man: \"Come, good man, go to the venerable Ānanda and pay homage in my name with your head at his feet, saying: ‘Venerable sir, King Pasenadi of Kosala pays homage with his head at the venerable Ānanda's feet.’ Then say this: ‘Venerable sir, if the venerable Ānanda has no urgent business, perhaps the venerable Ānanda would wait a moment, out of compassion.’\"",
    "mn88:3": "Then King Pasenadi went by elephant as far as the elephant could go, and then he dismounted and went to the venerable Ānanda on foot. After paying homage to him, he stood at one side and said to the venerable Ānanda: \"If, venerable sir, the venerable Ānanda has no urgent business, it would be good if he would go to the bank of the river Aciravatī, out of compassion.\"",
    "mn88:4": "He went to the bank of the river Aciravatī and sat down at the root of a tree on a seat made ready. Then King Pasenadi went by elephant as far as the elephant could go, and then he dismounted and went to the venerable Ānanda on foot. After paying homage to him, he stood at one side and said to the venerable Ānanda: \"Here, venerable sir, is an elephant rug. Let the venerable Ānanda be seated on it.\"",
    "mn88:5": "\"Would the Blessed One, venerable Ānanda, behave with speech … behave with the mind in such a way that he could be censured by recluses and brahmins?\"",
    "mn88:6": "\"It is wonderful, venerable sir, it is marvellous! For what we were unable to accomplish with a question has been accomplished by the venerable Ānanda with the answer to the question. We do not recognise anything of value in the praise and blame of others spoken by foolish ignorant persons, who speak without having investigated and evaluated; but we recognise as valuable the praise and blame of others spoken by wise, intelligent, and sagacious persons who speak after having investigated and evaluated.",
    "mn88:7": "\"Now, venerable Ānanda, what kind of bodily behaviour is censured by wise recluses and brahmins?\"[n.832] Briefly, this passage offers five criteria of evil actions:unwholesomenessunderscores the psychological quality of the action, its unhealthy effect upon the mind; its beingblameworthyunderscores its morally detrimental nature; its capacity to producepainful resultscalls attention to its undesirable kammic potential; and the last statement calls attention to both its evilmotivationand the harmful long-raṅgeconsequencessuch action entails for both oneself and others. The opposite explanation applies to good action, discussed in ¶18.",
    "mn88:8": "\"Now, venerable Ānanda, what kind of bodily behaviour is unwholesome?\"",
    "mn88:9": "\"Now, venerable Ānanda, what kind of bodily behaviour is blameworthy?\"",
    "mn88:10": "\"Now, venerable Ānanda, what kind of bodily behaviour brings affliction?\"",
    "mn88:11": "\"Now, venerable Ānanda, what kind of bodily behaviour has painful results?\"",
    "mn88:12": "\"Now, venerable Ānanda, what kind of verbal behaviour … mental behaviour is censured by wise recluses and brahmins?\" \"Any mental behaviour that is unwholesome, great king.\"",
    "mn88:13": "\"Now, venerable Ānanda, what kind of mental behaviour is unwholesome?\"",
    "mn88:14": "\"Now, venerable Ānanda, what kind of mental behaviour is blameworthy?\"",
    "mn88:15": "\"Now, venerable Ānanda, what kind of mental behaviour brings affliction?\"",
    "mn88:16": "\"Now, venerable Ānanda, what kind of mental behaviour has painful results?\"",
    "mn88:17": "\"Now, venerable Ānanda, does the Blessed One praise only the abandoning of all unwholesome states?\" \"The Tathāgata, great king, has abandoned all unwholesome states and he possesses wholesome states.\"[n.833]MA: Ven. Ānanda's answer goes beyond the question, for he shows not only that the Buddha praises the abandoning of all unwholesome states, but that he acts in accordance with his word by having abandoned all unwholesome states as well.",
    "mn88:18": "\"Now, venerable Ānanda, what kind of bodily behaviour is uncensured by wise recluses and brahmins?\"",
    "mn88:19": "\"Now, venerable Ānanda, what kind of bodily behaviour is wholesome?\"",
    "mn88:20": "\"Now, venerable Ānanda, what kind of bodily behaviour is blameless?\"",
    "mn88:21": "\"Now, venerable Ānanda, what kind of bodily behaviour does not bring affliction?\"",
    "mn88:22": "\"Now, venerable Ānanda, what kind of bodily behaviour has pleasant results?\"",
    "mn88:23": "\"Now, venerable Ānanda, what kind of verbal behaviour … mental behaviour is uncensured by wise recluses and brahmins?\"",
    "mn88:24": "\"Now, venerable Ānanda, what kind of metal behaviour is wholesome?\"",
    "mn88:25": "\"Now, venerable Ānanda, what kind of mental behaviour is blameless?\"",
    "mn88:26": "\"Now, venerable Ānanda, what kind of mental behaviour does not bring affliction?\"",
    "mn88:27": "\"Now, venerable Ānanda, what kind of mental behaviour has pleasant results?\"",
    "mn88:28": "\"Now, venerable Ānanda, does the Blessed One praise only the undertaking of all wholesome states?\"",
    "mn88:29": "\"It is wonderful, venerable sir, it is marvellous how well that has been expressed by the venerable Ānanda! And we are satisfied and pleased by what has been so well expressed by him. Venerable sir, we are so satisfied and pleased with what has been so well expressed by the venerable Ānanda that if the elephant-treasure were allowed to him, we would give it to him; if the horse-treasure were allowed to him, we would give it to him; if the boon of a village were allowed to him, we would give it to him. But we know, venerable sir, that these are not allowable for the venerable Ānanda. But there is this cloak of mine,[n.834]MAexplains the wordbāhitikā,after which the sutta is named, as a cloak produced in a foreign country.venerable sir, which was sent to me packed in a royal umbrella case by King Ajātasattu of Magadha, sixteen hands long and eight hands wide. Let the venerable Ānanda accept it out of compassion.\"",
    "mn88:30": "\"Venerable sir, this river Aciravatī has been seen both by the venerable Ānanda and by ourselves when a great cloud has rained heavily on the mountains; then this river Aciravatī overflows both its banks. So too, venerable sir, the venerable Ānanda can make a triple robe for himself out of this cloak, and he can share out his old triple robe among his companions in the holy life. In this way, our offering will overflow. Venerable sir, let the venerable Ānanda accept the cloak.\"",
    "mn88:31": "Then King Pasenadi of Kosala said: \"And now, venerable sir, we depart. We are busy and have much to do.\"",
    "mn88:32": "Then soon after he had left, the venerable Ānanda went to the Blessed One, and after paying homage to him, he sat down at one side, related to him his entire conversation with King Pasenadi of Kosala, and presented the cloak to the Blessed One.",
    "mn88:33": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}