{
    "mn90:1": "Thus have I heard. On one occasion the Blessed One was living at Ujuññā, in the Kaṇṇakatthala Deer Park.",
    "mn90:2": "The sisters Somā and Sakulā[n.845]MA:These two sisters are the king's wivesnot his sisters!.heard: \"Today King Pasenadi of Kosala will go to see the Blessed One after he has had his breakfast.\"",
    "mn90:3": "Then, when he had finished his breakfast, King Pasenadi of Kosala went to the Blessed One, and after paying homage to him, he sat down at one side and delivered the message of the sisters Somā and Sakulā.",
    "mn90:4": "Then King Pasenadi of Kosala said to the Blessed One: \"Venerable sir, I have heard this: ‘The recluse Gotama says: \"There is no recluse or brahmin who is omniscient and all-seeing, who can claim to have complete knowledge and vision; that is not possible.\"’ Venerable sir, do those who speak thus say what has been said by the Blessed One, and not misrepresent him with what is contrary to fact? Do they explain in accordance with the Dhamma in such a way that nothing that provides a ground for censure can be legitimately deduced from their assertions?\"",
    "mn90:5": "Then King Pasenadi of Kosala addressed General Viḍūḍabha: \"General, who introduced this story into the palace?\" \"It was Sañjaya, sire, the brahmin of the Ākāsa clan.\"",
    "mn90:6": "\"Great king, there are these five factors of striving.[n.848] As atMN 85.58.What five? Here a bhikkhu has faith, he places his faith in the Tathāgata's enlightenment thus: ‘The Blessed One is accomplished, fully enlightened, perfect in true knowledge and conduct, sublime, knower of worlds, incomparable leader of persons to be tamed, teacher of gods and humans, enlightened, blessed.’ Then he is free from illness and affliction, possessing a good digestion that is neither too cool nor too warm but medium and able to bear the strain of striving. Then he is honest and sincere, and shows himself as he actually is to his teacher and his companions in the holy life. Then he is energetic in abandoning unwholesome states and in undertaking wholesome states, steadfast, launching his effort with firmness and persevering in cultivating wholesome states. Then he is wise; he possesses wisdom regarding rise and disappearance that is noble and penetrative and leads to the complete destruction of suffering. These are the five factors of striving.",
    "mn90:7": "\"What the Blessed One has said appears reasonable, what the Blessed One has said appears to be supported by reason.",
    "mn90:8": "When this was said, General Viḍūḍabha asked the Blessed One: \"Venerable sir, can those gods who are still subject to ill will and who come back to thishumanstate topple or banish from that place those gods who are no longer subject to ill will and who do not come back to thishumanstate?\"",
    "mn90:9": "Then the venerable Ānanda thought: \"This General Viḍūḍabha is the son of King Pasenadi of Kosala, and I am the son of the Blessed One. This is the time for one son to talk with the other.\" He said to General Viḍūḍabha: \"General, I shall ask you a question in return. Answer it as you choose. General, what do you think? There is the whole extent of King Pasenadi of Kosala's realm, where he exercises lordship and sovereignty; now can King Pasenadi of Kosala topple or banish from that place any recluse or brahmin, irrespective of whether that recluse or brahmin has merit or not and whether he leads the holy life or not?\"",
    "mn90:10": "\"What do you think, general? There is the whole extent that is not King Pasenadi of Kosala's realm, where he does not exercise lordship and sovereignty; now can King Pasenadi of Kosala topple or banish from that place any recluse or brahmin, irrespective of whether that recluse or brahmin has merit or not and whether he leads the holy life or not?\"",
    "mn90:11": "\"General, what do you think? Have you heard of the gods of the Thirty-three?\"",
    "mn90:12": "Then King Pasenadi of Kosala asked the Blessed One: \"Venerable sir, what is this bhikkhu's name?\"",
    "mn90:13": "King Pasenadi of Kosala said to the Blessed One: \"Venerable sir, we have asked the Blessed One about omniscience, and the Blessed One has answered about omniscience; we approve of and accept that answer, and so we are satisfied. We have asked the Blessed One about purification in the four castes, and the Blessed One has answered about purification in the four castes; we approve of and accept that answer, and so we are satisfied. We have asked the Blessed One about the gods, and the Blessed One has answered about the gods; we approve of and accept that answer, and so we are satisfied. We have asked the Blessed One about the Brahmās, and the Blessed One has answered about the Brahmās; we approve of and accept that answer, and so we are satisfied. Whatever we asked the Blessed One, that the Blessed One has answered; we approve of and accept those answers, and so we are satisfied. And now, venerable sir, we depart. We are busy and have much to do.\""
}