{
    "mn91:1": "Thus have I heard. On one occasion the Blessed One was wandering in the country of the Videhans with a large Saṅgha of bhikkhus, with five hundred bhikkhus.",
    "mn91:2": "Now at that time the brahmin Brahmāyu had a young brahmin student named Uttarā who was a master of the Three Vedas … fully versed in natural philosophy and in the marks of a Great Man. He told his student: \"My dear Uttarā, the recluse Gotama, the son of the Sakyans who went forth from a Sakyan clan, has been wandering in the country of the Videhans with a large Saṅgha of bhikkhus, with five hundred bhikkhus … Now it is good to see such arahants. Come, my dear Uttarā, go to the recluse Gotama and find out whether the report spread about him is true or not, and whether Master Gotama is one such as this or not. Thus we shall know about Master Gotama through you.\"",
    "mn91:3": "\"Yes, sir,\" he replied. He rose from his seat, and after paying homage to the brahmin Brahmāyu, keeping him on his right, he left for the country of the Videhans, where the Blessed One was wandering. Travelling by stages, he came to the Blessed One and exchanged greetings with him. When this courteous and amiable talk was finished, he sat down at one side and looked for the thirty-two marks of a Great Man on the Blessed One's body. He saw, more or less, the thirty-two marks of a Great Man on the Blessed One's body, except two; he was doubtful and uncertain about two of the marks, and he could not decide and make up his mind about them: about the male organ being enclosed in a sheath and about the largeness of the tongue.",
    "mn91:4": "At the end of the seven months in the country of the Videhans, he set out to journey to Mithilā where the brahmin Brahmāyu was. When he arrived, he paid homage to him and sat down at one side. Thereupon, the brahmin Brahmāyu asked him: \"Well, my dear Uttarā, is the report that has been spread about Master Gotama true or not? And is Master Gotama one such as this or not?\"",
    "mn91:5": "Master Gotama sets his foot down squarely — this is a mark of a Great Man in Master Gotama.",
    "mn91:6": "On the soles of his feet there are wheels with a thousand spokes and ribs and hubs all complete …",
    "mn91:7": "He has projecting heels …",
    "mn91:8": "He has long fingers and toes …",
    "mn91:9": "His hands and feet are soft and tender …",
    "mn91:10": "He has netted hands and feet …",
    "mn91:11": "His feet are arched …",
    "mn91:12": "He has legs like an antelope's …",
    "mn91:13": "When he stands without stooping, the palms of both his hands touch and rub against his knees …",
    "mn91:14": "His male organ is enclosed in a sheath …",
    "mn91:15": "He is the colour of gold, his skin has a golden sheen …",
    "mn91:16": "He is fine-skinned, and because of the fineness of his skin, dust and dirt do not stick on his body …",
    "mn91:17": "His body-hairs grow singly, each body-hair growing alone in a hair socket …",
    "mn91:18": "The tips of his body-hairs turn up; the up-turned body-hairs are blue-black, the colour of collyrium, curled and turned to the right …",
    "mn91:19": "He has the straight limbs of a Brahmā …",
    "mn91:20": "He has seven convexities …[n.855] The seven are the backs of the four limbs, the two shoulders, and the trunk.",
    "mn91:21": "He has the torso of a lion …",
    "mn91:22": "The furrow between his shoulders is filled in …",
    "mn91:23": "He has the spread of a banyan tree; the span of his arms equals the height of his body, and the height of his body equals the span of his arms …",
    "mn91:24": "His neck and his shoulders are even …",
    "mn91:25": "His taste is supremely acute …[n.856]Rasaggasaggī.The Lakkhaṇa Sutta expands (DN 30.2.7/ iii.166): \"Whatever he touches with the tip of his tongue he tastes in his throat, and the taste is dispersed everywhere.\" It is difficult, however, to understand either how this quality could be considered a physical characteristic or how it could be perceived by others.",
    "mn91:26": "He is lion-jawed …",
    "mn91:27": "He has forty teeth …",
    "mn91:28": "His teeth are even …",
    "mn91:29": "His teeth are without gaps …",
    "mn91:30": "His teeth are quite white …",
    "mn91:31": "He has a large tongue …",
    "mn91:32": "He has a divine voice, like the call of the Karavīka bird …",
    "mn91:33": "His eyes are deep blue …",
    "mn91:34": "He has the eyelashes of an ox …",
    "mn91:35": "He has hair growing in the space between his eyebrows, which is white with the sheen of soft cotton …",
    "mn91:36": "His head is shaped like a turban — this is a mark of a Great Man in Master Gotama.[n.857] This mark, theuṇhīsa,accounts for the protuberance commonly seen on the top of the head of Buddha images.",
    "mn91:37": "Master Gotama is endowed with these thirty-two marks of a Great Man.",
    "mn91:38": "\"When he walks, he steps out with the right foot first. He does not extend his foot too far or put it down too near. He walks neither too quickly nor too slowly. He walks without his knees knocking together. He walks without his ankles knocking together. He walks without raising or lowering his thighs, or bringing them together or keeping them apart. When he walks, only the lower part of his body oscillates, and he does not walk with bodily effort. When he turns to look, he does so with his whole body. He does not look straight up; he does not look straight down. He does not walk looking about. He looks a plough-yoke's length before him; beyond that he has unhindered knowledge and vision.",
    "mn91:39": "The food he takes has eight factors: it is neither for amusement nor for intoxication nor for the sake of physical beauty and attractiveness, but only for the endurance and continuance of his body, for the ending of discomfort, and for assisting the holy life; he considers: ‘Thus I shall terminate old feelings without arousing new feelings and I shall be healthy and blameless and shall live in comfort.’[n.858] This is the standard reflection on the proper use of almsfood, as atMN 2.14.",
    "mn91:40": "\"We have seen Master Gotama walking, sir, we have seen him standing, we have seen him entering indoors, we have seen him indoors seated in silence, we have seen him eating indoors, we have seen him seated in silence after eating, we have seen him giving the blessing after eating, we have seen him going to the monastery, we have seen him in the monastery seated in silence, we have seen him in the monastery teaching the Dhamma to an audience. Such is the Master Gotama; such he is, and more than that.\"[n.860] I here follow BBS, which is fuller than SBJ and PTS.MA: This is the intention: \"The excellent qualities I have not described are far more numerous than those I have described. The excellent qualities of Master Gotama are like the great earth and the great ocean; expounded in detail they are infinite and immeasurable, like space.\"",
    "mn91:41": "When this was said, the brahmin Brahmāyu rose from his seat, and after arranging his upper robe on one shoulder, he extended his hands in reverential salutation towards the Blessed One and uttered this exclamation three times:",
    "mn91:42": "\"Honour to the Blessed One, accomplished and fully enlightened!",
    "mn91:43": "Honour to the Blessed One, accomplished and fully enlightened!",
    "mn91:44": "Honour to the Blessed One, accomplished and fully enlightened!",
    "mn91:45": "Perhaps sometime or other we might meet Master Gotama, perhaps we might have some conversation with him.\"",
    "mn91:46": "Then, in the course of his wandering, the Blessed One eventually arrived at Mithilā. There the Blessed One lived in Makhādeva's Mango Grove. The brahmin householders of Mithil̄ heard: \"The recluse Gotama, the son of the Sakyans who went forth from a Sakyan clan, has been wandering in the country of the Videhans with a large Saṅgha of bhikkhus, with five hundred bhikkhus, and he has now come to Mithilā and is living in Makhādeva's Mango Grove. Now a good report of Master Gotama has been spread to this effect …as in verse 3 above… Now it is good to see such arahants.\"",
    "mn91:47": "Then the brahmin householders of Mithilā went to the Blessed One. Some paid homage to the Blessed One and sat down at one side; some exchanged greetings with him, and when this courteous and amiable talk was finished, sat down at one side; some extended their hands in reverential salutation towards him and sat down at one side; some pronounced their name and clan in the Blessed One's presence and sat down at one side; some kept silent and sat down at one side.",
    "mn91:48": "The brahmin Brahmāyu heard: \"The recluse Gotama, the son of the Sakyans who went forth from the Sakyan clan, has arrived in Mithilā and is living in Makhādeva's Mango Grove in Mithilā.\"",
    "mn91:49": "\"Yes, sir,\" the brahmin student replied. He went to the Blessed One and exchanged greetings with him, and when this courteous and amiable talk was finished, he stood at one side and delivered his message.The Blessed One said:",
    "mn91:50": "Then he went to the Blessed One and exchanged greetings with him, and when this courteous and amiable talk was finished, he sat down at one side and looked for the thirty-two marks of a Great Man on the Blessed One's body. He saw, more or less, the thirty-two marks of a Great Man on the Blessed One's body, except two; he was doubtful about two of the marks, and he could not decide and make up his mind about them: about the male organ being enclosed in a sheath and about the largeness of the tongue.",
    "mn91:51": "Then the brahmin Brahmāyu addressed the Blessed One in stanzas:",
    "mn91:56": "Then it occurred to the Blessed One: \"This brahmin Brahmāyu sees, more or less, the thirty-two marks of a Great Man on me, except two; he is doubtful and uncertain about two of the marks, and he cannot decide and make up his mind about them: about the male organ being enclosed in a sheath and about the largeness of the tongue.\"",
    "mn91:57": "\"The two-and-thirty marks you learnedThat are the signs of a Great Man —All on my body can be found:So, brahmin, doubt no more on that.",
    "mn91:58": "What must be known I’ve directly known,What must be developed I have developed,What must be abandoned I have abandoned,Therefore, brahmin, I am a Buddha.[n.862] What must be directly known(abhiññeyya)are the Four Noble Truths, what must be developed(bhāvetabba)is the Noble Eightfold Path, and what must be abandoned(pahātabba)are the defilements headed by craving. Here the context requires that the word \"Buddha\" be understood in the specific sense of a Fully Enlightened One(sammāsambuddha).",
    "mn91:59": "For welfare in this very lifeAnd happiness in lives to come,Since leave is given you, please askWhatever you aspire to know.\"",
    "mn91:60": "Then the brahmin Brahmāyu thought: \"Permission has been granted me by the recluse Gotama. Which should I ask him about: good in this life or good in the lives to come?\" Then he thought: \"I am skilled in the good of this life, and others too ask me about good in this life. Why shouldn’t I ask him only about good in the lives to come?\" Then he addressed the Blessed One in stanzas:",
    "mn91:61": "\"How does one become a brahmin?And how does one attain to knowledge?[n.863]Vedagū.This term and the following two —tevijjaandsotthiya— seem to have represented ideal types among the brahmins; see tooMN 39.24, 26, and 27. The sixth and seventh terms —kevalīandmuni— were probably ideal types among the non-Vedic ascetic orders. By his reply, the Buddha endows these terms with new meanings derived from his own spiritual system.How has one the triple knowledge?And how is one called a holy scholar?",
    "mn91:62": "How does one become an arahant?And how does one attain completeness?How is one a silent sage?And how is one called a Buddha?\"[n.864] Here and in the reply the word \"Buddha\" may signify simply one who is enlightened or awakened, in a sense applicable to any arahant, though Brahmāyu's response also suggests it may be intended in the narrower sense of a Fully Enlightened One.",
    "mn91:63": "Then the Blessed One spoke these stanzas in reply:",
    "mn91:64": "\"Who knows about his former lives,Sees heaven and states of deprivation,And has arrived at birth's destruction —A sage who knows by direct knowledge,",
    "mn91:65": "Who knows his mind is purified,Entirely freed from every lust,Who has abandoned birth and death,Who is complete in the holy life,Who has transcended everything —One such as this is called a Buddha.\"[n.8]MAoffers an involved explanation of how the Buddha’s reply answers all eight of Brahmāyu's questions.",
    "mn91:66": "When this was said, the brahmin Brahmāyu rose from his seat, and after arranging his upper robe on one shoulder, he prostrated himself with his head at the Blessed One's feet, and he covered the Blessed One's feet with kisses and caressed them with his hands, pronouncing his name: \"I am the brahmin Brahmāyu, Master Gotama; I am the brahmin Brahmāyu, Master Gotama.\"",
    "mn91:67": "The Blessed One then gave him progressive instruction,[n.866] As atMN 56.18.that is, talk on giving, talk on virtue, talk on the heavens; he explained the danger, degradation, and defilement in sensual pleasures and the blessing of renunciation. When he knew that the brahmin Brahmāyu's mind was ready, receptive, free from hindrances, elated, and confident, he expounded to him the teaching special to the Buddhas: suffering, its origin, its cessation, and the path. Just as a clean cloth with all marks removed would take dye evenly, so too, while the brahmin Brahmāyu sat there, the spotless immaculate vision of the Dhamma arose in him: \"All that is subject to arising is subject to cessation.\"",
    "mn91:68": "Then the brahmin Brahmāyu saw the Dhamma, attained the Dhamma, understood the Dhamma, fathomed the Dhamma; he crossed beyond doubt, did away with perplexity, gained intrepidity, and became independent of others in the Teacher's Dispensation. Then he said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. From today let Master Gotama remember me as a lay follower who has gone to him for refuge for life. Let the Blessed One, together with the Saṅgha of bhikkhus, consent to accept tomorrow's meal from me.\"",
    "mn91:69": "Then, it being morning, the Blessed One dressed, and taking his bowl and outer robe, he went with the Saṅgha of bhikkhus to the brahmin Brahmāyu's residence and sat down on the seat made ready. Then, for a week, with his own hands, the brahmin Brahmāyu served and satisfied the Saṅgha of bhikkhus headed by the Buddha with various kinds of good food.",
    "mn91:70": "That is what the Blessed One said. The bhikkhus were satisfied and delighted in the Blessed One's words."
}