{
    "mn92:1": "Thus have I heard.[n.867] The text of this sutta has not been included in the PTS ed. of the Majjhima Nikāya, as it is identical with the sutta of the same name in the Sutta Nipāta, published in two different versions by the PTS. The bracketed page numbers here therefore refer to the more recent PTS ed. of Sn, edited by Dines Anderson and Helmer Smith.On one occasion the Blessed One was wandering in the country of the Aṅguttarāpans with a large Saṅgha of bhikkhus, with twelve hundred and fifty bhikkhus, and eventually he arrived at a town of the Aṅguttarāpans named Āpaṇa.",
    "mn92:2": "Then the matted-hair ascetic Keṇiya went to the Blessed One and exchanged greetings with him, and when this courteous and amiable talk was finished, he sat down at one side. The Blessed One instructed, urged, roused, and gladdened him with a talk on the Dhamma. Then, having been instructed, urged, roused, and gladdened by the Blessed One with a talk on the Dhamma, the matted-hair ascetic Keṇiya said to the Blessed One: \"Let Master Gotama together with the Saṅgha of bhikkhus consent to accept tomorrow's meal from me.\"",
    "mn92:3": "A second time the matted-hair ascetic Keṇiya said to the Blessed One: \"Although the Saṅgha of bhikkhus is large, Master Gotama, consisting of twelve hundred and fifty bhikkhus, and although I place full confidence in the brahmins, still let Master Gotama, together with the Saṅgha of bhikkhus, consent to accept tomorrow's meal from me.\" A second time the Blessed One told him: \"The Saṅgha of bhikkhus is large, Keṇiya … \"",
    "mn92:4": "A third time the matted-hair ascetic Keṇiya said to the Blessed One: \"Although the Saṅgha is large, Master Gotama … still let Master Gotama together with the Saṅgha of bhikkhus consent to accept tomorrow's meal from me.\" The Blessed One consented in silence.",
    "mn92:5": "Then, knowing that the Blessed One had consented, the matted-hair ascetic Keṇiya rose from his seat and went to his own hermitage where he addressed his friends and companions, his kinsmen and relatives thus: \"Hear me, sirs, my friends and companions, my kinsmen and relatives. The recluse Gotama has been invited by me for tomorrow's meal together with the Saṅgha of bhikkhus. Make the necessary purchases and preparations for me.\"",
    "mn92:6": "Now on that occasion the brahmin Sela was staying at Āpaṇa. He was a master of the Three Vedas with their vocabularies, liturgy, phonology, and etymology, and the histories as a fifth; skilled in philology and grammar, he was fully versed in natural philosophy and in the marks of a Great Man, and was teaching the recitation of the hymns to three hundred brahmin students.",
    "mn92:7": "At the time the matted-hair ascetic Keṇiya had placed full confidence in the brahmin Sela. Then the brahmin Sela, while walking and wandering for exercise attended by his three hundred brahmin students, came to the matted-hair ascetic Keṇiya's hermitage. There he saw some men digging out ovens, some chopping wood, some washing dishes, some setting up a water-pot, some preparing seats, while the matted-hair ascetic Keṇiya himself was preparing the pavilion.",
    "mn92:8": "\"I will not be holding a marriage or a giving in marriage, Master Sela, nor has King Seniya Bimbisāra of Magadha been invited with a large retinue for tomorrow's meal, but I am planning a great sacrifice. The recluse Gotama, the son of the Sakyans who went forth from a Sakyan clan, has been wandering in the country of the Aṅguttarāpans with a large Saṅgha of bhikkhus, with twelve hundred and fifty bhikkhus, and has come to Āpaṇa. Now a good report of Master Gotama has been spread to this effect: ‘That Blessed One is accomplished, fully enlightened, perfect in true knowledge and conduct, sublime, knower of worlds, incomparable leader of persons to be tamed, teacher of gods and humans, enlightenedbuddha, blessed.’ He has been invited by me for tomorrow's meal together with the Saṅgha of bhikkhus.\"",
    "mn92:9": "\"Did you say ‘Buddha,’ Keṇiya?\"",
    "mn92:10": "\"I said ‘Buddha,’ Sela.\"",
    "mn92:11": "\"Did you say ‘Buddha,’ Keṇiya?\"",
    "mn92:12": "\"I said ‘Buddha,’ Sela.\"",
    "mn92:13": "Then it occurred to the brahmin Sela: \"Even this sound ‘Buddha’ is hard to come across in this world. Now the thirty-two marks of a Great Man have been handed down in our hymns, and the Great Man who is endowed with them has only two possible destinies, no other. If he lives the home life he becomes a Wheel-turning Monarch, a righteous king who rules by the Dhamma, master of the four quarters, all-victorious, who has stabilised his country and possesses the seven treasures. He has these seven treasures: the wheel-treasure, the elephant-treasure, the horse-treasure, the jewel-treasure, the woman-treasure, the steward-treasure, and the counsellor-treasure as the seventh. His children, who exceed a thousand, are brave and heroic and crush the armies of others; over this earth bounded by the ocean he rules without a rod, without a weapon, by means of the Dhamma. But if he goes forth from the home life into homelessness, he becomes an Accomplished One, a Fully Enlightened One, who draws aside the veil in the world.\"",
    "mn92:14": "He said: \"My good Keṇiya, where is Master Gotama, the Accomplished One, the Fully Enlightened One, now living?\"",
    "mn92:15": "He saw, more or less, the thirty-two marks of a Great Man on the Blessed One's body, except two; he was doubtful and uncertain about two of the marks, and he could not decide and make up his mind about them: about the male organ being enclosed in a sheath and about the largeness of the tongue.",
    "mn92:16": "Then he extolled the Blessed One to his face with fitting stanzas:",
    "mn92:17": "\"O perfect in body, well favoured,Well fashioned and lovely to behold;O Blessed One, golden is your colour,And white your teeth; you are strong.",
    "mn92:18": "The features are seen one and allThat distinguish a man as well born;They are all to be found on your body,These marks that reveal a Great Man.",
    "mn92:19": "With eyes clear, with countenance bright,Majestic, erect as a flame,In the midst of this body of reclusesYou shine like the blazing sun.A bhikkhu so lovely to look on",
    "mn92:20": "With skin of so golden a sheen —With beauty so rare why should youBe content with the life of a recluse?",
    "mn92:21": "You are fit to be a king, a lord of charioteers,A monarch who makes the wheel turn,A victor in all the four quartersAnd lord of the Jambu-tree Grove.[n.868] That is, Jambudīpa, the Indian subcontinent.",
    "mn92:22": "With warriors and great princesAll devoted to your service,O Gotama, you should reignAs ruler of men, king above all kings.\"",
    "mn92:23": "\"I am already a king, O Sela,\"the Blessed One replied.\"I am supreme king of the Dhamma;By means of the Dhamma I turn the wheel,The wheel that none can stop.\"",
    "mn92:24": "\"You claim full enlightenment,\" the brahmin Sela said,\"You tell me, O Gotama,‘I am supreme king of the Dhamma;By means of the Dhamma I turn the wheel.’",
    "mn92:25": "Who is your general, that discipleWho follows in the Master's own way?Who is it who helps you to turnThe Wheel of Dhamma set in motion by you?\"",
    "mn92:26": "\"The wheel set in motion by me,\"the Blessed One replied,\"That same supreme Wheel of Dhamma,Sāriputta the Tathāgata's sonHelps me in turning this wheel.",
    "mn92:27": "What must be known is directly known,What must be developed has been developed,What must be abandoned has been abandoned,Therefore, brahmin, I am a Buddha.",
    "mn92:28": "So put away all your doubts about meAnd let resolution take their place,For it is always hard to gainSight of the Enlightened Ones.",
    "mn92:29": "I am the one whose presence in the worldIs very rarely come upon,I am the Fully Enlightened One,I, O brahmin, am the supreme physician.",
    "mn92:30": "I am the holy one, without an equal,Who has crushed all Māra's teeming hordes;Having defeated all my enemies,I rejoice free from fear.\"",
    "mn92:31": "\"O sirs, hear this, hear what he says,The man of vision, the physician,The mighty hero who roarsLike a lion in the forest.",
    "mn92:32": "Who, even though of outcast birth,Would not believe him when he sawThat he is the holy one, without an equal,Who has crushed all Māra's teeming hordes?",
    "mn92:33": "Now let him follow me who wantsAnd who wants not, let him depart.For I will go forth under him,This man of lofty wisdom.\"",
    "mn92:34": "\"If, O sir, you now approveThis teaching of the Enlightened One,We too will go forth under him,This man of lofty wisdom.\"",
    "mn92:35": "\"There are three hundred brahmins hereWho with uplifted hands implore:‘O may we live the holy lifeUnder you, O Blessed One.’\"",
    "mn92:36": "\"The holy life is well proclaimed,O Sela,\" said the Blessed One,\"To be seen here and not delayed;One who trains with diligenceWill find a fruitful going forth.\"",
    "mn92:37": "Then the brahmin Sela and his assembly received the going forth under the Blessed One, and they received the full admission.",
    "mn92:38": "Then, when the night had ended, the matted-hair ascetic Keṇiya had good food of various kinds prepared in his own hermitage and had the time announced to the Blessed One: \"It is time, Master Gotama, the meal is ready.\" Then, it being morning, the Blessed One dressed, and taking his bowl and outer robe, he went with the Saṅgha of bhikkhus to the hermitage of the matted-hair ascetic Keṇiya and sat down on the seat made ready. Then, with his own hands, the matted-hair ascetic Keṇiya served and satisfied the Saṅgha of bhikkhus headed by the Buddha with various kinds of good food. When the Blessed One had eaten and had put his bowl aside, the matted-hair ascetic Keṇiya took a low seat and sat down on one side. Thereupon the Blessed One gave him his blessing with these stanzas:",
    "mn92:39": "\"Burnt offerings are the glory of fires,Sāvitrī the glory of Vedic hymns,Glory of human beings, a king,Glory of flowing rivers, the sea;",
    "mn92:40": "The moon is the glory of the stars,The sun is the glory of all that shine;Merit is the glory of all who aspire;The Saṅgha, glory of those who give.\"",
    "mn92:41": "When the Blessed One had given his blessing with these stanzas, he rose from his seat and departed.",
    "mn92:42": "Then, not long after their full admission, dwelling alone, withdrawn, diligent, ardent, and resolute, the venerable Sela and his assembly, by realising for themselves with direct knowledge, here and now entered upon and abided in that supreme goal of the holy life for the sake of which clansmen rightly go forth from the home life into homelessness. They directly knew: \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more coming to any state of being.\" And the venerable Sela together with his assembly became arahants.",
    "mn92:43": "\"Eight days have passed, All-Seeing One,Since we went to you for refuge.In these seven nights, O Blessed One,We have been tamed in your teaching.",
    "mn92:44": "You are the Buddha, you are the Teacher,You are the Sage, the conqueror of Māra.Having cut off all evil tendencies,You have crossed and guide humanity across.",
    "mn92:45": "You have surmounted all acquisitions,You have removed all the taints.You are a lion free from clinging,You have abandoned fear and dread.",
    "mn92:46": "Here these three hundred bhikkhus standWith hands held out in adoration.O Hero, extend your feet,And let these great beings worship the Teacher.\""
}