{
    "mn93:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn93:2": "So the brahmins went to the brahmin student Assalāyana and said to him: \"Master Assalāyana, this recluse Gotama describes purification for all the four castes. Let Master Assalāyana come and dispute with the recluse Gotama about this assertion.\"",
    "mn93:3": "When this was said, the brahmin student Assalāyana replied: \"Sirs, the recluse Gotama is one who speaks the Dhamma. Now those who speak the Dhamma are difficult to dispute with. I am not able to dispute with the recluse Gotama about this assertion.\"",
    "mn93:4": "A second time the brahmins said to him: \"Master Assalāyana, this recluse Gotama describes purification for all the four castes. Let Master Assalāyana come and dispute with the recluse Gotama about this assertion. For the training of a wanderer has been completed by Master Assalāyana.\"[n.870]MA: They speak thus intending to say: \"Having studied the Three Vedas, you have trained in the mantras by which those who go forth undertake their going forth and the mantras they maintain after they have gone forth. You have practised their mode of conduct. Therefore, you will not be defeated. Victory will be yours.\"",
    "mn93:5": "A third time the brahmins said to him: \"Master Assalāyana, this recluse Gotama describes purification for all the four castes. Let Master Assalāyana come and dispute with the recluse Gotama about this assertion. For the training of a wanderer has been completed by Master Assalāyana. Let not the Master Assalāyana be defeated without having even fought the battle.\"",
    "mn93:6": "When this was said, the brahmin student Assalāyana replied: \"Surely, Sirs, I am not getting through to you when I say: ’The recluse Gotama is one who speaks the Dhamma.’ Now those who speak the Dhamma are difficult to dispute with. I am not able to dispute with the recluse Gotama about this assertion. Still, sirs, at your bidding I will go.\"",
    "mn93:7": "Then the brahmin student Assalāyana went with a large number of brahmins to the Blessed One and exchanged greetings with him. When this courteous and amiable talk was finished, he sat down at one side and said to the Blessed One: \"Master Gotama, the brahmins say thus: ‘Brahmins are the highest caste, those of any other caste are inferior; brahmins are the fairest caste, those of any other caste are dark; only brahmins are purified, not non-brahmins; brahmins alone are the sons of Brahmā, the offspring of Brahmā, born of his mouth, born of Brahmā, created by Brahmā, heirs of Brahmā.’ What does Master Gotama say about that?\"",
    "mn93:8": "\"What do you think, Assalāyana? Have you heard that in Yona and Kamboja[n.72]Yonais the Pali transliteration of Ionia.Kambojais a region to the northwest of the Indian \"Middle Country.\"and in other outland countries there are only two castes, masters and slaves, and that masters become slaves and slaves masters?\"",
    "mn93:9": "\"What do you think, Assalāyana?[n.873] The argument of ¶¶8– here is substantially identical with that ofMN 84.Suppose a noble were to kill living beings, take what is not given, misconduct himself in sensual pleasures, speak falsely, speak maliciously, speak harshly, gossip, be covetous, have a mind of ill will, and hold wrong view. On the dissolution of the body, after death, would only hebe likely toreappear in a state of deprivation, in an unhappy destination, in perdition, even in hell — and not a brahmin? Suppose a merchant … a worker were to kill living beings … and hold wrong view. On the dissolution of the body after death, would only hebe likely toreappear in a state of deprivation, in an unhappy destination, in perdition, even in hell — and not a brahmin?\"",
    "mn93:10": "\"What do you think, Assalāyana? Suppose a brahmin were to abstain from killing living beings, from taking what is not given, from misconduct in sensual pleasures, from false speech, from malicious speech, from harsh speech, and from gossip, and were to be uncovetous, to have a mind without ill will, and to hold right view. On the dissolution of the body, after death, would only hebe likely toreappear in a happy destination, even in the heavenly world — and not a noble, or a merchant, or a worker?\"",
    "mn93:11": "\"What do you think, Assalāyana? Is only a brahmin capable of developing a mind of loving-kindness towards this region, without hostility and without ill will, and not a noble, or a merchant, or a worker?\"",
    "mn93:12": "\"What do you think, Assalāyana? Is only a brahmin capable of taking a loofah and bath powder, going to the river, and washing off dust and dirt, and not a noble, or a merchant, or a worker?\"",
    "mn93:13": "\"What do you think, Assalāyana? Suppose a head-anointed noble king were to assemble here a hundred men of different birth and say to them: ‘Come, sirs, let any here who have been born into a noble clan or a brahmin clan or a royal clan take an upper fire-stick of sāla wood, salala wood, sandalwood, or padumaka wood and light a fire and produce heat. And also let any who have been born into an outcast clan, a trapper clan, a wicker workers’ clan, a cartwrights’ clan, or a scavengers’ clan take an upper fire-stick made from a dog's drinking trough, from a pig's trough, from a dustbin, or from castor-oil wood and light a fire and produce heat.’",
    "mn93:14": "\"What do you think, Assalāyana? When a fire is lit and heat is produced by someone in the first group, would that fire have a flame, a colour, and a radiance, and would it be possible to use it for the purposes of fire, while when a fire is lit and heat is produced by someone of the second group, that fire would have no flame, no colour, and no radiance, and it would not be possible to use it for the purposes of fire?\"",
    "mn93:15": "\"What do you think, Assalāyana? Suppose a noble youth were to cohabit with a brahmin girl, and a son was born from their cohabitation. Should a son born from a noble youth and a brahmin girl be called a noble after the father or a brahmin after the mother?\"",
    "mn93:16": "\"What do you think, Assalāyana? Suppose a brahmin youth here were to cohabit with a noble girl, and a son were to be born from their cohabitation. Should the son born from a brahmin youth and a noble girl be called a noble after the mother or a brahmin after the father?\"",
    "mn93:17": "\"What do you think, Assalāyana? Suppose a mare were to be mated with a male donkey, and a foal were to be born as the result. Should the foal be called a horse after the mother or a donkey after the father?\"",
    "mn93:18": "\"What do you think, Assalāyana? Suppose there were two brahmin students who were brothers, born of the same mother, one studious and acute, and one neither studious nor acute. Which of them would brahmins feed first at a funeral feast, or at a ceremonial milk-rice offering, or at a sacrificial feast, or at a feast for guests?\"",
    "mn93:19": "\"What do you think, Assalāyana? Suppose there were two brahmin students who were brothers, born of the same mother, one studious and acute, but immoral and of bad character, and one neither studious nor acute, but virtuous and of good character. Which of them would brahmins feed first at a funeral feast, or at a ceremonial milk-rice offering, or at a sacrificial feast, or at a feast for guests?\"",
    "mn93:20": "\"First, Assalāyana, you took your stand on birth, and after that you took your stand on scriptural learning, and after that you have come to take your stand on the very ground that purification is for all four castes, as I describe it.\"",
    "mn93:21": "\"Once, Assalāyana, when seven brahmin seers were consulting together in leaf huts in the forest, this pernicious view arose in them: ‘Brahmins are the highest caste … … heirs of Brahmā.’ Now the seer Devala the Dark heard this.[n.874]MAidentifies Devala the Dark, Asita Devala, with the Buddha in an earlier life. The Buddha undertakes this teaching to show: \"In the past, when you were of a superior birth and I was of an inferior birth, you could not answer a question I asked you about an assertion concerning birth. So how can you do so now, when you are inferior and I have become a Buddha?\"Then he arranged his hair and beard, dressed in ochre-coloured garments, put on stout sandals, and taking a staff made of gold, he appeared in the courtyard of the seven brahmin seers. Then, while walking up and down the courtyard of the seven brahmin seers, the seer Devala the Dark spoke thus: ‘Where have those worthy brahmin seers gone? Where have those worthy brahmin seers gone?’ Then the seven brahmin seers thought: ‘Who is walking up and down in the courtyard of the seven brahmin seers like a village lout speaking thus: \"Where have those worthy brahmin seers gone? Where have those worthy brahmin seers gone?\" Let us curse him!’ Then the seven brahmin seers cursed the seer Devala the Dark thus: ‘Be ashes, vile one! Be ashes, vile one!’ But the more the seven brahmin seers cursed him, the more comely, beautiful, and handsome the seer Devala the Dark became. Then the seven brahmin seers thought: ‘Our asceticism is in vain, our holy life is fruitless; for formerly when we cursed anyone thus: \"Be ashes, vile one! Be ashes, vile one!\" he always became ashes; but the more we curse this one, the more comely, beautiful, and handsome he becomes.’",
    "mn93:22": "\"Then the seven brahmin seers went to the seer Devala the Dark and paid homage to him. Then he said to them: ‘Sirs, I heard that while the seven brahmin seers were dwelling in leaf huts in the forest, this pernicious view arose in them: \"Brahmins are the highest caste … heirs of Brahmā.\"’ — ‘That is so, sir.’",
    "mn93:23": "\"‘But, sirs, do you know if the mother who bore you went only with a brahmin and never with a non-brahmin?’ — ‘No, sir.’",
    "mn93:24": "\"‘But, sirs, do you know if your mother's mothers back to the seventh generation went only with brahmins and never with non-brahmins?’ — ‘No, sir.’",
    "mn93:25": "\"‘But, sirs, do you know if the father who begot you went only with a brahmin woman and never with a non-brahmin woman?’ — ‘No, sir.’",
    "mn93:26": "\"‘But, sirs, do you know if your father's fathers back to the seventh generation went only with brahmin women and never with non-brahmin women?’ — ‘No, sir.’",
    "mn93:27": "\"‘But, sirs, do you know how the descent of an embryo comes about?’",
    "mn93:28": "\"‘Then, sirs, do you know for sure whether that gandhabba is a noble, or a brahmin, or a merchant, or a worker?’",
    "mn93:29": "When this was said, the brahmin student Assalāyana said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. From today let Master Gotama remember me as a lay follower who has gone to him for refuge for life.\""
}