{
    "mn94:1": "Thus have I heard. On one occasion the venerable Udena was living at Benares in the Khemiya Mango Grove.",
    "mn94:2": "When this was said, the venerable Udena stepped down from the walk and went into his dwelling, where he sat down on a seat made ready.[n.877]MA: He did this after recognising that a lengthy discussion would be required.And Ghoṭamukha too stepped down from the walk and went into the dwelling, where he stood at one side. Then the venerable Udena said to him: \"There are seats, brahmin, sit down if you wish.\"",
    "mn94:3": "\"Brahmin, there are four kinds of persons to be found existing in the world. What four?\" Here a certain kind of person torments himself and pursues the practice of torturing himself. Here a certain kind of person torments others and pursues the practice of torturing others. Here a certain kind of person torments himself and pursues the practice of torturing himself, and he also torments others and pursues the practice of torturing others. Here a certain kind of person does not torment himself or pursue the practice of torturing himself, and he does not torment others or pursue the practice of torturing others. Since he torments neither himself nor others, he is here and now hungerless, extinguished, and cooled, and he abides experiencing bliss, having himself become holy.Sukhapaṭisaṁvedī brahmabhūtena attanā.MA: He experiences the bliss of the jhānas, paths, fruits, and Nibbāna. \"Brahma\" here should be understood in the sense of holy or excellent(sẹ̣ha). There may be an allusion here to the main theme of the Upanishads, the identity of the ātman with brahman.Which of these four kinds of persons satisfies your mind, Brahmin?\"",
    "mn94:4": "\"The first three do not satisfy my mind, venerable sir, but the last one satisfies my mind.\"",
    "mn94:5": "\"But, Brahmin, why don’t the first three kinds of persons satisfy your mind?\"",
    "mn94:6": "\"Brahmin, there are two kinds of assembly. What two? Here a certain assembly lusts after jewels and earrings and seeks wives and children, men and women slaves, fields and land, gold and silver.",
    "mn94:7": "But here a certain assembly does not lust after jewels and earrings, but having abandoned wives and children, men and women slaves, fields and land, gold and silver, has gone forth from the home life into homelessness. Now there is this kind of person who does not torment himself or pursue the practice of torturing himself and who does not torment others or pursue the practice of torturing others; who, since he torments neither himself nor others, is here and now hungerless, extinguished, and cooled, and abides experiencing bliss, having himself become holy. In which of the two kinds of assembly do you usually see this person, brahmin — in the assembly that lusts after jewels and earrings and seeks wives and children, men and women slaves, fields and land, gold and silver; or in the assembly that does not lust after jewels and earrings, but having abandoned wives and children … has gone forth from the home life into homelessness?\"",
    "mn94:8": "\"I usually see this kind of person, Master Udena, in the assembly that does not lust after jewels and earrings, but having abandoned wives and children … has gone forth from the home life into homelessness.\"",
    "mn94:9": "\"But only just now, brahmin, we understood you to say: ‘Worthy recluse, there is no wanderers’ life that accords with the Dhamma: so it seems to me here, and that may be because I have not seen such venerable ones as yourself orbecause I have not seenthe Dhamma here.’\"",
    "mn94:10": "\"Brahmin, what kind of person torments himself and pursues the practice of torturing himself?This passage details the austerities undertaken by many of the Buddha’s ascetic contemporaries, as well as by the Bodhisatta himself during his period of striving for enlightenment. SeeMN 12.45.Here a certain person goes naked, rejecting conventions, licking his hands, not coming when asked, not stopping when asked; he does not accept food brought or food specially made or an invitation to a meal; he receives nothing from a pot, from a bowl, across a threshold, across a stick, across a pestle, from two eating together, from a pregnant woman, from a woman giving suck, from a woman in the midst of men, from where food is advertised to be distributed, from where a dog is waiting, from where flies are buzzing; he accepts no fish or meat, he drinks no liquor, wine, or fermented brew. He keeps to one house, to one morsel; he keeps to two houses to two morsels; … he keeps to seven houses, to seven morsels. He lives on one saucerful a day, on two saucerfuls a day … on seven saucerfuls a day. He takes food once a day, once every two days … once every seven days; thus even up to once every fortnight, he dwells pursuing the practice of taking food at stated intervals. He is an eater of greens or millet or wild rice or hide-parings or moss or ricebran or rice-scum or sesamum flour or grass or cowdung. He lives on forest roots and fruits, he feeds on fallen fruits. He clothes himself in hemp, in hemp-mixed cloth, in shrouds, in refuse rags, in tree bark, in antelope hide, in strips of antelope hide, in kusa-grass fabric, in bark fabric, in wood-shavings fabric, in head-hair wool, in animal wool, in owls’ wings. He is one who pulls out hair and beard, pursuing the practice of pulling out hair and beard. He is one who stands continuously, rejecting seats. He is one who squats continuously, devoted to maintaining the squatting position. He is one who uses a mattress of spikes; he makes a mattress of spikes his bed. He dwells pursuing the practice of bathing in water three times daily including the evening. Thus in such a variety of ways he dwells pursuing the practice of tormenting and mortifying the body. This is called the kind of person who torments himself and pursues the practice of torturing himself.",
    "mn94:11": "\"What kind of person, Brahmin, torments others and pursues the practice of torturing others? Here a certain person is a butcher of sheep, a butcher of pigs, a fowler, a trapper of wild beasts, a hunter, a fisherman, a thief, an executioner, a prison warden, or one who follows any other such bloody occupation. This is called the kind of person who torments others and pursues the practice of torturing others.",
    "mn94:12": "\"What kind of person, Brahmin, torments himself and pursues the practice of torturing himself and also torments others and pursues the practice of torturing others? Here some person is a head-anointed noble king or a well-to-do brahmin.This passage shows the practice of one who torments himself in the hope of gaining merit and then offers sacrifices that involve the slaughter of many animals and the oppression of his workers.Having had a new sacrificial temple built to the east of the city, and having shaved off his hair and beard, dressed himself in rough hide, and greased his body with ghee and oil, scratching his back with a deer's horn, he enters the sacrificial temple together with his chief queen and his brahmin high priest. There he lies down on the bare ground strewn with grass. The king lives on the milk in the first teat of a cow with a calf of the same colour while the chief queen lives on the milk in the second teat and the brahmin high priest lives on the milk in the third teat; the milk in the fourth teat they pour onto the fire, and the calf lives on what is left. He says thus: ‘Let so many bulls be slaughtered for sacrifice, let so many bullocks be slaughtered for sacrifice, let so many heifers be slaughtered for sacrifice, let so many goats be slaughtered for sacrifice, let so many sheep be slaughtered for sacrifice, let so many trees be felled for the sacrificial posts, let so much grass be cut for the sacrificial grass.’ And then his slaves, messengers, and servants make preparations, weeping with tearful faces, being spurred on by threats of punishment and by fear. This is called the kind of person who torments himself and pursues the practice of torturing himself and who torments others and pursues the practice of torturing others.",
    "mn94:13": "\"What kind of person, Brahmin, does not torment himself or pursue the practice of torturing himself and does not torment others or pursue the practice of tormenting others — the one who, since he torments neither himself nor others, is here and now hungerless, extinguished, and cooled, and abides experiencing bliss, having himself become holy?This is the arahant. To show clearly that he torments neither himself nor others, the Buddha next undertakes to describe the path of practice by which he arrived at arahantship.",
    "mn94:14": "Abandoning the taking of what is not given, he abstains from taking what is not given; taking only what is given, expecting only what is given, by not stealing he abides in purity.",
    "mn94:15": "Abandoning incelibacy, he observes celibacy, living apart, abstaining from the vulgar practice of sexual intercourse.",
    "mn94:16": "\"Abandoning false speech, he abstains from false speech; he speaks truth, adheres to truth, is trustworthy and reliable, one who is no deceiver of the world.",
    "mn94:17": "Abandoning malicious speech, he abstains from malicious speech; he does not repeat elsewhere what he has heard here in order to dividethose peoplefrom these, nor does he repeat to these people what he has heard elsewhere in order to dividethese peoplefrom those; thus he is one who reunites those who are divided, a promoter of friendships, who enjoys concord, rejoices in concord, delights in concord, a speaker of words that promote concord.",
    "mn94:18": "Abandoning harsh speech, he abstains from harsh speech; he speaks such words as are gentle, pleasing to the ear, and loveable, as go to the heart, are courteous, desired by many and agreeable to many.",
    "mn94:19": "Abandoning gossip, he abstains from gossip; he speaks at the right time, speaks what is fact, speaks on what is good, speaks on the Dhamma and the Discipline; at the right time he speaks such words as are worth recording, reasonable, moderate, and beneficial.",
    "mn94:20": "\"He abstains from injuring seeds and plants. He practises eating one meal a day, abstaining from eating at night and outside the proper time. He abstains from dancing, singing, music, and theatrical shows. He abstains from wearing garlands, smartening himself with scent, and embellishing himself with unguents. He abstains from high and large couches. He abstains from accepting gold and silver. He abstains from accepting raw grain. He abstains from accepting raw meat. He abstains from accepting women and girls. He abstains from accepting men and women slaves. He abstains from accepting goats and sheep. He abstains from accepting fowl and pigs. He abstains from accepting elephants, cattle, horses, and mares. He abstains from accepting fields and land. He abstains from going on errands and running messages. He abstains from buying and selling. He abstains from false weights, false metals, and false measures. He abstains from accepting bribes, deceiving, defrauding, and trickery. He abstains from wounding, murdering, binding, brigandage, plunder, and violence.",
    "mn94:21": "\"He becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Just as a bird, wherever it goes, flies with its wings as its only burden, so too, the bhikkhu becomes content with robes to protect his body and with almsfood to maintain his stomach, and wherever he goes he sets out taking only these with him. Possessing this aggregate of noble virtue, he experiences within himself a bliss that is blameless.",
    "mn94:22": "\"On seeing a form with the eye, he does not grasp at its signs and features. Since, if he left the eye faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the eye faculty, he undertakes the restraint of the eye faculty. On hearing a sound with the ear … On smelling an odour with the nose … On tasting a flavour with the tongue … On touching a tangible with the body … On cognizing a mind-object with the mind, he does not grasp at its signs and features. Since, if he left the mind faculty unguarded, evil unwholesome states of covetousness and grief might invade him, he practises the way of its restraint, he guards the mind faculty, he undertakes the restraint of the mind faculty. Possessing this noble restraint of the faculties, he experiences within himself a bliss that is unsullied.",
    "mn94:23": "\"He becomes one who acts in full awareness when going forward and returning; who acts in full awareness when looking ahead and looking away; who acts in full awareness when flexing and extending his limbs; who acts in full awareness when wearing his robes and carrying his outer robe and bowl; who acts in full awareness when eating, drinking, consuming food, and tasting; who acts in full awareness when defecating and urinating; who acts in full awareness when walking, standing, sitting, falling asleep, waking up, talking, and keeping silent.",
    "mn94:24": "\"Possessing this aggregate of noble virtue, and this noble restraint of the faculties, and possessing this noble mindfulness and full awareness, he resorts to a secluded resting place: the forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, a heap of straw.",
    "mn94:25": "\"Having thus abandoned these five hindrances, imperfections of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion.",
    "mn94:26": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the recollection of past lives. He recollects his manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many aeons of world-contraction, many aeons of world-expansion, many aeons of world-contraction and expansion: ‘There I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared elsewhere; and there too I was so named, of such a clan, with such an appearance, such was my nutriment, such my experience of pleasure and pain, such my life-term; and passing away from there, I reappeared here.’ Thus with their aspects and particulars he recollects his manifold past lives.",
    "mn94:27": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the passing away and reappearance of beings. With the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate. He understands how beings pass on according to their actions thus: ‘These worthy beings who were ill conducted in body, speech, and mind, revilers of noble ones, wrong in their views, giving effect to wrong view in their actions, on the dissolution of the body, after death, have reappeared in a state of deprivation, in a bad destination, in perdition, even in hell; but these worthy beings who were well conducted in body, speech, and mind, not revilers of noble ones, right in their views, giving effect to right view in their actions, on the dissolution of the body, after death, have reappeared in a good destination, even in the heavenly world.’ Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, inferior and superior, fair and ugly, fortunate and unfortunate, and he understands how beings pass on according to their actions.",
    "mn94:28": "\"When his concentrated mind is thus purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to knowledge of the destruction of the taints. He understands as it actually is: ‘This is suffering’; he understands as it actually is: ‘This is the origin of suffering’; he understands as it actually is: ‘This is the cessation of suffering’; he understands as it actually is: ‘This is the way leading to the cessation of suffering.’ He understands as it actually is: ‘These are the taints’; he understands as it actually is: ‘This is the origin of the taints’; he understands as it actually is: ‘This is the cessation of the taints’; he understands as it actually is: ‘This is the way leading to the cessation of the taints.’",
    "mn94:29": "\"This, Brahmin, is called the kind of person who does not torment himself or pursue the practice of torturing himself and who does not torment others or pursue the practice of torturing others — the one who, since he torments neither himself nor others, is here and now hungerless, extinguished, and cooled, and abides experiencing bliss, having himself become holy.\"",
    "mn94:30": "When this was said, the brahmin Ghoṭamukha said to the venerable Udena: \"Magnificent, Master Udena! Magnificent, Master Udena! Master Udena has made the Dhamma clear in many ways, as though he were turning upright what had been overthrown, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Udena for refuge and to the Dhamma and to the Saṅgha of bhikkhus. From today let Master Udena remember me as a lay follower who has gone to him for refuge for life.\"",
    "mn94:31": "\"If we heard that Master Gotama was within ten leagues, we would go ten leagues in order to see that Master Gotama, accomplished and fully enlightened. If we heard that Master Gotama was within twenty leagues … thirty leagues … forty leagues … fifty leagues … a hundred leagues, we would go a hundred leagues in order to see that Master Gotama, accomplished and fully enlightened.",
    "mn94:32": "But since that Master Gotama has attained to final Nibbāna, we go to that Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. From today let Master Udena remember me as a lay follower who has gone for refuge for life.",
    "mn94:33": "Then with that regular donationwhich he offered to Master Udenaand another regular donationadded to it, the brahmin Ghoṭamukha had an assembly hall built for the Saṅgha at Pāṭaliputta. And that is now known as the Ghoṭamukhī."
}