{
    "mn96:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn96:2": "\"Well, brahmin, has all the world authorised the brahmins to prescribe these four levels of service?\" — \"No, Master Gotama.\" — \"Suppose, brahmin, they were to force a cut of meat upon a poor, penniless, destitute man and tell him: ‘Good man, you must eat this meat and pay for it’; so too, without the consent of thoseotherrecluses and brahmins, the brahmins nevertheless prescribe those four levels of service.",
    "mn96:3": "\"For here, brahmin, one from an aristocratic family may kill living beings, take what is not given, misconduct himself in sensual pleasures, speak falsely, speak maliciously, speak harshly, gossip, be covetous, have a mind of ill will, and hold wrong view. Therefore I do not say that one is better because one is from an aristocratic family. But also, brahmin, one from an aristocratic family may abstain from killing living beings, from taking what is not given, from misconduct in sensual pleasures, from false speech, from malicious speech, from harsh speech, and from gossip, and he may be uncovetous, have a mind without ill will, and hold right view. Therefore I do not say that one is worse because one is from an aristocratic family.",
    "mn96:4": "\"Here, brahmin, one of great beauty … one of great wealth may kill living beings … and hold wrong view. Therefore I do not say that one is better because one is of great beauty … of great wealth. But also, brahmin, one of great beauty … of great wealth may abstain from killing living beings … and hold right view. Therefore I do not say that one is worse because one is of great beauty … of great wealth.",
    "mn96:5": "When this was said, the brahmin Esukārī said to the Blessed One: \"Master Gotama, the brahmins prescribe four types of wealth. They prescribe the wealth of a brahmin, the wealth of a noble, the wealth of a merchant, and the wealth of a worker. \"Therein, Master Gotama, the brahmins prescribe this as the wealth of a brahmin — wandering for alms;[n.894]MA: It had been an ancient practice among the brahmins to wander for alms even when they possessed great wealth.a brahmin who spurns his own wealth, wandering for alms, abuses his duty like a guard who takes what has not been given. That is the wealth of a brahmin which the brahmins prescribe. Master Gotama, the brahmins prescribe this as the wealth of a noble — the bow and quiver; a noble who spurns his own wealth, the bow and quiver, abuses his duty like a guard who takes what has not been given. That is the wealth of a noble which the brahmins prescribe. Master Gotama, the brahmins prescribe this as the wealth of a merchant — farming and cattle-breeding;[n.89] Although agriculture may seem a strange occupation for one described as a merchant, it should be understood that the vessas not only ran the urban business enterprises, but also owned and supervised agrarian undertakings.a merchant who spurns his own wealth, farming and cattle-breeding, abuses his duty like a guard who takes what has not been given. That is the wealth of a merchant which the brahmins prescribe. Master Gotama, the brahmins prescribe this as the wealth of a worker — the sickle and carrying-pole; a worker who spurns his own wealth, the sickle and carrying-pole, abuses his duty like a guard who takes what has not been given. That is the wealth of a worker which the brahmins prescribe. What does Master Gotama say about this?\"",
    "mn96:6–7": "\"Well, brahmin, has all the world authorised the brahmins to prescribe these four types of wealth?\" — \"No, Master Gotama.\" — \"Suppose, brahmin, they were to force a cut of meat upon a poor, penniless, destitute man and tell him: ‘Good man, you must eat this meat and pay for it’; so too, without the consent of thoseotherrecluses and brahmins, the brahmins nevertheless prescribe these four types of wealth.",
    "mn96:8": "\"If, brahmin, anyone from a clan of nobles goes forth from the home life into homelessness, and after encountering the Dhamma and Discipline proclaimed by the Tathāgata, he abstains from killing living beings, from taking what is not given, from incelibacy, from false speech, from malicious speech, from harsh speech, and from gossip, and is uncovetous, has a mind without ill will, and holds right view, he is one who is accomplishing the true way, the Dhamma that is wholesome.",
    "mn96:9": "\"If, brahmin, anyone from a clan of brahmins goes forth …",
    "mn96:10": "… If anyone from a clan of merchants goes forth …",
    "mn96:11": "… If anyone from a clan of workers goes forth from the home life into homelessness, and after encountering the Dhamma and Discipline proclaimed by the Tathāgata, he abstains from killing living beings … and holds right view, he is one who is accomplishing the true way, the Dhamma that is wholesome.",
    "mn96:12": "\"What do you think, brahmin? Is only a brahmin capable of developing a mind of loving-kindness towards a certain region, without hostility and without ill will, and not a noble, or a merchant, or a worker?\"",
    "mn96:13": "\"So too, brahmin, if anyone from a clan of nobles goes forth … he is one who is accomplishing the true way, the Dhamma that is wholesome.",
    "mn96:14": "\"What do you think, brahmin? Is only a brahmin capable of taking a loofah and bath powder, going to the river, and washing off dust and dirt, and not a noble, or a merchant, or a worker?\"",
    "mn96:15": "\"So too, brahmin, if anyone from a clan of nobles goes forth … he is one who is accomplishing the true way, the Dhamma that is wholesome.",
    "mn96:16": "\"What do you think, brahmin? Suppose a head-anointed noble king were to assemble here a hundred men of different birth and say to them: ‘Come, sirs, let any here who have been born into a noble clan or a brahmin clan or a royal clan take an upper fire-stick of sāla wood, salala wood, sandalwood, or padumaka wood and light a fire and produce heat. And also let any who have been born into an outcast clan, a trapper clan, a wicker workers’ clan, a cartwrights’ clan, or a scavengers’ clan take an upper fire-stick made from a dog's drinking trough, from a pig's trough, from a dustbin, or from castor-oil wood and light a fire and produce heat.’",
    "mn96:17": "\"What do you think, Brahmin? When a fire is lit and heat is produced by someone in the first group, would that fire have a flame, a colour, and a radiance, and would it be possible to use it for the purposes of fire, while when a fire is lit and heat is produced by someone of the second group, that fire would have no flame, no colour, and no radiance, and it would not be possible to use it for the purposes of fire?\"",
    "mn96:18": "\"So too, brahmin, if anyone from a clan of nobles goes forth from the home life into homelessness, and after encountering the Dhamma and Discipline proclaimed by the Tathāgata, he abstains from killing living beings, from taking what is not given, from incelibacy, from false speech, from malicious speech, from harsh speech, and from gossip, and is uncovetous, has a mind without ill will, and holds right view, he is one who is accomplishing the true way, the Dhamma that is wholesome.\"",
    "mn96:19": "When this was said, the brahmin Esukārī said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! … From today let Master Gotama remember me as a lay follower who has gone to him for refuge for life.\""
}