{
    "mn97:1": "Thus have I heard. On one occasion the Blessed One was living at Rājagaha in the Bamboo Grove, the Squirrels’ Sanctuary.",
    "mn97:2": "Then, having stayed in the Southern Hills as long as he chose, the venerable Sāriputta set out to wander towards Rājagaha. Wandering by stages he eventually arrived at Rājagaha, and there he lived in the Bamboo Grove, the Squirrels’ Sanctuary.",
    "mn97:3": "\"What do you think, Dhānañjāni? Suppose someone here were to behave contrary to the Dhamma, to behave unrighteously for the sake of his parents, and then because of such behaviour the wardens of hell were to drag him offNow on that occasion the venerable Sāriputta was wandering in the Southern Hills with a large Saṅgha of bhikkhus. Then a certain [185] to hell. Would he be ableto free himself by pleading thus: ‘It was for the sake of my parents that I behaved contrary to the Dhamma, that I behaved unrighteously, so let not the wardens of helldrag me offto hell’? Or would his parents be ableto free him by pleading thus: ‘It was for our sake that he behaved contrary to the Dhamma, that he behaved unrighteously, so let not the wardens of helldrag him offto hell’?\"",
    "mn97:4–12\"": "\"What do you think, Dhānañjāni? Suppose someone here were to behave contrary to the Dhamma, to behave unrighteously for the sake of his wife and children … for the sake of his slaves, servants, and workers … for the sake of his friends and companions … for the sake of his kinsmen and relatives … for the sake of his guests … for the sake of his departed ancestors … for the sake of the deities … for the sake of the king … for the sake of refreshing and nourishing this body, and because of such behaviour the wardens of hell were to drag him off to hell. Would he be ableto free himself by pleading thus: ‘It was for the sake of refreshing and nourishing this body that I behaved contrary to the Dhamma, that I behaved unrighteously, so let not the wardens of helldrag me offto hell’? Or would others be ableto free him by pleading thus: ‘It was for the sake of refreshing and nourishing this body that he behaved contrary to the Dhamma, that he behaved unrighteously, so let not the wardens of helldrag him offto hell’?\"",
    "mn97:13": "\"What do you think, Dhānañjāni? Who is the better, one who for the sake of his parents behaves contrary to the Dhamma, behaves unrighteously, or one who for the sake of his parents behaves according to the Dhamma, behaves righteously?\"",
    "mn97:14–22": "\"What do you think, Dhānañjāni? Who is the better, one who for the sake of his wife and children … for the sake of the king … for the sake of refreshing and nourishing this body behaves contrary to the Dhamma, behaves unrighteously, or one who for the sake of refreshing and nourishing this body behaves according to the Dhamma, behaves righteously?\"",
    "mn97:23": "Then the brahmin Dhānañjāni, having delighted and rejoiced in the venerable Sāriputta's words, rose from his seat and departed.",
    "mn97:24": "Then the venerable Sāriputta dressed, and taking his bowl and outer robe, he went to the residence of the brahmin Dhānañjāni, sat down on a seat made ready, and said to the brahmin Dhānañjāni: \"I hope you are getting well, brahmin, I hope you are comfortable. I hope your painful feelings are subsiding and not increasing, and that their subsiding, not their increase, is apparent.\"",
    "mn97:25": "\"What do you think, Dhānañjāni? Which is better — hell or the animal realm?\" — \"The animal realm, Master Sāriputta.\" — \"Which is better — the animal realm or the realm of ghosts?\" — \"The realm of ghosts, Master Sāriputta.\" — \"Which is better — the realm of ghosts or the realm of human beings?\" — \"Human beings, Master Sāriputta.\" \"Which is better — human beings or the gods of the heaven of the Four Great Kings?\" — \"The gods of the heaven of the Four Great Kings, Master Sāriputta.\" — \"Which is better — the gods of the heaven of the Four Great Kings or the gods of the heaven of the Thirty-three?\" — \"The gods of the heaven of the Thirty-three, Master Sāriputta.\" — \"Which is better — the gods of the heaven of the Thirty-three or the Yāma gods?\" — \"The Yāma gods, Master Sāriputta.\" — \"Which is better — the Yāma gods or the gods of the Tusita heaven?\" — \"The gods of the Tusita heaven, Master Sāriputta.\" — \"Which is better — the gods of the Tusita heaven or the gods who delight in creating?\" — \"The gods who delight in creating, Master Sāriputta.\" — \"Which is better — the gods who delight in creating or the gods who wield power over others’ creations?\" — \"The gods who wield power over others’ creations, Master Sāriputta.\"",
    "mn97:26": "Then the venerable Sāriputta thought: \"These brahmins are devoted to the Brahma-world. Suppose I teach the brahmin Dhānañjāni the path to the company of Brahmā?\"And he said:\"Dhānañjāni, I shall teach you the path to the company of Brahmā. Listen and attend closely to what I shall say.\" — \"Yes, sir,\" he replied. The venerable Sāriputta said this:",
    "mn97:27": "\"Again, Dhānañjāni, a bhikkhu abides pervading one quarter with a mind imbued with compassion … with a mind imbued with altruistic joy … with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to himself, he abides pervading the all-encompassing world with a mind imbued with equanimity, abundant, exalted, immeasurable, without hostility and without ill will. This too is the path to the company of Brahmā.\"",
    "mn97:28": "Then the Blessed One addressed the bhikkhus thus: \"Bhikkhus, Sāriputta, having established the brahmin Dhānañjāni in the inferior Brahma-world, rose from his seat and departed while there was still more to be done.\""
}