{
    "mn98:1": "Thus have I heard.[n.900] The text of this sutta has not been included in the PTS ed. of the Majjhima Nikāya, for the same reason given inn.867.The bracketed page numbers refer to the Anderson-Smith ed. of Sn.On one occasion the Blessed One was living at Icchānaṅgala, in the wood near Icchānaṅgala.",
    "mn98:2": "The brahmin student Bhāradvāja said: \"When one is well born on both sides, of pure maternal and paternal descent seven generations back, unassailable and impeccable in respect of birth, then one is a brahmin.\" The brahmin student Vāseṭṭha said: \"When one is virtuous and fulfils the observances, then one is a brahmin.\"",
    "mn98:3": "But the brahmin student Bhāradvāja could not convince the brahmin student Vāseṭṭha, nor could the brahmin student Vāseṭṭha convince the brahmin student Bhāradvāja.",
    "mn98:4": "Then the brahmin student Vāseṭṭha addressed the brahmin student Bhāradvāja: \"Sir, the recluse Gotama, the son of the Sakyans who went forth from a Sakyan clan, is living at Icchānaṅgala, in the wood near Icchānaṅgala. Now a good report of Master Gotama has been spread to this effect: ‘That Blessed One is accomplished, fully enlightened, perfect in true knowledge and conduct, sublime, knower of worlds, incomparable leader of persons to be tamed, teacher of gods and humans, enlightened, blessed.’ Come, Bh̄radvāja, let us go to the recluse Gotama and ask him about this matter. As he answers, so we will remember it.\" — \"Yes, sir,\" the brahmin student Bhāradvāja replied.",
    "mn98:5": "Then the two brahmin students, Vāseṭṭha and Bhāradvāja, went to the Blessed One and exchanged greetings with him. When this courteous and amiable talk was finished, they sat down at one side and the brahmin student Vāseṭṭha addressed the Blessed One in stanzas thus:",
    "mn98:6": "\"We are both acknowledged to possessThe knowledge we claim of the Triple Veda,For I am Pokkharasāti's pupilAnd he a pupil of Tārukkha.",
    "mn98:7": "We have attained full masteryOver all that the Vedic experts teach;Skilled in philology and grammarWe match our teachers in recitation. \nA dispute has arisen between us, Gotama,Concerning the question of birth and class:",
    "mn98:8": "Bhāradvāja says one is a brahmin by birth,While I hold one is a brahmin by action.[n.901] Here the word \"kamma\" has to be understood as present action or deed, and not past action producing its present consequences.Know this, O Seer, as our debate.",
    "mn98:9": "Since neither of us could convince the other,Or make him see his point of view,We have come to ask you, sir,Widely famed to be a Buddha.",
    "mn98:10": "As people turn with palms upraisedTowards the moon when it starts to wax,So in the world do they venerate youAnd pay homage to you, Gotama.",
    "mn98:11": "So now we ask of you, Gotama,The eye uprisen in the world:Is one a brahmin by birth or action?Explain to us who do not knowHow we should recognise a brahmin.\"",
    "mn98:12": "\"I teach you in order as they really are,Vāseṭṭha,\" said the Blessed One,\"The generic divisions of living beings;For many are the kinds of birth.",
    "mn98:13": "Know first the grass and trees:Though they lack self-awareness,Their birth is their distinctive mark;For many are the kinds of birth.",
    "mn98:14": "Next come the moths and butterfliesAnd so on through to ants and termites:Their birth is their distinctive mark;For many are the kinds of birth.",
    "mn98:15": "Then know the kinds of quadrupedsOf varied sortsboth small and large:Their birth is their distinctive mark;For many are the kinds of birth.",
    "mn98:16": "Know those whose bellies are their feet,To wit, the long-backed class of snakes:Their birth is their distinctive mark;For many are the kinds of birth.",
    "mn98:17": "Know too the water-dwelling fishThat pasture in the liquid world:Their birth is their distinctive mark;For many are the kinds of birth.",
    "mn98:18": "Next know the birds that wing their wayAs they raṅge in open skies:Their birth is their distinctive mark;For many are the kinds of birth.",
    "mn98:19": "\"While in these births the differencesOf birth make their distinctive mark,With humans no differences of birthMake a distinctive mark in them.",
    "mn98:20": "Nor in the hairs nor in the headNor in the ears nor in the eyesNor in the mouth nor in the noseNor in the lips nor in the brows;",
    "mn98:21": "Nor in the shoulders or the neckNor in the belly or the backNor in the buttocks or the breastNor in the genitals or ways of mating;",
    "mn98:22": "Nor in the hands nor in the feetNor in the fingers or the nailsNor in the knees nor in the thighsNor in their colour or in voice:Here birth makes no distinctive markAs with the other kinds of birth.",
    "mn98:23": "In human bodies in themselvesNothing distinctive can be found.Distinction among human beingsIs purely verbal designation.[n.902]Sāmaññā.MA: Among animals the diversity in the shape of their bodily parts is determined by their speciesyoni, but thatspecies differentiationis not found in the individual bodies of brahmins and other classes of humans. Such being the case, the distinction between brahmins,khattiyas,etc., is purely a verbal designation; it is spoken of as mere conventional expression.",
    "mn98:24": "\"Who makes his living among men[n.903]MA: Up to this point the Buddha has criticised the assertion of Bhāradvāja that birth makes one a brahmin. Now he will uphold the assertion of Vāseṭṭha that action makes one a brahmin. For the ancient brahmins and other wise ones in the world would not recognise the brahminhood of one defective in livelihood, virtue, and conduct.By agriculture, you should knowIs called a farmer, Vāseṭṭha;He is not a brahmin.",
    "mn98:25": "Who makes his living among menBy varied crafts, you should knowIs called a craftsman, Vāseṭṭha;He is not a brahmin.",
    "mn98:26": "Who makes his living among menBy merchandise, you should knowIs called a merchant, Vāseṭṭha;He is not a brahmin.",
    "mn98:27": "Who makes his living among menBy serving others, you should knowIs called a servant, Vāseṭṭha;He is not a brahmin.",
    "mn98:28": "Who makes his living among menBy stealing, you should knowIs called a robber, Vāseṭṭha;He is not a brahmin.",
    "mn98:29": "Who makes his living among menBy archery, you should knowIs called a soldier, Vāseṭṭha;He is not a brahmin.",
    "mn98:30": "Who makes his living among menBy priestly craft, you should knowIs called a chaplain, Vāseṭṭha;He is not a brahmin.",
    "mn98:31": "Whoever governs among menThe town and realm, you should knowIs called a ruler, Vāseṭṭha;He is not a brahmin.",
    "mn98:32": "\"I call him not a brahminBecause of his origin and lineage.If impediments still lurk in him,He is just one who says ‘Sir.’[n.904]Bhovādi. Bho,\"sir,\" was a mode of address used among the brahmins. From this point on the Buddha will identify the true brahmin with the arahant. Verses –59 here are identical withDhp 396–423, except for an additional couplet in Dhp 423.Who is unimpeded and clings no more:He is the one I call a brahmin.",
    "mn98:33": "Who has cut off all fettersAnd is no more by anguish shaken,Who has overcome all ties, detached:He is the one I call a brahmin.",
    "mn98:34": "Who has cut each strap and thong,The reins and bridle-band as well,Whose cross-bar is lifted, the awakened one:He is the one I call a brahmin.",
    "mn98:35": "Who endures without a trace of hateAbuse, violence, and bondage too,With strength of patience well arrayed:He is the one I call a brahmin.",
    "mn98:36": "Who does not flare up with anger,Dutiful, virtuous, and humble,Subdued, bearing his final body:He is the one I call a brahmin.",
    "mn98:37": "Who, like the rain on lotus leaves,Or mustard seed on the point of an awl,Clings not at all to sensual pleasures:He is the one I call a brahmin.",
    "mn98:38": "Who knows right here within himselfThe destruction of all suffering,With burden lowered, and detached:He is the one I call a brahmin.",
    "mn98:39": "Who with deep understanding, wise,Can tell the path from the not-pathAnd has attained the goal supreme:He is the one I call a brahmin.",
    "mn98:40": "Aloof alike from householdersAnd those gone into homelessness,Who wanders without home or wish:He is the one I call a brahmin.",
    "mn98:41": "Who has laid aside the rodAgainst all beings frail or bold,Who does not kill or have them killed:He is the one I call a brahmin.",
    "mn98:42": "Who is unopposed among opponents,Peaceful among those given to violence,Who does not cling among those who cling:He is the one I call a brahmin.",
    "mn98:43": "Who has dropped all lust and hate,Dropped conceit and contempt,Like mustard seed on the point of an awl:He is the one I call a brahmin.",
    "mn98:44": "Who utters speech free from harshness,Full of meaning, ever truthful,Which does not offend anyone:He is the one I call a brahmin.",
    "mn98:45": "Who in the world will never takeWhat is not given, long or short,Small or big or fair or foul:He is the one I call a brahmin.",
    "mn98:46": "Who has no more inner yearningsRegarding this world and the next,Who lives unyearning and detached:He is the one I call a brahmin.",
    "mn98:47": "Who has no more indulgencesNo more perplexity since he knows;Who has gained firm footing in the Deathless:He is the one I call a brahmin.",
    "mn98:48": "Who has transcended all ties hereOf both merit and evil deeds,Is sorrowless, stainless, and pure:He is the one I call a brahmin.",
    "mn98:49": "Who, pure as the spotless moon,Is clear and limpid, and in whomDelight and being have been destroyed:He is the one I call a brahmin.",
    "mn98:50": "Who has passed beyond the swamp,The mire, saṁsāra, all delusion,Who has crossed to the further shoreAnd meditates within the jhānas,Is unperturbed and unperplexed,Attained Nibbāna through no clinging:He is the one I call a brahmin.",
    "mn98:51": "Who has abandoned sensual pleasuresAnd wanders here in homelessnessWith sense desires and being destroyed:He is the one I call a brahmin.",
    "mn98:52": "Who has abandoned craving too,And wanders here in homelessness,With craving and being both destroyed:He is the one I call a brahmin.",
    "mn98:53": "Who leaves behind all human bondsAnd has cast off the bonds of heaven,Detached from all bonds everywhere:He is the one I call a brahmin.",
    "mn98:54": "Who leaves behind delight and discontent,Who is cool and acquisitionless,The hero who has transcended the whole world:He is the one I call a brahmin.",
    "mn98:55": "Who knows how beings pass awayTo reappear in many a mode,Unclutching he, sublime, awake:He is the one I call a brahmin.",
    "mn98:56": "Whose destination is unknownTo gods, to spirits, and to men,An arahant with taints destroyed:He is the one I call a brahmin.",
    "mn98:57": "Who has no impediments at all,Before, behind, or in the middle,Who is unimpeded and clings no more:He is the one I call a brahmin.",
    "mn98:58": "The herd's leader, perfected hero,The great seer whose victory is won,Unperturbed, cleansed, awakened:He is the one I call a brahmin.",
    "mn98:59": "Who knows his manifold past livesAnd sees the heavens and states of woe,Who has reached the destruction of birth:He is the one I call a brahmin.",
    "mn98:60": "\"For name and clan are assignedAs mere designations in the world;Originating in conventions,They are assigned here and there.",
    "mn98:61": "For those who do not know this fact,Wrong views have long underlain their hearts;Not knowing, they declare to us:‘One is a brahmin by birth.’",
    "mn98:62": "One is not a brahmin by birth,Nor by birth a non-brahmin.By action is one a brahmin,By action is one a non-brahmin.",
    "mn98:63": "For men are farmers by their acts,[n.905]MA: By the present volitional action which accomplishes the work of farming, etc.And by their acts are craftsmen too;And men are merchants by their acts,And by their acts are servants too.",
    "mn98:64": "And men are robbers by their acts,And by their acts are soldiers too;And men are chaplains by their acts,And by their acts are rulers too.",
    "mn98:65": "\"So that is how the truly wiseSee action as it really is,Seers of dependent origination,Skilled in action and its results.[n.906] With this verse the word \"kamma\" undergoes a shift in meaning signalled by the term \"dependent origination.\" \"Kamma\" here no longer means simply present action determining one's social status, but action in the special sense of a force binding beings to the round of existence. This same line of thought becomes even clearer in the next verse.",
    "mn98:66": "Action makes the world go round,Action makes this generation turn.Living beings are bound by actionLike the chariot wheel by the linchpin.",
    "mn98:67": "Asceticism, the holy life,Self-control and inner training —By this one becomes a brahmin,In this supreme brahminhood lies.[n.907] This verse and the following one again refer to the arahant. Here, however, the contrast is not between the arahant as the one made holy by his actions and the born brahmin unworthy of his designation, but between the arahant as the one liberated from the bondage of action and result and all other beings who remain tied by their actions to the wheel of birth and death.",
    "mn98:68": "One possessing the triple knowledge,Peaceful, with being all destroyed:Know him thus, O Vāseṭṭha,As Brahmā and Sakka for those who understand.\"",
    "mn98:69": "When this was said, the brahmin students Vāseṭṭha and Bhāradvāja said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! … From today let Master Gotama remember us as lay followers who have gone to him for refuge for life.\""
}