{
    "mn99:1": "Thus have I heard. On one occasion the Blessed One was living at Sāvatthī in Jeta's Grove, Anāthapiṇḍika's Park.",
    "mn99:2": "\"Student, I speak about this after making an analysis;[n.909]Vibhajjavādo kho aham ettha.Such statements account for the later designation of Buddhism asvibhajjavāda,\"the doctrine of analysis.\" As the context makes clear, the Buddha calls himself avibhajjavādin,not because he analyses things into their constituents (as is popularly believed), but because he distinguishes the different implications of a question without answering one-sidedly.I do not speak about this one-sidedly. I do not praise the wrong way of practice on the part either of a householder or one gone forth; for whether it be a householder or one gone forth, one who has entered on the wrong way of practice, by reason of his wrong way of practice, is not accomplishing the true way, the Dhamma that is wholesome. I praise the right way of practice on the part either of a householder or one gone forth; for whether it be a householder or one gone forth, one who has entered on the right way of practice, by reason of his right way of practice, is accomplishing the true way, the Dhamma that is wholesome.\"",
    "mn99:3": "\"Master Gotama, the brahmins say this: ‘Since the work of the household life involves a great deal of activity, great functions, great engagements, and great undertakings, it is of great fruit. Since the work of those gone forth involves a small amount of activity, small functions, small engagements, and small undertakings, it is of small fruit.’ What does Master Gotama say about this?\"",
    "mn99:4": "\"Again, student, I speak about this after making an analysis; I do not speak about this one-sidedly. There is work involving a great deal of activity, great functions, great engagements, and great undertakings, which, when it fails, is of small fruit. There is work involving a great deal of activity, great functions, great engagements, and great undertakings, which, when it succeeds, is of great fruit. There is work involving a small amount of activity, small functions, small engagements, and small undertakings, which, when it fails, is of small fruit. There is work involving a small amount of activity, small functions, small engagements, and small undertakings, which, when it succeeds, is of great fruit.",
    "mn99:5": "\"Just as agriculture, student, is work that involves a great deal of activity … but is of small fruit when it fails, so the work of the household life involves a great deal of activity, great functions, great engagements, and great undertakings, but is of small fruit when it fails. Just as agriculture is work that involves a great deal of activity … and is of great fruit when it succeeds, so the work of the household life involves a great deal of activity, great functions, great engagements, and great undertakings, and is of great fruit when it succeeds. Just as trade is work that involves a small amount of activity … and is of small fruit when it fails, so the work of those gone forth involves a small amount of activity, small functions, small engagements, and small undertakings, and is of small fruit when it fails. Just as trade is work that involves a small amount of activity … but is of great fruit when it succeeds, so the work of those gone forth involves a small amount of activity, small functions, small engagements, and small undertakings, but is of great fruit when it succeeds.\"",
    "mn99:6": "\"Master Gotama, the brahmins prescribe five things for the performance of merit, for accomplishing the wholesome.\"",
    "mn99:7": "\"How then, student,[n.911] As atMN 95.13.among the brahmins is there even a single brahmin who says thus: ‘I declare the result of these five things having realised it myself with direct knowledge’?\" — \"No, Master Gotama.\"",
    "mn99:8": "\"So, student, it seems that among the brahmins there is not even a single brahmin who says thus: ‘I declare the result of these five things having realised it myself with direct knowledge. ’ And among the brahmins there is not even a single teacher or a single teacher's teacher back to the seventh generation of teachers, who says thus: ‘I declare the result of these five things having realised it myself with direct knowledge.’ And the ancient brahmin seers, the creators of the hymns, the composers of the hymns … even these ancient brahmin seers did not say thus: ‘We declare the result of these five things having realised it ourselves with direct knowledge.’",
    "mn99:9": "Suppose there were a file of blind men each in touch with the next: the first one does not see, the middle one does not see, and the last one does not see. So too, student, in regard to their statement the brahmins seem to be like a file of blind men: the first one does not see, the middle one does not see, and the last one does not see.\"",
    "mn99:10": "When this was said, the brahmin student Subha, Todeyya's son, was angry and displeased with the simile of the file of blind men, and he reviled, disparaged, and censured the Blessed One, saying: \"The recluse Gotama will be worsted.\" Then he said to the Blessed One: \"Master Gotama, the brahmin Pokkharasāti of the Upamaññā clan, lord of the Subhaga Grove, says thus:[n.912] This statement must have been made before Pokkharasāti became a follower of the Buddha, as is mentioned atMN 95.9.‘Some recluses and brahmins here claim superhuman states, distinctions in knowledge and vision worthy of the noble ones. But what they say turns out to be ridiculous; it turns out to be mere words, empty and hollow. For how could a human being know or see or realise a superhuman state, a distinction in knowledge and vision worthy of the noble ones? That is impossible.’\"",
    "mn99:11": "\"How then, student, does the brahmin Pokkharasāti understand the minds of all recluses and brahmins, having encompassed them with his own mind?\"",
    "mn99:12": "\"Student, suppose there were a man born blind who could not see dark and light forms, who could not see blue, yellow, red, or carmine forms, who could not see what was even and uneven, who could not see the stars or the sun and moon. He might say thus: ‘There are no dark and light forms, and no one who sees dark and light forms; there are no blue, yellow, red, or carmine forms, and no one who sees blue, yellow, red, or carmine forms; there is nothing even and uneven, and no one who sees anything even and uneven; there are no stars and no sun and moon, and no one who sees stars and the sun and moon. I do not know these, I do not see these, therefore these do not exist.’ Speaking thus, student, would he be speaking rightly?\"",
    "mn99:13": "\"No, Master Gotama. There are dark and light forms, and those who see dark and light forms … there are the stars and the sun and moon, and those who see the stars and the sun and moon. Saying, ‘I do not know these, I do not see these, therefore these do not exist,’ he would not be speaking rightly.\"",
    "mn99:14": "\"So too, student, the brahmin Pokkharasāti is blind and visionless. That he could know or see or realise a superhuman state, a distinction in knowledge and vision worthy of the noble ones — this is impossible.",
    "mn99:15": "What do you think, student? What is better for those well-to-do brahmins of Kosala such as the brahmin Caṅkī, the brahmin Tārukkha, the brahmin Pokkharasāti, the brahmin Jāṇussoṇi, or your father, the brahmin Todeyya — that the statements they make accord with worldly convention or flaunt worldly convention?\"",
    "mn99:16": "\"What is better for them, that the statements they make be thoughtful or thoughtless?\"",
    "mn99:17": "\"What is better for them, that they make their statements after reflecting or without reflecting?\"",
    "mn99:18": "\"What is better for them, that the statements they make be beneficial or unbeneficial?\"",
    "mn99:19": "\"What do you think, student? If that is so, did the statement made by the brahmin Pokkharasāti accord with worldly convention or flaunt worldly convention?\"",
    "mn99:20": "\"Was the statement made thoughtful or thoughtless?\"",
    "mn99:21": "\"Was the statement made after reflecting or without reflecting?\"",
    "mn99:22": "\"Was the statement made beneficial or unbeneficial?\"",
    "mn99:23": "\"Now there are these five hindrances, student. What are the five? The hindrance of sensual desire, the hindrance of ill will, the hindrance of sloth and torpor, the hindrance of restlessness and remorse, and the hindrance of doubt. These are the five hindrances. The brahmin Pokkharasāti is obstructed, hindered, blocked, and enveloped by these five hindrances. That he could know or see or realise a superhuman state, a distinction in knowledge and vision worthy of the noble ones — this is impossible.",
    "mn99:24": "\"Now there are these five cords of sensual pleasure, student. What are the five? Forms cognizable by the eye that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. Sounds cognizable by the ear … Odours cognizable by the nose … Flavours cognizable by the tongue … Tangibles cognizable by the body that are wished for, desired, agreeable, and likeable, connected with sensual desire and provocative of lust. These are the five cords of sensual pleasure. The brahmin Pokkharasāti is tied to these five cords of sensual pleasure, infatuated with them and utterly committed to them; he enjoys them without seeing the danger in them or understanding the escape from them. That he could know or see or realise a superhuman state, a distinction in knowledge and vision worthy of the noble ones — this is impossible.",
    "mn99:25": "\"What do you think, student? Which of these two fires would have abetterflame, colour, and radiance — a fire that might burn in dependence on fuel, such as grass and wood, or a fire that might burn independent of fuel, such as grass and wood?\"",
    "mn99:26": "And what, student, is the rapture that is apart from sensual pleasures, apart from unwholesome states? Here, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters upon and abides in the first jhāna, which is accompanied by applied and sustained thought, with rapture and pleasure born of seclusion. This is a rapture apart from sensual pleasures, apart from unwholesome states. Again, with the stilling of applied and sustained thought, a bhikkhu enters upon and abides in the second jhāna, which has self-confidence and singleness of mind without applied and sustained thought, with rapture and pleasure born of concentration. This too is a rapture apart from sensual pleasures, apart from unwholesome states.",
    "mn99:27": "\"Of those five things, student, that the brahmins prescribe for the performance of merit, for accomplishing the wholesome, which of the five do they prescribe as the most fruitful for the performance of merit, for accomplishing the wholesome?\"",
    "mn99:28": "\"What do you think, student? Here a brahmin might be holding a great sacrifice, and two other brahmins would go there thinking to take part in that great sacrifice. One brahmin among them would think: ‘Oh, that only I might get the best seat, the best water, the best almsfood in the refectory; that no other brahmin might get the best seat, the best water, the best almsfood in the refectory!’ And it is possible that the other brahmin, not that brahmin, gets the best seat, the best water, the best almsfood in the refectory. Thinking about this, the first brahmin might become angry and displeased. What kind of result do the brahmins describe for this?\"",
    "mn99:29": "\"Those five things, student, that the brahmins prescribe for the performance of merit, for accomplishing the wholesome — where do you often see those five things, among householders or among those gone forth?\"",
    "mn99:30": "\"Those five things, student, that the brahmins prescribe for the performance of merit, for accomplishing the wholesome, I call equipment of the mind, that is, for developing a mind that is without hostility and without ill will. Here, student, a bhikkhu is a speaker of truth. Thinking, ‘I am a speaker of truth,’ he gains inspiration in the meaning, gains inspiration in the Dhamma, gains gladness connected with the Dhamma. It is that gladness connected with the wholesome that I call an equipment of the mind. Here, student, a bhikkhu is an ascetic … one who is celibate … one who engages in study … one who engages in generosity. Thinking, ‘I am one who engages in generosity,’ he gains inspiration in the meaning, gains inspiration in the Dhamma, gains gladness connected with the Dhamma. It is that gladness connected with the wholesome that I call an equipment of the mind. Thus those five things that the brahmins prescribe for the performance of merit, for accomplishing the wholesome, I call equipment of the mind, that is, for developing a mind that is without hostility and without ill will.\"",
    "mn99:31": "When this was said, the brahmin student Subha, Todeyya's son, said to the Blessed One: \"Master Gotama, I have heard that the recluse Gotama knows the path to the company of Brahmā.\"",
    "mn99:32": "\"What do you think, student? Is the village of Naḷakāra near here, not far from here?\"",
    "mn99:33": "\"Yes, sir, the village of Naḷakāra is near here, not far from here.\"",
    "mn99:34": "\"What do you think, student? Suppose there was a man born and raised in the village of Naḷakāra, and as soon as he had left Naḷakāra they asked him about the path to the village. Would that man be slow or hesitant in answering?\"",
    "mn99:35": "\"No, Master Gotama.",
    "mn99:36": "Why is that?",
    "mn99:37": "Because that man has been born and raised in Naḷakāra, and is well acquainted with all the paths to the village.\"",
    "mn99:38": "\"Master Gotama, I have heard that the recluse Gotama teaches the path to the company of Brahmā. It would be good if Master Gotama would teach me the path to the company of Brahmā.\"",
    "mn99:39": "\"Then, student, listen and attend closely to what I shall say.\"",
    "mn99:40": "\"What, student, is the path to the company of Brahmā? Here a bhikkhu abides pervading one quarter with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to himself, he abides pervading the all-encompassing world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, without hostility, and without ill will. When the deliverance of mind by loving-kindness is developed in this way, no limiting action remains there, none persists there. Just as a vigorous trumpeter could make himself heard without difficulty in the four quarters, so too, when the deliverance of mind by loving-kindness is developed in this way, no limiting action remains there, none persists there.[n.915]MAexplains limiting action(pamāṇakataṁ kammaṁ)as kamma pertaining to the sense sphere(kāmāvacara). It is contrasted with a limitless or immeasurable action, namely, the jhānas pertaining to the fine-material sphere or the immaterial sphere. In this case thebrahmavihārasdeveloped to the jhānic level are intended. When a jhāna pertaining to the fine-material sphere or the immaterial sphere is attained and mastered, a kamma pertaining to the sense sphere cannot overpower it and gain the opportunity to yield its own result. Rather, the kamma pertaining to the fine-material sphere or the immaterial sphere overpowers the sense-sphere kammas and produces its results. Obstructing the result of the sense-sphere kammas, thebrahmavihārathat has been mastered leads to rebirth in the company of Brahmā.This is the path to the company of Brahmā.",
    "mn99:41": "\"Again, a bhikkhu abides pervading one quarter with a mind imbued with compassion … with a mind imbued with altruistic joy … with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth; so above, below, around, and everywhere, and to all as to himself, he abides pervading the all-encompassing world with a mind imbued with equanimity, abundant, exalted, immeasurable, without hostility, and without ill will. When the deliverance of mind by equanimity is developed in this way, no limiting action remains there, none persists there. Just as a vigorous trumpeter could make himself heard without difficulty in the four quarters, so too, when the deliverance of mind by equanimity is developed in this way, no limiting action remains there, none persists there. This too is the path to the company of Brahmā.\"",
    "mn99:42": "When this was said, the brahmin student Subha, Todeyya's son, said to the Blessed One: \"Magnificent, Master Gotama! Magnificent, Master Gotama! Master Gotama has made the Dhamma clear in many ways, as though he were turning upright what had been overturned, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms. I go to Master Gotama for refuge and to the Dhamma and to the Saṅgha of bhikkhus. Let Master Gotama remember me as a lay follower who has gone to him for refuge for life.",
    "mn99:43": "Now on that occasion the brahmin Jāṇussoṇi was driving out of Sāvatthī in the middle of the day in an all-white chariot drawn by white mares.[n.916] As atMN 27.2.He saw the brahmin student Subha, Todeyya's son, coming in the distance and asked him: \"Now where is Master Bhāradvāja coming from in the middle of the day?\"",
    "mn99:44": "When this was said, the brahmin Jāṇussoṇi got down from his all-white chariot drawn by white mares, and after arranging his upper robe on one shoulder, he extended his hands in reverential salutation towards the Blessed One and uttered this exclamation: \"It is a gain for King Pasenadi of Kosala, it is a great gain for King Pasenadi of Kosala that the Tathāgata, accomplished and fully enlightened, lives in his realm.\""
}