{
    "dn11:1": "Thus have I heard. Once the Lord was staying at Nālanda, in Pāvārika's mango grove. And the householder Kevaddha[n.230] Or Kevatta ('Fisher') as several manuscripts have it. RD admits that 'it may turn out to be the better of the two.'came to the Lord, prostrated himself before him, and sat down to one side. He then said: 'Lord, this Nāḷandā is rich, prosperous, populous, and full of people who have faith in the Lord. It would be well if the Lord were to cause some monk to perform superhuman feats and miracles. In this way Nāḷandā would come to have even more faith in the Lord.'",
    "dn11:2": "For a second time Kevaddha said: 'Lord, I would not be importunate, but I still say: \"This Nalanda is rich, prosperous … and would come to have even more faith in the Lord.\"' And the Lord replied as before.",
    "dn11:3": "When Kevaddha repeated his request for a third time, the Lord said:",
    "dn11:4": "'Kevaddha, there are three kinds of miracle that I have declared, having realised them by my own insight. Which three? The miracle of psychic power,[n.231]Iddhi-pāṭihāriya:'miracle of iddhi' (seen.128).the miracle of telepathy,[n.232]Ādesanā-pāṭihāriya.This is actual telepathy, not the same asmanesika'mind-searching' or guessing another's thoughts mentioned inn.31.the miracle of instruction.[n.233]Anusāsani-pāṭihāriya.The Buddha’s teaching can be called miraculous because it leads to the most wonderful results.",
    "dn11:5–7": "'What is the miracle of psychic power? Here, Kevaddha, a monk displays various psychic powers in different ways. Being one he becomes many, he becomes many and having been many, he becomes one; he appears and vanishes; he goes unimpeded through walls, ramparts, and mountains as if through space; he dives in and out of the earth as if it were water; he walks on water without sinking as if it were earth; sitting cross-legged he travels through space like a winged bird; with his hand he touches and strokes the sun and the moon, so mighty and powerful; he exercises mastery over the body as far as the Brahma-world.",
    "dn11:8": "'He tells this to someone else who is sceptical and unbelieving, saying: \"It is wonderful, sir, it is marvellous, the great power and skill of that ascetic …\" And that man might say: \"Sir, there is something called the Gandhāra charm.[n.234] A charm for making oneself invisible.It is by means of this that that monk becomes many…\"",
    "dn11:9": "What do you think, Kevaddha, would not a sceptic say that to a believer?' 'He would, Lord.' 'And that is why, Kevaddha, seeing the danger of such miracles, I dislike, reject and despise them.",
    "dn11:10–11": "'And what is the miracle of telepathy? Here, a monk reads the minds of other beings, of other people, reads their mental states, their thoughts and ponderings, and says: \"That is how your mind is, that is how it inclines, that is in your heart.\" Then someone who has faith and trust sees him doing these things.",
    "dn11:12–13": "'He tells this to someone else who is sceptical and unbelieving, saying: \"It is wonderful, sir, it is marvellous, the great power and skill of that ascetic …\" And that man might say: \"Sir, there is something called the Manika charm.[n.235] Or cintamani vijjā (DA), the 'jewel of thought' charm which enabled one to know the thoughts of others. The sceptic, of course, does not have a really convincing way of explaining things away. Modem parallels suggest themselves.It is by means of this that that monk can read the minds of others …\" And that is why, seeing the danger of such miracles, I… despise them.",
    "dn11:14": "'And what is the miracle of instruction? Here, Kevaddha, a monk gives instruction as follows: \"Consider in this way, don't consider in that, direct your mind this way, not that way, give up that, gain this and persevere in it.\" That, Kevaddha, is called the miracle of instruction.",
    "dn11:15": "'Again, Kevaddha, a Tathāgata arises in the world, an Arahant, fully-enlightened Buddha, endowed with wisdom and conduct, Well-Farer, Knower of the worlds, incomparable Trainer of men to be tamed, Teacher of gods and humans, enlightened and blessed. He, having realised it by his own super-knowledge, proclaims this world with its devas, māras and Brahmās, its princes and people. He preaches the Dhamma which is lovely in its beginning, lovely in its middle, lovely in its ending, in the spirit and in the letter, and displays the fully-perfected and purified holy life. A disciple goes forth and practises the moralitiesSutta 2, verses 41–63. He guards the sense-doors and attains the four jhānasSutta 2, verses 64–82; he attains various insightsSutta 2, verses 83–84; he realises the Four Noble Truths, the path and the cessation of the corruptionsSutta 2, verses 85–97,[n.236] Omitting DN 2.85–96, which deal with the powers disparagingly mentioned in verse 4ff.and he knows: \"…There is nothing further here.\" That, Kevaddha, is called the miracle of instruction.",
    "dn11:16": "'And I, Kevaddha, have experienced these three miracles by my own super-knowledge.",
    "dn11:17": "Once, Kevaddha, in this order of monks the thought occurred to a certain monk: \"I wonder where the four great elements — the earth element, the water element, the fire element, the air element — cease without remainder.\"",
    "dn11:18": "And that monk attained to such a state of mental concentration that the way to the deva-realms appeared before him.",
    "dn11:19": "At this question the devas of the Four Great Kings said to him: \"Monk, we don't know where the four great elements cease without remainder. But the Four Great Kings are loftier and wiser than we are. They may know where the four great elements cease … \"",
    "dn11:20": "'So that monk went to the Four Great Kings and asked the same question, but they replied: \"We don't know, but the Thirty-Three Gods may know…\"",
    "dn11:21": "'So that monk went to the Thirty-Three Gods, who said: \"We don't know, but Sakka, lord of the gods, may know…\"",
    "dn11:22": "'Sakka, lord of the gods, said: \"The Yāma devas may know … \"",
    "dn11:24": "'Then that monk, by the appropriate concentration, made the way to the Brahmā world appear before him. He went to the devas of Brahmā's retinue and asked them. They said: \"We don't know. But there is Brahmā, Great Brahmā, the Conqueror, the Unconquered, the All-Seeing, All-Powerful, the Lord, the Maker and Creator, the Ruler, Appointer and Orderer, Father of All That Have Been and Shall Be. He is loftier and wiser than we are. He would know where the four great elements cease without remainder.\"",
    "dn11:25": "\"And where, friends, is this Great Brahmā now?\" \"Monk, we do not know when, how and where Brahmā will appear. But when the signs are seen — when a light appears and a radiance shines forth — then Brahmā will appear. Such signs are an indication that he will appear.\"",
    "dn11:26": "And that monk went up to him and said: \"Friend, where do the four great elements — earth, water, fire, air — cease without remainder?\" to which the Great Brahmā replied: \"Monk, I am Brahmā, Great Brahmā, the Conqueror, the Unconquered, the All-Seeing, All-Powerful, the Lord, the Maker and Creator, the Ruler, Appointer and Orderer, Father of All That Have Been and Shall Be.\"",
    "dn11:27": "'A second time the monk said: \"Friend, I did not ask if you are Brahmā, Great Brahmā … I asked you where the four great elements cease without remainder.\"",
    "dn11:28": "And a second time the Great Brahmā replied as before.",
    "dn11:29": "Then, Kevaddha, the Great Brahmā took that monk by the arm, led him aside and said: \"Monk, these devas believe there is nothing Brahmā does not see, there is nothing he does not know, there is nothing he is unaware of. That is why I did not speak in front of them. But, monk, I don't know where the four great elements cease without remainder. And therefore, monk, you have acted wrongly, you have acted incorrectly by going beyond the Blessed Lord and going in search of an answer to this question elsewhere. Now, monk, you just go to the Blessed Lord and put this question to him, and whatever answer he gives, accept it.\"",
    "dn11:30": "'So that monk, as swiftly as a strong man might flex or unflex his arm, vanished from the Brahma world and appeared in my presence. He prostrated himself before me, then sat down to one side and said: \"Lord, where do the four great elements — the earth element, the water element, the fire element and the air element — cease without remainder?\"",
    "dn11:31": "'I replied: \"Monk, once upon a time seafaring merchants, when they set sail on the ocean, took in their ship a land-sighting bird. When they could not see the land themselves, they released this bird. The bird flew to the east, to the south, to the west, to the north, it flew to the zenith and to the intermediate points of the compass. If it saw land anywhere, it flew there. But if it saw no land, it returned to the ship. In the same way, monk, you have been as far as the Brahma world searching for an answer to your question and not finding it, and now you come back to me. But, monk, you should not ask your question in this way: 'Where do the four great elements — the earth element, the water element, the fire element, the air element — cease without remainder?'",
    "dn11:32": "Instead, this is how the question should have been put:",
    "dn11:33": "'Where do water, earth,fire and air no footing find?Where are long and short,small and great, fair and foulWhere are \"name-and-form\"wholly destroyed?'[n.239] Mind and body, i.e. 'subject and object' (Neumann quoted by RD).",
    "dn11:34": "And the answer is:",
    "dn11:35": "'Where consciousness is signless,[n.240]Anidassanaṁ:or 'invisible'. Ñāṇananda renders it 'non-manifesting'.boundless, all-luminous,[n.241] This word(pabhaṁorpahaṁ)has been variously interpreted. DA takes it in the sense of a ford, or a place to enter the water 'accessible from all sides', by means of which one can reach Nibbāna. There is an improbable suggestion that the meaning is 'rejecting', and Mrs Bennett translates the line: 'Where the consciousness that makes endless comparisons is entirely abandoned', which seems to involve a misunderstanding of anidassanaṁ. (But see next note). The same sequence also occurs atMN 49.11rendered by I.B. Horner (MLS i, 392): 'Discriminative consciousness (= viññāṇaṁ) which cannot be characterised(= anidassanaṁ), which is unending, lucid in every respect(= sabbato pabhaṁ).' The two passages should be studied in conjunction. Cf. also AN 1.6: 'This mind(citta)is luminous, but is defiled by adventitious defilements.' See important discussion by Ñāṇananda, 57–63.That's where water, earth,fire and air find no footing.",
    "dn11:36": "There both long and short,small and great, fair and foulThere \"name-and-form\"are wholly destroyed.With the cessation of consciousnessthis is all destroyed.\"[n.242] G.C. Pande (Studies in the Origins of Buddhism,92, note 21) says: 'Buddha says that the question should not be asked in the manner in which it is done in the prose quotation above, but thus — as in the metrical lines that follow. One may pertinently ask: \"Why? what is wrong with the prose formulation?\" The only answer would seem to be: \"Nothing. But the verses have to be brought in!\".Ñāṇananda (Concept and Reality,59) explains it thus: 'The last line of the verse stresses the fact that the four great elements do not find a footing — and that 'Name-and-Form' (comprehending them) can be cut-off completely — in that'anidassana-viññāṇa'(the 'nonmanifestative consciousness') of the Arahant, by the cessation of his normal consciousness which rests on the data of sense-experience. This is a corrective to that monk's notion that the four elements can cease altogether somewhere — a notion which has its roots in the popular conception of self-existing material elements. The Buddha’s reformulation of the original question and this concluding line are meant to combat this wrong notion.'",
    "dn11:37": "Thus the Lord spoke, and the householder Kevaddha, delighted, rejoiced at his words."
}