{
    "dn13:1": "Thus have I heard. Once the Lord was touring Kosala with a large company of some five hundred monks. He came to a Kosalan Brahmin village called Manasakata, and stayed to the north of the village in a mango-grove on the bank of the River Aciravati.",
    "dn13:2": "And at that time many very well-known and prosperous Brahmins were staying at Manasakata, including Canki, Tārukkha, Pokkharasati, Jāṇussoni, and Todeyya.",
    "dn13:3": "And Vasettha and Bharadvaja went strolling along the road, and as they did so, an argument broke out between them on the subject of right and wrong paths.",
    "dn13:4": "Then Vasettha said to Bharadvaja: 'This ascetic Gotama is staying to the north of the village, and concerning this Blessed Lord a good report has been spread about: \"This Blessed Lord is an Arahant, a fully-enlightened Buddha, perfected in knowledge and conduct, a Well-Farer, Knower of the worlds, unequalled Trainer of men to be tamed, Teacher of gods and humans, a Buddha, a Blessed Lord.\" He proclaims this world with its gods, maras, Brahmas, the world of ascetics and Brahmins with its princes and people, having come to know it by his own knowledge. He teaches a Dhamma that is lovely in its beginning, lovely in its middle and lovely in its ending, in the spirit and in the letter, and he displays the fully-perfected, thoroughly purified holy life. And indeed it is good to see such Arahants.' Let us go to the ascetic Gotama and ask him, and whatever he tells us, we shall accept.' And Bharadvaja agreed.",
    "dn13:5": "So the two of them went to see the Lord. Having exchanged courtesies with him, they sat down to one side, and Vasettha said: 'Reverend Gotama, as we were strolling along the road, we got to discussing right and wrong paths. I said: \"This is the only straight path… as is taught by the Brahmin Pokkharasati\", and Bhāradvāja said: \"This is the only straight path…as is taught by the Brahmin Tārukkha.\" This is our dispute, our quarrel, our difference.'",
    "dn13:6": "'So, Vāseṭṭha, you say that the way to union with Brahmā is that taught by the Brahmin Pokkharasāti, and Bhāradvāja says it is that taught by the Brahmin Tārukha. What is the dispute, the quarrel, the difference all about?'",
    "dn13:7": "'Right and wrong paths, Reverend Gotama. There are so many kinds of Brahmins who teach different paths: the Addhariya, the Tittiriya, the Chandoka, the Chandāva, the Brahmacariya[n.250] The alternative reading, adopted by RD, is Bavharijā, but RD notes: 'If we adopt the other reading (i.e.Brāhmacariyā,as he omits to say) for the last in the list, then those priests who relied on liturgy, sacrifice or chant would be contrasted with those who had \"gone forth\" as religieux, either as Tāpasas or as Bhikshus.'Brahmins — do all these ways lead to union with Brahmā?",
    "dn13:8": "Just as if there were near a town or village many different paths — do all these come together at that place? And likewise, do the ways of the various Brahmins…lead the one who follows them to union with Brahmā?'",
    "dn13:9": "'You say: \"They lead\", Vaseṭṭha?' 'I say: \"They lead\", Reverend Gotama.'",
    "dn13:10": "'But, Vāseṭṭha, is there then a single one of these Brahmins learned in the Three Vedas who has seen Brahmā face to face?' 'No, Reverend Gotama.'",
    "dn13:11-12": "'Then has the teacher's teacher of any one of them seen Brahmā face to face?' 'No, Reverend Gotama.'",
    "dn13:13": "'Then has the ancestor seven generations back of the teacher of one of them seen Brahmā face to face?' 'No, Reverend Gotama.'",
    "dn13:14": "'Well then, Vaseṭṭha, what about the early sages of those Brahmins learned in the Three Vedas, the makers of the mantras, the expounders of the mantras, whose ancient verses are chanted, pronounced and collected by the Brahmins of today, and sung and spoken about — such as Atthaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Angirasa, Bhāradvāja, Vāsettha, Kassapa, Bhagu[n.251] The ten rishi authors of the Vedic mantras. Cf.MN 95.25.– did they ever say: \"We know and see when, how and where Brahmā appears\"?'[n.252] Cf.DN 11.24.'No, Reverend Gotama.'",
    "dn13:15": "'So, Vāseṭṭha, not one of these Brahmins learned in the Three Vedas has seen Brahmā face to face, nor has one of their teachers, or teacher's teachers, nor even the ancestor seven generations back of one of their teachers. Nor could any of the early sages say: \"We know and see when, how and where Brahmā appears.\" So what these Brahmins learned in the Three Vedas are saying is: \"We teach this path to union with Brahmā that we do not know or see, this is the only straight path…leading to union with Brahmā.\"",
    "dn13:16": "What do you think, Vāseṭṭha? Such being the case, does not what these Brahmins declare turn out to be ill-founded?' 'Yes indeed, Reverend Gotama.'",
    "dn13:17": "'Well, Vāseṭṭha, when these Brahmins learned in the Three Vedas teach a path that they do not know or see, saying: \"This is the only straight path … \",this cannot possibly be right.",
    "dn13:18": "Just as a file of blind men go on, clinging to each other, and the first one sees nothing, the middle one sees nothing, and the last one sees nothing[n.253] Cf.MN95.27.— so it is with the talk of these Brahmins learned in the Three Vedas: the first one sees nothing, the middle one sees nothing, the last one sees nothing. The talk of these Brahmins learned in the Three Vedas turns out to be laughable, mere words, empty and vain.",
    "dn13:19": "'What do you think, Vāseṭṭha? Do these Brahmins learned in the Three Vedas see the sun and moon just as other people do, and when the sun and moon rise and set do they pray, sing praises and worship with clasped hands?'",
    "dn13:20": "'They do, Reverend Gotama.'",
    "dn13:21": "'What do you think, Vāseṭṭha? These Brahmins learned in the Three Vedas, who can see the sun and moon just as other people do, … can they point out a way to union with the sun and moon, saying: \"This is the only straight path… that leads to union with the sun and moon\"?' 'No, Reverend Gotama.'",
    "dn13:22": "'So, Vāseṭṭha, these Brahmins learned in the Three Vedas cannot point out a way to union with the sun and moon, which they have seen.",
    "dn13:23": "And, too, none of them has seen Brahmā face to face,…",
    "dn13:24–25": "Does not what these Brahmins declare turn out to be ill-founded?' 'Yes indeed, Reverend Gotama.'",
    "dn13:26": "'Vaseṭṭha, it is just as if a man were to say: \"I am going to seek out and love the most beautiful girl in the country.\" They might say to him: \"… Do you know what caste she belongs to?\" \"No.\"",
    "dn13:27": "\"Well, do you know her name, her clan, whether she is tall or short…, dark or light-complexioned…, or where she comes from?\" \"No.\" And they might say: \"Well then, you don't know or see the one you seek for and desire?\" and he would say: \"No.\"",
    "dn13:28": "Does not the talk of that man turn out to be stupid?' 'Certainly, Reverend Gotama.'",
    "dn13:29–30": "'Then, Vāseṭṭha, it is like this: not one of these Brahmins … has seen Brahmā face to face, nor has one of their teachers …' 'Yes indeed, Reverend Gotama.'",
    "dn13:31": "'That is right, Vāseṭṭha. When these Brahmins learned in the Three Vedas teach a path that they do not know and see, this cannot possibly be right.",
    "dn13:32": "'Vāseṭṭha, it is just as if a man were to build a staircase for a palace at a crossroads. People might say: \"This staircase for a palace — do you know whether the palace will face east or west, north or south, or whether it will be high, low or of medium height?\" and he would say: \"No.\" And they might say: \"Well then, you don't know or see what kind of a palace you are building the staircase for?\" and he would say: \"No.\" Does not the talk of that man turn out to be stupid?' 'Certainly, Reverend Gotama.'",
    "dn13:33–37": "as verse 20",
    "dn13:38": "'Vāseṭṭha, it is just as if this River Aciravatī were brimful of water so that a crow could drink out of it, and a man should come along wishing to cross over, to get to the other side, to get across, and, standing on this bank, were to call out: \"Come here, other bank, come here!\"",
    "dn13:39": "What do you think, Vasettha? Would the other bank of the River Aciravati come over to this side on account of that man's calling, begging, requesting or wheedling?' 'No, Reverend Gotama.'",
    "dn13:40": "'Well now, Vasettha, those Brahmins learned in the Three Vedas who persistently neglect what a Brahmin should do, and persistently do what a Brahmin should not do, declare: \"We call on Indra, Soma, Varuna, Isana, Pajapati, Brahma, Mahiddhi, Yama.\"",
    "dn13:41": "But that such Brahmins who persistently neglect what a Brahmin should do, … will, as a consequence of their calling, begging, requesting or wheedling, attain after death, at the breaking-up of the body, to union with Brahmā — that is just not possible.",
    "dn13:42": "'Vasettha, it is just as if this River Aciravati were brimful of water so that a crow could drink out of it, and a man should come wishing to cross over,… but he was bound and pinioned on this side by a strong chain, with his hands behind his back.",
    "dn13:43": "What do you think, Vasettha? Would that man be able to get to the other side?' 'No, Reverend Gotama.'",
    "dn13:44": "'In just the same way, Vasettha, in the Ariyan discipline these five strands of sense-desire are called bonds and fetters. Which five? Forms seen by the eye which are agreeable, loved, charming, attractive, pleasurable, arousing desire; sounds heard by the ear… ; smells smelt by the nose … ; tastes savoured by the tongue…; contacts felt by the body which are agreeable,… arousing desire.",
    "dn13:45": "These five in the Ariyan discipline are called bonds and fetters. And, Vasettha, those Brahmins learned in the Three Vedas are enslaved, infatuated by these five strands of sense-desire, which they enjoy guiltily, unaware of danger, knowing no way out.",
    "dn13:46": "'It is just as if this River Aciravati were brimful of water so that a crow could drink out of it, and a man should come along wishing to cross over… and were to lie down on this bank, covering his head with a shawl.",
    "dn13:47": "What do you think, Vasettha? Would that man be able to get to the other side?' 'No, Reverend Gotama.'",
    "dn13:48": "'In the same way, Vasettha, in the Ariyan discipline these five hindrances are called obstacles, hindrances, coverings-up, envelopings. Which five? The hindrance of sensuality, of ill-will, of sloth-and-torpor, of worry-and-flurry, of doubt. These five are called obstacles, hindrances, coverings-up, envelopings.",
    "dn13:49": "And these Brahmins learned in the Three Vedas are caught up, hemmed in, obstructed, entangled in these five hindrances. But that such Brahmins learned in the Three Vedas, who persistently neglect what a Brahmin should do… and who are caught up,… entangled in these five hindrances, should attain after death, at the breaking-up of the body, to union with Brahmā – that is just not possible.",
    "dn13:50": "'What do you think, Vāsettha? What have you heard said by Brahmins who are venerable, aged, the teachers of teachers? Is Brahmā encumbered with wives and wealth,[n.254]Saparigaha.The PED gives both 'married' and 'encumbered'. Both are implied.or unencumbered?' 'Unencumbered, Reverend Gotama.'",
    "dn13:51": "'And what do you think, Vāsettha? Are the Brahmins learned in the Three Vedas encumbered with wives and wealth, or unencumbered?' 'Encumbered, Reverend Gotama.'",
    "dn13:52": "'So, Vāsettha, the Brahmins learned in the Three Vedas are encumbered with wives and wealth, and Brahmā is unencumbered. Is there any communion, anything in common between these encumbered Brahmins and the unencumbered Brahmā?' 'No, Reverend Gotama.'",
    "dn13:53": "'Likewise, do these Brahmins learned in the Three Vedas and full of hate…, full of ill-will…, impure…, undisciplined, have any communion, anything in common with the disciplined Brahma?' 'No, Reverend Gotama.'",
    "dn13:54": "But these Brahmins learned in the Three Vedas, having sat down on the bank, sink down despairingly, thinking maybe to find a dry way across. Therefore their threefold knowledge is called the threefold desert, the threefold wilderness, the threefold destruction.'",
    "dn13:55": "At these words Vasettha said: 'Reverend Gotama, I have heard them say: \"The ascetic Gotama knows the way to union with Brahmā.\"'",
    "dn13:56": "'What do you think, Vasettha? Suppose there were a man here born and brought up in Manasakata, and somebody who had come from Manasakata and and had missed the road should ask him the way. Would that man, born and bred in Manasakata, be in a state of confusion or perplexity?' 'No, Reverend Gotama. And why not? Because such a man would know all the paths.'",
    "dn13:57": "'Vasettha, it might be said that such a man on being asked the way might be confused or perplexed — but the Tathagata, on being asked about the Brahma world and the way to get there, would certainly not be confused or perplexed. For, Vasettha, I know Brahma and the world of Brahma, and the way to the world of Brahma, and the path of practice whereby the world of Brahma may be gained.'",
    "dn13:58": "At this Vasettha said: 'Reverend Gotama, I have heard them say: \"The ascetic Gotama teaches the way to union with Brahma.\" It would be good if the Reverend Gotama were to teach us the way to union with Brahma, may the Reverend Gotama help the people of Brahma!'",
    "dn13:59": "'Vasettha, a Tathagata arises in the world, an Arabant, fully-enlightened Buddha, endowed with wisdom and conduct, Well-Farer, Knower of the worlds, incomparable Trainer of men to be tamed, Teacher of gods and humans, enlightened and blessed. He, having realised it by his own super-knowledge, proclaims this world with its devas, māras and Brahmas, its princes and people. He preaches the Dhamma which is lovely in its beginning, lovely in its middle, lovely in its ending, in the spirit and in the letter, and displays the fully-perfected and purified holy life. A disciple goes forth, practises the moralities, attains the first jhānaas Sutta 2, verses 43–75.",
    "dn13:60": "'Then, with his heart filled with loving-kindness, he dwells suffusing one quarter, the second, the third, the fourth. Thus he dwells suffusing the whole world, upwards, downwards, across, everywhere, always with a heart filled with loving-kindness, abundant, unbounded,[n.256] These (pre-Buddhist) 'Divine Abidings'(Brahmavihāra)are also called the Boundless States(appamaññā).without hate or ill-will.",
    "dn13:61": "'Just as if a mighty trumpeter were with little difficulty to make a proclamation to the four quarters, so by this meditation, Vasettha, by this liberation of the heart through loving-kindness he leaves nothing untouched, nothing unaffected in the sensuous sphere.[n.257]Pamāṇa kataṁaccording to DA denotes the sensuous sphere(kāmaloka). Cf.SN 42.8(= KS iv, p. 227). DA says: 'Like the mighty ocean, flooding a little creek, he even reaches up to Brahmā' (tr. Woodward, loc. cit.).This, Vasettha, is the way to union with Brahma.",
    "dn13:62": "'Then with his heart filled with compassion,… with sympathetic joy, with equanimity he dwells suffusing one quarter, the second, the third, the fourth. Thus he dwells suffusing the whole world, upwards, downwards, across, everywhere, always with a heart filled with equanimity, abundant, unbounded, without hate or ill-will.",
    "dn13:63": "'Just as if a mighty trumpeter were with little difficulty to make a proclamation to the four quarters, so by this meditation, Vāsettha, by this liberation of the heart through compassion,… through sympathetic joy,… through equanimity, he leaves nothing untouched, nothing unaffected in the sensuous sphere. This, Vāsettha, is the way to union with Brahma.",
    "dn13:64": "'What do you think, Vasettha? Is a monk dwelling thus encumbered with wives and wealth or unencumbered?' 'Unencumbered, Reverend Gotama. He is without hate…, without ill-will…, pure and disciplined, Reverend Gotama.'",
    "dn13:65": "'Then, Vasettha, the monk is unencumbered, and Brahma is unencumbered. Has that unencumbered monk anything in common with the unencumbered Brahma?' 'Yes indeed, Reverend Gotama.'",
    "dn13:66": "'That is right, Vāsettha. Then that an unencumbered monk, after death, at the breaking-up of the body, should attain to union with the unencumbered Brahmā — that is possible. Likewise a monk without hate…, without ill-will…, pure…, disciplined… Then that a disciplined monk, after death, at the breaking-up of the body, should attain to union with Brahmā — that is possible.'",
    "dn13:67": "At this the young Brahmins Vāsettha and Bhāradvāja said to the Lord: 'Excellent, Reverend Gotama, excellent! It is as if someone were to set up what had been knocked down, or to point out the way to one who had got lost, or to bring an oil-lamp into a dark place, so that those with eyes could see what was there. Just so the Reverend Gotama has expounded the Dhamma in various ways.'"
}