{
    "dn14:1": "Thus have I heard.[n.259] This Sutta, the Mahāpadāna Sutta, marks the beginning of a new division and a new atmosphere. The division is called 'great' probably merely because most of the Suttas in it include mahā 'great' in their titles. Mahāpadana = Mahā-apadāna.Apadāna(which is also the title of a book of the Khuddaka Nikāya) means 'legend, life-story': here of the last seven Buddhas as exemplified by Vipassi, whereas in the Khuddhaka Nikaya the stories are those of Arahants. The Sutta as it stands is clearly a late one, though with some earlier elements.Once the Lord was staying at Sāvatthi, in Anāthapindika's park in the Jeta grove, in the Kareri hutment. And among a number of monks who had gathered together after their meal, after the alms-round, sitting in the Kareri pavilion, there arose a serious discussion on former lives, as they said: 'This is how it was in a former life', or 'That was how it was.'",
    "dn14:2": "And the Lord, with the purified divine-ear faculty surpassing the powers of humans, heard what they were talking about. Getting up from his seat, he went to the Kareri pavilion, sat down on the prepared seat, and said: 'Monks, what was your conversation as you sat together? What discussion did I interrupt?'",
    "dn14:3": "And they told him.",
    "dn14:4": "'Well, monks, would you like to hear a proper discourse on past lives?' 'Lord, it is time for that! Well-Farer, it is time for that! If the Lord were to give a proper discourse on past lives, the monks would listen and remember it!' 'Well then, monks, listen, pay close attention, and I will speak.'",
    "dn14:5": "'Monks, ninety-one aeons ago the Lord, the Arahant, the fully-enlightened Buddha Vipassī arose in the world. Thirty-one aeons ago the Lord Buddha Sikhī arose; in the same thirty-first aeon before this Lord Buddha Vessabhū arose. And in this present fortunate aeon[n.260] A fortunate aeon is one in which one or more Buddhas are born: the present aeon is one of five Buddhas, four of whom have already appeared.the Lords Buddhas Kakusandha, Konagamana and Kassapa arose in the world. And, monks, in this present fortunate aeon I too have now arisen in the world as a fully-enlightened Buddha.",
    "dn14:6": "'The Lord Buddha Vipassi was born of Khattiya race, and arose in a Khattiya family; the Lord Buddha Sikhi likewise; the Lord Buddha Vessabhū likewise; the Lord Buddha Kakusandha was born of Brahmin race, and arose in a Brahmin family; the Lord Buddha Konāgamana likewise; the Lord Buddha Kassapa likewise; and I, monks, who am now the Arahant and fully-enlightened Buddha, was born of Khattiya race, and arose in a Khattiya family.",
    "dn14:7": "'The Lord Buddha Vipassi was of the Kondañña clan; the Lord Buddah Sikhī likewise; the Lord Buddah Vessabhū likewise; the Lord Buddha Kakusandha was of the Kassapa clan; the Lord Buddha Konagāmana likewise; the Lord Buddha Kassapa likwise; I who am now the Arahant and fully . enlightened Buddha, am of the Gotama clan.",
    "dn14:8": "'In the time of the Lord Buddha Vipassi the life-span was eighty thousand years; in the time of the Lord Buddha Sikhi seventy thousand; in the time of the Lord Buddha Vessabhū sixty thousand; in the time of the Lord Buddha Kakusandhu forty thousand; in the time of the Lord Buddha Konāgamana thirty thousand; in the time of the Lord Buddha Kassapa it was twenty thousand years. In my time the lifespan is short, limited and quick to pass: it is seldom that anybody lives to be a hundred.",
    "dn14:9": "'The Lord Buddha Vipassi gained his full enlightenment at the foot of a trumpet-flower tree; the Lord Buddha Sikhi under a white-mango tree; the Lord Buddha Vessabhū under a sāl-tree; the Lord Buddha Kakusandha under an acacia-tree; the Lord Buddha Konāgamana under a fig-tree; the Lord Buddha Kassapa under a banyan-tree; and I became fully enlightened at the foot of an assattha-tree.[n.261] Theficus religiosa.Descendants of the original tree are preserved at Bodh Gaya and Anuradhapura (Sri Lanka).",
    "dn14:10": "'The Lord Buddha Vipassi had the pair of noble disciples Khanda and Tissa; the Lord Buddha Sikhi had Abhibhū and Sambhava; the Lord Buddha Vessabhū had Sona and Uttarā; the Lord Buddha Kakusandha had Vidhūra and Sañjīva; the Lord Buddha Konāgamana had Bhiyyosa and Uttarā; the Lord Buddha Kassapa had Tissa and Bhāradvāja; I myself now have the pair of noble disciples Sāriputta and Moggallāna.",
    "dn14:11": "'The Lord Buddha Vipassi had three assemblies of disciples: one of six million eight hundred thousand, one of a hundred thousand, and one of eighty thousand monks, and of these three assemblies all were Arahants;",
    "dn14:12": "the Lord Buddha Sikhi had three assemblies of disciples: one of a hundred thousand, one of eighty thousand, and one of seventy thousand monks — all Arahants;",
    "dn14:13": "the Lord Buddha Vessabhū had three assemblies: one of eighty thousand, one of seventy thousand, and one of sixty thousand monks — all Arahants;",
    "dn14:14": "the Lord Buddha Kakusandha had one assembly: forty thousand monks — all Arahants;",
    "dn14:15": "the Lord Buddha Konagamana had one assembly: thirty thousand monks — all Arahants;",
    "dn14:16": "the Lord Buddha Kassapa had one assembly: twenty thousand monks — all Arahants;",
    "dn14:17": "I, monks, have one assembly of disciples, one thousand two hundred and fifty monks, and this one assembly consists only of Arahants.",
    "dn14:18": "'The Lord Buddha Vipassī's personal attendant was the monk Asoka; the Lord Buddha Sikhī's was Khemankara; the Lord Buddha Vessabhū's was Upasannaka; the Lord Buddha Kakusandhu's was Vuddhija; the Lord Buddha Konagamana's was Sotthija; the Lord Buddha Kassapa's was Sabbamitta; my chief personal attendant now is Ananda.",
    "dn14:19": "'The Lord Buddha Vipassī's father was King Bandhuma, his mother was Queen Bandhumati, and King Bandhuma's royal capital was Bandhumati.",
    "dn14:20": "The Lord Buddha Sikhi's father was King Aruna, his mother was Queen Pabhavati; King Aruna's capital was Arunavatī.",
    "dn14:21": "The Lord Buddha Vessabhū's father was King Suppatita, his mother was Queen Yasavati; King Suppatīta's capital was Anopama.",
    "dn14:22": "The Lord Buddha Kakusandha's father was the Brahmin Aggidatta, his mother was the Brahmin lady Visākhā. The king at that time was called Khema; his capital was Khemavati.",
    "dn14:23": "The Lord Buddha Konagamana's father was the Brahmin Yaññadatta, his mother was the Brahmin lady Uttarā. The king at that time was Sobha; his capital was Sobhavati.",
    "dn14:24": "The Lord Buddha Kassapa's father was the Brahmin Brahmadatta, his mother was the Brahmin lady Dhanavati. The king at that time was Kiki; his capital was Vārānasī.",
    "dn14:25": "And now, monks, my father was King Suddhodana, my mother was Queen Maya, and the royal capital was Kapilavatthu.'",
    "dn14:26": "Soon after the Lord had gone, another discussion arose among the monks:[n.2] Cf.MN 123.4.'It is marvellous, friends, it is wonderful, the Tathāgata's great power and ability — the way he recalls past Buddhas who have gained Parinibbāna, having cut away the hindrances, cut off the roadof craving, put an end to the round of becoming, overcome all suffering. He recalls their birth, their name, their clan, their life-span, the disciples and assemblies connected with him: \"Being born thus, these Blessed Lords were such-and-such, such were their names, their clans, their discipline, their Dhamma, their wisdom, their liberation.\"",
    "dn14:27": "Well now, friends, how did the Tathagata come by the penetrative knowledge through which he remembers all this … ? Did some deva reveal this knowledge to him?' This was the conversation of those monks which came to be interrupted.",
    "dn14:28": "Then the Lord, rising from the seclusion of the rest-period, went to the Kareri pavilion and sat down on the prepared seat. He said: 'Monks, what was your conversation as you sat together? What discussion did I interrupt?'",
    "dn14:29": "And the monks told him.",
    "dn14:30": "'The Tathāgata understands these things … by his own penetration of the principles of Dhamma; and devas, too, have told him.",
    "dn14:31": "Well, monks, do you wish to hear still more about past lives?' 'Lord, it is time for that! Well-Farer, it is time for that! If the Lord were to give a proper discourse on past lives, the monks would listen and remember it.' 'Well then, monks, listen, pay close attention, and I will speak.' 'Yes, Lord', the monks replied, and the Lord said:",
    "dn14:32": "'Monks, ninety-one aeons ago the Lord, the Arahant, the fully-enlightened Buddha Vipassi arose in the world. He was born of Khattiya race, and arose in a Khattiya family. He was of the Kondañña clan. The span of his life was eighty thousand years. He gained his full enlightenment at the foot of a trumpet-flower tree. He had the pair of noble disciples Khanda and Tissa as his chief followers. He had three assemblies of disciples: one of six million eight hundred thousand, one of a hundred thousand, and one of eighty thousand monks, all Arahants. His chief personal attendant was the monk Asoka. His father was King Bandhumā, his mother was Queen Bandhumatī. The king's capital was Bandhumatī.",
    "dn14:33": "[n.263] Identical, except for the 'refrains', with123.8-end(MLS iii, pp. 165–169).'And so, monks, the Bodhisatta Vipassi descended from the Tusita heaven, mindful and clearly aware, into his mother's womb. This, monks, is the rule.[n.264]Dhammatā:that which is in accordance with Dhamma as universal law.",
    "dn14:34": "'It is the rule, monks, that when a Bodhisatta descends from the Tusita heaven into his mother's womb, there appears in this world with its devas, māras and Brahmās, its ascetics and Brahmins, princes and people an immeasurable, splendid light surpassing the glory of the most powerful devas. And whatever dark spaces lie beyond the world's end, chaotic, blind and black, such that they are not even reached by the mighty rays of sun and moon, are yet illumined by this immeasurable splendid light surpassing the glory of the most powerful devas. And those beings that have been reborn there[n.265] This is said to be one of the hell-states (cf.n.244).recognise each other by this light and know: \"Other beings, too, have been born here!\" And this ten-thousandfold world-system trembles and quakes and is convulsed. And this immeasurable light shines forth. That is the rule.",
    "dn14:35": "'It is the rule that when a Bodhisatta has entered his mother's womb, four devas[n.266] The Four Great Kings (DA) (cf.DN 11.20).come to protect him from the four quarters, saying: \"Let no man, no non-human being, no thing whatever harm this Bodhisatta or this Bodhisatta's mother!\" That is the rule.",
    "dn14:36": "i.i8. 'It is the rule that when a Bodhisatta has entered his mother's womb, his mother becomes by nature virtuous, refraining from taking life, from taking what is not given, from sexual misconduct, from lying speech, or from strong drink and sloth-producing drugs. That is the rule.",
    "dn14:37": "'It is the rule that when a Bodhisatta has entered his mother's womb, she has no sensual thoughts connected with a man, and she cannot be overcome by any man with lustful thoughts. That is the rule.",
    "dn14:38": "'It is the rule that when a Bodhisatta has entered his mother's womb, she enjoys the fivefold pleasures of the senses and takes delight, being endowed and possessed of them. That is the rule.",
    "dn14:39": "'It is the rule that when a Bodhisatta has entered his mother's womb, she has no sickness of any kind, she is at ease and without fatigue of body, and she can see the Bodhisatta inside her womb, complete with all his members and faculties. Monks, it is as if a gem, a beryl, pure, excellent, well cut into eight facets, clear, bright, flawless and perfect in every respect, were strung on a blue, yellow, red, white or orange cord. And a man with good eyesight, taking it in his hand, would describe it as such. Thus does the Bodhisatta's mother, with no sickness, see him, complete with all his members and faculties. That is the rule.",
    "dn14:40": "'It is the rule that the Bodhisatta's mother dies seven days after his birth and is reborn in the Tusita heaven. That is the rule.",
    "dn14:41": "'It is the rule that whereas other women carry the child in their womb for nine or ten months before giving birth, it is not so with the Bodhisatta's mother, who carries him for exactly ten months before giving birth. That is the rule.",
    "dn14:42": "'It is the rule that whereas other women give birth sitting or lying down, it is not so with the Bodhisatta's mother, who gives birth standing up. That is the rule.",
    "dn14:43": "'It is the rule that when the Bodhisatta issues from his mother's womb, devas welcome him first, and then humans. That is the rule.",
    "dn14:44": "'It is the rule that when the Bodhisatta issues from his mother's womb, he does not touch the earth. Four devas[n.267] Again, the Four Great Kings.receive him and place him before his mother, saying: \"Rejoice, Your Majesty, a mighty son has been born to you!\" That is the rule.",
    "dn14:45": "'It is the rule that when the Bodhisatta issues from his mother's womb he issues forth stainless, not defiled by water, mucus, blood or any impurity, pure and spotless. Just as when a jewel is laid on muslin from Kāsī,[n.268] Vārāṇasī (Benares).the jewel does not stain the muslin, or the muslin the jewel. Why not? Because of the purity of both. In the same way the Bodhisatta issues forth stainless… That is the rule.",
    "dn14:46": "'It is the rule that when the Bodhisatta issues forth from his mother's womb, two streams of water appear from the sky, one cold, the other warm, with which they ritually wash the Bodhisatta and his mother. That is the rule.",
    "dn14:47": "'It is the rule that as soon as he is born the Bodhisatta takes a firm stance on both feet facing north, then takes seven strides and, under a white sunshade,[n.269] A symbol of royalty.he scans the four quarters and then declares with a bull-like voice: \"I am chief in the world, supreme in the world, eldest in the world. This is my last birth, there will be no more re-becoming.\"[n.270] All these things are symbolic, according to DA. Standing on the earth denotes the four 'roads to power'(iddhipadāni). Facing north denotes the multitude to be won over. The seven steps are the seven factors of enlightenment(bojjhaṅgā). The sunshade denotes liberation. Looking round denotes unobstructed knowledge. The bull's voice denotes the turning of the wheel, and the declaration of his last birth the 'lion's roar' of Arahantship to be.That is the rule.",
    "dn14:48": "'It is the rule that when the Bodhisatta issues from his mother's womb there appears in this world… an immeasurable, splendid light…as verse 17. This is the rule.[n.271] Thus this light appears twice, at the conception and the birth of the Bodhisatta.",
    "dn14:49": "'Monks, when Prince Vipassi was born, they showed him to King Bandhumā and said: \"Your Majesty, a son has been born to you. Deign, Sire, to look at him.\" The king looked at the prince and then said to the Brahmins skilled in signs: \"You gentlemen are skilled in signs, examine the prince.\" The Brahmins examined the prince, and said to King Bandhumā: \"Sire, rejoice, for a mighty son has been born to you. It is a gain for you, Sire, it is a great profit for you, Sire, that such a son has been born into your family. Sire, this prince is endowed with the thirty-two marks of a Great Man. To such, only two courses are open. If he lives the household life he will become a ruler, a wheel-turning righteous monarch of the law, conqueror of the four quarters, who has established the security of his realm and is possessed of the seven treasures. These are: the Wheel Treasure, the Elephant Treasure, the Horse Treasure, the Jewel Treasure, the Woman Treasure, the Householder Treasure, and, as seventh, the Counsellor Treasure. He has more than a thousand sons who are heroes, of heroic stature, conquerors of the hostile army. He dwells having conquered this sea-girt land without stick or sword, by the law. But if he goes forth from the household life into homelessness, then he will become an Arahant, a fully-enlightened Buddha, one who draws back the veil from the world.\"",
    "dn14:50": "\"'And what, Sire, are these thirty-two marks…?[n.272] These marks are treated in extenso inDN 30.2ff. See notes there.",
    "dn14:51": "(1) He has feet with level tread.",
    "dn14:52": "(2) On the soles of his feet are wheels with a thousand spokes.",
    "dn14:53": "(3) He has projecting heels.",
    "dn14:54": "(4) He has long fingers and toes.",
    "dn14:55": "(5) He has soft and tender hands and feet.",
    "dn14:56": "(6) His hands and feet are net-like.",
    "dn14:57": "(7) He has high-raised ankles.",
    "dn14:58": "(8) His legs are like an antelope's.",
    "dn14:59": "(9) Standing and without bending, he can touch and rub his knees with either hand.",
    "dn14:60": "(10) His male organs are enclosed in a sheath.",
    "dn14:61": "(11) His complexion is bright, the colour of gold.",
    "dn14:62": "(12) His skin is delicate and so smooth that no dust adheres to it.",
    "dn14:63": "(13) His body-hairs are separate, one to each pore.",
    "dn14:64": "(14) They grow upwards, bluish-black like collyrium, growing in rings to the right.",
    "dn14:65": "(15) His body is divinely straight.",
    "dn14:66": "(16) He has the seven convex surfaces.",
    "dn14:67": "(17) The front part of his body is like a lion's.",
    "dn14:68": "(18) There is no hollow between his shoulders.",
    "dn14:69": "(19) He is proportioned like a banyan-tree: his height is as the span of his arms.",
    "dn14:70": "(20) His bust is evenly rounded.",
    "dn14:71": "(21) He has a perfect sense of taste.",
    "dn14:72": "(22) He has jaws like a lion's.",
    "dn14:73": "(23) He has forty teeth.",
    "dn14:74": "(24) His teeth are even.",
    "dn14:75": "(25) There are no spaces between his teeth.",
    "dn14:76": "(26) His canine teeth are very bright.",
    "dn14:77": "(27) His tongue is very long.",
    "dn14:78": "(28) He has a Brahmā-like voice, like that of the karavīka-bird.",
    "dn14:79": "(29) His eyes are deep blue.",
    "dn14:80": "(30) He has eyelashes like a cow's.",
    "dn14:81": "(31) The hair between his eyebrows is white, and soft like cotton-down.",
    "dn14:82": "(32) His head is like a royal turban.\"",
    "dn14:83": "\"'Sire, this prince is endowed with the thirty-two marks of a Great Man. To such, only two courses are open. If he lives the household life he will become a ruler, a wheel-turning righteous monarch of the law…But if he goes forth from the household life into homelessness, then he will become an Arahant, a fully-enlightened Buddha, one who draws back the veil from the world.\"",
    "dn14:84": "'Then King Bandhuma, having clothed those Brahmins in fresh clothes, satisfied all their wishes.",
    "dn14:85": "'And Prince Vipassi had a sweet voice, a beautiful voice, charming and delightful. Just as in the Himālaya mountains the karavīka-bird has a voice sweeter, more beautiful, charming and delightful than all other birds, so too was Prince Vipassī's voice the finest of all.",
    "dn14:86": "'And owing to the results of past kamma, the divine eye was present to Prince Vipassi, with which he could see for a league day and night alike.",
    "dn14:87": "'And Prince Vipassi was unblinkingly watchful, like the Thirty-Three Gods. And because it was said that he was unblinkingly watchful, the prince came to be called \"Vipas-Sī\".[n.273] Related to vipassanā 'insight' (also as a meditation practice: cf.n.2andDN 22).",
    "dn14:88": "When King Bandhumā was trying a case, he took Prince Vipassi on his knee and instructed him in the case. Then, putting him down from his knee, his father would carefully explain the issues to him. And for this reason he was all the more called Vipassi.",
    "dn14:89": "'Then King Bandhumā caused three palaces to be built for Prince Vipassi, one for the rainy season, one for the cold season, and one for the hot season, to cater for all the fivefold sense-pleasures. There Prince Vipassi stayed in the rainy-season palace for the four months of the rainy season, with no male attendants, surrounded by female musicians, and he never left that palace.'",
    "dn14:90": "'Then, monks, after many years, many hundreds and thousands of years had passed,[n.274] Bearing in mind that the life-span of human beings at this time was supposedly 80,000 years (1.7). What follows is told, with reference to the Buddha Gotama, in the introduction(nidānakathā)to the Jatakas. Cf. Warren, BT, pp. 56ff.Prince Vipassi said to his charioteer: \"Harness some fine carriages, charioteer! We will go to the pleasure-park to inspect it.\" The charioteer did so, then reported to the prince: \"Your Royal Highness, the fine carriages are harnessed, it is time to do as you wish.\" And Prince Vipassi mounted a carriage and drove in procession to the pleasure-park.",
    "dn14:91": "'And as he was being driven to the pleasure-park, Prince Vipassi saw an aged man, bent like a roof-beam, broken, leaning on a stick, tottering, sick, his youth all vanished. At the sight he said to the charioteer: \"Charioteer, what is the matter with this man? His hair is not like other men's, his body is not like other men's.\"",
    "dn14:92–93": "'Then King Bandhumā sent for the charioteer and said: \"Well, did not the prince enjoy himself at the pleasure-park? Wasn't he happy there?\" \"Your Majesty, the prince did not enjoy himself, he was not happy there.\" \"What did he see on the way there?\" So the charioteer told the King all that had happened.",
    "dn14:94": "'Then King Bandhumā thought:",
    "dn14:95": "\"Prince Vipassi must not renounce the throne, he must not go forth from the household life into homelessness – the words of the Brahmins learned in signs must not come true!\" So the King provided for Prince Vipassi to have even more enjoyment of the fivefold sense-pleasures, in order that he should rule the kingdom and not go forth from the household life into homelessness…",
    "dn14:97": "'And as he was being driven to the pleasure-park, Prince Vipassi saw a sick man, suffering, very ill, fallen in his own urine and excrement, and some people were picking him up, and others putting him to bed. At the sight he said to the charioteer: \"What is the matter with this man? His eyes are not like other men's, his head[n.276] Readingsīro'head'. RD follows different MSS which readsaro'voice'. Cf. 2.14.is not like other men's.\"",
    "dn14:98": "'Then King Bandhumā sent for the charioteer, who told him what had happened.",
    "dn14:99": "'The king provided Prince Vipassi with even more sense-pleasures, in order that he should rule the kingdom and not go forth from the household life into homelessness…",
    "dn14:100": "… 'After many hundreds of thousands of years Prince Vipassī ordered his charioteer to drive to the pleasure-park.",
    "dn14:101": "'And as he was being driven to the pleasure-park, Prince Vipassi saw a large crowd collecting, clad in many colours, and carrying a bier. At the sight he said to the charioteer: \"Why are those people doing that?\" \"Prince, that is what they call a dead man.\" \"Drive me over to where the dead man is.\" \"Very good, Prince, said the charioteer, and did so. And Prince Vipassi gazed at the corpse of the dead man. Then he said to the charioteer: \"Why is he called a dead man?\"",
    "dn14:102": "'Then King Bandhumā sent for the charioteer, who told him what had happened.",
    "dn14:103": "'The king provided Prince Vipassi with even more sense-pleasures…",
    "dn14:104": "'After many hundreds of thousands of years Prince Vipassī ordered his charioteer to drive to the pleasure-park.",
    "dn14:105": "'And as he was being driven to the pleasure-park, Prince Vipassi saw a shaven-headed man, one who had gone forth,[n.277] Pabbajita: we might say, the nearest equivalent of a Buddhist monk. In the Nidānakathā (n.274), where all four signs are specifically said to be sent by the gods, this is rationalised: 'Now although there was no Buddha in the world, and the charioteer had no knowledge of either monks or their good qualities, yet by the power of the gods he was inspired to say, \"Sire, this is one who has retired from the world\" ' (Warren's translation).wearing a yellow robe. And he said to the charioteer: \"What is the matter with that man? His head is not like other men's, and his clothes are not like other men's.\"",
    "dn14:106": "'Then Prince Vipassi said to the charioteer: \"You take the carriage and drive back to the palace. But I shall stay here and shave off my hair and beard, put on yellow robes, and go forth from the household life into homelessness.\" \"Very good, Prince\", said the charioteer, and returned to the palace. And Prince Vipassi, shaving off his hair and beard and putting on yellow robes, went forth from the household life into homelessness.",
    "dn14:107": "'And a great crowd from the royal capital city, Ban dhumati, eighty-four thousand people,[n.279] Conventional for 'a very large number'.heard that Prince Vipassi had gone forth into homelessness. And they thought: \"This is certainly no common teaching and discipline, no common going-forth, for which Prince Vipassi has shaved off hair and beard, donned yellow robes and gone forth into homelessness. If the Prince has done so, why should not we?\"",
    "dn14:108": "And so, monks, a great crowd of eighty-four thousand, having shaved off their hair and beards and donned yellow robes, followed the Bodhisatta Vipassī[n.280] Vipassi is here called the Bodhisatta for the first time, having now 'gone forth'.into homelessness. And with this following the Bodhisatta went on his rounds through villages, towns and royal cities.",
    "dn14:109": "'Then the Bodhisatta Vipassi, having retired to a secluded spot, had this thought: \"It is not proper for me to live with a crowd like this. I must live alone, withdrawn from this crowd.\" So after a while he left the crowd and dwelt alone. The eighty-four thousand went one way, the Bodhisatta another.",
    "dn14:110": "'Then, when the Bodhisatta had entered his dwelling alone, in a secluded spot, he thought: \"This world, alas, is in a sorry state: there is birth and decay,[n.281] There is a play on words here:jāyati ca(there is birth),jīyati ca(there is decay),mīyati ca(there is dying): the first two terms are linked by alliteration, the second and third by rhyme.there is death and falling into other states and being reborn. And no one knows any way of escape from this suffering, this ageing and death. When will deliverance be found from this suffering, this ageing and death?\"",
    "dn14:111": "'And then, monks, the Bodhisatta thought: \"With what being present, does ageing-and-death occur? What conditions ageing-and-death?\" And then, monks, as a result of the wisdom born of profound consideration[n.282]Yoniso manasikāra:yoni means 'womb', hence 'source, origin'. The phrase really means 'going back to the root of the matter'— here, with perfect penetration; for lesser mortals, to a corresponding degree.the realisation dawned on him: \"Birth being present, ageing-and-death occurs, birth conditions ageing-and-death.\"[n.283] The realisation of dependent origination(paticcasamuppāda): see Introduction, p. 34. Here and inDN 15, only links 3–12 of the usual series are given (cf.n.286).",
    "dn14:112–120": "'Then he thought: \"What conditions birth?\" And the realisation dawned on him: \"Becoming[n.284]Bhava:the process of 'coming-to-be'. It also corresponds to the first two links not given here, which represent the 'coming-to-be' process in a past life.conditions birth\" … \"What conditions becoming?\" … \"Clinging conditions becoming\"… \"Craving conditions clinging\"… \"Feeling conditions craving\" … \"Contact[n.285]Phassa. Seen.86.conditions feeling\"… \"The six sense-bases condition contact\"… \"Mind-and-body conditions the six sense-bases\"… \"Consciousness conditions mind-and-body.\" And then the Bodhisatta Vipassi thought: \"With what being present, does consciousness occur. What conditions consciousness?\" And then, as a result of the wisdom born of profound consideration, the realisation dawned on him: \"Mind-and-body conditions consciousness.\"",
    "dn14:121": "'Then, monks, the Bodhisatta Vipassi thought: \"This consciousness turns back at mind-and-body, it does not go any further.[n.286] DA explains that Vipassī's reflection went back only to the beginning of this life.To this extent there is birth and decay, there is death and falling into other states and being reborn, namely: Mind-and-body conditions consciousness and consciousness conditions mind-and-body, mind-and-body conditions the six sense-bases, the six sense-bases-condition contact, contact conditions feeling, feeling conditions craving, craving conditions clinging, clinging conditions becoming, becoming conditions birth, birth conditions ageing and death, sorrow, lamentation, pain, grief and distress. And thus this whole mass of suffering takes its origin.\"",
    "dn14:122": "And at the thought: \"Origin, origin\", there arose in the Bodhisatta Vipassi, with insight into things never realised before, knowledge, wisdom, awareness, and light.",
    "dn14:123–132": "'Then he thought: \"What now being absent, does ageing-and-death not occur? With the cessation of what comes the cessation of ageing-and-death?\" And then, as a result of the wisdom born of profound consideration, the realisation dawned on him: \"Birth being absent, ageing-and-death does not occur. With the cessation of birth comes the cessation of ageing-and-death\"… \"With the cessation of what comes the cessation of birth?\"… \"With the cessation of becoming comes the cessation of birth\"… \"With the cessation of clinging comes the cessation of becoming\"… \"With the cessation of craving comes the cessation of clinging\"… \"With the cessation of feeling comes the cessation of craving\"… \"With the cessation of contact comes the cessation of feeling\"… \"With the cessation of the six sense-bases comes the cessation of contact\"… \"With the cessation of mind-and-body comes the cessation of the six sense-bases\"… \"With the cessation of consciousness comes the cessation of mind-and-body\"… \"With the cessation of mind-and-body comes the cessation of consciousness.\"",
    "dn14:133": "'Then the Bodhisatta Vipassi thought: \"I have found the insight(vipassanā)way[n.287] RD comments: 'As this is not a stock phrase… it doubtless contains a play on the name Vipassi.'to enlightenment, namely:",
    "dn14:134": "And at the thought: \"Cessation, cessation\", there arose in the Bodhisatta Vipassi, with insight into things never realised before, knowledge, vision, awareness, and light.",
    "dn14:138": "'Then, monks, at another time the Bodhisatta Vipassi dwelt contemplating the rise and fall of the five aggregates of clinging: \"Such is the body, such its arising, such its passing away; such is feeling…; such is perception…; such are the mental formations…; such is consciousness, such its arising, such its passing away.\" And as he remained contemplating the rise and fall of the five aggregates of dinging, before long his mind was freed from the corruptions without remainder .'[n.288] He became an Arahant.",
    "dn14:136": "'Then, monks, the Blessed Lord, the Arahant, the fully-enlightened Buddha Vipassi thought: \"Suppose now I were to teach Dhamma?\" And then he thought: \"I have attained to this Dhamma which is profound, hard to see, hard to grasp, peaceful, excellent, beyond reasoning,[n.289]Atakkāvacaro:beyond the sphere of logical thought' (cf.n.97). That can only be realised by insight, not by reasoning alone.subtle, to be apprehended by the wise. But this generation delights in clinging,[n.290]Alaya-rāma:'delighting in a basis' (i.e. something it can cling to).rejoices in it and revels in it. But for those who so delight, rejoice and revel in clinging this matter is hard to see, namely the conditioned nature of things,[n.291]Ida-paccayatā:'being conditioned by this' (i.e. the fact that everything has some specific condition).or dependent origination.[n.292]Paticca-samuppāda(n.283).Equally hard to see would be the calming of all the mental formations,[n.293] Saṅkhārā: may here be loosely paraphrased as 'the emotions'.the abandonment of all the substrates of rebirth,[n.294]Upadhi:all factors conducive to clinging, and hence to rebirth.the waning of craving, dispassion, cessation and Nibbāna. And if I were to teach Dhamma to others and they did not understand me, that would be a weariness and a trouble to me.\"",
    "dn14:137": "'And to the Lord Buddha Vipassi there occurred spontaneously this verse, never previously heard:",
    "dn14:138–139": "\"This that I've attained, why should I proclaim?Those full of lust and hate can never grasp it.Leading upstream this Dhamma, subtle, deep,Hard to see, no passion-blinded folk can see it.\"",
    "dn14:140": "'As the Lord Buddha Vipassi pondered thus, his mind was inclined to inaction rather than to teaching the Dhamma.",
    "dn14:141": "And, monks, the Lord Buddha Vipassī's reasoning became mentally known to a certain Great Brahma.[n.295] In other versions he is called Brahma Sahampati (a mysterious title), and is identified with the Supreme Brahma (though in the Buddhist view his supremacy is distinctly relative: cf.DN 11).And he thought: \"Alas, the world is perishing, it will be destroyed because the mind of Vipassi, the Blessed Lord, the Arahant, the fully-enlightened Buddha is inclined to inaction rather than to teaching the Dhamma!\"",
    "dn14:142–145": "'Then the Lord Buddha Vipassī explainedas verses 138–139 abovewhy he inclined to inaction rather than to teaching the Dhamma.",
    "dn14:146": "'And the Great Brahmā appealed a second and a third time to the Lord Buddha Vipassi to teach…",
    "dn14:147": "Then the Lord Buddha Vipassi, recognising Brahmā׳s appeal and moved by compassion for beings, surveyed the world with his Buddha-eye.[n.297] This is, of course, superior to all those mentioned inn.140.And he saw beings with little dust on their eyes and with much dust, with faculties sharp and dull, of good and bad disposition, easy and hard to teach, and few of them living in fear of transgression and of the next world. And just as in a pool of blue, red or white lotuses some are born in the water, grow in the water, and, not leaving the water, thrive in the water; some are born in the water and reach the surface; while some are born in the water and, having reached the surface, grow out of the water and are not polluted by it, in the same way, monks, the Lord Buddha Vipassi, surveying the world with his Buddha-eye, saw some beings with little dust on their eyes…",
    "dn14:148": "'Then, knowing his thought, the Great Brahmā addressed the Lord Buddha Vipassi in these verses:",
    "dn14:149": "\"As on a mountain-peak a watcher sees the folk below,So, Man of Wisdom,[n.298]Sumedho:the name of the Brahmin who, going forth under Buddha Dipankara, was to become the Buddha Gotama.seeing all, look down from Dhamma's heights!Free from woe, look on those who are sunk in grief, oppressed with birth and age.",
    "dn14:150": "Arise, hero, victor in battle,leader of the caravan, traverse the world!Teach, O Lord, the Dhamma,and they will understand.\"",
    "dn14:151": "And the Lord Buddha Vipassi replied to the Great Brahma in verse:",
    "dn14:152": "\"Open to them are the doors of the Deathless!Let those that hear now put forth faith.[n.299]Pamuñcantu saddhaṁ.This has been strangely misinterpreted, e.g. 'renounce your empty faith' (Mrs RD), and 'abandon blind beliefs' (Bennett), through a misreading of DA. The Sub-Commentary renders it: 'let them declare their faith'.For fear of trouble I did not preach at firstThe excellent Dhamma for men, Brahma!\"",
    "dn14:153": "Then that Great Brahma, thinking: \"I have been the cause of the Lord Buddha Vipassī׳s preaching Dhamma\", made obeisance to the Lord Buddha, and, passing by to his right, vanished there and then.",
    "dn14:154": "'Then the Lord Buddha Vipassi thought: \"To whom should I first teach this Dhamma? Who would understand it quickly?\" Then he thought: \"There are Khanda the King's son[n.300] A half-brother of Vipassi.and Tissa the chaplain׳s[n.301] Cf.n.172.son, living in the capital city of Bandhumati. They are wise, learned, experienced, and for a long time have had little dust on their eyes. If now I teach Dhamma first to Khanda and Tissa, they will understand it quickly.\" And so the Lord Buddha Vipassi, as swiftly as a strong man might stretch out his flexed arm, or flex it again, vanished there and then from the root of that tree of enlightenment, and reappeared in the royal capital of Bandhumati, in the deer-park of Khema.",
    "dn14:155": "'And the Lord Buddha Vipassi said to the park-keeper: \"Keeper, go to Bandhumati and say to Prince Khanda and the chaplain's son Tissa: 'My lords, Vipassi the Blessed Lord, the Arahant, the fully-enlightened Buddha, has come to Bandhumati and is staying in the deer-park of Khema. He wishes to see you.׳ ״",
    "dn14:156": "'Then Khanda and Tissa, having harnessed some fine carriages, drove out of Bandhumati making for the deer-park of Khema. They took the carriages as far as they would go, then alighted and continued on foot till they came to the Lord Buddha Vipassi. When they reached him, they made obeisance to him and sat down to one side.",
    "dn14:157": "'And the Lord Buddha Vipassi delivered to them a graduated discourse on generosity, on morality, and on heaven,[n.302] The heavenly world that alone was open to people before the appearance of a Buddha.showing the danger, degradation and corruption of sense-desires, and the profit of renunciation. And when the Lord Buddha Vipassi knew that the minds of Khanda and Tissa were ready, pliable, free from the hindrances, joyful and calm, then he preached the Buddhas' special sermon in brief: on suffering, its origin, its cessation, and the path. And just as a clean cloth from which all stains have been removed receives the dye perfectly, so in Prince Khanda and Tissa the chaplain׳s son, as they sat there, there arose the pure and spotless Dhamma-Eye, and they knew: \"Whatever things have an origin must come to cessation.\"",
    "dn14:15/8": "'And they, having seen, attained, experienced and penetrated the Dhamma, having passed beyond doubt, having gained perfect confidence in the Teacher's doctrine without relying on others, said: \"Excellent, Lord, excellent! It is as if someone were to set up what had been knocked down, or to point out the way to one who had got lost, or to bring an oil-lamp into a dark place, so that those with eyes could see what was there. Just so the Blessed Lord has expounded the Dhamma in various ways. We go for refuge to the Lord, and to the Dhamma. May we receive the going-forth at the Lord's hands, may we receive ordination!\"",
    "dn14:159": "'And so Prince Khanda and Tissa the chaplain's son received the going-forth at the hands of the Lord Buddha Vipassi, and they received ordination. Then the Lord Buddha Vipassi instructed them with a discourse on Dhamma, inspired them, fired them and delighted them, showing the danger, degradation and corruption of conditioned things[n.303] This is a profounder insight than that mentioned in verse 11.and the profit of Nibbāna.[n.304] The attainment of Nibbāna (the 'Deathless') is now open to people by following the Buddha’s teaching.And through their being inspired, fired and delighted with this discourse, it was not long before their minds were freed from the corruptions without remainder.",
    "dn14:160": "׳And a great crowd of eighty-four thousand people from Bandhumati heard that the Lord Buddha Vipassi was staying in the deer-park of Khema, and that Khanda and Tissa had shaved off their hair and beards, donned yellow robes, and gone forth from the household life into homelessness. And they thought: \"This is certainly no common teaching and discipline…for which Prince Khanda and Tissa the chaplain's son have gone forth into homelessness. If they can do this in the presence of the Lord Buddha Vipassi, why should not we?\" And so this great crowd of eighty-four thousand left Bandhumati for the deer-park of Khema where the Lord Buddha Vipassi was. When they came to him they made obeisance to him and sat down to one side.",
    "dn14:161": "'And the Lord Buddha Vipassi delivered to them a graduated discourse on generosity, on morality, and on heaven, showing the danger, degradation and corruption of sense-desires, and the profit of renunciation. And just as a clean cloth…receives the dye perfectly, so in those eighty-four thousand, as they sat there, there arose the pure and spotless Dhamma-eye, and they knew: \"Whatever things have an origin must come to cessation.\"",
    "dn14:162": "as verse 12",
    "dn14:163": "'And those eighty-four thousand received the going-forth at the hands of the Lord Buddha Vipassi, and they received ordination. And the Lord Buddha Vipassi instructed them with a discourse on Dhamma…as verse 13and it was not long before their minds were freed from the corruptions without remainder.",
    "dn14:164–165": "'Then the first eighty-four thousand who had gone forth heard: \"The Lord Buddha Vipassi has come to Bandhumatī and is staying in the Khema deer-park, teaching Dhamma.\"",
    "dn14:166–167": "'And all happened as before… And it was not long before their minds were freed from the corruptions without remainder.",
    "dn14:168": "'And at that time, in the royal capital of Bandhumati, there was a vast gathering of six million, eight hundred thousand[n.305] The number is, of course, even more absurd than the previous 84,000. It is based on the statement that Vipassi had an 'assembly' of that number.monks. And when the Lord Buddha Vipassi had withdrawn into seclusion, he thought: \"There is now this great gathering of monks here in the capital. Suppose I were to give them permission: 'Wander abroad, monks, for the good of the many, for the happiness of the many, out of compassion for the world, for the welfare and happiness of devas and humans. Do not go two together, monks, but teach the Dhamma that is lovely in its beginning, lovely in its middle, and lovely in its ending, both in the letter and in the spirit, and display the holy life fully complete and perfect. There are beings with little dust on their eyes who are perishing through not hearing Dhamma: they will become knowers of Dhamma. But at the end of six years precisely you are to come together to the royal capital of Bandhumati to recite the disciplinary code.״ ׳",
    "dn14:169": "'Then a certain Great Brahmā, having divined the Lord Buddha Vipassī׳s thought, as swiftly as a strong man might stretch his flexed arm, or flex it again, vanished from the Brahmā world and appeared before the Lord Buddha Vipassi. Arranging his robe over one shoulder and saluting the Lord with joined palms, he said: \"Just so, O Lord, just so, O Well-Farer! Let the Lord give permission to this great gathering to wander abroad for the good of the many,… out of compassion for the world…There are beings with little dust on their eyes, who are perishing through not hearing Dhamma: they will become knowers of Dhamma. And we too will do the same as the monks: at the end of six years we will come together to the royal capital of Bandhumati to recite the disciplinary code.\"",
    "dn14:170–171": "'So the Lord Buddha Vipassi, emerging from the seclusion of his rest-period, told the monks what had occurred.",
    "dn14:172": "' \"I allow you, monks, to wander abroad for the good of the many, for the welfare and happiness of devas and humans. Do not go two together, monks, but teach the Dhamma that is lovely in its beginning, lovely in its middle, and lovely in its ending, both in the letter and in the spirit, and display the holy life fully complete and perfect. There are beings with little dust on their eyes who are perishing through not hearing Dhamma: they will become knowers of Dhamma. But at the end of six years precisely you are to come together to the royal capital of Bandhumati to recite the disciplinary code.\" And the majority of those monks left that very day to wander about the country.",
    "dn14:173": "'And at that time there were eighty-four thousand religious residences in Jambudīpa.[n.306] 'Rose-Apple Land', i.e. India.And at the end of one year the devas would proclaim: \"Gentlemen, one year has passed, five remain. At the end of five years you are to return to Bandhumati to recite the disciplinary code\", and similarly at the end of two, three, four, five years. And when six years had passed, the devas announced: \"Gentlemen, six years have passed, it is now time to go to the royal capital of Bandhumatī to recite the disciplinary code!\" And those monks, some by their own psychic powers and some by that of the devas, all in one day came to Bandhumati to recite the disciplinary code.",
    "dn14:174": "'And then the Lord Buddha Vipassi gave to the assembled monks the following precepts:",
    "dn14:175": "\"Patient forbearance is the highest sacrifice,Supreme is Nibbāna, so say the Buddhas.He's not 'one gone forth' who hurts others,No ascetic he who harms another.[n.307] =Dhp. 184.",
    "dn14:176": "Not to do any evil,but cultivate the good,To purify one's mind,this the Buddhas teach.[n.308] =Dhp. 183.",
    "dn14:177": "Not insulting, not harming,restraint according to rule,Moderation in food,seclusion of dwelling,Devotion to high thinking,Sthis the Buddhas teach.״[n.309] =Dhp. 185.",
    "dn14:178": "'Once, monks, I was staying at Ukkatthā[n.310] Cf.DN 3.1.in the Subhaga grove at the foot of a great sāl-tree. And as I dwelt there in seclusion it occurred to me: \"There is no abode of beings easily accessible that has not been visited by me for so long as that of the devas of the Pure Abodes.[n.311] The realm where Non-Returners are reborn.Suppose I were to visit them now?\" And then, as swiftly as a strong man might stretch his flexed arm, or flex it again, I vanished from Ukkatṭhā and appeared among the Aviha devas. And many thousands of them came to me, saluted me and stood to one side. Then they said: \"Sir,[n.312]Marisa:'Sir'. They do not recognise him as the Lord.it is ninety-one aeons since the Lord Buddha Vipassi appeared in the world.",
    "dn14:179": "'In the same way many thousands of devas came…referring similarly to Sikhī and other Buddhas as verse 1.12. They said: \"Sir, in this fortunate aeon now the Lord Buddha has arisen in the world. He was born of Khattiya race…; he is of the Gotama clan; in his time the life-span is short, limited and quick to pass: it is seldom that anybody lives to be a hundred. He gained his full enlightenment under an assattha-tree; he has a pair of noble disciples Sāriputta and Moggallāna; he has one assembly of disciples, one thousand two hundred and fifty monks who are all Arahants; his chief personal attendant is Ananda; his father is King Suddhodana, his mother was Queen Maya, and his royal capital is Kapilavatthu. Such was the Lord's renunciation, such his going-forth, such his striving, such his full enlightenment, such his turning of the wheel. And we, sir, who have lived the holy life under the Lord, having freed ourselves from sense-desires, have arisen here.\"",
    "dn14:180–182": "'Then I went with the Aviha devas to see the Atappa devas, and with these to see the Sudassa devas, and with these to see the Sudassi devas, and with all of these to see the Akanittha devas. And there many thousands of devas came, saluted me and stood to one side, saying: \"Sir, it is ninety-one aeons since the Lord Buddha Vipassi appeared in the world…\"as verses 29–30.",
    "dn14:183": "'And so it is, monks, that by his penetration of the fundamentals of Dhamma[n.314]Dhammadhātu:'the Dhamma-Element'.the Tathagata remembers the past Buddhas who have attained final Nibbāna, cutting through multiplicity,[n.315]Papañca.According to Ven. Ñānananda,Concept and Reality(BPS 1971) this means man's 'tendency towards proliferation in the realm of concepts'.blazing a trail, have exhausted the round,[n.316] The round of rebirths.have passed by all suffering; he recalls their births, their names, their clan, their life-span, their twin-disciples, their assemblies of disciples:",
    "dn14:184": "\"These Blessed Lords were born thus, were called thus, thus was their clan, thus was their morality, their Dhamma, their wisdom, their dwelling, thus was their liberation.' \"[n.317] Burmese and Thai texts add a statement that the Buddha was also told about these matters by devas: cf.¶30.",
    "dn14:185": "Thus the Lord spoke, and the monks, delighted, rejoiced at his words."
}