{
    "dn15:1": "Thus have I heard.[n.38] SeeThe Great Discourse on Causation: The Mahānidāna Sutta and its Commentaries,translated from the Pali by Bhikkhu Bodhi, (BPS 984).On one occasion the Exalted One was living among the Kurus, where there was a town of the Kurus named Kammāsadhamma.[n.39] There was nowhere in the town for the Buddha to stay, so he stayed outside, in the jungle: hence the construction 'There is a market town' (DA).Then the Venerable Ānanda approached the Exalted One, paid homage to him, and sat down to one side. Seated, he said to the Exalted One:",
    "dn15:2": "\"Ānanda, if one is asked: 'Are aging and death due to a specific condition?'[n.31]Idapaccayā.Cf.n.91.one should say: 'They are.' If one is asked: 'Through what condition is there aging and death?' one should say: 'With birth as condition there is aging and death.'",
    "dn15:3": "\"Ānanda, if one is asked: 'Is birth due to a specific condition?' one should say: 'It is.' If one is asked: 'Through what condition is there birth?' one should say: 'With existence as condition there is birth.'",
    "dn15:4": "\"Ānanda, if one is asked: 'Is existence due to a specific condition?' one should say: 'It is.' If one is asked: 'Through what condition is there existence?' one should say: 'With clinging as condition there is existence.'",
    "dn15:5": "\"Ānanda, if one is asked: 'Is clinging due to a specific condition?' one should say: 'It is.' If one is asked: 'Through what condition is there clinging?' one should say: 'With craving as condition there is clinging.'",
    "dn15:6": "\"Ānanda, if one is asked: 'Is craving due to a specific condition?' one should say: 'It is.' If one is asked: 'Through what condition is there craving?' one should say: 'With feeling as condition there is craving.'",
    "dn15:7": "\"Ānanda, if one is asked: 'Is feeling due to a specific condition?' one should say: 'It is.' If one is asked: 'Through what condition is there feeling?' one should say: 'With contact as condition there is feeling.'",
    "dn15:8": "\"Ānanda, if one is asked: 'Is contact due to a specific condition?' one should say: 'It is.' If one is asked: 'Through what condition is there contact?' one should say: 'With mentality-materiality as condition there is contact.'[n.323] The six sense-bases are omitted, for some reason, in this Sutta.",
    "dn15:9": "\"Ānanda, if one is asked: 'Is mentality-materiality due to a specific condition?' one should say: 'It is.' If one is asked: 'Through what condition is there mentality-materiality?' one should say: 'With consciousness as condition there is mentality-materiality.'",
    "dn15:10": "\"Ānanda, if one is asked: 'Is consciousness due to a specific condition?' one should say: 'It is.' If one is asked: 'Through what condition is there consciousness?' one should say: 'With mentality-materiality as condition there is consciousness.'[n.324] Cf.n.286.",
    "dn15:11": "\"Thus, Ānanda, with mentality-materiality as condition there is consciousness; with consciousness as condition there is mentality-materiality; with mentality-materiality as condition there is contact; with contact as condition there is feeling; with feeling as condition there is craving; with craving as condition there is clinging; with clinging as condition there is existence; with existence as condition there is birth; and with birth as condition, aging and death, sorrow, lamentation, pain, grief, and despair come to be. Such is the origin of this entire mass of suffering.",
    "dn15:12": "\"It was said: 'With birth as condition there is aging and death.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no birth of any kind anywhere—that is, of gods into the state of gods, of celestials into the state of celestials, of spirits, demons,[n.326]Bhūtānaṁ:‘beings’, but the term is sometimes used in the sense of ‘ghosts’. The Sub-Commentary identifies them with the Kumbhaṇḍas mentioned atDN 32. (q.v.).human beings, quadrupeds, winged creatures, and reptiles, each into their own state—if there were no birth of beings of any sort into any state, then, in the complete absence of birth, with the cessation of birth, would aging and death be discerned?\"",
    "dn15:13": "\"It was said: 'With existence as condition there is birth.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no existence of any kind anywhere—that is, no sense-sphere existence, fine-material existence, or immaterial existence—then, in the complete absence of existence, with the cessation of existence, would birth be discerned?\"",
    "dn15:14": "\"It was said: 'With clinging as condition there is existence.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no clinging of any kind anywhere—that is, no clinging to sense pleasures, clinging to views, clinging to precepts and observances, or clinging to a doctrine of self—then, in the complete absence of clinging, with the cessation of clinging, would existence be discerned?\"",
    "dn15:15": "\"It was said: 'With craving as condition there is clinging.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no craving of any kind anywhere—that is, no craving for visible forms, craving for sounds, craving for smells, craving for tastes, craving for tangibles, or craving for mental objects—then, in the complete absence of craving, with the cessation of craving, would clinging be discerned?\"",
    "dn15:16": "\"It was said: 'With feeling as condition there is craving.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no feeling of any kind anywhere—that is, no feeling born of eye-contact, feeling born of ear-contact, feeling born of nose-contact, feeling born of tongue-contact, feeling born of body-contact, or feeling born of mind-contact—then, in the complete absence of feeling, with the cessation of feeling, would craving be discerned?\"",
    "dn15:17": "\"Thus, Ānanda, in dependence upon feeling there is craving; in dependence upon craving there is pursuit;[n.327]Pariyesanā.Verses 9-18 constitute an excursus.in dependence upon pursuit there is gain;[n.328]Lābha.in dependence upon gain there is decision-making;[n.329]Vinicchaya.in dependence upon decision-making there is desire and lust;[n.330]Chanda-rāga.in dependence upon desire and lust there is attachment;[n.331]Ajjhosāna(=adhi-ava-sāna‘being bent on something’).in dependence upon attachment there is possessiveness;[n.332]Pariggaha:‘possessiveness’ (BB).in dependence upon possessiveness there is stinginess;[n.333]Macchariya.in dependence upon stinginess there is safeguarding;[n.334]Ārakkha:‘watch and ward’ (RD), ‘protection’ (Bennett), ‘safeguarding’ (BB).and because of safeguarding, various evil unwholesome phenomena originate—the taking up of clubs and weapons, conflicts, quarrels, and disputes, insulting speech, slander, and falsehoods.",
    "dn15:18": "\"It was said: 'Because of safeguarding, various evil unwholesome phenomena originate—the taking up of clubs and weapons, conflicts, quarrels, and disputes, insulting speech, slander, and falsehoods.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no safeguarding of any kind anywhere, then, in the complete absence of safeguarding, with the cessation of safeguarding, would those various evil unwholesome phenomena originate?\"",
    "dn15:19": "\"It was said: 'In dependence upon stinginess there is safeguarding.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no stinginess of any kind anywhere, then, in the complete absence of stinginess, with the cessation of stinginess, would safeguarding be discerned?\"",
    "dn15:20": "\"It was said: 'In dependence upon possessiveness there is stinginess.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no possessiveness of any kind anywhere, then, in the complete absence of possessiveness, with the cessation of possessiveness, would stinginess be discerned?\"",
    "dn15:21": "\"It was said: 'In dependence upon attachment there is possessiveness.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no attachment of any kind anywhere, then, in the complete absence of attachment, with the cessation of attachment, would possessiveness be discerned?\"",
    "dn15:22": "\"It was said: 'In dependence upon desire and lust there is attachment.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no desire and lust of any kind anywhere, then, in the complete absence of desire and lust, with the cessation of desire and lust, would attachment be discerned?\"",
    "dn15:23": "\"It was said: 'In dependence upon decision-making there is desire and lust.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no decision-making of any kind anywhere, then, in the complete absence of decision-making, with the cessation of decision-making, would desire and lust be discerned?\"",
    "dn15:24": "\"It was said: 'In dependence upon gain there is decision-making.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no gain of any kind anywhere, then, in the complete absence of gain, with the cessation of gain, would decision-making be discerned?\"",
    "dn15:25": "\"It was said: 'In dependence upon pursuit there is gain.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no pursuit of any kind anywhere, then, in the complete absence of pursuit, with the cessation of pursuit, would gain be discerned?\"",
    "dn15:26": "\"It was said: 'In dependence upon craving there is pursuit.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no craving of any kind anywhere—that is, no craving for sense pleasures, craving for existence, or craving for non-existence—then, in the complete absence of craving, with the cessation of craving, would pursuit be discerned?\"",
    "dn15:27": "\"It was said: 'With contact as condition there is feeling.' How that is so, Ānanda, should be understood in this way: If there were absolutely and utterly no contact of any kind anywhere—that is, no eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, or mind-contact—then, in the complete absence of contact, with the cessation of contact, would feeling be discerned?\"",
    "dn15:28": "\"It was said: 'With mentality-materiality as condition there is contact.' How that is so, Ānanda, should be understood in this way: If those qualities, traits, signs, and indicators[n.336]Ndma-kaya:the mental component of the pairnāmarūpa‘name-and-form’ or ‘mind-and-body’. See next note.through which there is a description of the mental body were all absent, would designation-contact be discerned in the material body?\"[n.337]Rūpa-kāya:the physical component of the pair nāmarūpa. Both rūpa and kāya can on occasion be translated ‘body’, but there is a difference. Rūpa is body as material, especially visible, form, while kāya is body as aggregate, as in ‘a body of material, a body of men’.",
    "dn15:29": "\"It was said: 'With consciousness as condition there is mentality-materiality.'",
    "dn15:30": "\"It was said: 'With mentality-materiality as condition there is consciousness.' How that is so, Ānanda, should be understood in this way: If consciousness were not to gain a footing in mentality-materiality, would an origination of the mass of suffering—of future birth, aging, and death—be discerned?\"",
    "dn15:31": "\"In what ways, Ānanda, does one describing self describe it? Describing self as having material form and as limited,[n.341] The four declarations are in Pali: 1.‘Rūpī me paritto attā’,2.‘Rūpī me ananto attā’,3.Arūpī me paritto atta’,4.‘Arūpī me ananto atta’.Rūpīis the adjective from rūpa (seen.337) and may mean ‘material’, though DA takes it as referring to the World of Form (rūpaloka) as experienced in the lower jhānas,arūpīthen referring similarly to the Formless World of the higher jhānas. Cf.DN 1.3.1ff.one describes it thus: 'My self has material form and is limited.' Or describing self as having material form and as infinite, one describes it thus: 'My self has material form and is infinite.' Or describing self as immaterial and limited, one describes it thus: 'My self is immaterial and limited.' Or describing self as immaterial and infinite, one describes it thus: 'My self is immaterial and infinite.'",
    "dn15:32": "\"Therein, Ānanda, one who describes self as having material form and as limited either describes such a self (as existing only) in the present or he describes such a self (as existing) there in the future, or he thinks: 'That which is not thus, I will convert towards the state of being thus.'[n.b31]Atathaḿ vā pana santaḿ tathattāya upakappessāmi.This sentence, enigmatic also in the Pali, renders the original as literally as syntactical requirements will allow. Interpretations are given in myThe Great Discourse on Causation,Introduction, p. 40, and in the commentarial exegesis.This being so, it can aptly be said that a settled view (of self) as having material form and as limited underlies this.",
    "dn15:33": "\"One who describes self as having material form and as infinite either describes such a self (as existing only) in the present or he describes such a self (as existing) there in the future, or he thinks: 'That which is not thus, I will convert towards the state of being thus.'[n.342]Upakappessāmi:glossed by DA assampādessāmi‘I shall strive for, attain’.This being so, it can aptly be said that a settled view (of self) as having material form and as infinite underlies this.",
    "dn15:34": "\"One who describes self as immaterial and limited either describes such a self (as existing only) in the present or he describes such a self (as existing) there in the future, or he thinks: 'That which is not thus, I will convert towards the state of being thus.' This being so, it can aptly be said that a settled view (of self) as immaterial and limited underlies this.",
    "dn15:35": "\"One who describes self as immaterial and infinite either describes such a self (as existing only) in the present or he describes such a self (as existing) there in the future, or he thinks: 'That which is not thus, I will convert towards the state of being thus.' This being so, it can aptly be said that a settled view (of self) as immaterial and infinite underlies this.",
    "dn15:36": "\"In what ways, Ānanda, does one not describing self not describe it? Not describing self as having material form and as limited, one does not describe it thus: 'My self has material form and is limited.' Or not describing self as having material form and as infinite, one does not describe it thus: 'My self has material form and is infinite.' Or not describing self as immaterial and limited, one does not describe it thus: 'My self is immaterial and limited.' Or not describing self as immaterial and infinite, one does not describe it thus: 'My self is immaterial and infinite.'",
    "dn15:37": "\"Therein, Ānanda, one who does not describe self as having material form and as limited does not describe such a self (as existing only) in the present, nor does he describe such a self (as existing) there in the future, nor does he think: 'That which is not thus, I will convert towards the state of being thus.' This being so, it can aptly be said that a settled view (of self) as having material form and as limited does not underlie this.",
    "dn15:38": "\"One who does not describe self as having material form and as infinite does not describe such a self (as existing only) in the present, nor does he describe such a self (as existing) there in the future, nor does he think: 'That which is not thus, I will convert towards the state of being thus.' This being so, it can aptly be said that a settled view (of self) as having material form and as infinite does not underlie this.",
    "dn15:39": "\"One who does not describe self as immaterial and limited does not describe such a self (as existing only) in the present, nor does he describe such a self (as existing) there in the future, nor does he think: 'That which is not thus, I will convert towards the state of being thus.' This being so, it can aptly be said that a settled view (of self) as immaterial and limited does not underlie this.",
    "dn15:40": "\"One who describes self as immaterial and infinite does not describe such a self (as existing only) in the present, nor does he describe such a self (as existing) there in the future, nor does he think: 'That which is not thus, I will convert towards the state of being thus.' This being so, it can aptly be said that a settled view (of self) as immaterial and infinite does not underlie this.",
    "dn15:41": "\"In what ways, Ānanda, does one considering (the idea of) self consider it? One considering (the idea of) self either considers feeling as self, saying: 'Feeling is my self.'[n.343] Identifying the (supposed) self with the feeling-aggregate (vedanā-kkhandha).Or he considers: 'Feeling is not my self; my self is without experience of feeling.' Or he considers: 'Feeling is not my self, but my self is not without experience of feeling.[n.344] Identifying the self with the body-aggregate.My self feels; for my self is subject to feeling.'[n.345] Identifying the self with the aggregates of perception, mental formations and consciousness. Such are the commentarial explanations.",
    "dn15:42": "\"Therein, Ānanda, the one who says 'Feeling is my self' should be asked: 'Friend, there are these three kinds of feeling—pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. Of these three kinds of feeling, which do you consider as self?'",
    "dn15:43": "\"Ānanda, pleasant feeling is impermanent, conditioned,[n.346]Sankhata:as opposed to the ‘unconditioned element’, which is Nibbāna.dependently arisen, subject to destruction, falling away, fading out, and ceasing. Painful feeling is impermanent, conditioned, dependently arisen, subject to destruction, falling away, fading out, and ceasing. Neither-painful-nor-pleasant feeling is impermanent, conditioned, dependently arisen, subject to destruction, falling away, fading out, and ceasing.",
    "dn15:44": "\"Ānanda, the one who says 'Feeling is not my self; my self is without experience of feeling'—he should be asked: 'Friend, where there is nothing at all that is felt, could the idea \"I am\"[n.b32] The Burmese edition readsayam aham asmi,“I am this.” The PTS edition’sasmi,“I am,” is confirmed by the commentary. Both editions haveayam aham asmias the reading for the following section.occur there?'.\"",
    "dn15:45": "\"Ānanda, the one who says 'Feeling is not my self, but my self is not without experience of feeling. My self feels; for my self is subject to feeling'[n.348] I.e. this feeling.— he should be asked: 'Friend, if feeling were to cease absolutely and utterly without remainder, then, in the complete absence of feeling, with the cessation of feeling, could (the idea) \"I am this\" occur there?'.\"",
    "dn15:46": "\"Ānanda, when a bhikkhu does not consider feeling as self, and does not consider self as without experience of feeling, and does not consider: 'My self feels; for my self is subject to feeling'—then, being without such considerations, he does not cling to anything in the world. Not clinging, he is not agitated. Not being agitated, he personally attains nibbāna.[n.349] He gains Nibbāna for himself (individually:paccattaṁ).He understands: 'Destroyed is birth, the holy life has been lived, what had to be done has been done, there is no returning to this state of being.'",
    "dn15:47": "\"Ānanda, there are these seven stations for consciousness[n.352] RD makes heavy weather of this in his note. These are the ‘places’ or ‘states’ in which conscious rebirth takes place. The stations also occur at AN 7.41 (not 39, 40, as stated by RD).and two bases.[n.353]Ayatanāni:normally translated ‘spheres’, is here rendered ‘realms’ to avoid confusion with the ‘spheres’ of Infinite Space, etc., included among the seven ‘stations’. Glossed asnivāsanatthānāni‘dwelling-places’, they clearly differ from the station as being where unconscious (or not fully conscious) rebirth takes place.What are the seven?",
    "dn15:48": "\"Therein, Ānanda, if one understands the first station for consciousness, that of beings who are diverse in body and diverse in perception, and if one understands its origin, its passing away, its satisfaction, its unsatisfactoriness, and the escape from it, is it proper for one to seek enjoyment in it?\"",
    "dn15:49": "\"Ānanda, there are these eight emancipations.[n.356] These are really only relative ‘liberations’, since one has to pass through them successively to gain true freedom.What are the eight?",
    "dn15:50": "\"Ānanda, when a bhikkhu attains these eight emancipations in forward order, in reverse order, and in both forward order and reverse order; when he attains them and emerges from them wherever he wants, in whatever way he wants, and for as long as he wants, and when, through the destruction of the cankers, he here and now enters and dwells in the cankerless liberation of mind, liberation by wisdom,[n.361]Ceto-vimutti paññā-vimutti:(cf.DN 6.12) ‘liberation of the heart and by wisdom’, i.e. in the two ways mentioned.having realized it for himself with direct knowledge, then he is called a bhikkhu who is liberated in both ways.[n.362] This again refers to the two ways mentioned. The various kinds of ‘liberated one’ are listed atDN 28.8.And, Ānanda, there is no other liberation in both ways higher or more sublime than this one.\"",
    "dn15:51": "Thus spoke the Exalted One. The Venerable Ānanda, being pleased, rejoiced in the Exalted One's words."
}