{
    "dn16:1": "Thus I heard:[n.363] With this Sutta, Mrs Bennett’s volume of abridged translations comes to an end. Of greater value wasThe Last Days of the Buddha,translated by Sister Vajirā and revised by Francis Story, with notes by the Ven. Nyānaponika Mahāthera (Wheel Publication 67/69, BPS, Kandy 964).The Sutta is a composite one, many portions of which are found separately in other parts of the Canon, as listed by RD. No doubt it contains the basic facts about the Buddha’s last days, but various late and more than dubious elements have been incorporated in it-a process which continued in the later Sanskrit versions (produced by the Sarvāstivādins and other schools), which are known to us mainly from the Chinese and Tibetan translations (though some Sanskrit fragments have been found). For E. Waldschmidt’s (German) study of these, see A.K. Warder,Indian Buddhism(2nd ed., Delhi 980). The Tibetan version is translated into English in W.W. Rockhill,Life of the Buddha(2nd ed., London 907), pp. 23–47. It should perhaps be mentioned that the (expanded, Sanskrit-based) Mahāparinirvāṇa Sūtra is sometimes cited as evidence for the belief in a supreme self in Mahayana Buddhism. One Chinese version does indeed contain a passage to this effect, but this is a late interpolation, and is not representative of the general Mahayana position.— At one time the Gracious One was living near Rājagaha on the Vultures' Peak Mountain.[n.364] Gijjhakūṭa: a pleasant elevation above the stifling heat of Rajagaha. The name was taken up by Mahayana writers, who often located the Buddha’s discourses there.",
    "dn16:2": "Then the Magadhan King Ajātasattu, the son of Lady Wisdom, addressed the Magadhan chief minister the brahmin Vassakāra, saying:",
    "dn16:3": "\"Very well, dear Sir,\" and the Magadhan chief minister the brahmin Vassakāra, after replying to the Magadhan King Ajātasattu, the son of Lady Wisdom, and having many great and august vehicles prepared, and mounting those great and august vehicles, departed with those great and august vehicles from Rājagaha, and after approaching by vehicle to the Vultures' Peak Mountain as far as the ground for vehicles would allow, and descending from the vehicles, he approached the Gracious One by foot, and after approaching, he exchanged greetings with the Gracious One, and after exchanging courteous talk and greetings, he sat down on one side. While sitting on one side, the Magadhan chief minister the brahmin Vassakāra said this to the Gracious One:",
    "dn16:4": "Now at that time venerable Ānanda was stood behind the Gracious One fanning the Gracious One. Then the Gracious One addressed venerable Ānanda, saying:",
    "dn16:5": "Then the Gracious One addressed the Magadhan chief minister the brahmin Vassakāra, saying: \"At one time, brahmin, I was living near Vesālī near to the Sārandada Shrine and there I taught the Vajjians these seven things which prevent decline. For as long, brahmin, as the Vajjians maintain these seven things which prevent decline, and the Vajjians agree with these seven things which prevent decline, surely growth, brahmin, is to be expected for the Vajjians not decline.\"",
    "dn16:6": "Then the Gracious One, not long after the Magadhan chief minister, the brahmin Vassakāra, had gone, addressed venerable Ānanda, saying: \"Go, Ānanda, and whatever monks there are living in dependence on Rājagaha, assemble them in the Attendance Hall.\"",
    "dn16:7": "I will teach you a further seven things which prevent decline, listen to it, apply your minds well, and I will speak.\"\"Very well, reverend Sir,\" those monks replied to the Gracious One, and the Gracious One said this:",
    "dn16:8": "I will teach you a further seven things which prevent decline, listen to it … as long, monks, as the monks will have faith, … have a conscientious mind, … have a sense of shame, … will be learned, will be strenuous, … will attend to mindfulness, … will possess wisdom, surely growth, monks, is to be expected for the monks, not decline.",
    "dn16:9": "I will teach you a further seven things which prevent decline, listen to it, apply your minds well, and I will speak.\"",
    "dn16:10": "I will teach you a further seven things which prevent decline, listen to it, apply your minds well, and I will speak.\" \"Very well, reverend Sir,\" those monks replied to the Gracious One, and the Gracious One said this:",
    "dn16:11": "I will teach you a further six things which prevent decline, listen to it, apply your minds well, and I will speak.\" \"Very well, reverend Sir,\" those monks replied to the Gracious One, and the Gracious One said this:",
    "dn16:12": "There also the Gracious One, while living near Rājagaha on the Vultures' Peak Mountain, spoke frequently to the monks about the Teaching, saying: \"Such is virtue, such is concentration, such is wisdom, when virtue is well-developed it yields great fruit and brings great advantages in regard to concentration, when concentration is well-developed it yields great fruit and brings great advantages in regard to wisdom, when wisdom is well-developed the mind is completely liberated from the pollutants, that is to say: the pollutant of sensuality, the pollutant of craving for continued existence, the pollutant of ignorance.\"",
    "dn16:13": "Then the Gracious One, after living near Rājagaha for as long as he liked, addressed venerable Ānanda, saying: \"Come Ānanda let us approach Ambalaṭṭhikā.\"",
    "dn16:14": "Then the Gracious One, after living near Ambalaṭṭhikā for as long as he liked, addressed venerable Ānanda, saying: \"Come Ānanda let us approach Nāḷandā.\"",
    "dn16:15": "Then venerable Sāriputta approached the Gracious One, and after approaching and worshipping the Gracious One, he sat down on one side. While sitting on one side venerable Sāriputta said this to the Gracious One: \"I have confidence, reverend Sir, in the Gracious One in this way: that neither in the past, the future, or at present is there found another ascetic or brahmin who has more deep knowledge in regard to Perfect Awakening than the Gracious One.\"",
    "dn16:16": "\"I do not, reverend Sir, in regard to those past, future, and present Worthy and Perfect Sambuddhas have full and exact knowledge with my own mind. However, I understand what I said is in conformity with the Teaching.[n.372]Dhammanvaya:‘the way the Dhamma goes’; anvaya also means ‘lineage’, and RD has ‘the lineage of the faith’, which is doubly inappropriate.",
    "dn16:17": "There also the Gracious One, while living near Nāḷandā in Pāvārika's Mango Wood, spoke frequently to the monks about the Teaching, saying:",
    "dn16:18": "Then the Gracious One, after living near Nāḷandā for as long as he liked, addressed venerable Ānanda, saying: \"Come Ānanda let us approach Pāṭaligāma.\"",
    "dn16:19": "Then the Gracious One addressed the laymen of Pāṭaligāma, saying: \"There are these five dangers, householders, for one lacking in virtue, for one who has lost his virtue. What are the five?",
    "dn16:20": "These are the five dangers, householders, for one lacking in virtue, for one who has lost his virtue. There are these five advantages, householders, for one who is virtuous, for one accomplished in virtue.What are the five? Here, householders, one who is virtuous, one accomplished in virtue, because of being heedful obtains a great mass of riches. This is the first advantage for one who is virtuous, for one accomplished in virtue.",
    "dn16:21": "Then the Gracious One, after instructing, rousing, enthusing, and cheering the laymen of Pāṭaligāma for most of the night with a talk about the Teaching, dismissed them, saying: \"The night has passed, householders, now is the time for whatever you are thinking.\"",
    "dn16:22": "Now at that time the Magadhan chief ministers Sunīdha and Vassakāra were building up a city at Pāṭaligāma to ward off the Vajjians. Then at that time a great many Divinities, thousands upon thousands, were taking possession of grounds at Pāṭaligāma.",
    "dn16:23": "Then the Magadhan chief ministers Sunīdha and Vassakāra approached the Gracious One, and after approaching, they exchanged greetings with the Gracious One, and after exchanging courteous talk and greetings, they stood on one side. While standing on one side the Magadhan chief ministers Sunīdha and Vassakāra said this to the Gracious One: \"May dear Gotama consent to us offering him a meal today, together with the Community of monks.\" The Gracious One consented by maintaining silence.",
    "dn16:24": "Now at that time the Magadhan chief ministers Sunīdha and Vassakāra were following close behind the Gracious One, thinking: \"That gate by which the ascetic Gotama leaves will get the name the Gotama Gate, and that ford by which he crosses the river Ganges will get the name the Gotama Ford.\"",
    "dn16:25": "Then the Gracious One addressed venerable Ānanda, saying: \"Come Ānanda let us approach Koṭigāma.\" \"Very well, reverend Sir,\" venerable Ānanda replied to the Gracious One. Then the Gracious One together with a great Community of monks arrived at Koṭigāma. There the Gracious One lived near Koṭigāma.",
    "dn16:26": "Then the Gracious One, after living near Koṭigāma for as long as he liked, addressed venerable Ānanda, saying: \"Come Ānanda let us approach the Nādikas.\"",
    "dn16:27": "\"The monk Sāḷha, Ānanda, through the destruction of the pollutants, without pollutants, freed in mind, freed through wisdom, dwelt having known, having directly experienced, and having attained Nibbāna himself in this very life.",
    "dn16:28": "But it is not such a wonder, Ānanda, that those who have become human should die, but if every time there is a death in this place, after approaching the Realised One, you were to ask about it, Ānanda, that would be troublesome[n.375] DA stresses that Buddhas can feel only physical, not mental weariness.to the Realised One.",
    "dn16:29": "And what, Ānanda, is this presentation of the Teaching called the Mirror of the True Nature of Things, endowed with which a Noble Disciple desiring to do so may declare about himself: 'Exhausted is birth in Hell, exhausted is birth in an animal's womb, exhausted is birth in the realm of the Fallen Spirits, exhausted is falling into an unfortunate destiny in the lower realms, I am a Stream-Enterer, no longer subject to falling into the lower realms, and have a fixed destiny ending in Final Awakening'?",
    "dn16:30": "Then the Gracious One, after living near Nādika for as long as he liked, addressed venerable Ānanda, saying: \"Come Ānanda let us approach Vesālī.\"",
    "dn16:31": "The courtesan Ambapālī[n.383]Ganikā.She was a rich and cultivated woman, with skills similar to those of a geisha.heard: \"The Gracious One, it seems, has reached Vesālī and is living near Vesālī in my Mango Wood.\"",
    "dn16:32": "Then the courtesan Ambapālī after the night had passed, having had excellent foodstuffs made ready in her own pleasure park, had the time announced to the Gracious One, saying: \"It is time, reverend Sir, the meal is ready.\"",
    "dn16:33": "Then the Gracious One, after living near Ambapālī's Wood for as long as he liked, addressed venerable Ānanda, saying: \"Come Ānanda let us approach the little village of Beluva.\"",
    "dn16:34": "Then the Gracious One having energetically dismissed that affliction lived on after determining the lifespan. Then the Gracious One's affliction abated. Then, the Gracious One, having risen from that sickness, not long after rising, departed from the Sick Room and sat down on the prepared seat in front of that Room.",
    "dn16:35": "\"But what, Ānanda, does the Community of monks expect of me? The Teaching has been taught by me, Ānanda, without having made a distinction between esoteric and exoteric,[n.388] A famous statement, implying that there is no ‘esoteric’ teaching in Buddhism, at least as originally taught by the Founder. There is no contradiction with the parable of the siṁsapā leaves atSN 56.31.for the Realised One there is nothing, Ānanda, of a closed teacher's fist in regard to the Teaching.",
    "dn16:36": "Then the Gracious One, having dressed in the morning time, after picking up his bowl and robe, entered Vesālī for alms. After walking for alms in Vesālī, and returning from the alms-round after the meal, he addressed venerable Ānanda, saying: \"Take up the sitting mat, Ānanda, we will approach the Cāpāla shrine to dwell for the day.\"",
    "dn16:37": "While sitting on one side the Gracious One said this to venerable Ānanda:",
    "dn16:38": "Then the Wicked Māra, not long after venerable Ānanda had gone, approached the Gracious One, and after approaching, he stood on one side. While standing on one side the Wicked Māra said this to the Gracious One:",
    "dn16:39": "Then at the Cāpāla shrine the Gracious One, mindfully, with full awareness, relinquished the life-process. With the relinquishment of the life-process by the Gracious One there was a great earthquake, and a fearful, horrifying crash of the Divinities' thunder drum.",
    "dn16:40": "Then it occured to venerable Ānanda: \"Surely it is wonderful, surely it is marvellous, this great earthquake, this very great earthquake, and this awful, hair-raising, crash of the Divinities' thunder drum. What was the reason, what was the cause, for the occurrence of this great earthquake?\"",
    "dn16:41": "\"There are these eight reasons, eight causes, Ānanda, for the occurrence of a great earthquake.",
    "dn16:42": "There are, Ānanda, eight assemblies.",
    "dn16:43": "There are, Ānanda, eight means of mind mastery.[n.407]Abhibhū-ayatanāni>abhibhâyatanāni.SeeMN 77and articles in BDic and EB.",
    "dn16:44": "There are, Ānanda, eight liberations. Which eight?",
    "dn16:45": "At one time Ānanda I was living at Uruvelā, on the bank of the river Nerañjarā, at the root of the Goatherd's Banyan tree, in the first period after attaining Awakening. Then, Ānanda, the Wicked Māra approached me, and after approaching he stood on one side. While standing to one side, Ānanda, the Wicked Māra said this to me:",
    "dn16:46": "Now today, Ānanda, at the Cāpāla Shrine the Wicked Māra approached me, and after approaching he stood on one side. While standing on one side the Wicked Māra said this to me:",
    "dn16:47": "When that was said, Ānanda, I said this to the Wicked Māra: 'You should have little concern, Wicked One, in no long time the Realised One will be Finally Emancipated, after three months have passed from now, the Realised One will attain Final Emancipation.' Now today, Ānanda, at the Cāpāla Shrine the Realised One mindfully, with full awareness, gave up the life-process.\"",
    "dn16:48": "When this was said venerable Ānanda said this to the Gracious One: \"Let the Gracious One remain, reverend Sir, for the lifespan, let the Fortunate One remain for the lifespan, for the benefit of many people, for the happiness of many people, having compassion on the world, for the welfare, benefit, and happiness of Divinities and men.\"",
    "dn16:49–50": "At one time, Ānanda, I was living at Rājagaha on the Vulture's Peak Mountain, I was living right there at Rājagaha near the Gotama Banyan Tree, I was living right there at Rājagaha near the Thieves' Precipice, I was living right there at Rājagaha on the side of the Vebhāra mountain in the Seven Leaves Cave, I was living right there at Rājagaha on the side of the Isigili mountain on Black Rock, I was living right there at Rājagaha in the Cool Wood, at the Snake Tank Slope, I was living right there at Rājagaha in the River Tapodā Monastery, I was living right there near Rājagaha, at Jīvaka's Mango Wood, I was living right there near Rājagaha, in the Deer Park at the place called Crushing Womb, in that place, Ānanda, I addressed you, saying:",
    "dn16:51–52": "At one time, Ānanda, I was living right here near Vesālī, in the Udena Shrine, I was living right here near Vesālī, in the Gotamaka Shrine, I was living right here near Vesālī, in the Seven Mangos Shrine, I was living right here near Vesālī, in the Many Sons Shrine, I was living right here near Vesālī, in the Sārandada Shrine, and here today, Ānanda, at the Cāpāla Shrine I addressed you, saying:",
    "dn16:53": "Were you not warned by me when I declared: 'There is alteration in, separation from, and changeability in all that is dear and appealing'? How can it be otherwise, Ānanda, for that which is obtained, born, become, conditioned, subject to dissolution? It is not possible to say this: 'It should not dissolve'. But this has been relinquished, cast out, let loose, abandoned by the Realised One, forsaken, the life-process that has been given up. For sure this word was spoken by the Realised One:",
    "dn16:54": "Then the Gracious One approached the Attendance Hall, and after approaching he sat down on the prepared seat. While sitting the Gracious One addressed the monks, saying:",
    "dn16:55": "Then the Gracious One addressed the monks, saying:",
    "dn16:56": "Then the Gracious One, having dressed in the morning time, after picking up his bowl and robe, entered Vesālī for alms. After walking for alms in Vesālī, when he was returning from the alms-round after the meal, after looking at Vesālī with an elephant's look,[n.415] Buddhas, like elephants, apparently turn the whole body round to look back!he addressed venerable Ānanda, saying: \"This is the last time, Ānanda, there will be sight of Vesālī for the Realised One. Come Ānanda let us approach Bhaṇḍagāma.\"",
    "dn16:57": "Then the Gracious One, after living near Bhaṇḍagāma for as long as he liked, addressed venerable Ānanda, saying:",
    "dn16:58": "\"Here, monks, a monk might speak like this: 'I have heard this directly from the Gracious One, friends, directly I learned it: \"This is the Teaching, this is the Discipline, this is the Teacher's Dispensation.\"' That monk's speech, monks, is not to be rejoiced over, not to be scorned at. Without having rejoiced over it, without having scorned it, after learning those words and syllables well, they should be laid alongside the Discourses, they should be compared with the Discipline.",
    "dn16:59": "Then the Gracious One, after living near Bhoganagara for as long as he liked, addressed venerable Ānanda, saying: \"Come Ānanda let us approach Pāvā.\"",
    "dn16:60": "Then for the Gracious One, after eating Cunda the Smith's food, a painful affliction arose, bloody dysentery, and strong feelings occurred, such as end in death. There the Gracious One, mindfully, with full awareness, bore those pains without being troubled. Then the Gracious One addressed venerable Ānanda, saying: \"Come, Ānanda, let us approach Kusinārāā.\"",
    "dn16:61": "Then the Gracious One, having gone down from the road, approached the root of a certain tree, and after approaching, he addressed venerable Ānanda, saying: \"Come now, Ānanda, prepare the outer robe folded in four for me, I am weary, Ānanda, and will sit down.\"",
    "dn16:62": "Now at that time Pukkasa Mallaputta, a disciple of Āḷāra Kālāma,[n.420] The first teacher the future Buddha went to: see26.was travelling along the highway from Pāvā to Kusinārāā. Pukkasa Mallaputta saw the Gracious One sitting at the root of a certain tree. And having seen him he approached the Gracious One, and after approaching and worshipping the Gracious One, he sat down on one side. While sitting on one side Pukkasa Mallaputta said this to the Gracious One: \"It is wonderful, reverend Sir, it is marvellous, reverend Sir, that those who have gone forth, reverend Sir, live such a peaceful living.",
    "dn16:63": "\"Now what do you think, Pukkusa, which is the more difficult to do or the more difficult to come by: that someone though conscious and awake, when about five hundred waggons passed by very close should neither see them nor hear a sound, or that someone, though conscious and awake, when the Divinities rain down, when the Divinities throw it down, and the lightning flashes, and the thunder crashes forth, should neither see it nor hear a sound?\"",
    "dn16:64": "Then, Pukkusa, this occurred to that man: 'It is wonderful, it is marvellous, that those who have indeed gone forth live such a peaceful living. Because though conscious and awake when the Divinities rained down, when the Divinities threw it down, and the lightning flashed, and the thunder crashed forth, he did not see it or hear a sound!' And after gaining great confidence in me, worshipping and circumamblating me, he left.\"",
    "dn16:65": "Then, venerable Ānanda, not long after Pukkusa Mallaputta had departed, offered that pair of polished gold-coloured robes, ready to wear, to the Gracious One, and when placed on the Gracious One's body they appeared to have lost their gleam.",
    "dn16:66": "Then the Gracious One with a great Community of monks went to the river Kakutthā, and after going, and entering into the river Kakutthā, bathing, and drinking, and coming back out, he approached the mango wood, and after approaching, he addressed venerable Cundaka, saying: \"Come now, Cundaka, prepare the outer robe folded in four for me, I am weary, Cundaka, and will lie down.\"",
    "dn16:67": "Then the Gracious One addressed venerable Ānanda, saying: \"It may be, Ānanda, that someone might cause remorse for the smith Cunda, saying: 'There is no gain for you, friend Cunda, it is a poor gain for you, in that the Realised One, after eating his last almsfood from you, attained Final Emancipation.'",
    "dn16:68": "Then the Gracious One addressed venerable Ānanda, saying: \"Come Ānanda, let us approach the further shore of the Golden river, to Kusinārāā, and to the Mallas' Sal Wood at Upavattana.\"[n.423] Or ‘the recreation-ground (upavattana) belonging to the Mallas’.",
    "dn16:69": "Then the Gracious One said this to venerable Ānanda: \"The Twin Sal Trees are full of flowering blossoms, outside of flowering time, and they are sprinkling down on the Realised One's body, showering down, pouring down on the Realised One in worship. Also the Divine Coral Tree flowers are falling from the sky, and they are sprinkling down on the Realised One's body, showering down, pouring down on the Realised One in worship. Also Divine sandalwood powder is falling from the sky, and is sprinkling down on the Realised One's body, showering down, pouring down on the Realised One in worship. Also Divine music plays in the sky in worship of the Realised One. Also Divine songs play in the sky in worship of the Realised One.",
    "dn16:70": "Now at that time venerable Upavāṇa was standing in front of the Gracious One, fanning the Gracious One. Then the Gracious One dismissed venerable Upavāṇa, saying: \"Depart, monk, do not stand in front of me.\"",
    "dn16:71": "\"But what beings and Divinities is the Gracious One thinking of?\"",
    "dn16:72": "\"Formerly, reverend Sir, the monks, having dwelt for the Rains Retreat used to come to see the Realised One, and we would receive those meditating monks for assembling and seeing the Realised One. But after the Gracious One has passed way, reverend Sir, we will not receive those meditating monks for assembling and seeing the Realised One.\"",
    "dn16:73": "\"How, reverend Sir, are we to act in regard to women?\"",
    "dn16:74": "\"How should we act, reverend Sir, in regard to the Realised One's body?\"",
    "dn16:75": "\"How should we act, reverend Sir, in regard to the Realised One's body?\"",
    "dn16:76": "These four persons, Ānanda, are worthy of a Shrine. Which four?",
    "dn16:77": "Then venerable Ānanda, after entering the living place,[n.435] The word used isvihārawhich in the context cannot mean ‘monastery’, and DA calls it a pavilion. The neutral rendering ʹlodgingʹ is safest.and leaning against the door-lintel,[n.436]Kapisīsaṁlit. ‘monkey’s head’. Scarcely ‘lintel’ (RD): Ananda would have to be fairly tall to lean on this! The definition in DA is rather obscure, but that quoted by Childers from the 12th-century Abhidhānapadīpikā (his main source) is ‘the bolt or bar of a door’ (aggalathambo), andaggaḷais used in this sense atDN 3.8. But Childers also quotes a Sanskrit meaning of ‘coping of a wall’.stood there crying: \"The Teacher will attain Final Emancipation while I am still a Trainee with much to do, he who has compassion for me!\"",
    "dn16:78": "Then the Gracious One addressed the monks, saying: \"Whoever were Worthy Ones, Perfect Sambuddhas in the past, monks, for those Gracious Ones also there were such superior attendants, just as Ānanda is for me; whoever will be Worthy Ones, Perfect Sambuddhas in the future, monks, for those Gracious Ones also there will be such superior attendants, just as Ānanda is for me.",
    "dn16:79": "There are four wonderful and marvellous things, monks, about Ānanda. Which four?",
    "dn16:80": "After this was said, venerable Ānanda addressed the Gracious One, saying: \"Reverend Sir, may the Gracious One not attain Final Emancipation in this small town, this barren town, this branch town. There are, reverend Sir, other great towns, such as: Campā, Rājagaha, Sāvatthī, Sāketa, Kosambī, Bārāṇasī—let the Gracious One attain Final Emancipation there. There are many wealthy Nobles there, wealthy brahmins, wealthy householders, who are devoted to the Realised One, and will worshipfully dispose of the Realised One's body.\" \"Do not say that, Ānanda, do not say that, Ānanda: 'This small town, this barren town, this branch town'.",
    "dn16:81": "\"Go, Ānanda, and after entering into Kusinārāā, announce to the Mallas: 'Today, Vāseṭṭhas,[n.441] This is the family-name (cf.,n.179).in the last watch of the night, will be the Realised One's attainment of Final Emancipation, come along, Vāseṭṭhas, come along, Vāseṭṭhas, do not regret it afterwards thinking: \"In the area of our village, was the Realised One's attainment of Final Emancipation, and we did not, in the last watch of the night, get to see the Realised One\"'.\"",
    "dn16:82": "Now at that time a wanderer named Subhadda had arrived at Kusinārāā. The wanderer Subhadda heard: \"Today, it seems, in the last watch of the night, will be the ascetic Gotama's attainment of Final Emancipation.\"",
    "dn16:83": "The Gracious One heard venerable Ānanda having this conversation with the wanderer Subhadda. Then the Gracious One said this to venerable Ānanda: \"Enough, Ānanda, do not obstruct Subhadda allow Subhadda to see the Realised One. Whatever Subhadda will ask of me all of it he will ask of me seeking for deep knowledge,[n.442]Aññā-pekho:rendered by RD as ‘from a desire for knowledge’, which agrees with DA. Butaññāis used for ‘the highest knowledge’, i.e. ‘enlightenment’, and we may assume a play on the two senses (mundane and supramundane) of ‘enlightenment’, equally possible in Pali and in English.and not to trouble me. Whatever question is put I will answer, and he will quickly understand it.\"",
    "dn16:84": "\"Wherever, Subhadda, the Noble Eightfold Path is not found in a Teaching and Discipline there a true ascetic is not found, there a second true ascetic is not found, there a third true ascetic is not found, there a fourth true ascetic is not found.[n.443] These are, of course, the Stream-Winner, Once-Returner, Non-Returner and Arahant.",
    "dn16:85": "After this was said, the wanderer Subhadda said this to the Gracious One: \"Excellent, reverend Sir! Excellent, reverend Sir! Just as, reverend Sir, one might set upright what has been overturned, or open up what has been closed, or show a path to one who is lost, or bear an oil lamp in the darkness, so that one who has eyes can see forms, just so has the Teaching been made clear by the Gracious One in more than one way. I go to the Gracious One for refuge, reverend Sir, and to the Teaching, and to the Community of monks. May I receive the going-forth, reverend Sir, in the presence of the Gracious One, may I receive the full ordination.\"",
    "dn16:86": "Then the Gracious One addressed venerable Ānanda, saying: \"It may be, Ānanda, that some of you may think in this way: 'Past is the Teacher's word, there is now no Teacher for us.' But it should not be seen like that, Ānanda, whatever Teaching and Discipline has been taught by me or laid down, Ānanda, that is your Teacher after my passing away.",
    "dn16:87": "Then the Gracious One addressed the monks, saying: \"It may be, monks, that for one of the monks there is doubt or confusion about the Buddha, or about the Teaching, or about the Community, or about the Path, or about the practice. Ask, monks, do not be regretful later thinking: 'The Teacher was face to face with us and we didn't ask the Gracious One directly about the training.'\" After this was said those monks were silent.",
    "dn16:88": "Then the Gracious One addressed the monks, saying: \"Come now, monks, for I tell you all conditioned things are subject to decay, strive on with heedfulness!\" These were the last words of the Realised One.[n.453]Vayadhammā saṅkhārā. Appamādena sampādetha.The words occurred previously atDN 16.. RD’s rendering of the latter two words, ‘Work out your salvation with diligence’ (adopted from Warren) has become too famous. Even Brewster, who normally follows RD, has changed it to ‘Accomplish earnestly!’, which is much better. Much has been made in some quarters of the fact that the Sarvastivadin version (and therefore the Tibetan translation) omits these words. But the passage is even expanded in one Chinese version, which makes dubious any conclusions which may be drawn from the omission elsewhere. However, there does seem to have been an early corruption in the text, as in the parallel passage at SN 6.2.5.2 the order of the two sentences is reversed: appamādena sampādetha vayadhammā saṅkhādrā (= S i, 158). The inference is that the words quoted were lost at an early stage in the Sarvastivadin tradition. The SN passage probably reflects an intermediate stage in that process.",
    "dn16:89": "Then the Gracious One attained the first absorption, and after emerging from the first absorption he attained the second absorption, and after emerging from the second absorption he attained the third absorption, and after emerging from the third absorption he attained the fourth absorption, and after emerging from the fourth absorption he attained the sphere of endless space, and after emerging from the sphere of endless space he attained the sphere of endless consciousness, and after emerging from the sphere of endless consciousness he attained the sphere of nothingness, and after emerging from the sphere of nothingness, he attained the sphere of neither-perception-nor-non-perception, and after emerging from the sphere of neither-perception-nor-non-perception, he attained the cessation of perception and feeling.[n.454] RD says ‘No one, of course, can have known what actually did occur.’ Since Anuruddha is said to have had highly developed psychic powers, we cannot be so sure.",
    "dn16:90": "When the Gracious One attained Final Emancipation along with the Emancipation there was a great earthquake, and an awful, horrifying crash of the Divinities' thunder drum. When the Gracious One attained Final Emancipation along with the Emancipation Brahmā Sahampati[n.456] As inMN 26, etc., and playing the same role as inDN 141.spoke this verse:",
    "dn16:91": "\"All beings in the world will surely lay aside the body,In the same way the Teacher, Such-like, unmatched in the world,the Realised One, attained to the ten strengths, the Sambuddha, has attained Final Emancipation.\"",
    "dn16:92": "When the Gracious One attained Final Emancipation along with the Emancipation Sakka, the Lord of the Divinities, spoke this verse:",
    "dn16:93": "When the Gracious One attained Final Emancipation along with the Emancipation venerable Anuruddha spoke these verses:",
    "dn16:94": "When the Gracious One attained Final Emancipation those monks there who were not free from passion, throwing up their arms, falling down as though cut down, rolling backwards and forwards as though with their feet cut off, were crying: 'Too quickly the Gracious One has attained Final Emancipation, too quickly the Fortunate One has attained Final Emancipation, too quickly the Visionary in the world has disappeared!' But those monks who were free from passion, mindfully, with full awareness, endured, thinking: \"Impermanent are all processes, how can it be otherwise?\"",
    "dn16:95": "Then venerable Anuruddha said this to the monks: \"Enough, friends, do not grieve, do not lament, were you not warned by the Gracious One when he declared: 'There is alteration in, separation from, and changeability in all that is dear and appealing.' How can it be otherwise, friends, for that which is obtained, born, become, in process, subject to dissolution? It is not possible to say this: 'It should not dissolve'. The Divinities, friends, are complaining.\" \"But what beings and Divinities is the venerable Anuruddha thinking of?\"",
    "dn16:96": "Then venerable Anuruddha addressed venerable Ānanda, saying: \"Go, Ānanda, and after entering Kusinārāā inform the Mallas of Kusinārāā, saying: 'The Gracious One has attained Emancipation, Vāseṭṭhas, now is the time for whatever you are thinking.'\"",
    "dn16:97": "Then the Mallas from Kusinārāā ordered their men, saying: \"Now, friends, gather together perfume and flowers, and all the musicians in Kusinārāā.\"",
    "dn16:98": "Now at that time eight leaders of the Mallas, having washed their heads and put on clean clothes, said: \"Let us lift the Gracious One's body,\" but they were not able to lift it.",
    "dn16:99": "Now at that time the whole of Kusinārāā, including the dirty rubbish heaps, was covered knee-deep with Divine Coral Tree flowers. Then the Divinities and the Mallas of Kusinārāā while honouring, respecting, revering, and worshipping the Gracious One's body with the Divinities' and mens' dance, song, music, garlands, and perfumes, after carrying it to the North of the City by the North, and re-entering the City by the North Gate, and carrying it to the middle of the City by the middle, and going out by the Eastern Gate, to the East of the City, at the Mallas' Shrine called the Bonded Coronet there set down the Gracious One's body.",
    "dn16:100": "Then the Mallas of Kusinārāā said this to venerable Ānanda: \"How do we act, reverend Ānanda, in regard to the Realised One's body?\"",
    "dn16:101": "Now at that time venerable Mahākassapa[n.458] One of the Buddha’s most eminent disciples, not to be confused with the many other Kassapas. He had great psychic powers and is said to have lived to be more than 120. He presided at the first Council.was travelling along the highway from Pāvā to Kusinārāā, together with a great Community of monks, around five-hundred monks. Then venerable Mahākassapa, after descending from the path, sat down at the root of a certain tree.",
    "dn16:102": "Now at that time one who had gone forth in old age, named Subhadda[n.460] Not, of course, the same person as the Subhadda mentioned at 5.23—30.was sitting in that group. Then Subhadda, who had gone forth in old age, said this to those monks: \"Enough, friends, do not grieve, do not lament, we are now freed from that troublesome Great Ascetic, saying: 'This is allowable for you, this is not allowable for you.' But now we will do whatever we wish, and we will not do whatever we do not wish.\"",
    "dn16:103": "Now at that time four leaders of the Mallas, having washed their heads and put on clean clothes, said: \"Let us burn the Gracious One's funeral pyre,\" but they were not able to burn it. Then the Mallas of Kusinārāā said this to venerable Anuruddha: \"What is the reason, venerable Anuruddha, what is the cause, why four leaders of the Mallas, having washed their heads and put on clean clothes, and saying: 'Let us burn the Gracious One's funeral pyre,' are not able to burn it?\"",
    "dn16:104": "Then venerable Mahākassapa approached Kusinārāā, and the Mallas' Shrine called the Bonded Coronet, and the Gracious One's funeral pyre, and after approaching and arranging his robe on one shoulder, extending his hands in respectful salutation, and circumambulating the funeral pyre three times, and uncovering the feet he worshipped the Gracious One's feet with his head.",
    "dn16:105": "Now while the Gracious One's body was burning, of the outer skin, the inner skin, the flesh, the sinews, the synovial fluid, neither charcoal was evident, nor was ash of the body left overonly the bones remained.[n.461]Sarīra:bones (later interpreted as the indestructible substance supposed to be found in the ashes of Arahants).Just as while ghee or oil is burning there is no charcoal and no ash evident, so when the Gracious One\"s body was burning, of the outer skin, the inner skin, the flesh, the sinews, the synovial fluid, neither charcoal was evident, nor was ash of the body left over. Only two of those five-hundred pairs of clothes were not consumed, that on the inside and that on the outside.",
    "dn16:106": "The Magadhan King Ajātasattu, the son of Lady Wisdom, heard: \"The Gracious One, it seems, has attained Final Emancipation in Kusinārāā.\" Then the Magadhan King Ajātasattu, the son of Lady Wisdom, sent a message to the Mallas of Kusinārāā, saying: \"The Gracious One was a Noble, and I also am a Noble, I am worthy of a share of the Gracious One's bodily relics, I will make a Shrine and hold a festival for the bodily relics.\"",
    "dn16:107": "After this was said, the brahmin Doṇa said this to their community and group:",
    "dn16:108": "\"Now, brahmin, you must divide the Gracious One's bodily relics in eight equal divisions.\"",
    "dn16:109": "Then the Magadhan King Ajātasattu, the son of Lady Wisdom, made a Shrine for the Gracious One's bodily relics at Rājagaha and held a festival.",
    "dn16:110": "There were eight measures of the Visionary's relics,Seven measures are honoured in Jambudīpa,One measure of the most Noble ManThe King of the Dragons honours in Rāmagāma."
}