{
    "dn17:1": "Thus have I heard.[n.465] As RD notes, this Sutta is an expansion of the conversation recorded atDN 6.80. The same legend also occurs, with some variations (analysed by RD) in the Mahasudassana Jataka (No. 95). As inDN5, the Buddha at the end identifies himself, Jataka-fashion, with the leading character in the story. The whole thing is deliberately set in an atmosphere of fairy-tale splendour: cf.n.468.Once the Lord was staying at Kusinara in the Mallas' sāl-grove shortly before his final Nibbāna between the twin sāl-trees.",
    "dn17:2": "'Ananda, don't call it a miserable little town of wattle-and-daub, right in the jungle in the back of beyond!",
    "dn17:3": "Once upon a time, Ananda, King Mahāsudassana[n.466] 'The Great King of Glory' (RD). RD is probably right in believing that the germ of the story (though not, I think, its Buddhist moral) lies in a sun-myth, a theory which in his day was unpopular because of having been overworked.was a wheel-turning monarch, a rightful and righteous king, who had conquered the land in four directions and ensured the security of his realm. And this King Mahasudassana had this very Kusinara, under the name of Kusāvatī, for his capital. And it was twelve yojanas long from east to west, and seven yojanas wide from north to south. Kusāvatī was rich, prosperous and well-populated, crowded with people and well-stocked with food. Just as the deva-city of Āḷakamandā is rich…as Sutta 16, verse 5.18, so was the royal city of Kusavati. And the city of Kusavati was never free of ten sounds by day or night: the sound of elephants, horses, carriages, kettle-drums, side-drums, lutes, singing, cymbals and gongs, with cries of \"Eat, drink and be merry\" as tenth.",
    "dn17:4": "'The royal city of Kusāvatī was surrounded by seven encircling walls. One was of gold, one silver, one beryl, one crystal, one ruby, one emerald, and one of all sorts of gems.",
    "dn17:5": "'Kusāvatī was surrounded by seven rows of palm-trees, of the same materials. The gold trees had gold trunks with silver leaves and fruit, the silver trees had silver trunks with gold leaves and fruit. The beryl trees had beryl trunks with crystal leaves and fruit, the crystal trees had crystal trunks with beryl leaves and fruit. The ruby trees had ruby trunks and emerald leaves and fruit, the emerald trees had emerald trunks and ruby leaves and fruit, while the trees of all sorts of gems were the same as regards trunks, leaves and fruit. The sound of the leaves stirred by the wind was lovely, delightful, sweet and intoxicating, just like that of the five kinds of musical instruments[n.467] RD accidentally writes 'seven' instead of 'five'. The five kinds are given as drums with leather on one side, on both sides, completely covered in leather, cymbals (or bells) and wind.played in concert by well-trained and skilful players. And, Ananda, those who were libertines and drunkards in Kusavati had their desires assuaged by the sound of the leaves in the wind.[n.468] Or perhaps 'feasted their senses', but hardly, I think, 'danced' (as RD: a ludicrous picture!): see PED under paricarati. RD quotes a passage from the Mahayana Sukhāvativyūha, a key text of the Pure Land school (as, e.g. Shin in Japan). The 'Land of Bliss'(Sukhavati)created by Amitabha Buddha for those who have faith in him has features which appear to owe something to this description. But there the effect of the sound of the bells is: 'And when the men there hear that sound, reflection on Buddha arises in their body (sic!), reflection on the Law, reflection on the Assembly'.",
    "dn17:6": "'King Mahasudassana was endowed with the seven treasures and the four properties. What are the seven? Once, on a fast-day of the fifteenth,[n.49] Cf.n.93.when the King had washed his head and gone up to the verandah on top of his palace to observe the fast-day, the divine Wheel-Treasure[n.470] RD declares categorically: 'This is the disk of the sun', which may, originally, be correct. It symbolises both royal authority and the moral law.appeared to him, thousand-spoked, complete with felloe, hub and all appurtenances. On seeing it, King Mahasudassana thought: \"I have heard that when a duly anointed Khattiya king sees such a wheel on the fast-day of the fifteenth, he will become a wheel-turning monarch. May I become such a monarch!\"",
    "dn17:7": "'Then, rising from his seat, covering one shoulder with his robe, the King took a gold vessel in his left hand, sprinkled the Wheel with his right hand, and said: \"May the noble Wheel-Treasure turn, may the noble Wheel-Treasure conquer!\" The Wheel turned to the east, and King Mahasudassana followed it with his fourfold army.[n.41] Elephants, cavalry, chariots and infantry.And in whatever country the Wheel stopped, the King took up residence with his fourfold army.",
    "dn17:8": "'Then the Wheel-Treasure, having conquered the lands from sea to sea, returned to the royal capital of Kusāvati and stopped before the King's palace as he was trying a case,[n.473] Attha-karana-pamukhe. 'As he was trying a case' omitted by RD.as if to adorn the royal palace. And this is how the Wheel-Treasure appeared to King Mahasudassana.",
    "dn17:9": "'Then the Elephant-Treasure appeared to King Mahāsudassana, pure white,[n.474] This description may have something to do with the veneration accorded so-called 'white' elephants in Thailand.of sevenfold strength, with the wonderful power of travelling through the air, a royal tusker called Uposatha.[n.475] Seen.3.RD translates, cumbrously, 'Changes of the Moon'.Seeing him, the King thought: \"What a wonderful riding-elephant, if only he could be brought under control!\" And this Elephant-Treasure submitted to control just like a thoroughbred that had been trained for a long time. And once the King, to try him, mounted the Elephant-Treasure at crack of dawn and rode him from sea to sea, returning to Kusāvatī in time for breakfast. And that is how the Elephant-Treasure appeared to King Mahasudassana.",
    "dn17:10": "'Then the Horse-Treasure appeared to King Mahasudassana, with a crow's head,[n.476] 'With a crow-black head' (RD). But the term may refer to the shape not the colour.dark-maned, with the wondrous power of travelling through the air, a royal stallion called Valahaka.[n.477] 'Thunder-Cloud', and so rendered by RD.And the King thought: \"What a wonderful mount, if only he could be brought under control!\" And this Horse-Treasure submitted to control just like a thoroughbred that had been trained for a long time… And that is how the Horse-Treasure appeared to King Mahasudassana.",
    "dn17:11": "'Then the Jewel-Treasure appeared to King Mahāsudassana. It was a beryl, pure, excellent, well-cut into eight facets, clear, bright, unflawed, perfect in every respect. The lustre of this Jewel-Treasure radiated for an entire yojana round about. And once the King, to try it, went on night-manoeuvres on a dark night with his four-fold army, with the Jewel-Treasure fixed to the top of his standard. And all who lived in the villages round about started their daily work, thinking it was daylight. And that is how the Jewel-Treasure appeared to King Mahāsudassana.",
    "dn17:12": "'Then the Woman-Treasure appeared to King Mahāsudassana, lovely, fair to see, charming, with a lotus-like complexion, not too tall or too short, not too thin or too fat, not too dark or too fair, of more than human, deva-like beauty. And the touch of the skin of the Woman-Treasure was like cotton or silk, and her limbs were cool when it was hot, and warm when it was cold. Her body smelt of sandal-wood and her lips of lotus. This Woman-Treasure rose before the King and retired later, and was always willing to do his pleasure, and she was pleasant of speech. And this Woman-Treasure was not unfaithful to the King even in thought, much less in deed. And that is how the Woman-Treasure appeared to King Mahasudassana.[n.478] This is a stock description, as RD notes. The humour of the Buddha’s employing such a description to the aged ascetic Ananda should not pass unnoticed!",
    "dn17:13": "'Then the Householder-Treasure appeared to King Mahasudassana. With the divine eye which, as the result of kamma, he possessed,[n.479] All such gifts are the result(vipāka)of past kamma.he saw where treasure, owned and ownerless, was hidden. He came to the King and said: \"Have no fear, Your Majesty, I will look after your wealth properly.\" And once, the King, to try him, went on board a ship and had it taken to the current in the middle of the Ganges. Then he said to the Householder-Treasure: \"Householder, I want some gold coin!\" \"Well then, Sire, let the ship be brought to one bank.\" \"I want the gold coins here!\" Then the householder touched the water with both hands and drew out a vessel full of gold coins, saying: \"Is that enough, Sire? Will that do, Sire?\" and the King said: \"That is enough, householder, that will do, you have served me enough.\" And that is how the Householder-Treasurer appeared to King Mahāsudassana.",
    "dn17:14": "'Then the Counsellor-Treasure appeared to King Mahāsudassana. He was wise, experienced, clever and competent to advise the King on how to proceed with what should be proceeded with, and to withdraw from what should be withdrawn from, and to overlook what should be overlooked.[n.480] The third clause omitted by RD.He came to the King and said: \"Have no fear, Your Majesty, I shall advise you.\" And that is how the Counsellor-Treasure appeared to King Mahasudassana,",
    "dn17:15": "… and how he was equipped with all the seven treasures.",
    "dn17:16": "'Again, Ananda, King Mahasudassana was endowed with the four properties.[n.481]Iddhi:quite distinct from those listed at DN 2.87 (and seen.128there).What are they? Firstly, the King was handsome, good to look at, pleasing, with a complexion like the finest lotus, surpassing other men.",
    "dn17:17": "'Secondly, he was long-lived, outliving other men.",
    "dn17:18": "'Thirdly, he was free from illness, free from sickness, with a healthy digestion, less subject to cold and heat than that of other men.[n.482] Gahaṇi: supposedly a special organ of digestion. But the medieval Sinhalese rendering quoted by RD (and Childers), 'the internal fire which promotes digestion', is not so far wrong.",
    "dn17:19": "'Fourthly, he was beloved and popular with Brahmins and householders. Just as a father is beloved by his children, so he was with Brahmins and householders. And they were beloved by the King as children are beloved by their father.",
    "dn17:20": "Once the King set out for the pleasure-park with his fourfold army, and the Brahmins and householders came to him and said: \"Pass slowly by, Sire, that we may see you as long as possible!\" And the King said to the charioteer: \"Drive the chariot slowly so that I can see these Brahmins and householders as long as possible.\" Thus King Mahasudassana was endowed with these four properties.",
    "dn17:21": "'Then King Mahasudassana thought: \"Suppose I were to construct lotus-ponds between the palm-trees, a hundred bow-lengths[n.483] Dhanu: 'bow'. Childers, but not PED, gives 'a measure of length' — the required meaning here.apart.\"",
    "dn17:22": "And he did so.",
    "dn17:23": "The lotus-ponds were lined with four-coloured tiles, gold, silver, beryl and crystal, each pond being approached by four staircases, one gold, one silver, one beryl and one crystal. And the gold staircase had gold posts with silver railings and banisters, the silver had silver posts with gold railings and banisters, and so on. And the lotus-ponds were provided with two kinds of parapet, gold and silver — the gold parapets having gold posts, silver railings and banisters, and the silver parapets having silver posts, gold railings and banisters.",
    "dn17:24": "'Then the King thought: \"Suppose I were to provide each pond with suitableflowers forgarlands[n.484] RD notes the literal meaning: 'have garlands planted for all the people to put onʹ- being the only use for flowers at the time.– blue, yellow, red and white lotuses which will last through all seasons without fading?\"",
    "dn17:25": "And he did so.",
    "dn17:26": "Then he thought: \"Suppose I were to place bathmen on the banks of these ponds, to bathe those who come there?\" And he did so. Then he thought: \"Suppose I were to establish charitable posts on the banks of these ponds, so that those who want food can get it, those who want drink can get it, those who want clothes can get it, those who want transport can get it, those who want a sleeping-place can get it, those who want a wife can get one, and those who want gold coin can get it?\" And he did so.",
    "dn17:27": "'Then the Brahmins and householders took great wealth and went to the King, saying: \"Sire, here is wealth that we have gathered together especially for Your Majesty, please accept it!\" \"Thank you, friends, but I have enough wealth from legitimate revenues. Let this be yours, and take away more besides!\" Being thus refused by the King, they withdrew to one side and considered: \"It would not be right for us to take this wealth back home again. Suppose we were to build a dwelling for King Mahasudassana.\" So they went to the King and said: \"Sire, we would build you a dwelling\", and the King accepted by silence.",
    "dn17:28": "'Then Sakka, ruler of the gods, knowing in his mind King Mahasudassana's thought, said to the attendant-deva Vissakamma:[n.485] 'All-maker' (or 'Factotum'), Skt. Viśvakarman. He has come down here a little from once being 'the great architect of the Universe'.\"Come, friend Vissakamma, and build a dwelling for King Mahasudassana, a palace called Dhamma.\" \"Very good, Lord\", Vissakamma replied and, as swiftly as a strong man might stretch his flexed arm or flex it again, he at once vanished from the Heaven of the Thirty-Three and appeared before King Mahasudassana, and said to him: \"Sire, I shall build you a dwelling, a palace called Dhamma.\" The King assented by silence, and Vissakamma built him the Palace of Dhamma.",
    "dn17:29–30": "'The Palace of Dhamma, Ananda, was a yojana in length from east to west, and half a yojana wide from north to south. The whole palace was faced up to three times a man's height with tiles of four colours, gold, silver, beryl and crystal, and it contained eighty-four thousand columns of the same four colours.",
    "dn17:31": "It had twenty-four staircases of the same four colours, and the gold staircases had gold posts with silver railings and banisters…as verse 23.",
    "dn17:32": "It also had eighty-four thousand chambers of the same colours. In the gold chamber was a silver couch, in the silver chamber a gold couch, in the beryl chamber an ivory couch, and in the crystal chamber a sandalwood couch. On the door of the gold chamber a silver palm-tree was figured, with silver stem, gold leaves and fruit… On the door of the silver chamber a golden palm-tree was figured, with golden trunk, leaves and fruit, on the door of the beryl chamber a crystal palm-tree was figured, with crystal trunk and beryl leaves and fruit, on the door of the crystal chamber a beryl palm-tree was figured, with crystal leaves and fruit.",
    "dn17:33": "'Then the King thought: \"Suppose I were to make a grove of palm-trees all of gold by the door of the great gabled chamber where I sit in the daytime?\" and he did so.",
    "dn17:34": "'The Dhamma Palace was surrounded by two nets of tinkling bells. One net was gold with silver bells, the other silver with gold bells. And when these nets of bells were stirred by the wind their sound was lovely, delightful, sweet and intoxicating, just like that of the five kinds of musical instruments played in concert by well-trained and skilful players. And those who were libertines and drunkards in Kusāvatī had their desires assuaged by the sound of those nets of bells.",
    "dn17:35": "'And when the Dhamma Palace was finished, it was hard to look at, dazzling to the eyes, just as in the last month of the Rains, in autumn, when there is a clear and cloudless sky, the sun breaking through the mists is hard to look at, so was the Dhamma Palace when it was finished.",
    "dn17:36–37": "'Then the King thought: \"Suppose I were to make a lotus-lake called Dhamma in front of the Dhamma Palace?\" so he did so. This lake was a yojana long from east to west, and half a yojana wide from north to south, and lined with four kinds of tiles, gold, silver, beryl and crystal. There were twenty-four staircases to it of four different kinds: gold, silver, beryl and crystal. The gold staircases had gold posts with silver railings and banisters, the silver had gold railings and banisters …and so on, as verse 22.",
    "dn17:38": "'The Dhamma Lake was surrounded by seven kinds of palm-trees. The sound of the leaves stirred by the wind was lovely, delightful, sweet and intoxicating, just like that of the five kinds of musical instruments played in concert by well-trained and skilful players. And, Ananda, those who were libertines and drunkards in Kusāvatī had their desires assuaged by the sound of the leaves in the wind.",
    "dn17:39": "'When the Dhamma Palace and the Dhamma Lake were finished, King Mahāsudassana, having satisfied every wish of those who at the time were ascetics or Brahmins, or revered as such, ascended into the Dhamma Palace.'",
    "dn17:40": "'Then King Mahāsudassana thought: \"Of what kamma is it the fruit, of what kamma is it the result, that I am now so mighty and powerful?\" Then he thought: \"It is the fruit, the result of three kinds of kamma: of giving, self-control, and abstinence.\"[n.486] SeeDN 2.17(end). Pūraṇa Kassapa denied that there was any merit in these.",
    "dn17:41": "'Then the King went to the great gabled chamber and, standing at the door, exclaimed: \"May the thought of lust cease! May the thought of ill-will cease! May the thought of cruelty cease! Thus far and no further the thought of lust, of ill-will, of cruelty!\"",
    "dn17:42": "'Then the King went into the great gabled chamber, sat down cross-legged on the golden couch and, detached from all sense-desires, detached from unwholesome mental states, entered and remained in the first jhāna, which is with thinking and pondering, born of detachment, filled with delight and joy. And with the subsiding of thinking and pondering, by gaining inner tranquillity and oneness of mind, he entered and remained in the second jhana, which is without thinking and pondering, born of concentration, filled with delight and joy. And with the fading away of delight, remaining imperturbable, mindful and clearly aware, he experienced in himself that joy of which the Noble Ones say: \"Happy is he who dwells with equanimity and mindfulness\", he entered and remained in the third jhāna. And, having given up pleasure and pain, and with the disappearance of former gladness and sadness, he entered and remained in the fourth jhāna which is beyond pleasure and pain, and purified by equanimity and mindfulness.",
    "dn17:43": "'Then the King, emerging from the great gabled chamber, went to the golden gabled chamber and, seated cross-legged on the silver couch, stayed pervading first one quarter, then the second, the third and the fourth quarter with a mind filled with loving-kindness. Thus he stayed, spreading the thought of loving-kindness above, below and across, everywhere, always with a mind filled with loving-kindness, abundant, magnified, unbounded, without hatred or ill-will. And he did likewise with compassion, sympathetic joy, and equanimity.[n.487] The four Divine Abidings(Brahmavihāras): cf. DN 13–76ff. andn.256there.",
    "dn17:44": "'Of King Mahasudassana's eighty-four thousand cities,[n.488] The conventional ('fairy-tale') nature of the repeated figure of 84,000 is obvious.his capital Kusāvatī was the chief; of his eighty-four thousand palaces Dhamma was the chief; of his eighty-four thousand gabled halls the great gabled chamber was the chief; his eighty-four thousand couches were of gold, silver, ivory, sandal-wood, covered with fleece, wool, spread with kadali-deer hide, with head-covers, with red cushions at both ends; of his eighty-four thousand elephants adorned with gold ornaments, with gold banners and spread with gold nets, Uposatha the royal tusker was chief; of his eighty-four thousand carriages, covered with lion-skins, tiger-skins, leopard-skins or with orange-coloured cloth, adorned with gold ornaments, gold banners and spread with gold nets, the chariot Vejayanta[n.489] 'Flag of Victory' (RD).was the chief; of his eighty-four thousand jewels the Jewel-Treasure was the chief; of his eighty-four thousand wives Queen Subhaddā[n.490] Subhaddā 'Queen of Glory' (RD). See alson.496.was the chief; of his eighty-four thousand householders the Householder-Treasure was the chief; of his eighty-four thousand Khattiya retainers the Counsellor-Treasure was the chief; his eighty-four thousand cows had tethers of fine jute and milk-pails (?) of silver;[n.491] RD has 'horns tipped with bronze'. The meaning is uncertain.his eighty-four thousand bales of clothing were of the finest linen, cotton, silk and wool; his eighty-four thousand rice-offerings were there for the taking by those in need, evening and morning.",
    "dn17:45": "'And at that time, King Mahasudassana's eighty-four thousand elephants waited on him evening and morning. And he thought: \"These eighty-four thousand elephants wait on me evening and morning. How if, at the end of each century, forty-two thousand elephants were to wait on me, turn and turn about?\" And he gave instructions accordingly to his Counsellor-Treasure, and so it was done.",
    "dn17:46": "'And, Ananda, after many hundred, many hundred thousand years, Queen Subhadda thought: \"It is a long time since I saw King Mahasudassana. Suppose I were to go and see him?\" So she said to her women: \"Come now, wash your heads and put on clean clothes. It is long since we saw King Mahasudassana. We shall go to see him.\" \"Yes, Your Majesty\", they said, and prepared themselves as ordered, then returned to the Queen. And Queen Subhadda said to the Counsellor-Treasure : \"Friend Counsellor, draw up the fourfold army. It is long since we saw King Mahasudassana. We shall go and see him.\" \"Very good, Your Majesty\", said the Counsellor-Treasure and, having drawn up the fourfold army, he reported to the Queen: \"Now is the time to do as Your Majesty wishes.\"",
    "dn17:47": "'Then Queen Subhadda thought: \"King Mahāsudassana's faculties are purified, his complexion is clear and bright, oh – I hope he is not dead!\"[n.493] Cf.DN 16.4.37.",
    "dn17:48": "So she said to him: \"Sire, of your eighty-four thousand cities, Kusavati is the chief. Make a wish, arouse the desire to live there!\" Thus, reminding him of all his royal possessions(as verse 5)she exhorted him to wish to stay alive.",
    "dn17:49": "'At this, King Mahasudassana said to the Queen:",
    "dn17:50": "\"For a long time, Queen, you spoke pleasing, delightful, attractive words to me, but now at this last time your words have been unpleasing, undelightful, unattractive to me.\" \"Sire, how then am I to speak to you?\"",
    "dn17:51": "'At this, Queen Subhadda cried out and burst into tears. Then, wiping away her tears, she said:",
    "dn17:52": "\"Sire, all things that are pleasing and attractive are liable to change… Do not, Sire, die filled with longing…'",
    "dn17:53": "'Soon after this, King Mahasudassana died; and just as a householder or his son might feel drowsy after a good meal, so he felt the sensation of passing away, and he had a favourable rebirth in the Brahmā-world.",
    "dn17:54": "'Now, Ānanda, you might think King Mahasudassana at that time was somebody else. But you should not regard it so, for I was King Mahasudassana then. Those eighty-four thousand cities of which Kusavati was the chief were mine,… the eighty-four thousand rice-offerings…were mine.",
    "dn17:55": "'And of those eighty-four thousand cities I dwelt in just one, Kusāvatī,… of the eighty-four thousand wives I had, just one looked after me, and she was called Khattiyāni or Velāmikāni;[n.496] These may be names (as taken by Woodward in the parallel passage atSN 32.96), or they may mean 'Khattiya lady' and 'young maiden' respectively. Anyway, what about Subhaddā?of the eighty-four thousand bales of cloth I had just one … ; of the eighty-four thousand rice-offerings there was just one measure of choice curry that I ate.",
    "dn17:56": "'See, Ananda, how all those conditioned states of the past have vanished and changed! Thus, Ananda, conditioned states are impermanent, they are unstable, they can bring us no comfort, and such being the case, Ananda, we should not rejoice in conditioned states, we should cease to take an interest in them, and be liberated from them.",
    "dn17:57": "'Six times, Ānanda, I recall discarding the body in this place, and at the seventh time I discarded it as a wheel-turning monarch, a righteous king who had conquered the four quarters and established a firm rule, and who possessed the seven treasures. But, Ananda, I do not see any place in this world with its devas and māras and Brahmās, or in this generation with its ascetics and Brahmins, princes and people, where the Tathāgata will for an eighth time discard the body.'",
    "dn17:58": "So the Lord spoke. The Well-Farer having said this, the Teacher said:",
    "dn17:59": "'Impermanent are compounded things,prone to rise and fall,Having risen, they're destroyed,their passing truest bliss.'"
}