{
    "dn18:1": "Thus have I heard. Once the Lord was staying at Nādikā at the Brick House.[n.497] Cf. DN 6.2.5ff andn.373.And at that time the Lord was explaining the rebirths of various devotees up and down the country who had died and passed away: Kāsis and Kosalans, Vajjians and Mallas, Cetis and Vamsas, Kurus and Pañcālas, Macchas and Sūrasenas, saying: ‘This one was reborn there, and that one there.’[n.498] Cf.DN 6.2.7. RD considers, probably rightly, that the DN 6 passage is the older. There, no mention was made of Magadhan devotees, and one purpose of this Sutta is to remedy that omission.More than fifty Nādikan devotees, having abandoned the five lower fetters, were reborn spontaneously and would attain Nibbāna without returning to this world; over ninety of them, having abandoned three fetters and weakened greed, hatred and delusion, were Once-Returners, who would return to this world once more and then make an end of suffering; and more than five hundred, having abandoned three fetters, were Stream-Winners, incapable of falling into states of woe, certain of Nibbāna.",
    "dn18:2": "This news reached the ears of the devotees in Nādikā, and they were pleased, delighted and filled with joy to hear the Lord's replies.",
    "dn18:3": "And the Venerable Ananda heard of the Lord's report[n.499] A curious remark, considering that Ananda had been present at the Lord's 'report'.and the Nādikans' delight.",
    "dn18:4": "And he thought: 'There were also Magadhan disciples of long standing who have died and passed away. One would think Anga and Magadha contained no Magadhan disciples who had died. Yet they too were devoted to the Buddha, the Dhamma and the Saṅgha, and they observed the discipline perfectly. The Lord has not stated their destiny. It would be good to have a declaration about this: it would make the multitude have faith and so attain a good rebirth.",
    "dn18:5": "And after thus reflecting in solitude on behalf of the Magadhan devotees, the Venerable Ananda rose at the crack of dawn, went to the Lord and saluted him. Then, sitting down to one side, he said: 'Lord, I have heard what has been declared concerning the inhabitants of Nādikā.'as verse 1–2",
    "dn18:6": "As soon as Ananda had gone, the Lord took his robe and bowl and went into Nādikā for alms. Later, on his return, after his meal, he went to the Brick House and, having washed his feet, he went in and, having thought over, considered and given his whole mind to the question of the Magadhan devotees, he sat down on the prepared seat, saying: 'I shall know their destiny and future lot, whatever it is.'[n.502] The Buddha did not, of course, claim the immediate kind (or indeed any kind) of omniscience, as other teachers did. But in view of his immediate response atDN 1.2.7, he seems to be making rather heavy weather of this.And then he perceived the destiny and fate of each one of them. And in the evening, emerging from meditative seclusion, the Lord came out of the Brick House and sat down on the prepared seat in the shade of his lodging.",
    "dn18:7": "Then the Venerable Ananda came to the Lord, saluted him, sat down to one side and said: 'Lord, the Lord's countenance looks bright and shining, showing that the Lord's mind is at ease. Has the Lord been satisfied with today's lodging?'",
    "dn18:8": "'Ananda, after you spoke to me about the devotees of Magadha, I took my robe and bowl and went into Nādikā for alms. Later on … I went to the Brick House and considered the question of the Magadhan devotees… And I perceived the destiny and fate of each one of them.",
    "dn18:9": "Then the voice of a yakkha[n.503] Yakkhas are generally thought of as unpleasant creatures like demons or ogres. In fact they are curiously ambivalent (as Mrs Rhys Davids' term for them, 'fairy' suggests). The matter is largely explained by King Vessavana, who (as we know from this sutta too) is their ruler, atDN 32.2. But see alsoDN 23.23, and article Yakkha in DPPN.who had passed over cried out: \"I am Janavasabha, Lord! I am Janavasabha, Well-Farer!\" Well, Ananda, do you know anyone who formerly bore the name of Janavasabha?'",
    "dn18:10": "'I must admit, Lord, that I have never heard such a name; and yet, on hearing the name \"Janavasabha\"[n.504] Lit. 'Bull (i.e. hero) of the People'.my hairs stood on end, and I thought: \"He whose name is Janavasabha will not be such a low-ranking yakkha!\"'",
    "dn18:11": "Seven states here and seven there,fourteen births,That's the tallyof lives I can recall.",
    "dn18:12": "For a long time, Lord, I have known myself to be exempt from states of woe,[n.506] A Stream-Winner. The seven human births indicate the maximum number of births a Stream-Winner can take. Hence the ʹdesireʹ arising in him to go on to the next stage. But why should the Buddha be so surprised at his awareness of having gained such a 'specific attainmentʹ? His answer seems to be entirely in keeping with the 'Mirror of Dhammaʹ test mentioned by the Buddha atDN 16.2.8.and now the desire arises in me to become a Once-Returner.\"",
    "dn18:13": "I said: \"It is amazing, it is astonishing that the reverend yakkha Janavasabha should say this. On what grounds can he know of such an august specific attainment?\"",
    "dn18:14": "'\"Lord, in earlier days, long ago, on the fast-day of the fifteenth at the beginning of the Rains,[n.509]Vassa:the annual three-monthly retreat during the rainy season.in the full-moon night all the Thirty-Three Gods were seated in the Sudhamma Hall[n.510] 'Hall of Good Counsel' (RD).– a great congregation of divine beings, and the Four Great Kings from the four quarters were there. There was the Great King Dhatarattha[n.511] For a fuller account of him and the other 'Great Kings'who actually preside over the lowest of the heavens, only just above the human realm, seeDN 32.from the east at the head of his followers, facing west; the Great King Virūlhaka from the south… facing north; the Great King Virupakkha from the west…facing east; and the Great King Vessavana from the north… facing south.",
    "dn18:15": "'The gods of Thirty-Three rejoice,their leader too,Praising the Tathagata,and Dhamma's truth,",
    "dn18:16": "Seeing new-come devas,fair and gloriousWho've lived the holy life,now well reborn.",
    "dn18:17": "Outshining all the restin fame and splendorthe mighty sage's pupilssingled out",
    "dn18:18": "Seeing this, the Thirty-Three rejoice,their leader too,Praising the Tathagata,and Dhamma's truth.'",
    "dn18:19": "At this the Thirty-Three Gods rejoiced still more, saying: 'The devas' hosts are growing, the asuras' hosts are declining!'",
    "dn18:20": "The Kings, instructed,marked the words they spoke,Standing calm, serene,beside their seats.",
    "dn18:21": "\"'And then, Lord, a glorious radiance shone forth from the north, and a splendour was seen greater than the sheen of the devas. And Sakka said to the Thirty-Three Gods: 'Gentlemen, when such signs are seen, such light is seen and such radiance shines forth, Brahmā will appear.[n.514] Cf. DN 11.80.The appearance of such radiance is the first sign of Brahmā's approaching manifestation.'",
    "dn18:22": "When they see these signs,Brahmā will soon appear:This is Brahmā sign,radiance vast and great.",
    "dn18:23": "'\"Then the Thirty-Three Gods sat down each in his proper place, saying: 'Let us find out what comes[n.515] Vipāka: not here, as usually, in the technical sense of 'result of kamma', buta rare usage'outcome in general'.of this radiance, and having found the truth of it, we will go towards it.' The Four Great Kings, sitting down in their places, said the same. Thus they were all agreed.",
    "dn18:24": "\"'Lord, whenever Brahmā Sanankumāra[n.516] 'Ever virgin'or 'ever young'. One of the five sons of Brahma according to legend.appears to the Thirty-Three Gods, he appears having assumed a grosser form, because his natural appearance is not such as to be perceptible to their eyes.[n.517] An indirect way of exalting the Buddha: Brahma is so vastly superior to the Thirty-Three Gods, and yet he is inferior to the Buddha, and knows it.When he appears to the Thirty-Three Gods, he outshines other devas in radiance and glory, just as a figure made of gold outshines the human figure.",
    "dn18:25": "'\"Then, Lord, Brahmā Sanankumāra, having assumed a grosser form, appeared to the Thirty-Three Gods in the shape of the youth Pañcasikha.[n.521] Cf. DN 21.2and DN 19.1. DA says Brahma adopted this form because all the devas loved Pañcasikha.Rising up in the air, he appeared floating cross-legged, just as a strong man might sit down on a properly-spread couch or on the ground. And seeing the delight of the Thirty-Three Gods, he uttered these verses of rejoicing:",
    "dn18:26": "'The gods of Thirty-Three rejoice,their leader too,Praising the Tathāgata,and Dhamma's truth,",
    "dn18:27": "Seeing new-come devas,fair and gloriousWho've lived the holy life,now well reborn.",
    "dn18:28": "Outshining all the restin fame and splendour,The mighty Sage's pupilssingled out.",
    "dn18:29": "Seeing this, the Thirty-Three rejoice,their leader too,Praising the Tathāgata,and Dhamma's truth.'",
    "dn18:30": "\"'Now to the matter of Brahmā Sanankumāra's speech, and as for the manner of his speech, his voice had eight qualities: it was distinct, intelligible, pleasant, attractive, compact, concise, deep and resonant. And when he spoke in that voice to the assembly, its sound did not carry outside. Whoever has such a voice as that is said to have the voice of Brahmā.",
    "dn18:31": "\"'And Brahmā Sanankumāra, multiplying his shape by thirty-three, sat down cross-legged on each individual couch of the Thirty-Three, and said: 'What do my lords the Thirty-Three think? Since the Lord, out of compassion for the world and for the benefit and happiness of the many, has acted to the advantage of devas and mankind, those, whoever they may be, who have taken refuge in the Buddha, the Dhamma and the Saṅgha and have observed the moral precepts[n.522] Phrase omitted by RD- though it is an important qualification!have, at death and the breaking-up of the body, arisen in the company of the Parinimmita-Vasavatti devas,[n.523] For all of these groups, see Introduction, p. 38f.or the Nimmanaratti devas, or the Tusita devas, or the Yāma devas, or in the retinue of the Thirty-Three Gods, or of the Four Great Kings — or at the very least in the company of the gandhabbas .'[n.524] Celestial musicianscf.n.26. As attendants on the devas of the Realm of the Four Great Kings, they were the lowest grade of beings in the heavenly worlds. For a monk to be reborn among them was shameful: cf. DN 21.1iff. It should be noted that the gandhabba mentioned inMN 38as being present at the time of conception is not the same. The term there means 'one about to be born': see I.B. Homer's note, MLS i, p. 321, note 6.",
    "dn18:32": "'\"This was the burden of Brahmā Sanankumāra's speech. And every one of the gods he spoke to thought: 'He is sitting on my couch, he is speaking to me alone.'",
    "dn18:33": "All the forms assumedwith one voice speak,And having spoken,all at once are silent.",
    "dn18:34": "And so the Thirty-Three,their leader too,Each thinks:'He speaks to me alone.'",
    "dn18:35": "'\"Then Brahma Sanankumara assumed a single form;[n.525] RD mistranslates: 'betook himself to one endof the Hall'.then he sat down on the couch of Sakka and said:",
    "dn18:36": "'What do my lords the Thirty-Three think? This Lord, the Arahant supreme Buddha has known and seen the four roads to power,[n.526] Defined at Sutta 26.28. For further details see BDic.and how to develop, perfect and practise them. What four? Here a monk develops concentration of intention accompanied by effort of will, concentration of energy…, concentration of consciousness…, and concentration of investigation accompanied by effort of will. These are the four roads to power…",
    "dn18:37": "And whatever ascetics or Brahmins have in the past realised such powers in different ways, they have all developed and strongly practised these four ways, and the same applies to all who may in the future, or who do now realise such powers. Do my lords the Thirty-Three observe such powers in me?' 'Yes, Brahmā.' 'Well, I too have developed and strongly practised these four ways.'",
    "dn18:38": "'What do my lords of the Thirty-Three think? There are three gateways to the bliss proclaimed by the Lord who knows and sees. What are they? In the first place someone dwells in association with sense-desires, with unwholesome conditions. At some time he hears the Ariyan Dhamma, he pays close attention and practises in conformity with it. By so doing he comes to live dissociated from such sense-desires and unwholesome conditions. As a result of this dissociation, pleasant feeling[n.527]Sukha:'pleasant feelingphysical or mental'.arises, and what is more, gladness.[n.528]Somanassa:'pleasant mental feeling'. Here, a higher degree of sukha, not to be equated withpītiseen.81.Just as pleasure might give birth to rejoicing, so from pleasant feeling he experiences gladness.",
    "dn18:39": "'\"'In the second place there is someone in whom the gross tendencies[n.529] Saṅkhārā: a multi-valent termseen.293, for which see the excellent article in BDic. In his note to this passage, RD wrestles with its meaning, and coins the unfortunate rendering 'Confections', which, still more unfortunately, was later taken up by Suzuki, on whom it is usually fathered.of body, speech and thought are not allayed. At some time he hears the Ariyan Dhamma, … and his gross tendencies of body, speech and thought are allayed. As a result of this allaying, pleasant feeling arises, and what is more, gladness…",
    "dn18:40": "'\"'In the third place there is someone who really does not knew what is right and what is wrong, what is blameworthy and what is not, what is to be practised and what is not, what is base and what is noble, and what is foul, fair or mixed in quality. At some time he hears the Ariyan Dhamma, he pays dose attention and practises in conformity with it. As a result, he comes to know in reality what is right and wrong, what is blameworthy and what is not, what is to be practised and what is not, what is base and what is noble, and what is foul, fair or mixed in quality. In him who knows and sees thus, ignorance is dispelled and knowledge arises. With the waning of ignorance and the arising of knowledge, pleasant feeling arises, and what is more, gladness. Just as pleasure might give birth to rejoicing, so from pleasant feeling he experiences gladness. These are the three gateways to the bliss proclaimed by the Lord who knows and sees.'",
    "dn18:41": "'What do my lords of the Thirty-Three think? How well has the Lord Buddha who knows and sees pointed out the four foundations of mindfulness[n.530] See DN 22 for these.for the attainment of that which is good! What are they? Here a monk abides contemplating the body as body, earnestly, clearly aware, mindful and having put away all hankering and fretting for the world. As he thus dwells contemplating his own body as body, he becomes perfectly concentrated and perfectly serene. Being thus calm and serene, he gains knowledge and vision externally of the bodies of others.[n.531] Or 'physical forms external to himselfʹ (RD).He abides contemplating his own feelings as feelings,… he abides contemplating his own mind as mind, … he abides contemplating his own mind-objects as mind-objects, earnestly, clearly aware, mindful and having put away all hankering and fretting for the world. As he thus dwells contemplating his own mind-objects as mind-objects, he becomes perfectly concentrated and perfectly serene. Being thus calm and serene, he gains knowledge and vision externally of the mind-objects of others. These are the four foundations of mindfulness well pointed out by the Lord Buddha who knows and sees, for the attainment of that which is good.'",
    "dn18:42": "'What do my lords of the Thirty-Three think? How well has the Lord Buddha who knows and sees pointed out the seven requisites of concentration, for the development of perfect concentration and the perfection of concentration! What are they? They are right view, right thought, right speech, right action, right livelihood, right effort, right mindfulness.[n.532] A rare formulation of the factors of the Eightfold Path (see DN 33.2.3 (3)). Elsewhere, such a progressive explanation is denied: this points to a late formulation. See BDic under Magga, and EB under Aṭṭhangika-magga.That one-pointedness of mind that is produced by these seven factors is called the Ariyan right concentration with its bases and requisites. From right view arises right thought, from right thought arises right speech, from right speech arises right action, from right action arises right livelihood, from right livelihood arises right effort, from right effort arises right mindfulness, from right mindfulness arises right concentration, from right concentration arises right knowledge,[n.533] Sammā-ñāṇaṁ.from right knowledge arises right liberation.[n.534] Sammā-vimutti. These additional two steps are part of the supramundane path (MN 117).If anyone truthfully declaring: \"Well-proclaimed by the Lord is the Dhamma, visible here and now, timeless, inviting inspection, leading onward, to be comprehended by the wise each one for himself\", were to say: \"Open are the doors of the Deathless!\"[n.535] DN 14.3.7.he would be speaking in accordance with the highest truth. For indeed, my lords, the Dhamma is well-proclaimed by the Lord, visible here and now, timeless, inviting inspection, leading onward, to be comprehended by the wise, each one for him or herself, and, too, the doors to the Deathless are open!",
    "dn18:43": "\"'Those who have unshakeable faith in the Buddha, the Dhamma and the Saṅgha, and are endowed with the virtues pleasing to the Noble Ones, those beings who have arisen here on account of their Dhamma-training, amounting to more than twenty-four hundred Magadhan followers who have passed over, have by the destruction of three fetters become Stream-Winners, incapable of falling into states of woe and certain of enlightenment, and indeed there are Once-Returners here too.",
    "dn18:44": "But of that other race indeedOf greater merit still, my mindCan make no reckoning at all,For fear that I should speak untruth.'[n.536] These are the Non-Returners, who are presumably so far above Brahmā Sanankumāra that he cannot speak of them with knowledge!",
    "dn18:45": "'\"This was the burden of Brahma Sanankumāra's speech. And in connection with this the Great King Vessavana reflected in his mind: 'It is marvellous, it is wonderful, that such a glorious Teacher should arise, that there should be such a glorious proclamation of Dhamma, and that such glorious paths to the sublime should be made known!' Then Brahmā Sanankumāra, reading King Vessavana's mind, said to him: 'What do you think, King Vessavana? There has been such a glorious Teacher in the past, and such a proclamation, and such paths made known, and there will be again in the future.'\"'",
    "dn18:46": "Such was the burden of what Brahmā Sanankumāra proclaimed to the Thirty-Three Gods. And the Great King Vessavana, having heard and received it in person, related it to his followers.",
    "dn18:47": "And the yakkha Janavasabha, having heard it himself, related it to the Lord. And the Lord, having heard it himself and also come to know it by his own super-knowledge, related it to the Venerable Ananda, who in turn related it to the monks and nuns, the male and female lay-followers."
}