{
    "dn1:1": "Thus have I heard.[n.] Beside the Rhys Davids translation (RD) there is also the somewhat abridged version by Mrs A.A.G. Bennett inLong Discourses of the Buddha(Bombay 964, Suttas -6 only), and that by David Maurice inThe Lion’s Roar(London 962), both of which I have occasionally found useful. I have also consulted the German partial translation (Suttas , 2, 3, 4, 5, 8, 9, , 3, 6, 2, 26, 27) by R.O. Franke (93), and, as far as my limited knowledge of Thai would allow, the Thai translation (2nd ed., Bangkok 252 (978)).Brahma-in the title has the meaning of ‘supreme’.On one occasion the Exalted One was travelling along the highway between Rājagaha and Nālandā[n.2] Nālandā, afterwards the seat of a famous Buddhist university, was about 2 km north of Rajagaha (modem Rajgir), the Magadhan capital.together with a great company of bhikkhus, with about five hundred bhikkhus. At the same time the wanderer Suppiya[n.3] A follower of Sañjaya Belatthaputta (seeDN 2.33f.). Sāriputta and Moggallana, the Buddha's most famous disciples, were originally followers of Sañjaya, and it was their defection, besides the loss of his gains, that angered Suppiya (DA).was also travelling along the highway between Rājagaha and Nālandā together with his pupil, the youth Brahmadatta. Along the way, the wanderer Suppiya spoke in many ways in dispraise of the Buddha, the Dhamma, and the Saṅgha. But his pupil, the youth Brahmadatta, spoke in many ways in praise of the Buddha, the Dhamma, and the Saṅgha. Thus these two, teacher and pupil, followed closely behind the Exalted One and the company of bhikkhus, making assertions in direct contradiction to each other.",
    "dn1:2": "Then the Exalted One together with the company of bhikkhus entered the royal rest-house in the Ambalaṭṭhika garden in order to pass the night. The wanderer Suppiya together with his pupil, the youth Brahmadatta, also entered the royal resthouse in the Ambalaṭṭhika garden in order to pass the night. There, too, the wanderer Suppiya spoke in many ways in dispraise of the Buddha, the Dhamma, and the Saṅgha, while his pupil Brahmadatta spoke in many ways in their praise. Thus these two, teacher and pupil, dwelt together making assertions in direct contradiction to each other.",
    "dn1:3": "When dawn broke a number of bhikkhus, after rising, assembled in the pavilion. As they sat together, the following conversation sprang up among them: \"It is wonderful and marvellous, friends, how the Exalted One, he who knows and sees, the Worthy One, the perfectly enlightened Buddha, has so thoroughly penetrated the diversity in the dispositions of beings. For this wanderer Suppiya spoke in many ways in dispraise of the Buddha, the Dhamma, and the Saṅgha, while his own pupil, the youth Brahmadatta, spoke in many ways in their praise. These two, teacher and pupil, followed closely behind the Exalted One and the company of bhikkhus, making assertions in direct contradiction to each other.\"",
    "dn1:4": "Then the Exalted One, realizing the turn their discussion had taken, entered the pavilion, sat down on the prepared seat, and addressed the bhikkhus: \"What kind of discussion were you holding just now, bhikkhus? What was the subject of your conversation?\"",
    "dn1:5": "\"If, bhikkhus, others speak in dispraise of me, or in dispraise of the Dhamma, or in dispraise of the Saṅgha, you should not give way to resentment, displeasure, or animosity against them in your heart. For if you were to become angry or upset in such a situation, you would only be creating an obstacle for yourselves. If you were to become angry or upset when others speak in dispraise of us, would you be able to recognize whether their statements are rightly or wrongly spoken?\"",
    "dn1:6": "\"If, bhikkhus, others speak in dispraise of me, or in dispraise of the Dhamma, or in dispraise of the Saṅgha, you should unravel what is false and point it out as false, saying: 'For such and such a reason this is false, this is untrue, there is no such thing in us, this is not found among us.[n.14] Lit. 'That is not in us'.",
    "dn1:7": "\"And if, bhikkhus, others speak in praise of me, or in praise of the Dhamma, or in praise of the Saṅgha, you should not give way to jubilation, joy, and exultation in your heart. For if you were to become jubilant, joyful, and exultant in such a situation, you would only be creating an obstacle for yourselves. If others speak in praise of me, or in praise of the Dhamma, or in praise of the Saṅgha, you should acknowledge what is fact as fact, saying: 'For such and such a reason this is a fact, this is true, there is such a thing in us, this is found among us.'",
    "dn1:8": "\"It is, bhikkhus, only to trifling and insignificant matters, to the minor details of mere moral virtue[n.15] DA points out that 'morality is inferior in comparison with higher qualities, for morality does not reach the excellence of concentration, nor concentration the excellence of wisdom.'that a worldling[n.16] An 'ordinary person' who, not having broken through the first three fetters (personality-view, doubt, attachment to rites and rituals), has not yet 'entered the stream' and so started on the higher (supramundane) path.would refer when speaking in praise of the Tathāgata.[n.17] The Buddha’s usual way of referring to himself.And what are those trifling and insignificant matters, those minor details of mere moral virtue, to which he would refer?",
    "dn1:9": "\"'Having abandoned the destruction of life, the recluse Gotama abstains from the destruction of life. He has laid aside the rod and the sword, and dwells conscientious, full of kindness, compassionate for the welfare of all living beings.' It is in this way, bhikkhus, that the worldling[n.1] This 'refrain' is repeated throughout.would speak when speaking in praise of the Tathāgata.",
    "dn1:10": "\"Or he might say: 'Having abandoned taking what is not given, the recluse Gotama abstains from taking what is not given. Accepting and expecting only what is given, he dwells in honesty and rectitude of heart.'",
    "dn1:11": "\"Or he might say: 'Having abandoned unchaste living, the recluse Gotama lives the life of chastity. He dwells remote (from women), and abstains from the vulgar practice of sexual intercourse.[n.20]Brahmacariyāis the supreme or holy life, i.e. celibacy. DA points out that it involves refraining from other forms of erotic behaviour besides intercourse.",
    "dn1:12": "\"Or he might say: 'Having abandoned false speech, the recluse Gotama abstains from falsehood. He speaks only the truth, he lives devoted to truth; trustworthy and reliable, he does not deceive anyone in the world.'",
    "dn1:13": "\"Or he might say: 'Having abandoned slander, the recluse Gotama abstains from slander. He does not repeat elsewhere what he has heard here in order to divide others from the people here, nor does he repeat here what he has heard elsewhere in order to divide these from the people there. Thus he is a reconciler of those who are divided and a promoter of friendships. Rejoicing, delighting, and exulting in concord, he speaks only words that are conducive to concord.'",
    "dn1:14": "\"Or he might say: 'Having abandoned harsh speech, the recluse Gotama abstains from harsh speech. He speaks only such words as are gentle, pleasing to the ear, endearing, going to the heart, urbane, amiable, and agreeable to many people.'",
    "dn1:15": "\"Or he might say: 'Having abandoned idle chatter, the recluse Gotama abstains from idle chatter. He speaks at the right time, speaks what is factual, speaks on the good, on the Dhamma and the Discipline.[n.21]Atthavādī: atthamay also mean 'that which is profitable' (see next note).His words are worth treasuring: they are timely, backed by reason, definite and connected with the good.[n.22]Atthasaṁhhitaṁ:here the meaning ofatthaas 'the profitable' is clear.",
    "dn1:16": "\"Or he might say: 'The recluse Gotama abstains from damaging seed and plant life.",
    "dn1:17": "He eats only in one part of the day, refraining from food at night and from eating at improper times.[n.23] i.e. between midday and the following dawn.",
    "dn1:18": "He abstains from dancing, singing, instrumental music, and witnessing unsuitable shows.",
    "dn1:19": "He abstains from wearing garlands, embellishing himself with scents, and beautifying himself with unguents.",
    "dn1:20": "He abstains from sleeping in high and luxurious beds.",
    "dn1:21": "He abstains from accepting gold and silver.[n.24] Para. 9–20 embrace the first four precepts undertaken by novices (sāmaṇeras). The elaboration of the different forms of wrong speech here (and elsewhere) reflects the importance of controlling the tongue. Curiously, there is no mention of abstaining from intoxicants, but instead a reference to 'damaging seeds and crops'. The next five items correspond to the novices' precepts 6–10.",
    "dn1:22–28": "He abstains from accepting uncooked grain, raw meat, women and girls, male and female slaves, goats and sheep, fowl and swine, elephants, cattle, horses and mares.",
    "dn1:29": "He abstains from accepting fields and lands.[n.25] The Buddha did, however, accept land from Anāthapiṇdika and others for the Saṅgha.",
    "dn1:30": "He abstains from running messages and errands.",
    "dn1:31": "He abstains from buying and selling …",
    "dn1:32": "… and from dealing with false weights, false metals, and false measures.",
    "dn1:33": "He abstains from the crooked ways of bribery, deception, and fraud.",
    "dn1:34": "He abstains from mutilating, executing, imprisoning, robbery, plunder, and violence.' \"It is in this way, bhikkhus, that the worldling would speak when speaking in praise of the Tathāgata.",
    "dn1:35": "\"Or he might say: 'Whereas some honourable recluses and brahmins, while living on food offered by the faithful, continuously cause damage to seed and plant life—to plants propagated from roots, stems, joints, buds, and seeds—the recluse Gotama abstains from damaging seed and plant life.'",
    "dn1:36": "\"Or he might say: 'Whereas some honourable recluses and brahmins, while living on food offered by the faithful, enjoy the use of stored up goods such as stored up food, drinks, garments, vehicles, bedding, scents, and comestibles—the recluse Gotama abstains from the use of stored up goods'",
    "dn1:37": "\"Or he might say: 'Whereas some honourable recluses and brahmins, while living on food offered by the faithful, attend unsuitable shows, such as:",
    "dn1:38": "\"Or he might say: \"Whereas some honourable recluses and brahmins, while living on food offered by the faithful, indulge in the following games that are a basis for negligence:",
    "dn1:39": "\"Or he might say: 'Whereas some recluses and brahmins, while living on food offered by the faithful, enjoy the use of high and luxurious beds and seats, such as:",
    "dn1:40": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, enjoy the use of such devices for embellishing and beautifying themselves as the following: rubbing scented powders into the body, massaging with oils, bathing in perfumed water, kneading the limbs, mirrors, ointments, garlands, scents, unguents, face-powders, make-up, bracelets, head-bands, decorated walking sticks, ornamented medicine-tubes, rapiers, sunshades, embroidered sandals, turbans, diadems, yaktail whisks, and long-fringed white robes—the recluse Gotama abstains from the use of such devices for embellishment and beautification.'",
    "dn1:41": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, engage in frivolous chatter, such as: talk about kings, thieves, and ministers of state; talk about armies, dangers and wars; talk about food, drink, garments, and lodgings; talk about garlands and scents; talk about relatives, vehicles, villages, towns, cities, and countries; talk about women and talk about heroes; street talk and talk by the well; talk about those departed in days gone by; rambling chit-chat; speculations about the world and about the sea; talk about gain and loss—[n.34]Lokakkhāyikaṁ:philosophical speculations of a materialist kind (DA).the recluse Gotama abstains from such frivolous chatter.[n.33]Tiracchāna-kathā:lit. 'animal-talk'. As animals walk parallel to the earth, so this kind of talk does not lead upward (DA).",
    "dn1:42": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, engage in wrangling argumentation,[n.35]Iti-bhavâbhava-kathā:also rendered 'profit and loss', but the philosophical sense (as in the Horner and Ñāṇamoli translations ofMN 76) is preferable.(saying to one another):",
    "dn1:43": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, engage in running messages and errands for kings, ministers of state, khattiyas, brahmins, householders, or youths, (who command them): \"Go here, go there, take this, bring that from there\"—the recluse Gotama abstains from running such messages and errands.'",
    "dn1:44": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, engage in scheming, talking, hinting, belittling others, and pursuing gain with gain—the recluse Gotama abstains from such kinds of scheming and talking.[n.37] For a detailed account of these practices, see VM 1.61–82.",
    "dn1:45": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as:",
    "dn1:46": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as interpreting the significance of the colour, shape, and other features of the following items to determine whether they portend fortune or misfortune for their owners: gems, garments, staffs, swords, spears, arrows, bows, other weapons, women, men, boys, girls, slaves, slave-women, elephants, horses, buffaloes, bulls, cows, goats, rams, fowl, quails, lizards, rabbits,[n.40]Kaṇṇika-lakkhaṇaṁ:fromkaṇṇa'ear'. DA thinks it means either ear-rings or house-gables, both of which are incongruous here. I follow the Thai translation which, probably following an old tradition, hastun'bamboo-rat' (see McFarland,Thai-English Dictionary, p. 371). Franke says 'an animal that is always mentioned with the hare', and considers that it must mean an animal with long ears.tortoises, and other animals—",
    "dn1:47": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as making predictions to the effect that:",
    "dn1:48": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as predicting:",
    "dn1:49": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as predicting:",
    "dn1:50": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as:",
    "dn1:51": "\"Or he might say: 'Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as:",
    "dn1:52": "\"These, bhikkhus, are those trifling and insignificant matters, those minor details of mere moral virtue, that a worldling would refer to when speaking in praise of the Tathāgata.",
    "dn1:53": "\"There are, bhikkhus, other dhammas, deep, difficult to see, difficult to understand, peaceful and sublime, beyond the sphere of reasoning, subtle, comprehensible only to the wise, which the Tathāgata, having realized for himself with direct knowledge, propounds to others; and it is concerning these that those who would rightly praise the Tathāgata in accordance with reality would speak. And what are these dhammas?",
    "dn1:54": "\"There are, bhikkhus, some recluses and brahmins who are speculators about the past, who hold settled views about the past, and who on eighteen grounds assert various conceptual theorems referring to the past. And owing to what, with reference to what, do these honourable recluses and brahmins frame their speculations?",
    "dn1:55": "\"There are, bhikkhus, some recluses and brahmins who are eternalists, and who on four grounds proclaim the self and the world to be eternal. And owing to what, with reference to what, do these honourable recluses and brahmins proclaim their views?",
    "dn1:56": "\"In the first case, bhikkhus, some recluse or a brahmin, by means of ardour, endeavour, application, diligence, and right reflection, attains to such a degree of mental concentration that with his mind thus concentrated, [purified, clarified, unblemished, devoid of corruptions], he recollects his numerous past lives: that is, (he recollects) one birth, two, three, four, or five births; ten, twenty, thirty, forty, or fifty births; a hundred, a thousand, or a hundred thousand births; many hundreds of births, many thousands of births, many hundreds of thousands of births. (He recalls:) 'Then I had such a name, belonged to such a clan, had such an appearance; such was my food, such my experience of pleasure and pain, such my span of life. Passing away thence, I re-arose there. There too I had such a name, belonged to such a clan, had such an appearance; such was my food, such my experience of pleasure and pain, such my span of life. Passing away thence, I re-arose here.' Thus he recollects his numerous past lives in their modes and their details.",
    "dn1:57": "\"He speaks thus: 'The self and the world are eternal, barren, steadfast as a mountain peak,[n.45] I.e., producing nothing new.standing firm like a pillar. And though these beings roam and wander (through the round of existence), pass away and re-arise, yet the self and the world remain the same just like eternity itself. What is the reason? Because I, by means of ardour, endeavour, application, diligence, and right reflection, attain to such a degree of mental concentration that with my mind thus concentrated, I recollect my numerous past lives in their modes and their details. For this reason I know this: the self and the world are eternal, barren, steadfast as a mountain peak, standing firm like a pillar. And though these beings roam and wander (through the round of existence), pass away and re-arise, yet the self and the world remain the same just like eternity itself.'",
    "dn1:58": "\"This, bhikkhus, is the first case.",
    "dn1:59": "\"In the second case, owing to what, with reference to what, are some honourable recluses and brahmins eternalists, who proclaim the self and the world to be eternal?",
    "dn1:60": "\"He speaks thus: 'The self and the world are eternal, barren, steadfast as a mountain peak, standing firm like a pillar. And though these beings roam and wander (through the round of existence), pass away and re-arise, yet the self and the world remain the same just like eternity itself. What is the reason? \"",
    "dn1:61": "\"This, bhikkhus, is the second reason.",
    "dn1:62": "\"In the third case, owing to what, with reference to what, are some honourable recluses and brahmins eternalists, who proclaim the self and the world to be eternal?",
    "dn1:63": "\"He speaks thus: 'The self and the world are eternal, barren, steadfast as a mountain peak, standing firm like a pillar. And though these beings roam and wander (through the round of existence), pass away and re-arise, yet the self and the world remain the same just like eternity itself. What is the reason?",
    "dn1:64": "\"This, bhikkhus, is the third case.",
    "dn1:65": "\"In the fourth case, owing to what, with reference to what, are some honourable recluses and brahmins eternalists, who proclaim the self and the world to be eternal?",
    "dn1:66": "\"It is on these four grounds, bhikkhus, that those recluses and brahmins who are eternalists proclaim the self and the world to be eternal. Whatever recluses and brahmins there may be who proclaim the self and the world to be eternal, all of them do so on these four grounds or on a certain one of them. Outside of these there is none.",
    "dn1:67": "\"This, bhikkhus, the Tathāgata understands. And he understands: 'These standpoints, thus assumed and thus misapprehended, lead to such a future destination, to such a state in the world beyond.' He understands as well what transcends this, yet even that understanding he does not misapprehend. And because he is free from misapprehension, he has realized within himself the state of perfect peace. Having understood as they really are the origin and the passing away of feelings, their satisfaction, their unsatisfactoriness, and the escape from them, the Tathāgata, bhikkhus, is emancipated through non-clinging.",
    "dn1:68": "\"These are those dhammas, bhikkhus, that are deep, difficult to see, difficult to understand, peaceful and sublime, beyond the sphere of reasoning, subtle, comprehensible only to the wise, which the Tathāgata, having realized for himself with direct knowledge, propounds to others; and it is concerning these that those who would rightly praise the Tathāgata in accordance with reality would speak.",
    "dn1:69": "\"There are, bhikkhus, some recluses and brahmins who are eternalists in regard to some things and non-eternalists in regard to other things, and who on four grounds proclaim the self and the world to be partly eternal and partly non-eternal. And owing to what, with reference to what, do these honourable recluses and brahmins proclaim their views?",
    "dn1:70": "\"There comes a time, bhikkhus, when after the lapse of a long period this world contracts (disintegrates). While the world is contracting, beings for the most part are reborn in the Ābhassara Brahma-world.[n.47] This is part of the world of Form (rūpaloka) which escapes destruction.There they dwell, mind-made, feeding on rapture, self-luminous, moving through the air, abiding in glory. And they continue thus for a long, long period of time.",
    "dn1:71": "\"But sooner or later, bhikkhus, after the lapse of a long period, there comes a time when this world begins to expand once again. While the world is expanding, an empty palace of Brahmā appears. Then a certain being, due to the exhaustion of his life-span or the exhaustion of his merit,[n.48] The life-span of beings is fixed in some realms, and variable in others. Merit (puñña) is karmically wholesome action, leading to a favourable rebirth.passes away from the Ābhassara plane and re-arises in the empty palace of Brahmā. There he dwells, mind made, feeding on rapture, self-luminous, moving through the air, abiding in glory. And he continues thus for a long, long period of time.",
    "dn1:72": "\"Then, as a result of dwelling there all alone for so long a time, there arises in him dissatisfaction and agitation, (and he yearns): 'Oh, that other beings might come to this place!' Just at that moment, due to the exhaustion of their life-span or the exhaustion of their merit, certain other beings pass away from the Ābhassara plane and re-arise in the palace of Brahmā, in companionship with him. There they dwell, mind-made,[n.49]Manomayā:mentally created, not sexually generated. They are devas. In another sense, alldhammasare said to be mind-made (Dhp. 1–2).feeding on rapture,[n.50]self-luminous, moving through the air, abiding in glory. And they continue thus for a long, long period of time.",
    "dn1:73": "\"Thereupon the being who re-arose there first thinks to himself: 'I am[n.51] Brahmā is allotted a relatively humble position, and his creator-role explained away, in Buddhism. See alsoMN 49.8(= MLS i, 391).the Great Brahmā, the Vanquisher, the Unvanquished, the Universal Seer, the Wielder of Power, the Lord, the Maker and Creator, the Supreme Being, the Ordainer, the Almighty, the Father of all that are and are to be. And these beings have been created by me. What is the reason? Because first I made the wish: \"Oh, that other beings might come to this place!\" And after I made this resolution, now these beings have come.'",
    "dn1:74": "\"And the beings who re-arose there after him also think: 'This must be Brahmā, the Great Brahmā, the Vanquisher, the Unvanquished, the Universal Seer, the Wielder of Power, the Lord, the Maker and Creator, the Supreme Being, the Ordainer, the Almighty, the Father of all that are and are to be. And we have been created by him. What is the reason? Because we see that he was here first, and we appeared here after him.'",
    "dn1:75": "\"Herein, bhikkhus, the being who re-arose there first possesses longer life, greater beauty, and greater authority than the beings who re-arose there after him.",
    "dn1:76": "\"Now, bhikkhus, this comes to pass, that a certain being, after passing away from that plane, takes rebirth in this world. Having come to this world, he goes forth from home to homelessness. When he has gone forth, by means of ardour, endeavour, application, diligence, and right reflection, he attains to such a degree of mental concentration that with his mind thus concentrated he recollects his immediately preceding life, but none previous to that.",
    "dn1:77": "He speaks thus: 'We were created by him, by Brahmā, the Great Brahmā, the Vanquisher, the Unvanquished, the Universal Seer, the Wielder of Power, the Lord, the Maker and Creator, the Supreme Being, the Ordainer, the Almighty, the Father of all that are and are to be. He is permanent, stable, eternal, not subject to change, and he will remain the same just like eternity itself. But we, who have been created by him and have come to this world, are impermanent, unstable, short-lived, doomed to perish.'",
    "dn1:78": "\"In the second case, owing to what, with reference to what, are some honourable recluses and brahmins eternalists in regard to some things and non-eternalists in regard to other things, proclaiming the self and the world to be partly eternal and partly non-eternal?",
    "dn1:79": "\"Now, bhikkhus, this comes to pass, that a certain being, after passing away from that plane, takes rebirth in this world. Having come to this world, he goes forth from home to homelessness. When he has gone forth, by means of ardour, endeavour, application, diligence, and right reflection, he attains to such a degree of mental concentration that with his mind thus concentrated he recollects his immediately preceding life, but none previous to that.",
    "dn1:80": "He speaks thus: 'Those honourable gods who are not corrupted by play do not spend an excessive time indulging in the delights of laughter and play. As a consequence they do not become forgetful, and because they do not become forgetful they do not pass away from that plane. Those gods are permanent, stable, eternal, not subject to change, and they will remain the same just like eternity itself. But we were gods corrupted by play. We spent an excessive time indulging in the delights of laughter and play, and as a consequence we became forgetful. When we became forgetful we passed away from that plane. Coming to this world, now we are impermanent, unstable, short lived, doomed to perish.'",
    "dn1:81": "\"In the third case, owing to what, with reference to what, are some honourable recluses and brahmins eternalists in regard to some things and non-eternalists in regard to other things, proclaiming the self and the world to be partly eternal and partly non-eternal?",
    "dn1:82": "\"Now, bhikkhus, this comes to pass, that a certain being, after passing away from that plane, takes rebirth in this world. Having come to this world, he goes forth from home to homelessness. When he has gone forth, by means of ardour, endeavour, application, diligence, and right reflection, he attains to such a degree of mental concentration that with his mind thus concentrated he recollects his immediately preceding life, but none previous to that.",
    "dn1:83": "He speaks thus: 'Those honourable gods who are not corrupted by mind do not contemplate each other with excessive envy. As a result, their minds do not become corrupted by anger towards one another, their bodies and minds do not become exhausted, and they do not pass away from that plane. Those gods are permanent, stable, not subject to change, and they will remain the same just like eternity itself. But we were gods corrupted by mind. We contemplated each other with excessive envy and as a result our minds became corrupted by anger towards one another. When our minds were corrupted by anger, our bodies and minds became exhausted and consequently, we passed away from that plane. Coming to this world, now we are impermanent, unstable, short-lived, doomed to perish.'",
    "dn1:84": "\"In the fourth case, owing to what, with reference to what, are some honourable recluses and brahmins eternalists in regard to some things and non-eternalists in regard to other things, proclaiming the self and the world to be partly eternal and partly non-eternal?",
    "dn1:85": "\"It is on these four grounds, bhikkhus, that those recluses and brahmins who are partial-eternalists proclaim the self and the world to be partly eternal and partly non-eternal. Whatever recluses and brahmins there may be who proclaim the self and the world to be partly eternal and partly non-eternal, all of them do so on these four grounds or on a certain one of them. Outside of these there is none.",
    "dn1:86": "\"This, bhikkhus, the Tathāgata understands. And he understands: 'These standpoints, thus assumed and thus misapprehended, lead to such a future destination, to such a state in the world beyond.' He understands as well what transcends this, yet even that understanding he does not misapprehend. And because he is free from misapprehension, he has realized within himself the state of perfect peace. Having understood as they really are the origin and the passing away of feelings, their satisfaction, their unsatisfactoriness, and the escape from them, the Tathāgata, bhikkhus, is emancipated through non-clinging.",
    "dn1:87": "\"These are those dhammas, bhikkhus, that are deep, difficult to see, difficult to understand, peaceful and sublime, beyond the sphere of reasoning, subtle, comprehensible only to the wise, which the Tathāgata, having realized for himself with direct knowledge, propounds to others; and it is concerning these that those who would rightly praise the Tathāgata in accordance with reality would speak.",
    "dn1:88": "\"There are, bhikkhus, some recluses and brahmins who are extensionists,[n.56]Antânantikā:or 'Extensionists' (RD).and who on four grounds proclaim the world to be finite or infinite. And owing to what, with reference to what, do these honourable recluses and brahmins proclaim their views?",
    "dn1:89": "\"In the first case, bhikkhus, a certain recluse or a brahmin, by means of ardour, endeavour, application, diligence, and right reflection, attains to such a degree of mental concentration that with his mind thus concentrated he abides perceiving the world as finite.",
    "dn1:90": "He speaks thus: 'The world is finite and bounded. What is the reason? Because I attain to such concentration of mind that I abide perceiving the world as finite. For that reason I know this: the world is finite and bounded.'",
    "dn1:91": "\"In the second case, owing to what, with reference to what, are some honourable recluses and brahmins extensionists, proclaiming the world to be finite or infinite?",
    "dn1:92": "He speaks thus: 'The world is infinite and boundless. Those recluses and brahmins who declare the world to be finite and bounded speak falsely. The world is infinite and boundless. What is the reason? Because I attain to such concentration of mind that I abide perceiving the world as infinite. For this reason I know this: the world is infinite and boundless.'",
    "dn1:93": "\"In the third case, owing to what, with reference to what, are some honourable recluses and brahmins extensionists, proclaiming the world to be finite or infinite?",
    "dn1:94": "He speaks thus: 'The world is both finite and infinite. Those recluses and brahmins who declare the world to be finite and bounded speak falsely; and those recluses and brahmins who declare the world to be infinite and boundless also speak falsely. The world is both finite and infinite. For what reason? Because I attain to such concentration of mind that I abide perceiving the world as finite in the upward and downward directions, but as infinite across. For this reason I know this: the world is both finite and infinite.'",
    "dn1:95": "\"In the fourth case, owing to what, with reference to what, are some honourable recluses and brahmins extensionists, proclaiming the world to be finite or infinite?",
    "dn1:96": "\"It is on these four grounds, bhikkhus, that those recluses and brahmins, who are extensionists proclaim the world to be finite of infinite. Whatever recluses or brahmins there may be who proclaim the world to be finite or infinite, all of them do so on these four grounds or on a certain one of them. Outside of these there is none.",
    "dn1:99": "\"There are, bhikkhus, some recluses and brahmins who are endless equivocators.[n.58]Amarā-vikheppikācan be interpreted as either 'eel-wriggling' (RD) or 'endless equivocation' (BB):amarā(lit. 'deathless') is the name of a slippery fish, perhaps an eel, which escapes capture by wriggling (DA). A deliberate pun may well be intended.When questioned about this or that point, on four grounds they resort to evasive statements and to endless equivocation. And owing to what, with reference to what, do these honourable recluses and brahmins do so?",
    "dn1:100": "\"Herein, bhikkhus, a certain recluse or a brahmin does not understand as it really is what is wholesome and what is unwholesome. He thinks: 'I do not understand as it really is what is wholesome and what is unwholesome. If, without understanding, I were to declare something to be wholesome or unwholesome, my declaration might be false. If my declaration should be false, that would distress me, and that distress would be an obstacle for me.[n.59] Either for the higher training or for a heavenly rebirth (DA). Cf. verse 5, where the former is certainly meant.Therefore, out of fear and loathing of making a false statement,[n.60] Due to moral shame and moral dread (hiri-ottappa) (DA), i.e. shame at doing what is wrong, and dread of it. These two qualities are called 'guardians of the world' (cf. Nyānaponika Thera,Abhidhamma Studies, 2nd. ed., Colombo 1965, p. 80). Thus it is recognised that the first three classes of 'eel-wrigglers' have a moral conscience. Their equivocation stems from lack of understanding, not of scruple.he does not declare anything to be wholesome or unwholesome. But when he is questioned about this or that point, he resorts to evasive statements and to endless equivocation: \"I do not take it thus, nor do I take it in that way, nor do I take it in some other way. I do not say that it is not, nor do I say that it is neither this nor that.'",
    "dn1:101": "\"In the second case, owing to what, with reference to what, are some honourable recluses and brahmins endless equivocators, resorting to evasive statements and to endless equivocation?",
    "dn1:102": "\"In the third case, owing to what, with reference to what, are some honourable recluses and brahmins endless equivocators, resorting to evasive statements and to endless equivocation?",
    "dn1:103": "\"In the fourth case, owing to what, with reference to what, are some honourable recluses and brahmins endless equivocators, resorting to evasive statements and to endless equivocation?",
    "dn1:104": "\"It is on these four grounds, bhikkhus, that those recluses and brahmins who are endless equivocators resort to evasive statements and to endless equivocation when questioned about this or that point. Whatever recluses or brahmins there may be who resort to evasive statements and to endless equivocation, all of them do so on these four grounds or on a certain one of them. Outside of these there is none.",
    "dn1:105": "\"There are, bhikkhus, some recluses and brahmins, who are fortuitous originationists, and who on two grounds proclaim the self and the world to originate fortuitously. And owing to what, with reference to what, do these honourable recluses and brahmins proclaim their views?",
    "dn1:106": "\"There are, bhikkhus, certain gods called 'non-percipient beings.'[n.64] Having attained a high absorption, and fearing the perils of conscious existence, they have wished for, and gained, an unconscious state. With the first stirring of perception, however, they fall away from that realm (DA).When perception arises in them, those gods pass away from that plane. Now, bhikkhus, this comes to pass, that a certain being, after passing away from that plane, takes rebirth in this world. Having come to this world, he goes forth from home to homelessness. When he has gone forth, by means of ardour, endeavour, application, diligence, and right reflection, he attains to such a degree of mental concentration that with his mind thus concentrated he recollects the arising of perception, but nothing previous to that. He speaks thus: 'The self and the world originate fortuitously. What is the reason? Because previously I did not exist, but now I am. Not having been, I sprang into being.'",
    "dn1:107": "\"In the second case, owing to what, with reference to what, are some honourable recluses and brahmins fortuitous originationists, proclaiming the self and the world to originate fortuitously?",
    "dn1:108": "\"It is on these two grounds, bhikkhus, that those recluses and brahmins who are fortuitous originationists proclaim the self and the world to originate fortuitously. Whatever recluses or brahmins there may be who proclaim the self and the world to originate fortuitously, all of them do so on these two grounds or on a certain one of them. Outside of these there is none.",
    "dn1:109": "\"It is on these eighteen grounds, bhikkhus, that those recluses and brahmins who are speculators about the past and hold settled views about the past assert various conceptual theorems referring to the past. Whatever recluses or brahmins are speculators about the past, hold settled views about the past, and assert various conceptual theorems referring to the past, all of them do so on these eighteen grounds or on a certain one of them. Outside of these there is none.",
    "dn1:110": "\"This, bhikkhus, the Tathāgata understands. And he understands: 'These standpoints, thus assumed and thus misapprehended, lead to such a future destination, to such in the world beyond.' He understands as well what transcends this, yet even that understanding he does not misapprehend. And because he is free from misapprehension, he has realized within himself the state of perfect peace. Having understood as they really are the origin and the passing away of feelings, their satisfaction, their unsatisfactoriness, and the escape from them, the Tathāgata, bhikkhus, is emancipated through non-clinging.",
    "dn1:111": "\"These are those dhammas, bhikkhus, that are deep, difficult to see, difficult to understand, peaceful and sublime, beyond the sphere of reasoning, subtle, comprehensible only to the wise, which the Tathāgata, having realized for himself with direct knowledge, propounds to others; and it is concerning these that those who would rightly praise the Tathāgata in accordance with reality would speak.",
    "dn1:112": "\"There are, bhikkhus, some recluses and brahmins who are speculators about the future, who hold settled views about the future, and who on forty-four grounds assert various conceptual theorems referring to the future. And owing to what, with reference to what, do these honourable recluses and brahmins frame their speculations?",
    "dn1:113": "\"There are, bhikkhus, some recluses and brahmins who maintain a doctrine of percipient immortality and who on sixteen grounds proclaim the self to survive percipient after death. And owing to what, with reference to what, do these honourable recluses and brahmins proclaim their views?",
    "dn1:114–129": "\"They proclaim: 'The self is immutable after death, percipient, and:",
    "dn1:130": "\"It is on these sixteen grounds, bhikkhus, that those recluses and brahmins who maintain a doctrine of percipient immortality proclaim the self to survive percipient after death. Whatever recluses or brahmins maintain a doctrine of percipient immortality, all of them do so on these sixteen grounds or on a certain one of them. Outside of these there is none.",
    "dn1:131": "\"There are, bhikkhus, some recluses and brahmins who maintain a doctrine of non-percipient immortality, and who on eight grounds proclaim the self to survive non-percipient after death. And owing to what, with reference to what, do these honourable recluses and brahmins proclaim their views?",
    "dn1:132–139": "\"They proclaim: 'The self is immutable after death, non-percipient, and:",
    "dn1:140": "\"It is on these eight grounds, bhikkhus, that those recluses and brahmins who maintain a doctrine of non-percipient immortality proclaim the self to survive non-percipient after death. Whatever recluses or brahmins maintain a doctrine of non—percipient immortality, all of them do so on these eight grounds or on a certain one of them. Outside of these there is none.",
    "dn1:141": "\"There are, bhikkhus, some recluses and brahmins who maintain a doctrine of neither percipient nor non-percipient immortality and who on eight grounds proclaim the self to survive neither percipient nor non-percipient after death. And owing to what, with reference to what, do these honourable recluses and brahmins proclaim their views?",
    "dn1:142–149": "\"They proclaim: 'The self is immutable after death, neither percipient nor non-percipient, and:",
    "dn1:150": "\"It is on these eight grounds, bhikkhus, that those recluses and brahmins who maintain a doctrine of neither percipient nor non-percipient immortality proclaim the self to survive neither percipient nor non-percipient after death. Whatever recluses or brahmins maintain a doctrine of neither percipient nor non-percipient immortality, all of them do so on these eight grounds or on a certain one of them. Outside of these there is none.",
    "dn1:151": "\"There are, bhikkhus, some recluses and brahmins who are annihilationists and who on seven grounds proclaim the annihilation, destruction, and extermination of an existent being. And owing to what, with reference to what, do these honourable recluses and brahmins proclaim their views?",
    "dn1:152": "\"Herein, bhikkhus, a certain recluse or a brahmin asserts the following doctrine and view: 'The self, good sir, has material form; it is composed of the four primary elements[n.70] 'Earth' (paṭhavī) or extension, 'water' (āpo) or cohesion, 'fire' (tejo) or temperature, 'air' (vāyo) or motion: the traditional names for the four qualities present, in varying proportions, in all matter.and originates from father and mother.[n.69] In the Buddhist view, there is additionally required the presence of thegandhabbaor 'being-to-be-born', i.e. the arising of a new 'continuity of consciousness' dependent on that of some being just deceased. Cf.MN 38.1–7.Since this self, good sir, is annihilated and destroyed with the breakup of the body and does not exist after death, at this point the self is completely annihilated.' In this way some proclaim the annihilation, destruction, and extermination of an existent being.",
    "dn1:153": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self is completely annihilated. For there is, good sir, another self—divine,[n.71]Kāmâvacara:belonging to the sensuous sphere (kāmaloka), the lowest of the three worlds.feeding on edible nutriment.[n.72]Kabalinkārâhāragenerally means 'material food'. Here it denotes the kind of nutriment on which the lower devas subsist.That you neither know nor see, but I know it and see it. Sincethisself, good sir, is annihilated and destroyed with the breakup of the body and does not exist after death, at this point the self is completely annihilated.' In this way others proclaim the annihilation, destruction, and extermination of an existent being.",
    "dn1:154": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self is completely annihilated. For there is, good sir, another self—divine, having material form, mind-made,[n.73] 'Produced by thejhāna-mind'(DA).complete in all its limbs and organs, not destitute of any faculties. That you neither know nor see, but I know it and see it. Sincethisself, good sir, is annihilated and destroyed with the breakup of the body and does not exist after death, at this point the self is completely annihilated.' In this way others proclaim the annihilation, destruction, and extermination of an existent being.",
    "dn1:155": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self is completely annihilated. For there is, good sir, another self belonging to the base of infinite space,[n.74] The next four correspond to the 4th–7th 'liberations' (DN 15.49) or the four higher, 'formless' jhanas.(reached by) the complete surmounting of perceptions of material form, by the disappearance of perceptions of resistance, by non-attention to perceptions of diversity, (by contemplating) \"Space is infinite.\" That you neither know nor see, but I know it and see it. Sincethisself, good sir, is annihilated and destroyed with the breakup of the body and does not exist after death, at this point the self is completely annihilated.'[n.75] DA says this one takes the divine form (dibb'atthabhāva),i.e. the form of the devas of the sensuous sphere, for the self. The assumption is that this survives the break-up of the physical body for a period of time (of unspecified duration), 'annihilation' occurring at its cessation, and similarly with the remaining 'selves'. As BB points out (p. 32), 'Only the first form of annihilationism is materialistic; six admit that the doctrine can take on a spiritual garb.'In this way others proclaim the annihilation, destruction, and extermination of an existent being.",
    "dn1:156": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self is completely annihilated. For there is, good sir, another self belonging to the base of infinite consciousness, (reached by) completely surmounting the base of infinite space (by contemplating): \"Consciousness is infinite.\" That you neither know nor see. But I know it and see it. Sincethisself, good sir, is annihilated and destroyed with the breakup of the body and does not exist after death—at this point the self is completely annihilated.' In this way some proclaim the annihilation, destruction, and extermination of an existent being.",
    "dn1:157": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self is completely annihilated. For there is, good sir, another self belonging to the base of nothingness, (reached by) completely surmounting the base of infinite consciousness (by contemplating): \"There is nothing.\" That you neither know nor see. But I know it and see it. Sincethisself, good sir, is annihilated and destroyed with the breakup of the body and does not exist after death—at this point the self is completely annihilated.' In this way some proclaim the annihilation, destruction, and extermination of an existent being.",
    "dn1:158": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self is completely annihilated. For there is, good sir, another self belonging to the base of neither perception nor non-perception, (reached by) completely surmounting the base of nothingness (by contemplating): \"This is the peaceful, this is the sublime.\" That you neither know nor see. But I know it and see it. Sincethisself, good sir, is annihilated and destroyed with the breakup of the body and does not exist after death—at this point the self is completely annihilated.' In this way some proclaim the annihilation, destruction, and extermination of an existent being.",
    "dn1:159": "\"It is on these seven grounds, bhikkhus, that those recluses and brahmins who are annihilationists proclaim the annihilation, destruction, and extermination of an existent being. Whatever recluses or brahmins proclaim the annihilation, destruction, and extermination of an existent being, all of them do so on these seven grounds or on a certain one of them. Outside of these there is none.",
    "dn1:160": "\"There are, bhikkhus, some recluses and brahmins who maintain a doctrine of Nibbāna here and now and who, on five grounds, proclaim Nibbāna here and now[n.76] This is not, of course, the real Nibbāna of Buddhism. DA says it means the subsiding of suffering (dukkhavūpasama) in this very individual form (subsiding being something far short of cessation). The New Sub-Commentary (quoted by BB, p. 197) adds: 'It is not the supreme fruit and not the unconditioned element (asaṅkhata-dhātu=nibbāna),for these are beyond the domain of these theorists.'for an existent being. And owing to what, with reference to what, do these honourable recluses and brahmins proclaim their views?",
    "dn1:161": "\"Herein, bhikkhus, a certain recluse or a brahmin asserts the following doctrine or view: 'When this self, good sir, furnished and supplied with the five strands of sense pleasures, revels in them—at this point the self attains supreme Nibbāna here and now.' In this way some proclaim supreme Nibbāna here and now for an existent being.",
    "dn1:162": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self attains supreme Nibbāna here and now. What is the reason? Because, good sir, sense pleasures are impermanent, suffering, subject to change, and through their change and transformation there arise sorrow, lamentation, pain, grief, and despair. But when the self, quite secluded from sense pleasures, secluded from unwholesome states, enters and abides in the first jhāna,[n.77] The various jhānas are mistaken for Nibbāna.which is accompanied by initial and sustained thought[n.78]Vitakka-vicāra:otherwise rendered 'initial and sustained thought', and the like. I am indebted to L.S. Cousins for the suggestion that I should adopt the Ven. Ñāṇamoli's original rendering 'thinking and pondering' (altered by the editor) in his MN translation (forthcoming). Cf.n.611.and contains the rapture[n.79]Pīti:a difficult word to translate. Renderings vary from 'interest' through 'zest' to 'rapture'. It is classified not as a feeling (vedanā) but as part of the group of mental formations (saṅkhārā),i.e. as a mental reaction. BDic says: 'It may be described psychologically as \"joyful interest\"' — for which the simplest term would seem to be 'delight'.and happiness[n.80]Sukha: pleasant feeling, physical or mental (though for the latter the wordsomanassaexists). The difference between this andpītimay seem subtle but is important.born of seclusion—at this point, good sir, the self attains supreme Nibbāna here and now.' In this way others proclaim supreme Nibbāna here and now for an existent being.",
    "dn1:163": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self attains supreme Nibbāna here and now. What is the reason? Because that jhāna contains initial and sustained thought; therefore it is declared to be gross. But when, with the subsiding of initial and sustained thought, the self enters and abides in the second jhāna, which is accompanied by internal confidence and unification of mind, is free from initial and sustained thought, and contains the rapture and happiness born of concentration[n.81]Samādhihere has its basic meaning of 'concentration'.—at this point, good sir, the self attains supreme Nibbāna here and now.' In this way others proclaim supreme Nibbāna here and now for an existent being.",
    "dn1:164": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self attains supreme Nibbāna here and now. What is the reason? It is declared to be gross because of the mental exhilaration connected with rapture that exists there. But when, with the fading away of rapture, one abides in equanimity, mindful and clearly comprehending, and still experiencing happiness with the body, enters and abides in the third jhāna, so that the ariyans announce: \"He abides happily, in equanimity and mindfulness\"—at this point, good sir, the self attains supreme Nibbāna here and now.' In this way some proclaim supreme Nibbāna here and now for an existent being.",
    "dn1:165": "\"To him another says: 'There is, good sir, such a self as you assert. That I do not deny. But it is not at that point that the self attains supreme Nibbāna here and now. What is the reason? It is declared to be gross because a mental concern, 'Happiness,' exists there. But when, with the abandoning of pleasure and pain, and with the disappearance of previous joy and grief, one enters and abides in the fourth jhāna, which is without pleasure and pain and contains purification of mindfulness[n.82]Sampajāna:not 'self-possessed' as so many translators have repeated after RD.through equanimity—[n.83]Upekkhaka.at this point, good sir, the self attains supreme Nibbāna here and now.' In this way some proclaim supreme Nibbāna here and now for an existent being.",
    "dn1:166": "\"It is on these five grounds, bhikkhus, that these recluses and brahmins who maintain a doctrine of Nibbāna here and now proclaim supreme Nibbāna here and now for an existent being. Whatever recluses or brahmins proclaim supreme Nibbāna here and now for an existent being, all of them do so on these five grounds or on a certain one of them. Outside of these there is none.",
    "dn1:167": "\"It is on these forty-four grounds, bhikkhus, that those recluses and brahmins who are speculators about the future and hold settled views about the future assert various conceptual theorems referring to the future. Whatever recluses or brahmins, bhikkhus, are speculators about the future, hold settled views about the future, and assert various conceptual theorems referring to the future, all of them do so on these forty-four grounds or on a certain one of them. Outside of these there is none.",
    "dn1:168": "\"It is on these sixty-two grounds, bhikkhus, that those recluses and brahmins who are speculators about the past, speculators about the future, and speculators about the past and the future together, who hold settled views about the past and the future, assert various conceptual theorems referring to the past and the future.",
    "dn1:169": "\"Whatever recluses or brahmins, bhikkhus, are speculators about the past or speculators about the future or speculators about the past and the future together, hold settled views about the past and the future, and assert various conceptual theorems referring to the past and the future, all of them do so on these sixty-two grounds or on a certain one of them. Outside of these there is none.",
    "dn1:170": "\"This, bhikkhus, the Tathāgata understands. And he understands: 'These standpoints, thus assumed and thus misapprehended, lead to such a future destination, to such a state in the world beyond.' He understands as well what transcends this, yet even that understanding he does not misapprehend. And because he is free from misapprehension, he has realized within himself the state of perfect peace. Having understood as they really are the origin and the passing away of feelings, their satisfaction, their unsatisfactoriness, and the escape from them, the Tathāgata, bhikkhus, is emancipated through non-clinging.",
    "dn1:171": "\"These are those dhammas, bhikkhus, that are deep, difficult to see, difficult to understand, peaceful and sublime, beyond the sphere of reasoning, subtle, comprehensible only to the wise, which the Tathāgata, having realized for himself with direct knowledge, propounds to others; and it is concerning these that those who would rightly praise the Tathāgata in accordance with reality would speak.",
    "dn1:172": "Therein, bhikkhus, when those recluses and brahmins who are eternalists proclaim on four grounds the self and the world to be eternal—that is only the feeling of those who do not know and do not see; that is only the agitation and vacillation of those who are immersed in craving.",
    "dn1:173": "\"When those recluses and brahmins who are eternalists in regard to some things and non-eternalists in regard to other things proclaim on four grounds the self and the world to be partly eternal and partly non-eternal—that too is only the feeling of those who do not know and do not see; that is only the agitation and vacillation of those who are immersed in craving.",
    "dn1:174": "\"When those recluses and brahmins who are extensionists proclaim on four grounds the world to be finite or infinite:",
    "dn1:175": "\"When those recluses and brahmins who are endless equivocators on four grounds resort to evasive statements and endless equivocation when questioned on this or that point:",
    "dn1:176": "\"When those recluses and brahmins who are fortuitous originationists proclaim on two grounds the self and the world to originate fortuitously:",
    "dn1:177": "\"When those recluses and brahmins who are speculators about the past and hold settled views about the past assert on eighteen grounds various conceptual theorems referring to the past:",
    "dn1:178": "\"When those recluses and brahmins who maintain a doctrine of percipient immortality proclaim on sixteen grounds the self to survive percipient after death:",
    "dn1:179": "\"When those recluses and brahmins who maintain a doctrine of non-percipient immortality proclaim on eight grounds the self to survive non-percipient after death:",
    "dn1:180": "\"When those recluses and brahmins who maintain a doctrine of neither percipient nor non-percipient immortality proclaim on eight grounds the self to survive neither percipient nor non-percipient after death:",
    "dn1:181": "\"When those recluses and brahmins who are annihilationists proclaim on seven grounds the annihilation, destruction, and extermination of an existent being:",
    "dn1:182": "\"When those recluses and brahmins who maintain a doctrine of Nibbāna here and now proclaim on five grounds supreme Nibbāna here and now for an existent being:",
    "dn1:183": "\"When those recluses and brahmins who are speculators about the future and hold settled views about the future assert on forty-four grounds various conceptual theorems referring to the future:",
    "dn1:184": "\"When those recluses and brahmins who are speculators about the past, speculators about the future, speculators about the past and the future together, who hold settled views about the past and the future, assert on sixty-two grounds various conceptual theorems referring to the past and the future—that too is only the feeling of those who do not know and do not see; that is only the agitation and vacillation of those who are immersed in craving.",
    "dn1:185": "\"Therein, bhikkhus, when those recluses who are eternalists proclaim on four grounds the self and the world to be eternal—that is conditioned by contact.[n.84]Phassais the 'contact' between sense-base and its object, e.g. eye and visible object. Such contact is the basis of feeling (vedanā)That they can experience that feeling without contact—such a case is impossible.",
    "dn1:186": "\"When those recluses and brahmins who are eternalists in regard to some things and non-eternalists in regard to other things proclaim on four grounds the self and the world to be partly eternal and partly non-eternal—that too is conditioned by contact. That they can experience that feeling without contact—such a case is impossible.",
    "dn1:187–196": "\"When those recluses and brahmins who are extensionists proclaim their views; when those who are fortuitous originationists proclaim their views; when those who are speculators about the past and hold settled views about the past assert on eighteen grounds various conceptual theorems referring to the past; when those who maintain a doctrine of percipient immortality, non-percipient immortality, or neither percipient nor non-percipient immortality proclaim their views; when those who are annihilationists proclaim their views; when those who maintain a doctrine of Nibbāna here and now proclaim their views; when those who are speculators about the future and hold settled views about the future assert on forty-four grounds various conceptual theorems referring to the future—that too is conditioned by contact. That they can experience that feeling without contact—such a case is impossible.",
    "dn1:197": "\"When those recluses and brahmins who are speculators about the past, speculators about the future, speculators about the past and the future together, who hold settled views about the past and the future, assert on sixty-two grounds various conceptual theorems referring to the past and the future—that too is conditioned by contact. That they can experience that feeling without contact—such a case is impossible.",
    "dn1:198–210": "Now, when those ascetics and brahmins theorize about the past and the future on these sixty-two grounds, all of them experience this by repeated contact through the six fields of contact. Their feeling is a condition for craving. Craving is a condition for grasping. Grasping is a condition for continued existence. Continued existence is a condition for rebirth. Rebirth is a condition for old age and death, sorrow, lamentation, pain, sadness, and distress to come to be.",
    "dn1:211": "\"Therein, bhikkhus, those recluses and brahmins who are eternalists and proclaim on four grounds the self and the world to be eternal; and those who are eternalists in regard to some things and non-eternalists in regard to others; and those who are extensionists; and those who are endless equivocators; and those who are fortuitous originationists; and those who are speculators about the past; and those who maintain a doctrine of percipient immortality; and those who maintain a doctrine of non-percipient immortality; and those who maintain a doctrine of neither percipient nor non-percipient immortality; and those who are annihilationists; and those who maintain a doctrine of Nibbāna here and now; and those who are speculators about the future; and those who are speculators about the past, speculators about the future, speculators about the past and the future together, hold settled views about the past and the future and assert on sixty-two grounds various conceptual theorems referring to the past and the future—all these recluses and brahmins experience these feelings only by repeated contacts through the six bases of contact.[n.85] Eye, ear, nose, tongue, body as base of the tactile sense, and mind (which is always the sixth sense in Buddhism).With feeling as condition, there arises in them craving; with craving as condition, clinging arises; with clinging as condition, existence; with existence as condition, birth; and with birth as condition, ageing and death, sorrow, lamentation, pain, grief, and despair arise.[n.86] This is the first, partial, exposition of dependent origination (paṭicca-samuppāda) in the Canon. SeeDN14andDN15.",
    "dn1:212": "\"When, bhikkhus, a bhikkhu understands as they really are the origin and passing away of the six bases of contact, their satisfaction, unsatisfactoriness, and the escape from them, then he understands what transcends all these views.",
    "dn1:213": "\"Whatever recluses or brahmins, bhikkhus, are speculators about the past, speculators about the future, speculators about the past and the future together, hold settled views about the past and the future and assert various conceptual theorems referring to the past and the future—all are trapped in this net with its sixty-two divisions. Whenever they emerge, they emerge caught within this net, trapped and contained within this very net.",
    "dn1:214": "\"Just as, bhikkhus, a skillful fisherman or a fisherman's apprentice, after spreading a fine-meshed net over a small pool of water, might think: 'Whatever sizeable creatures there are in this pool, all are trapped within this net, trapped and contained in this very net'—in the same way, all those recluses and brahmins are trapped in this net with its sixty-two divisions. Whenever they emerge, they emerge caught within this net, trapped and contained within this very net.",
    "dn1:215": "\"The body of the Tathāgata, bhikkhus, stands with the leash that bound it to existence cut.[n.87] All that formerly bound him to the cycle of rebirth.As long as his body stands, gods and men shall see him. But with the breakup of the body and the exhaustion of the life-faculty, gods and men shall see him no more.",
    "dn1:216": "\"Just as, bhikkhus, when the stalk of a bunch of mangoes has been cut, all the mangoes connected to the stalk follow along with it, in the same way, the body of the Tathāgata stands with the leash that bound it to existence cut. As long as his body stands, gods and men shall see him. But with the breakup of the body and the exhaustion of the life-faculty, gods and men shall see him no more.\"",
    "dn1:217": "When this was said, the Venerable Ānanda said to the Exalted One: \"It is wonderful, venerable sir, it is marvelous! What is the title, venerable sir, of this exposition of the Dhamma?\"",
    "dn1:218": "Thus spoke the Exalted One. Elated in mind, the bhikkhus delighted in the word of the Exalted One. And while this exposition was being spoken, the ten-thousandfold world system shook."
}