{
    "dn21:1": "Thus have I heard.[n.579] Another Sutta with a mythological background, and some truly remarkable features, including the amazing conceit of having Pañcasikha the gandhabba attract the Buddha’s attention by means of a love-song! But all this should not blind us to the fact that some deep matters are discussed in the body of the Sutta — just a little like those later Sutras in which the Lord discussed the mysteries of the Prajñāpāramitā with Subhuti against a gorgeous mythological backdrop.Once the Lord was staying in Magadha, to the east of Rājagaha, by a Brahmin village called Ambasaṇḍā, to the north of the village on Mount Vediya, in the Indasāla Cave.[n.580] RD disbelieves in any original association of this cave and tree with the god Indra (who is, or is not exactly, identical with the Sakka we meet here). The cave was still inhabited at the time of the visit of the Chinese pilgrim Fa-hsien (ca. 405 C.E.), but by the time of Hsüan-tsang (ca. 630) it was deserted.And at that time Sakka, lord of the gods,[n.58] Sakka is the ruler of the Thirty-Three Gods, in a heaven which still belongs to the Realm of Sense-Desires(kāmāvacara), above that of the Four Great Kings but far below the Realm of Brahmā – actually quite a lowly position in the Buddhist scheme of things (see Introduction, p. 4). RD has a useful summary of information about him in the introduction to this Sutta, with a list of his titles and a discussion of the question of how far he can be identified with Indra.felt a strong desire to see the Lord. And Sakka thought: 'Where is the Blessed Lord, the fully-enlightened Buddha, now staying?' Then, perceiving where the Lord was, Sakka said to the Thirty-Three Gods: 'Gentlemen, the Blessed Lord is staying in Magadha…in the Indasāla Cave. How would it be if we were to go and visit the Lord?' 'Very good, Lord, and may good fortune go with you', replied the Thirty-Three Gods.",
    "dn21:2": "Then Sakka said to Pañcasikha of the gandhabbas: 'The Blessed Lord is staying in Magadha…in the Indasāla Cave. I propose to go to visit him.' 'Very good, Lord', said Pañcasikha and, taking his yellow beluva-wood lute,[n.58] The vīnā is better known in the West today by its Indian name than it was in RD's time. RD mistakenly calls it a lyre, but it is definitely a kind of lute. The author of the article beluva in PED calls it a flute (and the mistake is repeated under pandu, so is not, apparently, a misprint). It would surely have been beyond the powers of Pañcasikha, or of Krishna himself, to accompany his own song on the flute!he followed in attendance on Sakka.",
    "dn21:3": "And, just as swiftly as a strong man might stretch forth his flexed arm, or flex it again, Sakka, surrounded by the Thirty-Three Gods and attended by Pañcasikha, vanished from the heaven of the Thirty-Three and appeared in Magadha…on Mount Vediya.",
    "dn21:4": "Then Sakka said: 'Pañcasikha, it is hard for the likes of us to get near the Tathāgatas when they are enjoying the bliss of meditation,[n.583] Jhāna, according to Sakka, but he would scarcely have known what kind of meditation the Tathāgata was practising!and therefore withdrawn. But if you, Pañcasikha, were first to attract[n.58]Pasādeyyāsi:'please, attract, charm'. Not the most appropriate term (RD has 'win overʹ), but suited to Pancasikhaʹs talents.the ear of the Blessed Lord, then we might afterwards be able to approach and see the Blessed Lord, the fully-enlightened Buddha.' 'Very good, Lord', said Pañcasikha and, taking his yellow beluva-wood lute, he approached the Indasāla Cave. Thinking: 'As far as this is neither too far nor too near to the Lord, and he will hear my voice', he stood to one side.",
    "dn21:5": "Then, to the strains of his lute, he sang these verses extolling the Buddha, the Dhamma, the Arahants, and love:[n.8] RD draws attention to similar things in theMahābhārataand elsewhere in Indian literature, without commenting on the extreme oddity of its occurrence here!",
    "dn21:6": "'Lady, your father Timbarū greet,Oh Sunshine[n.58] The meaning of Suriyavaccasa (cf. DN 20.10).fair, I give him honour due,By whom was sired a maid as fair as youWho are the cause of all my heart's delight.",
    "dn21:7": "Delightful as the breeze to one who sweats,Or as a cooling draught to one who thirsts,Your radiant beauty is to me as dearAs the Dhamma is to Arahants.",
    "dn21:8": "Just as medicine to him who's ill,Or nourishment to one who's starving still,Bring me, gracious lady, sweet releaseWith water cool from my consuming flames.",
    "dn21:9": "The elephant, oppressed by summer heat,[n.587] Elephants do indeed suffer from the heat, and have to be kept cool.Seeks out a lotus-pool upon which floatPetals and pollen of that flower,So into your bosom sweet I'd plunge.",
    "dn21:10": "As an elephant, urged by the goad,Pays no heed to pricks of lance and spear,So I, unheeding, know not what I do,Intoxicated by your beauteous form.",
    "dn21:11": "By you my heart is tightly bound in bonds,All my thoughts are quite transformed, and ICan no longer find my former course:I'm like a fish that's caught on baited hook.",
    "dn21:12–14": "Come, embrace me, maiden fair of thighs,[n.588] This epithet omitted by Mrs. Rhys Davids in her translation.Seize and hold me with your lovely eyes,Take me in your arms, it's all I ask!My desire was slight at first, O maidOf waving tresses, but it grew apace,As grow the gifts that Arahants receive.",
    "dn21:15": "Whatever merit I have gained by giftsTo those Noble Ones, may my rewardWhen it ripens, be your love, most fair!",
    "dn21:16": "As the Sakyans' Son in jhāna raptIntent and mindful, seeks the deathless goal,Thus intent I seek your love, my Sun!",
    "dn21:17": "Just as that Sage would be rejoiced, if heWere to gain supreme enlightenment,So I'd rejoice to be made one with you.[n.589] As we see below, this was supposedly composed just prior to Gotama's enlightenment, though this conflicts with the just previous mention of Arahants!",
    "dn21:18": "If Sakka, Lord of Three-and-Thirty GodsWere perchance to grant a boon to me,It's you I'd crave, my love for you's so strong.",
    "dn21:19": "Your father, maid so wise, I venerateLike a sāl-tree fairly blossoming,For his offspring's sake, so sweet and fair.'",
    "dn21:20": "When he heard this, the Lord said: ′Pañcasikha, the sound of your strings blends so well with your song, and your song with the strings, that neither prevails excessively over the other.[n.590] The Buddha refrains from rebuking Pañcasikha for his somewhat inappropriate song, and pays him a neat compliment. In the 'household life' Gotama must have heard many love-songs, even if we disregard all the legends of his upbringing.When did you compose these verses on the Buddha, the Dhamma, the Arahants, and love?' 'Lord, it was when the Blessed Lord was staying on the bank of the River Nerañjarā, under the goatherd's banyan tree prior to his enlightenment. At that time I fell in love with the lady Bhaddā, bright as the sun, the daughter of King Timbarū of the gandhabbas. But the lady was in love with somebody else. It was Sikhaddi, the son of Mātali the charioteer, whom she favoured. And when I found that I could not win the lady by any manner of means, I took my yellow beluva-wood lute and went to the home of King Timbarū of the gandhabbas, and there I sang these verses:",
    "dn21:21": "'Lady, your father Timbarū greet,Oh Sunshine fair, I give him honour due,By whom was sired a maid as fair as youWho are the cause of all my heart's delight.",
    "dn21:22": "Your father, maid so wise, I venerateLike a sāl-tree fairly blossoming,For his offspring's sake, so sweet and fair.'",
    "dn21:23": "'And, Lord, having heard the verses the lady Bhaddā Suriyavaccasā said to me: \"Sir, I have not personally seen that Blessed Lord, though I heard of him when I went to the Sudhammā Hall of the Thirty-Three Gods to dance. And since, sir, you praise that Blessed Lord so highly, let us meet today.\" And so, Lord, I met the lady, not then but later.'",
    "dn21:24": "Then Sakka thought: 'Pañcasikha and the Lord are in friendly conversation', so he called to Pañcasikha: 'My dear Pañcasikha, salute the Blessed Lord from me, saying: \"Lord, Sakka, king of the gods, together with his ministers and followers, pays homage at the feet of the Blessed Lord.\"' 'Very good, Lord', said Pañcasikha, and did so.",
    "dn21:25": "′Pañcasikha, may Sakka, king of the gods, his ministers and followers be happy, for they all desire happiness: devas, humans, asuras, nāgas, gandhabbas, and whatever other groups of beings there are!' for that is the way the Tathāgatas greet such mighty beings. After this greeting, Sakka entered the Indasāla Cave, saluted the Lord, and stood to one side, and the Thirty-Three Gods, with Pañcasikha, did the same.",
    "dn21:26": "Then in the Indasāla Cave the rough passages became smooth, the narrow parts became wide, and in the pitch-dark cavern it became bright, owing to the power of the devas.",
    "dn21:27": "Then the Lord said to Sakka: 'It is wonderful, it is marvellous that the Venerable Kosiya,[n.591] rA title or name of Indra, used politely as, e.g., Vasetthas in DN 16,5.19, etc.with so much, so many things to do, should come here!' 'Lord, I have long wished to visit the Blessed Lord, but I have always been so busy on behalf of the Thirty-Three that I was unable to come. Once the Blessed Lord was staying at Sāvatthī in the Salala hut, and I went to Sāvatthī to see the Lord.",
    "dn21:28": "In fact I have witnessed this myself. There was, Lord, right here in Kapilavatthu a Sakyan girl called Gopikā who had faith in the Buddha, the Dhamma and the Saṅgha, and who observed the precepts scrupulously. She rejected the status of a woman and developed the thought of becoming a man. Then, after her death, at the breaking-up of the body, she went to a happy destination, being reborn in a heaven-state among the Thirty-Three Gods, as one of our sons, becoming known as Gopaka the devas' son.[n.593] Devaputta: either simply a male deva or the head of a group of devas.Also, there were three monks who, having observed the holy life under the Blessed Lord, had been reborn in the inferior condition of gandhabbas. They lived indulging in the pleasures of the five senses, as our attendants and servants. At this, Gopaka rebuked them, saying: \"What were you about, sirs, that you did not listen to the Blessed Lord's teaching? I was a woman who had faith in the Buddha…I rejected the status of a woman … and was reborn among the Thirty-Three Gods and am known as Gopaka the devas' son. But you, after having observed the holy life under the Blessed Lord, have been reborn in the inferior condition of gandhabbas! It is a sorry sight for us to see our fellows in the Dhamma reborn in the inferior condition of gandhabbas!\" And being thus rebuked, two of those devas immediately developed mindfulness,[n.594] Note the importance of this: the following Sutta is, of course, devoted entirely to this subject.and so attained to the Realm of the Retinue of Brahma.[n.595] Higher than that of the Thirty-Three Gods (seen.581).But one of them remained addicted to sensual pleasures.",
    "dn21:29–47": "Gopaka spoke:\"'Disciple once of Him-Who-Sees,The name I bore then Gopikā.In Buddha, Dhamma firmly trustingI served the Saṅgha cheerfully.For loyal service paid to himSee me now, a Sakka-son,Mighty, in the Threefold Heaven,[n.596] Another name for the Heaven of the Thirty-Three Gods.Resplendent; Gopaka my name.Then former monks I saw, who'd reachedNo higher than gandhabba's rank,Who before had human birthAnd led the life the Buddha taught.We supplied their food and drinkAnd waited on them in our homes.[n.597] There is considered to be an implied contract between monks and their lay supporters. In return for support, monks are supposed to do their best to gain enlightenment. Not to do so is a form of dishonesty.Had they no ears, that they thus blestStill could not grasp the Buddha’s law?Each for himself must understandThat Dhamma taught by Him-Who-Sees,And well-proclaimed. I, serving you,Heard the Noble Ones' good words,And so I'm born, a Sakka-son,Mighty, in the Threefold Heaven,And resplendent, whereas you,Though you served the Prince of MenAnd led the matchless life he taught,Have reappeared in humble state,And not attained your proper rank,A sorry sight it is to seeOne's Dhamma-fellows sunk so lowThat, gandhabba-spirits, youBut come to wait upon the gods,While as for me — I am transformed!From household life, and female, IAm now reborn a male, a god,Rejoicing in celestial bliss!\"",
    "dn21:48": "Then the Lord thought: 'Sakka has lived a pure life for a long time. Whatever questions he may ask will be to the point and not frivolous, and he will be quick to understand my answers.'",
    "dn21:49": "So the Blessed Lord replied to Sakka in this verse:",
    "dn21:50": "'Ask me, Sakka, all that you desire!On what you ask, I′ll put your mind at rest.'",
    "dn21:51": "Being thus invited, Sakka, ruler of the gods, put his first question to the Lord:",
    "dn21:52": "'By what fetters, sir,[n.601]Mārisa:'Sir', not 'Lord'. Sakka does later go over to the more respectful form of address.are beings bound — gods, humans, asuras, nāgas, gandhabbas and whatever other kinds there may be — whereby, although they wish to live without hate, harming, hostility or malignity, and in peace, they yet live in hate, harming one another, hostile and malign? ′ This was Sakka's first question to the Lord, and the Lord replied:",
    "dn21:53": "'Ruler of the Gods, it is the bonds of jealousy and avarice[n.602]Issa-macchariya.This is better than RD's 'envy and selfishness'.that bind beings so that, though they wish to live without hate,… they yet live in hate, harming one another, hostile and malign.' This was the Lord's reply, and Sakka, delighted, exclaimed: 'So it is, Lord, so it is, Well-Farer! Through the Lord's answer I have overcome my doubt and got rid of uncertainty!'",
    "dn21:54": "Then Sakka, having expressed his appreciation, asked another question:",
    "dn21:55": "'But sir, what gives rise to jealousy and avarice, what is their origin, how are they born, how do they arise? Owing to the presence of what do they arise, owing to the absence of what do they not arise?' 'Jealousy and avarice, Ruler of the Gods, take rise from like and dislike,[n.603]Piya-appiya:'dear and not-dear'.this is their origin, this is how they are born, how they arise. When these are present, they arise; when these are absent, they do not arise.'",
    "dn21:56": "'But, sir, what gives rise to like and dislike?… Owing to the presence of what do they arise, owing to the absence of what do they not arise?'",
    "dn21:57": "'They arise, Ruler of the Gods, from desire[n.604]Chanda:equated by DA withtaṇhā'craving'.… Owing to the presence of desire they arise, owing to the absence of desire they do not arise.' 'But, sir, what gives rise to desire?…'",
    "dn21:58": "'Desire, Ruler of the Gods, arises from thinking[n.605]Vitakka.RD says (in part): 'The word is used, not with any fine shade of psychological meaning, but in its popular sense… \"taking thought for\" …, \"being preoccupied about\"'. Seen.611.… When the mind thinks about something, desire arises; when the mind thinks about nothing, desire does not arise.' 'But, sir, what gives rise to thinking? …′",
    "dn21:59": "'Well, sir, what practice has that monk undertaken,[n.607] 'How has that bhikkhu gone about…?' (RD).who has reached the right way which is needful and leading to the cessation of the tendency to proliferation?'",
    "dn21:60": "'Ruler of the Gods, I declare that there are two kinds of happiness:[n.8]Somanassa:cf.n.528.the kind to be pursued, and the kind to be avoided. The same applies to unhappiness[n.9]Domanassa. Somanassa-domanassaare sometimes rendered 'gladness and sadness'.and equanimity.[n.610]Upekhā.Why have I declared this in regard to happiness?",
    "dn21:61–64": "This is how I understood happiness: When I observed that in the pursuit of such happiness, unwholesome factors increased and wholesome factors decreased, then that happiness was to be avoided. And when I observed that in the pursuit of such happiness unwholesome factors decreased and wholesome ones increased, then that happiness was to be sought after. Now, of such happiness as is accompanied by thinking and pondering,[n.611] Vitakka-vicāra. This refers to the second jhāna (cf.DN 2.75, 11). I have used the rendering mentioned atn.80, instead of the more usual 'initial and sustained application'. In a private communication, L.S. Cousins writes: 'The words simply do not mean this…Suttanta does not distinguish between access and absorption – hence the terms used do not have their momentary Abhidhamma sense. In the case of vicāra this is not even the Abhidhamma sense, since Dhs clearly explains vicāra as \"investigating\".'and of that which is not so accompanied, the latter is the more excellent. The same applies to unhappiness, and to equanimity. And this, Ruler of the Gods, is the practice that monk has undertaken who has reached the right way…leading to the cessation of the tendency to proliferation.'",
    "dn21:65": "Then Sakka, having expressed his appreciation, asked another question:",
    "dn21:66–70": "'Well, sir, what practice has that monk undertaken who has acquired the restraint required by the rules?′[n.612]Pāṭimokkha.'Ruler of the Gods, I declare that there are two kinds of bodily conduct: the kind to be pursued, and the kind to be avoided. The same applies to conduct of speech and to the pursuit of goals. And this, Ruler of the Gods, is the practice that monk has undertaken who has acquired the restraint required by the rules.'",
    "dn21:74": "Then Sakka asked another question: 'Well, sir, what practice has that monk undertaken who has acquired control of his sense-faculties?'",
    "dn21:72–75": "'Ruler of the Gods, I declare that things perceived by the eye are of two kinds: the kind to be pursued, and the kind to be avoided. The same applies to things perceived by the ear, the nose, the tongue, the body and the mind.' At this, Sakka said: 'Lord, I understand in full the true meaning of what the Blessed Lord has outlined in brief. Lord, whatever object perceived by the eye, if its pursuit leads to the increase of unwholesome factors and the decrease of wholesome ones, that is not to be sought after; if its pursuit leads to the decrease of unwholesome factors and the increase of wholesome ones, such an object is to be sought after. And the same applies to things perceived by the ear, the nose, the tongue, the body and the mind. Thus I understand in full the true meaning of what the Blessed Lord has outlined in brief, and thus through the Lord's answer I have overcome my doubt and got rid of uncertainty.'",
    "dn21:76–80": "Then Sakka asked another question: 'Sir, do all ascetics and Brahmins teach the same doctrine, practise the same discipline, want the same thing[n.613] The same question as posed in DN 16.5.26 by Subhadda.and pursue the same goal?' 'No, Ruler of the Gods, they do not.' 'But why, sir, do they not do so?' 'The world, Ruler of the Gods, is made up of many and various elements. Such being the case, beings adhere to one or other of these various things, and whatever they adhere to they become powerfully addicted to, and declare: 'This alone is the truth, everything else is false!' Therefore they do not all teach the same doctrine, practise the same discipline, want the same thing, pursue the same goal.'",
    "dn21:81": "'Sir, are all ascetics and Brahmins fully proficient, freed from bonds, perfect in the holy life, have they perfectly reached the goal?' 'No, Ruler of the Gods.' 'Why is that, sir?' 'Only those, Ruler of the Gods, who are liberated by the destruction of craving are fully proficient, freed from the bonds, perfect in the holy life, and have perfectly reached the goal.'",
    "dn21:82": "And Sakka rejoiced at the answer as before.",
    "dn21:83": "Then Sakka said: ′Passion,[n.614]Ejā:glossed by DA ascalamaṭṭhena taṇhā,which RD renders 'Craving, with respect to the thrill' (better, perhaps: 'trembling with desire'). ʹʺPassionʺʹ, says RD, 'lacks etymological coincidence… but no other term is forceful enough'. Finding no better alternative, I have adopted it here.sir, is a disease, a boil, a dart. It seduces a man, drawing him into this or that state of becoming, so that he is reborn in high states or low. Whereas other ascetics and Brahmins of differing viewpoints gave me no chance to ask these questions, the Lord has instructed me at length, and thus removed the dart of doubt and uncertainty from me.' 'Ruler of the Gods, do you admit to having asked the same question of other ascetics and Brahmins?' 'Yes, Lord.' 'Then, if you don′t mind, please tell me what they said.' 'I do not mind telling the Blessed Lord, or one like him.′[n.615] Cf. the similar passage in 2.15, though the response of those questioned is different, if equally unsatisfactory.'Then tell me, Ruler of the Gods.'",
    "dn21:84": "'Lord, I went to those I considered to be ascetics and Brahmins because of their solitary life in the woods, and I put these questions to them. But instead of giving me a proper answer,[n.616] Na sampāyanti: mysteriously rendered 'did not withdraw themselves' (RD).they asked me in return: \"Who are you, Venerable Sir?\" I replied that I was Sakka, ruler of the gods, and they asked me what had brought me there. Then I taught them the Dhamma as far as I had heard it and practised it. But they were very pleased with even that much, and they said: \"We have seen Sakka, the ruler of the gods, and he has answered the questions we put to him!\" And they became my pupils instead of my becoming theirs. But I, Lord, am a disciple of the Blessed Lord, a Stream-Winner, not subject to rebirth in states of woe, firmly established and destined for full enlightenment. ′[n.617] Seen.622.",
    "dn21:85": "'Ruler of the Gods, do you admit to having ever previously experienced rejoicing and happiness such as you experience now?' 'Yes, Lord.' 'And what was that about?'",
    "dn21:86": "'In the past, Lord, war had broken out between the gods and the asuras, and the gods had defeated the asuras. And after the battle, as victor, I thought: \"Whatever is now the food of the gods,[n.618] Ojā: cf.n.418.and what is the food of the asuras, henceforth we shall enjoy both.\" But, Lord, such happiness and satisfaction, which was due to blows and wounds, does not conduce to dispassion, detachment, cessation, peace, higher knowledge, enlightenment, Nibbāna. But that happiness and satisfaction that is obtained by hearing the Dhamma from the Blessed Lord, which is not due to blows and wounds, does conduce to dispassion, detachment, cessation, peace, higher knowledge, enlightenment, Nibbāna.′",
    "dn21:87": "'And, Ruler of the Gods, what things do you call to mind when you admit to experiencing such satisfaction and happiness as this?' 'Lord, at such a time, six things come to mind at which I rejoice:",
    "dn21:88": "\"I who merely as a god exist, have gainedThe chance, by kamma, of another earthly life.′′[n.619] The idea that a god needs to return to the human state before gaining enlightenment seems to apply here, even though Sakka is, or is supposedly, a Stream-Winner.",
    "dn21:89": "That, Lord, is the first thing that occurs to me.",
    "dn21:90": "\"Leaving this non-human realm of gods behind,Unerringly I'll seek the womb I wish to find.\"",
    "dn21:91": "That, Lord, is the second thing…",
    "dn21:92": "\"My problems solved, I'll gladly live by Buddha’s law,Controlled and mindful, and with clear awareness filled.′′",
    "dn21:93": "That, Lord, is the third thing…",
    "dn21:94": "\"And should thereby enlightenment arise in me,As one-who-knows I'll dwell, and there await my end.\"",
    "dn21:95": "That, Lord, is the fourth thing…",
    "dn21:96": "\"Then when I leave the human world again, I'll beOnce more a god, and one of highest rank.\"",
    "dn21:97": "That, Lord, is the fifth thing…",
    "dn21:98": "\"More glorious than devas are the Peerless Gods,[n.620] Akaniṭṭhā, those in the highest heaven of all. See Introduction, p. 39.Among whom dwelling I shall make my final home.\"",
    "dn21:99": "That, Lord, is the sixth thing that occurs to me …",
    "dn21:100": "… and these are the six things at which I rejoice.",
    "dn21:101–109": "'Long I wandered, unfulfilled, in doubt,In quest of the Tathagata. I thoughtHermits who live secluded and austereMust surely be enlightened: I'll seek them.\"What must I do to gain success, and whatCourse but leads to failure?\" — but, thus asked,They could not tell me how to tread the path.Instead, when they found out that I am kingOf gods, they asked me why I'd come to them,And I it was who taught them what I knewOf Dhamma, and at that, rejoicing, theyCried: \"It's Vasava, the Lord, we've seen!\"But now – I've seen the Buddha, and my doubtsAre all dispelled, my fears are allayed,And now to the Enlightened One I payHomage due, to him who's drawn the dartOf craving, to the Buddha, peerless Lord,Mighty hero, kinsman of the Sun![n.621] The Gotama clan were supposed to be of solar descent.Just as Brahmā's worshipped by the gods,So likewise today we worship you,Enlightened One, and Teacher unsurpassed,Whom none can equal in the human world,Or in the heavens, dwelling of the gods!'",
    "dn21:110": "Then Sakka, ruler of the gods, said to Pañcasikha of the gandhabbas: 'My dear Pañcasikha, you have been of great help to me for gaining the ear of the Blessed Lord. For it was through your gaining his ear that we were admitted to the presence of the Blessed Lord, the Arahant, the supremely enlightened Buddha. I will be a father to you, you shall be king of the gandhabbas, and I will give you Bhaddā Suriyavaccasā, whom you desired.'",
    "dn21:111": "And then Sakka, ruler of the gods, touched the earth with his hand and called out three times:",
    "dn21:112": "′Homage to the Blessed One, the Arahant, the supremely enlightened Buddha!",
    "dn21:113": "Homage to the Blessed One, the Arahant, the supremely enlightened Buddha!",
    "dn21:114": "Homage to the Blessed One, the Arahant, the supremely enlightened Buddha!'",
    "dn21:115": "And while he had been speaking in this dialogue,[n.622] It is not quite clear whether Sakka really became a Stream-Winner at this point, or earlier, when he made the claim (n.617). At the earlier point the Buddha made no direct comment, possibly knowing that this 'conversion' (RD), though it had not quite happened, was imminent.According to DA (adDN 22.1) Sakka had observed with terror the signs that his reign as king of the gods was approaching its end: hence his visit to the Buddha. For the length of life among the Thirty-Three Gods, see DN 23.11.the pure and spotless Dhamma-Eye arose within Sakka, ruler of the gods, and he knew: 'Whatever things have an origin must come to cessation.' And the same thing happened to eighty thousand devas as well."
}