{
    "dn22:1": "Thus have I heard.[n.624] This is generally regarded as the most important Sutta in the entire Pali Canon. It recurs verbatim atMN 0as the Satipatthana Sutta, with the omission of verses 8–2. The text (or that ofMN 0) has been separately translated a number of times, notably by Soma Thera asThe Way of Mindfulness(2nd ed. Colombo 949, 3rd ed. BPS 967). The important bookThe Heart of Buddhist Meditationby Nyāṇaponika Mahāthera (Colombo 954, London 973 and later) is essentially based on this Sutta and contains a translation, not only of this but of other relevant texts from the Pali Canon and from Mahayana sources (especially Santideva's Sikṣāsamuccaya). The author's remark in the Introduction should also be noted: 'Among the Mahayana schools of the Far East, it is chiefly the Chinese Ch'an and Japanese Zen that are closest to the spirit of Satipaṭṭhāna. Notwithstanding the differences in method, aim and basic philosophical conceptions, the connecting links with Satipaṭṭhāna are close and strong, and it is regrettable that they have hardly been stressed or noticed.' It should however be mentioned that since those words were written, the realisation has begun to dawn that Zen has much in common with Theravāda in general, and the Satipaṭṭhāna method in particular — somewhat to the surprise of some who have overstressed the 'uniqueness' of Zen. The cross-headings in this Sutta correspond closely to those used by the Ven. Ñāṇamoli for MN 0.Once the Lord was staying among the Kurus. There is a market-town of theirs called Kammāsadhamma.[n.625] Or Kammāsadhamma. There was nowhere in the town for the Buddha to stay, so he stayed outside, in the jungle: hence the construction 'There is a market town' (DA). See alsoDN5for the same construction.And there the Lord addressed the monks: 'Monks!' 'Lord', they replied, and the Lord said:",
    "dn22:2": "'There is, monks, this one way[n.66]Ekāyano maggo.Sometimes translated 'the only way' or 'the one and only way' with, on occasion, a slightly triumphalist connotation. DA in fact offers a number of possibilities, thus showing that the old commentators were not entirely sure of the exact meaning. Ekāyana can be literally rendered 'one-going', which is ambiguous. Ñāṇamoli has 'a path that goes one way only'. In any case it should not be confused with the term sometimes found in Buddhist Sanskrit ekayāna 'one vehicle' or 'career'.to the purification of beings, for the overcoming of sorrow and distress, for the disappearance of pain and sadness,[n.67]Domanassa:in this context usually translated ʹgriefʹ, but cf.DN 1..3where the meaning is closer to 'sadness'.for the gaining of the right path,[n.68]Ñāya:'leading, guiding' (sometimes = ʹlogicʹ). Here = 'the right path'.for the realisation of Nibbāna: – that is to say the four foundations of mindfulness.[n.69]Satipaṭṭhānā.It is probably a compound ofsati + upaṭṭhāna(lit. 'placing near'), as in the old Sanskrit version (Smṛty-upasthāna Sūtra). 'Foundations', though used by Nyānaponika and others, is really a makeshift translation. In any case, whatever the etymology, the meaning emerges clearly enough from the instructions that follow.Sati (Skt.smṛti) originally meant 'memory' (and still, rarely, does in Pali). The rendering 'mindfulness' by RD was a brilliant one which is almost universally used (though 'recollection' or 'recollectedness' is occasionally found). The use of 'self-possession' by A.K. Warder in his otherwise excellent Indian Buddhism is regrettable. It should perhaps be mentioned that Buddhist Sanskrit smṛti is clearly used in a different sense from the Hindu smṛti 'oral tradition'.",
    "dn22:3": "'What are the four? Here, monks, a monk[n.60]Bhikkhu:but here used, according to DA, for anyone who does this practice.abides contemplating body as body,[n.61]Kāye kāyānupassī viharati:lit. 'contemplating the body in the body', and with similar repetitive formulations for the other three 'foundations'. 'Why is the word \"body\" used twice in the phrase: \"Contemplating the body in the body\"? For determining the object and isolating it.' (DA). Ñāṇamoli paraphrases: 'This means not confusing, during meditation, body with feeling, mind, etc. The body is contemplated just as body, feelings just as feelings, etc.´ardent, clearly aware and mindful, having put aside hankering and fretting for the world;[n.62] I have tried to get away from the usual rendering 'coveting and grief' in order to bring out the true meaning. The theme is fully developed inverse 19.he abides contemplating feelings as feelings[n.6]Vedanāis feeling (physical or mental) in its most basic sense of 'sensation', pleasant, painful or neutral. It is regrettable that Warder has chosen 'emotion' for this word, which is precisely what it does not mean!… ; he abides contemplating mind as mind[n.64]Citta:'mind' or, metaphorically, 'heart'. Seeverse 12.… ; he abides contemplating mind-objects as mind-objects,[n.65]Dhammā(plural): one of the standard meanings of this term (see BDic).ardent, clearly aware and mindful, having put aside hankering and fretting for the world.'",
    "dn22:4": "'And how, monks, does a monk abide contemplating the body as body? Here a monk, having gone into the forest, or to the root of a tree, or to an empty place,[n.636] Or 'an empty room'.sits down cross-legged, holding his body erect, having established mindfulness before him.[n.637] I.e. on the breath in front of him, as DA. Nyāṇaponika paraphrases 'keeping…his mindfulness alert'. Readers of F.L. Woodward's somewhat dated Some Sayings of the Buddha should note that there is no basis for his footnote 'Concentrating between the eyebrows'.Mindfully he breathes in, mindfully he breathes out.[n.638] This is the probable meaning of assasati, passasati, though it is just possible that the terms should be reversed. Ñāṇamoli's footnote: 'The exercise described is one in mental observation not in bodily development or breath control as in Hatha-yoga' may be a necessary reminder to some.",
    "dn22:5": "Breathing in a long breath, he knows that he breathes in a long breath,[n.639] Lit. 'He knows: \"I breathe in a long breath\"', etc. Pali regularly uses direct speech in such cases.and breathing out a long breath, he knows that he breathes out a long breath.",
    "dn22:6": "Breathing in a short breath, he knows that he breathes in a short breath, and breathing out a short breath, he knows that he breathes out a short breath.",
    "dn22:7": "He trains himself, thinking: \"I will breathe in, conscious of the whole body.\"[n.640] This is taken to mean 'the whole body of breath'. \"'Making known, making clear to myself the beginning, middle and end of the whole body of breathings in…\"' (DA, transl. Soma Thera).He trains himself, thinking: \"I will breathe out, conscious of the whole body.\"",
    "dn22:8": "He trains himself, thinking: \"I will breathe in, calming the whole bodily process.\"[n.641]Kāya-saṅkhāra.This calming process may lead to the development of jhāna, but this is not the primary object here.He trains himself, thinking: \"I will breathe out, calming the whole bodily process.\"",
    "dn22:9": "Just as a skilled turner, or his assistant, in making a long turn, knows that he is making a long turn, or in making a short turn, knows that he is making a short turn, so too a monk, in breathing in a long breath, knows that he breathes in a long breath… and so trains himself, thinking: \"I will breathe out, calming the whole bodily process.\"'",
    "dn22:10": "'So he abides contemplating body as body internally,[n.642] Internally means 'one's own body' and externally means 'someone else's body'.contemplating body as body externally, contemplating body as body both internally and externally. He abides contemplating arising phenomena[n.643]Samudaya-dhammā.Samudaya is, perhaps significantly, the word used for the 'origin' of suffering in the Second Noble Truth. Awareness of how phenomena (body, etc.) come to be is meant. Ñāṇamoli has 'contemplating the body in its arising factors'.in the body, he abides contemplating vanishing phenomena[n.643]Vaya-dhammā:Ñāṇamoli has 'contemplating the body in its vanishing factors'.in the body, he abides contemplating both arising and vanishing phenomena in the body. Or else, mindfulness that \"there is body\" is present to him just to the extent necessary for knowledge and awareness.[n.645] Just holding the thought in mind without speculating, mind-wandering, etc.And he abides independent, not clinging to anything in the world. And that, monks, is how a monk abides contemplating body as body.'",
    "dn22:11": "'Again, a monk, when walking, knows that he is walking, when standing, knows that he is standing, when sitting, knows that he is sitting, when lying down, knows that he is lying down. In whatever way his body is disposed, he knows that that is how it is.",
    "dn22:12": "'So he abides contemplating body as body internally, externally, and both internally and externally… And he abides independent, not clinging to anything in the world. And that, monks, is how a monk abides contemplating body as body.'",
    "dn22:13": "'Again, a monk, when going forward or back, is clearly aware of what he is doing,[n.646]Sampajāna-kārī hoti:'Is acting in a clearly conscious way' (Horner). RD's rendering of 'self-possession' for sampajañña (adopted, even more ridiculously, for sati by Warder breaks down here).in looking forward or back he is clearly aware of what he is doing, in bending and stretching he is clearly aware of what he is doing, in carrying his inner and outer robe and his bowl he is clearly aware of what he is doing, in eating, drinking, chewing and savouring he is clearly aware of what he is doing, in passing excrement or urine he is clearly aware of what he is doing, in walking, standing, sitting, falling asleep and waking up, in speaking or in staying silent, he is clearly aware of what he is doing.",
    "dn22:14": "'So he abides contemplating body as body internally, externally, and both internally and externally… And he abides independent, not clinging to anything in the world. And that, monks, is how a monk abides contemplating body as body.'",
    "dn22:15": "'Again, a monk reviews[n.647]Paccavekkhati.The same verb-stem is used inpaccavekkhaṇa-ñāṇa'reviewing-knowledge': seen.213.this very body from the soles of the feet upwards and from the scalp downwards, enclosed by the skin and full of manifold impurities: \"In this body there are head-hairs, body-hairs, nails, teeth, skin,[n.648] These first five are given as a standard meditation for novices.flesh, sinews, bones, bone-marrow, kidneys, heart, liver, pleura, spleen, lungs, mesentery, bowels, stomach, excrement, bile, phlegm, pus, blood, sweat, fat, tears, tallow, saliva, snot, synovic fluid, urine.′′[n.649] With the addition of 'brain' these 32 parts of the body are included as a meditation-subject: cf. VM 8.42ff.",
    "dn22:16": "Just as if there were a bag, open at both ends, full of various kinds of grain such as hill-rice, paddy, green gram,[n.650]Phaseolus mungo:sometimes sold in the West as 'mung beans'.kidney-beans, sesame, husked rice, and a man with good eyesight were to open the bag and examine them, saying: \"This is hill-rice, this is paddy, this is green gram, these are kidney-beans, this is sesame, this is husked rice\", so too a monk reviews this very body: \"In this body there are head-hairs,… urine.\"",
    "dn22:17": "'So he abides contemplating body as body internally, externally, and both internally and externally…And he abides independent, not clinging to anything in the world. And that, monks, is how a monk abides contemplating body as body.'",
    "dn22:18": "'Again, a monk reviews this body, however it may be placed or disposed, in terms of the elements: \"There are in this body the earth-element, the water-element, the fire-element, the air-element.′′[n.651] Cf.n.70.",
    "dn22:19": "Just as if a skilled butcher or his assistant, having slaughtered a cow,[n.652] An unpleasant image, heightened for the modem reader when the hygienic aspect is considered! It shows that there were no 'sacred cows' in the Buddha’s day.were to sit at a crossroads with the carcass divided into portions, so a monk reviews this very body…in terms of the elements: \"There are in this body the earth-element, the water-element, the fire-element, the air-element.\"",
    "dn22:20": "'So he abides contemplating body as body internally… And he abides independent, not clinging to anything in the world. And that, monks, is how a monk abides contemplating body as body.'",
    "dn22:21": "'Again, a monk, as if he were to see a corpse thrown aside in a charnel-ground,[n.653] 'Cemetery', favoured by some translators, conveys a totally false impression: it is a place of rotting corpses just thrown down — splendid for this kind of meditation!one, two or three days dead, bloated, discoloured, festering, compares this body with that, thinking: \"This body is of the same nature, it will become like that, it is not exempt from that fate.\"",
    "dn22:22": "'Again, a monk, as if he were to see a corpse in a charnel-ground, thrown aside, eaten by crows, hawks or vultures, by dogs or jackals, or various other creatures, compares this body with that, thinking: \"This body is of the same nature, it will become like that, it is not exempt from that fate.\"",
    "dn22:23": "'Again, a monk, as if he were to see a corpse in a charnel-ground, thrown aside, a skeleton with flesh and blood, connected by sinews,…",
    "dn22:24": "… a fleshless skeleton smeared with blood, connected by sinews,…",
    "dn22:25": "… a skeleton detached from the flesh and blood, connected by sinews,…",
    "dn22:26": "… randomly connected bones, scattered in all directions, a hand-bone here, a foot-bone there, a shin-bone here, a thigh-bone there, a hip-bone here, a spine here, a skull there, compares this body with that…",
    "dn22:27": "'Again, a monk, as if he were to see a corpse in a charnel-ground, thrown aside, the bones whitened, looking like shells …,",
    "dn22:28": "… the bones piled up, a year old…,",
    "dn22:29": "… the bones rotted away to a powder, compares this body with that, thinking : \"This body is of the same nature, will become like that, is not exempt from that fate.′′′",
    "dn22:30": "'And how, monks, does a monk abide contemplating feelings as feelings?[n.654] Cf.n.633, also, for repetition,n.631.Here, a monk feeling a pleasant feeling knows that he feels a pleasant feeling;[n.655]Sukhaṁ vedanaṁ:this can be bodily or mental.",
    "dn22:31": "feeling a painful feeling he knows that he feels a painful feeling;[n.656]Dukkhaṁ vedanaṁ:this too can be bodily or mental.",
    "dn22:32": "feeling a feeling that is neither-painful-nor-pleasant he knows that he feels a feeling that is neither-painful-nor-pleasant;[n.657]Adukkhamasukhaṁ vedanaṁ:this is mental only. In all cases one is simply aware that a feeling is present.",
    "dn22:33": "feeling a pleasant sensual feeling he knows that he feels a pleasant sensual feeling;[n.658]Sāmisaṁ sukham vedanaṁ. Sāmisa = sa-āmisa:lit. 'with flesh', thus approximating to the sense of 'carnal'.",
    "dn22:34": "feeling a pleasant non-sensual feeling he knows that he feels a pleasant non-sensual feeling;[n.659]Nirāmisaṁ sukhaṁ vedanaṁ:'non-carnal' or 'spiritual' (a word Buddhists tend to avoid owing to possibly misleading connotations). InMN 137sāmisaandnirāmisaare referred to the 'household' life and to that of renunciation respectively.",
    "dn22:35": "feeling a painful sensual feeling…;",
    "dn22:36": "feeling a painful non-sensual feeling … ;",
    "dn22:37": "feeling a sensual feeling that is neither-painful-nor-pleasant… ;",
    "dn22:38": "feeling a non-sensual feeling that is neither-painful-nor-pleasant, he knows that he feels a non-sensual feeling that is neither painful-nor-pleasant.'",
    "dn22:39": "'So he abides contemplating feelings as feelings internally. He abides contemplating feelings as feelings externally[n.660] He infers, or knows telepathically, the feelings of others, and then contemplates his own feelings and those of others alternately.… He abides contemplating arising phenomena in the feelings, vanishing phenomena and both arising and vanishing phenomena in the feelings. Or else, mindfulness that \"there is feeling\" is present to him just to the extent necessary for knowledge and awareness. And he abides independent, not clinging to anything in the world. And that, monks, is how a monk abides contemplating feelings as feelings.'",
    "dn22:40": "'And how, monks, does a monk abide contemplating mind as mind?[n.661]Citta:also rendered 'thought' or 'consciousness'. From what follows it is clear that various states of mind are meant. As with feelings, one is at this stage simply aware that certain states of mind are, or are not, present.Here, a monk knows a lustful mind as lustful,",
    "dn22:41": "a mind free from lust as free from lust;",
    "dn22:42": "a hating mind as hating,",
    "dn22:43": "a mind free from hate as free from hate;",
    "dn22:44": "a deluded mind as deluded,",
    "dn22:45": "an undeluded mind as undeluded;",
    "dn22:46": "a contracted mind as contracted,[n.662]Saṅkhittaṁ cittaṁ(from the verbsaṅkhipati:cf.saṅkhittena'in brief'): a mind that is 'contracted' or 'shrunken' by sloth-and-torpor (verse 13) and the like.",
    "dn22:47": "a distracted mind as distracted;[n.663]Vikhittaṁ cittaṁ:a mind distracted by worry-and-flurry (verse 13).",
    "dn22:48": "a developed mind as developed,[n.664]Mahaggataṁ:'grown great' through the lower or higher jhānas.",
    "dn22:49": "an undeveloped mind as undeveloped;[n.665] 'Not grown great', not developed by the jhānas.",
    "dn22:50": "a surpassed mind as surpassed,[n.666]Sa-uttaraṁ:'having (other mental states) surpassing it', is synonymous with the 'undeveloped' mind.",
    "dn22:51": "an unsurpassed mind as unsurpassed;[n.667]An-uttaraṁ:'having no other states surpassing it', might seem to refer to transcendental consciousness, but is referred by DA to mundane states, therefore in effect synonymous with the 'developed' mind. In view of the tautology involved in the last two cases, one might wonder whether the commentarial explanation is correct. But seen.670.",
    "dn22:52": "a concentrated mind as concentrated,[n.668]Samāhitaṁ:having attained samādhi, i.e. jhānic absorption.",
    "dn22:53": "an unconcentrated mind as unconcentrated;[n.669] Not having attained such absorption, thus as in nn.665–6.",
    "dn22:54": "a liberated mind as liberated,[n.670]Vimuttaṁ.This is stated by DA to mean the mind that is temporarily 'freed' either by insight or by jhāna, which suppresses the defilements. Neither is, of course, true and permanent liberation. 'There is no occasion here for the liberations by cutting-off, final stilling(paṭipassaddhi)and final escape(nissaraṇa)': in other words, we are here dealing purely with the mundane world of the beginner in meditation.",
    "dn22:55": "an unliberated mind as unliberated.'",
    "dn22:56": "'So he abides contemplating mind as mind internally. He abides contemplating mind as mind externally[n.671] As inn.660.… He abides contemplating arising phenomena in the mind…Or else, mindfulness that \"there is mind\" is present just to the extent necessary for knowledge and awareness. And he abides detached, not grasping at anything in the world. And that, monks, is how a monk abides contemplating mind as mind.'",
    "dn22:57": "'And how, monks, does a monk abide contemplating mind-objects as mind-objects?′[n.672]Dhammā(cf.n.635). The question is sometimes asked concerning the relation of the four foundations of mindfulness to the schema of the five aggregates(khandhas). The point is explained here by DA as follows: contemplation of body is concerned with the aggregate of materiality or form(rūpakkhandha); contemplation of feelings is concerned with the aggregate of feeling(vedanākkhandha); contemplation of mind is concerned with the aggregate of consciousness(viññāṇa-kkhandha); and contemplation of mind-objects concerns itself with the aggregates of perception and mental formations(saññā-, saṅkhāra-kkhandha).",
    "dn22:58": "Here, monks, if sensual desire[n.673]Kāma-cchanda.The terminology is different from the first statement in verse 12, which refers to a lustful mind(sarāgaṁ cittaṁ), but there is little difference in meaning. Both refer to sensual desire in general, including but by no means confined to sexual desire. It arises, according to DA, from wrong reflection on an object that is agreeable to the senses. In verse 12 the exercise was simply to note the presence of such a state of mind, if it was present. Here one goes further, and investigates how such a state arises, and how it can be got rid of, etc.is present in himself, a monk knows that it is present. If sensual desire is absent in himself, a monk knows that it is absent. And he knows how unarisen sensual desire comes to arise, and he knows how the abandonment of arisen sensual desire comes about, and he knows how the non-arising of the abandoned sensual desire in the future will come about.[n.674] DA lists six methods for getting rid of sensuality: (1) 'Right reflection' on an unpleasing(asubha)object; (2) Developing jhāna, whereby the hindrance is suppressed; (3) Guarding the senses; (4) Moderation in eating; (5) The support of 'good friends'(kalyāṇa-mittatā); (6) Helpful conversation(sappāyakathā).",
    "dn22:59": "'If ill-will[n.675]Vyāpādā.is present in himself, a monk knows that it is present…And he knows how the non-arising of the abandoned ill-will in the future will come about.",
    "dn22:60": "'If sloth-and-torpor[n.676]Thīna-midha.The principal cure for this is the 'perception of light'.is present in himself, a monk knows that it is present… And he knows how the non-arising of the abandoned sloth-and-torpor in the future will come about.",
    "dn22:61": "'If worry-and-flurry[n.677]Uddhacca-kukkucca.is present in himself, a monk knows that it is present… And he knows how the non-arising of the abandoned worry-and-flurry in the future will come about.",
    "dn22:62": "'If doubt[n.678]Vicikicchā.This includes doubt of the Buddha, the Dhamma, the Saṅgha, and also inability to distinguish that which is good from that which is not, etc. (cf. DN 1.2.24), i.e. both scepsis and vacillation.is present in himself, a monk knows that it is present. If doubt is absent in himself, he knows that it is absent. And he knows how unarisen doubt comes to arise, and he knows how the abandonment of arisen doubt comes about, and he knows how the non-arising of the abandoned doubt in the future will come about.'",
    "dn22:63": "'So he abides contemplating mind-objects as mind-objects internally…He abides contemplating arising phenomena in mind-objects[n.679] The factors productive of the hindrances and of their disappearance. On these hindrances, see Nyāṇaponika Thera,The Five Mental Hindrances,Wheel Publ., BPS 1961.… Or else, mindfulness that \"there are mind-objects\" is present just to the extent necessary for knowledge and awareness. And he abides detached, not grasping at anything in the world. And that, monks, is how a monk abides contemplating mind-objects as mind-objects in respect of the five hindrances.'",
    "dn22:64": "'Again, monks, a monk abides contemplating mind-objects as mind-objects in respect of the five aggregates of grasping.[n.680]Pañc'upādāna-kkhandhā:'The 5 aspects in which the Buddha has summed up all the physical and mental phenomena of existence, and which appear to the ignorant man as his Ego, or personality, to wit: (1) the Corporeality group(rūpa-kkhandha)(here called 'Form'), (2) the Feeling(vedanā°), (3) the Perception°(saññā°), (4) the Mental-Formation°(saṅkhāra°), (5) the Consciousness-group(viññāṇa-kkhandha)' (BDic).How does he do so? Here, a monk thinks: \"Such is form,[n.681] Rūpa: cf.n.337.Briefly defined inSN 22.56as 'The four Great Elements (cf. n-70) and corporeality depending on them.'such the arising of form, such the disappearance of form; such is feeling, such the arising of feeling, such the disappearance of feeling; such is perception,[n.682]Saññā.Defined atSN 22.79as 'distinguishing a thing by its marks'.such the arising of perception, such the disappearance of perception; such are the mental formations,[n.683]Sankhāra-kkhandha.The term saṅkhāra has various meanings and as many translations (cf.n.529). Here, it applies to the group of mental formations. Conventionally fifty in number, they embrace various factors including what we term the emotions (i.e. karmic reactions, wholesome or otherwise). The most important one is volition(cetanā), the basis of kamma.such the arising of the mental formations, such the disappearance of the mental formations; such is consciousness,[n.684]Viññāṇa:which is subdivided according to the six senses, mind being the sixth.such the arising of consciousness, such the disappearance of consciousness.''So he abides contemplating mind-objects as mind-objects internally…And he abides detached, not grasping at anything in the world. And that, monks, is how a monk abides contemplating mind-objects as mind-objects in respect of the five aggregates of grasping.'",
    "dn22:65": "'Again, monks, a monk abides contemplating mind-objects as mind-objects in respect of the six internal and external sense-bases.[n.685] For fuller details see BDic under āyatana. They consist, as appears from the following, of sense-base (e.g. eye, mind) and its object (sight-objects, mind-objects).How does he do so?",
    "dn22:66": "Here a monk knows the eye, knows sight-objects,[n.686]Rūpe(acc. pl. ofrūpain this specific sense): 'visible forms, sight-objects'.and he knows whatever fetter arises dependent on the two.[n.687] Ten fetters are listed, which differ slightly from those given in connection with attaining to Stream-Entry, etc., being found in the Abhidhamma. They are: Sensuality, resentment(paṭigha), pride(māna), (wrong) views(diṭṭhi), doubt(vicikicchā), desire for becoming(bhavarāga), attachment to rites and rituals(sīlabbata-parāmāsa), jealousy(issa), avarice(macchariya)and ignorance.And he knows how an unarisen fetter comes to arise, and he knows how the abandonment of an arisen fetter comes about, and he knows how the non-arising of the abandoned fetter in the future will come about.",
    "dn22:67": "He knows the ear and knows sounds …",
    "dn22:68": "He knows the nose, and knows smells …",
    "dn22:69": "He knows the tongue and knows tastes …",
    "dn22:70": "He knows the body[n.688] Here 'body' iskāyain the specific sense of 'body-organ', i.e. the base of tactile contact. See BDic for further details.and knows tangibles …",
    "dn22:71": "He knows the mind and knows mind-objects, and he knows whatever fetter arises dependent on the two. And he knows how an unarisen fetter comes to arise, and he knows how the abandonment of an arisen fetter comes about, and he knows how the non-arising of the abandoned fetter in the future will come about.'",
    "dn22:72": "'So he abides contemplating mind-objects as mind-objects internally… And he abides detached, not grasping at anything in the world. And that, monks, is how a monk abides contemplating mind-objects as mind-objects in respect of the six internal and external sense-bases.'",
    "dn22:73": "'Again, monks, a monk abides contemplating mind-objects as mind-objects in respect of the seven factors of enlightenment.[n.689] Described in detail at, e.g.MN 118.How does he do so? Here, monks, if the enlightenment-factor of mindfulness is present in himself, a monk knows that it is present. If the enlightenment-factor of mindfulness is absent in himself, he knows that it is absent. And he knows how the unarisen enlightenment-factor of mindfulness comes to arise, and he knows how the complete development of the enlightenment-factor of mindfulness comes about.",
    "dn22:74": "If the enlightenment-factor of investigation-of-states[n.690]Dhamma-vicaya:sometimes taken to mean 'investigation of the Doctrine', but the meaning is rather 'investigation of bodily and mental phenomena'.is present in himself…",
    "dn22:75": "If the enlightenment-factor of energy[n.691]Viriya.This corresponds to Right Effort in the Noble Eightfold Path.is present in himself…",
    "dn22:76": "If the enlightenment-factor of delight[n.692]Pīti:a term variously translated. Seen.81.is present in himself…77If the enlightenment-factor of tranquillity[n.693]Passaddhi.is present in himself…78If the enlightenment-factor of concentration is present in himself …79If the enlightenment-factor of equanimity is present in himself, a monk knows that it is present. If the enlightenment-factor of equanimity is absent in himself, he knows that it is absent. And he knows how the unarisen enlightenment-factor of equanimity comes to arise, and he knows how the complete development of the enlightenment-factor of equanimity comes about.'80'So he abides contemplating mind-objects as mind-objects internally…And he abides detached, not grasping at anything in the world. And that, monks, is how a monk abides contemplating mind-objects as mind-objects in respect of the seven factors of enlightenment.'5. The Four Noble Truths81'Again, monks, a monk abides contemplating mind-objects as mind-objects in respect of the Four Noble Truths. How does he do so? Here, a monk knows as it really is: \"This is suffering\"; he knows as it really is: \"This is the origin of suffering\"; he knows as it really is: \"This is the cessation of suffering\"; he knows as it really is: \"This is the way of practice leading to the cessation of suffering.\"The Truth of Suffering82[n.694] Verses 18–21 are not in the parallel version atMN 10.' And what, monks, is the Noble Truth of Suffering? Birth is suffering, ageing is suffering, death is suffering, sorrow, lamentation, pain, sadness and distress are suffering. Being attached to the unloved is suffering, being separated from the loved is suffering, not getting what one wants is suffering. In short, the five aggregates of grasping[n.695] Cf.n.680.are suffering.83'And what, monks, is birth? In whatever beings, of whatever group of beings, there is birth, coming-to-be, coming forth, the appearance of the aggregates, the acquisition of the sense-bases,[n.696]Ayatanānaṁ paṭilābho.According to the formula of dependent origination, these six sense-bases arise dependent on mind-and-body.that, monks, is called birth.84'And what is ageing? In whatever beings, of whatever group of beings, there is ageing, decrepitude, broken teeth, grey hair, wrinkled skin, shrinking with age, decay of the sense-faculties, that, monks, is called ageing.85'And what is death? In whatever beings, of whatever group of beings, there is a passing-away, a removal, a cutting-off, a disappearance, a death, a dying, an ending, a cutting-off of the aggregates, a discarding of the body, that, monks, is called death.86'And what is sorrow? Whenever, by any kind of misfortune, anyone is affected by something of a painful nature, sorrow, mourning, distress, inward grief, inward woe, that, monks, is called sorrow.87'And what is lamentation? Whenever, by any kind of misfortune, anyone is affected by something of a painful nature and there is crying out, lamenting, making much noise for grief, making great lamentation, that, monks, is called lamentation.88'And what is pain? Whatever bodily painful feeling, bodily unpleasant feeling, painful or unpleasant feeling results from bodily contact, that, monks, is called pain.89'And what is sadness?[n.697]Domanassa.Seen.627.Whatever mental painful feeling, mental unpleasant feeling, painful or unpleasant sensation results from mental contact, that, monks, is called sadness.90'And what is distress? Whenever, by any kind of misfortune, anyone is affected by something of a painful nature, distress, great distress, affliction with distress, with great distress, that, monks, is called distress.[n.698]Upāyāsa:usually translated 'despair', which does not at all agree with the definition given here or in PED. 'Despair' means giving up hope, which is not stated here.91'And what, monks, is being attached to the unloved? Here, whoever has unwanted, disliked, unpleasant sight-objects, sounds, smells, tastes, tangibles or mind-objects, or whoever encounters ill-wishers, wishers of harm, of discomfort, of insecurity, with whom they have concourse, intercourse, connection, union, that, monks, is called being attached to the unloved.92'And what is being separated from the loved? Here, whoever has what is wanted, liked, pleasant sight-objects, sounds, smells, tastes, tangibles or mind-objects, or whoever encounters well-wishers, wishers of good, of comfort, of security, mother or father or brother or sister or younger kinsmen or friends or colleagues or blood-relations, and then is deprived of such concourse, intercourse, connection, or union, that, monks, is called being separated from the loved.93'And what is not getting what one wants? In beings subject to birth, monks, this wish arises: \"Oh that we were not subject to birth, that we might not come to birth!\" But this cannot be gained by wishing. That is not getting what one wants. In beings subject to ageing, to disease,[n.699]Vyādhi:omitted in most MSS from the definition at the beginning of this verse, though as disease is such an obvious cause of suffering and occurs in other contexts, the omission is probably accidental, perhaps reflecting a lapse in the tradition of the Digha reciters(bhāṇakas), such as is doubtless responsible for the omission of the six sense-bases in DN 15. Seen.323there.to death, to sorrow, lamentation, pain, sadness and distress this wish arises: \"Oh that we were not subject to ageing… distress, that we might not come to these things!\" But this cannot be gained by wishing. That is not getting what one wants.94'And how, monks, in short, are the five aggregates of grasping suffering? They are as follows: the aggregate of grasping that is form, the aggregate of grasping that is feeling, the aggregate of grasping that is perception, the aggregate of grasping that is the mental formations, the aggregate of grasping that is consciousness,[n.700] Cf.n.680.These are, in short, the five aggregates of grasping that are suffering. And that, monks, is called the Noble Truth of Suffering.The Truth of the Origin of Suffering95'And what, monks, is the Noble Truth of the Origin of Suffering? It is that craving[n.701] Taṇhā.which gives rise to rebirth,[n.702]Ponobhavikā:lit. 'causing again-becoming'.bound up with pleasure and lust, finding fresh delight now here, now there: that is to say sensual craving, craving for existence, and craving for non-existence.[n.703]Vibhava-taṇhā.Vibhava means (1) 'power, success, wealth', and some translators have wrongly taken this meaning here; (2) 'ceasing to become' i.e. extinction. This is undoubtedly the meaning here. But the vibhava meant in this sense is not the higher 'cessation' of Nibbāna, but the materialists' 'extinction' at death (cf. the Freudian 'death-wish').96'And where does this craving arise and establish itself? Wherever in the world there is anything agreeable and pleasurable, there this craving arises and establishes itself.97'And what is there in the world that is agreeable and pleasurable? The eye in the world is agreeable and pleasurable, the ear…, the nose…, the tongue…, the body…, the mind in the world is agreeable and pleasurable, and there this craving arises and establishes itself.98Sights, sounds, smells, tastes, tangibles, mind-objects in the world are agreeable and pleasurable, and there this craving arises and establishes itself.99'Eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, mind-consciousness in the world is agreeable and pleasurable, and there this craving arises and establishes itself.100′Eye-contact,[n.704]Cakkhu-samphassa:the making contact by the eye with its (sight-) object.ear-contact, nose-contact, tongue-contact, body-contact, mind-contact in the world is agreeable and pleasurable, and there this craving arises and establishes itself.101'Feeling born of eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, mind-contact in the world is agreeable and pleasurable, and there this craving arises and establishes itself.102'The perception of sights, of sounds, of smells, of tastes, of tangibles, of mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself.103'Volition in regard to sights, sounds, smells, tastes, tangibles, mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself.104'The craving for sights, sounds, smells, tastes, tangibles, mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself.105′Thinking[n.705]Vitakka:cf.n.611.of sights, sounds, smells, tastes, tangibles, mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself.106′Pondering[n.706]Vicāra:cf.n.611.on sights, sounds, smells, tastes, tangibles and mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself. And that, monks, is called the Noble Truth of the Origin of Suffering.The Truth of the End of Suffering107'And what, monks, is the Noble Truth of the Cessation of Suffering? It is the complete fading-away and extinction of this craving, its forsaking and abandonment, liberation from it, detachment from it.[n.707] Interestingly, it is left to the commentary to point out that the positive meaning of this is Nibbāna.108And how does this craving come to be abandoned, how does its cessation come about?'Wherever in the world there is anything agreeable and pleasurable, there its cessation comes about.109–110And what is there in the world that is agreeable and pleasurable?'The eye in the world is agreeable and pleasurable, the ear …, the nose…, the tongue…, the body…, the mind in the world is agreeable and pleasurable, and there this craving comes to be abandoned, there its cessation comes about:111Eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, mind-consciousness in the world is agreeable and pleasurable, and there this craving comes to be abandoned, there its cessation comes about.112'Sights, sounds, smells, tastes, tangibles, mind-objects in the world are agreeable and pleasurable, and there this craving comes to be abandoned, there its cessation comes about.113'Eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, mind-contact … ;114… the perception of sights, sounds, smells, tastes, tangibles, mind-objects…;115… volition in regard to sights, sounds, smells, tastes, tangibles, mind-objects…;116… craving for sights, sounds, smells, tastes, tangibles, mind-objects…;117… thinking of sights, sounds, smells, tastes, tangibles, mind-objects…;118… pondering on sights, sounds, smells, tastes, tangibles and mind-objects in the world is agreeable and pleasurable, and there this craving comes to an end, there its cessation comes about. And that, monks, is called the Noble Truth of the Cessation of Suffering.Truth of the Path Leading to the End of Suffering119'And what, monks, is the Noble Truth of the Way of Practice Leading to the Cessation of Suffering? It is just this Noble Eightfold Path, namely: — Right View, Right Thought; Right Speech, Right Action, Right Livelihood; Right Effort Right Mindfulness, Right Concentration.120'And what, monks, is Right View?[n.708]Sammā-diṭṭhi.This, or 'Right Seeing' is the literal rendering ('Right Vision' would be an unwise rendering, because liable to be misleading!). Diṭṭhi here is a singular, and denotes 'seeing things as they really are', whereas 'views' in the plural are always wrong. It should be noted that when not prefixed with the word sammā, diṭṭhi means 'speculative opinions', and the like, which are not based on 'seeing things as they really are'. The formal opposite of sammā-diṭṭhi is micchā-diṭṭhi, a term generally reserved for especially pernicious views (cf.n.245). Sammā-diṭṭhi and the rest are sometimes rendered 'Perfect View', and so on, but this only refers to the supramundane path as described inMN 117.It is, monks, the knowledge of suffering, the knowledge of the origin of suffering, the knowledge of the cessation of suffering, and the knowledge of the way of practice leading to the cessation of suffering. This is called Right View.121'And what, monks, is Right Thought?[n.709]Sammā-saṅkappa:variously rendered as 'right aspiration, right motive', etc.The thought of renunciation, the thought of non-ill-will, the thought of harmlessness. This, monks, is called Right Thought.122'And what, monks, is Right Speech? Refraining from lying, refraining from slander, refraining from harsh speech, refraining from frivolous speech. This is called Right Speech.123'And what, monks, is Right Action? Refraining from taking life, refraining from taking what is not given, refraining from sexual misconduct. This is called Right Action.124'And what, monks, is Right Livelihood? Here, monks, the Ariyan disciple, having given up wrong livelihood, keeps himself by right livelihood.125'And what, monks, is Right Effort? Here, monks, a monk rouses his will, makes an effort, stirs up energy, exerts his mind and strives to prevent the arising of unarisen evil unwholesome mental states. He rouses his will… and strives to overcome evil unwholesome mental states that have arisen. He rouses his will… and strives to produce unarisen wholesome mental states. He rouses his will, makes an effort, stirs up energy, exerts his mind and strives to maintain wholesome mental states that have arisen, not to let them fade away, to bring them to greater growth, to the full perfection of development. This is called Right Effort.126'And what, monks, is Right Mindfulness? Here, monks, a monk abides contemplating body as body, ardent, clearly aware and mindful, having put aside hankering and fretting for the world; he abides contemplating feelings as feelings…; he abides contemplating mind as mind…; he abides contemplating mind-objects as mind-objects, ardent, clearly aware and mindful, having put aside hankering and fretting for the world. This is called Right Mindfulness.127'And what, monks, is Right Concentration? Here, a monk, detached from sense-desires, detached from unwholesome mental states, enters and remains in the first jhāna, which is with thinking and pondering, born of detachment, filled with delight and joy. And with the subsiding of thinking and pondering, by gaining inner tranquillity and oneness of mind, he enters and remains in the second jhāna, which is without thinking and pondering, born of concentration, filled with delight and joy. And with the fading away of delight, remaining imperturbable, mindful and clearly aware, he experiences in himself the joy of which the Noble Ones say: \"Happy is he who dwells with equanimity and mindfulness\", he enters the third jhāna. And, having given up pleasure and pain, and with the disappearance of former gladness and sadness, he enters and remains in the fourth jhāna, which is beyond pleasure and pain, and purified by equanimity and mindfulness. This is called Right Concentration. And that, monks, is called the way of practice leading to the cessation of suffering.'128'So he abides contemplating mind-objects as mind-objects internally, contemplating mind-objects as mind-objects externally, contemplating mind-objects as mind-objects both internally and externally. He abides contemplating arising phenomena in mind-objects, he abides contemplating vanishing-phenomena in mind-objects, he abides contemplating both arising and vanishing phenomena in mind-objects. Or else, mindfulness that \"there are mind-objects\" is present just to the extent necessary for knowledge and awareness. And he abides detached, not grasping at anything in the world. And that, monks, is how a monk abides contemplating mind-objects as mind-objects in respect of the Four Noble Truths.'Conclusion129'Whoever, monks, should practise these four foundations of mindfulness for just seven years may expect one of two results: either Arahantship in this life or, if there should be some substrate left, the state of a Non-Returner.130Let alone seven years — whoever should practise them for just six years …, five years…, four years… three years…, two years…, one year may expect one of two results…; let alone one year —131… whoever should practise them for just seven months…, six months…, five months …, four months…, three months…, two months…, one month…, half a month may expect one of two results…; let alone half a month — whoever should practise these four foundations of mindfulness for just one week may expect one of two results: either Arahantship in this life or, if there should be some substrate left, the state of a Non-Returner.132'It was said: \"There is, monks, this one way to the purification of beings, for the overcoming of sorrow and distress, for the disappearance of pain and sadness, for the gaining of the right path, for the realisation of Nibbāna: — that is to say the four foundations of mindfulness\", and it is for this reason that it was said.'133Thus the Lord spoke, and the monks rejoiced and were delighted at his words.",
    "dn22:77": "If the enlightenment-factor of tranquillity[n.693]Passaddhi.is present in himself…",
    "dn22:78": "If the enlightenment-factor of concentration is present in himself …",
    "dn22:79": "If the enlightenment-factor of equanimity is present in himself, a monk knows that it is present. If the enlightenment-factor of equanimity is absent in himself, he knows that it is absent. And he knows how the unarisen enlightenment-factor of equanimity comes to arise, and he knows how the complete development of the enlightenment-factor of equanimity comes about.'",
    "dn22:80": "'So he abides contemplating mind-objects as mind-objects internally…And he abides detached, not grasping at anything in the world. And that, monks, is how a monk abides contemplating mind-objects as mind-objects in respect of the seven factors of enlightenment.'",
    "dn22:81": "'Again, monks, a monk abides contemplating mind-objects as mind-objects in respect of the Four Noble Truths. How does he do so? Here, a monk knows as it really is: \"This is suffering\"; he knows as it really is: \"This is the origin of suffering\"; he knows as it really is: \"This is the cessation of suffering\"; he knows as it really is: \"This is the way of practice leading to the cessation of suffering.\"",
    "dn22:82": "[n.694] Verses 18–21 are not in the parallel version atMN 10.' And what, monks, is the Noble Truth of Suffering? Birth is suffering, ageing is suffering, death is suffering, sorrow, lamentation, pain, sadness and distress are suffering. Being attached to the unloved is suffering, being separated from the loved is suffering, not getting what one wants is suffering. In short, the five aggregates of grasping[n.695] Cf.n.680.are suffering.",
    "dn22:83": "'And what, monks, is birth? In whatever beings, of whatever group of beings, there is birth, coming-to-be, coming forth, the appearance of the aggregates, the acquisition of the sense-bases,[n.696]Ayatanānaṁ paṭilābho.According to the formula of dependent origination, these six sense-bases arise dependent on mind-and-body.that, monks, is called birth.",
    "dn22:84": "'And what is ageing? In whatever beings, of whatever group of beings, there is ageing, decrepitude, broken teeth, grey hair, wrinkled skin, shrinking with age, decay of the sense-faculties, that, monks, is called ageing.",
    "dn22:85": "'And what is death? In whatever beings, of whatever group of beings, there is a passing-away, a removal, a cutting-off, a disappearance, a death, a dying, an ending, a cutting-off of the aggregates, a discarding of the body, that, monks, is called death.",
    "dn22:86": "'And what is sorrow? Whenever, by any kind of misfortune, anyone is affected by something of a painful nature, sorrow, mourning, distress, inward grief, inward woe, that, monks, is called sorrow.",
    "dn22:87": "'And what is lamentation? Whenever, by any kind of misfortune, anyone is affected by something of a painful nature and there is crying out, lamenting, making much noise for grief, making great lamentation, that, monks, is called lamentation.",
    "dn22:88": "'And what is pain? Whatever bodily painful feeling, bodily unpleasant feeling, painful or unpleasant feeling results from bodily contact, that, monks, is called pain.",
    "dn22:89": "'And what is sadness?[n.697]Domanassa.Seen.627.Whatever mental painful feeling, mental unpleasant feeling, painful or unpleasant sensation results from mental contact, that, monks, is called sadness.",
    "dn22:90": "'And what is distress? Whenever, by any kind of misfortune, anyone is affected by something of a painful nature, distress, great distress, affliction with distress, with great distress, that, monks, is called distress.[n.698]Upāyāsa:usually translated 'despair', which does not at all agree with the definition given here or in PED. 'Despair' means giving up hope, which is not stated here.",
    "dn22:91": "'And what, monks, is being attached to the unloved? Here, whoever has unwanted, disliked, unpleasant sight-objects, sounds, smells, tastes, tangibles or mind-objects, or whoever encounters ill-wishers, wishers of harm, of discomfort, of insecurity, with whom they have concourse, intercourse, connection, union, that, monks, is called being attached to the unloved.",
    "dn22:92": "'And what is being separated from the loved? Here, whoever has what is wanted, liked, pleasant sight-objects, sounds, smells, tastes, tangibles or mind-objects, or whoever encounters well-wishers, wishers of good, of comfort, of security, mother or father or brother or sister or younger kinsmen or friends or colleagues or blood-relations, and then is deprived of such concourse, intercourse, connection, or union, that, monks, is called being separated from the loved.",
    "dn22:93": "'And what is not getting what one wants? In beings subject to birth, monks, this wish arises: \"Oh that we were not subject to birth, that we might not come to birth!\" But this cannot be gained by wishing. That is not getting what one wants. In beings subject to ageing, to disease,[n.699]Vyādhi:omitted in most MSS from the definition at the beginning of this verse, though as disease is such an obvious cause of suffering and occurs in other contexts, the omission is probably accidental, perhaps reflecting a lapse in the tradition of the Digha reciters(bhāṇakas), such as is doubtless responsible for the omission of the six sense-bases in DN 15. Seen.323there.to death, to sorrow, lamentation, pain, sadness and distress this wish arises: \"Oh that we were not subject to ageing… distress, that we might not come to these things!\" But this cannot be gained by wishing. That is not getting what one wants.",
    "dn22:94": "'And how, monks, in short, are the five aggregates of grasping suffering? They are as follows: the aggregate of grasping that is form, the aggregate of grasping that is feeling, the aggregate of grasping that is perception, the aggregate of grasping that is the mental formations, the aggregate of grasping that is consciousness,[n.700] Cf.n.680.These are, in short, the five aggregates of grasping that are suffering. And that, monks, is called the Noble Truth of Suffering.",
    "dn22:95": "'And what, monks, is the Noble Truth of the Origin of Suffering? It is that craving[n.701] Taṇhā.which gives rise to rebirth,[n.702]Ponobhavikā:lit. 'causing again-becoming'.bound up with pleasure and lust, finding fresh delight now here, now there: that is to say sensual craving, craving for existence, and craving for non-existence.[n.703]Vibhava-taṇhā.Vibhava means (1) 'power, success, wealth', and some translators have wrongly taken this meaning here; (2) 'ceasing to become' i.e. extinction. This is undoubtedly the meaning here. But the vibhava meant in this sense is not the higher 'cessation' of Nibbāna, but the materialists' 'extinction' at death (cf. the Freudian 'death-wish').",
    "dn22:96": "'And where does this craving arise and establish itself? Wherever in the world there is anything agreeable and pleasurable, there this craving arises and establishes itself.",
    "dn22:97": "'And what is there in the world that is agreeable and pleasurable? The eye in the world is agreeable and pleasurable, the ear…, the nose…, the tongue…, the body…, the mind in the world is agreeable and pleasurable, and there this craving arises and establishes itself.",
    "dn22:98": "Sights, sounds, smells, tastes, tangibles, mind-objects in the world are agreeable and pleasurable, and there this craving arises and establishes itself.",
    "dn22:99": "'Eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, mind-consciousness in the world is agreeable and pleasurable, and there this craving arises and establishes itself.",
    "dn22:100": "′Eye-contact,[n.704]Cakkhu-samphassa:the making contact by the eye with its (sight-) object.ear-contact, nose-contact, tongue-contact, body-contact, mind-contact in the world is agreeable and pleasurable, and there this craving arises and establishes itself.",
    "dn22:101": "'Feeling born of eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, mind-contact in the world is agreeable and pleasurable, and there this craving arises and establishes itself.",
    "dn22:102": "'The perception of sights, of sounds, of smells, of tastes, of tangibles, of mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself.",
    "dn22:103": "'Volition in regard to sights, sounds, smells, tastes, tangibles, mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself.",
    "dn22:104": "'The craving for sights, sounds, smells, tastes, tangibles, mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself.",
    "dn22:105": "′Thinking[n.705]Vitakka:cf.n.611.of sights, sounds, smells, tastes, tangibles, mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself.",
    "dn22:106": "′Pondering[n.706]Vicāra:cf.n.611.on sights, sounds, smells, tastes, tangibles and mind-objects in the world is agreeable and pleasurable, and there this craving arises and establishes itself. And that, monks, is called the Noble Truth of the Origin of Suffering.",
    "dn22:107": "'And what, monks, is the Noble Truth of the Cessation of Suffering? It is the complete fading-away and extinction of this craving, its forsaking and abandonment, liberation from it, detachment from it.[n.707] Interestingly, it is left to the commentary to point out that the positive meaning of this is Nibbāna.",
    "dn22:108": "And how does this craving come to be abandoned, how does its cessation come about?",
    "dn22:109–110": "And what is there in the world that is agreeable and pleasurable?",
    "dn22:111": "Eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, mind-consciousness in the world is agreeable and pleasurable, and there this craving comes to be abandoned, there its cessation comes about.",
    "dn22:112": "'Sights, sounds, smells, tastes, tangibles, mind-objects in the world are agreeable and pleasurable, and there this craving comes to be abandoned, there its cessation comes about.",
    "dn22:113": "'Eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, mind-contact … ;",
    "dn22:114": "… the perception of sights, sounds, smells, tastes, tangibles, mind-objects…;",
    "dn22:115": "… volition in regard to sights, sounds, smells, tastes, tangibles, mind-objects…;",
    "dn22:116": "… craving for sights, sounds, smells, tastes, tangibles, mind-objects…;",
    "dn22:117": "… thinking of sights, sounds, smells, tastes, tangibles, mind-objects…;",
    "dn22:118": "… pondering on sights, sounds, smells, tastes, tangibles and mind-objects in the world is agreeable and pleasurable, and there this craving comes to an end, there its cessation comes about. And that, monks, is called the Noble Truth of the Cessation of Suffering.",
    "dn22:119": "'And what, monks, is the Noble Truth of the Way of Practice Leading to the Cessation of Suffering? It is just this Noble Eightfold Path, namely: — Right View, Right Thought; Right Speech, Right Action, Right Livelihood; Right Effort Right Mindfulness, Right Concentration.",
    "dn22:120": "'And what, monks, is Right View?[n.708]Sammā-diṭṭhi.This, or 'Right Seeing' is the literal rendering ('Right Vision' would be an unwise rendering, because liable to be misleading!). Diṭṭhi here is a singular, and denotes 'seeing things as they really are', whereas 'views' in the plural are always wrong. It should be noted that when not prefixed with the word sammā, diṭṭhi means 'speculative opinions', and the like, which are not based on 'seeing things as they really are'. The formal opposite of sammā-diṭṭhi is micchā-diṭṭhi, a term generally reserved for especially pernicious views (cf.n.245). Sammā-diṭṭhi and the rest are sometimes rendered 'Perfect View', and so on, but this only refers to the supramundane path as described inMN 117.It is, monks, the knowledge of suffering, the knowledge of the origin of suffering, the knowledge of the cessation of suffering, and the knowledge of the way of practice leading to the cessation of suffering. This is called Right View.",
    "dn22:121": "'And what, monks, is Right Thought?[n.709]Sammā-saṅkappa:variously rendered as 'right aspiration, right motive', etc.The thought of renunciation, the thought of non-ill-will, the thought of harmlessness. This, monks, is called Right Thought.",
    "dn22:122": "'And what, monks, is Right Speech? Refraining from lying, refraining from slander, refraining from harsh speech, refraining from frivolous speech. This is called Right Speech.",
    "dn22:123": "'And what, monks, is Right Action? Refraining from taking life, refraining from taking what is not given, refraining from sexual misconduct. This is called Right Action.",
    "dn22:124": "'And what, monks, is Right Livelihood? Here, monks, the Ariyan disciple, having given up wrong livelihood, keeps himself by right livelihood.",
    "dn22:125": "'And what, monks, is Right Effort? Here, monks, a monk rouses his will, makes an effort, stirs up energy, exerts his mind and strives to prevent the arising of unarisen evil unwholesome mental states. He rouses his will… and strives to overcome evil unwholesome mental states that have arisen. He rouses his will… and strives to produce unarisen wholesome mental states. He rouses his will, makes an effort, stirs up energy, exerts his mind and strives to maintain wholesome mental states that have arisen, not to let them fade away, to bring them to greater growth, to the full perfection of development. This is called Right Effort.",
    "dn22:126": "'And what, monks, is Right Mindfulness? Here, monks, a monk abides contemplating body as body, ardent, clearly aware and mindful, having put aside hankering and fretting for the world; he abides contemplating feelings as feelings…; he abides contemplating mind as mind…; he abides contemplating mind-objects as mind-objects, ardent, clearly aware and mindful, having put aside hankering and fretting for the world. This is called Right Mindfulness.",
    "dn22:127": "'And what, monks, is Right Concentration? Here, a monk, detached from sense-desires, detached from unwholesome mental states, enters and remains in the first jhāna, which is with thinking and pondering, born of detachment, filled with delight and joy. And with the subsiding of thinking and pondering, by gaining inner tranquillity and oneness of mind, he enters and remains in the second jhāna, which is without thinking and pondering, born of concentration, filled with delight and joy. And with the fading away of delight, remaining imperturbable, mindful and clearly aware, he experiences in himself the joy of which the Noble Ones say: \"Happy is he who dwells with equanimity and mindfulness\", he enters the third jhāna. And, having given up pleasure and pain, and with the disappearance of former gladness and sadness, he enters and remains in the fourth jhāna, which is beyond pleasure and pain, and purified by equanimity and mindfulness. This is called Right Concentration. And that, monks, is called the way of practice leading to the cessation of suffering.'",
    "dn22:128": "'So he abides contemplating mind-objects as mind-objects internally, contemplating mind-objects as mind-objects externally, contemplating mind-objects as mind-objects both internally and externally. He abides contemplating arising phenomena in mind-objects, he abides contemplating vanishing-phenomena in mind-objects, he abides contemplating both arising and vanishing phenomena in mind-objects. Or else, mindfulness that \"there are mind-objects\" is present just to the extent necessary for knowledge and awareness. And he abides detached, not grasping at anything in the world. And that, monks, is how a monk abides contemplating mind-objects as mind-objects in respect of the Four Noble Truths.'",
    "dn22:129": "'Whoever, monks, should practise these four foundations of mindfulness for just seven years may expect one of two results: either Arahantship in this life or, if there should be some substrate left, the state of a Non-Returner.",
    "dn22:130": "Let alone seven years — whoever should practise them for just six years …, five years…, four years… three years…, two years…, one year may expect one of two results…; let alone one year —",
    "dn22:131": "… whoever should practise them for just seven months…, six months…, five months …, four months…, three months…, two months…, one month…, half a month may expect one of two results…; let alone half a month — whoever should practise these four foundations of mindfulness for just one week may expect one of two results: either Arahantship in this life or, if there should be some substrate left, the state of a Non-Returner.",
    "dn22:132": "'It was said: \"There is, monks, this one way to the purification of beings, for the overcoming of sorrow and distress, for the disappearance of pain and sadness, for the gaining of the right path, for the realisation of Nibbāna: — that is to say the four foundations of mindfulness\", and it is for this reason that it was said.'",
    "dn22:133": "Thus the Lord spoke, and the monks rejoiced and were delighted at his words."
}