{
    "dn24:1": "Thus have I heard.[n.732] With this Sutta, the third and final division of the Nikaya starts. It is curious that this division is named after one of the poorest texts in the whole Nikaya, but this probably has little significance other than mnemonic. But the Sutta itself is misnamed, since its ‘anti-hero’ (if that dubious distinction does not rather belong to the wretched Sunakkhatta!) is actually referred to as Patikaputta or ‘Patika’s son’, and his own name is unrecorded. PerhapsPāṭikasuttastands, by a kind of haplology, for*Pāṭikaputtasutta.Once the Lord was staying among the Mallas. Anupiya is the name of a Malla town, and the Lord, having dressed in the early morning and taken his robe and bowl, went to Anupiya for alms. Then he thought: ‘It is too early for me to go into Anupiya for alms. Suppose I were to visit the hermitage[n.733]Ārāma:lit. ‘pleasure’, hence a pleasure-park. It came to be used for such parks as were presented to the Buddha, or to other ‘ascetics and Brahmins’. Hence its modem sense of ‘temple-complex, monastery-complex’.of the wanderer Bhaggava-gotta?’ And he did so.",
    "dn24:2": "And the wanderer Bhaggava-gotta said: 'Come, Blessed Lord, welcome, Blessed Lord! At last the Blessed Lord has gone out of his way to come here. Be seated, Lord, a seat is prepared.' The Lord sat down on the prepared seat, and Bhaggava took a low stool and sat down to one side. Then he said: 'Lord, a few days ago Sunakkhatta the Licchave[n.734] First mentioned at DN 6.5. His name, most inappropriately, means 'born under a lucky star'.came to me and said: \"Bhaggava, I have left the Blessed Lord. I am no longer under his rule.\" Is that really so, Lord?' 'It is true, Bhaggava.[n.735] His personal name was Channa, but the Buddha addresses him by his 'surname' (cf.n.179). His clan seem to have been potters.",
    "dn24:3": "'A few days ago, Sunakkhatta came to me, saluted me, sat down to one side, and said: \"Lord, I am leaving the Blessed Lord, I am no longer under the Lord's rule.\" So I said to him: \"Well, Sunakkhatta, did I ever say to you: 'Come, Sunakkhatta, be under my rule'?\" \"No, Lord.\" \"Or did you ever say to me: 'Lord, I will be under your rule'?\" \"No, Lord.\" \"So, Sunakkhatta, if I did not say that to you and you did not say that to me — you foolish man, who are you and what are you giving up? Consider, foolish man, how far the fault is yours.\"",
    "dn24:4": "\"'Well, Lord, you have not performed any miracles.\"[n.736] Cf. DN 11.5, where the performance of 'miracles' is condemned by the Buddha (as it is here too, though he text goes on to contradict the Master's words). On the significance of this for dating the Sutta, RD's wise words should be noted (p. 3): 'We are not entitled on these facts to suppose that the Patika Suttanta was either later or earlier than the Kevaddha … The editors may have been tolerant of whichever of the opposing views they did not share.' Those who seek to establish chronological criteria should bear such considerations in mind.\"And did I ever say to you: 'Come under my rule, Sunakkhatta, and I will perform miracles for you'?\" \"No, Lord.\" \"Or did you ever say to me: 'Lord, I will be under your rule if you will perform miracles for me'?\" \"No, Lord.\" \"Then it appears, Sunakkhatta, that I made no such promises, and you made no such conditions. Such being the case, you foolish man, who are you and what are you giving up?",
    "dn24:5": "\"'Well, Lord, you do not teach the beginning of things.\"",
    "dn24:6": "\"And did I ever say to you: 'Come under my rule, Sunakkhatta, and I will teach you the beginning of things'?\" \"No, Lord.\" …",
    "dn24:7": "Such being the case, you foolish man, who are you and what are you giving up?",
    "dn24:8": "'\"Sunakkhatta, you have in many ways spoken in praise of me among the Vajjians, saying: 'This Blessed Lord is an Arahant, a fully-enlightened Buddha, endowed with wisdom and conduct, the Well-Farer, Knower of the worlds, incomparable Trainer of men to be tamed, Teacher of gods and humans, the Buddha, the Blessed Lord.'",
    "dn24:9": "You have in many ways spoken in praise of the Dhamma, saying: 'Well-proclaimed by the Blessed Lord is the Dhamma, visible here and now, timeless, inviting inspection, leading onward, to be realised by the wise, each one for himself.'",
    "dn24:10": "You have in many ways spoken in praise of the order of monks, saying: 'Well-trained is the order of the Lord's disciples, trained in uprightness, methodically-trained, excellently-trained is the order of the Lord's disciples, that is, the four pairs of men, the eight classes of individuals. This is the order of the Lord's disciples, worthy of respect, worthy of homage, worthy of gifts, worthy of salutation, an unsurpassed field in the world for merit.'",
    "dn24:11": "'\"In these ways you have spoken in praise of me, of the Dhamma, and of the order among the Vajjians. And I say to you, I declare to you, Sunakkhatta, there will be those who will say: 'Sunakkhatta the Licchavi was unable to maintain the holy life under the ascetic Gotama, and being thus unable he abandoned the training and reverted to a base life.'[n.738]Hīnāy' āvatto.That, Sunakkhatta, is what they will say.\"",
    "dn24:12": "And, Bhaggava, at my words Sunakkhatta left this Dhamma and discipline like one condemned to hell.",
    "dn24:13": "'Once, Bhaggava, I was staying among the Khulus,[n.740] The name is doubtful. RD has 'Bumus'. I follow DA.at a place called Uttarakā, a town of theirs. In the early morning I went with robe and bowl into Uttarakā for alms, with Sunakkhatta as my attendant. And at that time the naked ascetic Korakkhattiya the \"dog-man\"[n.xxx]A dog-ascetic like Seniya inMN 57, who was told by the Buddha that if he persisted in this practice he would be reborn either in hell or 'in the company of dogs'.was going round on all fours, sprawling on the ground, and chewing and eating his food with his mouth alone. Seeing him, Sunakkhatta thought: \"Now that is a real Arahant ascetic, who goes round on all fours, sprawling on the ground, and chewing and eating his food with his mouth alone.\"",
    "dn24:14": "And I, knowing his thought in my own mind, said to him: \"You foolish man, do you claim to be a follower of the Sakyan?\" \"Lord, what do you mean by this question?\" \"Sunakkhatta, did you not, on seeing that naked ascetic going around on all fours, think: 'Now that is a real Arahant ascetic, who goes round on all fours, sprawling on the ground, and chewing and eating his food with his mouth alone'?\" \"I did, Lord. Does the Blessed Lord begrudge others their Arahantship?\"",
    "dn24:15": "\"I do not begrudge others their Arahantship, you foolish man! It is only in you that this evil view has arisen. Cast it aside lest it should be to your harm and sorrow for a long time! This naked ascetic Korakkhattiya, whom you regard as a true Arahant, will die in seven days from indigestion,[n.741]Alasakena.RD has 'of epilepsy', for which there seems to be no evidence. The sub-commentary and Buddhadatta's dictionary suggest 'indigestion', which seems not unreasonable.and when he is dead he will reappear among the Kālakañja asuras, who are the very lowest grade of asuras.[n.742] Seen.512.The Kalakañjas, described as 'terrible to see', are mentioned in DN 20.12.And when he is dead he will be cast aside on a heap of bīraṇa-grass in the charnel-ground. If you want to, Sunakkhatta, you can go to him and ask him if he knows his fate. And it may be that he will tell you: 'Friend Sunakkhatta, I know my fate. I have been reborn among the Kālakañja asuras, the very lowest grade of asuras.'\"",
    "dn24:16": "'Then Sunakkhatta went to Korakkhattiya and told him what I had prophesied, adding: \"Therefore, friend Korakkhattiya, be very careful what you eat and drink, so that the ascetic Gotama's words may be proved wrong!\"",
    "dn24:17": "And Sunakkhatta was so sure that the Tathāgata's words would be proved wrong that he counted up the seven days one by one. But on the seventh day Korakkhattiya died of indigestion, and when he was dead he reappeared among the Kālakañja asuras, and his body was cast aside on a heap of bīraṇa-grass in the charnel-ground.",
    "dn24:18": "'And Sunakkhatta heard of this, so he went to the heap of bīraṇa-grass in the charnel-ground where Korakkhattiya was lying, struck the body three times with his hand, and said: \"Friend Korakkhattiya, do you know your fate?\" And Korakkhattiya sat up and rubbed his back with his hand, and said: \"Friend Sunakkhatta, I know my fate. I have been reborn among the Kālakañja asuras, the very lowest grade of asuras.\" And with that, he fell back again.",
    "dn24:19": "'Then Sunakkhatta came to me, saluted me, and sat down to one side. And I said to him: \"Well, Sunakkhatta, what do you think? Has what I told you about the 'dog-man' Korakkhattiya come true or not?\" \"It has come about the way you said, Lord, and not otherwise.\" \"Well, what do you think, Sunakkhatta? Has a miracle been performed or not?\" \"Certainly, Lord, this being so, a miracle has been performed, and not otherwise.\" \"Well then, you foolish man, do you still say to me, after I have performed such a miracle: 'Well, Lord, you have not performed any miracles'? Consider, you foolish man, how far the fault is yours.\" And at my words Sunakkhatta left this Dhamma and discipline like one condemned to hell.",
    "dn24:20": "'Once, Bhaggava, I was staying at Vesālī, at the Gabled Hall in the Great Forest. And at that time there was a naked ascetic living in Vesālī called Kaḷāramuṭṭhaka[n.743] The form of this name is doubtful. RD has Kandaramasuka. Again, I follow DA.who enjoyed great gains and fame in the Vajjian capital. He had undertaken seven rules of practice: \"As long as I live I will be a naked ascetic and will not put on any clothes; as long as I live I will remain chaste and abstain from sexual intercourse; as long as I live I will subsist on strong drink and meat, abstaining from boiled rice and sour milk; as long as I live I will never go beyond the Udena shrine to the east of Vesāli, the Gotamaka shrine to the south, the Sattamba shrine to the west, nor the Bahuputta shrine to the north.\"[n.744] For these, see DN 16.3.2 and notes there.And it was through having undertaken these seven rules that he enjoyed the greatest gains and fame of all in the Vajjian capital.",
    "dn24:21": "'Now Sunakkhatta went to see Kaḷāramuṭṭhaka and asked him a question which he could not answer, and because he could not answer it he showed signs of anger, rage and petulance. But Sunakkhatta thought: \"I might cause this real Arahant ascetic offence. I don't want anything to happen that would be to my lasting harm and misfortune!\"",
    "dn24:22": "'Then Sunakkhatta came to me, saluted me, and sat down to one side. I said to him: \"You foolish man, do you claim to be a follower of the Sakyan?\" \"Lord, what do you mean by this question?\" \"Sunakkhatta, did you not go to see Kaḷāramuṭṭhaka and ask him a question he could not answer, and did he not thereupon show signs of anger, rage and petulance? And did you not think: 'I might cause this real Arahant ascetic offence. I don't want anything to happen that would be to my lasting harm and misfortune'?\" \"I did, Lord. Does the Blessed Lord begrudge others their Arahantship?\"",
    "dn24:23": "\"I do not begrudge others their Arahantship, you foolish man. It is only in you that this evil view has arisen. Cast it aside lest it should be to your harm and sorrow for a long time! This naked ascetic Kaḷāramuṭṭhaka, whom you regard as a true Arahant, will before long be living clothed and married, subsisting on boiled rice and sour milk. He will go beyond all the shrines of Vesālī, and will die having entirely lost his reputation.\"",
    "dn24:24": "And indeed all this came about.",
    "dn24:25": "'Then Sunakkhatta, having heard what had happened, came to me…And I said: \"Well, Sunakkhatta, what do you think? Has what I told you about Kaḷaramuṭṭhaka come about, or not? … Has a miracle been performed or not?\" … And at my words Sunakkhatta left this Dhamma and discipline like one condemned to hell.",
    "dn24:26": "'Once, Bhaggava, I was staying at Vesālī in the Gabled Hall in the Great Forest. And at that time there was a naked ascetic living in Vesālī called Patikaputta, who enjoyed great gains and fame in the Vajjian capital. And he made this declaration in the assembly of Vesālī: \"The ascetic Gotama claims to be a man of wisdom, and I make the same claim. It is right that a man of wisdom should show it by performing miracles. If the ascetic Gotama will come half-way to meet me, I will do likewise. Then we could both work miracles, and if the ascetic Gotama performs one miracle, I will perform two. If he performs two, I will perform four. And if he performs four, I will perform eight. However many miracles the ascetic Gotama performs, I will perform twice as many!\"",
    "dn24:27": "'Then Sunakkhatta came to me, saluted me, sat down to one side, and told me what Patikaputta had said.",
    "dn24:28": "I said: \"Sunakkhatta, that naked ascetic Patikaputta is not capable of meeting me face to face unless he takes back his words, abandons that thought, and gives up that view. And if he thinks otherwise, his head will split in pieces.\"[n.745] A curious threat that (as RD observes) never comes to anything, and is of course pre-Buddhist.",
    "dn24:29": "'\"Lord, let the Blessed Lord have a care what he says, let the Well-Farer have a care what he says!\" \"What do you mean by saying that to me?\" \"Lord, the Blessed Lord might make an absolute statement about Patikaputta's coming. But he might come in some altered shape, and thus falsify the Blessed Lord's words!\"",
    "dn24:30": "'\"But, Sunakkhatta, would the Tathagata make any statement that was ambiguous?\"",
    "dn24:31": "\"Lord, does the Blessed Lord know by his own mind what would happen to Patikaputta?",
    "dn24:32": "Or has some deva told the Tathagata?\"",
    "dn24:33": "\"Sunakkhatta, I know it by my own mind, and I have also been told by a deva.",
    "dn24:34": "For Ajita, the general of the Licchavis, died the other day and has been reborn in the company of the Thirty-Three Gods. He came to see me and told me: 'Lord, Patikaputta the naked ascetic is an impudent liar! He declared in the Vajjian capital: \"Ajita, the general of the Licchavis, has been reborn in the great hell!\"",
    "dn24:35–36": "But I have not been reborn in the great hell, but in the company of the Thirty-Three Gods. He is an impudent liar…'",
    "dn24:37": "Thus, Sunakkhatta, I know what I have said by my own mind, but I have also been told by a deva. And now, Sunakkhatta, I will go into Vesālī for alms. On my return, after I have eaten, I will go for my midday rest to Pāṭikaputta's park. You may tell him whatever you wish.\"",
    "dn24:38": "'Then, having dressed, I took my robe and bowl and went into Vesālī for alms. On my return I went to Patikaputta's park for my midday rest. Meanwhile Sunakkhatta rushed into Vesālī and declared to all the prominent Licchavis: \"Friends, the Blessed Lord has gone into Vesālī for alms, and after that he has gone for his midday rest to Pātṭkaputta's park. Come along, friends, come along! the two great ascetics are going to work miracles!\" And all the prominent Licchavis thought: \"The two great ascetics are going to work miracles! Let us go along!\"",
    "dn24:39": "And he went to the distinguished and wealthy Brahmins and householders, and to the ascetics and Brahmins of various schools, and told them the same thing, and they too thought: \"Let us go along!\"",
    "dn24:40": "And so all these people came along to Paṭikaputta's park, hundreds and thousands of them.",
    "dn24:41": "'And Pāṭikaputta heard that all these people had come to his park, and that the ascetic Gotama had gone there for his midday rest. And at the news he was overcome with fear and trembling, and his hair stood on end. And thus terrified and trembling, his hair standing on end, he made for the Tinduka lodging of the wanderers.[n.746] A home for wanderers which had been charitably donated near some Tinduka trees.",
    "dn24:42": "When the assembled company heard that he had gone to the Tinduka lodging, they instructed a man to go there to Pāṭikaputta and say to him:",
    "dn24:43": "\"Friend Pāṭikaputta, come along! All these people have come to your park, and the ascetic Gotama has gone there for his midday rest. Because you declared to the assembly at Vesālī: 'The ascetic Gotama claims to be a man of wisdom, and I make the same claim …as verse 15. However many miracles he performs, I will perform twice as many!' So now come half-way: the ascetic Gotama has already come half-way to meet you, and is sitting for his midday rest in Your Reverence's park.\"",
    "dn24:44": "'The man went and delivered the message …",
    "dn24:45": "… and on hearing it Pāṭikaputta said: \"I'm coming, friend, coming!\" but, wriggle as he might, he could not get up from his seat. Then the man said: \"What's the matter with you, friend Pāṭikaputta? Is your bottom stuck to the seat, or is the seat stuck to your bottom? You keep saying: 'I'm coming, friend, I'm coming!', but you only wriggle and can't get up from your seat.\" And even at these words, Pāṭikaputta still wriggled about, but could not rise.",
    "dn24:46": "'And when that man realised that Pāṭikaputta could not help himself, he went back to the assembly and reported the situation. And then I said to them: \"Pāṭikaputta the naked ascetic is not capable of meeting me face to face unless he takes back his words, abandons that thought, and gives up that view. And if he thinks otherwise, his head will split in pieces.\"'",
    "dn24:47": "'Then, Bhaggava, one of the ministers of the Licchavis rose from his seat and said: \"Well, gentlemen, just wait a little till I I have been to see whether I can bring Pāṭikaputta to the assembly.\"",
    "dn24:48–49": "So he went to the Tinduka lodging and said to Pāṭikaputta: \"Come along, Pāṭikaputta, it is best for you to come. All these people have come to your park and the ascetic Gotama has gone there for his midday rest. If you come, we will make you the winner and let the ascetic Gotama be defeated.\"",
    "dn24:50": "'So the minister returned to the assembly and reported on the situation. Then I said: \"Pāṭikaputta, is not capable of meeting me … Even if the good Licchavis were to think: 'Let us bind him with thongs and try to drag him with yoked oxen!' he would burst the thongs. He is not capable of meeting me face to face … \"",
    "dn24:51–52": "'Then Jāliya, a pupil of the wooden-bowl ascetic,[n.747] Cf.DN 6.23andDN 7, which is named after him.rose from his seat…, went to the Tinduka lodging and said to Pāṭikaputta: \"Come along, Pāṭikaputta, … if you come, we will make you the winner and let the ascetic Gotama be defeated.\"",
    "dn24:53": "'And Pāṭikaputta said: \"I'm coming, friend, I'm coming!\" but wriggle as he might, he could not get up from his seat…",
    "dn24:54–57": "'Then, when Jaliya realised the situation, he said:",
    "dn24:58": "\"'Now there was an old jackal who had grown fat on the lion's leavings, and he was proud and strong. And he thought: 'What difference is there between me and the lion, king of beasts? Suppose I were to make my lair near the jungle…' So he chose a lair accordingly and emerging in the evening, he surveyed the four quarters, and then thought: 'Now I will roar a lion's roar three times', – and he gave out the howl of his kind, a jackal howl. For what has the wretched howl of a jackal in common with a lion's roar?",
    "dn24:59": "In just the same way, Pāṭikaputta, you live off the achievements of the Well-Farer and feed on the Well-Farer's leavings, imagining you can set yourself up beside the Tathagatas, Arahants and fully-enlightened Buddhas. But what have wretched Patikaputtas in common with them?\"",
    "dn24:60": "'Then, being unable even with the aid of this parable to get Pāṭikaputta, to rise from his seat, Jāliya uttered this verse:",
    "dn24:61": "\"Thinking himself a lion, the jackal says:'I'm the king of beasts', and tries to roarA lion's roar, but only howls instead.Lion is lion and jackal jackal still.",
    "dn24:62": "In just the same way, Patikaputta, you are living off the achievements of the Well-Farer…\"",
    "dn24:63": "'And, being unable even with the aid of this parable to get Patikaputta to rise from his seat, Jāliya uttered this verse:",
    "dn24:64": "\"Following another's tracks, and fedOn scraps, his jackal-nature he forgets,Thinking: 'I'm a tiger', tries to roarA mighty roar, but only howls instead.",
    "dn24:65": "Lion is lion and jackal's jackal still.",
    "dn24:66": "In just the same way, Patikaputta, you are living off the achievements of the Well-Farer…\"",
    "dn24:67": "'And, being unable even with this parable to get Pāṭikaputta, to rise from his seat, Jāliya uttered this verse:",
    "dn24:68": "\"Gorged on frogs and mice from threshing-floors,And corpses cast aside in charnel-grounds,In lonely forests wild the jackal thinks:'I'm the king of beasts', and tries to roarA lion's roar, but only howls instead.Lion is lion and jackal's jackal still.",
    "dn24:69": "In just the same way, Pāṭikaputta, you are living off the achievements of the Well-Farer, feeding on the Well-Farer's leavings, imagine you can set yourself up beside the Tathāgatas, Arahants and full-enlightened Buddhas. But what have wretched Pāṭikaputtas in common with them?\"",
    "dn24:70": "'Then, being unable even with this parable to get Pāṭikaputta to rise from his seat, Jāliya returned to the assembly and reported on the situation.",
    "dn24:71": "'Then I said: \"Pāṭikaputtas is not capable of meeting me face to face unless he takes back his words, abandons that thought and gives up that view… Even if the good Licchavis were to think: 'Let us bind him with thongs and try to drag him here with yoked oxen', he would burst the thongs. He is not capable of meeting me face to face … If he thinks otherwise, his head will split in pieces.\"",
    "dn24:72": "'Then, Bhaggava, I instructed, inspired, fired and delighted that assembly with a talk on Dhamma. And having thereby delivered that company from the great bondage,[n.748] DA seems to imply that he brought them all to Arahantship: more modestly, one might settle for the 'opening of the Dhamma-eye' (seen.140).thus rescuing eighty-four thousand beings from the great path of peril, I entered into the fire-element[n.749]Tejo-dhātuṁ samāpajjitvā:RD translates 'entered on jhāna by the method of flame' with no comment, and DA, more remarkably, is silent. Could this peculiarly unnecessary miracle have been inserted later?and rose into the air to the height of seven palm-trees, and projecting a beam for the height of another seven so that it blazed and shed fragrance, I then reappeared in the Gabled Hall in the Great Forest.[n.750] All this despite the Buddha’s expressed dislike of miracles. See note to verse 1.4 above and compare with DN 11.5, where the performance of 'miracles' is condemned by the Buddha as it is here too, though he text contradicts the Master's words",
    "dn24:73": "'And there Sunakkhatta came to me, saluted me and sat down to one side. I said: \"What do you think, Sunakkhatta? Has what I told you about Pāṭikaputta come about, or not?\" \"It has, Lord.\"",
    "dn24:74": "\"And has a miracle been performed, or not?\" \"It has, Lord.\" \"Well then, you foolish man, do you still say to me after I have performed such a miracle: 'Well, Lord, you have not performed any miracles'? Consider, you foolish man, how far the fault is yours.\"",
    "dn24:75": "And, Bhaggava, at my words Sunakkhatta left this Dhamma and discipline like one condemned to hell.",
    "dn24:76": "'Bhaggava, I know the first beginning of things,[n.751]Aggañña.SeeDN 27for a full development of the theme of 'beginnings' — not, of course, in the sense of an absolute first cause, for which Buddhism has no use.and I know not only that, but what surpasses it in value.[n.752] Or 'goes beyond it' — even to omniscience, says DA, not quite correctly.And I am not under the sway of what I know, and not being under its sway I have come to know for myself that quenching,[n.753]Nibbuti:a term associated with Nibbāna, though actually from a different root.by the realisation of which the Tathagata cannot fall into perilous paths.[n.754]Anaya:'wrong leading', i.e. into suffering or trouble.",
    "dn24:77": "There are, Bhaggava, some ascetics and Brahmins who declare as their doctrine that all things began with the creation by a god,[n.755] Issara (Skt. Īśvara): 'God as creator and ruler', now often the Christian God.or Brahma. I have gone to them and said: \"Reverend sirs, is it true that you declare that all things began with the creation by a god, or Brahma?\" \"Yes\", they replied. Then I asked: \"In that case, how do the reverend teachers declare that this came about?\" But they could not give an answer, and so they asked me in return. And I replied:",
    "dn24:78": "'\"There comes a time, friends, sooner or later after a long period, when this world contracts. At a time of contraction, beings are mostly reborn in the Abhassara Brahma world. And there they dwell, mind-made, feeding on delight, self luminous, moving through the air, glorious – and they stay like that for a very long time.",
    "dn24:79": "'But the time comes, sooner or later after a long period, when this world begins to expand. In this expanding world an empty palace of Brahma appears. And then one being, from exhaustion of his life-span or of his merits, falls from the Abhassara world and arises in the empty Brahma-palace. And there he dwells, mind-made, feeding on delight, self-luminous, moving through the air, glorious – and he stays like that for a very long time.",
    "dn24:80": "'Then in this being who has been alone for so long there arises unrest, discontent and worry, and he thinks: \"Oh, if only some other beings would come here!\" And other beings, from exhaustion of their life-span or of their merits, fall from the Abhassara world and arise in the Brahmapalace as companions for this being. And there they dwell, mind-made,… and they stay like that for a very long time.",
    "dn24:81": "'And then, that being who first arose there thinks: \"I am Brahma, the Great Brahma, the Conqueror, the Unconquered, the All-Seeing, the All-Powerful, the Lord, the Maker and Creator, Ruler, Appointer and Orderer, Father of All That Have Been and Shall Be. These beings were created by me. How so? Because I first had this thought: 'Oh, if only some other beings would come here!' That was my wish, and then these beings came into this existence!\"",
    "dn24:82": "But those beings who arose subsequently think: \"This, friends, is Brahma, Great Brahma, the Conqueror, the Unconquered, the All-Seeing, the All-Powerful, the Lord, the Maker and Creator, Ruler, Appointer and Orderer, Father of All That Have Been and Shall Be. How so? We have seen that he was here first, and that we arose after him.\"",
    "dn24:83": "'And this being that arose first is longer-lived, more beautiful and more powerful than they are. And it may happen that some being falls from that realm and arises in this world.",
    "dn24:84": "Having arisen in this world, he goes forth from the household life into homelessness. Having gone forth, he by means of effort, exertion, application, earnestness and right attention attains to such a degree of mental concentration that he thereby recalls his last existence, but recalls none before that.",
    "dn24:85": "That, Reverend Sirs, is how it comes about that you teach that all things began with the creation by a god, or Brahma.\" And they said: \"We have heard this, Reverend Gotama, as you have explained.\"",
    "dn24:86": "But I know the first beginning of things… and not being under the sway of what I know I have come to know that quenching by the realisation of which the Tathāgata cannot fall into perilous ways.",
    "dn24:87–91": "'There are some ascetics and Brahmins who declare that the beginning of things was due to corruption by pleasure. I went to them and asked them if this was their view. \"Yes\", they replied. Reverend Sirs, is how it comes about that you teach that the beginning of things was due to corruption by pleasure.\" And they said: \"We have heard this, Reverend Gotama, as you have explained.\"",
    "dn24:92–96": "'There are some ascetics and Brahmins who declare that the beginning of things was due to corruption of mind. I went to them and asked them if this was their view. \"Yes\", they replied. I asked them how this came about, and when they could not explain, I said: \"There are, friends, certain devas called Corrupted in Mind. They spend an excessive amount of time regarding each other with envy… their minds become corrupted, and they fall awaySee Sutta 1, verses 2.10–13. That, Reverend Sirs, is how it comes about that you teach that the beginning of things was due to corruption of mind.\" And they said: \"We have heard this, Reverend Gotama, as you have explained.\"",
    "dn24:97": "'There are, Bhaggava, some ascetics and Brahmins who declare that the beginning of things was due to chance. I went to them and asked them if this was their view. \"Yes\", they replied. I asked them how this came about, and when they could not explain, I said:",
    "dn24:98": "\"There are, friends, certain devas called Unconscious. As soon as a perception arises in them, those devas fall from that realm.",
    "dn24:99": "And it may happen that a being falls from that realm and arises in this world. He…recalls his last existence, but none before that.",
    "dn24:100": "He thinks: \"The self and the world have arisen by chance. How so? Before this I did not exist. They think: 'Now from non-being I have been brought to being.' That, Reverend Sirs, is how it comes about that you teach that the beginning of things was due to chance.\" And they said: \"We have heard this, Reverend Gotama, as you have explained.\"",
    "dn24:101": "But I know the first beginning of things, and I know not only that, but what surpasses it in value. And I am not under the sway of what I know, and not being under its sway I have come to know for myself that quenching, by the realisation of which the Tathāgata cannot fall into perilous paths.",
    "dn24:102": "'And I, Bhaggava, who teach this and declare this am wrongly, vainly, lyingly and falsely accused by some ascetics and Brahmins who say: \"The ascetic Gotama is on the wrong track,[n.756]Viparīto:'reversed, changed'.and so are his monks. He has declared that whoever has attained to the stage of deliverance called 'the Beautiful'[n.757] Cf.DN 15.49.finds everything repulsive.\" But I do not say this. What I say is that whenever anyone has attained to the stage of deliverance called \"the Beautiful\", he knows that it is beautiful.'",
    "dn24:103": "'Indeed, Lord, they are on the wrong track themselves who accuse the Lord and his monks of error. I am so delighted with the Lord that I think the Lord is able to teach me to attain and remain in the deliverance called \"the Beautiful\".'",
    "dn24:104": "'It is hard for you, Bhaggava, holding different views, being of different inclinations and subject to different influences, following a different discipline and having had a different teacher, to attain and remain in the deliverance called \"the Beautiful\". You must strive hard, putting your trust in me, Bhaggava.'",
    "dn24:105": "Thus the Lord spoke, and Bhaggava the wanderer was delighted and rejoiced at the Lord's words."
}