{
    "dn26:1": "Thus have I heard.[n.78] We seem to be back in the 'fairy-tale' world of some previous Suttas, but with a difference. RD, in another brilliant introduction in which he develops his theory of Normalism (the belief, in contrast to Animism, in a certain rule, order, or law), fails to analyse the structure of this fable (which is what, rather than a fairy-tale, it really is). The narrative part is framed by certain important remarks by the Buddha which, announced at the beginning, are repeated in elaborated form at the end (n.809).Once the Lord was staying among the Magadhans at Mātulā. Then he said: 'Monks!' 'Lord', they replied, and the Lord said:",
    "dn26:2": "'Monks, be islands unto yourselves, be a refuge unto yourselves with no other refuge. Let the Dhamma be your island, let the Dhamma be your refuge, with no other refuge.[n.78] Cf. DN 16 andn.395there.And how does a monk dwell as an island unto himself, as a refuge unto himself with no other refuge, with the Dhamma as his island, with the Dhamma as his refuge, with no other refuge? Here, a monk abides contemplating body as body,[n.783] Cf. DN .1.ardent, clearly aware and mindful, having put aside hankering and fretting for the world, he abides contemplating feelings as feelings, … he abides contemplating mind as mind, … he abides contemplating mind-objects as mind-objects, ardent, clearly aware and mindful, having put aside hankering and fretting for the world.",
    "dn26:3": "'Keep to your own preserves,[n.784]Gocare:lit. 'pastures'.monks, to your ancestral haunts.[n.785]Pettike visaye:'the raṅge of your fathers'.If you do so, then Māra will find no lodgement, no foothold. It is just by the building-up of wholesome states that this merit increases.",
    "dn26:4": "'Once, monks, there was a wheel-turning monarch named Daḷhanemi, a righteous monarch of the law, conqueror of the four quarters, who had established the security of his realm and was possessed of the seven treasures. These are: the Wheel Treasure, the Elephant Treasure, the Horse Treasure, the Jewel Treasure, the Woman Treasure, the Householder Treasurer, and, as seventh, the Counsellor Treasure. He has more than a thousand sons who are heroes, of heroic stature, conquerors of the hostile army. He dwells having conquered this sea-girt land without stick or sword, by the lawas Sutta 3, verse 1.5.",
    "dn26:5": "'And, after many hundreds and thousands of years, King Daḷhanemi said to a certain man: \"My good man, whenever you see that the sacred Wheel-Treasure has slipped from its position, report it to me.\" \"Yes, sire\", the man replied. And after many hundreds and thousands of years the man saw that the sacred Wheel-Treasure had slipped from its position. Seeing this, he reported the fact to the King. Then King Daḷhanemi sent for his eldest son, the crown prince, and said: \"My son, the sacred Wheel-Treasure has slipped from its position. And I have heard say that when this happens to a wheel-turning monarch, he has not much longer to live. I have had my fill of human pleasures, now is the time to seek heavenly pleasures. You, my son, take over control of this ocean-bounded land. I will shave off my hair and beard, don yellow robes, and go forth from the household life into homelessness.\"",
    "dn26:6": "And, having installed his eldest son in due form as king, King Daḷhanemi shaved off his hair and beard, donned yellow robes, and went forth from the household life into homelessness. And, seven days after the royal sage had gone forth, the sacred Wheel-Treasure vanished.",
    "dn26:7": "'Then a certain man came to the anointed Khattiya King and said: \"Sire, you should know that the sacred Wheel-Treasure has disappeared.\" At this the King was grieved and felt sad. He went to the royal sage and told him the news. And the royal sage said to him: \"My son, you should not grieve or feel sad at the disappearance of the Wheel-Treasure. The Wheel-Treasure is not an heirloom from your fathers. But now, my son, you must turn yourself into an Ariyan wheel-turner.[n.86]Cakkavatti-vatte vattāhi.RD points out the play on 'turning into a Wheel-Turner': vatta meaning both 'turning' and 'duty'.And then it may come about that, if you perform the duties of an Ariyan wheel-turning monarch, on the fast-day of the fifteenth,[n.8] Cf. DN 1.1.8.when you have washed your head and gone up to the verandah on top of your palace for the fast-day, the sacred Wheel-Treasure will appear to you, thousand-spoked, complete with felloe, hub and all appurtenances.\"",
    "dn26:8": "'\"But what, sire, is the duty of an Ariyan wheel-turning monarch?\" \"It is this, my son: Yourself depending on the Dhamma, honouring it, revering it, cherishing it, doing homage to it and venerating it, having the Dhamma as your badge and banner, acknowledging the Dhamma as your master, you should establish guard, ward and protection according to Dhamma for your own household, your troops, your nobles and vassals, for Brahmins and householders, town and country folk, ascetics and Brahmins, for beasts and birds.[n.7] A truly Buddhist touch! Asoka, who made some effort to live up to the ideal of a wheel-turning monarch, established animal hospitals.Let no crime[n.79]Adhamma-kāro:'non-Dhamma-doing'.prevail in your kingdom, and to those who are in need, give property. And whatever ascetics and Brahmins in your kingdom have renounced the life of sensual infatuation and are devoted to forbearance and gentleness, each one taming himself, each one calming himself and each one striving for the end of craving, from time to time you should go to them and consult them as to what is wholesome and what is unwholesome, that is blameworthy and what is blameless, what is to be followed and what is not to be followed, and what action will in the long run lead to harm and sorrow, and what to welfare and happiness. Having listened to them, you should avoid evil and do what is good.[n.790] The word rendered 'good' is the same, kusala, as rendered just previously by 'wholesome. The literal 'skilful' is also sometimes to be preferred. A case where variation in translation is desirable — but it should be indicated.That, my son, is the duty of an Ariyan wheel-turning monarch.'",
    "dn26:9": "'\"Yes, sire\", said the King, and he performed the duties of an Ariyan wheel-turning monarch. And as he did so, on the fast-day of the fifteenth, when he had washed his head and gone up to the verandah on top of his palace for the fast-day, the sacred Wheel-Treasure appeared to him, thousand-spoked, complete with felloe, hub and all appurtenances. Then the King thought: \"I have heard that when a duly anointed Khattiya king sees such a wheel on the fast-day of the fifteenth, he will become a wheel-turning monarch. May I become such a monarch!\"[n.71] All as in DN 17.",
    "dn26:10": "'Then, rising from his seat, covering one shoulder with his robe, the King took a gold vessel in his left hand, sprinkled the Wheel with his right hand, and said: \"May the noble Wheel-Treasure turn, may the noble Wheel-Treasure conquer!\"",
    "dn26:11": "The Wheel turned to the east, and the King followed it with his fourfold army. And in whatever country the Wheel stopped, the King took up residence with his fourfold army. And those who opposed him in the eastern region came and said: \"Come, Your Majesty, welcome! We are yours, Your Majesty. Rule us, Your Majesty.\" And the King said: \"Do not take life. Do not take what is not given. Do not commit sexual misconduct. Do not tell lies. Do not drink strong drink. Be moderate in eating.\"[n.792] But seen.472.Warder (asn.801) has 'rule (collect taxes) in moderation'.And those who had opposed him in the eastern region became his subjects.",
    "dn26:12–14": "'Then the Wheel turned south, west, and north …as verse 6. Then the Wheel-Treasure, having conquered the lands from sea to sea, returned to the royal capital and stopped before the King's palace as he was trying a case, as if to adorn the royal palace.",
    "dn26:15–17": "'And a second wheel-turning monarch did likewise, and a third, a fourth, a fifth, a sixth, and a seventh king also … told a man to see if the Wheel had slipped from its positionas verse 3. And seven days after the royal sage had gone forth the Wheel disappeared.",
    "dn26:18": "'Then a man came to the King and said: \"Sire, you should know that the sacred Wheel-Treasure has disappeared.\" At this the King was grieved and felt sad. But he did not go to the royal sage and ask him about the duties of a wheel-turning monarch. Instead, he ruled the people according to his own ideas, and, being so ruled, the people did not prosper so well as they had done under the previous kings who had performed the duties of a wheel-turning monarch.",
    "dn26:19": "Then the ministers, counsellors, treasury officials, guards and doorkeepers, and the chanters of mantras came to the King and said: \"Sire, as long as you rule the people according to your own ideas, and differently from the way they were ruled before under previous wheel-turning monarchs, the people do not prosper so well. Sire, there are ministers … in your realm, including ourselves, who have preserved the knowledge of how a wheel-turning monarch should rule. Ask us, Your Majesty, and we will tell you!\"",
    "dn26:20": "'Then the King ordered all the ministers and others to come together, and he consulted them. And they explained to him the duties of a wheel-turning monarch. And, having listened to them, the King established guard and protection, but he did not give property to the needy, and as a result poverty became rife. With the spread of poverty, a man took what was not given, thus committing what was called theft. They arrested him, and brought him before the King, saying: \"Your Majesty, this man took what was not given, which we call theft.\" The King said to him: \"Is it true that you took what was not given — which is called theft?\" \"It is, Your Majesty.\" \"Why?\" \"Your Majesty, I have nothing to live on.\" Then the King gave the man some property, saying: \"With this, my good man, you can keep yourself, support your mother and father, keep a wife and children, carry on a business and make gifts to ascetics and Brahmins, which will promote your spiritual welfare and lead to a happy rebirth with pleasant result in the heavenly sphere.\" \"Very good, Your Majesty\", replied the man.",
    "dn26:21": "'And exactly the same thing happened with another man.",
    "dn26:22": "'Then people heard that the King was giving away property to those who took what was not given, and they thought: \"Suppose we were to do likewise!\" And then another man took what was not given, and they brought him before the King. The King asked him why he had done this, and he replied: \"Your Majesty, I have nothing to live on.\" Then the King thought: \"If I give property to everybody who takes what is not given, this theft will increase more and more. I had better make an end of him, finish him off once for all, and cut his head off.\" So he commanded his men: \"Bind this man's arms tightly behind him with a strong rope, shave his head closely, and lead him to the rough sound of a drum through the streets and squares and out through the southern gate, and there finish by inflicting the capital penalty and cutting off his head!\" And they did so.",
    "dn26:23": "'Hearing about this, people thought: \"Now let us get sharp swords made for us, and then we can take from anybody what is not givenwhich is called theft, we will make an end of them, finish them off once for all and cut off their heads.\" So, having procured some sharp swords, they launched murderous assaults on villages, towns and cities, and went in for highway-robbery, killing their victims by cutting off their heads.",
    "dn26:24": "'Thus, from the not giving of property to the needy, poverty became rife, from the growth of poverty, the taking of what was not given increased, from the increase of theft, the use of weapons increased, from the increased use of weapons, the taking of life increased — and from the increase in the taking of life, people's life-span decreased, their beauty decreased, and as a result of this decrease of life-span and beauty, the children of those whose life-span had been eighty thousand years lived for only forty thousand.",
    "dn26:25": "'And a man of the generation that lived for forty thousand years took what was not given. He was brought before the King, who asked him: \"Is it true that you took what was not given — what is called theft?\" \"No, Your Majesty\", he replied, thus telling a deliberate lie.",
    "dn26:26": "'Thus, from the not giving of property to the needy,… the taking of life increased, and from the taking of life, lying increased, from the increase in lying, people's life-span decreased, their beauty decreased, and as a result, the children of those whose life-span had been forty thousand years lived for only twenty thousand.",
    "dn26:27": "'And a man of the generation that lived for twenty thousand years took what was not given. Another man denounced him to the King, saying: \"Sire, such-and-such a man has taken what was not given\", thus speaking evil of another.[n.793] Even though the charge was justified! But the denunciation was malicious.",
    "dn26:28": "'Thus, from the not giving of property to the needy,… the speaking evil of others increased, and in consequence, people's life-span decreased, their beauty decreased, and as a result, the children of those whose life-span had been twenty thousand years lived only for ten thousand.",
    "dn26:29": "'And of the generation that lived for ten thousand years, some were beautiful, and some were ugly. And those who were ugly, being envious of those who were beautiful, committed adultery with others' wives.",
    "dn26:30": "'Thus, from the not giving of property to the needy,… sexual misconduct increased, and in consequence people's life-span decreased, their beauty decreased, and as a result, the children of those whose life-span had been ten thousand years lived for only five thousand.",
    "dn26:31": "'And among the generation whose life-span was five thousand years, two things increased: harsh speech and idle chatter, in consequence of which people's life-span decreased, their beauty decreased, and as a result, the children of those whose life-span had been five thousand years lived, some for two-and-a-half thousand years, and some for only two thousand.",
    "dn26:32": "'And among the generation whose life-span was two-and-a-half thousand years, covetousness and hatred increased, and in consequence people's life-span decreased, their beauty decreased, and as a result, the children of those whose life-span had been two-and-a-half thousand years lived for only a thousand.",
    "dn26:33": "'Among the generation whose life-span was a thousand years, false opinions[n.794]Micchā-diṭṭhi:seen.708.increased… and as a result, the children of those whose life-span had been a thousand years lived for only five hundred.",
    "dn26:34": "'And among the generation whose life-span was five hundred years, three things increased: incest, excessive greed and deviant practices[n.795]Micchā-dhamma.DA says 'men with men, women with women'.… and as a result, the children of those whose life-span had been five hundred years lived, some for two hundred and fifty years, some for only two hundred.",
    "dn26:35": "'And among those whose life-span was two hundred and fifty years, these things increased: lack of respect for mother and father, for ascetics and Brahmins, and for the head of the clan.",
    "dn26:36": "'Thus, from the not giving of property to the needy,… lack of respect for mother and father, for ascetics and Brahmins, and for the head of the clan increased, and in consequence people's life-span and beauty decreased, and the children of those whose life-span had been two-and-a-half centuries lived for only a hundred years.",
    "dn26:37": "'Monks, a time will come when the children of these people will have a life-span of ten years. And with them, girls will be marriageable at five years old. And with them, these flavours will disappear: ghee, butter, sesame-oil, molasses and salt. Among them, kudrūsa-grain[n.796] Said by RD to be 'a kind of rye'. The dictionaries are less specific.will be the chief food, just as rice and curry are today.",
    "dn26:38": "And with them, the ten courses of moral conduct will completely disappear, and the ten courses of evil will prevail exceedingly: for those of a ten-year lifespan there will be no word for \"moral\"[n.797]Kusala(seen.790). The real meaning is 'skilful' in regard to knowing the karmic consequences of one's actions — in other words not having micchā-diṭṭhi (seen.708).so how can there be anyone who acts in a moral way? Those people who have no respect for mother or father, for ascetics and Brahmins, for the head of the clan, will be the ones who enjoy honour and prestige. Just as it is now the people who show respect for mother and father, for ascetics and Brahmins, for the head of the clan, who are praised and honoured, so it will be with those who do the opposite.",
    "dn26:39": "'Among those of a ten-year life-span no account will be taken of mother or aunt, of mother's sister-in-law, of teacher's wife or of one's father's wives and so on — all will be promiscuous in the world like goats and sheep, fowl and pigs, dogs and jackals.",
    "dn26:40": "Among them, fierce enmity will prevail one for another, fierce hatred, fierce anger and thoughts of killing, mother against child and child against mother, father against child and child against father, brother against brother, brother against sister, just as the hunter feels hatred for the beast he stalks…",
    "dn26:41": "'And for those of a ten-year life-span, there will come to be a \"sword-interval\"[n.798] RD's note is barely intelligible, or at least unhelpful: 'Satthantarakappa. Sattha is sword; antarakappa is a period included in another period. Here the first period, the one included, is seven days. See Ledi Sadaw in the Buddhist Review, January 1916' — a journal not all readers will have to hand. On Antarakappa, Childers (as often) is more helpful than PED: 'Each Asaṅkheyyakappa (\"incalculable aeon\") contains twenty Antarakappas, an Antarakappa being the interval that elapses while the age of man increases from ten years to an asaṅkheyya, and then decreases again to ten years.' Clearly this immense period — which, in regard to the human life-span, is not canonical — is not meant here, but the reference to 'ten years' is relevant. DA distinguishes three kinds ofAntarakappa: Dubbhikkhantarakappa, Rogantarakappa,andSatthantarakappa,caused by greed, delusion and hatred respectively. RD ignores all this.Cf. EB underAntarakalpa,where a parallel to this commentarial passage is cited from the 11th-century Sanskrit-Tibetan dictionary calledMahāvyutpatti.The article concludes: 'Yet, the context in which the termsatthantara-kappaoccurs in the Dīgha Nikāya (III, 73) seems to suggest that the word could also be used in a very general sense to mean a period which is not of the same duration as an antarakappa.' The context in fact suggests that this period of one week marks a turning-point which is the beginning of an Antarakappa in the sense mentioned by Childers.of seven days, during which they will mistake one another for wild beasts. Sharp swords will appear in their hands and, thinking: \"There is a wild beast!\" they will take each other's lives with those swords.",
    "dn26:42": "But there will be some beings who will think: \"Let us not kill or be killed by anyone! Let us make for some grassy thickets or jungle-recesses or clumps of trees, for rivers hard to ford or inaccessible mountains, and live on roots and fruits of the forest.\" And this they will do for seven days. Then, at the end of the seven days, they will emerge from their hiding-places and rejoice together of one accord, saying: \"Good beings, I see that you are alive!\"",
    "dn26:43": "And then the thought will occur to those beings: \"It is only because we became addicted to evil ways that we suffered this loss of our kindred, so let us now do good! What good things can we do? Let us abstain from the taking of life — that will be a good practice.\" And so they will abstain from the taking of life, and, having undertaken this good thing, will practise it. And through having undertaken such wholesome things, they will increase in life-span and beauty. And the children of those whose life-span was ten years will live for twenty years.",
    "dn26:44": "'Then it will occur to those beings: \"It is through having taken to wholesome practices that we have increased in life-span and beauty, so let us perform still more wholesome practices. Let us refrain from taking what is not given, from sexual misconduct, from lying speech, from slander, from harsh speech, from idle chatter, from covetousness, from ill-will, from wrong views; let us abstain from three things: incest, excessive greed, and deviant practices; let us respect our mothers and fathers, ascetics and Brahmins, and the head of the clan, and let us persevere in these wholesome actions.\"",
    "dn26:45": "'And so they will do these things, and on account of this they will increase in life-span and in beauty. The children of those whose life-span is twenty years will live to be forty, their children will live to be eighty, their children to be a hundred and sixty, their children to be three hundred and twenty, their children to be six hundred and forty; the children of those whose life-span is six hundred and forty years will live for two thousand years, their children for four thousand, their children for eight thousand, and their children for twenty thousand. The children of those whose life-span is twenty thousand years will live to be forty thousand, and their children will attain to eighty thousand years.",
    "dn26:46": "And such people will know only three kinds of disease: greed, fasting, and old age.[n.799] There will be, it seems, no real disease at all: death will result only from excessive or inadequate nourishment or the inevitable onset of old age. Accidents also seem to be excluded.And in the time of those people this continent of Jambudipa will be powerful and prosperous, and villages, towns and cities will be but a cock's flight one from the next.[n.800] This seems to be the meaning of a doubtful expression.This Jambudipa, like Avīci,[n.801] In the commentaries and later literature Avici denotes the lowest of the hells (or 'purgatories', as RD and other translators have it, to indicate that no such hell is eternal). This, and a parallel passage at AN 3.56, is the only passage in the first four Nikāyas where it is mentioned, and 'hell' does not seem to be its meaning (RD renders it 'the Waveless Deep'), though its exact sense is doubtful. Warder, in his paraphrase of this Sutta (Indian Buddhism,168) says parenthetically: '\"like purgatory\", the Buddha remarks ambiguously, thinking probably of his preference for seclusion.' The Buddhist hells grow steadily worse in the popular imagination, but most of their horrors find little support in the Suttas (though seeMN 129, 130). Cf.n.244and Introduction, p. 40.will be as thick with people as the jungle is thick with reeds and rushes. At that time the Vārānasi[n.802] Benares.of today will be a royal city called Ketumatī, powerful and prosperous, crowded with people and well-supplied. In Jambudipa there will be eighty-four thousand cities headed by Ketumati as the royal capital.",
    "dn26:47": "'And in that time of the people with an eighty thousand-year life-span, there will arise in the world a Blessed Lord, an Arahant fully-enlightened Buddha named Metteyya,[n.803] The next Buddha, perhaps better known by the Sanskrit name Maitreya.endowed with wisdom and conduct, a Well-Farer, Knower of the worlds, incomparable Trainer of men to be tamed, Teacher of gods and humans, enlightened and blessed, just as I am now. He will thoroughly know by his own super-knowledge, and proclaim, this universe with its devas and maras and Brahmas, its ascetics and Brahmins, and this generation with its princes and people, just as I do now. He will teach the Dhamma, lovely in its beginning, lovely in its middle, lovely in its ending, in the spirit and in the letter, and proclaim, just as I do now, the holy life in its fullness and purity. He will be attended by a company of thousands of monks, just as I am attended by a company of hundreds.",
    "dn26:48": "'Then King Sankha will re-erect the palace once built by King Mahā-Panāda[n.804] This had been drowned in the Ganges.and, having lived in it, will give it up and present it to the ascetics and Brahmins, the beggars, the wayfarers, the destitute. Then, shaving off hair and beard, he will don yellow robes and go forth from the household life into homelessness under the supreme Buddha Metteyya. Having gone forth, he will remain alone, in seclusion, ardent, eager and resolute, and before long he will have attained in this very life, by his own super-knowledge and resolution, that unequalled goal of the holy life, for the sake of which young men of good family go forth from the household life into homelessness, and will abide therein.",
    "dn26:49": "'Monks, be islands unto yourselves, be a refuge unto yourselves with no other refuge. Let the Dhamma be your island, let the Dhamma be your refuge with no other refuge. And how does a monk dwell as an island unto himself…? Here, a monk abides contemplating body as body, ardent, clearly aware and mindful, having put aside hankering and fretting for the world, he abides contemplating feelings as feelings, … he abides contemplating mind as mind, … he abides contemplating mind-objects as mind-objects, ardent, clearly aware and mindful, having put aside hankering and fretting for the world.",
    "dn26:50": "'Keep to your own preserves, monks, to your ancestral haunts. If you do so, your life-span will increase, your beauty will increase, your happiness will increase, your wealth will increase, your power will increase.",
    "dn26:51": "'And what is length of life for a monk? Here, a monk develops the road to power which is concentration of intention accompanied by effort of will, the road to power which is concentration of energy…, the road to power which is concentration of consciousness…, the road to power which is concentration of investigation accompanied by effort of will.[n.805] Cf. DN 16.3.3. and 18.22.By frequently practising these four roads to power he can, if he wishes, live for a full century,[n.806] Seen.400.or the remaining part of a century. That is what I call length of life for a monk.",
    "dn26:52": "'And what is beauty for a monk? Here, a monk practises right conduct, is restrained according to the discipline, is perfect in behaviour and habits, sees danger in the slightest fault, and trains in the rules of training he has undertaken. That is beauty for a monk.",
    "dn26:53": "'And what is happiness for a monk? Here, a monk, detached from sense-desires, detached from unwholesome mental states, enters and remains in the first jhāna, which is with thinking and pondering, born of detachment, filled with delight and joy .. the second, third, fourth jhāna, … purified by equanimity and mindfulness. That is happiness for a monk.",
    "dn26:54": "'And what is wealth for a monk? Here, a monk, with his heart filled with loving-kindness, dwells suffusing one quarter, the second, the third, the fourth. Thus he dwells suffusing the whole world, upwards, downwards, across — everywhere, always with a mind filled with loving-kindness, abundant, unbounded, without hate or ill-will. Then, with his heart filled with compassion,… with his heart filled with sympathetic joy, … with his heart filled with equanimity,… he dwells suffusing the whole world, upwards, downwards, across, everywhere, always with a mind filled with equanimity, abundant, unbounded, without hate or ill-will.[n.807] As DN 13.76, 78.That is wealth for a monk.",
    "dn26:55": "'And what is power for a monk? Here, a monk, by the destruction of the corruptions., enters into and abides in that corruptionless liberation of heart and liberation by wisdom which he has attained, in this very life, by his own super-knowledge and realisation. That is power for a monk.",
    "dn26:56": "'Monks, I do not consider any power[n.808] The wordbala'power' is repeated from just before.so hard to conquer as the power of Māra. It is just by this building-up of wholesome states that this merit increases.'[n.809] As RD fails to mention (though it is surely significant), the conclusion (verses 27–28) repeats the Buddha’s words in verse 1, the reference there to Māra being expanded after the first sentence of verse 28, Māra and his power being again alluded to before the last sentence of verse 1 is repeated. The fable shows the large-scale effect of keeping morality, and indicates how monks are to use this lesson.",
    "dn26:57": "Thus the Lord spoke, and the monks were delighted and rejoiced at his words."
}