{
    "dn2:1": "Thus have I heard. On one occasion the Exalted One was dwelling at Rājagaha, in Jīvaka Komārabhacca's[n.9] The royal physician.MN 55(on meat-eating) is addressed to him. Seen.47.Mango Grove, together with a large company of twelve hundred and fifty bhikkhus. At the time, on the fifteenth-day Uposatha,[n.93]Uposatha(Skt.upavasatha): here denotes a Brahmin fast-day. Later, in Buddhism the fortnightly day of confession for monks.the full-moon night of Komudī[n.95] Called after the white water-lily (kumuda) which blooms then.in the fourth month.[n.94] Kattika: mid-October to mid-November.King Ajātasattu of Magadha,[n.92] Reigned ca. 49–459 BCE. He had killed his father, the noble Bimbisāra, to gain the throne. See furthern.365.the son of Queen Videhā, was sitting on the upper terrace of his palace surrounded by his ministers. There the king uttered the following joyful exclamation:",
    "dn2:2": "Thereupon one of his ministers said: \"Your majesty, there is Pūraṇa Kassapa, the leader of an order, the leader of a group, the teacher of a group, well-known and famous, a spiritual leader whom many people esteem as holy. He is aged, long gone forth, advanced in years, in the last phase of life. Your majesty should visit him. Perhaps he might bring peace to your mind.\" But when this was said, King Ajātasattu remained silent.",
    "dn2:3–7": "Other ministers said: \"Your majesty, there is Makkhali Gosāla … Ajita Kesakambala … Pakudha Kaccāyana … Sañjaya Belaṭṭhaputta … Nigaṇṭha Nātaputta, the leader of an order, the leader of a group, the teacher of a group, well-known and famous, a spiritual leader whom many people esteem as holy. He is aged, long gone forth, advanced in years, in the last phase of life. Your majesty should visit him. Perhaps he might bring peace to your mind.\" But when this was said, King Ajātasattu remained silent.",
    "dn2:8": "All this time Jīvaka Komārabhacca sat silently not far from King Ajātasattu. The king then said to him: \"Friend Jīvaka, why do you keep silent?\"",
    "dn2:9": "\"Then get the elephant vehicles prepared, friend Jīvaka.\"",
    "dn2:10": "King Ajātasattu then had five hundred of his women mounted on the female elephants, one on each, while he himself mounted his personal bull-elephant. With his attendants carrying torches, he went forth from Rājagaha in full royal splendour, setting out in the direction of Jīvaka's Mango Grove.",
    "dn2:11": "When King Ajātasattu was not far from the Mango Grove, he was suddenly gripped by fear, trepidation, and terror. Frightened, agitated, and terror-stricken, he said to Jīvaka: \"You aren't deceiving me, are you, friend Jīvaka? You aren't betraying me? You aren't about to turn me over to my enemies? How could there be such a large company of bhikkhus, twelve hundred and fifty bhikkhus, without any sound of sneezing or coughing, or any noise at all?\"",
    "dn2:12": "\"Do not be afraid, great king. Do not be afraid. I am not deceiving you, your majesty, or betraying you, or turning you over to your enemies. Go forward, great king! Go straight forward! Those are lamps burning in the pavilion hall.\"",
    "dn2:13": "Then King Ajātasattu, having gone by elephant as far as he could, dismounted and approached the door of the pavilion hall on foot. Having approached, he asked Jīvaka: \"But where, Jīvaka, is the Exalted One?\"",
    "dn2:14": "King Ajātasattu then approached the Exalted One and stood to one side. As he stood there surveying the company of bhikkhus, which sat in complete silence as serene as a calm lake, he uttered the following joyful exclamation: \"May my son, the Prince Udāyibhadda,[n.98] The son who was eventually to kill him, only to be murdered in turn by his son. It evidently ran in the family (see DPPN).enjoy such peace as the company of bhikkhus now enjoys!\"",
    "dn2:15": "King Ajātasattu then paid homage to the Exalted One, reverently saluted the company of bhikkhus, sat down to one side, and said to the Exalted One: \"Venerable sir, I would like to ask the Exalted One about a certain point, if he would take the time to answer my question.\"",
    "dn2:16": "\"There are, venerable sir, various crafts, such as elephant trainers, horse trainers, charioteers, archers, standard bearers, camp marshals, commandos, high royal officers, front-line soldiers, bull-warriors, military heroes, mail-clad warriors, domestic slaves, confectioners, barbers, bath attendants, cooks, garland-makers, laundrymen, weavers, basket-makers, potters, statisticians, accountants, and various other crafts of a similar nature. All those (who practise these crafts) enjoy here and now the visible fruits of their crafts. They obtain happiness and joy themselves, and they give happiness and joy to their parents, wives and children, and their friends and colleagues. They establish an excellent presentation of gifts to recluses and brahmins—leading to heaven, ripening in happiness, conducing to a heavenly rebirth. Is it possible, venerable sir, to point out any fruit of recluseship that is similarly visible here and now?\"",
    "dn2:17": "\"Do you remember, great king, ever asking other recluses and brahmins this question?\"",
    "dn2:18": "\"One time, I approached Pūraṇa Kassapa,[n.99] A naked wanderer (DA). Such views as his, involving a denial of any reward or punishment for good and bad deeds, are regarded as especially pernicious.exchanged greetings and courtesies with him, and sat down to one side. I then asked him (as in§16) if he could point out any fruit of recluseship visible here and now.",
    "dn2:19": "\"When I had finished speaking, Pūraṇa Kassapa said to me: 'Great king, if one acts or induces others to act, mutilates or induces others to mutilate, tortures or induces others to torture, inflicts sorrow or induces others to inflict sorrow, oppresses or induces others to oppress, intimidates or induces others to intimidate; if one destroys life, takes what is not given, breaks into houses, plunders wealth, commits burglary, ambushes highways, commits adultery, speaks falsehood—one does no evil. If with a razor-edged disk one were to reduce all the living beings on this earth to a single heap and pile of flesh, by doing so there would be no evil or outcome of evil. If one were to go along the south bank of the Ganges killing and inducing others to kill, mutilating and inducing others to mutilate, torturing and inducing others to torture, by doing so there would be no evil or outcome of evil. If one were to go along the north bank of the Ganges giving gifts and inducing others to give gifts, making offerings and inducing others to make offerings, by doing so there would be no merit or outcome of merit. By giving, self-control, restraint, and truthful speech there is no merit or outcome of merit.'",
    "dn2:20": "\"Thus, venerable sir, when I asked Pūraṇa Kassapa about a visible fruit of recluseship, he explained to me (his doctrine of) the inefficacy of action. Venerable sir, just as if one asked about a mango would speak about a breadfruit, or as if one asked about a breadfruit would speak about a mango, in the same way when I asked Pūraṇa Kassapa about a visible fruit of recluseship he explained to me (his doctrine of) the inefficacy of action. Then, venerable sir, I thought to myself: 'One like myself should not think of troubling a recluse or brahmin living in his realm.'[n.100] Probably owing to his bad conscience. But the remark also suggests the enormous (and not always deserved) respect in which such wandering teachers were held.So I neither rejoiced in the statement of Pūraṇa Kassapa nor did I reject it. But, though I neither rejoiced in it nor rejected it, I still felt dissatisfied, yet did not utter a word of dissatisfaction. Without accepting his doctrine, without embracing it, I got up from my seat and left.",
    "dn2:21": "\"Another time, venerable sir, I approached Makkhali Gosāla,[n.101] ‘Makkhali of the Cow-Pen’, leader of the Ajivikas. Seen.66.exchanged greetings and courtesies with him, and sat down to one side. I then asked him (as in§16) if he could point out a fruit of recluseship visible here and now.",
    "dn2:22": "\"When I had finished speaking, Makkhali Gosāla said to me: 'Great king, there is no cause or condition[n.102]Hetumeans ‘root’ (e.g. greed, hatred or delusion);paccayameans ‘condition’.for the defilement of beings; beings are defiled without any cause or condition. There is no cause or condition for the purification of beings; beings are purified without cause or condition. There is no self-determination, no determination by others, no personal determination. There is no power, no energy, no personal strength, no personal fortitude. All sentient beings, all living beings, all creatures, all souls, are helpless, powerless, devoid of energy. Undergoing transformation by destiny, circumstance, and nature, they experience pleasure and pain in the six classes of men.",
    "dn2:23": "\"Thus, venerable sir, when I asked Makkhali Gosāla about a visible fruit of recluseship, he explained to me (his doctrine of) purification through wandering in saṁsāra. Venerable sir, just as if one asked about a mango would speak about a breadfruit, or as if one asked about a breadfruit would speak about a mango, in the same way, when I asked Makkhali Gosāla about a visible fruit of recluseship, he explained to me (his doctrine of) purification through wandering in saṁsāra. Then, venerable sir, I thought to myself: 'One like myself should not think of troubling a recluse or brahmin living in his realm.' So I neither rejoiced in the statement of Makkhali Gosāla nor did I reject it. But, though I neither rejoiced in it nor rejected it, I still felt dissatisfied, yet did not utter a word of dissatisfaction. Without accepting his doctrine, without embracing it, I got up from my seat and left.",
    "dn2:24": "\"Another time, venerable sir, I approached Ajita Kesakambala,[n.111] ‘Ajita of the Hairy Garment’ (he wore a cloak of human hair): a materialist.exchanged greetings and courtesies with him, and sat down to one side. I then asked him (as in§16) if he could point out a fruit of recluseship visible here and now.",
    "dn2:25": "\"When I had finished speaking, Ajita Kesakambala said to me: 'Great king, there is no giving, no offering, no liberality. There is no fruit or result of good and bad actions. There is no present world, no world beyond, no mother, no father, no beings who have taken rebirth.[n.112] Cf.n.49andn.63.In the world there are no recluses and brahmins of right attainment and right practice who explain this world and the world beyond on the basis of their own direct knowledge and realization. A person is composed of the four primary elements. When he dies, the earth (in his body) returns to and merges with the (external) body of earth; the water (in his body) returns to and merges with the (external) body of water; the fire (in his body) returns to and merges with the (external) body of fire; the air (in his body) returns to and merges with the (external) body of air. His sense faculties pass over into space. Four men carry the corpse along on a bier. His eulogies are sounded until they reach the charnel ground. His bones turn pigeon-coloured. His meritorious offerings end in ashes. The practice of giving is a doctrine of fools. Those who declare that there is (an afterlife) speak only false, empty prattle. With the breaking up of the body, the foolish and the wise alike are annihilated and utterly perish. They do not exist after death.'",
    "dn2:26": "\"Thus, venerable sir, when I asked Ajita Kesakambala about a visible fruit of recluseship, he explained to me (his doctrine of) annihilation. Venerable sir, just as if one asked about a mango would speak about a breadfruit, or as if one asked about a breadfruit would speak about a mango, in the same way, when I asked Ajita Kesakambala about a visible fruit of recluseship, he explained to me (his doctrine of) annihilation. Then, venerable sir, I thought to myself: 'One like myself should not think of troubling a recluse or brahmin living in his realm.' So I neither rejoiced in the statement of Ajita Kesakambala nor did I reject it. But though I neither rejoiced in it nor rejected it, I still felt dissatisfied, yet did not utter a word of dissatisfaction. Without accepting his doctrine, without embracing it, I got up from my seat and left.",
    "dn2:27": "\"Another time, venerable sir, I approached Pakudha Kaccāyana,[n.113] Holder of an atomic theory.exchanged greetings and courtesies with him, and sat down to one side. I then asked him (as in§16) if he could point out a fruit of recluseship visible here and now.",
    "dn2:28": "\"When I had finished speaking, Pakudha Kaccāyana said to me: 'Great king, there are seven bodies that are unmade, unfashioned, uncreated, without a creator, barren, stable as a mountain peak, standing firm like a pillar. They do not alter, do not change, do not obstruct one another; they are incapable of causing one another either pleasure or pain, or both pleasure and pain. What are the seven? The body of earth, the body of water, the body of fire, the body of air, pleasure, pain, and the soul as the seventh. Among these there is no killer nor one who causes killing; no hearer nor one who causes hearing; no cognizer nor one who causes cognition. If someone were to cut off (another person's) head with a sharp sword, he would not be taking (the other's) life. The sword merely passes through the space between the seven bodies.'",
    "dn2:29": "\"Thus, venerable sir, when I asked Pakudha Kaccāyana about a visible fruit of recluseship, he answered me in a completely irrelevant way. Venerable sir, just as if one asked about a mango would speak about a breadfruit, or as if one asked about a breadfruit would speak about a mango, in the same way, when I asked Pakudha Kaccāyana about a visible fruit of recluseship, he answered me in a completely irrelevant way. Then, venerable sir, I thought to myself: 'One like myself should not think of troubling a recluse or brahmin living in his realm.' So I neither rejoiced in the statement of Pakudha Kaccāyana nor did I reject it. But though I neither rejoiced in it nor rejected it, I still felt dissatisfied, yet did not utter a word of dissatisfaction. Without accepting his doctrine, without embracing it, I got up from my seat and left.",
    "dn2:30": "\"Another time, venerable sir, I approached Nigaṇṭha Nātaputta,[n.114] The name given in the Pali Canon to Vardhamana Mahāvīra (ca. 540—568 BCE?), the leader of the Jains. He is several times referred to (unfavourably) in the Canon, e.g. atMN 56.Nigaṇṭha means ‘free from bonds’. See next note andn.900.exchanged greetings and courtesies with him, and sat down to one side. I then asked him (as in§16) if he could point out a fruit of recluseship visible here and now.",
    "dn2:31": "\"When I had finished speaking, Nigaṇṭha Nātaputta said to me: 'Great king, a Nigaṇṭha, a knotless one, is restrained with a fourfold restraint.[n.115]Sabba-vāri-vārito, sabba-vāri-yuto, sabba-vāri-dhuto, sabba-vāri-phuṭṭo(with some variant readings). They do not represent the genuine Jain teaching but seem to parody it in punning form. The Jains do have a rule of restraint in regard to water, and vāri can mean ‘water’, ‘restraint’, or possibly ‘sin’, and some of the verbal forms are equally dubious. The reference to one ‘free from bonds’ and yet bound by these restraints (whatever they are) is a deliberate paradox. I am most grateful to K.R. Norman for his very helpful comments. Finally I settled for a slight variation on the Ven. Ñāṇamoli’s rendering of the corresponding passage inMN 56.How so? Herein, great king, a Nigaṇṭha is restrained with regard to all water; he is endowed with the avoidance of all evil; he is cleansed by the avoidance of all evil; he is suffused with the avoidance of all evil. Great king, when a Nigaṇṭha is restrained with this fourfold restraint, he is called a knotless one who is self-perfected, self-controlled, and self-established.'",
    "dn2:32": "\"Thus, venerable sir, when I asked Nigaṇṭha Nātaputta about a visible fruit of recluseship, he explained to me the fourfold restraint. Venerable sir, just as if one asked about a mango would speak about a breadfruit, or as if one asked about a breadfruit would speak about a mango, in the same way, when I asked Nigaṇṭha Nātaputta about a visible fruit of recluseship, he explained to me the fourfold restraint. Then, venerable sir, I thought to myself: 'One like myself should not think of troubling a recluse or brahmin living in his realm.' So I neither rejoiced in the statement of Nigaṇṭha Nātaputta, nor did I reject it. But though I neither rejoiced in it nor rejected it, I still felt dissatisfied, yet did not utter a word of dissatisfaction. Without accepting his doctrine, without embracing it, I got up from my seat and left.\"",
    "dn2:33": "\"Another time, venerable sir, I approached Sañjaya Belaṭṭhaputta, exchanged greetings and courtesies with him, and sat down to one side. I then asked him (as in§16) if he could point out any fruit of recluseship visible here and now.",
    "dn2:34": "\"When I had finished speaking, Sañjaya Belaṭṭhaputta said to me: 'If you ask me:",
    "dn2:35": "\"Thus, venerable sir, when I asked Sañjaya Belaṭṭhaputta about a visible fruit of recluseship, he answered me evasively. Venerable sir, just as if one asked about a mango would speak about a breadfruit, or as if one asked about a breadfruit would speak about a mango, in the same way, when I asked Sañjaya Belaṭṭhaputta about a visible fruit of recluseship, he answered me evasively. Then, venerable sir, I thought to myself: 'One like myself should not think of troubling a recluse or brahmin living in his realm.' So I neither rejoiced in the statement of Sañjaya Belaṭṭhaputta nor did I reject it. But though I neither rejoiced in it nor rejected it, I still felt dissatisfied, yet did not utter a word of dissatisfaction. Without accepting his doctrine, without embracing it, I got up from my seat and left.",
    "dn2:36": "\"So, venerable sir, I ask the Exalted One: There are, venerable sir, various crafts, such as elephant trainers, horse trainers, charioteers, archers, standard bearers, camp marshals, commandos, high royal officers, front-line soldiers, bull-warriors, military heroes, mail-clad warriors, domestic slaves, confectioners, barbers, bath attendants, cooks, garland-makers, laundrymen, weavers, basket-makers, potters, statisticians, accountants, and various other crafts of a similar nature. All those (who practise these crafts) enjoy here and now the visible fruits of their craft. They obtain happiness and joy themselves, and they give happiness and joy to their parents, their wives and children, their friends and colleagues. They establish an excellent presentation of gifts to recluses and brahmins—leading to heaven, ripening in happiness, conducing to a heavenly rebirth. Is it possible, venerable sir, to point out any fruit of recluseship that is similarly visible here and now?\"",
    "dn2:37": "\"It is, great king. But let me question you about this matter. Answer as you think fit.",
    "dn2:38": "\"After some time he shaves off his hair and beard, puts on saffron robes, and goes forth from home to homelessness. Having gone forth he dwells restrained in body, speech, and mind, content with the simplest food and shelter, delighting in solitude. Suppose your men were to report all this to you. Would you say: 'Bring that man back to me, men. Let him again become my slave, my workman, rising before me, retiring after me, doing whatever I want, acting always for my pleasure, speaking politely to me, ever on the lookout to see that I am satisfied.'?\"",
    "dn2:39": "\"Certainly not, venerable sir. Rather, we would pay homage to him, rise up out of respect for him, invite him to a seat, and invite him to accept from us robes, almsfood, dwelling and medicinal requirements. And we would provide him righteous protection, defence, and security.\"",
    "dn2:40": "\"What do you think, great king? If such is the case, is there or is there not a visible fruit of recluseship?\"",
    "dn2:41": "\"Is it possible, venerable sir, to point out some other fruit of recluseship visible here and now?\"",
    "dn2:42": "\"After some time, he abandons his accumulation of wealth, be it large or small, abandons his circle of relatives, be it large or small; he shaves off his hair and beard, puts on saffron robes, and goes forth from home to homelessness. Having gone forth, he dwells restrained in body, speech, and mind, content with the simplest food and shelter, delighting in solitude. Suppose your men were to report all this to you. Would you say: 'Bring that man back to me, men. Let him again become a farmer, a householder, who pays taxes to maintain the royal revenue'?\"",
    "dn2:43": "\"Certainly not, venerable sir. Rather, we would pay homage to him, rise up out of respect for him, invite him to a seat, and invite him to accept from us robes, almsfood, dwelling, and medicinal requirements. And we would provide him with righteous protection, defence, and security.\"",
    "dn2:44": "\"What do you think, great king? If such is the case, is there or is there not a visible fruit of recluseship?\"",
    "dn2:45": "\"Is it possible, venerable sir, to point out any other fruit of recluseship visible here and now, more excellent and sublime than these two fruits?\"",
    "dn2:46": "The Exalted One spoke: \"Herein, great king, a Tathāgata arises in the world, a worthy one, perfectly enlightened, endowed with clear knowledge and conduct, accomplished, a knower of the world, unsurpassed trainer of men to be tamed, teacher of gods and men, enlightened and exalted. Having realized by his own direct knowledge this world with its gods, its Māras,[n.117] Māra, the personified tempter like the Biblical Satan (he appears in person inDN 16). Both Māra and Brahmā are subject to rebirth, and their ‘office’ is taken over by other beings according to their kamma.and its Brahmās, this generation with its recluses and brahmins, its rulers[n.118]Devaagain, this time in the sense of ‘devas by convention’, i.e. kings.and people, he makes it known to others. He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, possessing meaning and phrasing; he reveals the holy life that is fully complete and purified.",
    "dn2:47": "\"A householder, or a householder's son, or one born into some other family, hears the Dhamma. Having heard the Dhamma, he gains faith in the Tathāgata. Endowed with such faith, he reflects: 'The household life is crowded, a path of dust. Going forth is like the open air. It is not easy for one dwelling at home to lead the perfectly complete, perfectly purified holy life, bright as a polished conch. Let me then shave off my hair and beard, put on saffron robes, and go forth from home to homelessness.'",
    "dn2:48": "\"After some time he abandons his accumulation of wealth, be it large or small; he abandons his circle of relatives, be it large or small; he shaves off his hair and beard, puts on saffron robes, and goes forth from home to homelessness.",
    "dn2:49": "\"When he has thus gone forth, he lives restrained by the restraint of the Pāṭimokkha, possessed of proper behaviour and resort. Having taken up the rules of training, he trains himself in them, seeing danger in the slightest faults. He comes to be endowed with wholesome bodily and verbal action, his livelihood is purified, and he is possessed of moral discipline. He guards the doors of his sense faculties, is endowed with mindfulness and clear comprehension, and is content.",
    "dn2:50": "\"And how, great king, is the bhikkhu possessed of moral discipline? Herein, great king, having abandoned the destruction of life, the bhikkhu abstains from the destruction of life. He has laid down the rod and weapon and dwells conscientious, full of kindness, sympathetic for the welfare of all living beings. This pertains to his moral discipline.",
    "dn2:51": "\"Having abandoned taking what is not given, he abstains from taking what is not given. Accepting and expecting only what is given, he lives in honesty with a pure mind. This too pertains to his moral discipline.",
    "dn2:52": "\"Having abandoned incelibacy, he leads the holy life of celibacy. He dwells aloof and abstains from the vulgar practice of sexual intercourse. This too pertains to his moral discipline.",
    "dn2:53": "\"Having abandoned false speech, he abstains from falsehood. He speaks only the truth, he lives devoted to truth; trustworthy and reliable, he does not deceive anyone in the world. This too pertains to his moral discipline.",
    "dn2:54": "\"Having abandoned slander, he abstains from slander. He does not repeat elsewhere what he has heard here in order to divide others from the people here, nor does he repeat here what he has heard elsewhere in order to divide these from the people there. Thus he is a reconciler of those who are divided and a promoter of friendships. Rejoicing, delighting, and exulting in concord, he speaks only words that are conducive to concord. This too pertains to his moral discipline.",
    "dn2:55": "\"Having abandoned harsh speech, he abstains from harsh speech. He speaks only such words as are gentle, pleasing to the ear, endearing, going to the heart, polite, amiable and agreeable to the manyfolk. This too pertains to his moral discipline.",
    "dn2:56": "\"Having abandoned idle chatter, he abstains from idle chatter. He speaks at the right time, speaks what is factual and beneficial, speaks on the Dhamma and the Discipline. His words are worth treasuring; they are timely, backed by reasons, measured, and connected with the good. This too pertains to his moral discipline.",
    "dn2:57": "\"He abstains from damaging seed and plant life.\"He eats only in one part of the day, refraining from food at night and from eating at improper times.\"He abstains from dancing, singing, instrumental music, and from witnessing unsuitable shows.\"He abstains from wearing garlands, embellishing himself with scents, and beautifying himself with unguents.\"He abstains from high and luxurious beds and seats.\"He abstains from accepting gold and silver.\"He abstains from accepting uncooked grain, raw meat, women and girls, male and female slaves, goats and sheep, fowl and swine, elephants, cattle, horses and mares.\"He abstains from accepting fields and lands.\"He abstains from running messages and errands.\"He abstains from buying and selling.\"He abstains from dealing with false weights, false metals, and false measures.\"He abstains from the crooked ways of bribery, deception, and fraud.\"He abstains from mutilating, executing, imprisoning, robbery, plunder, and violence.\"This too pertains to his moral discipline.",
    "dn2:58": "\"Whereas some recluses and brahmins, while living on food offered by the faithful, continually cause damage to seed and plant life—to plants propagated from roots, stems, joints, buds, and seeds—he abstains from damaging seed and plant life. This too pertains to his moral discipline.",
    "dn2:59": "\"Whereas some recluses and brahmins, while living on food offered by the faithful, enjoy the use of stored-up goods, such as stored-up food, drinks, garments, vehicles, bedding, scents, and comestibles—he abstains from the use of stored-up goods. This too pertains to his moral discipline.",
    "dn2:60": "\"Whereas some recluses and brahmins, while living on food offered by the faithful, attend unsuitable shows, such as:shows featuring dancing, singing, or instrumental music;theatrical performances;narrations of legendsmusic played by hand-clapping, cymbals, and drums;picture houses;acrobatic performances;combats of elephants, horses, buffaloes, bulls, goats, rams, cocks and quails;stick-fights, boxing, and wrestling;sham-fights, roll-calls, battle-arrays, and regimental reviews—",
    "dn2:61": "\"Whereas some recluses and brahmins, while living on food offered by the faithful, indulge in the following games and recreations:",
    "dn2:62": "\"Whereas some recluses and brahmins, while living on food offered by the faithful, enjoy the use of high and luxurious beds and seats, such as:",
    "dn2:63": "\"Whereas some recluses and brahmins, while living on food offered by the faithful, enjoy the use of such devices for embellishing and beautifying themselves as the following:",
    "dn2:64": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, engage in frivolous chatter, such as:",
    "dn2:65": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, engage in wrangling argumentation, (saying to one another):",
    "dn2:66": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, engage in running messages and errands for kings, ministers of state, khattiyas, brahmins, householders, or youths, (who command them): 'Go here, go there, take this, bring that from there'—he abstains from running such messages and errands. This too pertains to his moral discipline.",
    "dn2:67": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, engage in scheming, talking, hinting, belittling others, and pursuing gain with gain, he abstains from such kinds of scheming and talking. This too pertains to his moral discipline.",
    "dn2:68": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as:",
    "dn2:69": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as interpreting the significance of the colour, shape, and other features of the following items to determine whether they portend fortune or misfortune for their owners: gems, garments, staffs, swords, spears, arrows, bows, other weapons, women, men, boys, girls, slaves, slave-women, elephants, horses, buffaloes, bulls, cows, goats, rams, fowl, quails, lizards, earrings (or house-gables), tortoises, and other animals—",
    "dn2:70": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as making predictions to the effect that:",
    "dn2:71": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as predicting:",
    "dn2:72": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as predicting:",
    "dn2:73": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as:",
    "dn2:74": "\"Whereas some recluses and brahmins, while living on the food offered by the faithful, earn their living by a wrong means of livelihood, by such debased arts as:",
    "dn2:75": "\"Great king, the bhikkhu who is thus possessed of moral discipline sees no danger anywhere in regard to his restraint by moral discipline. Just as a head-anointed noble warrior who has defeated his enemies sees no danger anywhere from his enemies, so the bhikkhu who is thus possessed of moral discipline sees no danger anywhere in regard to his restraint by moral discipline. Endowed with this noble aggregate of moral discipline, he experiences within himself a blameless happiness. In this way, great king, the bhikkhu is possessed of moral discipline.",
    "dn2:76": "\"And how, great king, does the bhikkhu guard the doors of his sense faculties? Herein, great king, having seen a form with the eye, the bhikkhu does not grasp at the sign or the details. Since, if he were to dwell without restraint over the faculty of the eye, evil unwholesome states such as covetousness and grief might assail him, he practises restraint, guards the faculty of the eye, and achieves restraint over the faculty of the eye. Having heard a sound with the ear … having smelled an odour with the nose … having tasted a flavour with the tongue … having touched a tangible object with the body … having cognized a mind-object with the mind, the bhikkhu does not grasp at the sign or the details. Since, if he were to dwell without restraint over the faculty of the mind, evil unwholesome states such as covetousness and grief might assail him, he practises restraint, guards the faculty of the mind, and achieves restraint over the faculty of the mind. Endowed with this noble restraint of the sense faculties, he experiences within himself an unblemished happiness. In this way, great king, the bhikkhu guards the doors of the sense faculties.",
    "dn2:77": "\"And how, great king, is the bhikkhu endowed with mindfulness and clear comprehension? Herein, great king, in going forward and returning, the bhikkhu acts with clear comprehension. In looking ahead and looking aside, he acts with clear comprehension. In bending and stretching the limbs, he acts with clear comprehension. In wearing his robes and cloak and using his alms-bowl, he acts with clear comprehension. In eating, drinking, chewing, and tasting, he acts with clear comprehension. In defecating and urinating, he acts with clear comprehension. In going, standing, sitting, lying down, waking up, speaking, and remaining silent, he acts with clear comprehension. In this way, great king, the bhikkhu is endowed with mindfulness and clear comprehension.",
    "dn2:78": "\"And how, great king, is the bhikkhu content? Herein, great king, a bhikkhu is content with robes to protect his body and almsfood to sustain his belly; wherever he goes he sets out taking only (his requisites) along with him. Just as a bird, wherever it goes, flies with its wings as its only burden, in the same way a bhikkhu is content with robes to protect his body and almsfood to sustain his belly; wherever he goes he sets out taking only (his requisites) along with him. In this way, great king, the bhikkhu is content.",
    "dn2:79": "\"Endowed with this noble aggregate of moral discipline, this noble restraint over the sense faculties, this noble mindfulness and clear comprehension, and this noble contentment, he resorts to a secluded dwelling— a forest, the foot of a tree, a mountain, a glen, a hillside cave, a cremation ground, a jungle grove, the open air, a heap of straw. After returning from his alms-round, following his meals, he sits down, crosses his legs, holds his body erect, and sets up mindfulness before him.[n.119]Parimukhatiṁ satiṁ upaṭṭhapetvā:probably means ‘having firmly established mindfulness’. Seen.637.",
    "dn2:80": "\"Having abandoned covetousness for the world, he dwells with a mind free from covetousness; he purifies his mind from covetousness. Having abandoned ill will and hatred, he dwells with a benevolent mind, sympathetic for the welfare of all living beings; he purifies his mind from ill will and hatred. Having abandoned dullness and drowsiness, he dwells perceiving light,[n.120] Cultivation of the perception of light is given as a standard way of overcoming the hindrance of sloth-and-torpor (thīna-midha). See VM 1.140.mindful and clearly comprehending; he purifies his mind from dullness and drowsiness. Having abandoned restlessness and worry, he dwells at ease within himself, with a peaceful mind; he purifies his mind from restlessness and worry. Having abandoned doubt, he dwells as one who has passed beyond doubt, unperplexed about wholesome states; he purifies his mind from doubt.",
    "dn2:81": "\"Great king, suppose a man were to take a loan and apply it to his business, and his business were to succeed, so that he could pay back his old debts and would have enough money left over to maintain a wife. He would reflect on this, and as a result he would become glad and experience joy.",
    "dn2:82": "\"Again, great king, suppose a man were to become sick, afflicted, gravely ill, so that he could not enjoy his food and his strength would decline. After some time he would recover from that illness and would enjoy his food and regain his bodily strength. He would reflect on this, and as a result he would become glad and experience joy.",
    "dn2:83": "\"Again, great king, suppose a man were locked up in a prison. After some time he would be released from prison, safe and secure, with no loss of his possessions. He would reflect on this, and as a result he would become glad and experience joy.",
    "dn2:84": "\"Again, great king, suppose a man were a slave, without independence, subservient to others, unable to go where he wants. After some time he would be released from slavery and gain his independence; he would no longer be subservient to others but a free man able to go where he wants. He would reflect on this, and as a result he would become glad and experience joy.",
    "dn2:85": "\"Again, great king, suppose a man with wealth and possessions were travelling along a desert road where food was scarce and dangers were many. After some time he would cross over the desert and arrive safely at a village which is safe and free from danger. He would reflect on this, and as a result he would become glad and experience joy.",
    "dn2:86": "\"In the same way, great king, when a bhikkhu sees that these five hindrances are unabandoned[n.121] The five hindrances are temporarily dispelled by the jhāna states.within himself, he regards that as a debt, as a sickness, as confinement in prison, as slavery, as a desert road.",
    "dn2:87": "\"But when he sees that these five hindrances have been abandoned within himself, he regards that as freedom from debt, as good health, as release from prison, as freedom from slavery, as a place of safety.",
    "dn2:88": "\"When he sees that these five hindrances have been abandoned within himself, gladness arises. When he is gladdened, rapture arises. When his mind is filled with rapture, his body becomes tranquil; tranquil in body, he experiences happiness; being happy, his mind becomes concentrated.",
    "dn2:89": "\"Quite secluded from sense pleasures, secluded from unwholesome states, he enters and dwells in the first jhāna, which is accompanied by applied and sustained thought and filled with the rapture and happiness born of seclusion. He drenches, steeps, saturates, and suffuses his body with this rapture and happiness born of seclusion, so that there is no part of his entire body which is not suffused by this rapture and happiness.",
    "dn2:90": "\"Great king, suppose a skilled bath attendant or his apprentice were to pour soap-powder into a metal basin, sprinkle it with water, and knead it into a ball, so that the ball of soap-powder be pervaded by moisture, encompassed by moisture, suffused with moisture inside and out, yet would not trickle. In the same way, great king, the bhikkhu drenches, steeps, saturates, and suffuses his body with the rapture and happiness born of seclusion, so that there is no part of his entire body which is not suffused by this rapture and happiness. This, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.[n.122] This concludes the Buddha’s answer to the first part of the question posed in verse41.",
    "dn2:91": "\"Further, great king, with the subsiding of applied and sustained thought, the bhikkhu enters and dwells in the second jhāna, which is accompanied by internal confidence and unification of mind, is without applied and sustained thought, and is filled with the rapture and happiness born of concentration. He drenches, steeps, saturates, and suffuses his body with this rapture and happiness born of concentration, so that there is no part of his entire body which is not suffused by this rapture and happiness.",
    "dn2:92": "\"Great king, suppose there were a deep lake whose waters welled up from below. It would have no inlet for water from the east, west, north, or south, nor would it be refilled from time to time with showers of rain; yet a current of cool water, welling up from within the lake, would drench, steep, saturate and suffuse the whole lake, so that there would be no part of that entire lake which is not suffused with the cool water. In the same way, great king, the bhikkhu drenches, steeps, saturates, and suffuses his body with the rapture and happiness born of concentration, so that there is no part of his entire body which is not suffused by this rapture and happiness. This too, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.",
    "dn2:93": "\"Further, great king, with the fading away of rapture, the bhikkhu dwells in equanimity, mindful and clearly comprehending, and experiences happiness with the body. Thus he enters and dwells in the third jhāna, of which the noble ones declare: 'He dwells happily with equanimity and mindfulness.' He drenches, steeps, saturates, and suffuses his body with this happiness free from rapture, so that there is no part of his entire body which is not suffused by this happiness.",
    "dn2:94": "\"Great king, suppose in a lotus pond there were blue, white, or red lotuses[n.123]Uppala(Skt.utpala), paduma (Skt.padma),puṇḍarīkaare different kinds of lotus, usually of the colour mentioned.that have been born in the water, grow in the water, and never rise up above the water, but flourish immersed in the water. From their tips to their roots they would be drenched, steeped, saturated, and suffused with cool water, so that there would be no part of those lotuses not suffused with cool water. In the same way, great king, the bhikkhu drenches, steeps, saturates and suffuses his body with the happiness free from rapture, so that there is no part of his entire body which is not suffused by this happiness. This too, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.",
    "dn2:95": "\"Further, great king, with the abandoning of pleasure and pain, and with the previous passing away of joy and grief, the bhikkhu enters and dwells in the fourth jhāna, which is neither pleasant nor painful and contains mindfulness fully purified by equanimity. He sits suffusing his body with a pure bright mind, so that there is no part of his entire body not suffused by a pure bright mind.",
    "dn2:96": "\"Great king, suppose a man were to be sitting covered from the head down by a white cloth, so that there would be no part of his entire body not suffused by the white cloth. In the same way, great king, the bhikkhu sits suffusing his body with a pure bright mind, so that there is no part of his entire body not suffused by a pure bright mind. This too, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.",
    "dn2:97": "\"When his mind is thus concentrated, pure and bright, unblemished, free from defects,[n.124]Upakilesa:to be distinguished fromkilesa‘defilement’. Perhaps the ten ‘imperfections of insight’ listed in VM 20.105ff. are meant; most of these are not defilements in themselves, but potential hindrances at a certain stage of insight meditation.malleable, wieldy, steady and attained to imperturbability, he directs and inclines it to knowledge and vision. He understands thus: 'This is my body, having material form, composed of the four primary elements, originating from father and mother, built up out of rice and gruel, impermanent, subject to rubbing and pressing, to dissolution and dispersion. And this is my consciousness, supported by it and bound up with it.'[n.125] RD points out that this and other passages disprove the idea that consciousness (viññāṇa) transmigrates. For holding this belief Sāti was severely rebuked by the Buddha (MN 38). A new relinking consciousness (patisandhi) arises at conception, dependent on the old (see VM 17.164ff.).",
    "dn2:98": "\"Great king, suppose there were a beautiful beryl[n.126]Veḷuriya:from a metathetised formveruliyacomes Greekberyllos‘beryl’, whence GermanBrille‘spectacles’ (originally of beryl).gem of purest water, eight-faceted, well cut, clear, limpid, flawless, endowed with all excellent qualities. And through it there would run a blue, yellow, red, white, or brown thread. A man with keen sight, taking it in his hand, would reflect upon it thus: 'This is a beautiful beryl gem of purest water, eight faceted, well cut, clear, limpid, flawless, endowed with all excellent qualities. And running through it there is this blue, yellow, red, white, or brown thread.' In the same way, great king, when his mind is thus concentrated, pure and bright … the bhikkhu directs and inclines it to knowledge and vision and understands thus: 'This is my body, having material form … . and this is my consciousness, supported by it and bound up with it.' This, too, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.",
    "dn2:99": "\"When his mind is thus concentrated, pure and bright, unblemished, free from defects, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines it to creating a mind-made body. From this body he creates another body having material form,[n.127] Exactly like the physical body: cf.n.49.This mind-made body is what is mistaken for a soul or self.mind-made, complete in all its parts, not lacking any faculties.",
    "dn2:100": "\"Great king, suppose a man were to draw out a reed from its sheath. He would think: 'This is the reed; this is the sheath. The reed is one thing, the sheath another, but the reed has been drawn out from the sheath.' Or suppose a man were to draw a sword out from its scabbard. He would think: 'This is the sword; this is the scabbard. The sword is one thing, the scabbard another, but the sword has been drawn out from the scabbard.' Or suppose a man were to pull a snake out from its slough. He would think: 'This is the snake; this is the slough. The snake is one thing, the slough another, but the snake has been pulled out from the slough.' In the same way, great king, when his mind is thus concentrated, pure and bright … The bhikkhu directs and inclines it to creating a mind-made body. From this body he creates another body having material form, mind-made, complete in all its parts, not lacking any faculties. This too, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.",
    "dn2:101": "\"When his mind is thus concentrated, pure and bright, unblemished, free from defects, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines it to the modes of supernormal power.[n.128]Iddhi(Skt.ṛddhi, not, as often stated,siddhi): translated by RD as ‘The Wondrous Gift’ and glossed as ‘well-being, prosperity’. With dawning recognition of ESP, it is no longer necessary to discount these powers. But despite his mention of them here, the Buddha disapproved of these practices (seeDN 11.5).He exercises the various modes of supernormal power: having been one, he becomes many and having been many, he becomes one; he appears and vanishes; he goes unimpeded through walls, ramparts, and mountains as if through space; he dives in and out of the earth as if it were water; he walks on water without sinking as if it were earth; sitting cross-legged he travels through space like a winged bird; with his hand he touches and strokes the sun and the moon, so mighty and powerful;[n.129] DA has no useful comment on this, and modem commentators too are silent, but ‘touching the sun and moon’ probably refers to some psychic experience. In any case it is certainly not to be taken literally.he exercises mastery over the body as far as the Brahma-world.",
    "dn2:102": "\"Great king, suppose a skilled potter or his apprentice were to make and fashion out of well-prepared clay whatever kind of vessel he might desire. Or suppose a skilled ivory-worker or his apprentice were to make and fashion out of well-prepared ivory whatever kind of ivory work he might desire. Or suppose a skilled goldsmith or his apprentice were to make and fashion out of well-prepared gold whatever kind of gold work he might desire. In the same way, great king, when his mind is thus concentrated, pure and bright … the bhikkhu directs and inclines it to the modes of supernormal power and exercises the various modes of supernormal power. This too, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.",
    "dn2:103": "\"When his mind is thus concentrated, pure and bright, unblemished, free from defects, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines it to the divine ear-element.[n.130]Dibba-sota:clairaudience (cf.n.72).With the divine ear-element, which is purified and surpasses the human, he hears both kinds of sound, the divine and the human, those which are distant and those which are near.",
    "dn2:104": "\"Great king, suppose a man travelling along a highway were to hear the sounds of kettledrums, tambours, horns, cymbals and tom-toms, and would think: 'This is the sound of kettledrums, this is the sound of tambours, this the sound of horns, cymbals and tom-toms.' In the same way, great king, when his mind is thus concentrated, pure and bright … the bhikkhu directs and inclines it to the divine ear-element. With the divine ear-element, which is purified and surpasses the human, he hears both kinds of sound, the divine and the human, those which are distant and those which are near. This too, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.",
    "dn2:105": "\"When his mind is thus concentrated, pure and bright, unblemished, free from defects, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines it to the knowledge of encompassing the minds (of others). He understands the minds of other beings and persons, having encompassed them with his own mind. He understands a mind with lust as a mind with lust[n.131] The following list of mental states is doubtless taken fromDN 22.40, where it is more appropriate. For notes, see there.and a mind without lust as a mind without lust; he understands a mind with hatred as a mind with hatred and a mind without hatred as a mind without hatred; he understands a mind with delusion as a mind with delusion and a mind without delusion as a mind without delusion; he understands a contracted mind as a contracted mind and a distracted mind as a distracted mind; he understands an exalted mind as an exalted mind and an unexalted mind as an unexalted mind; he understands a surpassable mind as a surpassable mind and an unsurpassable mind as an unsurpassable mind; he understands a concentrated mind as a concentrated mind and an unconcentrated mind as an unconcentrated mind; he understands a liberated mind as a liberated mind and an unliberated mind as an unliberated mind.",
    "dn2:106": "\"Great king, suppose a young man or woman, fond of ornaments, examining his or her own facial reflection in a pure bright mirror or in a bowl of clear water, would know, if there were a mole, 'It has a mole,' and if there were no mole, 'It has no mole.' In the same way, great king, when his mind is thus concentrated, pure and bright … the bhikkhu directs and inclines it to the knowledge of encompassing the minds (of others). He understands the minds of other beings and persons, having encompassed them with his own mind. This too, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.",
    "dn2:107": "\"When his mind is thus concentrated, pure and bright, unblemished, free from defects, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines it to the knowledge of recollecting past lives. He recollects his numerous past lives, that is, one birth, two births, three, four, or five births; ten, twenty, thirty, forty, or fifty births; a hundred births, a thousand births, a hundred thousand births; many aeons of world contraction, many aeons of world expansion, many aeons of world contraction and expansion, (recollecting): 'There I had such a name, belonged to such a clan, had such an appearance; such was my food, such my experience of pleasure and pain, such my span of life. Passing away from that state, I re-arose there. There too I had such a name, belonged to such a clan, had such an appearance; such was my food, such my experience of pleasure and pain, such my span of life. Passing away from that state I re-arose here.' Thus he recollects his numerous past lives in their modes and their details.",
    "dn2:108": "\"Great king, suppose a man were to go from his own village to another village, then from that village to still another village, and then from that village he would return to his own village. He would think to himself: 'I went from my own village to that village. There I stood in such a way, sat in such a way, spoke in such a way, and remained silent in such a way. From that village I went to still another village. There too I stood in such a way, sat in such a way, spoke in such a way, and remained silent in such a way. From that village I returned to my own village.'[n.132] The three villages are the three worlds of Sense-Desire, of Form, and the Formless World (DA).In the same way, great king, when his mind is thus concentrated, pure and bright … the bhikkhu directs and inclines it to the knowledge of recollecting past lives, and he recollects his numerous past lives in their modes and their details. This too, great king, is a visible fruit of recluseship, more excellent and sublime than the previous ones.",
    "dn2:109": "\"When his mind is thus concentrated, pure and bright, unblemished, free from defects, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines it to the knowledge of the passing away and reappearance of beings. With the divine eye,[n.133]Dibba-cakkhu:clairvoyance, not to be confused with the Dhamma-eye (verse ). Seen.140.which is purified and surpasses the human, he sees beings passing away and reappearing—inferior and superior, beautiful and ugly, fortunate and unfortunate—and he understands how beings fare according to their kamma, thus: 'These beings—who were endowed with bad conduct of body, speech, and mind, who reviled the noble ones, held wrong views, and undertook actions governed by wrong views—with the breakup of the body, after death, have reappeared in the plane of misery, the bad destinations, the lower realms, in hell. But these beings—who were endowed with good conduct of body, speech, and mind, who did not revile the noble ones, held right views, and undertook actions governed by right views—with the breakup of the body, after death, have reappeared in the good destinations, in the heavenly world.' Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing—inferior and superior, beautiful and ugly, fortunate and unfortunate—and he understands how beings fare in accordance with their kamma.",
    "dn2:110": "\"Great king, suppose in a central square there were a building with an upper terrace, and a man with keen sight standing there were to see people entering a house, leaving it, walking along the streets, and sitting in the central square. He would think to himself: 'Those people are entering the house, those are leaving it, those are walking along the streets, and those are sitting in the central square.' In the same way, great king, when his mind is thus concentrated, pure and bright … the bhikkhu directs and inclines it to the knowledge of the passing away and reappearance of beings. With the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing, and he understands how beings fare according to their kamma. This too, great king, is a visible fruit of recluseship more excellent and sublime than the previous ones.",
    "dn2:111": "\"When his mind is thus concentrated, pure and bright, unblemished, free from defects, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines it to the knowledge of the destruction of the cankers.[n.134]Āsavā:fromā-savati‘flows towards’ (i.e. either ‘into’, or ‘out’ towards the observer). Variously translated ‘biases’, ‘intoxicants’, ‘influxes’, ‘cankers’ or ‘Deadly Taints’ (RD). A further corruption, that of wrong views (diṭṭhāsava) is sometimes added. The destruction of the āsavas is equivalent to Arahantship.He understands as it really is: 'This is suffering.' He understands as it really is: 'This is the origin of suffering.' He understands as it really is: 'This is the cessation of suffering.' He understands as it really is: 'This is the way leading to the cessation of suffering.' He understands as it really is: 'These are the cankers.' He understands as it really is: 'This is the origin of the cankers.' He understands as it really is: 'This is the cessation of the cankers.' He understands as it really is: 'This is the way leading to the cessation of the cankers.'",
    "dn2:112": "\"Great king, suppose in a mountain glen there were a lake with clear water, limpid and unsullied. A man with keen sight, standing on the bank, would see oyster-shells, sand and pebbles, and shoals of fish moving about and keeping still. He would think to himself: 'This is a lake with clear water, limpid and unsullied, and there within it are oyster-shells, sand and pebbles, and shoals of fish moving about and keeping still.'",
    "dn2:113": "When the Exalted One had finished speaking, King Ajātasattu said to him: \"Excellent, venerable sir! Excellent, venerable sir! Just as if one were to turn upright what had been turned upside down, or to reveal what was hidden, or to point out the right path to one who was lost, or to bring a lamp into a dark place so that those with keen sight could see forms, in the same way, venerable sir, the Exalted One has revealed the Dhamma in numerous ways. I go for refuge to the Exalted One, to the Dhamma, and to the Bhikkhu Saṅgha. Let the Exalted One accept me as a lay follower gone for refuge from this day onwards as long as I live.",
    "dn2:114": "\"Venerable sir, a transgression[n.137]Accayo:often rendered (as by RD) ‘sin’, but this term with its theistic connotations is best avoided when translating Buddhist texts.overcame me. I was so foolish, so deluded, so unskilful that for the sake of rulership I took the life of my own father, a righteous man and a righteous king. Let the Exalted One acknowledge my transgression as a transgression for the sake of my restraint in the future.\"[n.138] This is the formula used by bhikkhus when confessing transgressions.",
    "dn2:115": "When this was said, King Ajātasattu said to the Exalted One: \"Now, venerable sir, we must go. We have many tasks and duties.\"",
    "dn2:116": "Soon after King Ajātasattu had left, the Exalted One addressed the bhikkhus: \"This king, bhikkhus, has ruined himself; he has injured himself.[n.139]Khatâyaṁ bhikkhave rājā, upahatâyaṁ bhikkhave rājā.RD went astray with his translation here: ‘This king, brethren, was deeply affected, he was touched in heart.’ Lit. ‘uprooted and destroyed’, the expression indicates that Ajātasattu was inhibited by his kamma from obtaining the results that would otherwise have accrued, since parricide is one of the evil acts ‘with immediate result’ (in the next world) that cannot be avoided. According to DA, he was unable to sleep until his visit to the Buddha.Bhikkhus, if this king had not taken the life of his father, a righteous man and a righteous king, then in this very seat there would have arisen in him the dust-free, stainless eye of Dhamma.\"[n.140] The opening of the Dhamma-eye (dhamma-cakkhu) is a term for ‘entering the stream’ and thus being set irrevocably on the path. As RD points out, it is superior to the divine eye (dibba-cakkhu:verse 109andn.133), which is a superior kind of clairvoyance, and below the wisdom-eye (paññā-cakkhu), which is the wisdom of the Arahant.",
    "dn2:117": "Thus spoke the Exalted One. Elated in mind, the bhikkhus rejoiced in the Exalted One's word."
}