{
    "dn30:1": "Thus have I heard.[n.939] This Sutta may seem the most uninteresting and unedifying of the entire Nikāya. Yet, properly considered, it has its interest, first, as an example of the forms Buddhist propaganda was perhaps sometimes obliged to assume, and also from the point of view of iconography, as some of the marks came to be depicted in images of the Buddha: the great reclining Buddha-figure in Wat Pho in Bangkok is a well-known example. RD has a wide-ranging introduction tracing the possible origins of such marks, which clearly must have been important in the minds of influential Brahmins in the time of the Buddha (see, e.g.DN 3). However, later Brahmin tradition has preserved very little about them. Certainly, many of them seem quite arbitrary and even difficult to distinguish clearly. Nevertheless, there are more traces of their influence in later Buddhist writing (and, as observed, iconography) than RD is anxious to admit, and there are even 'eighty minor marks' mentioned in addition to the thirty-two major ones here listed. Both lists, major and minor, are found in the Dharma-Samigraha (ed. Kenjiu Kasawara and F. Max Müller, 885, rep. Delhi 98), carefully collated with the lists as they occur in the present Sutta and elsewhere. RD remarks that 'most of the marks are so absurd, considered as marks of any human, that they are probably mythological in origin, and three or four seem to be solar.' He adds that 'our Suttanta seems gravely ironical in the contrast it makes between the absurdity of the marks and the beauty of the ethical qualities they are supposed, in the Suttanta, to mean.' But it must be added that, however absurdly as regards the details, they are intended to show the relation between action and karmic result, and they could have been used pedagogically to inculcate this lesson. Scholars are agreed on the fairly obvious fact that this is one of the latest texts in the Nikaya, and this is even hinted at in the commentary itself. The verses, ascribed to Ananda, show an exceptionally wide variety of metres, but all of late types. It is possible that someone tried to give this unpromising material some literary grace by dexterous versification. I considered trying to reproduce the different metrical forms in translation, but decided this was beyond my powers. Perhaps some other translator will attempt this one day.Once the Lord was staying at Sāvatthī, in Jetavana, Anathapindikaʹs park. 'Monks!' he said, and the monks replied: 'Lord.' The Lord said:",
    "dn30:2": "'There are, monks, these thirty-two marks peculiar to a Great Man,[n.940]Mahāpurisa.Though a 'Great Man', endowed with very special qualities, the Buddha as born on earth is still a man. Cf.n.89.and for that Great Man who possesses them, only two careers are open. If he lives the household life, he will become a ruler, a wheel-turning righteous monarch of the law, conqueror of the four quarters, who has established the security of his realm and is possessed of the seven treasures. These are: the Wheel Treasure, the Elephant Treasure, the Horse Treasure, the Jewel Treasure, the Woman Treasure, the Householder Treasure, and, as seventh, the Counsellor Treasure. He has more than a thousand sons who are heroes, of heroic stature, conquerors of the hostile army. He dwells having conquered this sea-girt land without stick or sword, by the law. But if he goes forth from the household life into homelessness, he will become an Arahant, a fully-enlightened Buddha, who has drawn back the veil from the world.",
    "dn30:3": "'And what are these thirty-two marks?",
    "dn30:4": "He has feet with level tread.[n.91] This appears to mean flat feet! See RD's notes to DN 1.32.This is one of the marks of a Great Man.",
    "dn30:5": "On the soles of his feet are wheels with a thousand spokes, complete with felloe and hub.",
    "dn30:6": "He has projecting heels. (4) He has long fingers and toes.[n.942](5) He has soft and tender hands and feet. () His hands and feet are net-like.[n.943] Or reticulated.(7) He has high-raised ankles.[n.944] Or with the ankle half-way up the calf.(8) His legs are like an antelope’s. (9) Standing and without bending, he can touch and rub his knees with either hand. (10) His male organs are enclosed in a sheath. (11) His complexion is bright, the colour of gold. (12) His skin is delicate and so smooth that no dust can adhere to his body. (13) His body-hairs are separate, one to each pore. (14) His body-hairs grow upwards, each one bluish-black like collyrium,[n.945] 945 Used as a cosmetic.curling in rings to the right. (15) His body is divinely straight.[n.94] Like Brahmā.(1) He has the seven convex surfaces.[n.947] The backs of the four limbs, the shoulders and the trunk are well-rounded (RD).(17) The front part of his body is like a lion’s. (18) There is no hollow between his shoulders. (19) He is proportioned like a banyan-tree: the height of his body is the same as the span of his outstretched arms, and conversely. (20) His bust is evenly rounded. (21) He has a perfect sense of taste.[n.948] Explained below. It is hard to know how Pokkharasati (DN 3) observed this!(22) He has jaws like a lion’s. (23) He has forty teeth. (24) His teeth are even. (25) There are no spaces between his teeth. (2) His canine teeth are very bright. (27) His tongue is very long. (28) He has a Brahmā-like voice, like that of the karavīka-bird. (29) His eyes are deep blue. (30) He has eyelashes like a cow’s. (31) The hair[n.949] Or a hairy mole.between his eyes is white and soft like cotton-down.",
    "dn30:7": "(32) His head is like a royal turban.[n.950]Uṇhīsa(Skt.uṣnīṣa), represented iconographically by a protuberance on the top of the head. Incidentally, the elongated ear-lobes commonly seen in Buddha-images do not figure in the list.This is one of the marks of a Great Man. This is one of the marks of a Great Man.",
    "dn30:8": "'These, monks, are the thirty-two marks peculiar to a Great Man, and for that Great Man who possesses them only two courses are open…",
    "dn30:9": "And sages of other communions[n.51] This provides the excuse for listing them here.know these thirty-two marks, but they do not know the karmic reasons for the gaining of them.",
    "dn30:10": "'Monks, in whatever former life, former existence or dwelling-place the Tathagata, being born a human being, undertook mighty deeds to good purpose, unwavering in good conduct of body, speech and thought, in generosity, self-discipline, observance of the fast-day, in honouring parents, ascetics and Brahmins and the head of the clan, and in other highly meritorious acts; by performing that kamma, heaping it up, lavishly and abundantly, at the breaking-up of the body after death he was reborn in a happy state, in a heavenly world, where he was endowed beyond other devas in ten respects: in length of heavenly life, beauty, happiness, splendour, influence, and in heavenly sights, sounds, smells, tastes and contacts. Falling away from there and coming to be reborn here on earth, he acquired this mark of the Great Man: feet with level tread, so that he places his foot evenly on the ground, lifts it evenly, and touches the ground evenly with the entire sole.",
    "dn30:11": "'Being endowed with this mark, if he keeps to the household life, he will become a wheel-turning monarch…Conquering without stick or sword, but by justice, he rules over this earth as far as its ocean-boundaries, a land open, uninfested by brigands, free from jungle, powerful, prosperous, happy and free from perils. As a ruler, how does he benefit? He cannot be impeded by any human foe with ill-intent. That is his benefit as a ruler. And if he goes forth into homelessness, he will become a fully-enlightened Buddha … As such, how does he benefit? He has a large retinue: he is surrounded by monks, nuns, male and female lay-followers, devas and humans, asuras, nāgas and gandhabbas. That is his benefit as a Buddha.’ This was what the Lord declared.",
    "dn30:12": "About this it was said:",
    "dn30:13": "'Truthful, righteous, tamed and stilled,Pure and virtuous, keeping fasts,Generous, harming none, at peaceHe undertook this mighty task,",
    "dn30:14": "And at his end to heaven went,To dwell in joy and happiness.Returned from there to earth, his feetWith level tread did touch the ground.",
    "dn30:15": "Assembled augurs then declared:\"For him who level treads the ground,No obstacles can bar his path,If he leads the household life,Or if he leaves the world behind:",
    "dn30:16": "This the mark does clearly show.If a layman, no adversary,No foe can stand before him.No human power exists that canDeprive him of his kamma's fruit.",
    "dn30:17": "Or if the homeless life's his choice:On renunciation bent, and clearOf vision — chief of men he'll be,Peerless, never more reborn:This the law shall be for him.\"'",
    "dn30:18": "'Monks, in whatever former life … the Tathagata, being born a human being, lived for the happiness of the many, as a dispeller of fright and terror, provider of lawful protection and shelter, and supplying all necessities, by performing that kamma, … was reborn in a happy state, a heavenly world… Falling away from there and coming to be reborn here on earth, he acquired this mark of the Great Man: on the soles of his feet are wheels of a thousand spokes, complete with felloe and hub.",
    "dn30:19": "'Being endowed with this mark, if he keeps to the household life, he will become a wheel-turning monarch … As a ruler, how does he benefit? He has a great retinue: he is surrounded by Brahmin householders, citizens and villagers, treasurers, guards, doorkeepers, ministers, tributary kings, tenants-in-chief, and pages. That is his benefit as a ruler. And if he goes forth into homelessness, he will become a fully-enlightened Buddha…As such, how does he benefit? He has a large retinue: he is surrounded by monks, nuns, male and female lay-followers, devas and humans, asuras,[n.952] Seen.512.nāgas and gandhabbas.[n.953] Seen.524.That is his benefit as a Buddha.' This was what the Lord declared.",
    "dn30:20": "About this it was said:",
    "dn30:21": "'In times gone by, in former birthsAs man, to many doing good,Dispelling fright and panic fear,Eager to guard and give defence,He undertook this mighty task,",
    "dn30:22": "And at his end to heaven went,To dwell in joy and happiness.Returned from there to earth, his feetAre found to bear the mark of wheels,",
    "dn30:23": "Each a thousand-spoked, complete.Assembled augurs then declared,Seeing these many marks of merit:\"Great will be his following,All his foes he will subdue.",
    "dn30:24": "This is the wheel-marks clearly show.If he does not renounce the world,He'll turn the Wheel, and rule the earth.The nobles will his vassals be,",
    "dn30:25": "All in attendance on his power.But if the homeless life's his choice:On renunciation bent, and clearOf vision — men and devasasuras, sakkas, rakkhasas,[n.954] A class of man-eating demons.",
    "dn30:26": "gandhabbas, nagas, garudas,Four-foot beasts will serve him too,Unrivalled, by devas and by menAlike revered in all his glory.\"'",
    "dn30:27": "'Monks, in whatever former life…the Tathāgata, being born a human being, rejecting the taking of life and abstaining from it, and laying aside stick and sword, dwelt, kind and compassionate, having friendship and sympathy for all living beings, by performing that kamma, … was reborn in a happy state … Falling away from there and coming to be reborn on earth, he acquired these three marks of the Great Man: projecting heels, long fingers and toes, and a divinely straight body.",
    "dn30:28": "'Being endowed with these marks, if he keeps to the household life,…as a ruler, how does he benefit? He is long-lived, long-enduring, attaining a great age, and during that time no human foe can possibly take his life…As a Buddha, how does he benefit? He is long-lived … ; no foe, whether an ascetic or Brahmin, a deva, mara or Brahma, or anyone in the world can possibly take his life. That is his benefit as a Buddha.' This was what the Lord declared.",
    "dn30:29": "About this it was said:",
    "dn30:30": "'Knowing well their dread of death,Beings he forbore to kill.This goodness earnt him heavenly birth,Where he rejoiced in merit's fruit.",
    "dn30:31": "Returning thence to earth he boreOn his person these three marks:His heels are full and very long,Brahma like he's straight of form,",
    "dn30:32": "Fair to see, and shapely-limbed,His fingers tender, soft and long.By these three marks of excellenceIt's known the youth will be long-lived.",
    "dn30:33": "\"Long he'll live in household lifeLonger still as homeless onePractising the noble powers:So the three marks indicate.\"'",
    "dn30:34": "'Monks, in whatever former life… the Tathagata became a giver of fine food, delicious and tasty, hard and soft, and of drinks, by performing that kamma, … he was reborn in a heavenly world…Falling away from there and being reborn here on earth, he acquired this mark of the Great Man: the seven convex surfaces, on both hands, both feet, both shoulders and his trunk.",
    "dn30:35": "'Being endowed with this mark,…as a ruler, how does he benefit? He receives fine food and drinks… As a Buddha, likewise.' This is what the Lord said.",
    "dn30:36": "About this it was said:",
    "dn30:37": "'Dispenser of delicious foodsAnd finest-tasting drinks he was.This goodness brought him happy birth,And long he dwelt in Nandana.[n.955] 'Place of delight', a term for the heavenly realms.",
    "dn30:38": "To earth returned, the seven signsOn gently-swelling limbs he bore.Assembled augurs then declared,Fine food and drink he would enjoy:",
    "dn30:39": "Not merely in the household life —For though he should renounce the worldAnd cut the bonds of worldly living,Delicious food he'd still receive!'",
    "dn30:40": "'Monks, in whatever former life … the Tathagata made himself beloved through the four bases of sympathy:[n.956] Sangaha-vatthū.generosity, pleasing speech, beneficial conduct and impartiality, … on returning to this earth he acquired these two marks of the Great Man: soft and tender hands and feet, and net-like hands and feet.",
    "dn30:41": "'Being endowed with these two marks,…as a ruler, how does he benefit? All his retinue are well-disposed to him: Brahmin householders, citizens and villagers, treasurers, guards, doorkeepers, … pages. As a Buddha, how does he benefit? All his followers are well-disposed to him: monks, nuns, male and female lay-folowers, devas and humans, asuras, nagas, gandhabbas. That is his benefit as a Buddha.' This is what the Lord said.",
    "dn30:42": "About this it was said:",
    "dn30:43": "ʹThrough giving and through helpful acts,Pleasing speech and evennessOf mind, of benefit to all,He at death to heaven went.",
    "dn30:44": "When he thence returned to earth,His hands and feet were soft and tender,His toes and fingers netwise spread.Very fair he was to see:Thus the infant was endowed.",
    "dn30:45": "ʺHeʹll be ruler of the people,Surrounded by a faithful flock.Fair of speech, to good deeds given,In conduct virtuous and wise.",
    "dn30:46": "But if the joys of sense he spurns,A Conqueror, he will teach the path,And, delighted by his words,All those who hear will follow himIn Dhamma's great and lesser ways!ʺʹ",
    "dn30:47": "'Monks, in whatever former life … the Tathagata became a speaker to the people about their welfare, about Dhamma, explaining this to people and being a bearer of welfare and happiness to beings, a dispenser of Dhamma,…on returning to this earth he acquired these two marks of the Great Man: high-raised ankles, and upward-growing body-hairs.",
    "dn30:48": "'Being endowed with these marks,…as a ruler, how does he benefit? He becomes the chief, foremost, highest, supreme among the unrenounced[n.957] As at DN 29.13.… As a Buddha, he becomes the chief, foremost, highest, supreme among all beings. That is his benefit as a Buddha.' This was what the Lord declared.",
    "dn30:49": "About this it was said:",
    "dn30:50": "ʹOne time he spoke of all that's good,Preaching loud to all mankind,Bringing blessings to all beings,Liberal dispenser of the law.",
    "dn30:51": "For such conduct and such deeds,Heavenly birth was his reward.Here returned, two marks were his,Marks of happiness supreme:",
    "dn30:52": "Upward-growing body-hairs,Ankles high above the foot,Built up beneath the flesh and skin,Well-formed above, and beautiful.",
    "dn30:53": "\"If he leads the household life,The greatest riches will be his,No greater man will be found:As Jambudipāʹs Lord he'll rule.",
    "dn30:54": "If, supremely strong, he leaves the world,He will be the chief of beings,No man greater will be found:As Lord of all the world he'll rule.ʺʹ",
    "dn30:55": "'Monks, in whatever former life…the Tathagata became a skilled exponent of a craft, a science, a way of conduct or action, thinking: \"What can I learn quickly and acquire, quickly practise, without undue weariness?ʺ… on returning to earth, he acquires this mark of the Great Man: legs like an antelope's.",
    "dn30:56": "'Being endowed with this mark,…as a ruler he quickly acquires whatever things befit a ruler, the things that pertain to a ruler, delight him and are appropriate to him. As a Buddha, likewise.' This was what the Lord declared.",
    "dn30:57": "About that it was said:",
    "dn30:58": "'Arts and sciences, ways and deeds:\"Let me learn with ease\", he says.Skills that harm no living thingFast he learnt, with little toil.",
    "dn30:59": "From such deeds, skilled and sweet,Graceful and fair his limbs will be,While fairly set in spiral curvesFrom tender skin the hairs stand up.",
    "dn30:60": "Antelope-legged is such a man:Wealth, they say, will soon be his.\"Each single hairlet brings him luck,If he maintains the household life.",
    "dn30:61": "But should he choose to leave the worldOn renunciation set,Clear-eyed, all things he'll quickly findBefitting such a lofty course.ʺʹ.",
    "dn30:62": "'Monks, in whatever former life…the Tathāgata approached an ascetic or Brahmin and asked: \"Sir, what is the good, what is the bad? What is blameworthy, what is not? What course is to be followed, what is not? What, if I do it, will be to my lasting sorrow and harm, what to my lasting happiness?ʺ[n.958] Cf. DN 26.5.… on returning to this earth, he acquired this mark of the Great Man: his skin is so delicate and smooth that no dust can adhere to his body.",
    "dn30:63": "'Being endowed with this mark,… as a ruler he will be very wise, and among the unrenounced there will be none equal or superior to him in wisdom … As a Buddha he will have great wisdom, extensive wisdom, joyous wisdom, swift wisdom, penetrative wisdom, discerning wisdom,[n.959] As atMN 111.2and elsewhere. Explained at PD 21.20.and among all beings there will be none equal to him or superior to him in wisdom.' This was what the Lord declared.",
    "dn30:64": "About this it was said:",
    "dn30:65": "ʹIn former days, in former births,Eager to know, a questioner,He waited on the homeless ones:Keen to learn the truth, he wouldHeed their words about life's goal.",
    "dn30:66": "The fruit of this, when born againAs man, his skin was soft and tender.Assembled augurs thus declared:\"Subtle meanings he'll discern.",
    "dn30:67": "If he does not leave the world,He'll be a wheel-revolving kingWise to know all subtleties,Equalled or surpassed by none.",
    "dn30:68": "But should he choose to leave the worldOn renunciation set,Highest wisdom will be his,Enlightenment supreme and vast.ʺʹ",
    "dn30:69": "'Monks, in whatever former life…the Tathāgata lived without anger, perfectly unruffled, and even after many words had been uttered was not abusive, or agitated, or wrathful, or aggressive, displaying neither anger nor hatred nor resentment, but was in the habit of giving away fine, soft rugs, cloaks, fine linen, cotton, silk and woollen stuffs,…on returning to this earth, he acquired this mark of the Great Man: a bright complexion, the colour of gold.",
    "dn30:70": "'Being endowed with this mark,…as a ruler he will receive such fine stuffs,…as a Buddha, likewise.' This was what the Lord declared.",
    "dn30:71": "About this it was said:",
    "dn30:72": "'Established in goodwill, he gaveGifts of clothing, soft and fine.In former lives he thus dispensedAs the rain-god pours down showers.",
    "dn30:73": "This goodness brought him heavenly birth.Where he rejoiced in merit's fruit.That time past, like fine-wrought goldHis body is, more fair than allThe gods he seems, great Indra's like.",
    "dn30:74": "'If he lives the household life,He'll regulate this wicked world,And, for what he's done, receiveClothes of finest quality,",
    "dn30:75": "Rugs and coverlets of the best.And should he choose to leave the world,Such things likewise he'll receive:Virtue's fruit can not be lost.ʺʹ",
    "dn30:76": "'Monks, in whatever former life … the Tathāgata reunited those long-lost with relatives, friends and companions who had missed them, reunited mother with child and child with mother, father with child and child with father, brother with brother, brother with sister and sister with brother, making them one again with great rejoicing,… on returning to earth he acquired this mark of the Great Man: his male organs are enclosed in a sheath.",
    "dn30:77": "'Being endowed with this mark,…as a ruler he will have numerous sons, more than a thousand sons, powerfully built heroes, crushers of the enemy host. As a Buddha, likewise.' This was what the Lord declared.",
    "dn30:78": "About this it was said:",
    "dn30:79": "ʹIn former days, in former births,Long-lost friends and relatives,Companions too, he brought together,Thus uniting them in joy.",
    "dn30:80": "This good deed brought heavenly birth,Bliss and joy were his reward.When he thence returned to earth,Sheath-enclosed his organs were.",
    "dn30:81": "\"Numerous children such will have,More than a thousand sons are his,Hero-champions, conquerors,And filial too, the layman's joy.",
    "dn30:82": "But if he leaves the world, still moreWith children he will be endowed:Those who depend upon his word.And so, renounced or not, this signSuch benefits as this portends.\"'",
    "dn30:83": "'Monks, in whatever former life… the Tathāgata, considering the welfare of people, knew the nature of each, knew each one himself, and knew how each one differed: \"This one deserves such-and-such, that one deserves so-and-so\", so he distinguished them,… on returning to earth he acquired these two marks of the Great Man: he is proportioned like a banyan-tree, and standing, without bending, he can touch and rub his knees with both hands.",
    "dn30:84": "'Being endowed with these marks,… as a ruler he will be rich, of great wealth and resources, having a full treasury of gold and silver, all sorts of goods, and his granary will be full of corn. As a Buddha he will be wealthy and rich, and these will be his treasures: faith, morality, moral shame,[n.960]Hiri.moral dread,[n.961]Ottappa.learning, renunciation[n.962]Cāga.and wisdom.' This was what the Lord declared:",
    "dn30:85": "About this it was said:",
    "dn30:86": "'Weighing in the balance, noting,Seeking people's benefit,Seeing: \"This one that deserves,And that one this\", he judged them.",
    "dn30:87": "Now he can unbending standAnd touch his knees with both his hands,And his tree-like girth and heightIs the fruit of virtuous deeds.",
    "dn30:88": "Those who read the marks and signs,Experts in such lore declare:\"Things that suit the household lifeAs a child he'll get in plenty,",
    "dn30:89": "Much worldly wealth as this world's lord,As befits a layman, shall be his.But should he worldly wealth renounce,He'll gain the wealth that's unsurpassed.\"'",
    "dn30:90": "'Monks, in whatever former life the Tathāgata… desired the welfare of the many, their advantage, comfort, freedom from bondage, thinking how they might increase in faith, morality, learning, renunciation, in Dhamma, in wisdom, in wealth and possessions, in bipeds and quadrupeds, in wives and children, in servants, workers and helpers, in relatives, friends and acquaintances,… on returning to earth he acquired these three marks of the Great Man: the front part of his body is like a lion's, there is no hollow between his shoulders, and his bust is evenly rounded.",
    "dn30:91": "'Being endowed with these marks,…as a ruler he cannot lose anything: wealth and possessions, bipeds and quadrupeds, wives and children losing nothing, he will succeed in all things. As a Buddha he cannot lose anything: faith, morality, learning, renunciation or wisdom — losing nothing, he will succeed in all things.' This was what the Lord declared.",
    "dn30:92": "About this it was said:",
    "dn30:93": "'Faith, morality, learning, wisdom,Restraint and justice, much good else,Wealth, possessions, wives and sons,",
    "dn30:94": "Flocks, kin, friends, colleagues,Strength, good looks and happiness:These things he wished for othersThat they might keep and never lose.",
    "dn30:95": "\"So, lion-fronted, he was born,Not hollow-backed, and round before.Through past good kamma well stored up,With such birth-marks spared all loss,",
    "dn30:96": "In household life he's rich in goods,In wife and sons and quadrupeds,Or if renounced, possessing naught,Supreme enlightenment is his,Where no failure enters in.\"'",
    "dn30:97": "'Monks, in whatever former life the Tathāgata…was one who avoided harming beings by hand, by stones, stick or sword,… on returning to earth he acquired this mark of the Great Man: he has a perfect sense of taste. Whatever he touches with the tip of his tongue he tastes in his throat, and the taste is dispersed everywhere.",
    "dn30:98": "'Being endowed with this mark,…as a ruler he will suffer little distress or sickness, his digestion will be good, being neither too cold nor too hot.[n.963] Seen.482.As a Buddha likewise, he is also equable and tolerant of exertion.' This was what the Lord declared.",
    "dn30:99": "About this it was said:",
    "dn30:100": "ʹHarming none by hand, stick, stone,Causing death to none by sword,Harmless, threatening none with bonds,",
    "dn30:101": "With happy birth he gained the fruitOf these good deeds, and then reborn,Erect his taste-buds, and well-set.[n.964] In the throat.",
    "dn30:102": "Those who know the marks declare:\"Great happiness will be his lotAs layman or as wanderer:That's the meaning of this sign.\"'",
    "dn30:103": "'Monks, in whatever former life the Tathāgata…was accustomed to look at people not askance, obliquely or furtively,[n.965] Following DA's interpretation.but directly, openly and straight-forwardly, and with a kindly glance,… on returning to earth he acquired these two marks of the Great Man: deep blue eyes, and eyelashes like a cow's.",
    "dn30:104": "'Being endowed with these marks,…as a ruler, he will be looked upon with love by the common people; he will be popular and loved by Brahmin householders citizens and villagers, treaturers, guards, doorkeepers,.. pages. As a Buddha, he will be popular with and loved by monks, nuns, male and female lay-followers, devas and humans, asuras, nagas and gandhabbas.' This was what the Lord declared.",
    "dn30:105": "About this it was said:",
    "dn30:107": "In happy place reborn, he thereEnjoys the fruits of his good deeds.Reborn here, his lashes are",
    "dn30:108": "Like a cow's; his eyes are blue.Those who know such things declareInterpreting the marks with skill,\"A child with such fine eyes will be",
    "dn30:109": "One who's looked upon with joy.If a layman, thus he'll bePleasing to the sight of all.If ascetic he becomes,Then loved as healer of folk's woes.\"'",
    "dn30:110": "'Monks, in whatever former life the Tathāgata…became the foremost in skilled behaviour, a leader in right action of body, speech and thought, in generosity, virtuous conduct, observance of fasts, in honouring father and mother, ascetics and Brahmins and the head of the clan, and in various other proper activities, … on returning to earth he acquired this mark of the Great Man: a head like a royal turban.",
    "dn30:111": "'Being endowed with this mark,…as a ruler he will receive the loyalty of Brahmin householders, citizens…As a Buddha he will receive the loyalty of monks, nuns…' This was what the Lord declared.",
    "dn30:112": "About this it was said:",
    "dn30:113": "ʹHe led the way in conduct then,Intent on living righteously.Thus folk were loyal to him here,And heavenly reward was his.",
    "dn30:114": "And after that reward was done,He reappeared with turbaned head.Those who know the signs declared:",
    "dn30:115": "\"He will be the first of men,All will serve him in this lifeJust as was the case before.If a nobleman of wealth,He'll gain the service of his folk,",
    "dn30:116": "But should he leave the world, this manOf doctrine will a master be,And all the folk will flock to hearThe teaching that he will proclaim.\"'",
    "dn30:117": "'Monks, is whatever former life the Tathāgata,… rejecting false speech, put away lies and became a truth-speaker, wedded to the truth, reliable, consistent, not deceiving the world,… on returning to earth he acquired these two marks of the Great Man: his body-hairs separate, one to each pore, and the hair between his brows white and soft like cotton-down.",
    "dn30:118": "'Being endowed with these marks,… as a ruler he will be obeyed by Brahmin householders… As a Buddha he will be obeyed by monks…' This was what the Lord declared.",
    "dn30:119": "About this it was said:",
    "dn30:120": "'True to his promise in past births,Sincere of speech, he shunned all lies.Breaker of his word to none,He pleased by truth and honesty.",
    "dn30:121": "White and bright and soft as downThe hair appeared between his brows,And from one pore no two hairs grew,But each one separate appeared.",
    "dn30:122": "Assembled augurs thus declaredHaving read the marks with skill:\"With such a mark between the brows,And such hairs, he'll be obeyed",
    "dn30:123": "By all, and if a layman still,They'll respect him for past deeds;If renounced, possessionless,As Buddha they will worship him.\"'",
    "dn30:124": "'Monks, in whatever former life the Tathāgata,… rejecting slander, abstained from it, not repeating there what he had heard here to the detriment of these, or repeating what he had heard there to the detriment of those… Thus he was a reconciler of those at variance and an encourager of those at one, rejoicing in peace, loving it, delighting in it, one who spoke up for peaceas Sutta 1, verse 1.9. On returning to earth he acquired these two marks of the Great Man: forty teeth, and no spaces between the teeth.",
    "dn30:125": "'Being endowed with these marks,… as a ruler, his followers: Brahmin householders, citizens…will not be divided among themselves. Likewise as a Buddha, his followers: monks, nuns…will not be divided among themselves.' This was what the Lord declared.",
    "dn30:126": "About this it was said:",
    "dn30:127": "ʹHeʹs no speaker of wicked wordsThat cause dissension or increase it,Prolonging strife and bitterness,Leading to good friendship's end.",
    "dn30:128": "What he spoke was all for peace,And relinking severed bonds.His power he used to end all strife,Harmony was his delight.",
    "dn30:129": "In happy realm reborn, he thereEnjoyed the fruits of his good deeds.Returned to earth, his teeth grew close,Forty of them, firmly set.",
    "dn30:130": "\"If a nobleman of wealth,Gentle will his subjects be;If a recluse, free from taint,Well set-up his flock will be.ʺʹ[n.966]Anugataexact meaning doubtful.",
    "dn30:131": "'Monks, in whatever former life the Tathāgata,…rejecting harsh speech, abstained from it, spoke what was blamless, pleasing to the ear, agreeable, reaching the heart, urbane, pleasing and attractive to the multitude,… on returning to earth he acquired these two marks of the Great Man: his tongue was very long, and he had a Brahmā-like voice, like the karavīka-bird.",
    "dn30:132": "'Being endowed with these marks,…as a ruler he will have a persuasive[n.967]Ādeyya:lit. 'to be taken up', i.e. acceptable.voice: all…Brahmin householders, citizens… will take his words to heart. As a Buddha, too, he will have a persuasive voice: all…monks, nuns…will take his words to heart.' This was what the Lord declared.",
    "dn30:133": "About this it was said:",
    "dn30:134": "ʹHeʹs no speaker of abuse,Harsh and painful, hurting folk,His voice is gentle, kind and sweet,Appealing to the hearts of folk",
    "dn30:135": "And delightful to their ears.In happy realm reborn, he thereEnjoyed the fruits of his good deeds.Having tasted this reward,",
    "dn30:136": "With Brahmā-voice endowed, to earthHe returned, and long his tongue.\"And what he says will carry weight.",
    "dn30:137": "If layman, he will prosper much.But if this man should leave the world,Folk will take his words to heart,And set great store by all he says.ʺʹ",
    "dn30:138": "'Monks, in whatever former life the Tathagāta,…rejecting idle chatter, spoke at the right time, what was correct and to the point, of Dhamma and discipline, and what was bound up with profit,…on returning to earth he acquired this mark of the Great Man: jaws like a lion's.",
    "dn30:139": "'Being endowed with this mark,… as a ruler he cannot be overcome by any human foe or opponent. As a Buddha he cannot be overcome by any foe or hostile thing from within or without, by lust, hatred or delusion, by any ascetic or Brahmin, deva, mara, Brahmā or anything in the world.' This was what the Lord declared.",
    "dn30:140": "About this it was said:",
    "dn30:141": "'No idle talk or foolishness,Fruit of scatterbrain was his.Harmful things he put aside,Speaking only all menʹs good.",
    "dn30:142": "And so at death he went to heavenTo taste the fruit of deeds well done.Returned to earth once more, his jawResembled that of him that's lordOf all twice-two-footed things.",
    "dn30:143": "\"He will be a king unbeaten,Lord of men, of mighty power,Like the Lord of threefold heaven,[n.968] Seen.596.Like the greatest of the gods.",
    "dn30:144": "gandhabbas, sakkas, asurasWill strive in vain to cast him down.As layman thus he'll be throughoutAll the quarters of the world.ʺʹ[n.969] As RD remarks, the absence of the 'Buddhological complement' is quite remarkable. DA has no comment on the last few lines, which seem to be corrupt.",
    "dn30:145": "'Monks, in whatever former life the Tathāgata,… rejecting wrong livelihood, lived by right livelihood, refraining from cheating with false weights and measures, from bribery and corruption, deception and insincerity, from wounding, killing, imprisoning, lighway robbery, and taking goods by force.[n.970] Cf. DN 1.1.10.On returning to earth he acquired these two marks of the Great Man: even teeth, and very bright canine teeth.",
    "dn30:146": "'Being endowed with these marks, if he keeps to the household life he will be a wheel-turning monarch…As a ruler, his followers… Brahmin householders… will be pure.",
    "dn30:147": "'But if he goes forth from the household life into homelessness,… as a Buddha, his followers… monks, nuns… will be pure.' This was what the Lord declared.",
    "dn30:148": "About this it was said:",
    "dn30:149": "'Wrongful living he gave upAnd took a pure and righteous course.Harmful things he cast aside,Working only for folk's good.",
    "dn30:150": "Heaven brings him sweet rewardFor deeds he's done that earn the praiseOf those who're wise and skilled:He shares in all delights and joys",
    "dn30:151": "Like the lord of threefold heaven.Falling thence to human state,As residue of virtue's fruit,He gains evenness of teeth,Purity and brightness too.",
    "dn30:152": "Assembled augurs thus declaredHe'll be the wisest of mankind,ʺAnd pure his followers will be,Whose even teeth like birds' plumes shine.",
    "dn30:153": "As king his pure retainers willBow to his, their lord's, command.Not oppressed by force, they willStrive for general weal and joy.",
    "dn30:154": "But if he dwells, a wanderer,Free from evil, all lust quenched,Drawing back the veil;[n.971] Cf.n.146.with painAnd weariness all gone, he'll seeThis world and the next, and there",
    "dn30:155": "Lay-folk and renounced, who flockTo cast aside, as he has taught,Those impure, evil things he blames.Thus his followers are pure,For he drives out from their heartsEvil and corrupting states.\"'",
    "dn30:156": "Thus the Lord spoke, and the bhikkhus rejoiced and were delighted with his words."
}