{
    "dn31:1": "This is what I heard. On one occasion, the Buddha was living near the town of Rājagaha at a spot in the Bamboo Grove called the Squirrel's Feeding Place.",
    "dn31:2": "Meanwhile the Buddha dressed himself in the early morning, took his bowl and robe and went in to Rājagaha on alms round. On the way, he saw Sigālaka worshipping the six directions. Seeing this, the Buddha said to him: \"Young man, why have you risen in the early morning and set out from Rājagaha to worship in such a way?\"",
    "dn31:3": "\"But, young man, that is not how the six directions should be worshipped according to the discipline of the noble ones.\"",
    "dn31:4": "\"Very well, young man, listen and pay careful attention while I tell you.\"",
    "dn31:5": "\"Young man, by abandoning the four impure actions,[n.973]Kamma-kilesa.a noble disciple refrains from harmful deeds rooted in four causes and avoids the six ways of squandering wealth.[n.974]Apāya-mukhāni:cf.n.18.So, these fourteen harmful things are removed. The noble disciple, now with the six directions protected, has entered upon a path for conquering both worlds, firmly grounded in this world and the next. At the dissolution of the body after death, a good rebirth occurs in a heavenly world.",
    "dn31:6": "\"What four impure actions are abandoned? The harming of living beings is an impure action, taking what is not given is an impure action, sexual misconduct is an impure action, and false speech is an impure action. These four are abandoned.\"",
    "dn31:7": "\"Harming living beings, taking what is not given,False speech, and pursuing the loved one of another:These the wise surely do not praise.\"",
    "dn31:8": "\"What are the four causes of harmful deeds? Going astray through desire, hatred, delusion, or fear, the noble disciple does harmful deeds. But, young man, not going astray through desire, hatred, delusion, or fear, the noble disciple does not perform harmful deeds.\"",
    "dn31:9": "\"Desire, hatred, delusion, or fear:Whoever transgresses the Dhamma by these,Has a reputation that comes to ruin,Like the moon in the waning fortnight.",
    "dn31:10": "\"Desire, hatred, delusion, or fear:Whoever transgresses not the Dhamma by these,Has a reputation that comes to fullness,Like the moon in the waxing fortnight.\"",
    "dn31:11": "\"And what six ways of squandering wealth are to be avoided? Young man, heedlessness caused by intoxication, roaming the streets at inappropriate times, habitual partying, compulsive gambling, bad companionship, and laziness are the six ways of squandering wealth.",
    "dn31:12": "\"These are the six dangers inherent in heedlessness caused by intoxication: loss of immediate wealth, increased quarreling, susceptibility to illness, disrepute, indecent exposure, and weakened insight.",
    "dn31:13": "\"These are the six dangers inherent in roaming the streets at inappropriate times: oneself, one's family, and one's property are all left unguarded and unprotected; one is suspected of crimes;[n.976] Crimes committed by others are laid at one’s door.then rumors spread; and one is subjected to many miseries.",
    "dn31:14": "\"These are the six dangers inherent in habitual partying: You constantly seek, 'Where's the dancing? Where's the singing? Where's the music? Where are the stories? Where's the applause?[n.977] Cf. DN 1.1.13.Where's the drumming?'",
    "dn31:15": "\"These are the six dangers inherent in compulsive gambling: winning breeds resentment; the loser mourns lost property; savings are lost; one's word carries no weight in a public forum; friends and colleagues display their contempt; and one is not sought after for marriage,[n.978] Because a gambler cannot support a wife properly.since a gambler cannot adequately support a family.",
    "dn31:16": "\"These are the six dangers inherent in bad companionship: any rogue, drunkard, addict, cheat, swindler, or thug becomes a friend and colleague.",
    "dn31:17": "\"These are the six dangers inherent in laziness: saying, 'It's too cold,' one does not work; saying, 'It's too hot,' one does not work; saying, 'It's too late,' one does not work; saying, 'It's too early,' one does not work; saying, 'I 'm too hungry,' one does not work; saying, 'I 'm too full,' one does not work. With an abundance of excuses for not working, new wealth does not accrue and existing wealth goes to waste.\"",
    "dn31:18": "That is what the Buddha said. Summing up in verse, the sublime teacher said:",
    "dn31:19": "\"Some are drinking buddies,Some say, 'Dear friend! Dear friend!'.But whoever in hardship stands close by,That one truly is a friend.",
    "dn31:20": "\"Sleeping late, adultery,Hostility, meaninglessness,Harmful friends, utter stinginess:These six things destroy a person.",
    "dn31:21": "\"Bad friends, bad companions,Bad practices—spending time in evil ways,By these, one brings oneself to ruin,In this world and the next.",
    "dn31:22": "\"Seduction, gambling, drinking, singing, dancing,Sleeping by day, wandering all around untimely,Harmful friends, utter stinginess:These things destroy a person.",
    "dn31:23": "\"They play with dice; they drink spirits;They consort with lovers dear to others.Associating with low-life and not the esteemed,They come to ruin like the waning moon.",
    "dn31:24": "\"Whoever is a drunkard, broke, and destitute,Dragged by thirst from bar to bar,Sinking into debt like a stone in waterInto bewilderment quickly plunges.",
    "dn31:25": "\"When sleeping late becomes a habitAnd night is seen as time to rise,For one perpetually intoxicated,A home life cannot be maintained.",
    "dn31:26": "\"'Too cold! Too hot!Too late!': they say.Having wasted work time this way,The young miss out on opportunities.",
    "dn31:27": "\"For one regarding cold and hotAs not more than blades of grass,Doing whatever should be done,Happiness will not be a stranger.\"[n.979] Cf. Thag 74.",
    "dn31:28": "\"Young man, be aware of these four enemies disguised as friends: the taker, the talker, the flatterer, and the reckless companion.",
    "dn31:29–31": "\"The taker can be identified by four things: by only taking, asking for a lot while giving little, performing duty out of fear, and offering service in order to gain something.",
    "dn31:32": "\"The talker can be identified by four things: by reminding of past generosity, promising future generosity, mouthing empty words of kindness, and protesting personal misfortune when called on to help.[n.980] If you want a cart, he has just lost a wheel, and so on.",
    "dn31:33": "\"The flatterer can be identified by four things: by supporting both bad and good behavior indiscriminately, praising you to your face, and putting you down behind your back.",
    "dn31:34": "\"The reckless companion can be identified by four things: by accompanying you in drinking, roaming around at night, partying, and gambling.\"",
    "dn31:35": "That is what the Buddha said. Summing up in verse, the sublime teacher said:",
    "dn31:36": "\"The friend who is all take,The friend of empty words,The friend full of flattery,And the reckless friend;",
    "dn31:37": "\"These four are not friends, but enemies;The wise understand thisAnd keep them at a distanceAs they would a dangerous path.\"",
    "dn31:38": "\"Young man, be aware of these four good-hearted friends:[n.981]Suhadā:‘good-hearted’, or ‘sound at heart’ (RD).the helper, the friend who endures in good times and bad, the mentor, and the compassionate friend.",
    "dn31:39": "\"The helper can be identified by four things: by protecting you when you are vulnerable,[n.982] If you are drunk, etc. (DA!).and likewise your wealth, being a refuge when you are afraid, and in various tasks providing double what is requested.",
    "dn31:40": "\"The enduring friend can be identified by four things: by telling you secrets, guarding your own secrets closely, not abandoning you in misfortune, and even dying for you.",
    "dn31:41": "\"The mentor can be identified by four things: by restraining you from wrongdoing, guiding you towards good actions, telling you what you ought to know, and showing you the path to heaven.",
    "dn31:42": "\"The compassionate friend can be identified by four things: by not rejoicing in your misfortune, delighting in your good fortune, preventing others from speaking ill of you, and encouraging others who praise your good qualities.\"",
    "dn31:43": "That is what the Buddha said. Summing up in verse, the sublime teacher said:",
    "dn31:44": "\"The friend who is a helper,The friend through thick and thin,The friend who gives good counsel,And the compassionate friend;",
    "dn31:45": "\"These four are friends indeed,The wise understand thisAnd attend on them carefully,Like a mother her own child.\"The wise endowed with virtueShine forth like a burning fire,",
    "dn31:47": "\"By dividing wealth into four parts,True friendships are bound;",
    "dn31:48": "One part should be enjoyed;Two parts invested in business;And the fourth set asideAgainst future misfortunes.\"",
    "dn31:49": "\"And how, young man, does the noble disciple protect the six directions? These six directions should be known: mother and father as the east, teachers as the south,[n.983] A pun ondakkhina‘right hand, south’, anddakkhiṇā‘fee or offering to teacher’.spouse and family as the west, friends and colleagues as the north, workers and servants as the lower direction, and ascetics and Brahmans as the upper direction.",
    "dn31:50": "\"In five ways should a mother and father as the eastern direction be respected by a child: 'I will support them who supported me; I will do my duty to them; I will maintain the family lineage and tradition; I will be worthy of my inheritance; and I will make donations on behalf of dead ancestors.'[n.984] The last is omitted by RD.",
    "dn31:51": "\"In five ways should teachers as the southern direction be respected by a student: by rising for them, regularly attending lessons, eagerly desiring to learn, duly serving them, and receiving instruction.",
    "dn31:52": "\"In five ways should a wife as the western direction be respected by a husband: by honoring, not disrespecting, being faithful, sharing authority, and by giving gifts.",
    "dn31:53": "\"In five ways should friends and colleagues as the northern direction be respected: by generosity, kind words, acting for their welfare, impartiality, and honesty.",
    "dn31:54": "\"In five ways should workers and servants as the lower direction be respected by an employer:[n.985]Ayiraka:a metathetised form for ariyaka ‘nobleman, master’.by allocating work according to aptitude, providing wages and food, looking after the sick, sharing special treats, and giving reasonable time off work.",
    "dn31:55": "\"In five ways should ascetics and Brahmans as the upper direction be respected: by kindly actions, speech, and thoughts, having an open door, and providing material needs.",
    "dn31:56": "That is what the Buddha said. Summing up in verse, the sublime teacher said:",
    "dn31:57": "\"Mother and father as the east,Teachers as the south,Spouse and family as the west,Friends and colleagues as the north,",
    "dn31:58": "Servants and workers below,Brahmans and ascetics above;These directions a person should honorIn order to be truly good.",
    "dn31:59": "\"Wise and virtuous,Gentle and eloquent,Humble and accommodating;Such a person attains glory.",
    "dn31:60": "\"Energetic, not lazy,Not shaken in misfortune,Flawless in conduct, and intelligent;Such a person attains glory.",
    "dn31:61": "\"A compassionate maker of friends,Approachable, free from stinginess,A leader, a teacher, and diplomat;Such a person attains glory.",
    "dn31:62": "\"Generosity and kind words,Conduct for others' welfare,Impartiality in all things;These are suitable everywhere.\"These kind dispositions hold the world together,Like the linchpin of a moving chariot.",
    "dn31:63": "And should these kind dispositions not exist,Then the mother would not receiveRespect or honor from her child,Neither would a father.",
    "dn31:64": "\"Upon these thingsThe wise reflect;They obtain greatnessAnd are sources of praise.\"",
    "dn31:65": "When all was said, the young householder, Sigālaka, exclaimed to the Buddha:"
}