{
    "dn33:1": "Thus have I heard. Once the Lord was touring in the Malla country with a large company of about five hundred monks. Arrived at Pāvā, the Mallas' capital, he stayed in the mango-grove of Cunda the smith.[n.02] This is undoubtedly a late Sutta. RD with characteristic caution says of this and DN 34: 'They contain here and there matter which suggests that they took their present shape at a later date than the bulk of the rest of the Digha'. It is associated, like DN 29, with the time immediately following the death of the Nigantha Nātaputta, the Jain leader, and it is located 'in the mango-grove of Cunda the smith', known to us from DN 6.4.4ff. If we compare DN 29, we find that that discourse is addressed to 'the novice Cunda', who is quite a different character — but we may wonder whether the two have not become confused. Part of the inspiration of DN 34 may have come from the Buddha’s words at DN 29.7. Could the whole Sutta have been expanded from that nucleus? In any case the method of listing items in expanding numerical groups was used (whether earlier or later) on a large scale in the Aṅguttara Nikāya, and in fact quite a number of entries in the lists in this Sutta appear there too.Such numerical listing has also been compared by different writers from RD onwards to the so-called 'matrices'(mātikā)of the Abhidhamma — partly with the implication that this type of presentation always represents a stratum considerably later than the Buddha’s time. In fact we do not know to what extent the Buddha himself resorted to the obvious pedagogic device of teaching 'by numbers'. In any case, when such numerical lists were in existence, they readily lent themselves to expansion, and it is likely that the material of this Sutta dates from a variety of periods, and because some of it is obviously late, this does not mean that other parts are not early. There are in existence Tibetan and other versions. It should perhaps be stressed that, arid as this type of Sutta may appear to many today, it is from the monastic point of view valuable for use in chanting (its ostensible – and probably real — original object), incorporating as it does not only the major doctrinal categories in brief, but many points on behaviour and discipline which monks should constantly bear in mind.N.B. Since the lists in this and DN 34 consist largely of technical terms, the Pali words have been given wherever confusion or doubt seemed possible.",
    "dn33:2": "Now at that time a new meeting-hall of the Mallas of Pāvā, called Ubbhaṭaka,[n.1013] The lofty ('Thrown-aloft-er', RD).had recently been built, and it had not yet been occupied by any ascetic or Brahmin, or indeed by any human being. Hearing that the Lord was staying in Cunda's mango-grove, the Mallas of Pāvā went to see him. Having saluted him, they sat down to one side and said: 'Lord, the Mallas of Pāvā have recently erected a new meeting-hall called Ubbhataka, and it has not yet been occupied by any ascetic or Brahmin, or indeed by any human being. May the Blessed Lord be the first to use it! Should he do so, that would be for the lasting good and happiness of the Mallas of Pāvā.′ And the Lord consented by silence.",
    "dn33:3": "Noting his assent, the Mallas rose, saluted him, passed out to his right and went to the meeting-hall. They spread mats all round, arranged seats, put out a water-pot and an oil-lamp, and then, returning to the Lord, saluted him, sat down to one side and reported what they had done, saying: 'Whenever the Blessed Lord is ready.'",
    "dn33:4": "Then the Lord dressed, took his robe and bowl, and went to the meeting-hall with his monks. There he washed his feet, entered the hall and sat down against the central pillar, facing east. The monks, having washed their feet, entered the hall and sat down along the western wall facing east, with the Lord in front of them. The Pāvā Mallas washed their feet, entered the hall, and sat down along the eastern wall facing west, with the Lord in front of them. Then the Lord spoke to the Mallas on Dhamma till far into the night, instructing, inspiring, firing and delighting them. Then he dismissed them, saying: 'Vāsetthas,[n.101] This is the family-name (cf.,n.179). The Mallas of Pāvā were, of course, closely related to those of Kusinārāā.the night has passed away.[n.1015] Not 'lovely is the night' (an odd mistranslation of a stock phrase by RD).Now do as you think fit.' 'Very good, Lord', replied the Mallas. And they got up, saluted the Lord, and went out, passing him by on the right.",
    "dn33:5": "As soon as the Mallas had gone the Lord, surveying the monks sitting silently all about, said to the Venerable Sāriputta: 'The monks are free from sloth-and-torpor,[n.1016] The third of the five hindrances (below, 2.1 (6)).Sāriputta. You think of a discourse on Dhamma to give to them. My back aches, I want to stretch it.' 'Very good, Lord', replied Sāriputta.",
    "dn33:6": "Then the Lord, having folded his robe in four, lay down on his right side in the lion-posture,[n.1017] As atDN1.with one foot on the other, mindful and clearly aware, and bearing in mind the time to arise.",
    "dn33:7": "Now at that time the Nigantha Nātaputta had just died at Pāvā. And at his death the Niganthas were split into two parties, quarrelling and disputing, fighting and attacking each other with wordy warfare: 'You don't understand this doctrine and discipline — I do!' 'How could you understand this doctrine and discipline?' 'Your way is all wrong — mine is right!' 'I am consistent — you aren't!' 'You said last what you should have said first, and you said first what you should have said last!' 'What you took so long to think up has been refuted!' 'Your argument has been overthrown, you're defeated!' 'Go on, save your doctrine — get out of that if you can!' You would have thought the Niganthas, Nataputtaʹs disciples, were bent on killing each other. Even the white-robed lay followers were disgusted, displeased and repelled when they saw that their doctrine and discipline was so ill-proclaimed, so unedifyingly displayed, and so ineffectual in calming the passions, having been proclaimed by one not fully enlightened, and now with its support gone, without an arbiter.Paṭisaraṇaṁ'a resort'.",
    "dn33:8": "And the Venerable Sāriputta addressed the monks, referring to this situation, and said: 'So ill-proclaimed was their teaching and discipline, so unedifyingly displayed, and so ineffectual in calming the passions, having been proclaimed by one who was not fully enlightened.But, friends, this Dhamma has been well proclaimed by the Lord, the fully-enlightened One. And so we should all recite it together[n.101] As proposed atDN29.without disagreement, so that this holy life may be enduring and established for a long time, thus to be for the welfare and happiness of the multitude, out of compassion for the world, for the benefit, welfare and happiness of devas and humans.",
    "dn33:9": "And what is this Dhamma that has been well proclaimed by the Lord…?",
    "dn33:10": "'There is one thing that was perfectly proclaimed by the Lord who knows and sees, the fully-enlightened Buddha. So we should all recite together … for the benefit, welfare and happiness of devas and humans.",
    "dn33:11": "'There aresets oftwo things that were perfectly proclaimed by the Lord… Which are they?",
    "dn33:12": "(1) 'Mind and body(nāmañ ca rūpañ ca).",
    "dn33:13": "(2) 'Ignorance and craving for existence(avijjā ca bhavataṇhā ca).",
    "dn33:14": "(3) 'Belief incontinuedexistence and belief in non-existence(bhava-ditthi ca vibhava-diṭṭhi ca).",
    "dn33:15": "(4) 'Lack of moral shame and lack of moral dread(ahirikañ ca anottappan ca).",
    "dn33:16": "(5) 'Moral shame and moral dread(hiri ca ottappañ ca).",
    "dn33:17": "(6) 'Roughness and friendship with evil(dovacassatā ca pāpamittata ca).",
    "dn33:18": "(7) 'Gentleness and friendship with good(sovacassatā ca kalyānamittatā ca).",
    "dn33:19": "(8) 'Skill inknowingoffences andthe procedure forrehabilitation from them(āpatti-kusalatā ca āpatti-vuṭṭhāna-kusalatā ca).",
    "dn33:20": "(9) 'Skill in entering and returning fromjhāna(samāpattikusalatā ca samāpatti-vuṭṭhāna-kusalatā ca).[n.1021] The link here with (8) seems to be simply a play on words:āpatti'offence', andsamāpatti'attainment'. Despite the divergence in meaning, the two verbs are from the same root.",
    "dn33:21": "(10) 'Skill inknowingtheeighteenelements[n.1022] These are the six senses (mind as the sixth), their objects and corresponding consciousnesses, e.g. 'eye, sight-object, eye-consciousness', as inMN 115. See BDic under Dhātu.and in paying attention to them(dhātu-kusalatā ca manasikāra-kusala-ta ca).",
    "dn33:22": "(11) 'Skill inknowingthetwelvesense-spheres(āyatanak.)and dependent origination.",
    "dn33:23": "(12) 'Skill inknowingwhat are causes and what are not(ṭhāna-k. ca aṭṭhāna-k.)",
    "dn33:24": "(13) 'Straightforwardness and modesty(ajjavañ ca lajjavañ ca).[n.1023] Note again the play on words: a useful mnemonic device.",
    "dn33:25": "(14) 'Patience and gentleness(khanti ca soraccañ ca).",
    "dn33:26": "(15) 'Gentle speech and politeness(sākhalyañ ca paṭisanthāro ca).",
    "dn33:27": "(16) 'Non-harming and purity(avihi̇ṁsā ca soceyyañ ca).[n.1024] 'Purity of fraternal love' is RD's rather loose paraphrase of DA.",
    "dn33:28": "(17) 'Lack of mindfulness[n.1025] RD's 'absence of mind' may just do for this, but 'want of intelligence' is quite wrong for asampajañña, which is quite simply failure to comply with the injunction atDN 22.4.and of clear awareness(muṭṭhasaccañ ca asampajaññañ ca).",
    "dn33:29": "(18) 'Mindfulness and clear awareness(sati ca sampajaññañ ca).",
    "dn33:30": "(19) 'Unguarded sense-doors and non-restraint in eating(indriyesu aguttadvāratā ca bhojane amattaññutā ca).",
    "dn33:31": "(20) 'Guarded sense-doors and restraint in eating(… guttadvāratā… mattaññutā).",
    "dn33:32": "(21) 'Powers of reflection[n.1026] Bala: 'power' used here in an unusual sense.and mental development(paṭisaṅkhāna-balañ ca bhāvanā-balañ ca).",
    "dn33:33": "(22) 'Powers of mindfulness and concentration(sati-balañ ca samādhi-balañ ca).",
    "dn33:34": "(23) 'Calm and insightsamatho ca vipassanā ca.[n.1027] These are the two basic forms from which stems all Buddhist meditation.",
    "dn33:35": "(24) 'The sign of calm and grasping the sign(samatha-nimittañ ca paggaha-nimittañ ca).",
    "dn33:36": "(25) 'Exertion and non-distraction(paggaho ca avikheppo ca).",
    "dn33:37": "(26) 'Attainment of morality andrightview(sīla-sampadā ca diṭṭhi-sampadā ca).",
    "dn33:38": "(27) 'Failure of morality and view(sīla-vipatti ca diṭṭhivipatti ca).",
    "dn33:39": "(28) 'Purity of morality and view(sīla-visuddhi ca diṭṭhi-visuddhi ca).",
    "dn33:40": "(29) 'Purity of view and the effort to attain it(diṭṭhi-visuddhi kho pana yathā diṭṭhissa ca padhānaṁ).",
    "dn33:41": "(30) 'Being moved to a sense of urgency[n.1028] Nanamoli′s rendering of this difficult word.by what should move one, and the systematic effort of one so moved(saṁvego ca saṁvejaniyesu ṭhānesu saṁviggassa ca yoniso padhānaṁ).",
    "dn33:42": "(31) 'Not being content with wholesome acts and not shrinking from exertion(asantutthitā ca kusalesu dhammesu appaṭiv ānitā ca padhānasmiṁ).",
    "dn33:43": "(32) 'Knowledge and liberation(vijjā ca vimutti ca).",
    "dn33:44": "(33) 'Knowledge of the destructionof the defilementsand oftheirnon-recurrence(khaye ñiṇaṁ anuppāde ñānaṁ).",
    "dn33:45": "'These are thesets oftwo things that were perfectly proclaimed by the Lord…So we should all recite them together …'",
    "dn33:46": "'There aresets ofthree things … Which are they?",
    "dn33:47": "(1) 'Three unwholesome roots: of greed, hatred, delusion(lobho akusala-mūlaṁ, doso akusala-mūlaṁ, moho akusala-mūlaṁ).",
    "dn33:48": "(2) 'Three wholesome roots: of non-greed, non-hatred non-delusion(alobho …).",
    "dn33:49": "(3) 'Three kinds of wrong conduct: in body, speech and thought(kāya-duccaritaṁ, vacī-duccaritaṁ, mano-duccaritaṁ).",
    "dn33:50": "(4) 'Three kinds of right conduct: in body, speech and thought(kāya-sucaritaṁ …).",
    "dn33:51": "(5) 'Three kinds of unwholesome thought(akusala-vitakkā): of sensuality, of enmity, of cruelty(kāma-vitakko, vyāpādavitakko, vihiṁsa-vitakko).",
    "dn33:52": "(6) 'Three kinds of wholesome thought: of renunciation(nekkhamma-vitakko), of non-enmity, of non-cruelty.",
    "dn33:53": "(7) 'Three kinds of unwholesome motivation(saṅkappa):[n.1029] Or 'thought', as in the second step of the Noble Eightfold Path.through sensuality, enmity, cruelty.",
    "dn33:54": "(8) 'Three kinds of wholesome motivation: through renunciation(nekkhamma), non-enmity, non-cruelty.",
    "dn33:55": "(9) 'Three kinds of unwholesome perception(saññā): of sensuality, of enmity, of cruelty.",
    "dn33:56": "(10) 'Three kinds of wholesome perception: of renunciation, of non-enmity, of non-cruelty.",
    "dn33:57": "(11) 'Three unwholesome elements(dhātuyo): sensuality, enmity, cruelty.",
    "dn33:58": "(12) 'Three wholesome elements: renunciation, non-enmity, non-cruelty.",
    "dn33:59": "(13) 'Three more elements: the element of sense-desire,[n.1030] Here, the World of Sense-Desire(kāma-loka).the element of form, the formless element(kāma-dhātu, rūpadhātu, arūpa-dhātu).",
    "dn33:60": "(14) 'Three more elements: the element of form, the formless element, the element of cessation[n.1031] Note the overlap with the previous three, which represented the 'Three Worlds'. Here we have the two 'higher worlds' and the supramundane(lokuttara), referred to here as 'cessation' (as in the Third Noble Truth).(rūpa-dhūtu, arūpa-dhātu, nirodha-dhātu).",
    "dn33:61": "(15) 'Three more elements: the low element, the middling element, the sublime element(hīnā dhātu, majjhimā dhātu, paṇītā dhātu).",
    "dn33:62": "(16) 'Three kinds of craving: sensual craving, craving for becoming,[n.1032] Craving for continued existence.craving for extinction[n.1033] Craving, not for 'cessation' (n.1031) but for (materialistic) extinction. Only those in whom the Dhamma-eye has opened can dearly see the vital distinction between these, though it can be more or less dimly intuited by reason and/or faith.(kāma-taṇhā, bhavataṇhā, vibhava-taṇhā).",
    "dn33:63": "(17) 'Three more kinds of craving: craving forthe World ofSense-Desires, forthe World ofForm, for the FormlessWorld(kāma-taṇhā, rūpa-taṇhā, arūpa-taṇhā).",
    "dn33:64": "(18) 'Three more kinds of craving: forthe World ofForm, for the FormlessWorld, for cessation.(rūpa-dhūtu, arūpa-dhātu, nirodha-dhātu)",
    "dn33:65": "(19) 'Three fetters(saṁyojanāni): of personality-belief, of doubt, of attachment to rite and ritual(sakkāya-diṭṭhi, vicikicchā, sīabbata-parāmāso).",
    "dn33:66": "(20) 'Three corruptionsāsavā: of sense-desire, of becoming, of ignorance(kāmāsavo, bhavāsavo, avijjāsavo).",
    "dn33:67": "(21) 'Three kinds of becoming:in the Worldof Sense-Desire, of Form, in the Formless World(kāma-bhavo, rūpa-bhavo, arūpa-bhavo).",
    "dn33:68": "(22) 'Three quests: for sense-desires, for becoming, for the holy life(kāmesanā, bhavesanā, brahmacariyesanā).",
    "dn33:69": "(23) 'Three forms of conceit: \"I am better than… \", \"I am equal to…\", \"I am worse than…\"(\"seyyo 'ham asmīti\" vidhā, \"sadiso 'ham asmīti\" vidhā, \"hīno 'ham asmīti\" vidhā).",
    "dn33:70": "(24) 'Three times: past, future, present(atīto addhā, anāgato addhā, paccuppanno addhā).",
    "dn33:71": "(25) 'Three \"ends\"(antd):[n.1034] Lit. 'own body', this is the erroneous self-idea. The destruction of this fetter (with two other associated ones) constitutes the opening of the Dhamma-eye (n.1033) or 'Stream-Entry'.personality, its arising, its cessation(sakkāya anto, sakkāya-samudayo anto, sakkāya-nirodho anto).",
    "dn33:72": "(26) 'Three feelings: pleasant, painful, neither(sukhā vedanā, dukkhā vedanā, adukkham-asukhā vedanā).",
    "dn33:73": "(27) 'Three kinds of suffering: as pain, as inherent in formations, as due to change(dukkha-dukkhatā, saṅkhāra-dukkhatā, viparināma-dukkhatā).",
    "dn33:74": "(28) 'Three accumulations: evil with fixed result,[n.1035] Certain crimes (as parricide, cf. DN 2.100) have a fixed result which cannot be avoided.good with fixed result,[n.1036] When the first path-moment (or Stream-Entry,n.1035) has been gained, progress is inevitable, and retrogression to 'states of woe' impossible.indeterminate(micchatta-niyato rāsi, sammatta-niyato rāsi, aniyato-rāsi).",
    "dn33:75": "(29) 'Three obscurations(tamā):[n.1037] RD reads kaṅkhā 'doubts'.One hesitates(kaṅkhati), vacillates(vicikicchati), is undecided(nādhimuccati), is unsettled(na sampasīdati)about the past, the future, the present.",
    "dn33:76": "(30) 'Three things a Tathagata has no need to guard against: A Tathagata is perfectly pure in bodily conduct, in speech and in thought(parisuddha-kāya-, -vacī-, -mano-samācāro). There is no misdeed of body, speech or thought which he must conceal lest anyone should get to hear about it.",
    "dn33:77": "(31) 'Three obstacles:[n.1038] Lit. 'somethings', glossed by DA as 'obstacles'.lust, hatred, delusion(rāgo kiñcanaṁ, dosa kiñcanaṁ, moho kiñcanaṁ).",
    "dn33:78": "(32) 'Three fires: lust, hatred, delusion(rāgaggi, dosaggi, mohaggi).",
    "dn33:79": "(33) 'Three more fires: the fire of those to be revered, of the householder, of those worthy of offerings[n.1039] I.e. religious teachers (cf. DN 31.29).(āhuneyyaggi, gahapataggi, dakkhineyyaggi).",
    "dn33:80": "(34) 'Threefold classification of matter: visible and resisting, invisible and resisting, invisible and unresisting[n.1040] This refers to 'very subtle matter'.(sanidassana-sappaṭighaṁ rūpaṁ, anidassana-sappatighaṁ rūpaṁ, anidassana-appaṭighaṁ rūpaṁ).",
    "dn33:81": "(35) 'Three kinds of karmic formation:[n.1041] 'They compound co-existent states and (their) future fruition-states' (DA).meritorious, demeritorious, imperturbable[n.1042] This refers to rebirth in the Formless World.(puññābhisaṅkhāro, apuññābhisaṅkhāro, āneñjābhisaṅkhāro).",
    "dn33:82": "(36) 'Three persons: the learner, the non-learner, the one who is neither[n.1043] Cf.n.542.(sekho puggalo, asekho puggalo, n'eva sekho nāsekho puggalo).",
    "dn33:83": "(37) 'Three elders: an elder by birth, in Dhamma, by convention[n.1044] The last receives the courtesy title of 'elder' from juniors without being strictly entitled to it.(jāti-thero, dhamma-thero, sammuti-thero).",
    "dn33:84": "(38) 'Three grounds based on merit: that of giving, of morality, of meditation(dānamayaṁ puñña-kiriya-vatthu, sīlamayaṁ puñña-kiriya-vatthu, bhāvanāmaya puñña-kiriya-vatthu).",
    "dn33:85": "(39) 'Three grounds for reproof: based on what has been seen, heard, suspected(diṭṭhena, sutena, parisaṅkāya).",
    "dn33:86": "(40) 'Three kinds of rebirth in the Realm of Sense-Desire(kāmupapattiyo):[n.1045] These are all the realms from the hells up to the heaven of the Paranimmita-vasavatti devas.There are beings who desire what presents itself to them(paccuppaṭṭhita-kāmā), and are in the grip of that desire, such as human beings, some devas, and some in states of woe. There are beings who desire what they have created(nimmita-kāmā),… such as the devas Who Rejoice in Their Own Creation(Nimmānaratī). There are beings who rejoice in the creations of others,…such as the devas Having Power over Others' Creation ((Paranimmita-vasavattī)).",
    "dn33:87": "(41) 'Three happy rebirths(sukhupapattiyo):[n.1046] These are all in the World of Form.There are beings who, having continually produced happiness now dwell in happiness, such as the devas of the Brahma group. There are beings who are overflowing with happiness, drenched with it, full of it, immersed in it, so that they occasionally exclaim: \"Oh what bliss!\" such as the Radiant devas(Ȧbhassarā). There are beings… immersed in happiness, who, supremely blissful, experience only perfect happiness, such as the Lustrous devas(Subhakiṇṇā).",
    "dn33:88": "(42) 'Three kinds of wisdom: of the learner, of the non-learner, of the one who is neither.",
    "dn33:89": "(43) 'Three more kinds of wisdom: based on thought, on learninghearing, on mental developmentmeditation(cintāmaya pañña, sutamayā paññd, bhāvanāmaya pañña).",
    "dn33:90": "(44) 'Three armaments[n.1047] Ways in which one is 'guarded'.(āvudhāni): what one has learnt, detachment, wisdom(sutāvudhaṁ, pavivekāvudhaṁ, paññāvudhariv).",
    "dn33:91": "(45) 'Three faculties:[n.1048] The higher faculties of the Stream-Winner, etc.of knowing that one will know the unknown, of highest knowledge, of the one who knows(anaññātaṁ-ñassāmîtindriyaṁ, aññindriyaṁ, aññātā-v-indriyaṁ).",
    "dn33:92": "(46) 'Three eyes: the fleshly eye, the divine eye,[n.1049] Cf.n.140.the eye of wisdom[n.1050] That of the Stream-Winner.(maṁsa-cakkhu, dibba-cakkhu, paññā-cakkhu).",
    "dn33:93": "(47) 'Three kinds of training: in higher morality, higher thought, higher wisdom(adhisīla-sikkhā, adhicitta-sikkhā, adhipaññā-sikkhā).",
    "dn33:94": "(48) 'Three kinds of development: of the emotions,[n.1051] Kāya here means not (as RD) 'the psycho-physiological mechanism of sense', but 'mental (i.e. broadly 'emotional') body'.of mind, of wisdom(kāya-bhāvana, citta-bhāvanā, paññā-bhāvanā).",
    "dn33:95": "(49) 'Three \"unsurpassables\": of vision, of practice, of liberation(dassanānuttariyaṁ, paṭipadānuttariyaṁ, vimuttānuttariyaṁ).",
    "dn33:96": "(50) 'Three kinds of concentration: with thinking and pondering,[n.1052] Different stages of jhāna. The distinction made between the first two seems to reflect the (later) Abhidhammic subdivision of the first jhana into two.with pondering without thinking, with neither(savitakko savicāro samādhi, avitakko vicāra-matto samādhi, avitakko avicāro samādhi).",
    "dn33:97": "(51) 'Three more kinds of concentration: on emptiness, the \"signless\", desireless(suññato samādhi, animitto samādhi, appanihito samādhi).",
    "dn33:98": "(52) 'Three purities: of body, speech, mind(kāya-socceyyaṁ, vacī-socceyyaṁ, mano-socceyyaṁ).",
    "dn33:99": "(53) 'Three qualities of the sage:[n.1053]Moneyyais derived from muni 'sage' (or 'anchorite', RD).as to body, speech, mind(kāya-moneyyaṁ, vacī-moneyyaṁ, mano-moneyyaṁ).",
    "dn33:100": "(54) 'Three skills: in going forward,[n.1054] Note the play on words here: three derivatives of the root i ′to go′. Āya can also, in more mundane contexts, mean 'money-making' (as absurdly suggested for this passage in PED!).Apayagenerally refers to 'states of woe' (evil rebirths), while upāya comes to mean 'skilful device', and as such is much used of the Bodhisattva in the Mahayana tradition.in going down, in means to progress(āya-kosallaṁ, apāya-kosallaṁ, upāya-kosallaṁ).",
    "dn33:101": "(55) 'Three intoxications: with health, with youth, with life(ārogya-mado, yobbana-mado, jīvita-mado).",
    "dn33:102": "(56) 'Three predominant influences: oneself, the world, the Dhamma(attādhipateyyaṁ, lokādhipateyyaṁ, dhammādhipateyyaṁ).",
    "dn33:103": "(57) 'Three topics of discussion: Talk may be of the past: \"That's how it used to be\"; of the future: \"That's how it will be\"; of the present: \"That's how it is now.\"",
    "dn33:104": "(58) 'Three knowledges: of one's past lives, of the decease and rebirth of beings, of the destruction of the corruptions(pubbenivāsānussati-ñāṇaṁ vijjā, sattānaṁ cutupapāte ñāṇaṁ vijjā, āsavānaṁ khaye ñāṇaṁ vijjā).",
    "dn33:105": "(59) 'Three abidings: deva-abiding, Brahmā-abiding, the Ariyan abiding[n.5] The second refers to the Brahmaviharas (DN 13), the third to Arahantship.(dibbo vihāro, Brahmā-vihāro, ariyo vihāro).",
    "dn33:106": "(60) 'Three miracles:[n.1056] Cf. DN 11.3 and nn.231–3.of psychic power, of telepathy, of instruction(iddhi-pāṭihāriyaṁ, ādesanā-pātihāriyaṁ, anusāsanipāṭihāriyaṁ).",
    "dn33:107": "'These are thesets ofthree things… So we should all recite together…for the benefit, welfare and happiness of devas and humans.'",
    "dn33:108": "'There aresets offour things which were perfectly proclaimed by the Lord…",
    "dn33:109": "(1) 'Four foundations of mindfulness: Here a monk abides contemplating body as body, ardent, clearly aware and mindful, having put aside hankering and fretting for the world; he abides contemplating feelings as feelings…; he abides contemplating mind as mind…; he abides contemplating mind-objects as mind-objects, ardent, clearly aware and mindful, having put aside hankering and fretting for the world.",
    "dn33:110": "(2) 'Four great efforts(sammappadhānā): Here a monk rouses his will, makes an effort, stirs up energy, exerts his mind and strives to prevent the arising of unarisen evil unwholesome mental states. He rouses his will… and strives to overcome evil unwholesome mental states that have arisen. He rouses his will…and strives to produce unarisen wholesome mental states. He rouses his will…and strives to maintain wholesome mental states that have arisen, not to let them fade away, to bring them to greater growth, to the full perfection of development.",
    "dn33:111": "(3) 'Four roads to power(iddhipādā): Here a monk develops concentration of intention accompanied by effort of will, concentration of energy,… concentration of consciousness, and concentration of investigation accompanied by effort of will.",
    "dn33:112": "(4) 'Four jhānas: Here a monk, detached from all sense-desires, detached from unwholesome mental states, enters and remains in the first jhāna, which is with thinking and pondering, born of detachment, filled with delight and joy. And with the subsiding of thinking and pondering, by gaining inner tranquillity and oneness of mind, he enters and remains in the second jhāna, which is without thinking and pondering, born of concentration, filled with delight and joy. And with the fading away of delight, remaining imperturbable, mindful and clearly aware, he experiences in himself that joy of which the Noble Ones say: \"Happy is he who dwells with equanimity and mindfulness\", he enters and remains in the third jhāna. And, having given up pleasure and pain, and with the disappearance of former gladness and sadness, he enters and remains in the fourth jhāna which is beyond pleasure and pain, and purified by equanimity and mindfulness.",
    "dn33:113": "(5) 'Four concentrative meditations(samādhi-bhāvanā). This meditation, when developed and expanded, leads to happiness here and now(ditthadhamma-sukha), gaining knowledge-and-vision(ñāṇa-dassana-paṭilābha), mindfulness and clear awareness(sati-sampajañña), and the destruction of the corruptions(āsavānaṁ khaya).",
    "dn33:114": "How does this practice lead to happiness here and now? Here, a monk practises the four jhānas.",
    "dn33:115": "How does it lead to the gaining of knowledge-and-vision? Here, a monk attends to the perception of light(ālokasaññaṁ manasikaroti), he fixes his mind to the perception of day, by night as by day, by day as by night. In this way, with a mind clear and unclouded, he develops a state of mind that is full of brightness(sappabhāsam cittaṁ).",
    "dn33:116": "How does it lead to mindfulness and clear awareness? Here, a monk knows feelings as they arise, remain and vanish; he knows perceptions as they arise, remain and vanish; he knows thoughts(vitakkā)[n.1057] This is just the uprising of any thought that occurs.as they arise, remain and vanish.",
    "dn33:117": "How does this practice lead to the destruction of the corruptions? Here, a monk abides in the contemplation of the rise and fall of the five aggregates of grasping(pañc'upādānakkhandesu udayabbayānupassi): \"This is material form, this is its arising, this is its ceasing; these are feelings…; this is perception…; these are the mental formations…; this is consciousness, this is its arising, this is its ceasing.\"",
    "dn33:118": "(6) 'Four boundless states. Here, a monk, with a heart filled with loving-kindness, pervades first one quarter, then the second, the third and the fourth. Thus he stays, spreading the thought of loving-kindness above, below and across, everywhere, always with a heart filled with loving-kindness, abundant, magnified, unbounded, without hatred or ill-will. And likewise with compassion, sympathetic joy, and equanimity.",
    "dn33:119": "(7) 'Four formless jhānas. Here, a monk, by passing entirely beyond bodily sensations, by the disappearance of all sense of resistance and by non-attraction to the perception of diversity, seeing that space is infinite, reaches and remains in the Sphere of Infinite Space. And by passing entirely beyond the Sphere of Infinite Space, seeing that consciousness is infinite, he reaches and remains in the Sphere of Infinite Consciousness. And by passing entirely beyond the Sphere of Infinite Consciousness, seeing that there is no thing, he reaches and remains in the Sphere of No-Thingness. And by passing entirely beyond the Sphere of No-Thingness, he reaches and remains in the Sphere of Neither-Perception-Nor-Non-Perception.",
    "dn33:120": "(8) 'Four supports[n.1058] 'Bases of Conduct' (RD).(apassenāni): Here a monk judges that one thing is to be pursued, one thing endured, one thing avoided, one thing suppressed.",
    "dn33:121–124": "(9) 'Four Ariyan lineages(ariya-υaṁsā). Here, a monk is content with any old robe, praises such contentment, and does not try to obtain robes improperly or unsuitably. He does not worry if he does not get a robe, and if he does, he is not full of greedy, blind desire, but makes use of it, aware ofsuchdangers and wisely aware of its true purpose. Nor is he conceited about being thus content with any old robe, and he does not disparage others. And one who is thus skilful, not lax, clearly aware and mindful, is known as a monk who is true to the ancient, original(aggaññe)Ariyan lineage. Again, a monk is content with any alms-food he may get… Again, a monk is content with any old lodging-place … And again, a monk, being fond of abandoning(pahāna), rejoices in abandoning, and being fond of developing(bhāυanā), rejoices in developing, is not therefore conceited… And one who is thus skilful, not lax, clearly aware and mindful, is known as a monk who is true to the ancient, original Ariyan lineage.",
    "dn33:125": "(10) 'Four efforts: The effort of restraint(saṁυarapadhānaṁ), abandoning(pahānapadhānaṁ), development(bhāυanāpadhānaṁ), preservation(anurakkhanāpadhānaṁ).",
    "dn33:126": "What is the effort of abandoning? Here, a monk does not assent to a thought of lust, of hatred, of cruelty that has arisen, but abandons it, dispels it, destroys it, makes it disappear.",
    "dn33:127": "What is the effort of development? Here, a monk develops the enlightenment-factor of mindfulness, based on solitude, detachment, extinction, leading to maturity of surrender(vossagga-parināmiṁ); he develops the enlightenment-factor of investigation of states, … of energy, … of delight, … of tranquillity, … of concentration, … of equanimity, based on solitude, detachment, extinction, leading to maturity of surrender.",
    "dn33:128": "What is the effort of preservation? Here, a monk keeps firmly in his mind a favourable object of concentration which has arisen, such as a skeleton, or a corpse that is full of worms, blue-black, full of holes, bloated.",
    "dn33:129": "(11) 'Four knowledges: knowledge of Dhamma, of what is consonant with it(anvaye ñānaṁ), knowledge of others' minds[n.1059] Telepathy.(paricce ñānaṁ), conventional knowledge[n.1060] Knowledge in terms of conventional truth. Cf.n.224.(sammuti-ñānaṁ).",
    "dn33:130": "(12) 'Four more knowledges: knowledge of suffering, its origin, its cessation, the path.",
    "dn33:131": "(13) 'Four factors of Stream-Attainment(sotāpattiyaṅgāni): association with good people(sappurisa-saṁseva), hearing the true Dhamma, thorough attention(yoniso manasikāra), practice of the Dhamma in its entirety(dhammānudhamma-patipatti).",
    "dn33:132": "(14) 'Four characteristics of a Stream-Winner: Here, the Ariyan disciple is possessed of unwavering confidence in the Buddha, thus: \"This Blessed Lord is an Arahant, a fully-enlightened Buddha, endowed with wisdom and conduct, the Well-Farer, Knower of the worlds, incomparable Trainer of men to be tamed, Teachers of gods and humans, enlightened and blessed.\" He is possessed of unwavering confidence in the Dhamma, thus: \"Well-proclaimed by the Lord is the Dhamma, visible here and now, timeless, inviting inspection, leading onward, to be comprehended by the wise each one for himself.\" He is possessed of unwavering confidence in the Saṅgha, thus: \"Well-directed is the Saṅgha of the Lord's disciples, of upright conduct, on the right path, on the perfect path; that is to say the four pairs of persons, the eight kinds of men. The Saṅgha of the Lord's disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of veneration, an unsurpassed field of merit in the world.\" And he is possessed of morality dear to the Noble Ones, unbroken, without defect, unspotted, without inconsistency, liberating, praised by the wise, uncorrupted, and conducive to concentration.",
    "dn33:133": "(15) 'Four fruits of the ascetic life: the fruits of Stream-Entry, of the Once-Returner, of the Non-Returner, of Arahantship.",
    "dn33:134": "(16) 'Four elements: the elements of \"earth\", \"water\", \"fire\", \"air\"(pathaυī-, āpo-, tejo-, vāyo-dhātu).",
    "dn33:135": "(17) 'Four nutrimentsāhārā: \"material\"[n.1061] Usually this means ordinary human food, but seen.1062.(kabalinkāra)food, gross or subtle;[n.1062] This refers to the food of the devas, sometimes also calledkabalinkāra(cf.n.74.). See BDic under Āhāra.contact as second; mental volition(manosañcetanā)[n.1063] This volition = kamma.as third; consciousness as fourth.",
    "dn33:136": "(18) 'Four stations of consciousness(viññāna-tthitiyo): Consciousness gains a footing either in relation to materiality, with materiality as object and basis, as a place of enjoyment, or similarly in regard to feelings, perceptions or mental formations, and there it grows, increases and flourishes.",
    "dn33:137": "(19) 'Four ways of going wrong(agata-gamanāni): One goes wrong through desire(chanda),[n.1064] Chanda is the most general word for 'desire, intention': see BDic.hatred, delusion, fear.",
    "dn33:138": "(20) 'Four arousals of craving: Craving arises in a monk because of robes, alms, lodging, being and non-being[n.1065] Cf. DN 1.1.17. DA's gloss here: 'oil, honey, ghee', etc., seems mysterious, and is not supported by the Sub-Commentary.(iti-bhavābhava-hetu).",
    "dn33:139": "(21) 'Four kinds of progress: painful progress with slow comprehension, painful progress with quick comprehension, pleasant progress with slow comprehension, plea sant progress with quick comprehension.[n.1066] See DN 28.10.",
    "dn33:140": "(22) 'Four more kinds of progress: progress with impatience(akkhamā paṭipadā), patient progress(khamā p.), controlled progress(damā p.), calm progress(samā paṭipadā).[n.1067] By developing samādhi.",
    "dn33:141": "(23) 'Four ways of Dhamma:[n.1068]Dhamma-padāni.Formally this is the plural of Dhammapada, the title of perhaps the most famous Buddhist scripture, but it is glossed as 'divisions of the Dhamma'.without hankering, without enmity, with right mindfulness, with right concentration.",
    "dn33:142": "(24) 'Four ways of undertaking Dhamma: There is the way that is painful in the present and brings painful future results(dukkha-vipākarṁ), painful in the present and brings pleasant future results(sukha-vipākaṁ), pleasant in the present and brings painful future results, and pleasant in the present and brings pleasant future results.",
    "dn33:143": "(25) 'Four divisions of Dhamma: morality, concentration, wisdom, liberation.",
    "dn33:144": "(26) 'Four powers:[n.1069] Omitting 'faith' as the first of this group, normally of five.energy, mindfulness, concentration, wisdom.",
    "dn33:145": "(27) 'Four kinds of resolve(adhiṭṭhānāni):to gainwisdom, truth(sacca),[n.1070] Truth, i.e. realisation of 'things as they really are'.relinquishment(cāga), tranquillity(upasama).[n.1071] Not 'to master self' (RD).",
    "dn33:146": "(28) 'Four ways of answering questions: the question to be answered directly(ekaṁsa-vyākaraṇiyo pañho), requiring an explanation(vibhajja-v. p.), requiring a counter-question(paṭipucchā-v. p.), to be set aside(ṭhāpanīyo pañha).",
    "dn33:147": "(29) 'Four kinds of kamma: There is black kamma with black result(kaṇha-vipākaṁ), bright kamma with bright result(sukka-v.), black-and-bright kamma with black-and-bright result(kaṇha-sukka v.), kamma that is neither black nor bright(akaṇham-asukkaṁ), with neither black nor bright result, leading to the destruction of kamma.[n.1072] Kamma that leads to enlightenment, when no more kamma will be created.",
    "dn33:148": "(30) 'Four things to be realised by seeing(sacchikaraṇīyā dhammā):[n.1073] 'Making present to the eye'.former lives, to be realised by recollection(satiyā),[n.1074] Heresatiis perhaps being used in its older, occasional sense of 'memory' rather than mindfulness: seen.629.passing-away and rearising to be realised by thedivineeye,[n.1075] Seen.140.the eight deliverances, to be realised with the mental body(kāyena),[n.1077] Factors present in the 'mental group' at any given moment.the destruction of the corruptions, to be realised by wisdom.",
    "dn33:149": "(31) 'Four floods(oghā): sensuality, becoming,wrongviews, ignorance.",
    "dn33:150": "(32) 'Four yokes(yogā)sensuality, becoming,wrongviews, ignorance.",
    "dn33:151": "(33) 'Four \"unyokings\"(visaṁyogā): from sensuality, becoming, views, ignorance.",
    "dn33:152": "(34) 'Four ties(ganthā):[n.1078] Which tie mind(nāma)and body(rūpa)together.Ganthaalso means 'book' in the later language (seen.846).the \"body-tie\"[n.1079]Kāyahere means nāma-kāya 'mental body'.(kāya-gantha)of hankering(abhijjhā), ill-will(vyāpāda), attachment to rite and ritual(sīlabbata-parāmāsa), dogmatic fanaticism(idaṁ-saccābhinivesa).",
    "dn33:153": "(35) 'Four clingings(upādānāni): to sensuality, to views(ditthi), to rules and ritual(sīlabbata-pārāmāsa), to ego-belief(attavāda).",
    "dn33:154": "(36) 'Four kinds of generation:[n.1080] Yoniyo: 'wombs'. Further details are given inMN 12.from an egg, from a womb, from moisture,[n.1081] 'As from rotting fish, etc.' (MN 12).spontaneous rebirth(opapātika-yoni).[n.1082] Rebirth in the deva world (also as a Non-Returner).",
    "dn33:155": "(37) 'Four ways of descent into the womb: One descends into the mother's womb unknowing, stays there unknowing, and leaves it unknowing; one enters the womb knowing, stays there unknowing, and leaves it unknowing; one enters the womb knowing, stays there knowing, and leaves it unknowing; one enters the womb knowing, stays there knowing, and leaves it knowing.As Sutta 28, verse 5.",
    "dn33:156": "(38) 'Four ways of getting a new personalityattabhāva-paṭilābhā:[n.1083] A new 'self' in another existence. Cf.n.220.There is an acquisition of personality that is brought about by one's own volition, not another's, another's volition, not one's own, both, neither.",
    "dn33:157": "(39) 'Four purifications of offerings(dakkhiṇā-visuddhiyo): there is the offering purified by the giver but not by the recipient, by the recipient but not by the giver, by neither, by both.",
    "dn33:158": "(40) 'Four bases of sympathy(saṁgaha-vatthūni); generosity, pleasing speech, beneficial conduct and impartiality.",
    "dn33:159": "(41) 'Four un-Ariyan modes of speech: lying, slander, abuse, idle gossip.",
    "dn33:160": "(42) 'Four Ariyan modes of speech: refraining from lying, slander, abuse, idle gossip.",
    "dn33:161": "(43) 'Four more un-Ariyan modes of speech: claiming to have seen, heard, sensed(muta),[n.1084] Seen.933.known what one has not seen, heard, sensed, known.",
    "dn33:162": "(44) 'Four more Ariyan modes of speech: stating that one has not seen, heard, sensed, known what one has not seen, heard sensed, known.",
    "dn33:163": "(45) 'Four more un-Ariyan modes of speech: claiming not to have seen, heard, sensed, known what one has seen, heard, sensed, known.",
    "dn33:164": "(46) 'Four more Ariyan modes of speech: stating that one has seen, heard, sensed, known what one has seen, heard, sensed, known.",
    "dn33:165": "(47) 'Four persons: Here a certain man torments himself(attan-tapo hoti), is given to self-tormenting, torments others(paran-tapo hoti),… torments himself and others,… torments neither himself nor others … Thereby he dwells in this life without craving, released(nibbuto), cool, enjoying bliss, become as Brahma(brahma-bhūtena).[n.1085] Cf.n.823.",
    "dn33:166": "(48) 'Four more persons: Here a man's life benefits himself but not others, others but not himself,[n.1086] Like Upananda, whose conduct was not good, though he was still able to help others (DA).neither, both.",
    "dn33:167": "(49) 'Four more persons: living in darkness and bound for darkness(tamo tamaparāyanam)living in darkness and bound for the lighttamo jotiparāyana,living in the light and bound for darkness, living in the light and bound for the light.",
    "dn33:168": "(50) 'Four more persons: the unshakeable ascetic(samaṇam-acalo), the \"blue-lotus\" ascetic, the \"white-lotus\" ascetic, the subtly-perfect ascetic(samana-sukhumālo).[n.1087] These curious designations are supposed to refer to the Stream-Winner, Once-Returner, Non-Returner, and Arahant respectively.",
    "dn33:169": "'These are thesets offour things which were perfectly proclaimed by the Lord … So we should all recite them together… for the benefit, welfare and happiness of devas and humans.",
    "dn33:170": "'There aresets offive things perfectly proclaimed…",
    "dn33:171": "(1) 'Five aggregates: body, feelings, perceptions, mental formations, consciousness.",
    "dn33:172": "(2) 'Five aggregates of grasping(pancûpādāna-kkhandhā): body, feelings, perceptions, mental formations, consciousness.",
    "dn33:173": "(3) 'Five strands of sense-desire(pañca kāma-guṇā): a sight seen by the eye, a sound heard by the ear, a smell smelt by the nose, a flavour tasted by the tongue, a tangible object felt by the body as being desirable, attractive, nice, charming, associated with lust and arousing passion.",
    "dn33:174": "(4) 'Fivepost-mortemdestinies(gatiyo): hell(nirayo),[n.1088] Cf.n.244.animal-rebirth(tiracchāna-yoni),[n.1089] Cf.n.244.the realm of hungry ghosts(petā), humankind, the deva world.",
    "dn33:175": "(5) 'Five kinds of begrudging(macchariyāni):[n.1090] Faults of begrudging in a monk.as to dwelling-place, families,[n.1091] Begrudging others the support of a particular family.gains, beauty(vaṇṇa), Dhamma.",
    "dn33:176": "(6) 'Five hindrances: sensuality(kāmacchanda), ill-will(vyāpāda), sloth-and-torpor(thīna-middha), worry-and-flurry(uddhacca-kukkucca), sceptical doubt(vicikicchā).",
    "dn33:177": "(7) 'Five lower fetters: personality-belief(sakkāya-diṭṭhi), doubt, attachment to rite and ritual(sīlabbata-parāmāsa), sensuality, ill-will.",
    "dn33:178": "(8) 'Five higher fetters: craving for the world of form(rūparāga), craving for the formless world(arūpa-rāga), conceit(māna), restlessness(uddhacca), ignorance.",
    "dn33:179": "(9) 'Five rules of training(sikkhāpadāni): refraining from taking life, taking what is not given, sexual misconduct, lying speech, strong drink and sloth-producing drugs(surā-merayamajja-pamāddaṭṭhānā).",
    "dn33:180": "(10) 'Five impossible things: An Arahant is incapable of deliberately taking the life of a living being; taking what is not given so as to constitute theft; sexual intercourse; telling a deliberate lie; storing up goods for sensual indulgence as he did formerly in the household life.",
    "dn33:181": "(11) 'Five kinds of loss(vyasanāni): Loss of relatives, wealth, health, morality,rightview. No beings fall into an evil state, a hell-state … after death because of loss or relatives, wealth or health; but beings do fall into such states by loss of morality and right view.",
    "dn33:182": "(12) 'Five kinds of gain(sampadā): Gain of relatives, wealth, health, morality,rightview. No beings arise in a happy, heavenly state after death because of the gain of relatives, wealth or health; but beings are reborn in such states because of gains in morality and right view.",
    "dn33:183": "(13) 'Five dangers to the immoral through lapsing from morality : In the first place, he suffers great loss of property through neglecting his affairs. In the second place, he gets a bad reputation for immorality and misconduct. In the third place, whatever assembly he approaches, whether of Khattiyas, Brahmins, householders or ascetics, he does so diffidently and shyly. In the fourth place, he dies confused. In the fifth place, after death, at the breaking up of the body, he arises in an evil state, a bad fate, in suffering and hell. These are the five perils to one of bad morality.",
    "dn33:184": "(14) 'Five benefits to the moral through preserving morality: In the first place, through careful attention to his affairs he gains much wealth. In the second place, he gets a good reputation for morality and good conduct. In the third place, whatever assembly he approaches, whether of Khattiyas, Brahmins, householders or ascetics, he does so with confidence and assurance. In the fourth place, he dies unconfused. In the fifth place, after death, at the breaking-up of the body, he arises in a good place, a heavenly world. These are the five advantages to one of good morality, and of success in morality.",
    "dn33:185": "(15) 'Five points to be borne in mind by a monk wishing to rebuke another: I will speak at the proper time, not the wrong time, I will state the truth, not what is false, I will speak gently, not roughly, I will speak for his good, not for his harm, I will speak with love in my heart, not with enmity.",
    "dn33:186": "(16) 'Five factors of endeavour: Here, a monk has faith, trusting in the enlightenment of the Tathāgata: \"Thus this Blessed Lord is an Arahant, a fully-enlightened Buddha, perfected in knowledge and conduct, a Well-Farer, Knower of the worlds, unequalled Trainer of men to be tamed, Teacher of gods and humans, a Buddha, a Blessed Lord.\",",
    "dn33:187": "(17) 'Five Pure Abodes(suddhāvāsā):[n.1092] Realms inhabited by the Non-Returners, who attain to Nibbāna directly from there.Aviha,[n.1093] The meaning of this name is perhaps 'not falling from prosperity' (see EB).Unworried(Atappā), Clearly Visible(Sudassā), Clear-Sighted(Sudassī), Peerless(Akaniṭṭhā).",
    "dn33:188": "(18) 'Five kinds of Non-Returner(anāgāmī):[n.1094] For these scholastic distinctions see BDic or EB.the \"less-than-half-timer\", the \"more-than-half-timer\", the \"gainer without exertion\", the \"gainer with exertion\", \"he who goes upstream to the highest\".",
    "dn33:189": "(19) 'Five mental blockages(ceto-khīlā): Here, a monk has doubts and hesitations about the Teacher, is dissatisfied and cannot settle in his mind. Thus his mind is not inclined towards ardour, devotion, persistence and effort; about the Dhamma … ; about the Saṅgha … ; about the training … ; he is angry and displeased with his fellows in the holy life, he feels depressed and negative towards them. Thus his mind is not inclined towards ardour, devotion, persistence and effort.",
    "dn33:190": "(20) 'Five mental bondages(cetaso vinibandhā):[n.1095] See alsoMN 12.Here, a monk has not got rid of the passion, desire, love, thirst(pipāsa),[n.1096] This, though here used metaphorically, is the word for 'thirst' in the literal sense. Here it means something less strong than tanhā.fever, craving(taṇhā)for sense-desires(kāme): thus his mind is not inclined towards ardour, devotion, persistence and effort; for the body(kāye),… for physical objects(rūpe), … or having eaten as much as his belly will hold, he abandons himself to the pleasure of lying down, of contact, of sloth; or he practises the holy life for the sake of becoming a member of some body of devas(deva-nikāya), thinking: \"By means of these rites or this discipline, this austerity or this holy life I shall become one of the devas, great or small.\" Thus his mind is not inclined towards ardour, devotion, persistence and effort.",
    "dn33:191": "(21) 'Five faculties(indriyāni): the faculty of eye, ear, nose, tongue, body.",
    "dn33:192": "(22) 'Five more faculties: pleasantbodilyfeeling(sukha), pain(dukkha), gladness(somanassa), sadness(domanassa), indifferent feeling(upekhā).",
    "dn33:193": "(23) 'Five more faculties: faith(saddhā), energy, mindfulness, concentration, wisdom.",
    "dn33:194–198": "(24) 'Five elements making for deliverance(nissaraṇīyā dhātuyo): Here, when a monk considers sense-desires, his mind does not leap forward and take satisfaction in them, fix on them or make free with them,[n.1097]Vimuccati, apparently meaning 'is liberated', but glossed by DA asadhimuccati,rendered by RD as 'choose'. The same verb is used in the next sentence with regard to renunciation. I have used 'make free' as a makeshift, free rendering, and suspect a textual corruption.but when he considers renunciation it does leap forward, take satisfaction in it, fix on it, and make free with it. And he gets this thought well-set, well-developed, well raised up, well freed and disconnected from sense-desires. And thus he is freed from the corruptions(āsavā), the vexations and fevers that arise from sense-desires, and he does not feel that [sensual] feeling. This is called the deliverance from sense-desires. And the same applies to ill-will, cruelty, forms (rūpa)[n.1098]Rūpahere perhaps means ‘thing seen’., personality(sakkāya).",
    "dn33:199–200": "(25) 'Five bases of deliverance(vimuttāyatanāni): Here, the Teacher or a respected fellow-disciple teaches a monk Dhamma. And as he receives the teaching, he gains a grasp of both the spirit and the letter of the teaching. At this, joy arises in him, and from this joy, delight(pīti); and by this delight his senses are calmed, he feels happiness(sukhaṁ)as a result, and with this happiness his mind is established;[n.1099] 'By the samādhi of the fruit of Arahantship' (DA). In this context, it is perhaps worth noting that in Buddhism, as opposed to some non-Buddhist usage, samādhi by itself never means 'liberation' or 'enlightenment' (seen.225).he has not heard it thus, but in the course of teaching Dhamma to others he has learnt it by heart as he has heard it; or as he is chanting the Dhamma … ; or he feels happiness as a result, and with this happiness his mind is established.",
    "dn33:201": "(26) 'Five perceptions making for maturity of liberation: the perception of impermanence(anicca-sañña), of suffering in impermanence(anicce dukkha-saññā), of impersonality in suffering(dukkhe anatta-saññā), of abandoning(pahāna-saññā), of dispassion(virāga-saññā).",
    "dn33:202": "'These are thesets offive things which were perfectly proclaimed by the Lord…'",
    "dn33:203": "'There aresets ofsix things which were perfectly proclaimed by the Lord…",
    "dn33:204": "(1) 'Six internal sense-spheres(ajjhattikāni āyatanāni): eye-, ear-, nose-, tongue-, body-(kāyāyatanaṁ), mind-sense-sphere(manāyatanaṁ).",
    "dn33:205": "(2) 'Six external sense-spheres(bahirāni āyatanāni): sight-object(rūpāyatanaṁ), sound-, smell-, taste-, tangible object(phoṭṭabbāyatanaṁ), mind-object(dhammāyatanaṁ).",
    "dn33:206": "(3) 'Six groups of consciousness(viññaṇa-kāyā): eye-consciousness, ear-, nose-, tongue-, body-, mind-consciousness.",
    "dn33:207": "(4) 'Six groups of contact(phassa-kāyā): eye-, ear-, nose-, tongue-, body-, mind-contact(mano-samphasso).",
    "dn33:208": "(5) 'Six groups of feeling(vedanā-kāyā): feeling based on eye-contact(cakkhu-samphassajā vedanā), on ear-, nose-, tongue-, body-, mind-contact.",
    "dn33:209": "(6) 'Six groups of perception(saññā-kāyā): perception of sights(rūpa-saññā), of sounds, of smells, of tastes, of touches, of mind-objects(dhamma-saññā).",
    "dn33:210": "(7) 'Six groups of volition(sañcetanā-kāyā): volition based on sights, sounds, smells, tastes, touches, mind-objects.",
    "dn33:211": "(8) 'Six groups of craving(taṇhā-kāyā): craving for sights, sounds, smells, tastes, touches, mind-objects.",
    "dn33:212": "(9) 'Six kinds of disrespect(agāravā): Here, a monks behaves disrespectfully and discourteously towards the Teacher, the Dhamma, the Saṅgha, the training, in respect of earnestness(appamāde), of hospitality(paṭisanthāre).",
    "dn33:213": "(10) 'Six kinds of respect(gāravā): Here, a monk behaves respectfully and courteously towards the Teacher, the Dhamma, the Saṅgha, the training, in respect of earnestness(appamāde), of hospitality(paṭisanthāre)",
    "dn33:214": "(11) 'Six pleasurable investigations(somanassûpavicārā):[n.1100] 'Investigations linked with pleasure' (DA).When, on seeing a sight-object with the eye, on hearing…, smelling …, tasting …, touching …, knowing a mind-object with the mind, one investigates a corresponding object productive of pleasure.",
    "dn33:215": "(12) 'Six unpleasurable investigations: When, on seeing a sight-object with the eye, on hearing…, smelling …, tasting …, touching .., knowing a mind-object with the mind, one investigates a corresponding object productive of displeasure.",
    "dn33:216": "(13) 'Six indifferent investigations: When, on seeing a sight-object with the eye, on hearing…, smelling …, tasting …, touching .., knowing a mind-object with the mind, one investigates a corresponding object productive of indifference(upekhā).",
    "dn33:217": "(14) 'Six things conducive to communal living(sārāṇīyā dhammā):[n.1101] The meaning ofsārāniyā dhammais not quite certain. At DN 16.1.11, RN has 'conditions of welfare', which is a slip for the precedingaparihāniyā dhammā.As long as monks both in public and in private show loving-kindness to their fellows in acts of body…",
    "dn33:218": "As long as monks both in public and in private show loving-kindness to their fellows in acts of speech…",
    "dn33:219": "As long as monks both in public and in private show loving-kindness to their fellows in acts of thought…",
    "dn33:220": "Share with their virtuous fellows whatever they receive as a rightful gift, including the contents of their alms-bowls, which they do not keep to themselves, …",
    "dn33:221": "Keep consistently, unbroken and unaltered those rules of conduct that are spotless, leading to liberation, praised by the wise, unstained and conducive to concentration, and persist therein with their fellows both in public and in private,…",
    "dn33:222": "Continue in that noble view that leads to liberation, to the utter destruction of suffering, remaining in such awareness with their fellows both in public and in private.",
    "dn33:223": "(15) 'Six roots of contention(vivāda-mūlāni): Here, a monk is angry and bears ill-will, he is disrespectful and discourteous to the Teacher, the Dhamma and the Saṅgha, and does not finish his training. He stirs up contention within the Saṅgha, which brings woe and sorrow to many, with evil consequences, misfortune and sorrow for devas and humans. If, friends, you should discover such a root of contention among yourselves or among others, you should strive to get rid of just that root of contention. If you find no such root of contention…, then you should work to prevent its overcoming you in future.",
    "dn33:224": "Or a monk is deceitful and malicious(makkhī hoti paḷāsī)…, a monk is envious and mean …, a monk is cunning and deceitful…, a monk is full of evil desires and wrong views…, a monk is opinionated(sandiṭṭhi-parāmāsī), obstinate and tenacious. If, friends, you should discover such a root of contention among yourselves or among others, you should strive to get rid of just that root of contention. If you find no such root of contention…, then you should work to prevent its overcoming you in future.",
    "dn33:225": "(16) 'Six elements: the earth-, water-, fire-, air-, space-element(ākāsa-dhātu), the consciousness-element(viṇṇāṇa-dhātu).[n.1102] The four primary elements (n.70) with the two additional ones sometimes found with them (asMN 140). For the first five in later Buddhism, cf. Lama Anagarika Govinda,Foundations of Tibetan Mysticism,(London 1959), 183ff.",
    "dn33:226": "(17) 'Six elements making for deliverance(nissaraṇīyā-dhātuyo): Here, a monk might say: \"I have developed the emancipation of the heart(ceto-vimutti)by loving-kindness(mettā), expanded it, made it a vehicle and a base, established, worked well on it, set it well in train. And yet ill-will still grips my heart.\" He should be told: \"No! do not say that! Do not misrepresent the Blessed Lord, it is not right to slander him thus, for he would not have said such a thing! Your words are unfounded and impossible. If you develop the emancipation of the heart through loving-kindness, ill-will has no chance to envelop your heart. This emancipation through loving-kindness is the cure for ill-will.\"",
    "dn33:227": "Or he might say: \"I have developed the emancipation of the heart through compassion(karuṇā), and yet cruelty still grips my heart…\"",
    "dn33:228": "Or he might say: \"I have developed the emancipation of the heart through sympathetic joy(muditā), and yet aversion(arati)still grips my heart…\"",
    "dn33:229": "Or he might say: \"I have developed the emancipation of the heart through equanimity(upekhā), and yet lust(rāgo)grips my heart.\"",
    "dn33:230": "Or he might say: \"I have developed the signless emancipation of the heart(animittā ceto-vimutti),[n.1103] Cf. VM 21.66.and yet my heart still hankers after signs(nimittānusāri hoti)… \"",
    "dn33:231": "Or he might say: \"The idea 'I am' is repellent to me, I pay no heed to the idea: 'I am this.' Yet doubts, uncertainties and problems still grip my heart…\" (Reply to each in similar terms).",
    "dn33:232": "(18) 'Six unsurpassed things(anuttariyāni):[n.1104] A miscellaneous collection of 'unsurpassed' things, the last, for example, being the recollection (not ʹmemoryʹ, RD!) of Buddha, Dhamma and Saṅgha.certainsights, things heard, gains, trainings, forms of service(paricāriyānuttariyaṁ), objects of recollection.",
    "dn33:233": "(19) 'Six subjects of recollection(anussati-ṭṭhānāni): the Buddha, the Dhamma, the Saṅgha, morality, renunciation, the devas.",
    "dn33:234": "(20) 'Six stable states(satata-vihārā):[n.1105] RD quaintly renders this 'chronic states'.On seeing an object with the eye, hearing a sound…, smelling a smell …, tasting a flavour…, touching a tangible object… or cognising a mental object with the mind, one is neither pleased(sumano)nor displeased(dummano), but remains equable(upekhako), mindful and clearly aware.",
    "dn33:235": "(21) 'Six \"species\"(ābhijātiyo): Here, one born in dark conditions lives a dark life, one born in dark conditions lives a bright life, one born in dark conditions attains Nibbāna, which is neither dark nor bright, one bom in bright conditions lives a dark life, one born in bright conditions leads a bright life, one born in bright conditions attains Nibbāna which is neither dark nor bright.",
    "dn33:236": "(22) 'Six perceptions conducive to penetration(nibbedha-bhāgiya-saññā): the perception of impermanence, of suffering in impermanence, of impersonality in suffering, of abandoning, of dispassion (as Sutta 33, verse 2.1 (26)) and the perception of cessation(nirodha-saññā).",
    "dn33:237": "'These are thesets ofsix things which were perfectly proclaimed by the Lord…'",
    "dn33:238": "'There aresets ofseven things which have been perfectly proclaimed by the Lord…",
    "dn33:239": "(1) 'Seven Ariyan treasures(ariya-dhanāni): faith, morality, moral shame(hiri), moral dread(ottappa), learning(suta), renunciation(cāga), wisdom.",
    "dn33:240": "(2) 'Seven factors of enlightenment(sambojjhaṅgā): mindfulness, investigation of phenomena, energy, delight(pīti), tranquillity, concentration, equanimity.",
    "dn33:241": "(3) 'Seven requisites of concentration:[n.1106] As if the entire Eightfold Path simply led up to Right Concentration! (cf.n.1099). See DN 18.27.right view, thought, speech, action, livelihood, effort, mindfulness.",
    "dn33:242": "(4) 'Seven wrong practices(asaddhammā): Here, a monk lacks faith, lacks moral shame, lacks moral dread, has little learning, is slack(kusḇīto), is unmindful(mutthassati), lacks wisdom.",
    "dn33:243": "(5) 'Seven right practices(saddhammā): Here, a monk has faith, moral shame and moral dread, has much learning, has aroused vigour(āraddha-viriyo), has established mindfulness(upaṭṭhita-sati hoti), possesses wisdom.",
    "dn33:244": "(6) 'Seven qualities of the true man(sappurisa-dhammā):[n.1107] The ideal man (Buddha or Arahant).Here, a monk is a knower of the Dhamma, of meanings(atthaññū), of self(attaññū),[n.1108] Naturally in the relative sense: there would be no justification for reading any notion of a 'Great Self' into this (basically pronominal) usage! Note the characteristic play on words: attha, attā, mattā.of moderation(mattaññū), of the right time, of groups(parisaññū), of persons.",
    "dn33:245": "(7) 'Seven grounds for commendation(niddasa-vatthūni),[n.1109] Readingniddasa.RD's 'bases of Arahantship' is pretty free.Here, a monk is keenly anxious to undertake the training, and wants to persist in this, to make a close study of the Dhamma, to get rid of desires, to find solitude, to arouse energy, to develop mindfulness and discrimination(sati-nepakke), to develop penetrative insight.[n.1110]Ditthi-pativedhe.RD's 'intuition of the truth' does not quite hit this off.",
    "dn33:246": "(8) 'Seven perceptions: perception of impermanence, of not-self, of foulness(asubhasaññā), of danger, of abandonment, of dispassion, of cessation.",
    "dn33:247": "(9) 'Seven powers(balāni): of faith, energy, moral shame, moral dread, mindfulness, concentration, wisdom.",
    "dn33:248": "(10) 'Seven stations of consciousness: \"There are beings who are diverse in body and diverse in perception, such as human beings, some gods, and some beings in the lower realms. This is the first station for consciousness.",
    "dn33:249": "\"There are beings who are diverse in body but identical in perception, such as the gods of the Brahma-order who are generated through the first (jhāna). This is the second station for consciousness.",
    "dn33:250": "\"There are beings who are identical in body but diverse in perception, such as the gods of streaming radiance. This is the third station for consciousness.",
    "dn33:251": "\"There are beings who are identical in body and identical in perception, such as the gods of refulgent beauty. This is the fourth station for consciousness.",
    "dn33:252": "\"There are beings who, through the complete surmounting of perceptions of material form, the passing away of perceptions of impingement, and non-attention to perceptions of diversity, (contemplating) 'Space is infinite,' arrive at the base of the infinity of space. This is the fifth station for consciousness.",
    "dn33:253": "\"There are beings who, having completely surmounted the base of the infinity of space, (contemplating) 'Consciousness is infinite,' arrive at the base of the infinity of consciousness. This is the sixth station for consciousness.",
    "dn33:254": "\"There are beings who, having completely surmounted the base of the infinity of consciousness, (contemplating) 'There is nothing,' arrive at the base of nothingness. This is the seventh station for consciousness.",
    "dn33:255": "(11) 'Seven persons worthy of offerings: The Both-Ways-Liberated, the Wisdom-Liberated, the Body-Witness, the Vision-Attainer, the Faith-Liberated, the Dhamma-Devotee, the Faith-Devoteeas Sutta 28, verse 8.",
    "dn33:256": "(12) 'Seven latent proclivities(anusayā): sensuous greed(kāma-rāga), resentment(paṭigha), views, doubt, conceit, craving for becoming(bhava-rāga), ignorance.",
    "dn33:257": "(13) 'Seven fetters(saṁyojanāni): complaisance(anunaya),[n.1111] Lit. 'going along with'.resentment (then as (12)).",
    "dn33:258": "(14) 'Seven rules for the pacification and settlement of disputed questions that have been raised:[n.1112] These form the final part (rules 221–227) of the Pāṭimokkha or code of discipline.proceedings face-to-face, recollection(sati), mental derangement, confession, majority verdict, habitual bad character, \"covering over with grass\".",
    "dn33:259": "'These are thesets ofseven things which were perfectly proclaimed by the Lord … So we should all recite them together… for the benefit, welfare and happiness of devas and humans.'",
    "dn33:260": "'There aresets ofeight things perfectly proclaimed by the Lord…",
    "dn33:261": "(1) 'Eight wrong factors(micchattā): wrong view, wrong thought, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration.",
    "dn33:262": "(2) 'Eight right factors(sammattā): right view, right thought, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.",
    "dn33:263": "(3) 'Eight persons worthy of offerings:[n.1113] Asn.1039.the Stream-Winner and one who has practised to gain the fruit of Stream-Entry, the Once-Retumer…, the Non-Returner…, the Arahant and one who has worked to gain the fruit of Arahantship.",
    "dn33:264": "(4) 'Eight occasions of indolence(kusīta-vatthūni): Here, a monk has a job to do. He thinks: \"I've got this job to do, but it will make me tired. I'll have a rest.\" So he lies down and does not stir up enough energy to complete the uncompleted, to accomplish the unaccomplished, to realise the unrealised.",
    "dn33:265": "Or he has done some work, and thinks: \"I've done this work, now I'm tired. I'll have a rest.\" So he lies down …",
    "dn33:266": "Or he has to go on a journey, and thinks: \"I have to go on this journey. It will make me tired …",
    "dn33:267": "\"Or he has been on a journey…",
    "dn33:268": "Or he goes on the alms-round in a village or town and does not get his fill of food, whether coarse or fine, and he thinks: \"I've gone for alms… … my body is tired and useless …",
    "dn33:269": "Or he goes on the alms-round … and gets his fill … He thinks: \"I've gone for alms … and my body is heavy and useless as if I were pregnant … \"[n.1114] RD has 'like a load of soaked beans', following DA, but the sense of 'pregnant' seems well established. Perhaps a case of prudishness on Buddhaghosa's part, echoed by Mrs Rhys Davids.…",
    "dn33:270": "Or he has developed some slight indisposition, and he thinks: \"I'd better have a rest…\"",
    "dn33:271": "Or he is recuperating, having not long recovered from an illness, and he thinks: \"My body is weak and useless. I'll have a rest.\" So he lies down and does not stir up enough energy to complete the uncompleted, to accomplish the unaccomplished, to realise the unrealised.",
    "dn33:272": "(5) 'Eight occasions for making an effort(ārabbha-vatthūni): Here, a monk has a job to do. He thinks: \"I've got this job to do, but in doing it I won't find it easy to pay attention to the teaching of the Buddhas. So I will stir up sufficient energy to complete the uncompleted, to accomplish the unaccomplished, to realise the unrealised.\"",
    "dn33:273": "Or he has done some work, and thinks: \"Well, I did the job, but because of it I wasn't able to pay sufficient attention to the teaching of the Buddhas. So I will stir up sufficient energy…\"",
    "dn33:274": "Or he has to go on a journey…",
    "dn33:275": "Or he has been on a journey. He thinks: \"I've been on this journey, but because of it I wasn't able to pay sufficient attention …\"",
    "dn33:276": "Or he goes for alms … without getting his fill … And he thinks: \"So my body is light and fit. I'll stir up energy…\"",
    "dn33:277": "Or he goes for alms… and gets his fill … And he thinks: \"So my body is strong and fit. I'll stir up energy…\"",
    "dn33:278": "Or he has some slight indisposition… and he thinks: \"This indisposition might get worse, so I'll stir up energy…",
    "dn33:279": "Or he is recuperating… and he thinks: \"…it might be that the illness will recur. So I'll stir up energy…\" Thus he stirs up sufficient energy to complete the uncompleted, to accomplish the unaccomplished, to realise the unrealised.",
    "dn33:280": "(6) 'Eight bases for giving: One gives as occasion offers(āsajja), from fear, thinking: \"He gave me something\", thinking: \"He will give me something\", thinking: \"It is good to give\", thinking: \"I am cooking something, they are not. It would not be right not to give something to those who are not cooking\", thinking: \"If I make this gift I shall acquire a good reputation\", in order to adorn and prepare one's heart.[n.1115] In practising (not 'studying': RD) for calm and insight. Giving (RD has 'forgiving' — a misprint for 'for giving'!) softens the heart in both donor and recipient. DA quotes the verse also found at VM 9.39:A gift for taming the untamed,A gift for every kind of good;Through giving gifts they do unbendAnd condescend to kindly speech. (Nānamoliʹs translation).",
    "dn33:281": "(7) 'Eight kinds of rebirth due to generosity: Here, someone gives an ascetic or Brahmin food, drink, clothes, transport (yānaṁ), garlands, perfumes and ointments, sleeping accommodation, a dwelling, or lights, and he hopes to receive a return for his gifts. He sees a rich Khattiya or Brahmin or householder living in full enjoyment of the pleasures of the five senses, and he thinks: \"If only when I die I may be reborn as one of these rich people!\" He sets his heart on this thought, fixes it and develops it(bhāveti).[n.1116] 'Expands' (RD). But this is the usual verb for 'developing' in meditation.And this thought, being launched(vimuttaṁ)at such a low level(hīne), and not developed to a higher level(uttarin abhāvitaṁ), leads to rebirth right there. But I say this of a moral person, not of an immoral one. The mental aspiration of a moral person is effective through its purity.[n.1117] 'I.e. its being unmixed, single-minded' (RD). DA has no comment, but the idea of the power of such a 'pure-minded' aspiration is very similar to that regarding the efficacy of a 'declaration of truth'.",
    "dn33:282": "Or he gives such gifts and, having heard that the devas in the realm of the Four Great Kings live long, are good-looking and lead a happy life, he thinks: \"If only I could be reborn there!\"",
    "dn33:283": "Or he similarly aspires to rebirth in the heavens of the Thirty-Three Gods, …the Yama devas, …the Tusita devas, …the Nimmanarati devas, …the Paranimmita-vasavatti devas. And this thought leads to rebirth right there … The mental aspiration of a moral person is effective through its purity.",
    "dn33:284": "Or he similarly aspires to rebirth in the world of Brahmā … But I say this of a moral person, not an immoral one, one freed from passion(vītarāgassa), not one still swayed by passion.[n.1118] Brahma to the Buddha is not immortal and is not a creator-god. His wisdom, though considerable, is limited, and he can be boastful (see DN 11!), but he is free from sensual passions, and so must those be who are reborn in his realm (though the passions may have only been suppressed by jhāna — which is cetovimutti 'liberation of the heart' — and not necessarily by insight, which ispaññāvimutti'liberation by wisdom': cf. nn.355, 868). But those who are reborn there have not, says the Sub-Commentary, got rid of the desire for continued existence (bhavatanhā:n.1032).The mental aspiration ofsucha moral person is effective through liberation from passion.",
    "dn33:285": "(8) 'Eight assemblies: the assembly of Khattiyas, Brahmins, householders, ascetics, devas of the Realm of the Four Great Kings, of the Thirty-Three Gods, of maras, of Brahmas.",
    "dn33:286": "(9) 'Eight worldly conditions(loka-dhammā): gain and loss, fame and shame(yaso ca ayaso ca), blame and praise, happiness and misery.",
    "dn33:287": "(10) 'Eight stages of mastery: 'Perceiving forms internally, one sees external forms, limited and beautiful or ugly, and in mastering these, one is aware that one knows and sees them. That is the first stage.",
    "dn33:288": "'Perceiving forms internally, one sees external forms, unlimited and beautiful or ugly…. That is the second stage.",
    "dn33:289": "'Not perceiving forms internally, one sees external forms, limited and beautiful or ugly… That is the third stage.",
    "dn33:290": "'Not perceiving forms internally, one sees external forms, unlimited and beautiful or ugly, and in mastering these, one is aware that one knows and sees them. That is the fourth stage.",
    "dn33:291": "'Not perceiving forms internally, one sees external forms that are blue, of blue colour, of blue lustre. Just as a flax flower which is blue, of blue colour, of blue lustre, or a Benares cloth smoothed on both sides that is blue,… so one perceives external forms that are blue,… and in mastering these, one is aware that one knows and sees them. That is the fifth stage.",
    "dn33:292": "'Not perceiving forms internally, one sees external forms that are yellow … just as a kannikara flower which is yellow,… or a Benares cloth that is yellow, so one perceives external forms that are yellow …That is the sixth stage.",
    "dn33:293": "'Not perceiving forms internally, one sees external forms that are red … Just as a hibiscus flower which is red,… or a Benares cloth which is red,… so one perceives external forms that are red … That is the seventh stage.",
    "dn33:294": "'Not perceiving forms internally, one sees external forms that are white, of white colour, of white lustre, just as the morning-star Osadhi is white,… or a Benares cloth smoothed on both sides that is white,… so not perceiving forms internally, one sees external forms that are white,… and in mastering these, one is aware that one knows and sees them. That is the eighth stage of mastery. These are the eight stages of mastery.",
    "dn33:295": "(11) 'Eight liberations: \"One possessing material form sees material forms. This is the first emancipation.",
    "dn33:296": "\"One not perceiving material forms internally sees material forms externally. This is the second emancipation.",
    "dn33:297": "\"One is released upon the idea of the beautiful. This is the third emancipation.",
    "dn33:298": "\"Through the complete surmounting of perceptions of material form, the passing away of perceptions of impingement, and non-attention to perceptions of diversity, (contemplating) 'Space is infinite,' one enters and dwells in the base of the infinity of space. This is the fourth emancipation.",
    "dn33:299": "\"Having completely surmounted the base of the infinity of space, (contemplating) 'Consciousness is infinite,' one enters and dwells in the base of the infinity of consciousness. This is the fifth emancipation.",
    "dn33:300": "\"Having completely surmounted the base of the infinity of consciousness, (contemplating) 'There is nothing,' one enters and dwells in the base of nothingness. This is the sixth emancipation.",
    "dn33:301": "\"Having completely surmounted the base of nothingness, one enters and dwells in the base of neither perception nor non-perception. This is the seventh emancipation.",
    "dn33:302": "\"Having completely surmounted the base of neither perception nor non-perception, one enters and dwells in the cessation of perception and feeling. This is the eighth emancipation.",
    "dn33:303": "\"These are thesets ofeight things…'",
    "dn33:304": "'There aresets ofnine things…",
    "dn33:305": "(1) 'Nine causes of malice(āghāta-vatthūni): Malice is stirred up by the thought: \"He has done me an injury\", \"He is doing me an injury\", \"He will do me an injury\", – \"He has done, is doing, will do an injury to someone who is dear and pleasant to me\", — \"he has done, is doing, will do a favour to someone who is hateful and unpleasant to me.\"",
    "dn33:306": "(2) 'Nine ways of overcoming malice(āghāta-paṭivinayā): Malice is overcome by the thought: — \"He has done me an injury…\" (as (1)). \"What good would it doto harbour malice?\"",
    "dn33:307": "(3) 'Nine abodes of beings. There are beings who are diverse in body and diverse in perception, such as human beings, some gods, and some beings in the lower realms. This is the first station for consciousness.",
    "dn33:308": "\"There are beings who are diverse in body but identical in perception, such as the gods of the Brahma-order who are generated through the first (jhāna). This is the second station for consciousness.",
    "dn33:309": "\"There are beings who are identical in body but diverse in perception, such as the gods of streaming radiance. This is the third station for consciousness.",
    "dn33:310": "\"There are beings who are identical in body and identical in perception, such as the gods of refulgent beauty. This is the fourth station for consciousness.",
    "dn33:311": "\"There are beings who, through the complete surmounting of perceptions of material form, the passing away of perceptions of impingement, and non-attention to perceptions of diversity, (contemplating) 'Space is infinite,' arrive at the base of the infinity of space. This is the fifth station for consciousness.",
    "dn33:312": "\"There are beings who, having completely surmounted the base of the infinity of space, (contemplating) 'Consciousness is infinite,' arrive at the base of the infinity of consciousness. This is the sixth station for consciousness.",
    "dn33:313": "\"There are beings who, having completely surmounted the base of the infinity of consciousness, (contemplating) 'There is nothing,' arrive at the base of nothingness. This is the seventh station for consciousness.",
    "dn33:314": "\"There are beings who, having completely surmounted the base of nothingness arrive at the base of nothingness. This is the eighth station for consciousness.",
    "dn33:315": "\"There are beings who, having completely surmounted the base of non-percipient beings arrive at the base of neither perception nor non-perception. This is the ninth station for consciousness.",
    "dn33:316–324": "(4) 'Nine unfortunate, inopportune times for leading the holy life(akkhaṇā asamayā brahmacariya-vāsāya):\n\n(a) A Tathāgata has been born in the world, Arahant, fully-enlightened Buddha, and the Dhamma is taught which leads to calm and perfect Nibbāna, which leads to enlightenment as taught by the Well-Farer, and this person is born in a hell-state (nirayam),[n.1119] Asn.244.… among the animals, … among the petas, … among the asuras, … in a long-lived group of devas,[n.1120] I.e. rebirth among those devas whose lives are so long that they miss the chance of human rebirth at a propitious time. Cf.n.888.or (f) he is born in the border regions among foolish barbarians where there is no access for monks and nuns, or male and female lay-followers, or (g) he is born in the Middle Country,[n.1121] The central, ‘civilised’ area of India (including the Gangetic basin) as opposed to other less favoured regions: cf.n.722.but he has wrong views and distorted vision, thinking: “There is no giving, offering or sacrificing, there is no fruit or result of good or bad deeds; there is not this world and the next world; there are no parents and there is no spontaneous rebirth; there are no ascetics and Brahmins in the world who, having attained to the highest and realised for themselves the highest knowledge about this world and the next, proclaim it\";[n.1122] The words of Ajita Kesakambali (DN 2.23).or … he is born in the Middle Country but lacks wisdom and is stupid, or is deaf and dumb and cannot tell whether something has been well said or ill said; or else … no Tathāgata has arisen … and this person is born in the Middle Country and is intelligent, not stupid, and not deaf or dumb, and well able to tell whether something has been well said or ill said.",
    "dn33:325": "(5) 'Nine successive abidings:the jhānas and Spheres of Infinite Space, Infinite Consciousness, No-Thingness, Neither-Perception-Nor-Non-Perception, and Cessation of Perception and Feeling.",
    "dn33:326": "(6) 'Nine successive cessations(anupubba-nirodhā): By the attainment of the first jhāna, perceptions of sensuality(kāmasaññā)cease; by the attainment of the second jhāna, thinking and pondering cease; by the attainment of the third jhāna, delight(pīti)ceases; by the attainment of the fourth jhāna, in-and out-breathing ceases;[n.1123] I.e. becomes so subtle as to be imperceptible.by the attainment of the Sphere of Infinite Space, the perception of materiality ceases, by the attainment of the Sphere of Infinite Consciousness, the perception of the Sphere of Infinite Space ceases; by the attainment of the Sphere of No-Thingness, the perception of the Sphere of Infinite Consciousness ceases; by the attainment of the Sphere of Neither-Perception-Nor-Non-Perception, the perception of the Sphere of No-Thingness ceases; by the attainment of the Cessation-of-Perception-and-Feeling, perception and feeling cease.",
    "dn33:327": "'These are thesets ofnine things…'",
    "dn33:328": "'There aresets often things perfectly proclaimed by the Lord…",
    "dn33:329–338": "(1) 'Ten things that give protection(nātha-karana-dhammā):[n.1124] Dhammā here clearly means 'things, factors', not 'doctrines' (RD).Here a monk is moral, he lives restrained according to the restraint of the discipline, persisting in right behaviour, seeing danger in the slightest fault, he keeps to the rules of training; he has learnt much, and bears in mind and retains what he has learnt. In these teachings, beautiful in the beginning, the middle and the ending, which in spirit and in letter proclaim the absolutely perfected and purified holy life, he is deeply learned, he remembers them, recites them, recites them, reflects on them and penetrates them with vision; he is a friend, associate and intimate of good people; he is affable, endowed with gentleness and patience, quick to grasp instruction; whatever various jobs there are to be done for his fellow-monks, he is skilful, not lax, using foresight in carrying them out, and is good at doing and planning; he loves the Dhamma and delights in hearing it, he is especially fond of the advanced doctrine and discipline(abhidhamme abhivinaye);[n.1125] DA is doubtful whether abhidhamma here means ‘the seven Pakaranas’, i.e. the Abhidhamma Pitaka as we know it, or not. The short answer is that if this text goes back to the Buddha’s time (which is possible but far from certain), the word 94abhidhamma can only have the more general sense of ‘higher teaching’ or the like. Similar considerations apply toabhivinaya.he is content with any kind of requisites: robes, alms-food, lodging, medicines in case of illness; he ever strives to arouse energy, to get rid of unwholesome states, to establish wholesome states, untiringly and energetically striving to keep such good states and never shaking off the burden; he is mindful, with a great capacity for clearly recalling things done and said long ago;[n.1126] Cf.n.1074.he is wise, with wise perception of arising and passing away, that Ariyan perception that leads to the complete destruction of suffering.",
    "dn33:339": "(2) 'Ten objects for the attainment of absorption(kasiṇāyatanāni):[n.1127] Not 'objects for self-hypnosis' (RD). The jhānas differ from hypnotic trance in that one has full control and is not suggestible. I am indebted to Dr Nick Ribush for this valuable clarification.He perceives the Earth-Kasina, the Water-Kasina, the Fire-Kasina, the Wind-Kasina, the Blue Kasina, the Yellow Kasina, the Red Kasina, the White Kasina, the Space-Kasina, the Consciousness Kasina,[n.1128] There is some confusion about the last two members of this list. Elsewhere we findāloka'light' instead of consciousness (the latter is difficult to envisage as akasina). See VM 5.26 and note 5 there.above, below, on all sides, undivided, unbounded.",
    "dn33:340": "(3) 'Ten unwholesome courses of action(akusala-kammapathā): taking life, taking what is not given, sexual misconduct, lying speech, slander, rude speech, idle chatter, greed, malevolence, wrong view.",
    "dn33:341": "(4) 'Ten wholesome courses of action: avoidance of taking life… (and so on, as3) above.",
    "dn33:342": "(5) 'Ten Ariyan dispositions(ariya-vāsā): Here a monk has got rid of five factors, possesses six factors, has established one guard, observes the four supports, has got rid of individual beliefs,[n.1129] Or 'sectarian opinions' (RD). Private aberrations of view.has quite abandoned quest, is pure of motive, has tranquillised his emotions,[n.1130]Passaddha-kāya-saṅkhāro,where kāya means the mental body.is well liberated in heart, and by wisdom.",
    "dn33:343–352": "How has he got rid of five factors? Here, he has got rid of sensuality, ill-will, sloth-and-torpor, worry-and-flurry, and doubt; what six factors does he possess? On seeing an object with the eye, hearing a sound…, smelling a smell…, tasting a flavour…, touching a tangible object…, or cognising a mental object with the mind, he is neither pleased nor displeased, but remains equable, mindful and clearly aware; how has he established the one guard? By guarding his mind with mindfulness; what are the four supports? He judges that one thing is to be pursued, one thing endured, one thing avoided, one thing suppressed (as inverse 120); how has he got rid of individual beliefs(panunna-pacceka-sacco?)Whatever individual beliefs are held by the majority of ascetics and Brahmins he has dismissed, abandoned, rejected, let go; how is he one who has quite abandoned quests? He has abandoned the quest for sense-desires, for rebirth, for the holy life;[n.1131] Getting involved in problems about 'self', etc.how is he pure of motive? He has abandoned thoughts of sensuality, ill-will, cruelty; how is he one who has tranquillised his emotions(passaddha-kaya-saṅkhāro hoti)? Because, having given up pleasure and pain with the disappearance of former gladness and sadness, he enters into a state beyond pleasure and pain which is purified by equanimity, and this is the fourth jhāna; how is he well emancipated in heart? He is liberated from the thought of greed, hatred and delusion; how is he well liberated by wisdom? He understands: \"For me greed, hatred and delusion are abandoned, cut off at the root, like a palm-tree stump, destroyed and incapable of growing again.\"",
    "dn33:353": "(6) 'Ten qualities of the non-learner(asekha):[n.1132] See alson.542.The non-learner's right view, right thought; right speech, right action, right livelihood; right effort, right mindfulness, right concentration; right knowledge(sammā –n͂āṇam), right liberation(sammā –vimutti).",
    "dn33:354": "'These are thesets often things which have been perfectly set forth by the Lord who knows and sees, the fully-enlightened Buddha. So we should all recite them together without disagreement, so that this holy life may be long-lasting and established for a long time to come, thus to be for the welfare and happiness of the multitude, out of compassion for the world, for the benefit, welfare and happiness of devas and humans.'",
    "dn33:355": "And when the Lord had stood up, he said to the Venerable Sāriputta: 'Good, good, Sāriputta! Well indeed have you proclaimed the way of chanting together for the monks!'",
    "dn33:356": "These things were said by the Venerable Sāriputta, and the Teacher confirmed them. The monks were delighted and rejoiced at the Venerable Sāriputta's words."
}