{
    "dn34:1": "Thus have I heard.[n.33] This is largely a rearrangement, under ten heads, of the material found in DN 33. As in 33, Sāriputta gives the systematic instruction, but it is noteworthy that the Buddha is not stated either to request him to do so, or to confirm what he has said. In fact 70 out of the 00 items in 34 are identical with 70 out of the 230 items in 33.Once the Lord was staying at Campā beside the Gaggarā lotus-pond, with a large company of some five hundred monks. Then the Venerable Sāriputta addressed the monks: 'Friends, monks!' 'Friend!' replied the monks. And the Venerable Sāriputta said:",
    "dn34:2": "'In growing groups from one to ten I'll teachDhamma for the gaining of Nibbāna,That you may make an end of suffering,And be free from all the ties that bind.",
    "dn34:3": "'There is friends, (1) one thing that greatly helps(bahukāro), (2) one thing to be developed(bhāvetabbo), () one thing to be thoroughly known(parin͂n͂eyyo), (4) one thing to be abandoned(paha͂tabbo), (5) one thing that conduces to diminution[n.114] Or ‘decline’: cf.n.68.(ha͂na-bha͂giyo), (6) one thing that conduces to distinction(visesa-bha͂giyo), (7) one thing hard to penetrate(duppativijjho ), (8) one thing to be made to arise(uppa͂detabbo), (9) one thing to be thoroughly learnt(abhin͂n͂eyyo), and (10) one thing to be realised(sacchikātabbo).",
    "dn34:4": "(1) 'Which one thing greatly helps? Tirelessness in wholesome states(appamādo kusalesu dhammesu).",
    "dn34:5": "(2) 'Which one thing is to be developed? Mindfulness with regard to the body, accompanied by pleasure(kāya-gata sati sāta-sahagatā).",
    "dn34:6": "(3) 'Which one thing is to be thoroughly known? Contact as a condition of the corruptions and of grasping(phasso sāsavo upādāniyo).",
    "dn34:7": "(4) 'Which one thing is to be abandoned? Ego-conceit[n.1136] RD’s laconic noteʹRūpādisuʹconveys, of course, nothing to the reader ignorant of Pali! The meaning is ‘beginning with the body’, i.e. the conceit: ‘I am this body’, etc.(asmimāna).",
    "dn34:8": "(5) 'Which one thing conduces to diminution? Unwise attention(ayoniso manasikāro).",
    "dn34:9": "(6) 'Which one things conduces to distinction? Wise attention(yoniso manasikāro).",
    "dn34:10": "(7) 'Which one thing is hard to penetrate? Uninterrupted mental concentration[n.1137] The arising of a ‘path-moment’ (Stream-Entry, etc.) after insight.(ānantariko ceto-samādhi).",
    "dn34:11": "(8) 'Which one thing is to be made to arise? Unshakeable knowledge(akuppaṁ nāa͂ṇaṁ).",
    "dn34:12": "(9) 'Which one thing is to be thoroughly learnt? All beings are maintained by nutriment.",
    "dn34:13": "(10) 'Which one thing is to be realised? Unshakeable deliverance of mind(akuppa͂ ceto-vimutti).",
    "dn34:14": "'That makes ten things that are real and true, so and not otherwise, unerringly and perfectly realised by the Tathagata.'",
    "dn34:15": "'Two things greatly help, (2) two things to be developed, (3) two things to be thoroughly known, (4) two things to be abandoned, (5) two things that conduce to diminution, (6) two things that conduce to distinction, (7) two things hard to penetrate, (8) two things to be made to arise, (9) two things to be thoroughly learn, and (10) two things to be realised.",
    "dn34:16": "(1) 'Which two things greatly help? Mindfulness and clear awareness.",
    "dn34:17": "(2) 'Which two things are to be developed? Calm and insight.",
    "dn34:18": "(3) 'Which two things are to be thoroughly known? Mind and body.",
    "dn34:19": "(4) 'Which two things are to be abandoned? Ignorance and craving for existence.",
    "dn34:20": "(5) 'Which two things conduce to diminution? Roughness and friendship with evil.",
    "dn34:21": "(6) 'Which two things conduce to distinction? Gentleness and friendship with good.",
    "dn34:22": "(7) 'Which two things are hard to penetrate? That which is the root, the condition of the defilement of beings, and that which is the root, the condition of the purification of beings(yo ca hetu yo ca paccayo sattā̵̵̵naṁ saṁkilesāya, …sattānaṁ visuddhiyā).",
    "dn34:23": "(8) 'Which two things are to be made to arise? Knowledge of the destructionof the defilementsand oftheirnon-recurrence.",
    "dn34:24": "(9) 'Which two things are to be thoroughly learnt? Two elements, the conditioned and the unconditioned[n.1138] The latter part of RD’s mysterious-seeming note 7 (p. 251) actually belongs here. The ‘unconditioned element’(asaṅkhata-dhātu)is a term for Nibbāna.(saṅkhatā ca dhātu asaṅkhatā ca dhātu).",
    "dn34:25": "(10) 'Which two things are to be realised? Knowledge and liberation.",
    "dn34:26": "'That makes twenty things that are real and true, so and not otherwise, unerringly and perfectly realised by the Tathagata.'",
    "dn34:27": "'Three things greatly help, three things are to be developed …",
    "dn34:28": "(1)'Which three things greatly help? Association with good people, hearing the true Dhamma, practice of the Dhamma in its entirety.",
    "dn34:29": "(2) 'Which three things are to be developed? Three kinds of concentration.",
    "dn34:30": "(3) 'Which three things are to be thoroughly known? Three feelings.",
    "dn34:31": "(4) 'Which three things are to be abandoned? Three kinds of craving.",
    "dn34:32": "(5) 'Which three things conduce to diminution? Three unwholesome roots.",
    "dn34:33": "(6) 'Which three things conduce to distinction? Three wholesome roots.",
    "dn34:34": "(7) 'Which three things are hard to penetrate? Three elements making for deliverance(nissāraṇīyā dhātuyo): deliverance from sensuality(kāmā), that is, renunciation(nekkhammaṁ), deliverance from material forms(rāpā), that is, the immaterial(āruppaṁ), whatever has become, is compounded, is conditionally arisen — the deliverance from that is cessation(nirodho).",
    "dn34:35.": "(8) 'Which three things are to be made to arise? Three knowledges(ñāṇāni)of past, future, present.",
    "dn34:36": "(9) 'Which three things are to be thoroughly learnt? Three elements.",
    "dn34:37": "(10) 'Which three things are to be realised? Three knowledges.",
    "dn34:38": "'That makes thirty things that are real and true, so and not otherwise, unerringly and perfectly realised by the Tathagata.'",
    "dn34:39": "'Four things greatly help, four things are to be developed…",
    "dn34:40": "(1) 'Which four things greatly help? Four \"wheels\"[n.1139] ‘Wheels’ in the sense of means of progress (DA).(cakkāni): a favourable place of residence(paṭirūpa-desa-vāso), association with good people(sappurisûpassayo), perfect development of one's personality(atta-sammā-paṇidhi), past meritorious actions(pubbe-kata-puññata).",
    "dn34:41": "(2) 'Which four things are to be developed? Four foundations of mindfulness.",
    "dn34:42": "(3) 'Which four things are to be thoroughly known? Four nutriments.",
    "dn34:43": "(4) 'Which four things are to be abandoned? Four floods.",
    "dn34:44": "(5)'Which four things conduce to diminution? Four yokes.",
    "dn34:45": "(6) 'Which four things conduce to distinction? Four \"unyokings\".",
    "dn34:46": "(7) 'Which four things are hard to penetrate? Four concentrations:conducing to declinehāna-bhāgiyo,conducing to stasisṭhiti-bhāgiyo,conducive to distinctionvisesabhāgiyo,conducive to penetrationnibbedha-bhāgiyo.",
    "dn34:47": "(8) 'Which four things are to be made to arise? Four knowledges.",
    "dn34:48": "(9) 'Which four things are to be thoroughly learnt? Four Noble Truths.",
    "dn34:49": "(10) 'Which four things are to be realised? Four fruits of the ascetic life.",
    "dn34:50": "'That makes forty things that are real and true, so and not otherwise, unerringly and perfectly realised by the Tathāgata.",
    "dn34:51": "'Five things greatly help, five things are to be developed…",
    "dn34:52": "(1) 'Which five things greatly help? Five factors of endeavour.",
    "dn34:53": "(2) 'Which five things are to be developed? Fivefold perfect concentration:[n.1140] This refers to the various jhāna states: (a) is the first two jhānas, and (b) the first three. (c) and (d), according to DA, refer to telepathic awareness of others’ minds, and clairvoyance respectively (though this interpretation seems dubious). See nn.1141-2.(a) suffusion with delight,(pīti), (b) suffusion with happiness(sukha), (c) suffusion with will(ceto),[n.1141]Cetohere probably means ‘will’, rather than other people’s minds (why should these be ‘suffused’?).(d) suffusion with light(āloka), (e) the \"reviewing\" sign[n.1143] The ‘reviewing consciousness’ on emerging from jhāna, etc. Seen.213.(paccavekkhaṇa-nimitta).",
    "dn34:54": "(3) 'Which five things are to be thoroughly known? Five aggregates of grasping.",
    "dn34:55": "(4) 'Which five things are to be abandoned? Five hindrances.",
    "dn34:56": "(5) 'Which five things conduce to diminution? Five mental blockages.",
    "dn34:57": "(6) 'Which five things conduce to distinction? Five faculties.",
    "dn34:58–62": "(7) 'Which five things are hard to penetrate? Five elements making for deliverance.",
    "dn34:63": "(8) 'Which five things are to be made to arise? The fivefold knowledge of right concentration(pañcañāṇiko sammā samādhi): the knowledge that arises within one that:",
    "dn34:64–68": "(9) 'Which five things are to be thoroughly learnt? Five bases of deliverance.",
    "dn34:69": "(10) 'Which five things are to be realised? Five branches of Dhamma plus knowledge and vision of liberationvimutti-nana-dassana-kkhandho.",
    "dn34:70": "'That makes fifty things that are real and true, and not otherwise, unerringly and perfectly realised by the Tathgāta.'",
    "dn34:71": "'Six things greatly help, six things are to be developed…",
    "dn34:72–77": "(1) 'Which six things greatly help? Six things to be remembered.",
    "dn34:78": "(2) 'Which six things are to be developed? Six subjects of recollection.",
    "dn34:79": "(3) 'Which six things are to be thoroughly known? Six internal sense-spheres.",
    "dn34:80": "(4) 'Which six things are to be abandoned? Six groups of craving.",
    "dn34:81": "(5) 'Which six things conduce to diminution? Six kinds of disrespect.",
    "dn34:82": "(6) 'Which six things conduce to distinction? Six kinds of respect.",
    "dn34:83–88": "(7) 'Which six things are hard to penetrate? Six elements making for deliverance.",
    "dn34:89": "(8) 'Which six things are to be made to arise? Six stable states.",
    "dn34:90": "(9) 'Which six things are to be thoroughly known? Six unsurpassed things.",
    "dn34:91": "(10) 'Which six things are to be realised? Six super-knowledges(abhiññā): Here, a monk applies and bends his mind to, and enjoys, different supernormal powers(iddhī)",
    "dn34:92": "With the divine ear-element, which is purified and surpasses the human, he hears both kinds of sound, the divine and the human, those which are distant and those which are near;",
    "dn34:93": "He understands the minds of other beings and persons, having encompassed them with his own mind. He understands an unexalted mind as an exalted mind, a mind with lust as a mind with lust and an unliberated mind as an unliberated mind;",
    "dn34:94": "He recollects his numerous past lives, that is, one birth, .. Thus he recollects his numerous past lives in their modes and their details;",
    "dn34:95": "Thus with the divine eye, which is purified and surpasses the human, he sees beings passing away and reappearing—inferior and superior, beautiful and ugly, fortunate and unfortunate—and he understands how beings fare in accordance with their kamma;",
    "dn34:96": "He abides, in this life, by his own super-knowledge and realisation, in the attainment of the corruptionless liberation of heart and liberation through wisdom.",
    "dn34:97": "'That makes sixty things that are real and true, so and not otherwise, unerringly and perfectly realised by the Tathagata.'",
    "dn34:98": "'Seven things help greatly, seven things are to be developed …",
    "dn34:99": "(1) 'Which seven things greatly help? Seven treasures.",
    "dn34:100": "(2) 'Which seven things are to be developed? Seven factors of enlightenment.",
    "dn34:101–107": "(3) 'Which seven things are to be thoroughly known? Seven stations of consciousness.",
    "dn34:108": "(4) 'Which seven things are to be abandoned? Seven latent proclivities.",
    "dn34:109": "(5) 'Which seven things conduce to diminution? Seven wrong practices.",
    "dn34:110": "(6) 'Which seven things conduce to distinction? Seven right practices.",
    "dn34:111": "(7) 'Which seven things are hard to penetrate? Seven qualities of the true man.",
    "dn34:112": "(8) 'Which seven things are to be made to arise? Seven perceptions.",
    "dn34:113": "(9) 'Which seven things are to be thoroughly learnt? Seven grounds for commendation.",
    "dn34:114": "(10) 'Which seven things are to be learnt? Seven powers of an Arahant[n.9]Khīnāsava‘one in whom the corruptions are exhausted’ is a synonym for an Arahant. The seven powers mentioned here correspond to Nos 1, 2, 3, 4, 7, 9 and 10 of the list at PD 19.24 — 33 (= Pts ii, 173f.).(khīnāsava-balāni). Here, for a monk who has destroyed the corruptions,the impermanence of all compounded things is well seen, as it really is, by perfect insight. This is one way whereby he recognises that for him the corruptions are destroyed;",
    "dn34:115": "… sense-desires are well seen as being like a pit of glowing embers…;",
    "dn34:116": "… his heartcittamis bent on and inclined towards detachmentviveka, slopes towards detachment and detachment is its object; rejoicing in renunciationnekkhammdbhiratath, his heart is totally unreceptive to all things pertaining to the corruptions…;",
    "dn34:117": "… the four foundations of mindfulness have been well and truly developed … ;",
    "dn34:118": "… the five faculties[n.1150] One would expect, rather, the five powers, since these five ‘faculties’ (faith, etc. as 6 (vi)) become powers (i.e. unshakeable by their opposites) from First Path onwards. In fact the fuller list at PD 19 (n.1149) includes both ‘faculties’ and ‘powers’.have been well developed…;",
    "dn34:119": "… the seven factors of enlightenment[n.1151] As §100 above.have been been well developed … ;",
    "dn34:120": "the Noble Eightfold Path has been well and truly developed … This is one of the powers whereby he recognises that for him the corruptions are destroyed.",
    "dn34:121": "'That makes seventy things that are real and true, so and not otherwise, unerringly and perfectly realised by the Tathagata.'",
    "dn34:122": "'Eight things greatly help, eight things are to be developed …",
    "dn34:123": "(1) 'Which eight things greatly help? Eight causes, eight conditions conduce to wisdom in the fundamentals of the holy life, to gaining what has not been gained and to increasing, expanding and developing what has been gained. Here, one lives close to the Teacher or to a fellow-monk with the standing of a teacher, being thus strongly established in moral shame and moral dread, in love and veneration…",
    "dn34:124": "He who is so placed from time to time goes to his teacher, asks and interrogates him: \"How is that, Lord? What does this mean?\" Thus his venerable teachers can reveal what is hidden and clarify obscurities, in this way helping him to solve his problems.",
    "dn34:125": "Then, having heard Dhamma from them, he achieves withdrawalvūpakāsa,[n.1152] Rendered ‘serenity’ by RD, but see PED.of body and mind.",
    "dn34:126": "Further, a monk is moral, he lives restrained according to the restraint of the discipline, persisting in right behaviour, seeing danger in the slightest fault, and keeping to the rules of training.",
    "dn34:127": "Also, a monk, having learnt much, remembers and bears in mind what he has learnt, and those things that are beautiful in the beginning, in the middle and in the ending, which in spirit and letter proclaim the absolutely perfected and purified holy life, he remembers and reflects on, and penetrates them with vision.",
    "dn34:128": "Again, a monk, having stirred up energy, continues to dispel unwholesome states, striving strongly and firmly, and not casting off the yoke of the wholesome.",
    "dn34:129": "Again, a monk is mindful, with the highest mindfulness and discrimination, remembering and bearing in mind what has been done or said in the past.",
    "dn34:130": "Also, a monk continually contemplates the rise and fall of the five aggregates of grasping, thinking: \"Such is material form, its arising and passing; such are feelings, such are perceptions, such are the mental formations, such is consciousness, its arising and passing.\"",
    "dn34:131": "(2) 'Which eight things are to be developed? The Noble Eightfold Path: Right View…Right Concentration.",
    "dn34:132": "(3) 'Which eight things are to be thoroughly known? Eight worldly conditions.",
    "dn34:133": "(4) 'Which eight things are to be abandoned? Eight wrong factors.",
    "dn34:134–141": "(5) 'Which eight things conduce to diminution? Eight occasions of indolence.",
    "dn34:142–149": "(6) 'Which eight things conduce to distinction? Eight occasions for making an effort.",
    "dn34:150–157": "(7) 'Which eight things are hard to penetrate? Eight unfortunate, inopportune times for leading the holy life.",
    "dn34:158": "(8) 'Which eight things are to be made to arise? Eight thoughts of a Great ManMahāpurisa-vitakkā:[n.1153] These are given atAN 8.30with the statement that the first seven were proposed by the Venerable Anuruddha, and the eighth added by the Buddha.\"This Dhamma is for one of few wants, not one of many wants; for the contented, not for the discontented; for the withdrawn, not for those delighting in company; for the energetic, not for the lazy; for one of established mindfulness, not for one of lax mindfulness; for one of concentrated mind, not for one who is not concentrated; for one who has wisdom, not for one lacking wisdom; for one who delights in non-proliferation[n.1154] For the meaning of papañca seen.606.(nippapañcārāmassa), not for one who delights in proliferation.\"",
    "dn34:159–166": "(9) 'Which eight things are to be thoroughly learnt? Eight states of mastery.",
    "dn34:167–174": "(10) 'Which eight things are to be realised? Eight liberations.",
    "dn34:175": "'That makes eighty things that are real and true, so and not otherwise, unerringly and perfectly realised by the Tathagata.'",
    "dn34:176": "'Nine things greatly help, nine things are to be developed …",
    "dn34:177": "(1) 'Which nine things greatly help? Nine conditions rooted in wise considerationyoniso-manasikāra-mūlakā dhammā: When a monk practises wise consideration, joypāmojjaarises in him, and from his being joyful, delightpītiarises, and from his feeling delight, his senses[n.1155]Kāyoas ‘mental body’. Cf.n.641.are calmed; as a result of this calming he feels happinesssukha, and from his feeling happy, his mind becomes concentrated; with his mind thus concentrated, he knows and sees things as they really are; with his thus knowing and seeing things as they really are, he becomes disenchantednibbindati; with disenchantment he becomes dispassionatevirajjati, and by dispassion he is liberated.",
    "dn34:178": "(2) 'Which nine things are to be developed? Nine factors of the effort for perfect purity[n.1156] The first seven of these form the framework of VM, which in turn is based on the scheme ofMN 24.pārisuddhi-padhāniyaṅgāni: the factor of effort for purity of morality, … for purity of mind, … for purity of view, … of purification by overcoming doubt[n.1157] Not ‘escaping doubt’ (whatever that may mean!): RD.kaṅkhā-vitaraṇa-visuddhi, …of purification by knowledge and vision of path and not-path $maggāmagga-ñāṇa-dassana-visuddhi, …of purification by knowledge and vision of progresspaṭipadā-ñāṇa-dassana-visuddhi, … of purification by knowledge and visionñāṇa-dassana-visuddhi, … of purity of wisdompaññā-visuddhi, … of purity of deliverancevimutti-visuddhi.",
    "dn34:179–187": "(3) 'Which nine things are to be thoroughly known? Nine abodes of beings.",
    "dn34:188": "(4) 'Which nine things are to be abandoned? Nine things rooted in craving: in dependence upon feeling there is craving; in dependence upon craving there is pursuit; in dependence upon pursuit there is gain; in dependence upon gain there is decision-making; in dependence upon decision-making there is desire and lust; in dependence upon desire and lust there is attachment; in dependence upon attachment there is possessiveness; in dependence upon possessiveness there is stinginess; in dependence upon stinginess there is safeguarding; and because of safeguarding, various evil unwholesome phenomena originate—the taking up of clubs and weapons, conflicts, quarrels, and disputes, insulting speech, slander, and falsehoods.",
    "dn34:189": "(5) 'Which nine things conduce to diminution? Nine causes of malice.",
    "dn34:190": "(6) 'Which nine things conduce to distinction? Nine ways of overcoming malice.",
    "dn34:191": "(7) 'Which nine things are hard to penetrate? Nine differencesnānattā: Owing to difference of element[n.1158] The subject is elaborated atSN 14.1ffdhātuthere is difference of contact[n.1159] This, as usual, means contact of sense-base with object, e.g. eye and thing seen.phassa; owing to difference of contact there is difference of feeling; owing to difference of feeling there is difference of perception; owing to difference of perception there is difference of thoughtsaṅkappa; owing to difference of thought there is difference of intentionchanda; owing to difference of intention there is difference of obsessionpariḷāha; owing to difference of obsession there is difference of questpariyesanā; owing to difference of quest there is difference of what is gainedlābha.",
    "dn34:192": "(8) 'Which nine things are to be made to arise? Nine perceptions[n.1160] The term ‘perception’ is used in a very pregnant sense here, being virtually equivalent to ’realisation’.sañña:of the foulasubha, of death,[n.1161] RD’s remark thatsaññāhere is ‘concept rather than percept, or perception widely understood’ does not quite hit the mark. See previous note.of the loathsomeness of foodāhāre paṭikkūla sañña, of distaste for the whole worldsabba-loke anabhirati-saññā, of impermanence, of the suffering in impermanence, of impersonality in suffering, of relinquishmentpahāna, of dispassionvirāga.",
    "dn34:193": "(9) 'Which nine things are to be thoroughly learnt? Nine successive abidings.",
    "dn34:194": "(10) 'Which nine things are to be realised? Nine successive cessations.",
    "dn34:195": "'That makes ninety things that are real and true so and not otherwise, unerringly and perfectly realised by the Tathāgata.'",
    "dn34:196": "'Ten things (1) greatly help, (2) are to be developed, (3) are to be thoroughly known, (4) are to be abandoned, (5) conduce to diminution, (6) conduce to distinction, (7) are hard to penetrate, (8) are to be made to arise, (9) are to be thoroughly learnt, (10) are to be realised.",
    "dn34:197–206": "(1) 'Which ten things greatly help? Ten things that give protection.",
    "dn34:207": "(2) 'Which ten things are to be developed? Ten objects for the attainment of absorption.",
    "dn34:208": "(3) 'Which ten things are to be thoroughly known? Ten sense-spheres[n.1162] Here only the five outward senses and their objects are mentioned, omitting mind and mind-objects.(ādyatanāni): eye and sight-object, ear and sound, nose and smell, tongue and taste, body and tactile object.",
    "dn34:209": "(4) 'Which ten things are to be abandoned? Ten wrong courses plus wrong knowledgemicchā-nāāṇaand wrong liberationmicchā-vimutti.",
    "dn34:210": "(5) 'Which ten things conduce to diminution? Ten unwholesome courses of action.",
    "dn34:211": "(6) 'Which ten things conduce to distinction? Ten wholesome courses of action.",
    "dn34:212–222": "(7) 'Which ten things are hard to penetrate? Ten Ariyan dispositions",
    "dn34:223": "(8) 'Which ten things are to be made to arise? Ten perceptionssañña:of the foulasubha, of death, of the loathsomeness of foodāhāre paṭikkūla sañña, of distaste for the whole worldsabba-loke anabhirati-saññā, of impermanence, of the suffering in impermanence, of impersonality in suffering, of relinquishmentpahāna, of dispassionvirāgaand the perception of cessationnirodhasaññā.",
    "dn34:224": "(9) 'Which ten things are to be thoroughly learnt? Ten causes of wearing-awaynijjara-vatthūni: By right view wrong view is worn away, and whatever evil and unwholesome states arise on the basis of wrong view are worn away too. And by right view many wholesome states are developed and perfected. By right thought wrong thought is worn away… By right speech wrong speech is worn away… By right action wrong action is worn away… By right livelihood wrong livelihood is worn away … By right effort wrong effort is worn away … By right mindfulness wrong mindfulness is worn away… By right concentration wrong concentration is worn away … By right knowledge[n.1163] As atDN 33.353.wrong knowledge is worn away … By right liberation wrong liberation is worn away, and whatever evil and unwholesome states arise on the basis of wrong liberation are worn away too. And by right liberation many wholesome states are developed and perfected.",
    "dn34:225": "(10) 'Which ten things are to be realised? Ten qualities of the non-learner.",
    "dn34:226": "'That makes a hundred things that are real and true, so and not otherwise, unerringly and perfectly realised by the Tathāgata.'"
}