{
    "dn4:1": "Thus have I heard. Once the Lord was travelling among the Angas with a large company of some five hundred monks, and he arrived at Campa. At Campa he stayed by Gaggara's lotus-pond. At that time the Brahmin Sonadanda was living at Campa, a populous place, full of grass, timber, water and corn, which had been given to him by King Seniya Bimbisāra of Magadha as a royal gift and with royal powers.",
    "dn4:2": "And the Brahmins and householders of Campa heard say: 'The ascetic Gotama of the Sakyans, who has gone forth from the Sakya clan is travelling among the Angas…and is staying by Gaggara's lotus-pool. And concerning that Blessed Lord Gotama a good report has been spread about: \"This Blessed Lord is an Arahant, a fully-enlightened Buddha, perfected in knowledge and conduct, a Well-Farer, Knower of the worlds, unequalled Trainer of men to be tamed, Teacher of gods and humans, a Buddha, a Blessed Lord.\" He proclaims this world with its gods, maras, Brahmas, the world of ascetics and Brahmins with its princes and people, having come to know it by his own knowledge. He teaches a Dhamma that is lovely in its beginning, lovely in its middle and lovely in its ending, in the spirit and in the letter, and he displays the fully-perfected, thoroughly purified holy life. And indeed it is good to see such Arahants.' Thereupon the Brahmins and householders of Campa, leaving Campa in great crowds, in vast numbers, went to Gaggara's lotus-pond.",
    "dn4:3": "Just then, the Brahmin Sonadanda had gone up to his verandah for his midday rest. Seeing all the Brahmins and householders making for Gaggarā's lotus-pond, he asked his steward the reason.",
    "dn4:4": "Now at that time some five hundred Brahmins from various provinces were in Campā on some business, and they heard that Sonadanda intended to visit the ascetic Gotama. So they called upon him and asked if this were true. 'So it is, gentlemen, I am going to visit the ascetic Gotama.'",
    "dn4:5": "'Sir, do not visit the ascetic Gotama, it is not fitting that you should do so! If the Reverend Sonadanda goes to visit the ascetic Gotama, his reputation will decrease, and that of the ascetic Gotama will increase. This being so, it is not right that the Reverend Sonadanda should visit the ascetic Gotama, but rather the ascetic Gotama should visit him.",
    "dn4:6": "'The Reverend Sonadanda is well-born on both the mother's and the father's side, of pure descent to the seventh generation, unbroken, of irreproachable birth, and therefore he should not call on the ascetic Gotama, but rather the ascetic Gotama should call on him.",
    "dn4:7": "The Reverend Sonadanda is possessed of great wealth and resources…",
    "dn4:8": "The Reverend Sonadanda is a scholar, versed in the mantras, accomplished in the Three Vedas, a skilled expounder of the rules and rituals, the lore of sounds and meanings and, fifthly, oral tradition — an expounder, fully versed in natural philosophy and the marks of a Great Man.",
    "dn4:9": "The Reverend Sonadanda is handsome, good-looking, pleasing, of the most beautiful complexion, in form and countenance like Brahmā, of no mean appearance.",
    "dn4:10": "He is virtuous, of increasing virtue, endowed with increasing virtue.",
    "dn4:11": "He is well-spoken, of pleasing address, polite, of pure and clear enunciation, speaking to the point.",
    "dn4:12": "He is the teacher's teacher of many, teaching the mantras to three hundred youths, and many young men come from different districts and regions seeking to learn the mantras in his presence, desirous to learn them from him.",
    "dn4:13": "He is aged, grown old, venerable, advanced in years, long past his youth, whereas the ascetic Gotama is youthful and newly gone forth as a wanderer.",
    "dn4:14–15": "The Reverend Sonadanda is esteemed, made much of, honoured, revered, worshipped by King Seniya Bimbisāra and by the Brahmin Pokkharasati.",
    "dn4:16": "He lives at Campa, a populous place, full of grass, timber, water and corn, which has been given to him by King Seniya Bimbisāra of Magadha as a royal gift, and with royal powers. This being so, it is not proper that he should visit the ascetic Gotama, but rather the ascetic Gotama should visit him.'[n.7] Cf.MN 95",
    "dn4:17": "At this Sonadanda replied:",
    "dn4:18": "'Now listen, gentlemen, as to why it is fitting for us to visit the Reverend Gotama, and why it is not fitting for him to visit us. The ascetic Gotama is well-born on both the mother's and the father's side, of pure descent to the seventh generation, unbroken, of irreproachable birth. Therefore it is fitting for us to visit him.",
    "dn4:19": "He went forth, leaving a great body of kinsmen.",
    "dn4:20": "In fact he gave up much gold and wealth to go forth, both hidden away and openly displayed.",
    "dn4:21": "The ascetic Gotama, while youthful, a black-haired youth, in the prime of his young days, in the first stage of life went forth from the household life into homelessness.",
    "dn4:22": "Leaving his grieving parents weeping with tear-stained faces, having cut off his hair and beard and put on yellow robes, he went forth into homelessness.",
    "dn4:23–27": "He is handsome,… virtuous,… well-spoken, … the teacher's teacher of many. He has abandoned sensuality and dispelled vanity.",
    "dn4:28": "He teaches action and the results of action, honouring the blameless Brahmin way of life.",
    "dn4:29": "He is a wanderer of high birth, of a leading Khattiya family.",
    "dn4:30": "He is a wanderer from a wealthy family, of great wealth and possessions.",
    "dn4:31": "People come to consult him from foreign kingdoms and foreign lands.",
    "dn4:32": "Many thousands of devas have taken refuge with him.",
    "dn4:33–45": "'This good report has been spread about him: \"This Blessed Lord is an Arahant, a fully-enlightened Buddha, perfected in knowledge and conduct…\"as verse 2. He bears the thirty-two marks of a Great Man. He is welcoming, kindly of speech, courteous, genial, clear and ready of speech. He is attended by four assemblies, revered, honoured, esteemed and worshipped by them. Many devas and humans are devoted to him. Whenever he stays in any town or village, that place is not troubled by non-human beings. He has a crowd, a multitude of followers, is a teacher of many, he is consulted by the chief of the various leaders of sects. It is not the way with the ascetic Gotama's reputation, as it is with that of some ascetics and Brahmins, about whom this or that is reported — the ascetic Gotama's fame is based on his achievement of unsurpassed wisdom and conduct. Indeed King Seniya Bimbisāra of Magadha has gone for refuge to him together with his son, his wife, his followers and his ministers. So have King Pasenadi of Kosala and the Brahmin Pokkharasati. He is revered, honoured, esteemed and worshipped by them.",
    "dn4:46": "'The ascetic Gotama has arrived in Campa and is staying by Gaggara's lotus-pond. And whatever ascetics and Brahmins come to our territory are our guests. And we should revere, honour, esteem and worship guests. Having come to Gaggara's lotus-pond, the ascetic Gotama is such a guest, and should be treated as such. Therefore it is not proper that he should come to us, but rather we should go to him. However much I might praise the ascetic Gotama, that praise is insufficient, he is beyond all praise.'",
    "dn4:47": "On hearing this, the Brahmins said to Sonadanda: 'Sir, since you praise the ascetic Gotama so much, then even if he were to live a hundred yojanas from here, it would be fitting for a believing clansman to go with a shoulder-bag to visit him. And so, sir, we shall all go to visit the ascetic Gotama.'",
    "dn4:48": "And so Sonadanda went with a large company of Brahmins to Gaggarā's lotus-pond. But when Sonadanda had traversed the jungle-thickets, he thought: 'If I ask the ascetic Gotama a question, he might say to me: \"That, Brahmin, is not a fitting question, it is not at all a fitting question\", and then the company might despise me, saying: \"Sonadanda is a fool, he has no sense, he can't put a proper question to the ascetic Gotama.\" And if anyone were despised by this company, his reputation would suffer, and then his income would suffer, for our income depends on the gaining of a reputation. Or if the ascetic Gotama were to ask me a question, my answer might not satisfy him, and he might say: \"That is not the right way to answer this question.\" And then the company might despise me … And if, having come into the presence of the ascetic Gotama, I were to turn away without showing myself, this company might despise me…'",
    "dn4:49": "Then Sonadanda approached the Lord, exchanged courtesies with him, and sat down to one side. Some of the Brahmins and householders made obeisance to the Lord, some exchanged courtesies with him, some saluted him with joined palms, some announced their name and clan, and some sat down to one side in silence.",
    "dn4:50": "So Sonadanda took his seat with many thoughts going through his mind: 'If I ask the ascetic Gotama a question, he might say to me: \"That, Brahmin, is not a fitting question…\" If only the ascetic Gotama would ask me a question from my own field of the Three Vedas! Then I could give him an answer that would satisfy him!'",
    "dn4:51": "And the Lord, reading his mind, thought: 'This Sonadanda is worried. Suppose I were to ask him a question from his own field as a teacher of the Three Vedas!' So he said to Sonadanda: 'By how many qualities do Brahmins recognise a Brahmin? How would one declare truthfully and without falling into falsehood: \"I am a Brahmin\"?'",
    "dn4:52": "Then Sonadanda thought: 'Now what I wanted, hoped for, desired and longed for has happened… Now I can give him an answer that will satisfy him.'",
    "dn4:53": "Straightening up, and looking round the assembly, he said: 'Reverend Gotama, there are five such qualities… What are they? A Brahmin is well-born on both the mother's and the father's side, of pure descent to the seventh generation,… he is a scholar versed in the mantras, … he is handsome, pleasing,… he is virtuous,… he is learned and wise, and is the first or second to hold the sacrificial ladle. These are the five qualities of a true Brahmin.'",
    "dn4:54": "'But if one of these five qualities were omitted, could not one be recognised as a true Brahmin, being possessed of four of these qualities?'",
    "dn4:55": "'But could not one of these four qualities be omitted, leaving three whereby one could be recognised as a true Brahmin?'",
    "dn4:56": "'But could not one of these three qualities be omitted … ?'",
    "dn4:57": "At this the Brahmins said to Sonadanda: 'Don't say that, Sonadanda don't say it! The Reverend Sonadanda is decrying appearance, the mantras and birth, he is actually adopting the ascetic Gotama's own words!'",
    "dn4:58": "Then the Lord said to the Brahmins: 'If you think the Brahmin Sonadanda is not concentrating on his task, is using wrong words, is lacking in wisdom, and is not fit to converse with the ascetic Gotama, then let him cease, and you talk to me. But if you think he is learned, speaks properly, is wise and fit to converse with the ascetic Gotama, then you cease and let him speak.'",
    "dn4:59": "Then Sonadanda said to the Lord: 'Let that be, Reverend Gotama, and be silent. I will answer in this matter.' To the Brahmins he said: 'Do not say the Reverend Sonadanda is decrying appearance… and adopting the ascetic Gotama's own words! I do not decry appearance, mantras, or birth.'",
    "dn4:60": "Now at that time Sonadanda's nephew, a young man called Angaka, was sitting in the assembly, and Sonadanda said: 'Gentlemen, do you see my nephew Angaka?' 'Yes, sir.' 'Angaka is handsome, good-looking, pleasing, of supremely fair complexion, in form and countenance like Brahmā, of no mean appearance, and there is none in this assembly his equal except the ascetic Gotama. He is a scholar…I was his mantra-teacher. He is well-born on both sides… I know his parents. But if Angaka were to take life, take what is not given, commit adultery, tell lies and drink strong drink — what would good looks, or mantras, or birth profit him? But it is because a Brahmin is virtuous,… because he is wise … : on account of these two points that he can truthfully declare: \"I am a Brahmin.\"'",
    "dn4:61": "'But, Brahmin, if one were to omit one of these two points, could one truthfully declare: \"I am a Brahmin\"?' 'No, Gotama. For wisdom is purified by morality, and morality is purified by wisdom: where one is, the other is, the moral man has wisdom and the wise man has morality, and the combination of morality and wisdom is called the highest thing in the world. Just as one hand washes the other, or one foot the other, so wisdom is purified by morality and this combination is called the highest thing in the world.'",
    "dn4:62": "But, Brahmin, what is this morality and what is this wisdom?'",
    "dn4:63": "At these words Sonadanda said: 'Excellent, Lord, excellent! It is as if someone were to set up what had been knocked down, or to point out the way to one who had got lost, or to bring an oil-lamp into a dark place, so that those with eyes could see what was there. Just so the Blessed Lord has expounded the Dhamma in various ways. And I go for refuge to the Blessed Lord Gotama, to the Dhamma and to the Saṅgha. May the Reverend Gotama accept me from this day forth as a lay-follower as long as life shall last! And may the Reverend Gotama and his order of monks accept a meal from me tomorrow!'",
    "dn4:64": "The Lord assented by silence. Then Sonadanda, seeing his assent, rose, saluted the Lord, passed by to his right and departed. As day was breaking, he caused hard and soft food to be prepared in his own home, and when it was ready he announced: 'Reverend Gotama, it is time; the meal is ready.'",
    "dn4:65": "And when the Lord had eaten and taken his hand away from the bowl, Sonadanda took a low stool and sat down to one side. Then he said to the Lord:",
    "dn4:66": "Then the Lord, having instructed Sonadanda with a talk on Dhamma, inspired him, fired him with enthusiasm and delighted him, rose from his seat and departed."
}