{
    "dn7:1": "Thus have I heard.[n.88] For some reason the last part of Sutta 6 is here repeated as a separate Sutta.Once the Lord was staying at Kosambi, in the Ghosita Park. And two wanderers, Mandissa and Jāliya, the pupil of the wooden-bowl ascetic, came to him, exchanged courtesies with him and sat down to one side. Then they said: \"How is it, friend Gotama, is the soul[n.89]Jīvaṁ:'Life-principle'.the same as the body, or is the soul one thing and the body another?\"",
    "dn7:2": "\"Friends, a Tathagata arises in the world, an Arahant, fully-enlightened Buddha, endowed with wisdom and conduct, Well-Farer, Knower of the worlds, incomparable Trainer of men to be tamed, Teacher of gods and humans, enlightened and blessed. He, having realised it by his own super-knowledge, proclaims this world with its devas, maras and Brahmas, its princes and people. He preaches the Dhamma which is lovely in its beginning, lovely in its middle, lovely in its ending, in the spirit and in the letter, and displays the fully-perfected and purified holy life.",
    "dn7:3": "'\"A disciple goes forth and practises the moralitiesSutta 2, verses 41–6. On account of his morality, he sees no danger anywhere. He experiences in himself the blameless bliss that comes from maintaining this Ariyan morality. In this way, he is perfected in morality.as Sutta 2, verses 64–74…It is as if he were freed from debt, from sickness, from bonds, from slavery, from the perils of the desert… Being thus detached from sense-desires, detached from unwholesome states, he enters and remains in the first jhāna … and so suffuses, drenches, fills and irradiates his body, that there is no spot in his entire body that is untouched by this delight and joy born of detachment. Now of one who thus knows and thus sees, is it proper to say: 'The soul is the same as the body', or 'The soul is different from the body'?\" \"It is not, friend.\"[n.190] Cf.DN 1.15. Some MSS have: 'It is, friend'.\"But I thus know and see, and I do not say that the soul is either the same as, or different from the body.\"",
    "dn7:4": "\"He knows: 'There is nothing further here.' Now of one who thus knows and thus sees, is it proper to say: 'The soul is the same as the body', or 'The soul is different from the body'?\" \"It is not, friend.\" \"But I thus know and see, and I do not say that the soul is either the same as, or different from the body.\"'",
    "dn7:5": "Thus the Lord spoke, and the two wanderers rejoiced at his words."
}