{
    "dn8:1": "Thus have I heard. Once the Lord was staying at Ujuññāya in the deer-park of Kaṇṇakatthale.[n.9] A public park in which the deer were safe from being hunted (DA).There the naked ascetic Kassapa came to him, exchanged courtesies with him, and stood to one side. Then he said:",
    "dn8:2": "'Kassapa, those who say this are not telling the truth, they slander me with lies. The situation occurs, Kassapa, that I see one practiser of mortification, and with the divine eye[n.193] Cf.DN .95.which is purified beyond the sight of humans I see him arising after death, at the breaking-up of the body, in a place of woe, a baleful state, a place of destruction, in hell. Again, I see one practiser of mortification… arising after death in a good place, a heavenly state.",
    "dn8:3": "Again, I see one who practises little austerity … arising in a state of woe … Again, I see one who practises little austerity… arising after death in a good place, a heavenly state. Since I can see as it is the arising, the destiny, the death and re-arising of those ascetics, how could I disapprove of all austerities, and censure and blame all those who lead a harsh life of self-mortification?",
    "dn8:4": "'Kassapa, there are some ascetics and Brahmins who are wise, skilled, practised in disputation, splitters of hairs, acute, who walk cleverly along the paths of views. Sometimes their views accord with mine, sometimes they do not. What they sometimes applaud, we sometimes applaud. What they sometimes do not applaud, we sometimes do not applaud; what they sometimes applaud, we sometimes do not applaud, and what they sometimes do not applaud, we sometimes applaud.",
    "dn8:5": "What we sometimes applaud, they sometimes applaud, what we sometimes do not applaud, they sometimes do not applaud. What we sometimes applaud, they sometimes do not applaud, and what we sometimes do not applaud, they sometimes applaud.",
    "dn8:6": "'On approaching them I say: \"In these things there is no agreement, let us leave them aside. In these things there is agreement: there let the wise take up, cross-question and criticise these matters with the teachers or with their followers, saying: 'Of those things that are unskilful[n.194]Akusala:lit. 'unskilled', i.e. unwholesome and productive of unfavourable karmic results.and reckoned as such, censurable, to be refrained from, unbefitting a Noble One, black, and reckoned as such — who is there who has completely abandoned such things and is free from them: the ascetic Gotama, or some other venerable teachers?'\"",
    "dn8:7": "'It may be that the wise… say: \"Of those things that are unskilled…the ascetic Gotama has completely freed himself, but the other reverend teachers only in part.\" In this case the wise give us the greatest share of praise.",
    "dn8:8": "'Or the wise may say: \"Of those things that are skilled and reckoned as such, blameless, to be practised, fitting for a Noble One, bright and reckoned as such, who is there who has completely mastered them — the ascetic Gotama, or some other reverend teachers?\"",
    "dn8:9": "'Or the wise may say: \"Of these things … the ascetic Gotama has completely mastered them, but the other reverend teachers only in part.\" In this case the wise give us the greatest share of praise.",
    "dn8:10–13": "As verses 5–8 but: 'the order of the ascetic Gotama's disciples, or that of the other reverend teachers.'",
    "dn8:14": "'Kassapa, there is a path, there is a course of training, whereby one who has followed it will know and see for himself: \"The ascetic Gotama speaks at the proper time, what is true, to the point[n.195] Cf.DN 1.12.— the Dhamma and the discipline.\" What is this path and this course of training? It is the Noble Eightfold Path, namely Right View, Right Thought; Right Speech, Right Action, Right Livelihood; Right Effort, Right Mindfulness, Right Concentration. This is the path whereby one may know and see for oneself: \"The ascetic Gotama speaks at the proper time, what is true, to the point — the Dhamma and the discipline.\"'",
    "dn8:15": "At this, Kassapa said to the Lord: 'Gotama, these ascetic practices of certain practisers of self-mortification are considered proper to them: a naked ascetic uses no polite restraints,[n.196] In regard to bodily functions (DA). The whole list recurs, e.g. atMN 12.42.licks his hands, does not come or stand still when requested. He does not accept food offered or prepared for him, or an invitation to a meal. He does not accept food out of the pot or pan, nor on the threshold, among the firewood or the rice-pounders, nor where two people are eating, from a pregnant or nursing woman or from one living with a man, nor from gleanings, from where a dog is standing or where flies are swarming. He eats no fish or meat and drinks no rum or spirits or fermented rice-gruel.[n.197]Thusodakaṁ:'rice-gruel', but the sense requires something fermented. RD's assertion to the contrary is not supported by the Sub-Commentary. BB, atMN 12.42, renders it 'fermented brew'.He is a one-house man[n.198] One who accepts alms from only one house.or a one-piece man,[n.199] One who takes only one portion.a two-house man, a seven-piece man or a seven-house man. He exists on one, two or seven little offerings, eats only once a day, once in two days, once in seven days. He takes to eating rice only twice a month. These are considered proper practices.",
    "dn8:16": "'Or a man becomes a herb-eater, a millet-eater, a raw-rice-eater, a wild-rice-eater, an eater of water-plants, of rice-husk-powder, of rice-scum, of the flowers of oil-seeds, grass or cow-dung, of forest roots and fruits, eating windfalls",
    "dn8:17": "He wears coarse hemp or mixed material, shrouds from corpses, rags from the dust-heap, garments of bark-fibre, antelope-skins, grass, bark, shavings, blankets of human hair[n.200] Like Ajita KesakambaliDN 2.24.or horse-hair, the wings of owls. He is a plucker-out of hair and beard, devoted to this practice; he is a covered-thom man, making his bed on them, sleeping alone in a garment of wet mud, living in the open air, accepting whatever seat is offered, living on filth and addicted to the practice, one who drinks no water[n.201]Apānaka.Probably one wholike the Jainsdoes not drink cold water because of the living beings in it.and is addicted to the practice, or he dwells intent on the practice of going to bathe three times before evening.'[n.202] In order to wash away his sin: cf. the story of SangaravaSN 7.21.",
    "dn8:18–20": "'Kassapa, a practiser of self-mortification may do all these things, but if his morality, his heart and his wisdom are not developed and brought to realisation, then indeed he is still far from being an ascetic or a Brahmin. But, Kassapa, when a monk develops non-enmity, non-ill-will and a heart full of loving-kindness and, abandoning the corruptions, realises and dwells in the uncorrupted deliverance of mind, the deliverance through wisdom, having realised it in this very life by his own insight, then, Kassapa, that monk is termed an ascetic and a Brahmin.'[n.203] The passage: 'but if his morality…' recurs, first after 'twice a month', then after 'windfalls', and in conclusion. As RD points out, the Buddha is using the terms 'ascetic' and 'Brahmin' in his own sense, not Kassapa's.",
    "dn8:21": "At this Kassapa said to the Lord: 'Reverend Gotama, it is hard to be an ascetic, it is hard to be a Brahmin.'",
    "dn8:22–29": "'So they say in the world, Kassapa: \"It is hard to be an ascetic, it is hard to be a Brahmin.\" If a naked ascetic were to do all these things…as verse 14, and if this were the measure and practice of the difficulty, the great difficulty, of being an ascetic or Brahmin, it would not be right to say: \"It is hard to be an ascetic, it is hard to be a Brahmin\", because any householder or householder's son — even the slave-girl who draws water — could do this saying: \"Well, I will go naked…\"as verse 14. But, Kassapa, because there is a very different kind of asceticism beside this, therefore it is right to say: \"It is hard to be an ascetic, it is hard to be a Brahmin.\"",
    "dn8:30–38": "At this Kassapa said to the Lord: 'Reverend Gotama, it is hard to understand an ascetic, it is hard to understand a Brahmin.'",
    "dn8:39–44": "Then Kassapa said to the Lord: 'Reverend Gotama, what then is the development of morality, of the heart, and of wisdom?'",
    "dn8:45": "'Kassapa, there are some ascetics and Brahmins who preach morality. They praise morality in various ways. But as regards the highest Ariyan morality, Kassapa, I do not see any who have surpassed me in this. I am supreme in this regard, in super-morality.",
    "dn8:46": "There are some ascetics and Brahmins who preach self-mortification and scrupulous austerity, which they praise in various ways. But as regards the highest Ariyan self-mortification and austerity, Kassapa, I do not see any who have surpassed me in this. I am supreme in this regard, in super-austerity.",
    "dn8:47": "There are some ascetics and Brahmins who preach wisdom. They praise wisdom in various ways. But as regards the highest Ariyan wisdom, Kassapa, I do not see any who have surpassed me in this. I am supreme in this regard, in super-wisdom. There are some ascetics and Brahmins who preach liberation.",
    "dn8:48": "They praise liberation in various ways. But as regards the highest Ariyan liberation, Kassapa, I do not see any who have surpassed me in this. I am supreme in this regard, in super-liberation.",
    "dn8:49": "'Kassapa, it may be that wanderers of other sects will say: \"The ascetic Gotama roars his lion's roar, but only in empty places, not in company.\" They should be told that this is not true: \"The ascetic Gotama roars his lion's roar, and he roars it in company.\"",
    "dn8:50": "Or they may say: \"The ascetic Gotama roars his lion's roar, and in company, but he does so without confidence.\" They should be told that this is not true: \"The ascetic Gotama roars his lion's roar, in company and confidently.\"",
    "dn8:51": "Or they may say: \"The ascetic Gotama roars his lion's roar, and in company, and confidently, but they do not question him.\" They should be told that this is not true: \"The ascetic Gotama roars his lion's roar… and they question him.\" Or they may say: \"… and they question him, but he does not answer.\" … Or they may say: \"… he answers, but he does not win them over with his answers.\" … Or they may say: \"… but they don't find it pleasing.\" … Or they may say: \"… but they are not satisfied with what they have heard.\" … Or they may say: \"… but they don't behave as if they were satisfied.\" … Or they may say: \"… but they are not on the path of truth.\" … Or they may say: \"… but they are not satisfied with the practice.\" They should be told that this is not true: \"The ascetic Gotama roars his lion's roar, in company and confidently, they question him and he answers, he wins them over with his answers, they find it pleasing and are satisfied with what they have heard, they behave as if they were satisfied, they are on the path of truth, and they are satisfied with the practice.\" That, Kassapa, is what they should be told.",
    "dn8:52": "'Once, Kassapa, I was staying at Rajagaha at the Vultures' Peak. And a certain practiser of mortification called Nigrodha consulted me about the practice of austerity.[n.204] SeeDN 25.And he was delighted with my explanation beyond all measure.' 'Lord, who on hearing Dhamma from you would fail to be delighted beyond all measure? I am delighted beyond all measure. Excellent, Lord, excellent! It is as if someone were to set up what had been knocked down, or to point out the way to one who had got lost, or to bring an oil-lamp into a dark place, so that those with eyes could see what was there. Just so the Blessed Lord has expounded the Dhamma in various ways. Lord, may I receive the going-forth at the Lord's hands, may I receive ordination!'",
    "dn8:53": "'Kassapa, whoever has formerly belonged to another sect and wishes for the going-forth or ordination in this Dhamma and discipline must wait four months, and at the end of four months' probation, the monks who are established in mind will give him the going-forth and the monastic ordination. But there can be a distinction of persons in this.' 'Lord, if such is the case, I will even wait four years, and at the end of that time let the monks give me the going-forth and the monastic ordination.'",
    "dn8:54": "Then Kassapa received the going-forth from the Lord himself, and the monastic ordination. And the newly-ordained Venerable Kassapa, alone, secluded, unwearying, zealous and resolute, in a short time attained that for which young men of good birth go forth from the household life into homelessness, that unexcelled culmination of the holy life, having realised it here and now by his own super-knowledge and dwelt therein knowing: 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is nothing further here.'"
}