{
    "dn9:1": "Thus have I heard. Once the Lord was staying at Sāvatthī, in Jeta's grove, in Anāthapiṇḍika's park. And at that time the wanderer Poṭṭhapāda was at the debating-hall near the Tinduka tree, in the single-halled park of Queen Mallikā,[n.205] The principal queen of King Pasenadi of Kosala. She and the king were both devoted followers of the Buddha. The park had been given by the famous benefactor Anāthapiṇḍika.with a large crowd of about three hundred wanderers.",
    "dn9:2": "Then the Lord, rising early, took his robe and bowl and went to Sāvatthi for alms. But it occurred to him: 'It is too early to go to Sāvatthi for alms. Suppose I were to go to the debating-hall to see the wanderer Poṭṭhapāda?' And he did so.",
    "dn9:3": "There Poṭṭhapāda was sitting with his crowd of wanderers, all shouting and making a great commotion, indulging in various kinds of unedifying conversation, such as about kings, robbers, ministers, armies, dangers, wars, food, drink, clothes, beds, garlands, perfumes, relatives, carriages, villages, towns and cities, countries, women, heroes, street- and well-gossip, talk of the departed, desultory chat, speculations about land and sea, talk of being and non-being.",
    "dn9:4": "But Poṭṭhapāda saw the Lord coming from a distance, and so he called his followers to order, saying: 'Be quiet, gentlemen, don't make a noise, gentlemen! That ascetic Gotama is coming, and he likes quiet and speaks in praise of quiet. If he sees that this company is quiet, he will most likely want to come and visit us.' At this the wanderers fell silent.",
    "dn9:5": "Then the Lord came to Poṭṭhapāda, who said: 'Come, reverend Lord, welcome, reverend Lord! At last the reverend Lord has gone out of his way to come here. Be seated, Lord, a seat is prepared.'",
    "dn9:6": "The Lord sat down on the prepared seat, and Potthapada took a low stool and sat down to one side. The Lord said: 'Poṭṭhapāda, what were you all talking about? What conversation have I interrupted?'",
    "dn9:7": "Poṭṭhapāda replied: 'Lord, never mind the conversation we were having just now, it will not be difficult for the Lord to hear about that later. In the past few days, Lord, the discussion among the ascetics and Brahmins of various schools, sitting together and meeting in the debating-hall, has concerned the higher extinction of consciousness,[n.206]Abhisaññānirodha.'The prefix abhi qualifies notsaññā,but the whole compound, which means \"trance\"sic!. It is an expression used, not by Buddhists, but by certain wanderers'PED.and how this takes place. Some said: \"One's perceptions arise and cease without cause or condition. When they arise, one is conscious, when they cease, then one is unconscious.\" That is how they explained it.",
    "dn9:8": "But somebody else said: \"No, that is not how it is. Perceptions[n.207]Saññāmeans primarily 'perception' as one of the five khandhas, but here approaches the meaning of 'consciousness' as suchsee BDic. After some hesitation, I have retained the rendering 'perception' here.are a person's self, which comes and goes. When it comes, one is conscious, when it goes, one is unconscious.\"",
    "dn9:9": "Another said: \"That is not how it is. There are ascetics and Brahmins of great powers, of great influence. They draw down consciousness into a man and withdraw it. When they draw it down into him, he is conscious, when they withdraw it, he is unconscious.\"[n.208] DA saysathabbanikā'Atharva priests'can do this.",
    "dn9:10": "And another said: \"No, that is not how it is. There are deities of great powers, of great influence. They draw down consciousness into a man and withdraw it. When they draw it down into him, he is conscious, when they withdraw it, he is unconscious.\"[n.209] RD accidentally omits this passage.",
    "dn9:11": "It was in this connection that I thought of the Lord: \"Ah, surely, the Blessed Lord, the Well-Farer, he is supremely skilled[n.210]Sukusala:an intensified form of kusala 'skilled'.about these matters! The Blessed Lord well understands the higher extinction of consciousness.\" What then, Lord, is this higher extinction of consciousness?'",
    "dn9:12": "'In this matter, Poṭṭhapāda, those ascetics and Brahmins who say one's perceptions arise and cease without cause or condition are totally wrong. Why is that? One's perceptions arise and cease owing to a cause and conditions. Some perceptions arise through training, and some pass away through training.'",
    "dn9:13": "'What is this training?', the Lord said. 'Potṭhapāda, a Tathāgata arises in this world an Arahant, fully-enlightened Buddha … \"When he sees that the five hindrances have been abandoned within himself, gladness arises. When he is gladdened, rapture arises. When his mind is filled with rapture, his body becomes tranquil; tranquil in body, he experiences happiness; being happy, his mind becomes concentrated … \"Quite secluded from sense pleasures, secluded from unwholesome states, he enters and dwells in the first jhāna, which is accompanied by applied and sustained thought and filled with the rapture and happiness born of seclusion. … having reached the first jhāna, he remains in it. And whatever sensations of lust that he previously had disappear. At that time there is present a true but subtle perception of delight and happiness,[n.211]Viveka-ja-pīti-sukha-sukhuma-sacca-saññā:the regular formula for the first jhana but expanded with the wordssukhuma-sacca'subtle and true'.born of detachment, and he becomes one who is conscious of this delight and happiness. In this way some perceptions arise through training, and some pass away through training. And this is that training', said the Lord.",
    "dn9:14": "'Again, a monk, with the subsiding of thinking and pondering, by gaining inner tranquillity and unity of mind, reaches and remains in the second jhāna, which is free from thinking and pondering, born of concentration, filled with delight and happiness. His former true but subtle perception of delight and happiness born of detachment vanishes. At that time there arises a true but subtle perception of delight and happiness born of concentration, and he becomes one who is conscious of this delight and happiness. In this way some perceptions arise through training, and some pass away through training.",
    "dn9:15": "'Again, after the fading away of delight he dwells in equanimity, mindful and clearly aware, and he experiences in his body that pleasant feeling of which the Noble Ones say: \"Happy dwells the man of equanimity and mindfulness\", and he reaches and remains in the third jhāna. His former true but subtle sense of delight and happiness born of concentration vanishes, and there arises at that time a true but subtle sense of equanimity and happiness, and he becomes one who is conscious of this true but subtle sense of equanimity and happiness. In this way some perceptions arise through training, and some pass away through training.",
    "dn9:16": "'Again, with the abandonment of pleasure and pain, and with the disappearance of previous joy and grief, he reaches and remains in the fourth jhana, a state beyond pleasure and pain, purified by equanimity and mindfulness. His former true but subtle sense of equanimity and happiness vanishes, and there arises a true but subtle sense of neither happiness nor unhappiness, and he becomes one who is conscious of this true but subtle sense of neither happiness nor unhappiness. In this way some perceptions arise through training, and some pass away through training.",
    "dn9:17": "'Again, by passing entirely beyond bodily sensations, by the disappearance of all sense of resistance and by non-attraction to the perception of diversity, seeing that space is infinite, he reaches and remains in the Sphere of Infinite Space. In this way some perceptions arise through training, and some pass away through training.",
    "dn9:18": "'Again, by passing entirely beyond the Sphere of Infinite Space, seeing that consciousness is infinite, he reaches and remains in the Sphere of Infinite Consciousness. In this way some perceptions arise through training, and some pass away through training.",
    "dn9:19": "'Again, by passing entirely beyond the Sphere of Infinite Consciousness, seeing that there is no thing, he reaches and remains in the Sphere of No-Thingness, and he becomes one who is conscious of this true but subtle perception of the Sphere of No-Thingness. In this way some perceptions arise through training, and some pass away through training. And this is that training', said the Lord.",
    "dn9:20": "'Potthapada, from the moment when a monk has gained this controlled perception,[n.212]Saka-saññī hoti:lit. 'becomes own-perceiving'. From the first jhana on one has some control over one's perceptions.he proceeds from stage to stage till he reaches the limit of perception. When he has reached the limit of perception it occurs to him: \"Mental activity is worse for me, lack of mental activity is better. If I were to think and imagine,[n.213]Abhisaṅkhāreyyaṁ.RD has 'fancying', with footnote: 'perhaps \"perfecting\" or \"planning out\"'. Mrs Bennett has 'manipulating'.these perceptionsthat I have attainedwould cease, and coarser perceptions would arise in me. Suppose I were not to think or imagine?\" So he neither thinks nor imagines. And then, in him, just these perceptions arise, but other, coarser perceptions do not arise. He attains cessation. And that, Poṭṭhapāda, is the way in which the cessation of perception is brought about by successive steps.",
    "dn9:21": "'What do you think, Poṭṭhapāda? Have you heard of this before?' 'No, Lord. As I understand it, the Lord has said: \"Poṭṭhapāda, from the moment when a monk has gained this controlled perception, he proceeds from stage to stage until he reaches the limit of perception… He attains cessation … and that is the way in which the cessation of perception is brought about by successive steps.\"' 'That is right, Poṭṭhapāda.'",
    "dn9:22": "'Lord, do you teach that the summit of perception is just one, or that it is many?' 'I teach it as both one and many.' 'Lord, how is it one, and how is it many?' 'According as he attains successively to the cessation of each perception, so I teach the summit of that perception: thus I teach both one summit of perception, and I also teach many.'",
    "dn9:23": "'Lord, does perception arise before knowledge, or knowledge arise before perception, or do both arise simultaneously? ' 'Perception arises first, Poṭṭhapāda, then knowledge, and from the arising of perception comes the arising of knowledge. And one knows: \"Thus conditioned, knowledge arises.\" In this way you can see how perception arises first, and then knowledge, and that from the arising of perception comes the arising of knowledge.'[n 214] DA offers alternative explanations: 1. 'Perception' = 'jhāna-perception', 'Knowledge' = 'insight-knowledge'vipassanā-ñāṇaṁ; 2. 'Perception' = 'insight-perception', 'Knowledge' = 'path-knowledge'; 3. 'Perception' = 'path-perception', 'Knowledge' = 'fruition-knowledge'(phalañāṇaṁ. He then quotes an authority as saying'Perception' is the perception of the fruition of Arahantship, and 'Knowledge' the immediately following 'reviewing-knowledge'paccavekkhaṇa-ñāṇaṁ): cf. VM 1.32, 22.19 and BDic. But in fact 'reviewing-knowledge' is said also to occur at lower stages on the enlightenment path. It is, however, this 'reviewing-knowledge' which best seems to explain just how one is supposed to know that perception arises first and then knowledge.",
    "dn9:24": "'Lord, is perception a person's self, or is perception one thing, and self another?'[n.215] RD quotes DA's comment that a village pig, even if bathed in perfumed water, garlanded and laid on the best bed, will still return to the dunghill. In the same way Potthapada still returns to the idea of a 'self'.'Well, Poṭṭhapāda, do you postulate[n.216]Paccesi'fall back on'.a self?' 'Lord, I postulate a gross self, material, composed of the four elements, and feeding on solid food.' 'But with such a gross self, Poṭṭhapāda, perception would be one thing, and the self another. You can see that in this way. Given such a gross self, certain perceptions would arise in a person, and others pass away. In this way you can see that perception must be one thing, the self another.'[n.217] Cf.DN 1.153.",
    "dn9:25": "'Lord, I postulate a mind-made self complete with all its parts, not defective in any sense-organ.'[n.218] Cf.DN 1.154.'But with such a mind-made self, perception would be one thing, and the self another…'",
    "dn9:26": "'Lord, I assume a formless self, made up of perception. '[n.219] Cf.DN 1.155. According to DA, this represents Potthapada's real opinion.'But with such a formless self, perception would be one thing, and self another…'",
    "dn9:27": "'But Lord, is it possible for me to know whether perception is a person's self, or whether perception is one thing, and self another?' 'Poṭṭhāpada, it is difficult for one of different views, a different faith, under different influences, with different pursuits and a different training to know whether these are two different things or not.'",
    "dn9:28": "'Well, Lord, if this question of self and perceptions is difficult for one like me — tell me: Is the world eternal?[n.220] These are the tenavyākatānior so-called indeterminatesbetter: 'undeclared points'or questions which the Buddha refused to answer:1–2. Is the world eternal or not?3–4. Is the world infinite or not?5–6. Is the soul(jīvaṁ)the same as the body or not?7–10. Does the Tathagata exist, not exist, both exist and not exist, neither exist nor not exist, after death?All of these are vain speculations, not conducive to enlightenment, and as stated with reference to numbers 5 and 6 inDN 6, for one who 'thus knows and thus sees' it is not proper to speculate on such things: in other words, the questions will drop away as meaningless. The same ten questions are found in various parts of the Canon, notably atMN 63with the famous analogy of the man wounded by an arrow, who refuses treatment until he has received the answers to a long string of questionsandMN 72the fire that went out; and there is a whole sectionsaṁyutta(44)in SN. It has been thought that these questions formed a sort of questionnaire among the 'wanderers' to determine a man's position. This is only possible if the word Tathāgata had a pre-Buddhist meaning, which may well be the case. See discussion by Ñāṇananda,Concept and Reality,95ff.Is only this true and the opposite false?' 'Poṭṭhapāda, I have not declared that the world is eternal and that the opposite view is false.' 'Well, Lord, is the world not eternal?' 'I have not declared that the world is not eternal…' 'Well, Lord, is the world infinite,… not infinite?…' 'I have not declared that the world is not infinite and that the opposite view is false.'",
    "dn9:29": "'Well, Lord, is the soul the same as the body, … is the soul one thing and the body another?' 'I have not declared that the soul is one thing and the body another.'",
    "dn9:30": "'Well, Lord, does the Tathāgata exist after death? Is only this true and all else false?' 'I have not declared that the Tathāgata exists after death.' 'Well, Lord, does the Tathāgata not exist after death,…both exist and not exist after death? … neither exist nor not exist after death?' 'I have not declared that the Tathāgata neither exists nor does not exist after death, and that all else is false.'",
    "dn9:31": "'But, Lord, why has the Lord not declared these things?' 'Poṭṭhāpada, that is not conducive to the purpose, not conducive to Dhamma, not the way to embark on the holy life; it does not lead to disenchantment, to dispassion, to cessation, to calm, to higher knowledge, to enlightenment, to Nibbāna. That is why I have not declared it.'",
    "dn9:32": "'But, Lord, what has the Lord declared?' 'Poṭṭhapāda, I have declared: \"This is suffering, this is the origin of suffering, this is the cessation of suffering, and this is the path leading to the cessation of suffering.\"'",
    "dn9:33": "'But, Lord, why has the Lord declared this?' 'Because, Poṭṭhapāda, this is conducive to the purpose, conducive to Dhamma, the way to embark on the holy life; it leads to disenchantment, to dispassion, to cessation, to calm, to higher knowledge, to enlightenment, to Nibbāna. That is why I have declared it.'",
    "dn9:34": "Then the wanderers, as soon as the Lord had left, reproached, sneered and jeered at Poṭṭhapāda from all sides, saying: 'Whatever the ascetic Gotama says, Poṭṭhapāda agrees with him: \"So it is, Lord, so it is, Well-Farer!\" We don't understand a word of the ascetic Gotama's whole discourse: \"Is the world eternal or not? — Is it finite or infinite? — Is the soul the same as the body or different? — Does the Tathāgata exist after death or not, or both, or neither?\"'",
    "dn9:35": "Poṭṭhapāda replied: 'I don't understand either about whether the world is eternal or not…or whether the Tathāgata exists after death or not, or both, or neither. But the ascetic Gotama teaches a true and real way of practice which is consonant with Dhamma and grounded in Dhamma. And why should not a man like me express approval of such a true and real practice, so well taught by the ascetic Gotama?'",
    "dn9:36": "Two or three days later, Citta, the son of the elephant-trainer, went with Poṭṭhāpada to see the Lord. Citta prostrated himself before the Lord and sat down to one side. Potthapada exchanged courtesies with the Lord, sat down to one side, and told him what had happened.",
    "dn9:37": "'Poṭṭhapāda, all those wanderers are blind and sightless, you alone among them are sighted. Some things I have taught and pointed out, Poṭṭhāpada, as being certain, others as being uncertain.",
    "dn9:38": "Which are the things I have pointed out as uncertain? \"The world is eternal\" I have declared to be uncertain… \"The Tathāgata exists after death …\"",
    "dn9:39": "Why? Because they are not conducive… to Nibbāna. That is why I have declared them as uncertain.",
    "dn9:40": "'But what things have I pointed out as certain? \"This is suffering, this is the origin of suffering, this is the cessation of suffering, this is the path leading to the cessation of suffering.\"",
    "dn9:41": "Why? Because they are conducive to the purpose, conducive to Dhamma, the way to embark on the holy life; they lead to disenchantment, to dispassion, to cessation, to calm, to higher knowledge, to enlightenment, to Nibbāna. That is why I have declared them as certain.",
    "dn9:42": "'Poṭṭhapāda, there are some ascetics and Brahmins who declare and believe that after death the self is entirely happy and free from disease. I approached them and asked if this was indeed what they declared and believed, and they replied: \"Yes.\" Then I said: \"Do you, friends, living in the world, know and see it as an entirely happy place?\" and they replied: \"No.\"",
    "dn9:43": "I said: \"Have you ever experienced a single night or day, or half a night or day, that was entirely happy?\" and they replied: \"No.\"",
    "dn9:44": "I said: \"Do you know a path or a practice whereby an entirely happy world might be brought about?\" and they replied: \"No.\"",
    "dn9:45": "I said: \"Have you heard the voices of deities who have been reborn in an entirely happy world, saying: 'The attainment of an entirely happy world has been well and rightly gained, and we, gentlemen, have been reborn in such a realm'?\" and they replied: \"No.\"",
    "dn9:46": "What do you think, Poṭṭhapāda? Such being the case, does not the talk of those ascetics and Brahmins turn out to be stupid?",
    "dn9:47": "'It is just as if a man were to say: \"1 am going to seek out and love the most beautiful girl in the country.\" They might say to him: \"Well, as to this most beautiful girl in the country, do you know whether she belongs to the Khattiya, the Brahmin, the merchant or the artisan class?\" and he would say: \"No.\" Then they might say: \"Well, do you know her name, her clan, whether she is tall or short or of medium height, whether she is dark or light-complexioned or sallow-skinned, or what village or town or city she comes from?\" and he would say: \"No.\" And they might say: \"Well then, you don't know or see the one you seek for and desire?\" and he would say: \"No.\"",
    "dn9:48": "Does not the talk of that man turn out to be stupid?' 'Certainly, Lord.'",
    "dn9:49–53": "'And so it is with those ascetics and Brahmins who declare and believe that after death the self is entirely happy and free from disease… Does not their talk turn out to be stupid?' 'Certainly, Lord.'",
    "dn9:54": "'It is just as if a man were to build a staircase for a palace at a crossroads. People might say to him: \"Well now, this staircase for a palace that you are building — do you know whether the palace will face east, or west, or north or south, or whether it will be high, low or of medium height?\" and he would say: \"No.\" And they might say: \"Well then, you don't know or see what kind of a palace you are building the staircase for?\" and he would say: \"No.\"",
    "dn9:55": "Don't you think that man's talk would turn out to be stupid?' 'Certainly, Lord.'",
    "dn9:56": "'Poṭṭhapāda, there are some ascetics and Brahmins who declare and believe that after death the self is entirely happy and free from disease. I approached them and asked if this was indeed what they declared and believed, and they replied: \"Yes.\" Then I said: \"Do you, friends, living in the world, know and see it as an entirely happy place?\" and they replied: \"No.\"",
    "dn9:57": "I said: \"Have you ever experienced a single night or day, or half a night or day, that was entirely happy?\" and they replied: \"No.\"",
    "dn9:58": "I said: \"Do you know a path or a practice whereby an entirely happy world might be brought about?\" and they replied: \"No.\"",
    "dn9:59": "I said: \"Have you heard the voices of deities who have been reborn in an entirely happy world, saying: 'The attainment of an entirely happy world has been well and rightly gained, and we, gentlemen, have been reborn in such a realm'?\" and they replied: \"No.\"",
    "dn9:60": "What do you think, Poṭṭhapāda? Such being the case, does not the talk of those ascetics and Brahmins turn out to be stupid?",
    "dn9:61": "'Poṭṭhapāda, there are three kinds of \"acquired self\":[n.221]Atta-paṭilābha.This is, of course, only an 'assumed' or 'presumed' self: 'the fleeting union of qualities that make up, for a time only, an unstable individuality' (RD). The word is glossed by DA asattabhāva-paṭilābha'adoptionor assumptionof selfhood'. The three kinds of 'acquired self' correspond to the three realms of Sense-Desire, of Form and of No-Form. Cf.DN 33.108andAN 4.172.the gross acquired self, the mind-made acquired self, the formless acquired self. What is the gross acquired self? It has form, is composed of the four great elements, nourished by material food. What is the mind-made self? It has form, complete with all its parts, not defective in any sense-organ. What is the formless acquired self? It is without form, and made up of perception.",
    "dn9:62": "'But I teach a doctrine for getting rid of the gross acquired self, whereby defiling mental states disappear and states tending to purification grow strong, and one gains and remains in the purity and perfection of wisdom here and now, having realised and attained it by one's own super-knowledge. Now, Poṭṭhāpada, you might think: \"Perhaps these defiling mental states might disappear…, and one might still be unhappy.\"[n.222] Doubtless alluding to the well-known fact that higher states tend to appear very boring to the worldling who has not experienced them.That is not how it should be regarded. If defiling states disappear…, nothing but happiness and delight develops, tranquillity, mindfulness and clear awareness — and that is a happy state.",
    "dn9:63": "'I also teach a doctrine for getting rid of the mind-made acquired self…as verse 40.",
    "dn9:64": "'I also teach a doctrine for getting rid of the formless acquired self…as verse 40.",
    "dn9:65": "'Poṭṭhapāda, if others ask us: \"What, friend, is this gross acquired self whose abandonment you preach … ?\" being so asked, we should reply: \"This is[n.223] 'This very one that you see'.that gross acquired self for the getting rid of which we teach a doctrine…\"",
    "dn9:66": "'If others ask us: \"What is this mind-made acquired self …?\"as verse 43.",
    "dn9:67": "'If others ask us: \"What is this formless acquired self …?\"as verse 43. What do you think, Poṭṭhapāda?",
    "dn9:68": "Does not that statement turn out to be well-founded?' 'Certainly, Lord.'",
    "dn9:69": "'It is just as if a man were to build a staircase for a palace, which was below that palace. They might say to him: \"Well now, this staircase for a palace that you are building, do you know whether the palace will face east or west, or north or south, or whether it will be high, low or of medium height?\" and he would say: \"This staircase is right under the palace.\"",
    "dn9:70": "Don't you think that man's statement would be well-founded?' 'Certainly, Lord.'",
    "dn9:71": "'In just the same way, Poṭṭhapāda, if others ask us: \"What is this gross acquired self…?\" \"What is this mind-made acquired self…?\" \"What is this formless acquired self … ?\" we reply: \"This is thisgross, mind-made, formlessacquired self for the getting rid of which we teach a doctrine, whereby defiling mental states disappear and states tending to purification grow strong, and one gains and remains in the purity and perfection of wisdom here and now, having realised and attained it by one's own super-knowledge.\"",
    "dn9:72": "Don't you think that statement is well-founded?' 'Certainly, Lord.'",
    "dn9:73": "At this, Citta, son of the elephant-trainer, said to the Lord: 'Lord, whenever the gross acquired self is present, would it be wrong to assume the existence of the mind-made acquired self, or of the formless acquired self? Does only the gross acquired self truly exist then? And similarly with the mind-made acquired self, and the formless acquired self?'",
    "dn9:74": "'Citta, whenever the gross acquired self is present, we do not at that time speak of a mind-made acquired self, we do not speak of a formless acquired self. We speak only of a gross acquired self.[n.224]Sankhaṁ gacchati:lit. 'enters the reckoning'.Whenever the mind-made acquired self is present, we speak only of a mind-made acquired self, and whenever the formless acquired self is present, we speak only of a formless acquired self.",
    "dn9:75": "'Citta, suppose they were to ask you: \"Did you exist in the past or didn't you, will you exist in the future or won't you, do you exist now or don't you?\" how would you answer?'",
    "dn9:76": "'Lord, if I were asked such a question, I would say: \"I did exist in the past, I did not not exist; I shall exist in the future, I shall not not exist; I do exist now, I do not not exist.\" That, Lord, would be my answer.'",
    "dn9:77": "'But, Citta, if they asked: \"The past acquired self that you had, is that your only true acquired self, and are the future and present ones false? Or is the one you will have in the future the only true one, and are the past and present ones false? Or is your present acquired self the only true one, and are the past and future ones false?\" how would you reply?'",
    "dn9:78": "'Lord, if they asked me these things, I would reply: \"My past acquired self was at the time my only true one, the future and present ones were false. My future acquired self will then be the only true one, the past and present ones will be false. My present acquired self is now the only true one, the past and future ones are false.\" That is how I would reply.'",
    "dn9:79": "'In just the same way, Citta, whenever the gross acquired self is present, we do not at that time speak of a mind-made acquired self…orof a formless acquired self.",
    "dn9:80": "'In just the same way, Citta, from the cow we get milk, from the milk curds, from the curds butter, from the butter ghee, and from the ghee cream of ghee. And when there is milk we don't speak of curds, of butter, of ghee or of cream of ghee, we speak of milk; when there are curds we don't speak of butter…; when there is cream of ghee… we speak of cream of ghee.",
    "dn9:81": "And at these words Poṭṭhapāda the wanderer said to the Lord: 'Excellent, Lord, excellent! It is as if someone were to set up what had been knocked down, or to point out the way to one who had got lost, or to bring an oil-lamp into a dark place, so that those with eyes could see what was there. Just so the Blessed Lord has expounded the Dhamma in various ways. Lord, I go for refuge to the Lord, the Dhamma and the Saṅgha. May the Lord accept me as a lay-follower who has taken refuge in him from this day forth as long as life shall last!'",
    "dn9:82": "But Citta, son of the elephant-trainer, said to the Lord: 'Excellent, Lord, excellent! It is as if someone were to set up what had been knocked down, or to point out the way to one who had got lost, or to bring an oil-lamp into a dark place, so that those with eyes could see what was there. Just so the Blessed Lord has expounded the Dhamma in various ways. Lord, I go for refuge to the Lord, the Dhamma and the Saṅgha. May I, Lord, receive the going-forth at the Lord's hands, may I receive ordination!'",
    "dn9:83": "And Citta, son of the elephant-trainer, received the going-forth at the Lord's hands, and the ordination. And the newly-ordained Venerable Citta, alone, secluded, unwearying, zealous and resolute, in a short time attained to that for the sake of which young men of good birth go forth from the household life into homelessness, that unexcelled culmination of the holy life, having realised it here and now by his own super-knowledge and dwelt therein, knowing: 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is nothing further here.'"
}